

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xBC95;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC2A4;&amp;#xD504;(Lisp)&amp;#xB77C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAD00;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD574; 1959&amp;#xB144;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;-&amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;-&amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED; &amp;#xC911; &amp;#xB354; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC70;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xC5EC;&amp;#xC11C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBA38;&amp;#xAC00; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; memory leak, double free &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860;, &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xC801;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0;, &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0; &amp;#xC18C;&amp;#xBAA8;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC5B4;&amp;#xB5A4;-&amp;#xAC83;&amp;#xB4E4;&amp;#xC774;-&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;-&amp;#xCDE8;&amp;#xAE09;-&amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B4;&amp;#xB5A4;-&amp;#xAC83;&amp;#xB4E4;&amp;#xC774;-&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;-&amp;#xCDE8;&amp;#xAE09;-&amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30; &amp;#xCDE8;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30; &amp;#xCDE8;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xB354; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;* p = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
 
p = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; * &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;));&lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1&lt;/span&gt;
*p = &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;;
p = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; * &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;));&lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;2&lt;/span&gt;
*p = &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xC74C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1 &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; p&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0; p&amp;#xC5D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;2&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB193;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;&amp;#xC740; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0;&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Tracing-Garbage-Collection&#34;&gt;&lt;a href=&#34;#Tracing-Garbage-Collection&#34; class=&#34;headerlink&#34; title=&#34;Tracing Garbage Collection&#34;&gt;&lt;/a&gt;Tracing Garbage Collection&lt;/h3&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Tracing Garbage Collection&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCF5C;&amp;#xB809;&amp;#xC158; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xBA70;Tracing&amp;#xC774; &amp;#xBD99;&amp;#xC740; &amp;#xAC83; &amp;#xCC98;&amp;#xB7FC; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC791;&amp;#xB3D9; &amp;#xC911; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0;, &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&lt;/code&gt;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xBA74; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Tracing Garbage Collection &amp;#xBC29;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC138;&amp;#xBD80;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xB3D9;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; mark and sweep &amp;#xAE30;&amp;#xBC95;, &amp;#xC0BC;&amp;#xC0C9; &amp;#xD45C;&amp;#xAE30; &amp;#xAE30;&amp;#xBC95;, &amp;#xAC1D;&amp;#xCCB4; &amp;#xC774;&amp;#xB3D9; &amp;#xAE30;&amp;#xBC95;, &amp;#xC138;&amp;#xB300; &amp;#xB2E8;&amp;#xC704; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Reference-Counting&#34;&gt;&lt;a href=&#34;#Reference-Counting&#34; class=&#34;headerlink&#34; title=&#34;Reference Counting&#34;&gt;&lt;/a&gt;Reference Counting&lt;/h3&gt;&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Reference Counting&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;&amp;#xD69F;&amp;#xC218; &amp;#xCC38;&amp;#xC870;&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC601;&amp;#xC5B4;&amp;#xC758; &amp;#xD574;&amp;#xC11D; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xAC01; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCC38;&amp;#xC870; &amp;#xD69F;&amp;#xC218;&amp;#xB97C; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xACFC; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB420; &amp;#xB54C; 1&amp;#xC744; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBA48;&amp;#xCD94;&amp;#xBA74; 1&amp;#xC744; &amp;#xBE7C;&amp;#xC11C; &amp;#xCC38;&amp;#xC870; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xC544;&amp;#xBB34;&amp;#xB3C4; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD574; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC21C;&amp;#xD658; &amp;#xCC38;&amp;#xC870; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC21C;&amp;#xD658; &amp;#xCC38;&amp;#xC870;&amp;#xB780; &amp;#xB3CC;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; A&amp;#xAC00; B&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; B&amp;#xAC00; A&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB450; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBAA8;&amp;#xB450; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCC38;&amp;#xC870; &amp;#xD69F;&amp;#xC218;&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD574;&amp;#xC81C;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE74;&amp;#xC6B4;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xACB0;&amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCE74;&amp;#xC6B4;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[해키피디아] Garbage Collection - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xBC95;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC2A4;&amp;#xD504;(Lisp)&amp;#xB77C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAD00;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD574; 1959&amp;#xB144;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;-&amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;-&amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED; &amp;#xC911; &amp;#xB354; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC70;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xC5EC;&amp;#xC11C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBA38;&amp;#xAC00; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; memory leak, double free &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860;, &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xC801;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0;, &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0; &amp;#xC18C;&amp;#xBAA8;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC5B4;&amp;#xB5A4;-&amp;#xAC83;&amp;#xB4E4;&amp;#xC774;-&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;-&amp;#xCDE8;&amp;#xAE09;-&amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B4;&amp;#xB5A4;-&amp;#xAC83;&amp;#xB4E4;&amp;#xC774;-&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;-&amp;#xCDE8;&amp;#xAE09;-&amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30; &amp;#xCDE8;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;?&#34;&gt;&lt;/a&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30; &amp;#xCDE8;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;&amp;#xC694;?&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xB294; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xB354; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;* p = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
 
p = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; * &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;));&lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1&lt;/span&gt;
*p = &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;;
p = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; * &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;));&lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;2&lt;/span&gt;
*p = &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xC74C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1 &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; p&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0; p&amp;#xC5D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;2&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;1&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB193;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD560;&amp;#xB2F9; &amp;#xC601;&amp;#xC5ED;&amp;#xC740; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0;&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Tracing-Garbage-Collection&#34;&gt;&lt;a href=&#34;#Tracing-Garbage-Collection&#34; class=&#34;headerlink&#34; title=&#34;Tracing Garbage Collection&#34;&gt;&lt;/a&gt;Tracing Garbage Collection&lt;/h3&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Tracing Garbage Collection&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCF5C;&amp;#xB809;&amp;#xC158; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xBA70;Tracing&amp;#xC774; &amp;#xBD99;&amp;#xC740; &amp;#xAC83; &amp;#xCC98;&amp;#xB7FC; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC791;&amp;#xB3D9; &amp;#xC911; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC870;&amp;#xC0AC;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0;, &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;&amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&lt;/code&gt;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xBA74; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Tracing Garbage Collection &amp;#xBC29;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC138;&amp;#xBD80;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xB3D9;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; mark and sweep &amp;#xAE30;&amp;#xBC95;, &amp;#xC0BC;&amp;#xC0C9; &amp;#xD45C;&amp;#xAE30; &amp;#xAE30;&amp;#xBC95;, &amp;#xAC1D;&amp;#xCCB4; &amp;#xC774;&amp;#xB3D9; &amp;#xAE30;&amp;#xBC95;, &amp;#xC138;&amp;#xB300; &amp;#xB2E8;&amp;#xC704; &amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Reference-Counting&#34;&gt;&lt;a href=&#34;#Reference-Counting&#34; class=&#34;headerlink&#34; title=&#34;Reference Counting&#34;&gt;&lt;/a&gt;Reference Counting&lt;/h3&gt;&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Reference Counting&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;&amp;#xD69F;&amp;#xC218; &amp;#xCC38;&amp;#xC870;&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC601;&amp;#xC5B4;&amp;#xC758; &amp;#xD574;&amp;#xC11D; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xAC01; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCC38;&amp;#xC870; &amp;#xD69F;&amp;#xC218;&amp;#xB97C; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xACFC; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB420; &amp;#xB54C; 1&amp;#xC744; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBA48;&amp;#xCD94;&amp;#xBA74; 1&amp;#xC744; &amp;#xBE7C;&amp;#xC11C; &amp;#xCC38;&amp;#xC870; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xC544;&amp;#xBB34;&amp;#xB3C4; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD574; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9; &amp;#xC791;&amp;#xB3D9;&amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC21C;&amp;#xD658; &amp;#xCC38;&amp;#xC870; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC21C;&amp;#xD658; &amp;#xCC38;&amp;#xC870;&amp;#xB780; &amp;#xB3CC;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; A&amp;#xAC00; B&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; B&amp;#xAC00; A&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB450; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBAA8;&amp;#xB450; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCC38;&amp;#xC870; &amp;#xD69F;&amp;#xC218;&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD574;&amp;#xC81C;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE74;&amp;#xC6B4;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xACB0;&amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCE74;&amp;#xC6B4;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/hackypedia.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/11/26/poosic/garbage-collection/">

  <title>[해키피디아] Garbage Collection - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-11-26 14:00" pubdate>
      2021년 11월 26일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      22
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[해키피디아] Garbage Collection</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC740; &#xAC04;&#xB2E8;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xAD00;&#xB9AC; &#xAE30;&#xBC95;&#xC758; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xC2A4;&#xD504;(Lisp)&#xB77C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xAD00;&#xB9AC;&#xB97C; &#xC704;&#xD574; 1959&#xB144;&#xC5D0; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC5B4;&#xB5BB;&#xAC8C;-&#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;"><a href="#&#xC5B4;&#xB5BB;&#xAC8C;-&#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;" class="headerlink" title="&#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;?"></a>&#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;?</h3><p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC740; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED; &#xC911; &#xB354; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xC601;&#xC5ED;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xC5EC;&#xC11C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xD574;&#xC81C;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xAD00;&#xB9AC;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;! &#xADF8;&#xB798;&#xC11C; memory leak, double free &#xC640; &#xAC19;&#xC740; &#xC5EC;&#xB7EC; &#xBC84;&#xADF8;&#xB97C; &#xBC29;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860;, &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC5D0; &#xB300;&#xD55C; &#xCD94;&#xC801;&#xC5D0; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC2DC;&#xAC04;&#xACFC; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC0AC;&#xC6A9;&#xB418;&#xACE0;, &#xADF8;&#xB85C; &#xC778;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558; &#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0; &#xC18C;&#xBAA8;&#xB418;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC608;&#xCE21;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xB3C4; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC5B4;&#xB5A4;-&#xAC83;&#xB4E4;&#xC774;-&#xC4F0;&#xB808;&#xAE30;-&#xCDE8;&#xAE09;-&#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;"><a href="#&#xC5B4;&#xB5A4;-&#xAC83;&#xB4E4;&#xC774;-&#xC4F0;&#xB808;&#xAE30;-&#xCDE8;&#xAE09;-&#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;" class="headerlink" title="&#xC5B4;&#xB5A4; &#xAC83;&#xB4E4;&#xC774; &#xC4F0;&#xB808;&#xAE30; &#xCDE8;&#xAE09; &#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;?"></a>&#xC5B4;&#xB5A4; &#xAC83;&#xB4E4;&#xC774; &#xC4F0;&#xB808;&#xAE30; &#xCDE8;&#xAE09; &#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;?</h3><p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xAC00;&#xBE44;&#xC9C0;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xAC83;&#xB4E4;&#xC740; &#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB2E4;&#xC2DC;&#xD53C; &#xB354; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xB97C; &#xD1B5;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">int</span>* p = <span class="hljs-number">0</span>;
 
p = (<span class="hljs-keyword">int</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-number">1</span> * <span class="hljs-keyword">sizeof</span>(<span class="hljs-keyword">int</span>));<span class="hljs-comment">//&#xD560;&#xB2F9; &#xC601;&#xC5ED;1</span>
*p = <span class="hljs-number">4</span>;
p = (<span class="hljs-keyword">int</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-number">1</span> * <span class="hljs-keyword">sizeof</span>(<span class="hljs-keyword">int</span>));<span class="hljs-comment">//&#xD560;&#xB2F9; &#xC601;&#xC5ED;2</span>
*p = <span class="hljs-number">5</span>;</code></pre>
<p>&#xC704;&#xC758; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xCC98;&#xC74C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;1 &#xC8FC;&#xC18C;&#xB97C; &#xD3EC;&#xC778;&#xD130; p&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xC8FC;&#xACE0; p&#xC5D0; &#xADF8;&#xB300;&#xB85C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;2&#xC758; &#xC2DC;&#xC791;&#xC8FC;&#xC18C;&#xB97C; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;1&#xC758; &#xC8FC;&#xC18C;&#xB294; &#xB2E4;&#xC2DC; &#xCC3E;&#xC544;&#xC11C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p>&#xC548;&#xD0C0;&#xAE5D;&#xAC8C;&#xB3C4; &#xC704;&#xCC98;&#xB7FC; &#xD560;&#xB2F9; &#xC601;&#xC5ED;&#xC758; &#xC2DC;&#xC791;&#xC8FC;&#xC18C;&#xB97C; &#xB530;&#xB85C; &#xC800;&#xC7A5;&#xD574;&#xB193;&#xC9C0; &#xC54A;&#xB294; &#xD55C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC5C6;&#xC5B4;&#xC9C4; &#xD560;&#xB2F9; &#xC601;&#xC5ED;&#xC740; &#xB2E4;&#xC2DC; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xB4E4;&#xC744; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xAC00;&#xBE44;&#xC9C0;&#xB85C; &#xCDE8;&#xAE09;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="Tracing-Garbage-Collection"><a href="#Tracing-Garbage-Collection" class="headerlink" title="Tracing Garbage Collection"></a>Tracing Garbage Collection</h3><p>&#xCCAB; &#xBC88;&#xC9F8; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; Tracing Garbage Collection&#xC785;&#xB2C8;&#xB2E4;. &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC00;&#xBE44;&#xC9C0; &#xCF5C;&#xB809;&#xC158; &#xC791;&#xB3D9;&#xBC29;&#xBC95;&#xC774;&#xBA70;Tracing&#xC774; &#xBD99;&#xC740; &#xAC83; &#xCC98;&#xB7FC; &#xCD94;&#xC801;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC740; &#xD2B9;&#xC815;&#xD55C; &#xD0C0;&#xC774;&#xBC0D;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC791;&#xB3D9; &#xC911; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC870;&#xC0AC;&#xD558;&#xC5EC; &#xD604;&#xC7AC; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0;, &#xBD88;&#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD1B5;&#xD574; &#xCD94;&#xC801;&#xD558;&#xC5EC; <code>&#xC4F0;&#xB808;&#xAE30;</code>&#xB85C; &#xD310;&#xB2E8;&#xB418;&#xBA74; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9; &#xD574;&#xC81C;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>Tracing Garbage Collection &#xBC29;&#xC2DD;&#xB3C4; &#xC138;&#xBD80;&#xC801;&#xC778; &#xC791;&#xB3D9;&#xC5D0; &#xB530;&#xB77C; mark and sweep &#xAE30;&#xBC95;, &#xC0BC;&#xC0C9; &#xD45C;&#xAE30; &#xAE30;&#xBC95;, &#xAC1D;&#xCCB4; &#xC774;&#xB3D9; &#xAE30;&#xBC95;, &#xC138;&#xB300; &#xB2E8;&#xC704; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158; &#xAE30;&#xBC95;&#xC73C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;.</p>
<h3 id="Reference-Counting"><a href="#Reference-Counting" class="headerlink" title="Reference Counting"></a>Reference Counting</h3><p>&#xB450; &#xBC88;&#xC9F8; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; Reference Counting&#xC785;&#xB2C8;&#xB2E4;. <code>&#xD69F;&#xC218; &#xCC38;&#xC870;</code>&#xB77C;&#xB294; &#xC601;&#xC5B4;&#xC758; &#xD574;&#xC11D; &#xADF8;&#xB300;&#xB85C; &#xAC01; &#xAC1D;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xCC38;&#xC870; &#xD69F;&#xC218;&#xB97C; &#xCE74;&#xC6B4;&#xD2B8;&#xD558;&#xC5EC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xACFC; &#xBD88;&#xAC00;&#xB2A5;&#xC744; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774;&#xC5D0;&#xC694;. &#xD55C; &#xAC1D;&#xCCB4;&#xAC00; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB420; &#xB54C; 1&#xC744; &#xB354;&#xD558;&#xACE0; &#xCC38;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBA48;&#xCD94;&#xBA74; 1&#xC744; &#xBE7C;&#xC11C; &#xCC38;&#xC870; &#xCE74;&#xC6B4;&#xD2B8;&#xAC00; 0&#xC774; &#xB418;&#xBA74; &#xC544;&#xBB34;&#xB3C4; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xD310;&#xB2E8;&#xD574; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC774; &#xC774;&#xB807;&#xAC8C; &#xAC04;&#xB2E8;&#xD558;&#xB2E4; &#xBCF4;&#xB2C8; &#xAD6C;&#xD604;&#xB3C4; &#xB9E4;&#xC6B0; &#xAC04;&#xB2E8;&#xD574; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; &#xC21C;&#xD658; &#xCC38;&#xC870; &#xBB38;&#xC81C;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;! &#xC21C;&#xD658; &#xCC38;&#xC870;&#xB780; &#xB3CC;&#xACE0; &#xB3CC;&#xC544; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC744; &#xCC38;&#xC870;&#xD558;&#xAC8C; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; A&#xAC00; B&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; B&#xAC00; A&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xB450; &#xBA54;&#xBAA8;&#xB9AC; &#xBAA8;&#xB450; &#xC811;&#xADFC;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC9C0;&#xB9CC;, &#xCC38;&#xC870; &#xD69F;&#xC218;&#xAC00; 0&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xC544; &#xD574;&#xC81C;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xCE74;&#xC6B4;&#xD305;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xD574;&#xACB0;&#xB420; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC; &#xADF8;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xD574;&#xC81C;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xCC38;&#xC870;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xCE74;&#xC6B4;&#xD305;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Hackypedia/">Hackypedia</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/poosic/">poosic</a>
                  
                  <a class="hover-with-bg" href="/tags/garbage-collection/">garbage collection</a>
                  
                  <a class="hover-with-bg" href="/tags/lisp/">lisp</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_poosic.jpg" srcset="/img/loading.gif" alt="poosic">
                  </div>

                  <div class="link-text">
                    <div class="link-title">poosic</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/poosic">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/11/28/fabu1ous/write-null/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Translation] HackSys Extreme Vulnerable Driver — Arbitrary Write NULL (New Solution)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/11/25/l0ch/2021-11-25/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-1969: Information leak in Qualcomm npu driver </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/11/26/poosic/garbage-collection/';
        this.page.identifier = '/2021/11/26/poosic/garbage-collection/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[해키피디아] Garbage Collection&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
