

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xB4E4;&amp;#xACE0; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC; ghidra &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589; + &amp;#xD559;&amp;#xAD50; &amp;#xACFC;&amp;#xC81C; + &amp;#xADF8; &amp;#xC678;&amp;#xC758; &amp;#xAC1C;&amp;#xC778; &amp;#xC0AC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB358; &amp;#xAE00;&amp;#xC744; &amp;#xC880; &amp;#xBBF8;&amp;#xB904;&amp;#xB194;&amp;#xC11C; &amp;#xC880; &amp;#xC81C; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xD658;&amp;#xAE30;&amp;#xC2DC;&amp;#xD0AC; &amp;#xACB8; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xBC88;&amp;#xC5ED;&amp;#xC744; &amp;#xCAD9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC720;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xC548; &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xB78C;&amp;#xD55C;&amp;#xD14C;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9C4; &amp;#xC9C0;&amp;#xB294; &amp;#xAF64; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;! &amp;#xD30C;&amp;#xD2B8; 1 &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB108;&amp;#xBB34; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xC8FC;&amp;#xB97C; &amp;#xC774;&amp;#xB8E8;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCBC;&amp;#xC6B4; &amp;#xB9C8;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;(?) &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC740; &amp;#xB298;&amp;#x2026;&amp;#x314E;&amp;#x314E; &amp;#xC758;&amp;#xC5ED;&amp;#xACFC; &amp;#xC624;&amp;#xC5ED;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC9C0;&amp;#xC801;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;hr&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://infosecwriteups.com/architecture-of-a-ransomware-1-2-1b9fee757fcb&#34;&gt;Architecture of a ransomware (1/2)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;COVID-19&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9; &amp;#xC5C5;&amp;#xBB34;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD568;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xB300;&amp;#xC751;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC774; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC554;&amp;#xD638; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xB9C9;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xAE38; &amp;#xBC14;&amp;#xB780;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xAC00;&amp;#xC7A5; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xBCF8;-&amp;#xC6D0;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xBCF8;-&amp;#xC6D0;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC774;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2A4;&amp;#xC2A4;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; reference&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xB2E4;. &amp;#xD55C; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. zip &amp;#xD30C;&amp;#xC77C;&amp;#xC640; office &amp;#xBB38;&amp;#xC11C; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; password&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; password&amp;#xAC00; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6CC;&amp;#xD558;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD2B9;&amp;#xC815; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;secret key&amp;#xC640; public key&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBD24;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB984;&amp;#xCC98;&amp;#xB7FC; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xAC8C; public &amp;#xD558;&amp;#xAC70;&amp;#xB098; secret &amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xB294; &amp;#xD0A4;&amp;#xC774;&amp;#xB2E4;. &amp;#xB204;&amp;#xAD6C;&amp;#xB098; public key&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; secret key&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB9CC;&amp;#xC774; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; secret key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xC758; public key&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD589;&amp;#xC704;&amp;#xB97C; signing&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xBA70; &amp;#xBE44;&amp;#xBC00; &amp;#xBAA9;&amp;#xC801;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B8; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xAD00;&amp;#xB828;-&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34;&gt;&lt;a href=&#34;#&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xAD00;&amp;#xB828;-&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34;&gt;&lt;/a&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&lt;/h1&gt;&lt;p&gt;regular infection&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;. &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBCA1;&amp;#xD130;(&amp;#xD53C;&amp;#xC2F1;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xB4F1;) &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xB97C; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C;, &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB9CC; &amp;#xC798; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xBA74; victim&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB85C;&amp;#xC11C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xB2E4;&amp;#xB978; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; victim&amp;#xC774; &amp;#xC9C0;&amp;#xBD88;&amp;#xD588;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xD0A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD0A4;&amp;#xB97C; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB529;(&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC548; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB2E4;)&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xBC29;&amp;#xBC95;(intercept &amp;#xB2F9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB04A;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xD0A4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;)&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &lt;a href=&#34;https://www.computerworld.com/article/2489311/cryptodefense-ransomware-leaves-decryption-key-accessible.html&#34;&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; CryptoDefense&amp;#xC758; &amp;#xBCC0;&amp;#xC885;&lt;/a&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C; &amp;#xD6C4; victim&amp;#xC758; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB0A8;&amp;#xAE30;&amp;#xB294; &amp;#xBC14;&amp;#xB78C;&amp;#xC5D0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; key pair&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xD6C4; public key&amp;#xB97C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574;&amp;#xC11C; &amp;#xB290;&amp;#xB9AC;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; victim&amp;#xC774; &amp;#xC54C;&amp;#xC544;&amp;#xCC28;&amp;#xB9AC;&amp;#xACE0; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xAEBC;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;?&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC;-&amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC;-&amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; public/private key&amp;#xB3C4; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; public key&amp;#xB97C; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; infection&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB294; &amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; public key&amp;#xB85C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;(&amp;#xBB3C;&amp;#xB860; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;/&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC758; &amp;#xD3C9;&amp;#xBB38; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB294; &amp;#xC5C6;&amp;#xC564;&amp;#xB2E4;). &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB294; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Key-re-utilization-chosen-plaintext-attack&#34;&gt;&lt;a href=&#34;#Key-re-utilization-chosen-plaintext-attack&#34; class=&#34;headerlink&#34; title=&#34;Key re utilization / chosen plaintext attack&#34;&gt;&lt;/a&gt;Key re utilization / chosen plaintext attack&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://simple.wikipedia.org/wiki/Chosen-plaintext_attack&#34;&gt;Chosen plaintext attack&lt;/a&gt;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC804; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xB9CE;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xACF5;&amp;#xACA9;&amp;#xC774;&amp;#xB2E4;. &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &lt;a href=&#34;https://blog.checkpoint.com/2014/08/27/hacking-the-hacker/&#34;&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; DirCrypt&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB2E4;&lt;/a&gt;. &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAD6C;&amp;#xD604;&amp;#xACFC; key &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB294; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; public key&amp;#xB85C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xB984; + &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; public key&amp;#xAC00; &amp;#xC801;&amp;#xD78C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; private key&amp;#xB85C; &amp;#xAC01; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Technical note: &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; randomized initialization vector(IV)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; AES-256&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC2E4;&amp;#xC218;&amp;#xD558;&amp;#xBA74; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://stackoverflow.com/questions/7932061/is-the-result-of-a-rsa-encryption-guaranteed-to-be-random/7933071#7933071&#34;&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; randomize &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; RSA &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&lt;/a&gt;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC758; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;:&lt;br&gt;a) RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xAC83;&amp;#xC740; AES &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xBFD0;&amp;#xC774;&amp;#xBA70; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;br&gt;b) &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; randomziation&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding&#34;&gt;Optimal asymmetric encryption padding&lt;/a&gt;&amp;#xACFC; &amp;#xACB0;&amp;#xD569;&amp;#xB41C; RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC624;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xB4DD;&amp;#xC740; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xB9CC; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB4E0; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC18D;&amp;#xB3C4;-&amp;#xACE0;&amp;#xB824;&#34;&gt;&lt;a href=&#34;#&amp;#xC18D;&amp;#xB3C4;-&amp;#xACE0;&amp;#xB824;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC18D;&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&#34;&gt;&lt;/a&gt;&amp;#xC18D;&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xCF1C; &amp;#xCF54;&amp;#xB529;&amp;#xD55C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB9CC;&amp;#xC871;&amp;#xC2A4;&amp;#xB7FD;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD0A4;(AES-256)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xCD08;&amp;#xAE30; &amp;#xBCA4;&amp;#xCE58;&amp;#xB9C8;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; 1&amp;#xBD84;&amp;#xC5D0; 1GB &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB098;&amp;#xC654;&amp;#xB2E4;. &amp;#xC774; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; victim&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xACE0;, &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; VM&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; 1TB&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294;&amp;#xB370; 16&amp;#xBD84;&amp;#xC774; &amp;#xAC78;&amp;#xB838;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xB300;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBA87; &amp;#xAE30;&amp;#xAC00;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCD08; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560;&amp;#xAE4C;? &amp;#xC815;&amp;#xB2F5;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;(file structure)&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC640; initial bytes&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD574;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; 5MB&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2A8; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. txt/ascii &amp;#xD30C;&amp;#xC77C; &amp;#xAC19;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;a href=&#34;https://linux.die.net/man/1/strings&#34;&gt;strings&lt;/a&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7F0; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; 2kb&amp;#xB97C; &amp;#xB118;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; victim&amp;#xC5D0;&amp;#xAC8C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBB38;&amp;#xC11C;, &amp;#xC0AC;&amp;#xC9C4;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;&amp;#xC774;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; &amp;#xB0B4;&amp;#xC6A9; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xACE0; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC774;&amp;#xBA70; &amp;#xB05D; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; 2&amp;#xAC1C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Initalization vector: AES&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; initialization vector&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Encrypted decryption key: &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; text &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xC900;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#x201D;&amp;#xC758; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC810;&amp;#xC740; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC9C0;&amp;#xC6B0;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; 500gb MySQL &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xAC19;&amp;#xC740; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xB514;&amp;#xC790;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; victim&amp;#xC774; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD0A4;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; process&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;(&amp;#xD55C; &amp;#xBA85;&amp;#xC774; ransom&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xACE0; key&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xBA74; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBC29;&amp;#xC9C0;&amp;#xD574;&amp;#xC57C;&amp;#xD55C;&amp;#xB2E4;). &amp;#xAC01; victim&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB098;&amp;#xC05C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xD300;&amp;#xB4E4;&amp;#xC774; &amp;#xC774;&amp;#xC804; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAC10;&amp;#xC5FC; &amp;#xBC1C;&amp;#xC0DD;/&amp;#xD655;&amp;#xC0B0;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; ssh-keygen&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;ssh-keygen -b &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt; -m pem -f pem&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; pem &amp;#xD3EC;&amp;#xB9F7;&amp;#xC73C;&amp;#xB85C; public(&lt;code&gt;pem.pub&lt;/code&gt;)&amp;#xACFC; private key(&lt;code&gt;pem&lt;/code&gt;)&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &lt;code&gt;pem.pub&lt;/code&gt;&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD569;&amp;#xCCD0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Generating both keys&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Public key&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Private key&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xD2B8; 1&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC774;&amp;#xB2E4;. &amp;#xD30C;&amp;#xD2B8; 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC2DC;&amp;#xC5F0;&amp;#xD574; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Architecture of Ransomware Part 1 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xB4E4;&amp;#xACE0; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC; ghidra &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589; + &amp;#xD559;&amp;#xAD50; &amp;#xACFC;&amp;#xC81C; + &amp;#xADF8; &amp;#xC678;&amp;#xC758; &amp;#xAC1C;&amp;#xC778; &amp;#xC0AC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB358; &amp;#xAE00;&amp;#xC744; &amp;#xC880; &amp;#xBBF8;&amp;#xB904;&amp;#xB194;&amp;#xC11C; &amp;#xC880; &amp;#xC81C; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xD658;&amp;#xAE30;&amp;#xC2DC;&amp;#xD0AC; &amp;#xACB8; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xBC88;&amp;#xC5ED;&amp;#xC744; &amp;#xCAD9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC720;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xC548; &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xB78C;&amp;#xD55C;&amp;#xD14C;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9C4; &amp;#xC9C0;&amp;#xB294; &amp;#xAF64; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;! &amp;#xD30C;&amp;#xD2B8; 1 &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB108;&amp;#xBB34; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xC8FC;&amp;#xB97C; &amp;#xC774;&amp;#xB8E8;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCBC;&amp;#xC6B4; &amp;#xB9C8;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;(?) &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC740; &amp;#xB298;&amp;#x2026;&amp;#x314E;&amp;#x314E; &amp;#xC758;&amp;#xC5ED;&amp;#xACFC; &amp;#xC624;&amp;#xC5ED;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC9C0;&amp;#xC801;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;hr&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://infosecwriteups.com/architecture-of-a-ransomware-1-2-1b9fee757fcb&#34;&gt;Architecture of a ransomware (1/2)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;COVID-19&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9; &amp;#xC5C5;&amp;#xBB34;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD568;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xB300;&amp;#xC751;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC774; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC554;&amp;#xD638; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xB9C9;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xAE38; &amp;#xBC14;&amp;#xB780;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xAC00;&amp;#xC7A5; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAE30;&amp;#xBCF8;-&amp;#xC6D0;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xBCF8;-&amp;#xC6D0;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC720;&amp;#xD615;&amp;#xC774;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2A4;&amp;#xC2A4;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; reference&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xB2E4;. &amp;#xD55C; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. zip &amp;#xD30C;&amp;#xC77C;&amp;#xC640; office &amp;#xBB38;&amp;#xC11C; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; password&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; password&amp;#xAC00; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6CC;&amp;#xD558;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD2B9;&amp;#xC815; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;secret key&amp;#xC640; public key&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBD24;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB984;&amp;#xCC98;&amp;#xB7FC; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xAC8C; public &amp;#xD558;&amp;#xAC70;&amp;#xB098; secret &amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xB294; &amp;#xD0A4;&amp;#xC774;&amp;#xB2E4;. &amp;#xB204;&amp;#xAD6C;&amp;#xB098; public key&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; secret key&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB9CC;&amp;#xC774; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; secret key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xC758; public key&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD589;&amp;#xC704;&amp;#xB97C; signing&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB974;&amp;#xBA70; &amp;#xBE44;&amp;#xBC00; &amp;#xBAA9;&amp;#xC801;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B8; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xAD00;&amp;#xB828;-&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34;&gt;&lt;a href=&#34;#&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xAD00;&amp;#xB828;-&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&#34;&gt;&lt;/a&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&lt;/h1&gt;&lt;p&gt;regular infection&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;. &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBCA1;&amp;#xD130;(&amp;#xD53C;&amp;#xC2F1;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xB4F1;) &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xB97C; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xB72C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C;, &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; key&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB9CC; &amp;#xC798; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xBA74; victim&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB85C;&amp;#xC11C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xB2E4;&amp;#xB978; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; victim&amp;#xC774; &amp;#xC9C0;&amp;#xBD88;&amp;#xD588;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xD0A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD0A4;&amp;#xB97C; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB529;(&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC548; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB2E4;)&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xBC29;&amp;#xBC95;(intercept &amp;#xB2F9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB04A;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xD0A4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;)&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &lt;a href=&#34;https://www.computerworld.com/article/2489311/cryptodefense-ransomware-leaves-decryption-key-accessible.html&#34;&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; CryptoDefense&amp;#xC758; &amp;#xBCC0;&amp;#xC885;&lt;/a&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C; &amp;#xD6C4; victim&amp;#xC758; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB0A8;&amp;#xAE30;&amp;#xB294; &amp;#xBC14;&amp;#xB78C;&amp;#xC5D0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; key pair&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xD6C4; public key&amp;#xB97C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574;&amp;#xC11C; &amp;#xB290;&amp;#xB9AC;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; victim&amp;#xC774; &amp;#xC54C;&amp;#xC544;&amp;#xCC28;&amp;#xB9AC;&amp;#xACE0; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xAEBC;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;?&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC;-&amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC;-&amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; public/private key&amp;#xB3C4; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; public key&amp;#xB97C; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; infection&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB294; &amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; public key&amp;#xB85C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;(&amp;#xBB3C;&amp;#xB860; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;/&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC758; &amp;#xD3C9;&amp;#xBB38; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB294; &amp;#xC5C6;&amp;#xC564;&amp;#xB2E4;). &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB294; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Key-re-utilization-chosen-plaintext-attack&#34;&gt;&lt;a href=&#34;#Key-re-utilization-chosen-plaintext-attack&#34; class=&#34;headerlink&#34; title=&#34;Key re utilization / chosen plaintext attack&#34;&gt;&lt;/a&gt;Key re utilization / chosen plaintext attack&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://simple.wikipedia.org/wiki/Chosen-plaintext_attack&#34;&gt;Chosen plaintext attack&lt;/a&gt;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC804; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xB9CE;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xACF5;&amp;#xACA9;&amp;#xC774;&amp;#xB2E4;. &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &lt;a href=&#34;https://blog.checkpoint.com/2014/08/27/hacking-the-hacker/&#34;&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; DirCrypt&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB2E4;&lt;/a&gt;. &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAD6C;&amp;#xD604;&amp;#xACFC; key &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC774;&amp;#xC288;&amp;#xB294; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; public key&amp;#xB85C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xB984; + &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; public key&amp;#xAC00; &amp;#xC801;&amp;#xD78C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; private key&amp;#xB85C; &amp;#xAC01; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Technical note: &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; randomized initialization vector(IV)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; AES-256&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC2E4;&amp;#xC218;&amp;#xD558;&amp;#xBA74; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://stackoverflow.com/questions/7932061/is-the-result-of-a-rsa-encryption-guaranteed-to-be-random/7933071#7933071&#34;&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; randomize &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; RSA &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&lt;/a&gt;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC758; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;:&lt;br&gt;a) RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xAC83;&amp;#xC740; AES &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xBFD0;&amp;#xC774;&amp;#xBA70; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC0D8;&amp;#xD50C;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;br&gt;b) &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; randomziation&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding&#34;&gt;Optimal asymmetric encryption padding&lt;/a&gt;&amp;#xACFC; &amp;#xACB0;&amp;#xD569;&amp;#xB41C; RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB978; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC624;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xB4DD;&amp;#xC740; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD0A4;&amp;#xB9CC; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB4E0; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC18D;&amp;#xB3C4;-&amp;#xACE0;&amp;#xB824;&#34;&gt;&lt;a href=&#34;#&amp;#xC18D;&amp;#xB3C4;-&amp;#xACE0;&amp;#xB824;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC18D;&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&#34;&gt;&lt;/a&gt;&amp;#xC18D;&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xCF1C; &amp;#xCF54;&amp;#xB529;&amp;#xD55C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB9CC;&amp;#xC871;&amp;#xC2A4;&amp;#xB7FD;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD0A4;(AES-256)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xCD08;&amp;#xAE30; &amp;#xBCA4;&amp;#xCE58;&amp;#xB9C8;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; 1&amp;#xBD84;&amp;#xC5D0; 1GB &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB098;&amp;#xC654;&amp;#xB2E4;. &amp;#xC774; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; victim&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xACE0;, &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; VM&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; 1TB&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294;&amp;#xB370; 16&amp;#xBD84;&amp;#xC774; &amp;#xAC78;&amp;#xB838;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xB300;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBA87; &amp;#xAE30;&amp;#xAC00;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCD08; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560;&amp;#xAE4C;? &amp;#xC815;&amp;#xB2F5;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;(file structure)&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC640; initial bytes&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD574;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; 5MB&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2A8; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. txt/ascii &amp;#xD30C;&amp;#xC77C; &amp;#xAC19;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;a href=&#34;https://linux.die.net/man/1/strings&#34;&gt;strings&lt;/a&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7F0; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; 2kb&amp;#xB97C; &amp;#xB118;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; victim&amp;#xC5D0;&amp;#xAC8C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBB38;&amp;#xC11C;, &amp;#xC0AC;&amp;#xC9C4;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;&amp;#xC774;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; &amp;#xB0B4;&amp;#xC6A9; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xACE0; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC774;&amp;#xBA70; &amp;#xB05D; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; 2&amp;#xAC1C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Initalization vector: AES&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xB54C; initialization vector&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Encrypted decryption key: &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; text &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xC5C6;&amp;#xC560;&amp;#xC900;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#x201D;&amp;#xC758; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC810;&amp;#xC740; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC9C0;&amp;#xC6B0;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; 500gb MySQL &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xAC19;&amp;#xC740; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xB514;&amp;#xC790;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; victim&amp;#xC774; &amp;#xAC19;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD0A4;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; process&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;(&amp;#xD55C; &amp;#xBA85;&amp;#xC774; ransom&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xACE0; key&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xBA74; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBC29;&amp;#xC9C0;&amp;#xD574;&amp;#xC57C;&amp;#xD55C;&amp;#xB2E4;). &amp;#xAC01; victim&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB098;&amp;#xC05C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774; &amp;#xAE00;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xD300;&amp;#xB4E4;&amp;#xC774; &amp;#xC774;&amp;#xC804; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAC10;&amp;#xC5FC; &amp;#xBC1C;&amp;#xC0DD;/&amp;#xD655;&amp;#xC0B0;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; ssh-keygen&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;ssh-keygen -b &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt; -m pem -f pem&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; pem &amp;#xD3EC;&amp;#xB9F7;&amp;#xC73C;&amp;#xB85C; public(&lt;code&gt;pem.pub&lt;/code&gt;)&amp;#xACFC; private key(&lt;code&gt;pem&lt;/code&gt;)&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &lt;code&gt;pem.pub&lt;/code&gt;&amp;#xB97C; &amp;#xC644;&amp;#xC131;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD569;&amp;#xCCD0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Generating both keys&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Public key&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Private key&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xD2B8; 1&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC774;&amp;#xB2E4;. &amp;#xD30C;&amp;#xD2B8; 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC2DC;&amp;#xC5F0;&amp;#xD574; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/Untitled.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/">

  <title>[Translation] Architecture of Ransomware Part 1 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-04-11 14:00" pubdate>
      2021 4 11 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      67
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Architecture of Ransomware Part 1</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! idioth&#xC785;&#xB2C8;&#xB2E4;. &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xD558;&#xB098; &#xB4E4;&#xACE0; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC; ghidra &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xC9C4;&#xD589; + &#xD559;&#xAD50; &#xACFC;&#xC81C; + &#xADF8; &#xC678;&#xC758; &#xAC1C;&#xC778; &#xC0AC;&#xC815;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xBCF4;&#xB824;&#xACE0; &#xD588;&#xB358; &#xAE00;&#xC744; &#xC880; &#xBBF8;&#xB904;&#xB194;&#xC11C; &#xC880; &#xC81C; &#xC790;&#xC2E0;&#xC744; &#xD658;&#xAE30;&#xC2DC;&#xD0AC; &#xACB8; &#xC77D;&#xC73C;&#xBA74;&#xC11C; &#xBC88;&#xC5ED;&#xC744; &#xCAD9;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xC720;&#xD589;&#xC774;&#xB77C;&#xACE0; &#xD574;&#xC57C; &#xD558;&#xB098; &#xBCF4;&#xC548; &#xD544;&#xB4DC;&#xC758; &#xC0AC;&#xB78C;&#xB4E4; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xC0AC;&#xB78C;&#xD55C;&#xD14C;&#xB3C4; &#xB9CE;&#xC774; &#xC775;&#xC219;&#xD574;&#xC9C4; &#xC9C0;&#xB294; &#xAF64; &#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xBC1C;&#xC804;&#xD558;&#xACE0; &#xC788;&#xC8E0;! &#xD30C;&#xD2B8; 1 &#xBD80;&#xBD84;&#xC740; &#xB108;&#xBB34; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC740; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xC8FC;&#xB97C; &#xC774;&#xB8E8;&#xB2C8; &#xAC00;&#xBCBC;&#xC6B4; &#xB9C8;&#xC74C;&#xC73C;&#xB85C;(?) &#xC77D;&#xC5B4;&#xC8FC;&#xC2DC;&#xBA74; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xBC88;&#xC5ED;&#xAE00;&#xC740; &#xB298;&#x2026;&#x314E;&#x314E; &#xC758;&#xC5ED;&#xACFC; &#xC624;&#xC5ED;&#xC774; &#xC874;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC798;&#xBABB;&#xB41C; &#xBD80;&#xBD84;&#xC740; &#xC9C0;&#xC801;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xAC10;&#xC0AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<hr>
<blockquote>
<p>&#xC6D0;&#xBB38; &#xAE00; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://infosecwriteups.com/architecture-of-a-ransomware-1-2-1b9fee757fcb">Architecture of a ransomware (1/2)</a></p>
</blockquote>
<p>COVID-19&#xB85C; &#xC778;&#xD574; &#xC6D0;&#xACA9; &#xC5C5;&#xBB34;&#xAC00; &#xC99D;&#xAC00;&#xD568;&#xC5D0; &#xB530;&#xB77C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC0AC;&#xAC74;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xBAA8;&#xB4E0; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; &#xACF5;&#xACA9;&#xC5D0; &#xB354; &#xB098;&#xC740; &#xB300;&#xC751;&#xC744; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xC774;&#xD574;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD558;&#xB2E4;. &#xC774; &#xAC8C;&#xC2DC;&#xAE00;&#xC774; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC758; &#xC554;&#xD638; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xB9AC;&#xBC84;&#xC2F1;&#xD558;&#xAC70;&#xB098; &#xAC10;&#xC5FC;&#xC744; &#xB9C9;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xAE38; &#xBC14;&#xB780;&#xB2E4;. </p>
<p>&#xC5B4;&#xB5A4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xB294;&#xB370; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC740; &#xC9C1;&#xC811; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD30C;&#xD2B8; 1&#xC5D0;&#xC11C;&#xB294; &#xC6D0;&#xB9AC;&#xC640; &#xAC1C;&#xB150;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xD30C;&#xD2B8; 2&#xC5D0;&#xC11C;&#xB294; &#xC6D0;&#xB9AC;&#xB97C; &#xC801;&#xC6A9;&#xC2DC;&#xCF1C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCFC; &#xAC83;&#xC774;&#xB2E4;.</p>
<h1 id="&#xAE30;&#xBCF8;-&#xC6D0;&#xB9AC;"><a href="#&#xAE30;&#xBCF8;-&#xC6D0;&#xB9AC;" class="headerlink" title="&#xAE30;&#xBCF8; &#xC6D0;&#xB9AC;"></a>&#xAE30;&#xBCF8; &#xC6D0;&#xB9AC;</h1><p>&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xAC1C;&#xB150;&#xC740; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC554;&#xD638;&#xD654; &#xC720;&#xD615;&#xC774;&#xB2E4;. &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xACE0; &#xAD1C;&#xCC2E;&#xC740; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB4E4;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;. &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC2A4;&#xC2A4;&#xB85C; &#xACF5;&#xBD80;&#xD560; &#xC218; &#xC788;&#xB294; reference&#xB97C; &#xC81C;&#xACF5;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<h2 id="&#xB300;&#xCE6D;&#xD0A4;-&#xC554;&#xD638;&#xD654;"><a href="#&#xB300;&#xCE6D;&#xD0A4;-&#xC554;&#xD638;&#xD654;" class="headerlink" title="&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;"></a>&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;</h2><p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled.png" srcset="/img/loading.gif" alt></p>
<p>&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB294; &#xB300;&#xBD80;&#xBD84; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xC775;&#xC219;&#xD558;&#xB2E4;. &#xD55C; &#xAC1C;&#xC758; &#xD0A4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xB370;&#xC774;&#xD130; &#xC554;&#xD638;&#xD654;, &#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xBAA8;&#xB450; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;. zip &#xD30C;&#xC77C;&#xC640; office &#xBB38;&#xC11C; &#xB4F1;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; &#xC554;&#xD638;&#xD654;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD55C; password&#xC640; &#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; password&#xAC00; &#xAC19;&#xB2E4;.</p>
<h2 id="&#xBE44;&#xB300;&#xCE6D;&#xD0A4;-&#xC554;&#xD638;&#xD654;"><a href="#&#xBE44;&#xB300;&#xCE6D;&#xD0A4;-&#xC554;&#xD638;&#xD654;" class="headerlink" title="&#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;"></a>&#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;</h2><p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%201.png" srcset="/img/loading.gif" alt></p>
<p>&#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB294; &#xB300;&#xBD80;&#xBD84; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xD63C;&#xB780;&#xC2A4;&#xB7EC;&#xC6CC;&#xD558;&#xB294; &#xAC1C;&#xB150;&#xC774;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD2B9;&#xC815; &#xAD6C;&#xD604;&#xC744; &#xC0DD;&#xAC01;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC27D;&#xB2E4;.</p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB294; &#xB450; &#xAC1C;&#xC758; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;. &#xBAA8;&#xB4E0; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xB2E4;&#xB978; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xBCF5;&#xD638;&#xD654;&#xB97C; &#xD574;&#xC57C; &#xD55C;&#xB2E4;.</p>
<p>secret key&#xC640; public key&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xB4E4;&#xC5B4;&#xBD24;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xC774;&#xAC83;&#xB4E4;&#xC740; &#xC774;&#xB984;&#xCC98;&#xB7FC; &#xB2E8;&#xC21C;&#xD558;&#xAC8C; public &#xD558;&#xAC70;&#xB098; secret &#xD558;&#xAC8C; &#xBCF4;&#xAD00;&#xB418;&#xB294; &#xD0A4;&#xC774;&#xB2E4;. &#xB204;&#xAD6C;&#xB098; public key&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC554;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xBCF5;&#xD638;&#xD654;&#xC5D0; secret key&#xAC00; &#xD544;&#xC694;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xD0A4;&#xC758; &#xC18C;&#xC720;&#xC790;&#xB9CC;&#xC774; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; secret key&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBAA8;&#xB4E0; &#xC815;&#xBCF4;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xD574;&#xB2F9; &#xD0A4; &#xC18C;&#xC720;&#xC790;&#xC758; public key&#xB97C; &#xD1B5;&#xD574; &#xB204;&#xAD6C;&#xB098; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD589;&#xC704;&#xB97C; signing&#xC774;&#xB77C; &#xBD80;&#xB974;&#xBA70; &#xBE44;&#xBC00; &#xBAA9;&#xC801;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xD574;&#xB2F9; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0B8; &#xC0AC;&#xB78C;&#xC744; &#xC99D;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;.</p>
<h1 id="&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;-&#xAD00;&#xB828;-&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;"><a href="#&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;-&#xAD00;&#xB828;-&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;" class="headerlink" title="&#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xAD00;&#xB828; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;"></a>&#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xAD00;&#xB828; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;</h1><p>regular infection&#xC758; &#xD750;&#xB984;&#xC744; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xC790;. &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB294; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xBCA1;&#xD130;(&#xD53C;&#xC2F1;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xCDE8;&#xC57D;&#xC810; &#xB4F1;) &#xC911; &#xD558;&#xB098;&#xC5D0; &#xC758;&#xD574; &#xC804;&#xB2EC;&#xB418;&#xACE0; &#xC2E4;&#xD589;&#xB418;&#xC5B4; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC774; &#xC554;&#xD638;&#xD654;&#xB41C;&#xB2E4;. &#xADF8; &#xD6C4; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBB34;&#xC5B8;&#xAC00;&#xB97C; &#xC9C0;&#xBD88;&#xD558;&#xB77C;&#xB294; &#xCC3D;&#xC774; &#xB72C;&#xB2E4;. &#xC774;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;?</p>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB294; &#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB97C; &#xD1B5;&#xD574; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xB294; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC774; &#xC544;&#xB2C8;&#xB2E4;. &#xAD1C;&#xCC2E;&#xC740; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB4E4;&#xC740; &#xD55C; &#xAC00;&#xC9C0; &#xC911;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB85C; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD560; &#xB54C;, &#xC5B4;&#xB518;&#xAC00;&#xC5D0; &#xC554;&#xD638;&#xD654; &#xD0A4;&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xAC83;&#xC774;&#xB2E4;. &#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xC554;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xB41C; &#xD0A4;&#xAC00; &#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB2E4;. &#xD3EC;&#xB80C;&#xC2DD; &#xBD84;&#xC11D;&#xAC00;&#xAC00; &#xC554;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xB41C; &#xD0A4;&#xB97C; &#xBCF5;&#xAD6C;&#xD558;&#xC5EC; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xBE44;&#xB300;&#xCE6D; key&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC554;&#xD638;&#xD654;&#xC640; &#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xB2E4;&#xB978; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; &#xBCF5;&#xD638;&#xD654; &#xD0A4;&#xB9CC; &#xC798; &#xBCF4;&#xD638;&#xD558;&#xBA74; victim&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC554;&#xD638;&#xD654; &#xD0A4;&#xAC00; &#xC788;&#xB294; &#xAC83;&#xC740; &#xD070; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<p>&#xD574;&#xCEE4;&#xB85C;&#xC11C; &#xACE0;&#xBBFC;&#xD574;&#xC57C; &#xD560; &#xB2E4;&#xB978; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; victim&#xC774; &#xC9C0;&#xBD88;&#xD588;&#xC744; &#xACBD;&#xC6B0;&#xB97C; &#xC704;&#xD55C; &#xD0A4;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xAC83;&#xC774;&#xB2E4;. &#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xCF54;&#xB4DC;&#xC5D0; &#xD0A4;&#xB97C; &#xD558;&#xB4DC;&#xCF54;&#xB529;(&#xB9AC;&#xBC84;&#xC2F1;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xC548; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC774;&#xB2E4;)&#xD558;&#xAC70;&#xB098; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xC11C; &#xC6B0;&#xB9AC;&#xC758; &#xC11C;&#xBC84;&#xC5D0; &#xC804;&#xC1A1;&#xD560; &#xBC29;&#xBC95;(intercept &#xB2F9;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC5F0;&#xACB0;&#xC774; &#xB04A;&#xC5B4;&#xC9C0;&#xBA74; &#xD0A4;&#xAC00; &#xC5C6;&#xC5B4;&#xC11C; &#xD0A4;&#xB97C; &#xC904; &#xC218; &#xC5C6;&#xB2E4;)&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD55C;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.computerworld.com/article/2489311/cryptodefense-ransomware-leaves-decryption-key-accessible.html">&#xC774;&#xB7F0; &#xD615;&#xD0DC;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; CryptoDefense&#xC758; &#xBCC0;&#xC885;</a>&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB41C; &#xD0A4;&#xB97C; &#xC11C;&#xBC84;&#xB85C; &#xC804;&#xC1A1;&#xD55C; &#xD6C4; victim&#xC758; &#xB85C;&#xCEEC;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xB0A8;&#xAE30;&#xB294; &#xBC14;&#xB78C;&#xC5D0; &#xBCF5;&#xD638;&#xD654;&#xAC00; &#xAC00;&#xB2A5;&#xD588;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC810;&#xC740; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD560; &#xB54C; &#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC78; &#xC54C;&#xB824;&#xC900;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; key pair&#xB97C; &#xC0DD;&#xC131;&#xD55C; &#xD6C4; public key&#xB97C; &#xCF54;&#xB4DC;&#xC5D0; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xD558;&#xC5EC; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;.</p>
<p>&#xBE44;&#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xB294; &#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xD654;&#xC5D0; &#xBE44;&#xD574;&#xC11C; &#xB290;&#xB9AC;&#xB2E4;. &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xB294; &#xAC83;&#xC774; &#xC624;&#xB798; &#xAC78;&#xB9AC;&#xBA74; victim&#xC774; &#xC54C;&#xC544;&#xCC28;&#xB9AC;&#xACE0; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xAEBC;&#xC11C; &#xC554;&#xD638;&#xD654;&#xAC00; &#xC2E4;&#xD328;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB7EC;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;?</p>
<h2 id="&#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC;-&#xC811;&#xADFC;&#xBC95;"><a href="#&#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC;-&#xC811;&#xADFC;&#xBC95;" class="headerlink" title="&#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC; &#xC811;&#xADFC;&#xBC95;"></a>&#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC; &#xC811;&#xADFC;&#xBC95;</h2><p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xC640; &#xAD00;&#xB828;&#xB41C; public/private key&#xB3C4; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;. &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xC5D0; public key&#xB97C; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xD558;&#xACE0; infection&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB294; &#xB300;&#xCE6D; &#xC554;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xB420; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;. &#xC554;&#xD638;&#xD654;&#xAC00; &#xB418;&#xBA74; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB41C; public key&#xB85C; &#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD55C;&#xB2E4;(&#xBB3C;&#xB860; &#xBA54;&#xBAA8;&#xB9AC;/&#xB514;&#xC2A4;&#xD06C;&#xC758; &#xD3C9;&#xBB38; &#xB300;&#xCE6D;&#xD0A4;&#xB294; &#xC5C6;&#xC564;&#xB2E4;). &#xC554;&#xD638;&#xD654;&#xB41C; &#xB300;&#xCE6D; &#xD0A4;&#xB294; &#xC5B4;&#xB518;&#xAC00;&#xC5D0; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB2E4;&#xB978; &#xBB38;&#xC81C;&#xAC00; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;.</p>
<h3 id="Key-re-utilization-chosen-plaintext-attack"><a href="#Key-re-utilization-chosen-plaintext-attack" class="headerlink" title="Key re utilization / chosen plaintext attack"></a>Key re utilization / chosen plaintext attack</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://simple.wikipedia.org/wiki/Chosen-plaintext_attack">Chosen plaintext attack</a>&#xC740; &#xC554;&#xD638;&#xD654; &#xC804; &#xD3C9;&#xBB38;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xACE0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xC0D8;&#xD50C;&#xC774; &#xB9CE;&#xC744; &#xACBD;&#xC6B0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xACB0;&#xACFC;&#xC5D0;&#xC11C; &#xD0A4;&#xB97C; &#xC720;&#xCD94;&#xD560; &#xC218; &#xC788;&#xB294; &#xC554;&#xD638;&#xD654; &#xACF5;&#xACA9;&#xC774;&#xB2E4;. &#xC798; &#xC54C;&#xB824;&#xC9C4; &#xD3EC;&#xB9F7;&#xC744; &#xAC00;&#xC9C4; &#xB300;&#xBD80;&#xBD84; &#xD30C;&#xC77C;&#xC758; &#xD5E4;&#xB354;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC5D0; &#xAC19;&#xC740; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC5D0;&#xC11C; &#xBCF5;&#xD638;&#xD654;&#xB420; &#xC218; &#xC788;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.checkpoint.com/2014/08/27/hacking-the-hacker/">&#xC774; &#xBB38;&#xC81C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; DirCrypt&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;</a>. &#xC798;&#xBABB;&#xB41C; &#xC554;&#xD638;&#xD654; &#xAD6C;&#xD604;&#xACFC; key &#xC7AC;&#xC0AC;&#xC6A9;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC554;&#xD638;&#xD654;&#xAC00; &#xB9AC;&#xBC84;&#xC2F1; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p>&#xC774; &#xC774;&#xC288;&#xB294; &#xAC01; &#xD30C;&#xC77C;&#xC5D0; &#xB2E4;&#xB978; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD30C;&#xC77C;&#xB9C8;&#xB2E4; &#xB300;&#xCE6D;&#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xC11C; &#xC554;&#xD638;&#xD654;&#xD558;&#xACE0; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xC5D0; &#xC788;&#xB294; public key&#xB85C; &#xD0A4;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD55C; &#xD6C4; &#xC554;&#xD638;&#xD654;&#xB41C; &#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xD3C9;&#xBB38;&#xC73C;&#xB85C; &#xB41C; &#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xC0AD;&#xC81C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xB9CE;&#xC740; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB4E4;&#xC740; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C; &#xC774;&#xB984; + &#xC554;&#xD638;&#xD654;&#xB41C; public key&#xAC00; &#xC801;&#xD78C; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;. &#xBCF5;&#xD638;&#xD654; &#xD234;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC774; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xC77D;&#xC5B4;&#xC11C; private key&#xB85C; &#xAC01; &#xD0A4;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD55C; &#xD6C4; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xB2E4;&#xB978; &#xAC83;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<blockquote>
<p>Technical note: &#xC774;&#xB7EC;&#xD55C; &#xC720;&#xD615;&#xC758; &#xACF5;&#xACA9;&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAC01; &#xD30C;&#xC77C; &#xC2A4;&#xD2B8;&#xB9BC;&#xC5D0; &#xB2E4;&#xB978; randomized initialization vector(IV)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; &#xC6B0;&#xB9AC;&#xAC00; &#xC0AC;&#xC6A9;&#xD560; AES-256&#xC5D0;&#xB294; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC;, &#xBAA8;&#xB4E0; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xAC1C;&#xB150;&#xC744; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xB2E4;. &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC2E4;&#xC218;&#xD558;&#xBA74; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF5;&#xAD6C;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xD55C;&#xB2E4;.</p>
</blockquote>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://stackoverflow.com/questions/7932061/is-the-result-of-a-rsa-encryption-guaranteed-to-be-random/7933071#7933071">&#xC774; &#xACF5;&#xACA9;&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; randomize &#xB418;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; RSA &#xC554;&#xD638;&#xD654;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xB2E4;</a>. &#xB2E4;&#xC74C;&#xC758; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC5D0; &#xC6B0;&#xB9AC;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB2E4;:<br>a) RSA&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC554;&#xD638;&#xD654;&#xD560; &#xAC83;&#xC740; AES &#xC554;&#xD638;&#xD654; &#xD0A4;&#xBFD0;&#xC774;&#xBA70; &#xBD84;&#xC11D;&#xD560; &#xC0D8;&#xD50C;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.<br>b) &#xC554;&#xD638;&#xD654;&#xC5D0; randomziation&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding">Optimal asymmetric encryption padding</a>&#xACFC; &#xACB0;&#xD569;&#xB41C; RSA&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xD30C;&#xC77C;&#xB9C8;&#xB2E4; &#xB2E4;&#xB978; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC624;&#xB294; &#xB2E4;&#xB978; &#xC774;&#xB4DD;&#xC740; &#xAC01; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD55C; &#xD6C4; &#xC554;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xC0AD;&#xC81C;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xBD84;&#xC11D;&#xAC00;&#xAC00; &#xD0A4;&#xB97C; &#xBCF5;&#xAD6C;&#xD558;&#xB824;&#xACE0; &#xD558;&#xBA74; &#xB9C8;&#xC9C0;&#xB9C9; &#xD30C;&#xC77C;&#xC5D0; &#xC0AC;&#xC6A9;&#xB41C; &#xD0A4;&#xB9CC; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC5D0; &#xAC19;&#xC740; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC554;&#xD638;&#xD654; &#xACFC;&#xC815;&#xC758; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC5D0;&#xC11C;&#xB4E0; &#xD0A4;&#xB97C; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xACE0; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h1 id="&#xC18D;&#xB3C4;-&#xACE0;&#xB824;"><a href="#&#xC18D;&#xB3C4;-&#xACE0;&#xB824;" class="headerlink" title="&#xC18D;&#xB3C4; &#xACE0;&#xB824;"></a>&#xC18D;&#xB3C4; &#xACE0;&#xB824;</h1><p>&#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xBAA8;&#xB4E0; &#xD2B9;&#xC9D5;&#xC744; &#xC801;&#xC6A9;&#xC2DC;&#xCF1C; &#xCF54;&#xB529;&#xD55C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; &#xB9CC;&#xC871;&#xC2A4;&#xB7FD;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. 32&#xBE44;&#xD2B8; &#xD0A4;(AES-256)&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xCD08;&#xAE30; &#xBCA4;&#xCE58;&#xB9C8;&#xD06C;&#xC5D0;&#xC11C; 1&#xBD84;&#xC5D0; 1GB &#xC554;&#xD638;&#xD654; &#xC18D;&#xB3C4;&#xAC00; &#xB098;&#xC654;&#xB2E4;. &#xC774; &#xC18D;&#xB3C4;&#xB294; victim&#xC758; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC758;&#xC874;&#xC131;&#xC774; &#xB192;&#xACE0;, &#xD544;&#xC790;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; VM&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD588;&#xC9C0;&#xB9CC; &#xC5EC;&#xC804;&#xD788; 1TB&#xB97C; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294;&#xB370; 16&#xBD84;&#xC774; &#xAC78;&#xB838;&#xB2E4;.</p>
<p>&#xD604;&#xB300;&#xC758; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB4E4;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xBA87; &#xAE30;&#xAC00;&#xBC14;&#xC774;&#xD2B8;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xCD08; &#xB2E8;&#xC704;&#xB85C; &#xC554;&#xD638;&#xD654;&#xD560;&#xAE4C;? &#xC815;&#xB2F5;&#xC740; &#xD30C;&#xC77C; &#xAD6C;&#xC870;(file structure)&#xC5D0; &#xC788;&#xB2E4;.</p>
<p>&#xC0AC;&#xC2E4;&#xC0C1; &#xD30C;&#xC77C;&#xC758; &#xBAA8;&#xB4E0; &#xBD80;&#xBD84;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xC554;&#xD638;&#xD654;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB2E4;. &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC5D0; &#xB530;&#xB77C; &#xD5E4;&#xB354;&#xC640; initial bytes&#xB9CC; &#xC554;&#xD638;&#xD654;&#xD574;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;. &#xC544;&#xB9C8;&#xB3C4; &#xD30C;&#xC77C;&#xC758; &#xCCAB; 5MB&#xB9CC; &#xC554;&#xD638;&#xD654;&#xD558;&#xBA74; &#xB41C;&#xB2E4;. &#xBB34;&#xC2A8; &#xC0DD;&#xAC01;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC54C;&#xACE0; &#xC788;&#xB2E4;. txt/ascii &#xD30C;&#xC77C; &#xAC19;&#xC740; &#xAC04;&#xB2E8;&#xD55C; &#xD30C;&#xC77C;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://linux.die.net/man/1/strings">strings</a> &#xAC19;&#xC740; &#xD234;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xADF8;&#xB7F0; &#xD30C;&#xC77C;&#xB4E4;&#xC740; &#xB300;&#xBD80;&#xBD84; 2kb&#xB97C; &#xB118;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; victim&#xC5D0;&#xAC8C; &#xC911;&#xC694;&#xD55C; &#xD30C;&#xC77C; &#xB300;&#xBD80;&#xBD84;&#xC740; &#xBB38;&#xC11C;, &#xC0AC;&#xC9C4;, &#xBE44;&#xB514;&#xC624;&#xC774;&#xB2E4;. &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xD3EC;&#xB80C;&#xC2DD; &#xBD84;&#xC11D;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xACE0; &#xB0B4;&#xC6A9; &#xC77C;&#xBD80;&#xB97C; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xAC1C;&#xBCC4;&#xC801;&#xC778; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xC218;&#xD589;&#xD558;&#xB294; &#xC218;&#xB3D9;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC774;&#xACE0; &#xD604;&#xC2E4;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xB2E4;.</p>
<p>&#xD30C;&#xC77C;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xBD80;&#xBD84;&#xC744; &#xBC14;&#xAFB8;&#xB294; &#xAC83;&#xB3C4; &#xC774;&#xC0C1;&#xC801;&#xC774;&#xBA70; &#xB05D; &#xBD80;&#xBD84;&#xC5D0; 2&#xAC1C;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<ol>
<li>Initalization vector: AES&#xB85C; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD560; &#xB54C; initialization vector&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;. &#xC774;&#xB294; &#xC554;&#xD638;&#xD654; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xC0DD;&#xC131;&#xB41C;&#xB2E4;.</li>
<li>Encrypted decryption key: &#xAC01; &#xD30C;&#xC77C;&#xC758; &#xB05D;&#xC5D0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xBCF5;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC758; &#xC554;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xB2F4;&#xC740; text &#xD30C;&#xC77C;&#xC758; &#xD544;&#xC694;&#xC131;&#xC744; &#xC5C6;&#xC560;&#xC900;&#xB2E4;.</li>
</ol>
<p>&#xC774;&#xB7F0; &#xAC83;&#xB4E4;&#xC774; &#xCD94;&#xAC00;&#xB41C; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C; &#xAD6C;&#xC870;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;:</p>
<p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%202.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;&#xD30C;&#xC77C;&#xC758; &#xC77C;&#xBD80;&#xB9CC; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xAC83;&#x201D;&#xC758; &#xB610; &#xB2E4;&#xB978; &#xC774;&#xC810;&#xC740; &#xC6D0;&#xBCF8; &#xD30C;&#xC77C;&#xC744; &#xC9C0;&#xC6B0;&#xACE0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC0C8; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD560; &#xD544;&#xC694; &#xC5C6;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC5D0; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xB9CC; &#xC788;&#xC73C;&#xBA74; &#xB41C;&#xB2E4;. &#xB610;&#xD55C; 500gb MySQL &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xAC19;&#xC740; &#xB9E4;&#xC6B0; &#xD070; &#xD30C;&#xC77C;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xC9C0;&#xB9C9;-&#xACE0;&#xB824;&#xC0AC;&#xD56D;"><a href="#&#xB9C8;&#xC9C0;&#xB9C9;-&#xACE0;&#xB824;&#xC0AC;&#xD56D;" class="headerlink" title="&#xB9C8;&#xC9C0;&#xB9C9; &#xACE0;&#xB824;&#xC0AC;&#xD56D;"></a>&#xB9C8;&#xC9C0;&#xB9C9; &#xACE0;&#xB824;&#xC0AC;&#xD56D;</h1><p>&#xAC01; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574; &#xC801;&#xC808;&#xD55C; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xBA74; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xBC30;&#xD3EC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xB514;&#xC790;&#xC778;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xBAA8;&#xB4E0; victim&#xC774; &#xAC19;&#xC740; &#xD0A4;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xB294; &#xAC78; &#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB9C8;&#xB2E4; &#xD0A4;&#xB97C; &#xC790;&#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xD558;&#xB294; process&#xB97C; &#xD3EC;&#xD568;&#xD574;&#xC57C; &#xD55C;&#xB2E4;(&#xD55C; &#xBA85;&#xC774; ransom&#xC744; &#xC9C0;&#xBD88;&#xD558;&#xACE0; key&#xB97C; &#xBC30;&#xD3EC;&#xD558;&#xBA74; &#xBAA8;&#xB450;&#xAC00; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC78; &#xBC29;&#xC9C0;&#xD574;&#xC57C;&#xD55C;&#xB2E4;). &#xAC01; victim&#xC5D0; &#xB300;&#xD55C; &#xD0A4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xB3C4; &#xD544;&#xC694;&#xD558;&#xB2E4;.</p>
<p>&#xC774; &#xBD80;&#xBD84;&#xC740; &#xB098;&#xC05C; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xCF54;&#xB529;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xB3C4; &#xC124;&#xBA85;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xC774; &#xAE00;&#xC758; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB294; &#xBCF4;&#xC548; &#xD300;&#xB4E4;&#xC774; &#xC774;&#xC804; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xC798;&#xBABB;&#xB418;&#xC5C8;&#xACE0;, &#xAC10;&#xC5FC; &#xBC1C;&#xC0DD;/&#xD655;&#xC0B0;&#xC744; &#xB9C9;&#xC744; &#xC218; &#xC788;&#xC74C;&#xC744; &#xBCF4;&#xC5EC;&#xC904; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xB2E8;&#xC77C; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xBE44;&#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; ssh-keygen&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<pre><code class="hljs angelscript">ssh-keygen -b <span class="hljs-number">2048</span> -m pem -f pem</code></pre>
<p>&#xC774; &#xBA85;&#xB839;&#xC5B4;&#xB294; pem &#xD3EC;&#xB9F7;&#xC73C;&#xB85C; public(<code>pem.pub</code>)&#xACFC; private key(<code>pem</code>)&#xC744; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;. <code>pem.pub</code>&#xB97C; &#xC644;&#xC131;&#xB41C; &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xACFC; &#xD569;&#xCCD0;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8;&#xD574;&#xBCF4;&#xC790;.</p>
<p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%203.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>Generating both keys</p>
</blockquote>
<p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%204.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>Public key</p>
</blockquote>
<p><img src="/2021/04/11/idioth/arch_of_ransomware_part1/Untitled%205.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>Private key</p>
</blockquote>
<p>&#xD30C;&#xD2B8; 1&#xC740; &#xC5EC;&#xAE30;&#xAE4C;&#xC9C0;&#xC774;&#xB2E4;. &#xD30C;&#xD2B8; 2&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xC6E8;&#xC5B4;&#xB97C; &#xCF54;&#xB529;&#xD558;&#xACE0; &#xC5BC;&#xB9C8;&#xB098; &#xBE60;&#xB974;&#xAC8C; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC2DC;&#xC5F0;&#xD574; &#xBCFC; &#xAC83;&#xC774;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/malware/">malware</a>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/ransomware/">ransomware</a>
                  
                  <a class="hover-with-bg" href="/tags/crypto/">crypto</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/04/12/idioth/2021-04-12/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[]         Vyveva</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/04/11/insu/2021-04-11/">
                    <span class="hidden-mobile">[] CVE-2021-26709: D-Link DSL-320B-D1 Pre-Auth Buffer Overflow</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/';
        this.page.identifier = '/2021/04/11/idioth/arch_of_ransomware_part1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Architecture of Ransomware Part 1&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
