

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview &amp;#x2190; Now&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338&lt;/a&gt; &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4;.. 3&amp;#xB144; &amp;#xB9CC;&amp;#xC5D0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6D0;&amp;#xB798; 1&amp;#xB144; &amp;#xC804;&amp;#xC5D0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC878;&amp;#xC5C5;&amp;#xACFC; &amp;#xCDE8;&amp;#xC5C5; &amp;#xC591;&amp;#xAC01;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xD0C8;&amp;#xD0C8; &amp;#xD138;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD750;&amp;#xC9C0;&amp;#xBD80;&amp;#xC9C0;&amp;#xB410;&amp;#xC5C8;&amp;#xB358; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC788;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;.. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC4F0;&amp;#xB2E4; &amp;#xB9CC; &amp;#xCD08;&amp;#xC548; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;1&amp;#xB144; &amp;#xC804; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xBCF5;&amp;#xADC0;&amp;#xAC01;&amp;#xC744; &amp;#xBCF4;&amp;#xB358; &amp;#xB354;&amp;#xBBF8;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC878;&amp;#xC5C5;&amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xC18C;&amp;#xD640;&amp;#xD788; &amp;#xD588;&amp;#xB358; &amp;#xC5C5;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xCC0C;&amp;#xC5B4;&amp;#xCC0C; &amp;#xCCAD;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC5C5;&amp;#xB3C4; &amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC7A5;&amp;#xC778; 2&amp;#xB144;&amp;#xCC28;&amp;#xAC00; &amp;#xB410;&amp;#xB294;&amp;#xB370;, &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xD2C8;&amp;#xD2C8;&amp;#xC774; &amp;#xC62C;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :)&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;2021&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026; &amp;#xC81C;&amp;#xBAA9; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBB54; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xC9C0;&amp;#xC740;&amp;#xAC74;&amp;#xC9C0; &amp;#xACFC;&amp;#xAC70;&amp;#xC758; &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC54A;&amp;#xB124;&amp;#xC694;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB108; &amp;#xADF8; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC81C;&amp;#xBAA9;&amp;#xC73C;&amp;#xB85C; 3&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#xB180;&amp;#xB9BC;&amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0;!!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC81C; &amp;#xAE00;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xB294; &amp;#xBD84;&amp;#xB3C4; &amp;#xAC00;&amp;#xB054;&amp;#xC529; &amp;#xB9CC;&amp;#xB098;&amp;#xACE0; &amp;#xB098;&amp;#xB984; &amp;#xBFCC;&amp;#xB4EF;&amp;#xD558;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &lt;del&gt;&amp;#xC81C;&amp;#xBAA9;&amp;#xB9CC; &amp;#xBE7C;&amp;#xACE0;&amp;#xC694;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;, &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; AMD Ryzen Master &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC871;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Arbitrary Physical Address R/W&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/&#34;&gt;[Research] &amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver&lt;/a&gt; &amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW&amp;#xB77C;&amp;#xC11C; mitigation&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; Token&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xBABD;&amp;#xB545; &amp;#xB36E;&amp;#xC5B4;&amp;#xC368;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC8E0;..! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; Exploit&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; mitigation &amp;#xC6B0;&amp;#xD68C; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Windows-Kernel-Mitigations&#34;&gt;&lt;a href=&#34;#Windows-Kernel-Mitigations&#34; class=&#34;headerlink&#34; title=&#34;Windows Kernel Mitigations&#34;&gt;&lt;/a&gt;Windows Kernel Mitigations&lt;/h1&gt;&lt;p&gt;Windows&amp;#xC5D4; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC740; mitigation&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC0C8;&amp;#xB86D;&amp;#xAC8C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9;&amp;#xC740; &amp;#xC810;&amp;#xC810; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0; &lt;del&gt;&amp;#xB354; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBA39;&amp;#xACE0;&amp;#xC0AC;&amp;#xB0D0;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows &amp;#xBCF4;&amp;#xC548; &amp;#xC571;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; Exploit Protection&amp;#xC744; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;mitigation&amp;#xB4E4; &amp;#xC911; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;, &amp;#xD2B9;&amp;#xD788; memory corruption&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; exploit&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; mitigation&amp;#xC778; DEP, kASLR, SMEP, kCFG&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;CET(Control-flow Enforcement Technology)&amp;#xB098; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xCD5C;&amp;#xADFC; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; VBS &amp;#xAE30;&amp;#xBC18;&amp;#xC758; KDP/HVCI/DSE &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; mitigation&amp;#xB4E4;&amp;#xACFC;, &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC84;&amp;#xC804; &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &lt;a href=&#34;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&#34;&gt;github&lt;/a&gt; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;DEP-Data-Execution-Protection&#34;&gt;&lt;a href=&#34;#DEP-Data-Execution-Protection&#34; class=&#34;headerlink&#34; title=&#34;DEP(Data Execution Protection)&#34;&gt;&lt;/a&gt;DEP(Data Execution Protection)&lt;/h3&gt;&lt;p&gt;&amp;#xCEE4;&amp;#xB110;&amp;#xC758; DEP&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; DEP&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C;, Stack/Heap&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC8E0;. &amp;#xC6B0;&amp;#xD68C;&amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; ROP&amp;#xB85C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xB2E4;&amp;#xB9CC; &amp;#xCEE4;&amp;#xB110;&amp;#xC740; DEP&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC7A5;&amp;#xD574; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; mitigation&amp;#xC774; &amp;#xB354; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC74; &amp;#xC774;&amp;#xD6C4; &amp;#xC124;&amp;#xBA85;&amp;#xD560; SMEP&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;kASLR-Kernel-Address-Layout-Rnadomization&#34;&gt;&lt;a href=&#34;#kASLR-Kernel-Address-Layout-Rnadomization&#34; class=&#34;headerlink&#34; title=&#34;kASLR(Kernel Address Layout Rnadomization)&#34;&gt;&lt;/a&gt;kASLR(Kernel Address Layout Rnadomization)&lt;/h3&gt;&lt;p&gt;kASLR &amp;#xC5ED;&amp;#xC2DC; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; ASLR&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Medium Integrity &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC544;&amp;#xC8FC;&amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; Memory Leak&amp;#xC744; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &lt;del&gt;&amp;#xAC1C;&amp;#xAFC0;&lt;/del&gt; &lt;/p&gt;
&lt;p&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; OS &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;NTSTATUS&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(WINAPI* PNtQuerySystemInformation)&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;( &lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__in SYSTEM_INFORMATION_CLASS SystemInformationClass, &lt;span class=&#34;hljs-comment&#34;&gt;// 1. &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C0;&amp;#xC785; &amp;#xC9C0;&amp;#xC815;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__inout PVOID SystemInformaton,                       &lt;span class=&#34;hljs-comment&#34;&gt;// 2. &amp;#xBC18;&amp;#xD658;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xBC84;&amp;#xD37C;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__in ULONG SystemInformationLength,                   &lt;span class=&#34;hljs-comment&#34;&gt;// 3. 2&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xD06C;&amp;#xAE30;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__out_opt PULONG ReturnLength                         &lt;span class=&#34;hljs-comment&#34;&gt;// 4. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xD06C;&amp;#xAE30;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &lt;code&gt;SystemInformatonClass&lt;/code&gt;&amp;#xB294; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xC778; &lt;code&gt;SYSYTEM_INFORMATION_CLASS&lt;/code&gt;&amp;#xC758; &amp;#xAC12; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xCFFC;&amp;#xB9AC;&amp;#xD560; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs awk&#34;&gt;typedef enum _SYSTEM_INFORMATION_CLASS {

&amp;#xA0;&amp;#xA0; SystemBasicInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPerformanceInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeOfDayInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented1,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessesAndThreadsInformation,&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCallCounts,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemConfigurationInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorTimes,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemGlobalFlag,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented2,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemModuleInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;11&lt;/span&gt; 
&amp;#xA0;&amp;#xA0; SystemLockInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented3,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented4,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented5,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;15&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemHandleInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemObjectInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;17&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPagefileInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInstructionEmulationCounts,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;19&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass1,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCacheInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPoolTagInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;22&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorStatistics,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;23&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemDpcInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented6,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLoadImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemUnloadImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;27&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeAdjustment,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented7,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;29&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented8,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented9,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;31&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCrashDumpInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemExceptionInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;33&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCrashDumpStateInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;34&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemKernelDebuggerInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemContextSwitchInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;36&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemRegistryQuotaInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;37&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLoadAndCallImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPrioritySeparation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;39&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented10,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented11,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;41&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass2,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass3,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeZoneInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;44&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLookasideInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;45&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemSetTimeSlipEvent,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCreateSession,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;47&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemDeleteSession,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass4,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;49&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemRangeStartInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemVerifierInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemAddVerifier,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemSessionProcessesInformation&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;
} SYSTEM_INFORMATION_CLASS;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;a href=&#34;https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm&#34;&gt;https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xB4E4; &amp;#xC911; &lt;code&gt;SystemModuleInformation&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &lt;code&gt;ntoskrnl&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &lt;code&gt;SystemHandleInformation&lt;/code&gt; &amp;#xC744; &amp;#xD1B5;&amp;#xD574;  Privilege Token, ImageName&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC778; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC04;&amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xC775;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; kASLR&amp;#xC740; &lt;code&gt;http.sys&lt;/code&gt;&amp;#xB098; &lt;code&gt;tcpip.sys&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC774; Remote Surface&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xB9D0;&amp;#xACE0;&amp;#xB294; &amp;#xD070; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;thumbnail.jpg&#34; alt=&#34;image2&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB9CC; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; &amp;#xC815;&amp;#xC2DD; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988;&amp;#xB41C; Windows 24H2&amp;#xBD80;&amp;#xD130;&amp;#xB294; &lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;NtQuerySystemInformation &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xADF8; &amp;#xAD8C;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC778; SeDebugPrivilege&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D;&lt;/a&gt; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; memory corruption &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD560;&amp;#xB54C; leak &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xB420; &amp;#xC218;&amp;#xB3C4;&amp;#x2026;?? &lt;del&gt;&amp;#xC544;&amp;#xB2C8; MS&amp;#xC120;&amp;#xC0DD; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8;&amp;#xC18C;&amp;#xB9AC;&amp;#xC694;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; Linux&amp;#xC758; EntryBleed &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2022-4543)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC29;&amp;#xC548;&amp;#xD55C;, &lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;pre-patch&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Leak&lt;/a&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xB3C4; &amp;#xC0C8;&amp;#xB86D;&amp;#xAC8C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; kASLR &amp;#xC6B0;&amp;#xD68C;&amp;#xAC00; &amp;#xC544;&amp;#xC608; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xC9C0;&amp;#xB294; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;Exploiting the NT Kernel in 24H2: New Bugs in Old Code &amp;amp; Side Channels Against KASLR&lt;/a&gt; &amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;SMEP-Supervisor-Mode-Execution-Protection&#34;&gt;&lt;a href=&#34;#SMEP-Supervisor-Mode-Execution-Protection&#34; class=&#34;headerlink&#34; title=&#34;SMEP(Supervisor Mode Execution Protection)&#34;&gt;&lt;/a&gt;SMEP(Supervisor Mode Execution Protection)&lt;/h3&gt;&lt;p&gt;SMEP&amp;#xC740; CPU&amp;#xAC00; Supervisor Mode(ring 0) &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;(ring 3)&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  cr4 &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC758; 20&amp;#xBC88;&amp;#xC9F8; bit&amp;#xC5D0; SMEP &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&#34;&gt;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;DEP&amp;#xC5D0; &amp;#xB354;&amp;#xD574; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; mitigation&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xCD5C;&amp;#xC18C; Medium Integrity &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC804;&amp;#xC81C;&amp;#xB85C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC55E;&amp;#xC11C; kASLR&amp;#xC774; &amp;#xCEE4;&amp;#xB110; mitigation&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD070; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;!) SMEP&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; executable &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC62C;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; SMEP&amp;#xC774; DEP&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;#xCEE4;&amp;#xB110;&amp;#x2194;&amp;#xC720;&amp;#xC800;&lt;/code&gt; &amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xB41C; mitgation&amp;#xC778; &amp;#xB9CC;&amp;#xD07C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB3C4; ROP &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCEE4;&amp;#xB110; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; cr4 &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; SMEP&amp;#xC744; disable&amp;#xD558;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;pop rcx; ret
mov cr4, rcx; ret&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image.png&#34;&gt;&lt;br&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;kCFG-Kernel-Control-Flow-Guard&#34;&gt;&lt;a href=&#34;#kCFG-Kernel-Control-Flow-Guard&#34; class=&#34;headerlink&#34; title=&#34;kCFG(Kernel Control Flow Guard)&#34;&gt;&lt;/a&gt;kCFG(Kernel Control Flow Guard)&lt;/h3&gt;&lt;p&gt;kCFG&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; Indirect Call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; forward-edge CFI(Control Flow Integrity) mitigation&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. backward-edge CFI&amp;#xC778; CET&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB098;, &amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C; CET&amp;#xB294; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;__guard_disaptch_icall_fptr&lt;/code&gt;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; cfg &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; runtime address sanitizer&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C; &amp;#xC804;&amp;#xC5D0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; CFG &amp;#xC791;&amp;#xB3D9;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image9.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard&#34;&gt;https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;kCFG&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC608;&amp;#xC678;&amp;#xB97C; throw&amp;#xD574; &lt;code&gt;KERNEL_SECURITY_CHECK_FAILURE&lt;/code&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. kCFG&amp;#xB294; &lt;a href=&#34;https://cwe.mitre.org/data/definitions/822.html&#34;&gt;CWE-822: Untrusted Pointer Dereference&lt;/a&gt; &amp;#xC784;&amp;#xC758;&amp;#xC758; callback &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC5ED;&amp;#xCC38;&amp;#xC870; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB7F0; kCFG&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. callback &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; Arbitrary Read/Write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0;, data corruption&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Full Arbitrary Read/Write &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; Token Swapping&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; Windows built-in &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; PreviousMode, SedebugPrivilege, IoRing&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; data corruption exploit &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&#34;&gt;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.willsroot.io/2022/12/entrybleed.html&#34;&gt;https://www.willsroot.io/2022/12/entrybleed.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;https://github.com/exploits-forsale/prefetch-tool&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;https://windows-internals.com/kaslr-leaks-restriction/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;https://exploits.forsale/24h2-nt-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&#34;&gt;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/&#34;&gt;https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Bypassing Windows Kernel Mitigations: Part1 - Overview (Ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview &amp;#x2190; Now&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338&lt;/a&gt; &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4;.. 3&amp;#xB144; &amp;#xB9CC;&amp;#xC5D0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6D0;&amp;#xB798; 1&amp;#xB144; &amp;#xC804;&amp;#xC5D0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC878;&amp;#xC5C5;&amp;#xACFC; &amp;#xCDE8;&amp;#xC5C5; &amp;#xC591;&amp;#xAC01;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xD0C8;&amp;#xD0C8; &amp;#xD138;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD750;&amp;#xC9C0;&amp;#xBD80;&amp;#xC9C0;&amp;#xB410;&amp;#xC5C8;&amp;#xB358; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC788;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;.. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC4F0;&amp;#xB2E4; &amp;#xB9CC; &amp;#xCD08;&amp;#xC548; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;1&amp;#xB144; &amp;#xC804; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xBCF5;&amp;#xADC0;&amp;#xAC01;&amp;#xC744; &amp;#xBCF4;&amp;#xB358; &amp;#xB354;&amp;#xBBF8;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC878;&amp;#xC5C5;&amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xC18C;&amp;#xD640;&amp;#xD788; &amp;#xD588;&amp;#xB358; &amp;#xC5C5;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xCC0C;&amp;#xC5B4;&amp;#xCC0C; &amp;#xCCAD;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC5C5;&amp;#xB3C4; &amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC7A5;&amp;#xC778; 2&amp;#xB144;&amp;#xCC28;&amp;#xAC00; &amp;#xB410;&amp;#xB294;&amp;#xB370;, &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xD2C8;&amp;#xD2C8;&amp;#xC774; &amp;#xC62C;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :)&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;2021&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026; &amp;#xC81C;&amp;#xBAA9; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBB54; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xC9C0;&amp;#xC740;&amp;#xAC74;&amp;#xC9C0; &amp;#xACFC;&amp;#xAC70;&amp;#xC758; &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC54A;&amp;#xB124;&amp;#xC694;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB108; &amp;#xADF8; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC81C;&amp;#xBAA9;&amp;#xC73C;&amp;#xB85C; 3&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#xB180;&amp;#xB9BC;&amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0;!!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC81C; &amp;#xAE00;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xB294; &amp;#xBD84;&amp;#xB3C4; &amp;#xAC00;&amp;#xB054;&amp;#xC529; &amp;#xB9CC;&amp;#xB098;&amp;#xACE0; &amp;#xB098;&amp;#xB984; &amp;#xBFCC;&amp;#xB4EF;&amp;#xD558;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &lt;del&gt;&amp;#xC81C;&amp;#xBAA9;&amp;#xB9CC; &amp;#xBE7C;&amp;#xACE0;&amp;#xC694;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;, &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; AMD Ryzen Master &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC871;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Arbitrary Physical Address R/W&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/&#34;&gt;[Research] &amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver&lt;/a&gt; &amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW&amp;#xB77C;&amp;#xC11C; mitigation&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; Token&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xBABD;&amp;#xB545; &amp;#xB36E;&amp;#xC5B4;&amp;#xC368;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC8E0;..! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; Exploit&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; mitigation &amp;#xC6B0;&amp;#xD68C; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Windows-Kernel-Mitigations&#34;&gt;&lt;a href=&#34;#Windows-Kernel-Mitigations&#34; class=&#34;headerlink&#34; title=&#34;Windows Kernel Mitigations&#34;&gt;&lt;/a&gt;Windows Kernel Mitigations&lt;/h1&gt;&lt;p&gt;Windows&amp;#xC5D4; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC740; mitigation&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC0C8;&amp;#xB86D;&amp;#xAC8C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9;&amp;#xC740; &amp;#xC810;&amp;#xC810; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0; &lt;del&gt;&amp;#xB354; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBA39;&amp;#xACE0;&amp;#xC0AC;&amp;#xB0D0;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows &amp;#xBCF4;&amp;#xC548; &amp;#xC571;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; Exploit Protection&amp;#xC744; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;mitigation&amp;#xB4E4; &amp;#xC911; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;, &amp;#xD2B9;&amp;#xD788; memory corruption&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; exploit&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; mitigation&amp;#xC778; DEP, kASLR, SMEP, kCFG&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;CET(Control-flow Enforcement Technology)&amp;#xB098; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xCD5C;&amp;#xADFC; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; VBS &amp;#xAE30;&amp;#xBC18;&amp;#xC758; KDP/HVCI/DSE &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; mitigation&amp;#xB4E4;&amp;#xACFC;, &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC84;&amp;#xC804; &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &lt;a href=&#34;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&#34;&gt;github&lt;/a&gt; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;DEP-Data-Execution-Protection&#34;&gt;&lt;a href=&#34;#DEP-Data-Execution-Protection&#34; class=&#34;headerlink&#34; title=&#34;DEP(Data Execution Protection)&#34;&gt;&lt;/a&gt;DEP(Data Execution Protection)&lt;/h3&gt;&lt;p&gt;&amp;#xCEE4;&amp;#xB110;&amp;#xC758; DEP&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; DEP&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C;, Stack/Heap&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC8E0;. &amp;#xC6B0;&amp;#xD68C;&amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; ROP&amp;#xB85C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xB2E4;&amp;#xB9CC; &amp;#xCEE4;&amp;#xB110;&amp;#xC740; DEP&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC7A5;&amp;#xD574; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; mitigation&amp;#xC774; &amp;#xB354; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC74; &amp;#xC774;&amp;#xD6C4; &amp;#xC124;&amp;#xBA85;&amp;#xD560; SMEP&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;kASLR-Kernel-Address-Layout-Rnadomization&#34;&gt;&lt;a href=&#34;#kASLR-Kernel-Address-Layout-Rnadomization&#34; class=&#34;headerlink&#34; title=&#34;kASLR(Kernel Address Layout Rnadomization)&#34;&gt;&lt;/a&gt;kASLR(Kernel Address Layout Rnadomization)&lt;/h3&gt;&lt;p&gt;kASLR &amp;#xC5ED;&amp;#xC2DC; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; ASLR&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, Windows &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Medium Integrity &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC544;&amp;#xC8FC;&amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; Memory Leak&amp;#xC744; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &lt;del&gt;&amp;#xAC1C;&amp;#xAFC0;&lt;/del&gt; &lt;/p&gt;
&lt;p&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; OS &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;NTSTATUS&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(WINAPI* PNtQuerySystemInformation)&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;( &lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__in SYSTEM_INFORMATION_CLASS SystemInformationClass, &lt;span class=&#34;hljs-comment&#34;&gt;// 1. &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C0;&amp;#xC785; &amp;#xC9C0;&amp;#xC815;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__inout PVOID SystemInformaton,                       &lt;span class=&#34;hljs-comment&#34;&gt;// 2. &amp;#xBC18;&amp;#xD658;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xBC84;&amp;#xD37C;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__in ULONG SystemInformationLength,                   &lt;span class=&#34;hljs-comment&#34;&gt;// 3. 2&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xD06C;&amp;#xAE30;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;	__out_opt PULONG ReturnLength                         &lt;span class=&#34;hljs-comment&#34;&gt;// 4. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xD06C;&amp;#xAE30;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &lt;code&gt;SystemInformatonClass&lt;/code&gt;&amp;#xB294; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xC778; &lt;code&gt;SYSYTEM_INFORMATION_CLASS&lt;/code&gt;&amp;#xC758; &amp;#xAC12; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xCFFC;&amp;#xB9AC;&amp;#xD560; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs awk&#34;&gt;typedef enum _SYSTEM_INFORMATION_CLASS {

&amp;#xA0;&amp;#xA0; SystemBasicInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPerformanceInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeOfDayInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented1,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessesAndThreadsInformation,&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCallCounts,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemConfigurationInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorTimes,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemGlobalFlag,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented2,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemModuleInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;11&lt;/span&gt; 
&amp;#xA0;&amp;#xA0; SystemLockInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented3,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented4,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented5,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;15&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemHandleInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemObjectInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;17&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPagefileInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInstructionEmulationCounts,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;19&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass1,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCacheInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPoolTagInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;22&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemProcessorStatistics,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;23&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemDpcInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented6,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLoadImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemUnloadImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;27&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeAdjustment,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented7,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;29&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented8,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented9,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;31&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCrashDumpInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;32&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemExceptionInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;33&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCrashDumpStateInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;34&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemKernelDebuggerInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemContextSwitchInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;36&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemRegistryQuotaInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;37&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLoadAndCallImage,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemPrioritySeparation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;39&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented10,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemNotImplemented11,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;41&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass2,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;42&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass3,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemTimeZoneInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;44&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemLookasideInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;45&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemSetTimeSlipEvent,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemCreateSession,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;47&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemDeleteSession,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemInvalidInfoClass4,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;49&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemRangeStartInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemVerifierInformation,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemAddVerifier,&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt;
&amp;#xA0;&amp;#xA0; SystemSessionProcessesInformation&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0;&amp;#xA0; &lt;span class=&#34;hljs-regexp&#34;&gt;//&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt;
} SYSTEM_INFORMATION_CLASS;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;a href=&#34;https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm&#34;&gt;https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xB4E4; &amp;#xC911; &lt;code&gt;SystemModuleInformation&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &lt;code&gt;ntoskrnl&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &lt;code&gt;SystemHandleInformation&lt;/code&gt; &amp;#xC744; &amp;#xD1B5;&amp;#xD574;  Privilege Token, ImageName&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC778; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC04;&amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xC775;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; kASLR&amp;#xC740; &lt;code&gt;http.sys&lt;/code&gt;&amp;#xB098; &lt;code&gt;tcpip.sys&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC774; Remote Surface&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; &amp;#xB9D0;&amp;#xACE0;&amp;#xB294; &amp;#xD070; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;thumbnail.jpg&#34; alt=&#34;image2&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB9CC; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC804; &amp;#xC815;&amp;#xC2DD; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988;&amp;#xB41C; Windows 24H2&amp;#xBD80;&amp;#xD130;&amp;#xB294; &lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;NtQuerySystemInformation &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xADF8; &amp;#xAD8C;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC778; SeDebugPrivilege&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D;&lt;/a&gt; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; memory corruption &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD560;&amp;#xB54C; leak &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xB420; &amp;#xC218;&amp;#xB3C4;&amp;#x2026;?? &lt;del&gt;&amp;#xC544;&amp;#xB2C8; MS&amp;#xC120;&amp;#xC0DD; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8;&amp;#xC18C;&amp;#xB9AC;&amp;#xC694;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; Linux&amp;#xC758; EntryBleed &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2022-4543)&amp;#xC5D0;&amp;#xC11C; &amp;#xCC29;&amp;#xC548;&amp;#xD55C;, &lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;pre-patch&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Leak&lt;/a&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xB3C4; &amp;#xC0C8;&amp;#xB86D;&amp;#xAC8C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; kASLR &amp;#xC6B0;&amp;#xD68C;&amp;#xAC00; &amp;#xC544;&amp;#xC608; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xC9C0;&amp;#xB294; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;Exploiting the NT Kernel in 24H2: New Bugs in Old Code &amp;amp; Side Channels Against KASLR&lt;/a&gt; &amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;SMEP-Supervisor-Mode-Execution-Protection&#34;&gt;&lt;a href=&#34;#SMEP-Supervisor-Mode-Execution-Protection&#34; class=&#34;headerlink&#34; title=&#34;SMEP(Supervisor Mode Execution Protection)&#34;&gt;&lt;/a&gt;SMEP(Supervisor Mode Execution Protection)&lt;/h3&gt;&lt;p&gt;SMEP&amp;#xC740; CPU&amp;#xAC00; Supervisor Mode(ring 0) &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;(ring 3)&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  cr4 &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC758; 20&amp;#xBC88;&amp;#xC9F8; bit&amp;#xC5D0; SMEP &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&#34;&gt;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;DEP&amp;#xC5D0; &amp;#xB354;&amp;#xD574; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; mitigation&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xCD5C;&amp;#xC18C; Medium Integrity &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC804;&amp;#xC81C;&amp;#xB85C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC55E;&amp;#xC11C; kASLR&amp;#xC774; &amp;#xCEE4;&amp;#xB110; mitigation&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD070; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;!) SMEP&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; executable &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC62C;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; SMEP&amp;#xC774; DEP&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;#xCEE4;&amp;#xB110;&amp;#x2194;&amp;#xC720;&amp;#xC800;&lt;/code&gt; &amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xB41C; mitgation&amp;#xC778; &amp;#xB9CC;&amp;#xD07C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB3C4; ROP &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCEE4;&amp;#xB110; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; cr4 &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; SMEP&amp;#xC744; disable&amp;#xD558;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;&amp;#xC758; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;pop rcx; ret
mov cr4, rcx; ret&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image.png&#34;&gt;&lt;br&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;kCFG-Kernel-Control-Flow-Guard&#34;&gt;&lt;a href=&#34;#kCFG-Kernel-Control-Flow-Guard&#34; class=&#34;headerlink&#34; title=&#34;kCFG(Kernel Control Flow Guard)&#34;&gt;&lt;/a&gt;kCFG(Kernel Control Flow Guard)&lt;/h3&gt;&lt;p&gt;kCFG&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; Indirect Call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; forward-edge CFI(Control Flow Integrity) mitigation&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. backward-edge CFI&amp;#xC778; CET&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB098;, &amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C; CET&amp;#xB294; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;__guard_disaptch_icall_fptr&lt;/code&gt;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; cfg &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; runtime address sanitizer&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C; &amp;#xC804;&amp;#xC5D0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; CFG &amp;#xC791;&amp;#xB3D9;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image9.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard&#34;&gt;https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;kCFG&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC608;&amp;#xC678;&amp;#xB97C; throw&amp;#xD574; &lt;code&gt;KERNEL_SECURITY_CHECK_FAILURE&lt;/code&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. kCFG&amp;#xB294; &lt;a href=&#34;https://cwe.mitre.org/data/definitions/822.html&#34;&gt;CWE-822: Untrusted Pointer Dereference&lt;/a&gt; &amp;#xC784;&amp;#xC758;&amp;#xC758; callback &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC5ED;&amp;#xCC38;&amp;#xC870; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB7F0; kCFG&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. callback &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; Arbitrary Read/Write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0;, data corruption&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Full Arbitrary Read/Write &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; Token Swapping&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; Windows built-in &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; PreviousMode, SedebugPrivilege, IoRing&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; data corruption exploit &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&#34;&gt;https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.willsroot.io/2022/12/entrybleed.html&#34;&gt;https://www.willsroot.io/2022/12/entrybleed.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;https://github.com/exploits-forsale/prefetch-tool&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;https://windows-internals.com/kaslr-leaks-restriction/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;https://exploits.forsale/24h2-nt-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&#34;&gt;https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/&#34;&gt;https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/thumbnail.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/">

  <title>[Research] Bypassing Windows Kernel Mitigations: Part1 - Overview (Ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-12-08 19:00" pubdate>
      2024 12 8 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      60
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Bypassing Windows Kernel Mitigations: Part1 - Overview (Ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>Bypassing Windows Kernel Mitigations: Part1 - Overview &#x2190; Now</p>
<p><a href="https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/">Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338</a> </p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, L0ch&#xC785;&#xB2C8;&#xB2E4;. &#xB4DC;&#xB514;&#xC5B4;.. 3&#xB144; &#xB9CC;&#xC5D0; &#xC5F0;&#xAD6C;&#xAE00;&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; &#xC6D0;&#xB798; 1&#xB144; &#xC804;&#xC5D0; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC4F0;&#xB824; &#xD588;&#xC9C0;&#xB9CC; &#xC878;&#xC5C5;&#xACFC; &#xCDE8;&#xC5C5; &#xC591;&#xAC01;&#xC5D0;&#xC11C; &#xBA58;&#xD0C8;&#xC774; &#xD0C8;&#xD0C8; &#xD138;&#xB9AC;&#xACE0; &#xC788;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD750;&#xC9C0;&#xBD80;&#xC9C0;&#xB410;&#xC5C8;&#xB358; &#xAE30;&#xC5B5;&#xC774; &#xC788;&#xB124;&#xC694; &#x314E;&#x314E;.. &#xADF8;&#xB798;&#xC11C; &#xC4F0;&#xB2E4; &#xB9CC; &#xCD08;&#xC548; &#xC77C;&#xBD80;&#xB97C; &#xAC00;&#xC838;&#xC640;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image1.png" srcset="/img/loading.gif" alt="image"></p>
<blockquote>
<p>1&#xB144; &#xC804; &#xC5F0;&#xAD6C;&#xAE00; &#xBCF5;&#xADC0;&#xAC01;&#xC744; &#xBCF4;&#xB358; &#xB354;&#xBBF8;&#xB370;&#xC774;&#xD130;&#x2026;</p>
</blockquote>
<p>&#xC878;&#xC5C5;&#xC900;&#xBE44;&#xB97C; &#xC18C;&#xD640;&#xD788; &#xD588;&#xB358; &#xC5C5;&#xBCF4;&#xB97C; &#xC5B4;&#xCC0C;&#xC5B4;&#xCC0C; &#xCCAD;&#xC0B0;&#xD558;&#xACE0; &#xCDE8;&#xC5C5;&#xB3C4; &#xD574;&#xC11C; &#xC774;&#xC81C; &#xC9C1;&#xC7A5;&#xC778; 2&#xB144;&#xCC28;&#xAC00; &#xB410;&#xB294;&#xB370;, &#xC55E;&#xC73C;&#xB85C; &#xD2C8;&#xD2C8;&#xC774; &#xC62C;&#xB824;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; :)</p>
<h1 id="&#xC11C;&#xB860;"><a href="#&#xC11C;&#xB860;" class="headerlink" title="&#xC11C;&#xB860;"></a>&#xC11C;&#xB860;</h1><p>2021&#xB144;&#xC5D0; &#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xC5C5;&#xB85C;&#xB4DC;&#xD588;&#xB294;&#xB370;&#xC694;&#x2026; &#xC81C;&#xBAA9; &#xC9C4;&#xC9DC; &#xBB54; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC9C0;&#xC740;&#xAC74;&#xC9C0; &#xACFC;&#xAC70;&#xC758; &#xC81C;&#xAC00; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xC9C8; &#xC54A;&#xB124;&#xC694;.. </p>
<p><img src="image2.png" srcset="/img/loading.gif" alt="image2"></p>
<blockquote>
<p>&#xB108; &#xADF8; &#xC2DC;&#xB9AC;&#xC988; &#xC81C;&#xBAA9;&#xC73C;&#xB85C; 3&#xB144; &#xB118;&#xAC8C; &#xB180;&#xB9BC;&#xBC1B;&#xB294;&#xB2E4;&#xACE0;!!!!</p>
</blockquote>
<p>&#xADF8;&#xB798;&#xB3C4; &#xC81C; &#xAE00;&#xC744; &#xBCF4;&#xBA74;&#xC11C; Windows &#xCEE4;&#xB110;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xC168;&#xB2E4;&#xB294; &#xBD84;&#xB3C4; &#xAC00;&#xB054;&#xC529; &#xB9CC;&#xB098;&#xACE0; &#xB098;&#xB984; &#xBFCC;&#xB4EF;&#xD558;&#xAE34; &#xD569;&#xB2C8;&#xB2E4; <del>&#xC81C;&#xBAA9;&#xB9CC; &#xBE7C;&#xACE0;&#xC694;</del></p>
<p>&#xC544;&#xBB34;&#xD2BC;, &#xC774;&#xC804; &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC694;&#xC57D;&#xD574;&#xBCF4;&#xBA74; AMD Ryzen Master &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; <code>MmMapIoSpace</code> &#xD568;&#xC218; &#xD638;&#xCD9C; &#xC2DC; &#xAC80;&#xC99D; &#xBD80;&#xC871;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; Arbitrary Physical Address R/W&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; &#xAD81;&#xAE08;&#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; <a href="https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/">[Research] &#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver</a> &#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;! </p>
<p>&#xC0AC;&#xC2E4; &#xC800;&#xBC88; &#xC2DC;&#xB9AC;&#xC988;&#xB294; <code>MmMapIoSpace</code> &#xD568;&#xC218;&#xC758; &#xC798;&#xBABB;&#xB41C; &#xC0AC;&#xC6A9;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB3C;&#xB9AC; &#xBA54;&#xBAA8;&#xB9AC; RW&#xB77C;&#xC11C; mitigation&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xD544;&#xC694;&#xB3C4; &#xC5C6;&#xC774; Token&#xC774; &#xC788;&#xB294; &#xB9E4;&#xD551;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xD398;&#xC774;&#xC9C0; &#xCC3E;&#xC544; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xBABD;&#xB545; &#xB36E;&#xC5B4;&#xC368;&#xBC84;&#xB9AC;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xAC00;&#xB2A5;&#xD588;&#xC8E0;..! &#xADF8;&#xB798;&#xC11C; &#xC880; &#xB354; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xCEE4;&#xB110; Exploit&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; mitigation &#xC6B0;&#xD68C; &#xAE30;&#xBC95;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Windows-Kernel-Mitigations"><a href="#Windows-Kernel-Mitigations" class="headerlink" title="Windows Kernel Mitigations"></a>Windows Kernel Mitigations</h1><p>Windows&#xC5D4; &#xC815;&#xB9D0; &#xB9CE;&#xC740; mitigation&#xB4E4;&#xC774; &#xC788;&#xACE0; &#xCD5C;&#xADFC;&#xC5D0;&#xB3C4; &#xC0C8;&#xB86D;&#xAC8C; &#xB4F1;&#xC7A5;&#xD558;&#xBA74;&#xC11C; &#xCDE8;&#xC57D;&#xC810; &#xC545;&#xC6A9;&#xC740; &#xC810;&#xC810; &#xC5B4;&#xB824;&#xC6CC;&#xC9C0;&#xACE0; &#xC788;&#xC8E0; <del>&#xB354; &#xCD94;&#xAC00;&#xB418;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xBA39;&#xACE0;&#xC0AC;&#xB0D0;</del></p>
<p><img src="image3.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>Windows &#xBCF4;&#xC548; &#xC571;&#xC5D0;&#xC11C; &#xC801;&#xC6A9;&#xB41C; Exploit Protection&#xC744; &#xAC04;&#xB7B5;&#xD558;&#xAC8C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>mitigation&#xB4E4; &#xC911; Windows &#xCEE4;&#xB110;&#xC5D0; &#xC801;&#xC6A9;&#xB418;&#xB294;, &#xD2B9;&#xD788; memory corruption&#xC73C;&#xB85C; &#xC778;&#xD55C; exploit&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD55C; mitigation&#xC778; DEP, kASLR, SMEP, kCFG&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p>CET(Control-flow Enforcement Technology)&#xB098; &#xBE44;&#xAD50;&#xC801; &#xCD5C;&#xADFC; &#xC801;&#xC6A9;&#xB41C; VBS &#xAE30;&#xBC18;&#xC758; KDP/HVCI/DSE &#xB4F1;&#xB4F1;&#xC758; &#xC774; &#xAE00;&#xC5D0;&#xC11C; &#xB098;&#xC624;&#xC9C0; &#xC54A;&#xC740; mitigation&#xB4E4;&#xACFC;, &#xC801;&#xC6A9;&#xB41C; &#xBC84;&#xC804; &#xD788;&#xC2A4;&#xD1A0;&#xB9AC; &#xC815;&#xBCF4;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md">github</a> &#xB9C1;&#xD06C;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h3 id="DEP-Data-Execution-Protection"><a href="#DEP-Data-Execution-Protection" class="headerlink" title="DEP(Data Execution Protection)"></a>DEP(Data Execution Protection)</h3><p>&#xCEE4;&#xB110;&#xC758; DEP&#xB294; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xC758; DEP&#xC640; &#xB3D9;&#xC77C;&#xD55C; &#xAC1C;&#xB150;&#xC73C;&#xB85C;, Stack/Heap&#xC758; &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC744; &#xC81C;&#xD55C;&#xD574; &#xC258;&#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC774;&#xC8E0;. &#xC6B0;&#xD68C;&#xBC29;&#xBC95;&#xB3C4; ROP&#xB85C; &#xB3D9;&#xC77C;&#xD569;&#xB2C8;&#xB2E4;! &#xB2E4;&#xB9CC; &#xCEE4;&#xB110;&#xC740; DEP&#xC5D0;&#xC11C; &#xD655;&#xC7A5;&#xD574; &#xD55C; &#xAC00;&#xC9C0; mitigation&#xC774; &#xB354; &#xC788;&#xB294;&#xB370;, &#xC774;&#xAC74; &#xC774;&#xD6C4; &#xC124;&#xBA85;&#xD560; SMEP&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="kASLR-Kernel-Address-Layout-Rnadomization"><a href="#kASLR-Kernel-Address-Layout-Rnadomization" class="headerlink" title="kASLR(Kernel Address Layout Rnadomization)"></a>kASLR(Kernel Address Layout Rnadomization)</h3><p>kASLR &#xC5ED;&#xC2DC; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xC758; ASLR&#xACFC; &#xB3D9;&#xC77C;&#xD55C; &#xAC1C;&#xB150;&#xC774;&#xC9C0;&#xB9CC;, Windows &#xCEE4;&#xB110;&#xC758; &#xACBD;&#xC6B0; Medium Integrity &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; <code>NtQuerySystemInformation</code>&#xB77C;&#xB294; &#xC544;&#xC8FC;&#xC544;&#xC8FC; &#xC720;&#xC6A9;&#xD55C; &#xD568;&#xC218;&#xAC00; &#xC788;&#xC5B4; Memory Leak&#xC744; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC8E0;. <del>&#xAC1C;&#xAFC0;</del> </p>
<p><code>NtQuerySystemInformation</code>&#xB294; &#xD604;&#xC7AC; OS &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB300;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294; &#xD568;&#xC218;&#xB85C;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">typedef</span> <span class="hljs-title">NTSTATUS</span><span class="hljs-params">(WINAPI* PNtQuerySystemInformation)</span><span class="hljs-params">( </span></span>
<span class="hljs-function"><span class="hljs-params">	__in SYSTEM_INFORMATION_CLASS SystemInformationClass, <span class="hljs-comment">// 1. &#xAC00;&#xC838;&#xC62C; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4; &#xD0C0;&#xC785; &#xC9C0;&#xC815;</span></span></span>
<span class="hljs-function"><span class="hljs-params">	__inout PVOID SystemInformaton,                       <span class="hljs-comment">// 2. &#xBC18;&#xD658;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xBC84;&#xD37C;</span></span></span>
<span class="hljs-function"><span class="hljs-params">	__in ULONG SystemInformationLength,                   <span class="hljs-comment">// 3. 2&#xC5D0; &#xC804;&#xB2EC;&#xD55C; &#xBC84;&#xD37C; &#xD06C;&#xAE30;</span></span></span>
<span class="hljs-function"><span class="hljs-params">	__out_opt PULONG ReturnLength                         <span class="hljs-comment">// 4. &#xC2E4;&#xC81C;&#xB85C; &#xBC18;&#xD658;&#xD55C; &#xBC84;&#xD37C; &#xD06C;&#xAE30;</span></span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790; <code>SystemInformatonClass</code>&#xB294; &#xC5F4;&#xAC70;&#xD615; &#xD074;&#xB798;&#xC2A4;&#xC778; <code>SYSYTEM_INFORMATION_CLASS</code>&#xC758; &#xAC12; &#xC911; &#xD558;&#xB098;&#xB85C;, &#xCFFC;&#xB9AC;&#xD560; &#xC815;&#xBCF4;&#xC5D0; &#xB530;&#xB77C; &#xC5F4;&#xAC70;&#xD615; &#xAC12;&#xC744; &#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs awk">typedef enum _SYSTEM_INFORMATION_CLASS {

&#xA0;&#xA0; SystemBasicInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">0</span>
&#xA0;&#xA0; SystemProcessorInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">1</span>
&#xA0;&#xA0; SystemPerformanceInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">2</span>
&#xA0;&#xA0; SystemTimeOfDayInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">3</span>
&#xA0;&#xA0; SystemNotImplemented1,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">4</span>
&#xA0;&#xA0; SystemProcessesAndThreadsInformation,&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">5</span>
&#xA0;&#xA0; SystemCallCounts,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">6</span>
&#xA0;&#xA0; SystemConfigurationInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">7</span>
&#xA0;&#xA0; SystemProcessorTimes,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">8</span>
&#xA0;&#xA0; SystemGlobalFlag,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">9</span>
&#xA0;&#xA0; SystemNotImplemented2,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">10</span>
&#xA0;&#xA0; SystemModuleInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">11</span> 
&#xA0;&#xA0; SystemLockInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">12</span>
&#xA0;&#xA0; SystemNotImplemented3,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">13</span>
&#xA0;&#xA0; SystemNotImplemented4,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">14</span>
&#xA0;&#xA0; SystemNotImplemented5,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">15</span>
&#xA0;&#xA0; SystemHandleInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">16</span>
&#xA0;&#xA0; SystemObjectInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">17</span>
&#xA0;&#xA0; SystemPagefileInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">18</span>
&#xA0;&#xA0; SystemInstructionEmulationCounts,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">19</span>
&#xA0;&#xA0; SystemInvalidInfoClass1,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">20</span>
&#xA0;&#xA0; SystemCacheInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">21</span>
&#xA0;&#xA0; SystemPoolTagInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">22</span>
&#xA0;&#xA0; SystemProcessorStatistics,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">23</span>
&#xA0;&#xA0; SystemDpcInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">24</span>
&#xA0;&#xA0; SystemNotImplemented6,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">25</span>
&#xA0;&#xA0; SystemLoadImage,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">26</span>
&#xA0;&#xA0; SystemUnloadImage,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">27</span>
&#xA0;&#xA0; SystemTimeAdjustment,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">28</span>
&#xA0;&#xA0; SystemNotImplemented7,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">29</span>
&#xA0;&#xA0; SystemNotImplemented8,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">30</span>
&#xA0;&#xA0; SystemNotImplemented9,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">31</span>
&#xA0;&#xA0; SystemCrashDumpInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">32</span>
&#xA0;&#xA0; SystemExceptionInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">33</span>
&#xA0;&#xA0; SystemCrashDumpStateInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">34</span>
&#xA0;&#xA0; SystemKernelDebuggerInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">35</span>
&#xA0;&#xA0; SystemContextSwitchInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">36</span>
&#xA0;&#xA0; SystemRegistryQuotaInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">37</span>
&#xA0;&#xA0; SystemLoadAndCallImage,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">38</span>
&#xA0;&#xA0; SystemPrioritySeparation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">39</span>
&#xA0;&#xA0; SystemNotImplemented10,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">40</span>
&#xA0;&#xA0; SystemNotImplemented11,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">41</span>
&#xA0;&#xA0; SystemInvalidInfoClass2,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">42</span>
&#xA0;&#xA0; SystemInvalidInfoClass3,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">43</span>
&#xA0;&#xA0; SystemTimeZoneInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">44</span>
&#xA0;&#xA0; SystemLookasideInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">45</span>
&#xA0;&#xA0; SystemSetTimeSlipEvent,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">46</span>
&#xA0;&#xA0; SystemCreateSession,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">47</span>
&#xA0;&#xA0; SystemDeleteSession,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">48</span>
&#xA0;&#xA0; SystemInvalidInfoClass4,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">49</span>
&#xA0;&#xA0; SystemRangeStartInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">50</span>
&#xA0;&#xA0; SystemVerifierInformation,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">51</span>
&#xA0;&#xA0; SystemAddVerifier,&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">52</span>
&#xA0;&#xA0; SystemSessionProcessesInformation&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="hljs-regexp">//</span> <span class="hljs-number">53</span>
} SYSTEM_INFORMATION_CLASS;</code></pre>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm">https://www.geoffchappell.com/studies/windows/km/ntoskrnl/api/ex/sysinfo/class.htm</a></p>
<p>&#xC704;&#xC758; &#xC5F4;&#xAC70;&#xD615; &#xAC12;&#xB4E4; &#xC911; <code>SystemModuleInformation</code> &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; <code>ntoskrnl</code> &#xC640; &#xAC19;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xC774;&#xBBF8;&#xC9C0; &#xBCA0;&#xC774;&#xC2A4; &#xC8FC;&#xC18C;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xACE0;, <code>SystemHandleInformation</code> &#xC744; &#xD1B5;&#xD574;  Privilege Token, ImageName&#xC640; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC815;&#xBCF4;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xCCB4;&#xC778; EPROCESS &#xC8FC;&#xC18C;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="image4.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774;&#xB807;&#xAC8C; <code>NtQuerySystemInformation</code>&#xC744; &#xD1B5;&#xD574; &#xAC04;&#xD3B8;&#xD558;&#xAC8C; &#xC775;&#xC2A4;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xC0AC;&#xC2E4;&#xC0C1; kASLR&#xC740; <code>http.sys</code>&#xB098; <code>tcpip.sys</code>&#xC640; &#xAC19;&#xC774; Remote Surface&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xCEE4;&#xB110; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8; &#xB9D0;&#xACE0;&#xB294; &#xD070; &#xD6A8;&#xACFC;&#xAC00; &#xC5C6;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="thumbnail.jpg" srcset="/img/loading.gif" alt="image2"></p>
<p>&#xB2E4;&#xB9CC; &#xC5BC;&#xB9C8; &#xC804; &#xC815;&#xC2DD; &#xB9B4;&#xB9AC;&#xC988;&#xB41C; Windows 24H2&#xBD80;&#xD130;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://windows-internals.com/kaslr-leaks-restriction/">NtQuerySystemInformation &#xD568;&#xC218;&#xAC00; &#xB514;&#xBC84;&#xADF8; &#xAD8C;&#xD55C; &#xD50C;&#xB798;&#xADF8;&#xC778; SeDebugPrivilege&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB41C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C;&#xB9CC; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D;</a> &#xBC14;&#xB00C;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;. &#xC55E;&#xC73C;&#xB85C; memory corruption &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC775;&#xC2A4;&#xD560;&#xB54C; leak &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCD94;&#xAC00;&#xB85C; &#xCC3E;&#xC544;&#xC57C; &#xB420; &#xC218;&#xB3C4;&#x2026;?? <del>&#xC544;&#xB2C8; MS&#xC120;&#xC0DD; &#xC774;&#xAC8C; &#xBB34;&#xC2A8;&#xC18C;&#xB9AC;&#xC694;</del></p>
<p>&#xADF8;&#xB798;&#xB3C4; Linux&#xC758; EntryBleed &#xCDE8;&#xC57D;&#xC810;(CVE-2022-4543)&#xC5D0;&#xC11C; &#xCC29;&#xC548;&#xD55C;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/exploits-forsale/prefetch-tool">pre-patch&#xB97C; &#xC774;&#xC6A9;&#xD55C; Leak</a> &#xAE30;&#xBC95;&#xB3C4; &#xC0C8;&#xB86D;&#xAC8C; &#xBC1C;&#xACAC;&#xB418;&#xACE0; &#xC788;&#xC5B4; kASLR &#xC6B0;&#xD68C;&#xAC00; &#xC544;&#xC608; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB420; &#xC9C0;&#xB294; &#xC9C0;&#xCF1C;&#xBD10;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD00;&#xB828; &#xB0B4;&#xC6A9;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://exploits.forsale/24h2-nt-exploit/">Exploiting the NT Kernel in 24H2: New Bugs in Old Code &amp; Side Channels Against KASLR</a> &#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h3 id="SMEP-Supervisor-Mode-Execution-Protection"><a href="#SMEP-Supervisor-Mode-Execution-Protection" class="headerlink" title="SMEP(Supervisor Mode Execution Protection)"></a>SMEP(Supervisor Mode Execution Protection)</h3><p>SMEP&#xC740; CPU&#xAC00; Supervisor Mode(ring 0) &#xAD8C;&#xD55C; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC720;&#xC800;&#xB79C;&#xB4DC;(ring 3)&#xC758; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.  cr4 &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC758; 20&#xBC88;&#xC9F8; bit&#xC5D0; SMEP &#xD50C;&#xB798;&#xADF8;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="image5.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>&#xCD9C;&#xCC98; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/">https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/</a></p>
</blockquote>
<p>DEP&#xC5D0; &#xB354;&#xD574; &#xC774;&#xB7EC;&#xD55C; mitigation&#xC774; &#xCD94;&#xAC00;&#xB418;&#xB294; &#xC774;&#xC720;&#xB294; &#xCEE4;&#xB110; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD55C; &#xB85C;&#xCEEC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC740; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xCD5C;&#xC18C; Medium Integrity &#xB808;&#xBCA8;&#xC5D0;&#xC11C;&#xC758; &#xC784;&#xC758; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC804;&#xC81C;&#xB85C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. (&#xADF8;&#xB798;&#xC11C; &#xC55E;&#xC11C; kASLR&#xC774; &#xCEE4;&#xB110; mitigation&#xC73C;&#xB85C;&#xB294; &#xD070; &#xD6A8;&#xACFC;&#xAC00; &#xC5C6;&#xB294; &#xC774;&#xC720;&#xC774;&#xAE30;&#xB3C4; &#xD558;&#xC8E0;!) SMEP&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xC5D0;&#xC11C; executable &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD574; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC62C;&#xB9AC;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC2E4; SMEP&#xC774; DEP&#xC5D0;&#xC11C; <code>&#xCEE4;&#xB110;&#x2194;&#xC720;&#xC800;</code> &#xB85C; &#xD655;&#xC7A5;&#xB41C; mitgation&#xC778; &#xB9CC;&#xD07C; &#xC6B0;&#xD68C;&#xB3C4; ROP &#xAC1C;&#xB150;&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD558;&#xBA74; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xB110; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0; &#xC788;&#xB294; &#xAC00;&#xC82F;&#xC744; &#xC0AC;&#xC6A9;&#xD574; cr4 &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xC784;&#xC758;&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xD328;&#xCE58;&#xD558;&#xBA74; SMEP&#xC744; disable&#xD558;&#xACE0; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xC758; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">pop rcx; ret
mov cr4, rcx; ret</code></pre>
<p><img src="image6.png" srcset="/img/loading.gif" alt="image.png"><br><img src="image7.png" srcset="/img/loading.gif" alt="image.png"></p>
<h3 id="kCFG-Kernel-Control-Flow-Guard"><a href="#kCFG-Kernel-Control-Flow-Guard" class="headerlink" title="kCFG(Kernel Control Flow Guard)"></a>kCFG(Kernel Control Flow Guard)</h3><p>kCFG&#xB294; &#xCEE4;&#xB110;&#xC758; Indirect Call &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC5D0; &#xC801;&#xC6A9;&#xB418;&#xB294; forward-edge CFI(Control Flow Integrity) mitigation&#xC785;&#xB2C8;&#xB2E4;. backward-edge CFI&#xC778; CET&#xB3C4; &#xC788;&#xC73C;&#xB098;, &#xC774;&#xBC88; &#xC2DC;&#xB9AC;&#xC988;&#xC5D0;&#xC11C; CET&#xB294; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB118;&#xC5B4;&#xAC00;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<p><img src="image8.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>__guard_disaptch_icall_fptr</code>&#xC774; &#xBC14;&#xB85C; &#xCEF4;&#xD30C;&#xC77C; &#xACFC;&#xC815;&#xC5D0;&#xC11C; cfg &#xD65C;&#xC131;&#xD654;&#xB85C; &#xCD94;&#xAC00;&#xB41C; runtime address sanitizer&#xB85C;, &#xD568;&#xC218; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xD638;&#xCD9C; &#xC804;&#xC5D0; &#xAC80;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xADF8;&#xB9BC;&#xC740; CFG &#xC791;&#xB3D9;&#xC744; &#xAC04;&#xB2E8;&#xD55C; &#xADF8;&#xB798;&#xD504;&#xB85C; &#xB098;&#xD0C0;&#xB0B8; &#xADF8;&#xB9BC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image9.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard">https://learn.microsoft.com/en-us/windows/win32/secbp/control-flow-guard</a></p>
</blockquote>
<p>kCFG&#xB294; &#xBE44;&#xD2B8;&#xB9F5;&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xCEE4;&#xB110; &#xD568;&#xC218;&#xC758; &#xC8FC;&#xC18C;&#xAC00; &#xC544;&#xB2CC; &#xC608;&#xC678;&#xB97C; throw&#xD574; <code>KERNEL_SECURITY_CHECK_FAILURE</code> &#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. kCFG&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/822.html">CWE-822: Untrusted Pointer Dereference</a> &#xC784;&#xC758;&#xC758; callback &#xD3EC;&#xC778;&#xD130; &#xC5ED;&#xCC38;&#xC870; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xB294;&#xB370;, &#xC774;&#xB7F0; kCFG&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xAC80;&#xC0AC;&#xB97C; &#xD1B5;&#xACFC;&#xD558;&#xB294; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xCEE4;&#xB110; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. callback &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC81C;&#xD55C;&#xC801;&#xC778; Arbitrary Read/Write&#xAC00; &#xAC00;&#xB2A5;&#xD55C; &#xCEE4;&#xB110; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, data corruption&#xC744; &#xD1B5;&#xD574; Full Arbitrary Read/Write &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xC5BB;&#xC5B4; Token Swapping&#xAE4C;&#xC9C0; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC8E0;.</p>
<p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xBD80;&#xD130;&#xB294; Windows built-in &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C; PreviousMode, SedebugPrivilege, IoRing&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xAE30;&#xBCF8;&#xC801;&#xC778; data corruption exploit &#xAE30;&#xBC95;&#xACFC; kCFG &#xC6B0;&#xD68C;&#xD558;&#xBA70; &#xC774;&#xB97C; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC870;&#xAE08; &#xB354; &#xB4E4;&#xC5B4;&#xAC00;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/">https://ctf-wiki.mahaloz.re/pwn/linux/kernel/bypass_smep/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.willsroot.io/2022/12/entrybleed.html">https://www.willsroot.io/2022/12/entrybleed.html</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/exploits-forsale/prefetch-tool">https://github.com/exploits-forsale/prefetch-tool</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://windows-internals.com/kaslr-leaks-restriction/">https://windows-internals.com/kaslr-leaks-restriction/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://exploits.forsale/24h2-nt-exploit/">https://exploits.forsale/24h2-nt-exploit/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md">https://github.com/nccgroup/exploit_mitigations/blob/main/windows_mitigations.md</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/">https://www.crowdstrike.com/en-us/blog/state-of-exploit-development-part-1/</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/mitigation/">mitigation</a>
                  
                  <a class="hover-with-bg" href="/tags/smep/">smep</a>
                  
                  <a class="hover-with-bg" href="/tags/kcfg/">kcfg</a>
                  
                  <a class="hover-with-bg" href="/tags/dep/">dep</a>
                  
                  <a class="hover-with-bg" href="/tags/exploit-techniques/">exploit techniques</a>
                  
                  <a class="hover-with-bg" href="/tags/kaslr/">kaslr</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Bypassing Windows Kernel Mitigations: Part1 - Overview (En)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/12/07/j0ker/2024-12-07/">
                    <span class="hidden-mobile">[] CVE-2024-38144 : Windows 11 ksthunk.sys Integer Overflow  LPE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/';
        this.page.identifier = '/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Bypassing Windows Kernel Mitigations: Part1 - Overview (Ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
