

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! pwndorei&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xBD80;&amp;#xD130;  L0ch&amp;#xB2D8;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; Hyper-V 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD55C; &amp;#xAE00;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Hyper-V &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC5F0;&amp;#xC7AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xC804; &lt;a href=&#34;https://hackyboiz.github.io/2021/01/31/l0ch/pwncoolsexy-part1/&#34;&gt;Pwn Cool Sexy&lt;/a&gt;&amp;#xB77C;&amp;#xB294; &amp;#xBBF8;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9B0; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC13C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900; L0ch&amp;#xAC00; &amp;#xC815;&amp;#xD55C; &amp;#xC800;&amp;#xD76C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xBB34;&amp;#xB824; NewJeans&amp;#x2019; Hyper-V&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xBC88; &amp;#xCCAB; &amp;#xAE00;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; Hyper-V&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Hyper-V&#34;&gt;&lt;a href=&#34;#Hyper-V&#34; class=&#34;headerlink&#34; title=&#34;Hyper-V&#34;&gt;&lt;/a&gt;Hyper-V&lt;/h1&gt;&lt;p&gt;Hyper-V&amp;#xB294; Microsoft&amp;#xC758; Type 1 Hypervisor&amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMware&amp;#xB098; VirtualBox&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Type 2 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; VMware Workstation, Play&amp;#xC640; VirtualBox &amp;#xB4F1;&amp;#xC774; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; Type 1 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Hyper-V&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC758; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xB294; Type 1&amp;#xACFC; Type 2&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://ko.wikipedia.org/wiki/%ED%95%98%EC%9D%B4%ED%8D%BC%EB%B0%94%EC%9D%B4%EC%A0%80&#34;&gt;Wikipedia&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xB7F0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB294; &amp;#xC5B4;&amp;#xC9F8;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xC0AC;&amp;#xB791;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; VMware&amp;#xB098; VirtualBox &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBCF4;&amp;#xC168;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xC801;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; OS&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB3C4; &amp;#xCC98;&amp;#xC74C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C; &amp;#xACC4;&amp;#xAE30;&amp;#xAC00; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Ubuntu&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xB4E4;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xACA9;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xC5D0;&amp;#xC11C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB098; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB4F1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Hyper-V-Architecture&#34;&gt;&lt;a href=&#34;#Hyper-V-Architecture&#34; class=&#34;headerlink&#34; title=&#34;Hyper-V Architecture&#34;&gt;&lt;/a&gt;Hyper-V Architecture&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image.gif&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://learn.microsoft.com/en-us/virtualization/hyper-v-on-windows/reference/hyper-v-architecture&#34;&gt;Microsoft&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xB294; &lt;del&gt;&amp;#xD55C;&amp;#xB3D9;&amp;#xC548; &amp;#xC81C; &amp;#xBC14;&amp;#xD0D5;&amp;#xD654;&amp;#xBA74;&amp;#xC774;&amp;#xC5C8;&amp;#xB358;&lt;/del&gt; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xBCC0; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA74; &amp;#xB192;&amp;#xC740; &amp;#xD655;&amp;#xB960;&amp;#xB85C; &amp;#xB208;&amp;#xC0B4;&amp;#xC744; &amp;#xCC0C;&amp;#xD478;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADF8;&amp;#xB7FC; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0; &amp;#xB098;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xC529; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Partition&#34;&gt;&lt;a href=&#34;#Partition&#34; class=&#34;headerlink&#34; title=&#34;Partition&#34;&gt;&lt;/a&gt;Partition&lt;/h1&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4; &amp;#xB4F1;&amp;#xC758; &amp;#xC5C5;&amp;#xBB34; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC45;&amp;#xC0C1;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xCC98;&amp;#xB7FC; Hyper-V&amp;#xC758; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801; &amp;#xACA9;&amp;#xB9AC;&amp;#xC758; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C;&amp;#xC11C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAC04;&amp;#xC758; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xD2F0;&amp;#xC158; &amp;#xAC04;&amp;#xC758; &amp;#xACA9;&amp;#xB9AC;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC758; EPT(&amp;#xD655;&amp;#xC7A5; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;)&amp;#xC5D0; &amp;#xC758;&amp;#xD55C; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xAC04; &amp;#xAC04;&amp;#xC12D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xACFC; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB2E4;&amp;#xC2DC; Enlightened &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Enlightened&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xBA3C;&amp;#xC800; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Root-Partition&#34;&gt;&lt;a href=&#34;#Root-Partition&#34; class=&#34;headerlink&#34; title=&#34;Root Partition&#34;&gt;&lt;/a&gt;Root Partition&lt;/h2&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB294; &amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; Windows&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xAC04; &amp;#xAC04;&amp;#xC12D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Child-Partition&#34;&gt;&lt;a href=&#34;#Child-Partition&#34; class=&#34;headerlink&#34; title=&#34;Child Partition&#34;&gt;&lt;/a&gt;Child Partition&lt;/h2&gt;&lt;p&gt;&amp;#xBC18;&amp;#xBA74; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; WinHv(LinuxHv)&amp;#xB098; VMBus &amp;#xB4F1;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;Enlightened&#34;&gt;&lt;a href=&#34;#Enlightened&#34; class=&#34;headerlink&#34; title=&#34;Enlightened&#34;&gt;&lt;/a&gt;Enlightened&lt;/h3&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; Enlightened &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB098;&amp;#xB25C;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xB294;&amp;#xB370; Enlightened&amp;#xB97C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBB34;&amp;#xB824; &amp;#x201C;&amp;#xACC4;&amp;#xBABD;&amp;#xD55C;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xB2E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xACC4;&amp;#xBABD;&amp;#xD55C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#x2026; &amp;#xBB54;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC758;&amp;#xBBF8;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; Enlightened&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xAD6C;&amp;#xB3D9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC57D; &amp;#xC904;&amp;#xAE4C; &amp;#xD30C;&amp;#xB780;&amp;#xC57D; &amp;#xC904;&amp;#xAE4C;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Enlightened &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Enlightend I/O &amp;#xB77C;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC785;&amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;(para-virtualized)&amp;#xB41C; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC5B4; &amp;#xB354; &amp;#xBE60;&amp;#xB978; &amp;#xC785;&amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; VMMS&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;VMMS&#34;&gt;&lt;a href=&#34;#VMMS&#34; class=&#34;headerlink&#34; title=&#34;VMMS&#34;&gt;&lt;/a&gt;VMMS&lt;/h1&gt;&lt;p&gt;VMMS(Virtual Machine Management Service)&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xD6C4;&amp;#xC220;&amp;#xD560; WMI&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0; &amp;#xAD00;&amp;#xB9AC; &amp;#xBC0F; &amp;#xC81C;&amp;#xC5B4; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0DD;&amp;#xC131;/&amp;#xC81C;&amp;#xAC70;&amp;#xB294; &amp;#xBB3C;&amp;#xB860; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC758; &amp;#xC218;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC6A9;&amp;#xB7C9;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC790;&amp;#xC6D0; &amp;#xB4F1; &amp;#xB610;&amp;#xD55C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C8; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD560; VMWP&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; VMMS &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; WMI&amp;#xC5D0;&amp;#xC11C; VID&amp;#xC5D0; &amp;#xD654;&amp;#xC0B4;&amp;#xD45C;&amp;#xAC00; &amp;#xBED7;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB2E4;&amp;#xC2DC; VID&amp;#xC5D0;&amp;#xC11C; WinHv&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Hypercall&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;? &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;WMI&#34;&gt;&lt;a href=&#34;#WMI&#34; class=&#34;headerlink&#34; title=&#34;WMI&#34;&gt;&lt;/a&gt;WMI&lt;/h2&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC120; WMI(Windows Management Instrumentation)&amp;#xB97C; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC758; WBEM(&amp;#xC6F9; &amp;#xAE30;&amp;#xBC18; &amp;#xC5D4;&amp;#xD130;&amp;#xD504;&amp;#xB77C;&amp;#xC774;&amp;#xC988; &amp;#xAD00;&amp;#xB9AC;) &amp;#xAD6C;&amp;#xD604;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. WMI&amp;#xB294; CIM(Common Information Model)&lt;br&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xACFC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;, &amp;#xC7A5;&amp;#xCE58; &amp;#xB4F1; &amp;#xAD00;&amp;#xB9AC; &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Powershell, wmic, wbemtest &amp;#xB4F1;&amp;#xC758; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; WMI&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Hyper-V&amp;#xC6A9; WMI Provider&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC804;&amp;#xC6D0;, &amp;#xAC80;&amp;#xC0AC;&amp;#xC810; &amp;#xB4F1;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; VMMS&amp;#xB3C4; WMI&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC81C;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; Hyper-V&amp;#xC758; Emulated Device &amp;#xD37C;&amp;#xC800;&amp;#xC778; &lt;a href=&#34;https://github.com/googleprojectzero/hyntrospect/&#34;&gt;Hyntrospect&lt;/a&gt;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC80;&amp;#xC0AC;&amp;#xC810;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Hyntrospect&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;VID&#34;&gt;&lt;a href=&#34;#VID&#34; class=&#34;headerlink&#34; title=&#34;VID&#34;&gt;&lt;/a&gt;VID&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; WMI&amp;#xB294; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370; VID&amp;#xB294; &amp;#xB610; &amp;#xBB58;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; VID(Virtual Infrastructure Driver)&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; Infrastructure &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB098; &amp;#xC790;&amp;#xC6D0;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xB05D;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;.&lt;/p&gt;
&lt;h2 id=&#34;WinHv-LinuxHv-&amp;#xC9C4;&amp;#xC9DC;-&amp;#xB05D;&#34;&gt;&lt;a href=&#34;#WinHv-LinuxHv-&amp;#xC9C4;&amp;#xC9DC;-&amp;#xB05D;&#34; class=&#34;headerlink&#34; title=&#34;WinHv(LinuxHv) &amp;#xC9C4;&amp;#xC9DC; &amp;#xB05D;&#34;&gt;&lt;/a&gt;WinHv(LinuxHv) &lt;del&gt;&amp;#xC9C4;&amp;#xC9DC; &amp;#xB05D;&lt;/del&gt;&lt;/h2&gt;&lt;p&gt;WinHv&amp;#xB294; Windows HyperVisor &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB85C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774;&amp;#xB098; Windows &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WinHv, &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; LinuxHv&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB984; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC640;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC774; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; Hypercall&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Hyper-V &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C; &amp;#xC218;&amp;#xB098; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xBA74; WMI, VID, WinHv&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;VMWP&#34;&gt;&lt;a href=&#34;#VMWP&#34; class=&#34;headerlink&#34; title=&#34;VMWP&#34;&gt;&lt;/a&gt;VMWP&lt;/h1&gt;&lt;p&gt;VMWP(Virtual Machine Worker Process)&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; VMMS&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xBD80;&amp;#xD305;&amp;#xB420; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; vmwp.exe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. vmwp.exe&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Virtual Device&lt;/li&gt;
&lt;li&gt;Integrated Components&lt;/li&gt;
&lt;li&gt;Plan9FS&lt;/li&gt;
&lt;li&gt;vSMB Server&lt;br&gt;&amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; Virtual Device&amp;#xC640; Integrated Component&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Integrated-Component&#34;&gt;&lt;a href=&#34;#Integrated-Component&#34; class=&#34;headerlink&#34; title=&#34;Integrated Component&#34;&gt;&lt;/a&gt;Integrated Component&lt;/h2&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Hyper-V Heartbeat Service&lt;ul&gt;
&lt;li&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBD80;&amp;#xD305;&amp;#xD588;&amp;#xB294;&amp;#xC9C0;, &amp;#xB610;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hyper-V Guest Shutdown Service&lt;/li&gt;
&lt;li&gt;Hyper-v volume shadow copy requestor&lt;ul&gt;
&lt;li&gt;&amp;#xAC80;&amp;#xC0AC;&amp;#xC810;(Checkpoint) &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hyper-V Time Synchronization&lt;ul&gt;
&lt;li&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Virtual-Device&#34;&gt;&lt;a href=&#34;#Virtual-Device&#34; class=&#34;headerlink&#34; title=&#34;Virtual Device&#34;&gt;&lt;/a&gt;Virtual Device&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xAE4C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xC138; &amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Emulated Device&lt;/li&gt;
&lt;li&gt;Para-virtualized Device&lt;/li&gt;
&lt;li&gt;Direct Access(Passthrough)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Para-virtualized Device&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xB4DC;&amp;#xB838;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; Emulated Device&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;Emulated Device&amp;#xB294; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD2B8;&amp;#xB41C; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; vmwp.exe&amp;#xB098; vmwp.exe&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; VmEmulatedStorage.dll, VmEmulatedNic.dll &amp;#xB4F1;&amp;#xC758; dll&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;Direct Access&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Emulated Device&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; vmwp&amp;#xC5D0; &amp;#xC788;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC740; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC904; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD2B8;&amp;#xB418;&amp;#xACE0; VID &amp;#xC54C;&amp;#xB9BC;(Notification)&amp;#xC774;&amp;#xB780;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; VND(VID Notification Dispatcher)&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; VID &amp;#xC54C;&amp;#xB9BC;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; vmwp&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Instruction-Decoder&#34;&gt;&lt;a href=&#34;#Instruction-Decoder&#34; class=&#34;headerlink&#34; title=&#34;Instruction Decoder&#34;&gt;&lt;/a&gt;Instruction Decoder&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;in&lt;/code&gt;, &lt;code&gt;out&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; port io&amp;#xB098; mmio &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;(Driver)&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;(VMWP) &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; context &amp;#xC804;&amp;#xD658;(vmentry/vmexit)&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xBC00;&amp;#xC9D1;&amp;#xB41C;(Intercept-intensive) &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC548;&amp;#xB418;&amp;#xB294; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xB098;&amp;#xC640; &amp;#xBC84;&amp;#xB9AC;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; vmwp&amp;#xC5D0;&amp;#xB294; x86&amp;#xACFC; x64 &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &lt;code&gt;EmulatorVp&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IO &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xD6C4; &amp;#xBC14;&amp;#xB85C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; vmwp&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; instruction&amp;#xB3C4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; vmwp&amp;#xC758; context&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;VMBus-amp-VSP-amp-VSC&#34;&gt;&lt;a href=&#34;#VMBus-amp-VSP-amp-VSC&#34; class=&#34;headerlink&#34; title=&#34;VMBus &amp;amp; VSP &amp;amp; VSC&#34;&gt;&lt;/a&gt;VMBus &amp;amp; VSP &amp;amp; VSC&lt;/h1&gt;&lt;p&gt;Emulated Device&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; Para-virtualized Device&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B4; &amp;#xB54C; Enlightened Child Partition&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; Enlightened I/O&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBC1C;&amp;#xD718;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500; &amp;#xB4DC;&amp;#xB838;&amp;#xB294;&amp;#xB370;&amp;#xC694;? Para-virtualized device stack&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; VMBus, VSP, VSC&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;VMBus&#34;&gt;&lt;a href=&#34;#VMBus&#34; class=&#34;headerlink&#34; title=&#34;VMBus&#34;&gt;&lt;/a&gt;VMBus&lt;/h2&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; VMBus&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMBus&amp;#xB294; Hyper-V&amp;#xAC00; &amp;#xBC18;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSP&amp;#xC640; VSC&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMBus&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; ring buffer&amp;#xB85C; &amp;#xCC44;&amp;#xB110; &amp;#xB2F9; upstream&amp;#xACFC; downstream&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xAC70;&amp;#xB098; &amp;#xBC1B;&amp;#xC744; &amp;#xC218;  &amp;#xC788;&amp;#xACE0; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1; &amp;#xC778;&amp;#xD130;&amp;#xB7FD;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSP&amp;#xB098; VSC&amp;#xC5D0; &amp;#xC54C;&amp;#xB824;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; GPADL(Guest Physical Address Descriptor List)&amp;#xB97C; &amp;#xCCA8;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xB824;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;VSC-Virtualization-Service-Consumer&#34;&gt;&lt;a href=&#34;#VSC-Virtualization-Service-Consumer&#34; class=&#34;headerlink&#34; title=&#34;VSC(Virtualization Service Consumer)&#34;&gt;&lt;/a&gt;VSC(Virtualization Service Consumer)&lt;/h2&gt;&lt;p&gt;VSC&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; IO &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; VSP&amp;#xC5D0;&amp;#xAC8C;&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;VSP-Virtualization-Service-Provider&#34;&gt;&lt;a href=&#34;#VSP-Virtualization-Service-Provider&#34; class=&#34;headerlink&#34; title=&#34;VSP(Virtualization Service Provider)&#34;&gt;&lt;/a&gt;VSP(Virtualization Service Provider)&lt;/h2&gt;&lt;p&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; VMBus&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSC&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; I/O Stack&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Hypervisor&#34;&gt;&lt;a href=&#34;#Hypervisor&#34; class=&#34;headerlink&#34; title=&#34;Hypervisor&#34;&gt;&lt;/a&gt;Hypervisor&lt;/h1&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x2026; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xB9CE;&amp;#xC740; &amp;#xB9CC;&amp;#xD07C; &amp;#xC804;&amp;#xBD80; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;del&gt;&amp;#xC804;&amp;#xBD80; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xBA74; &amp;#xB9C8;&amp;#xC18C;&amp;#xC5D0; &amp;#xAC14;&amp;#xACA0;&amp;#xC9C0;&lt;/del&gt; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB531; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xACE8;&amp;#xB77C;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC55E; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xACC4;&amp;#xC18D; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xAC00; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xBB54;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB05D;&amp;#xB098;&amp;#xBA74; &amp;#xCC1D;&amp;#xCC1D;&amp;#xD558;&amp;#xC796;&amp;#xC544;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;Hypercall&#34;&gt;&lt;a href=&#34;#Hypercall&#34; class=&#34;headerlink&#34; title=&#34;Hypercall&#34;&gt;&lt;/a&gt;Hypercall&lt;/h2&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xD638;&amp;#xCD9C; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; ring3&amp;#xC5D0;&amp;#xC11C; ring0&amp;#xB85C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC2A4;&amp;#xC704;&amp;#xCE6D;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; ring 0&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB85C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC2A4;&amp;#xC704;&amp;#xCE6D;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xCEE4;&amp;#xB110; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838;&amp;#xC57C; &amp;#xD558;&amp;#xACE0; &lt;code&gt;vmcall&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;vmmcall&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xC804;&amp;#xB2EC;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C;&amp;#xACFC; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Classes&#34;&gt;&lt;a href=&#34;#Hypercall-Classes&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Classes&#34;&gt;&lt;/a&gt;Hypercall Classes&lt;/h3&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xB294; simple&amp;#xACFC; repeat, &amp;#xB450; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. simple &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xD55C; &amp;#xBC88;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xC778;&amp;#xD48B;, &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. repeat &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; simple &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xC778;&amp;#xD48B;/&amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Input-Output&#34;&gt;&lt;a href=&#34;#Hypercall-Input-Output&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Input/Output&#34;&gt;&lt;/a&gt;Hypercall Input/Output&lt;/h3&gt;&lt;h4 id=&#34;Input&#34;&gt;&lt;a href=&#34;#Input&#34; class=&#34;headerlink&#34; title=&#34;Input&#34;&gt;&lt;/a&gt;Input&lt;/h4&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; x86-64&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; call code&amp;#xB97C; rax&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; Hyper-V&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; RCX&amp;#xC5D0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf&#34;&gt;MicrosoftDocs&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;Call Code: &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xBC88;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;Fast: &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD638;&amp;#xCD9C; &amp;#xADDC;&amp;#xC57D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD568;(1), &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;(0)&lt;/li&gt;
&lt;li&gt;Variabe Header Size: variable header&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;Is Nested: &amp;#xC911;&amp;#xCCA9; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; L0 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;(&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD568;(1), &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xB9AC;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(0)&lt;/li&gt;
&lt;li&gt;Rep Count: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD560; &amp;#xD69F;&amp;#xC218;, Simple&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Rep Start Index: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC18;&amp;#xBCF5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;, Simple&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;RsvdZ: &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD544;, &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;h5 id=&#34;Parameter&#34;&gt;&lt;a href=&#34;#Parameter&#34; class=&#34;headerlink&#34; title=&#34;Parameter&#34;&gt;&lt;/a&gt;Parameter&lt;/h5&gt;&amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C;  Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; RDX&amp;#xC640; R8&amp;#xC5D0; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; Non-Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; RDX&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Fast(Register-Based)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xC0DD;&amp;#xB7B5;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Fast&amp;#xC778; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Non-Fast(Memory-Based)&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; GPA(Guest Physical Address)&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; Align&amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xB9CC; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; list&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xACB9;&amp;#xCE58;&amp;#xAC70;&amp;#xB098; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xACBD;&amp;#xACC4;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Fast &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xACA8;&amp;#xC6B0; &amp;#xB450; &amp;#xAC1C;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC9C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; Extended Fast Hypercall(XMM Fast Hypercall)&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xC874; RDX&amp;#xC640; R8 &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; XMM0 ~ XMM5&amp;#xAE4C;&amp;#xC9C0; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xCD5C;&amp;#xB300; 112 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h4 id=&#34;Output&#34;&gt;&lt;a href=&#34;#Output&#34; class=&#34;headerlink&#34; title=&#34;Output&#34;&gt;&lt;/a&gt;Output&lt;/h4&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; 64&amp;#xBE44;&amp;#xD2B8;&amp;#xC758; Hypercall result &amp;#xAC12;&amp;#xC774; RAX(x86&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; EAX:EDX)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18;&amp;#xD658;&amp;#xB418;&amp;#xACE0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf&#34;&gt;MicrosoftDocs&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;Result: &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; HV_STATUS &amp;#xCF54;&amp;#xB4DC;(&amp;#xC131;&amp;#xACF5; &amp;#xD639;&amp;#xC740; &amp;#xC2E4;&amp;#xD328;)&lt;/li&gt;
&lt;li&gt;Reps Complete: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC644;&amp;#xC218;&amp;#xB41C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD69F;&amp;#xC218;&lt;/li&gt;
&lt;li&gt;Rsvd: &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC12;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xBA74; Non-Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; R8&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0; Extended Fast Hypercall&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Continuation&#34;&gt;&lt;a href=&#34;#Hypercall-Continuation&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Continuation&#34;&gt;&lt;/a&gt;Hypercall Continuation&lt;/h3&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC0AC;&amp;#xC774;&amp;#xD074;&amp;#xC744; &amp;#xC7A1;&amp;#xC544;&amp;#xBA39;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC57D; 50 &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xCD08; &amp;#xC774;&amp;#xD558;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB2E4; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC81C;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; &amp;#xC81C;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB098;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xC644;&amp;#xB8CC; &amp;#xC5EC;&amp;#xBD80;&amp;#xC640; &amp;#xC0C1;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; Instruction Pointer&amp;#xAC00; &amp;#xC6C0;&amp;#xC9C1;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xD6C4; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &lt;del&gt;&amp;#xAC04;&amp;#xB7B5;&amp;#xD788;&lt;/del&gt; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xC800;&amp;#xB3C4; &amp;#xC544;&amp;#xC9C1; &amp;#xBD80;&amp;#xC871;&amp;#xD574;&amp;#xC11C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB4DC;&amp;#xB9B4; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;del&gt;&amp;#xD0DC;&amp;#xD074;&amp;#xC740; &amp;#xC5B8;&amp;#xC81C;&amp;#xB098; &amp;#xD658;&amp;#xC601;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC740; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; VSP&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; VSC&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; vmwp&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC758; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC740; vmwp&amp;#xC758; IDE &amp;#xC7A5;&amp;#xCE58; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; VM Escape&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; CVE-2018-0959 &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] NewJeans&#39; Hyper-V Part 1 - Hyper-V Architecture - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! pwndorei&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xBD80;&amp;#xD130;  L0ch&amp;#xB2D8;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; Hyper-V 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD55C; &amp;#xAE00;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Hyper-V &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xC5F0;&amp;#xC7AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xC804; &lt;a href=&#34;https://hackyboiz.github.io/2021/01/31/l0ch/pwncoolsexy-part1/&#34;&gt;Pwn Cool Sexy&lt;/a&gt;&amp;#xB77C;&amp;#xB294; &amp;#xBBF8;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9B0; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC13C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900; L0ch&amp;#xAC00; &amp;#xC815;&amp;#xD55C; &amp;#xC800;&amp;#xD76C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xBB34;&amp;#xB824; NewJeans&amp;#x2019; Hyper-V&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xBC88; &amp;#xCCAB; &amp;#xAE00;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; Hyper-V&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Hyper-V&#34;&gt;&lt;a href=&#34;#Hyper-V&#34; class=&#34;headerlink&#34; title=&#34;Hyper-V&#34;&gt;&lt;/a&gt;Hyper-V&lt;/h1&gt;&lt;p&gt;Hyper-V&amp;#xB294; Microsoft&amp;#xC758; Type 1 Hypervisor&amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMware&amp;#xB098; VirtualBox&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Type 2 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; VMware Workstation, Play&amp;#xC640; VirtualBox &amp;#xB4F1;&amp;#xC774; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xC758; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; Type 1 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Hyper-V&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC758; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xB294; Type 1&amp;#xACFC; Type 2&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://ko.wikipedia.org/wiki/%ED%95%98%EC%9D%B4%ED%8D%BC%EB%B0%94%EC%9D%B4%EC%A0%80&#34;&gt;Wikipedia&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xB7F0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB294; &amp;#xC5B4;&amp;#xC9F8;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xC0AC;&amp;#xB791;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; VMware&amp;#xB098; VirtualBox &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBCF4;&amp;#xC168;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xC801;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; OS&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB3C4; &amp;#xCC98;&amp;#xC74C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C; &amp;#xACC4;&amp;#xAE30;&amp;#xAC00; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Ubuntu&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xB4E4;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xACA9;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xC5D0;&amp;#xC11C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB098; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB4F1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Hyper-V-Architecture&#34;&gt;&lt;a href=&#34;#Hyper-V-Architecture&#34; class=&#34;headerlink&#34; title=&#34;Hyper-V Architecture&#34;&gt;&lt;/a&gt;Hyper-V Architecture&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image.gif&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://learn.microsoft.com/en-us/virtualization/hyper-v-on-windows/reference/hyper-v-architecture&#34;&gt;Microsoft&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xB294; &lt;del&gt;&amp;#xD55C;&amp;#xB3D9;&amp;#xC548; &amp;#xC81C; &amp;#xBC14;&amp;#xD0D5;&amp;#xD654;&amp;#xBA74;&amp;#xC774;&amp;#xC5C8;&amp;#xB358;&lt;/del&gt; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xBCC0; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA74; &amp;#xB192;&amp;#xC740; &amp;#xD655;&amp;#xB960;&amp;#xB85C; &amp;#xB208;&amp;#xC0B4;&amp;#xC744; &amp;#xCC0C;&amp;#xD478;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADF8;&amp;#xB7FC; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0; &amp;#xB098;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xC529; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Partition&#34;&gt;&lt;a href=&#34;#Partition&#34; class=&#34;headerlink&#34; title=&#34;Partition&#34;&gt;&lt;/a&gt;Partition&lt;/h1&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4; &amp;#xB4F1;&amp;#xC758; &amp;#xC5C5;&amp;#xBB34; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC45;&amp;#xC0C1;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xCC98;&amp;#xB7FC; Hyper-V&amp;#xC758; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801; &amp;#xACA9;&amp;#xB9AC;&amp;#xC758; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C;&amp;#xC11C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAC04;&amp;#xC758; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xD2F0;&amp;#xC158; &amp;#xAC04;&amp;#xC758; &amp;#xACA9;&amp;#xB9AC;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC758; EPT(&amp;#xD655;&amp;#xC7A5; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;)&amp;#xC5D0; &amp;#xC758;&amp;#xD55C; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xAC04; &amp;#xAC04;&amp;#xC12D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xACFC; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB2E4;&amp;#xC2DC; Enlightened &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Enlightened&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xBA3C;&amp;#xC800; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Root-Partition&#34;&gt;&lt;a href=&#34;#Root-Partition&#34; class=&#34;headerlink&#34; title=&#34;Root Partition&#34;&gt;&lt;/a&gt;Root Partition&lt;/h2&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB294; &amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; Windows&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xACA9;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xAC04; &amp;#xAC04;&amp;#xC12D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Child-Partition&#34;&gt;&lt;a href=&#34;#Child-Partition&#34; class=&#34;headerlink&#34; title=&#34;Child Partition&#34;&gt;&lt;/a&gt;Child Partition&lt;/h2&gt;&lt;p&gt;&amp;#xBC18;&amp;#xBA74; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; WinHv(LinuxHv)&amp;#xB098; VMBus &amp;#xB4F1;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;Enlightened&#34;&gt;&lt;a href=&#34;#Enlightened&#34; class=&#34;headerlink&#34; title=&#34;Enlightened&#34;&gt;&lt;/a&gt;Enlightened&lt;/h3&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; Enlightened &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB098;&amp;#xB25C;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xB294;&amp;#xB370; Enlightened&amp;#xB97C; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBB34;&amp;#xB824; &amp;#x201C;&amp;#xACC4;&amp;#xBABD;&amp;#xD55C;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xB2E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xACC4;&amp;#xBABD;&amp;#xD55C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#x2026; &amp;#xBB54;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC758;&amp;#xBBF8;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC; Enlightened&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xAD6C;&amp;#xB3D9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC57D; &amp;#xC904;&amp;#xAE4C; &amp;#xD30C;&amp;#xB780;&amp;#xC57D; &amp;#xC904;&amp;#xAE4C;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Enlightened &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Enlightend I/O &amp;#xB77C;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC785;&amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;(para-virtualized)&amp;#xB41C; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC5B4; &amp;#xB354; &amp;#xBE60;&amp;#xB978; &amp;#xC785;&amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; VMMS&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;VMMS&#34;&gt;&lt;a href=&#34;#VMMS&#34; class=&#34;headerlink&#34; title=&#34;VMMS&#34;&gt;&lt;/a&gt;VMMS&lt;/h1&gt;&lt;p&gt;VMMS(Virtual Machine Management Service)&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xD6C4;&amp;#xC220;&amp;#xD560; WMI&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0; &amp;#xAD00;&amp;#xB9AC; &amp;#xBC0F; &amp;#xC81C;&amp;#xC5B4; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0DD;&amp;#xC131;/&amp;#xC81C;&amp;#xAC70;&amp;#xB294; &amp;#xBB3C;&amp;#xB860; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC758; &amp;#xC218;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC6A9;&amp;#xB7C9;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC790;&amp;#xC6D0; &amp;#xB4F1; &amp;#xB610;&amp;#xD55C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C8; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD560; VMWP&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; VMMS &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; WMI&amp;#xC5D0;&amp;#xC11C; VID&amp;#xC5D0; &amp;#xD654;&amp;#xC0B4;&amp;#xD45C;&amp;#xAC00; &amp;#xBED7;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB2E4;&amp;#xC2DC; VID&amp;#xC5D0;&amp;#xC11C; WinHv&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Hypercall&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;? &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;WMI&#34;&gt;&lt;a href=&#34;#WMI&#34; class=&#34;headerlink&#34; title=&#34;WMI&#34;&gt;&lt;/a&gt;WMI&lt;/h2&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC120; WMI(Windows Management Instrumentation)&amp;#xB97C; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC758; WBEM(&amp;#xC6F9; &amp;#xAE30;&amp;#xBC18; &amp;#xC5D4;&amp;#xD130;&amp;#xD504;&amp;#xB77C;&amp;#xC774;&amp;#xC988; &amp;#xAD00;&amp;#xB9AC;) &amp;#xAD6C;&amp;#xD604;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. WMI&amp;#xB294; CIM(Common Information Model)&lt;br&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xACFC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;, &amp;#xC7A5;&amp;#xCE58; &amp;#xB4F1; &amp;#xAD00;&amp;#xB9AC; &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Powershell, wmic, wbemtest &amp;#xB4F1;&amp;#xC758; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; WMI&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Hyper-V&amp;#xC6A9; WMI Provider&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC804;&amp;#xC6D0;, &amp;#xAC80;&amp;#xC0AC;&amp;#xC810; &amp;#xB4F1;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; VMMS&amp;#xB3C4; WMI&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC81C;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; Hyper-V&amp;#xC758; Emulated Device &amp;#xD37C;&amp;#xC800;&amp;#xC778; &lt;a href=&#34;https://github.com/googleprojectzero/hyntrospect/&#34;&gt;Hyntrospect&lt;/a&gt;&amp;#xAC00; &amp;#xD0C0;&amp;#xAC9F; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC80;&amp;#xC0AC;&amp;#xC810;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Hyntrospect&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;VID&#34;&gt;&lt;a href=&#34;#VID&#34; class=&#34;headerlink&#34; title=&#34;VID&#34;&gt;&lt;/a&gt;VID&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; WMI&amp;#xB294; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370; VID&amp;#xB294; &amp;#xB610; &amp;#xBB58;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; VID(Virtual Infrastructure Driver)&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; Infrastructure &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB098; &amp;#xC790;&amp;#xC6D0;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xB05D;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;.&lt;/p&gt;
&lt;h2 id=&#34;WinHv-LinuxHv-&amp;#xC9C4;&amp;#xC9DC;-&amp;#xB05D;&#34;&gt;&lt;a href=&#34;#WinHv-LinuxHv-&amp;#xC9C4;&amp;#xC9DC;-&amp;#xB05D;&#34; class=&#34;headerlink&#34; title=&#34;WinHv(LinuxHv) &amp;#xC9C4;&amp;#xC9DC; &amp;#xB05D;&#34;&gt;&lt;/a&gt;WinHv(LinuxHv) &lt;del&gt;&amp;#xC9C4;&amp;#xC9DC; &amp;#xB05D;&lt;/del&gt;&lt;/h2&gt;&lt;p&gt;WinHv&amp;#xB294; Windows HyperVisor &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB85C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC774;&amp;#xB098; Windows &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WinHv, &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; LinuxHv&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB984; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC640;&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC774; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; Hypercall&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Hyper-V &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C; &amp;#xC218;&amp;#xB098; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xBA74; WMI, VID, WinHv&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;VMWP&#34;&gt;&lt;a href=&#34;#VMWP&#34; class=&#34;headerlink&#34; title=&#34;VMWP&#34;&gt;&lt;/a&gt;VMWP&lt;/h1&gt;&lt;p&gt;VMWP(Virtual Machine Worker Process)&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; VMMS&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xBD80;&amp;#xD305;&amp;#xB420; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; vmwp.exe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. vmwp.exe&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Virtual Device&lt;/li&gt;
&lt;li&gt;Integrated Components&lt;/li&gt;
&lt;li&gt;Plan9FS&lt;/li&gt;
&lt;li&gt;vSMB Server&lt;br&gt;&amp;#xC774; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; Virtual Device&amp;#xC640; Integrated Component&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Integrated-Component&#34;&gt;&lt;a href=&#34;#Integrated-Component&#34; class=&#34;headerlink&#34; title=&#34;Integrated Component&#34;&gt;&lt;/a&gt;Integrated Component&lt;/h2&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Hyper-V Heartbeat Service&lt;ul&gt;
&lt;li&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBD80;&amp;#xD305;&amp;#xD588;&amp;#xB294;&amp;#xC9C0;, &amp;#xB610;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hyper-V Guest Shutdown Service&lt;/li&gt;
&lt;li&gt;Hyper-v volume shadow copy requestor&lt;ul&gt;
&lt;li&gt;&amp;#xAC80;&amp;#xC0AC;&amp;#xC810;(Checkpoint) &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hyper-V Time Synchronization&lt;ul&gt;
&lt;li&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Virtual-Device&#34;&gt;&lt;a href=&#34;#Virtual-Device&#34; class=&#34;headerlink&#34; title=&#34;Virtual Device&#34;&gt;&lt;/a&gt;Virtual Device&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xAE4C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xC138; &amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Emulated Device&lt;/li&gt;
&lt;li&gt;Para-virtualized Device&lt;/li&gt;
&lt;li&gt;Direct Access(Passthrough)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Para-virtualized Device&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xB4DC;&amp;#xB838;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; Emulated Device&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;Emulated Device&amp;#xB294; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD2B8;&amp;#xB41C; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; vmwp.exe&amp;#xB098; vmwp.exe&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; VmEmulatedStorage.dll, VmEmulatedNic.dll &amp;#xB4F1;&amp;#xC758; dll&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;Direct Access&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Emulated Device&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; vmwp&amp;#xC5D0; &amp;#xC788;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC740; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC904; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD2B8;&amp;#xB418;&amp;#xACE0; VID &amp;#xC54C;&amp;#xB9BC;(Notification)&amp;#xC774;&amp;#xB780;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; VND(VID Notification Dispatcher)&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; VID &amp;#xC54C;&amp;#xB9BC;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; vmwp&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Instruction-Decoder&#34;&gt;&lt;a href=&#34;#Instruction-Decoder&#34; class=&#34;headerlink&#34; title=&#34;Instruction Decoder&#34;&gt;&lt;/a&gt;Instruction Decoder&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;in&lt;/code&gt;, &lt;code&gt;out&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; port io&amp;#xB098; mmio &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;(Driver)&amp;#xACFC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;(VMWP) &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; context &amp;#xC804;&amp;#xD658;(vmentry/vmexit)&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xBC00;&amp;#xC9D1;&amp;#xB41C;(Intercept-intensive) &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC548;&amp;#xB418;&amp;#xB294; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xB098;&amp;#xC640; &amp;#xBC84;&amp;#xB9AC;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; vmwp&amp;#xC5D0;&amp;#xB294; x86&amp;#xACFC; x64 &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &lt;code&gt;EmulatorVp&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IO &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xD6C4; &amp;#xBC14;&amp;#xB85C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; vmwp&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; instruction&amp;#xB3C4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; vmwp&amp;#xC758; context&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;VMBus-amp-VSP-amp-VSC&#34;&gt;&lt;a href=&#34;#VMBus-amp-VSP-amp-VSC&#34; class=&#34;headerlink&#34; title=&#34;VMBus &amp;amp; VSP &amp;amp; VSC&#34;&gt;&lt;/a&gt;VMBus &amp;amp; VSP &amp;amp; VSC&lt;/h1&gt;&lt;p&gt;Emulated Device&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; Para-virtualized Device&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9B4; &amp;#xB54C; Enlightened Child Partition&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; Enlightened I/O&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBC1C;&amp;#xD718;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500; &amp;#xB4DC;&amp;#xB838;&amp;#xB294;&amp;#xB370;&amp;#xC694;? Para-virtualized device stack&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; VMBus, VSP, VSC&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;VMBus&#34;&gt;&lt;a href=&#34;#VMBus&#34; class=&#34;headerlink&#34; title=&#34;VMBus&#34;&gt;&lt;/a&gt;VMBus&lt;/h2&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; VMBus&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMBus&amp;#xB294; Hyper-V&amp;#xAC00; &amp;#xBC18;&amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSP&amp;#xC640; VSC&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMBus&amp;#xC758; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; ring buffer&amp;#xB85C; &amp;#xCC44;&amp;#xB110; &amp;#xB2F9; upstream&amp;#xACFC; downstream&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xAC70;&amp;#xB098; &amp;#xBC1B;&amp;#xC744; &amp;#xC218;  &amp;#xC788;&amp;#xACE0; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xAC00;&amp;#xC0C1; &amp;#xC778;&amp;#xD130;&amp;#xB7FD;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSP&amp;#xB098; VSC&amp;#xC5D0; &amp;#xC54C;&amp;#xB824;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA74; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; GPADL(Guest Physical Address Descriptor List)&amp;#xB97C; &amp;#xCCA8;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xB824;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;VSC-Virtualization-Service-Consumer&#34;&gt;&lt;a href=&#34;#VSC-Virtualization-Service-Consumer&#34; class=&#34;headerlink&#34; title=&#34;VSC(Virtualization Service Consumer)&#34;&gt;&lt;/a&gt;VSC(Virtualization Service Consumer)&lt;/h2&gt;&lt;p&gt;VSC&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; IO &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; VSP&amp;#xC5D0;&amp;#xAC8C;&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;VSP-Virtualization-Service-Provider&#34;&gt;&lt;a href=&#34;#VSP-Virtualization-Service-Provider&#34; class=&#34;headerlink&#34; title=&#34;VSP(Virtualization Service Provider)&#34;&gt;&lt;/a&gt;VSP(Virtualization Service Provider)&lt;/h2&gt;&lt;p&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; VMBus&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VSC&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; I/O Stack&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Hypervisor&#34;&gt;&lt;a href=&#34;#Hypervisor&#34; class=&#34;headerlink&#34; title=&#34;Hypervisor&#34;&gt;&lt;/a&gt;Hypervisor&lt;/h1&gt;&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x2026; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xB9CE;&amp;#xC740; &amp;#xB9CC;&amp;#xD07C; &amp;#xC804;&amp;#xBD80; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;del&gt;&amp;#xC804;&amp;#xBD80; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xBA74; &amp;#xB9C8;&amp;#xC18C;&amp;#xC5D0; &amp;#xAC14;&amp;#xACA0;&amp;#xC9C0;&lt;/del&gt; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB531; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xACE8;&amp;#xB77C;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC55E; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xACC4;&amp;#xC18D; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xAC00; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xBB54;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB05D;&amp;#xB098;&amp;#xBA74; &amp;#xCC1D;&amp;#xCC1D;&amp;#xD558;&amp;#xC796;&amp;#xC544;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;Hypercall&#34;&gt;&lt;a href=&#34;#Hypercall&#34; class=&#34;headerlink&#34; title=&#34;Hypercall&#34;&gt;&lt;/a&gt;Hypercall&lt;/h2&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xAC00; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xD638;&amp;#xCD9C; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; ring3&amp;#xC5D0;&amp;#xC11C; ring0&amp;#xB85C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC2A4;&amp;#xC704;&amp;#xCE6D;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; ring 0&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB85C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC2A4;&amp;#xC704;&amp;#xCE6D;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xCEE4;&amp;#xB110; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838;&amp;#xC57C; &amp;#xD558;&amp;#xACE0; &lt;code&gt;vmcall&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;vmmcall&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xC804;&amp;#xB2EC;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C;&amp;#xACFC; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Classes&#34;&gt;&lt;a href=&#34;#Hypercall-Classes&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Classes&#34;&gt;&lt;/a&gt;Hypercall Classes&lt;/h3&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xB294; simple&amp;#xACFC; repeat, &amp;#xB450; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. simple &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xD55C; &amp;#xBC88;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xC778;&amp;#xD48B;, &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. repeat &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; simple &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xC778;&amp;#xD48B;/&amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD69F;&amp;#xC218;&amp;#xB9CC;&amp;#xD07C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Input-Output&#34;&gt;&lt;a href=&#34;#Hypercall-Input-Output&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Input/Output&#34;&gt;&lt;/a&gt;Hypercall Input/Output&lt;/h3&gt;&lt;h4 id=&#34;Input&#34;&gt;&lt;a href=&#34;#Input&#34; class=&#34;headerlink&#34; title=&#34;Input&#34;&gt;&lt;/a&gt;Input&lt;/h4&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; x86-64&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; call code&amp;#xB97C; rax&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; Hyper-V&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; RCX&amp;#xC5D0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf&#34;&gt;MicrosoftDocs&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;Call Code: &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xBC88;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;Fast: &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD638;&amp;#xCD9C; &amp;#xADDC;&amp;#xC57D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD568;(1), &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;(0)&lt;/li&gt;
&lt;li&gt;Variabe Header Size: variable header&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;Is Nested: &amp;#xC911;&amp;#xCCA9; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; L0 &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;(&amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD568;(1), &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xB9AC;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(0)&lt;/li&gt;
&lt;li&gt;Rep Count: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD560; &amp;#xD69F;&amp;#xC218;, Simple&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;Rep Start Index: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC18;&amp;#xBCF5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;, Simple&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;RsvdZ: &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD544;, &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&lt;h5 id=&#34;Parameter&#34;&gt;&lt;a href=&#34;#Parameter&#34; class=&#34;headerlink&#34; title=&#34;Parameter&#34;&gt;&lt;/a&gt;Parameter&lt;/h5&gt;&amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C;  Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; RDX&amp;#xC640; R8&amp;#xC5D0; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; Non-Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; RDX&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Fast(Register-Based)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xC0DD;&amp;#xB7B5;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Fast&amp;#xC778; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Non-Fast(Memory-Based)&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; GPA(Guest Physical Address)&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; Align&amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xB9CC; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; list&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xACB9;&amp;#xCE58;&amp;#xAC70;&amp;#xB098; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xACBD;&amp;#xACC4;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Fast &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xACA8;&amp;#xC6B0; &amp;#xB450; &amp;#xAC1C;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC9C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;?&amp;#x2026; Extended Fast Hypercall(XMM Fast Hypercall)&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xC874; RDX&amp;#xC640; R8 &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; XMM0 ~ XMM5&amp;#xAE4C;&amp;#xC9C0; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xCD5C;&amp;#xB300; 112 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h4 id=&#34;Output&#34;&gt;&lt;a href=&#34;#Output&#34; class=&#34;headerlink&#34; title=&#34;Output&#34;&gt;&lt;/a&gt;Output&lt;/h4&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; 64&amp;#xBE44;&amp;#xD2B8;&amp;#xC758; Hypercall result &amp;#xAC12;&amp;#xC774; RAX(x86&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; EAX:EDX)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC18;&amp;#xD658;&amp;#xB418;&amp;#xACE0; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf&#34;&gt;MicrosoftDocs&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;Result: &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; HV_STATUS &amp;#xCF54;&amp;#xB4DC;(&amp;#xC131;&amp;#xACF5; &amp;#xD639;&amp;#xC740; &amp;#xC2E4;&amp;#xD328;)&lt;/li&gt;
&lt;li&gt;Reps Complete: Repeat &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC644;&amp;#xC218;&amp;#xB41C; &amp;#xBC18;&amp;#xBCF5; &amp;#xD69F;&amp;#xC218;&lt;/li&gt;
&lt;li&gt;Rsvd: &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC12;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xBA74; Non-Fast&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; R8&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0; Extended Fast Hypercall&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC544;&amp;#xC6C3;&amp;#xD48B; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Hypercall-Continuation&#34;&gt;&lt;a href=&#34;#Hypercall-Continuation&#34; class=&#34;headerlink&#34; title=&#34;Hypercall Continuation&#34;&gt;&lt;/a&gt;Hypercall Continuation&lt;/h3&gt;&lt;p&gt;&amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC0AC;&amp;#xC774;&amp;#xD074;&amp;#xC744; &amp;#xC7A1;&amp;#xC544;&amp;#xBA39;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xBC14;&amp;#xC774;&amp;#xC800;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC57D; 50 &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xCD08; &amp;#xC774;&amp;#xD558;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB2E4; &amp;#xB418;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC81C;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026; &amp;#xC81C;&amp;#xD55C;&amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB098;&amp;#xBA74; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC758; &amp;#xC644;&amp;#xB8CC; &amp;#xC5EC;&amp;#xBD80;&amp;#xC640; &amp;#xC0C1;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; Instruction Pointer&amp;#xAC00; &amp;#xC6C0;&amp;#xC9C1;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xD6C4; &amp;#xC2A4;&amp;#xCF00;&amp;#xC974;&amp;#xB9C1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xD37C;&amp;#xCF5C;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; Hyper-V&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &lt;del&gt;&amp;#xAC04;&amp;#xB7B5;&amp;#xD788;&lt;/del&gt; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xC800;&amp;#xB3C4; &amp;#xC544;&amp;#xC9C1; &amp;#xBD80;&amp;#xC871;&amp;#xD574;&amp;#xC11C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB4DC;&amp;#xB9B4; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;del&gt;&amp;#xD0DC;&amp;#xD074;&amp;#xC740; &amp;#xC5B8;&amp;#xC81C;&amp;#xB098; &amp;#xD658;&amp;#xC601;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC740; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB4E4; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; VSP&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC790;&amp;#xC2DD; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; VSC&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; vmwp&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xAC00;&amp;#xC0C1; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC758; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC740; vmwp&amp;#xC758; IDE &amp;#xC7A5;&amp;#xCE58; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; VM Escape&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; CVE-2018-0959 &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image3.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2023/09/30/pwndorei/newjeans-hyper-v-pt1/">

  <title>[Research] NewJeans&#39; Hyper-V Part 1 - Hyper-V Architecture - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2023-09-30 19:00" pubdate>
      2023 9 30 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      96
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] NewJeans&#39; Hyper-V Part 1 - Hyper-V Architecture</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! pwndorei&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xBC88; &#xAE00;&#xBD80;&#xD130;  L0ch&#xB2D8;&#xACFC; &#xD568;&#xAED8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; Hyper-V 1-day &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC5F0;&#xAD6C;&#xD558;&#xBA74;&#xC11C; &#xC815;&#xB9AC;&#xD55C; &#xAE00;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; Hyper-V &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xC5F0;&#xC7AC;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xC804; <a href="https://hackyboiz.github.io/2021/01/31/l0ch/pwncoolsexy-part1/">Pwn Cool Sexy</a>&#xB77C;&#xB294; &#xBBF8;&#xCCD0;&#xBC84;&#xB9B0; &#xB124;&#xC774;&#xBC0D; &#xC13C;&#xC2A4;&#xB97C; &#xBCF4;&#xC5EC;&#xC900; L0ch&#xAC00; &#xC815;&#xD55C; &#xC800;&#xD76C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC774;&#xB984;&#xC740; &#xBB34;&#xB824; NewJeans&#x2019; Hyper-V&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;!&#x2026; </p>
<p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image6.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB34;&#xD2BC; &#xC774;&#xBC88; &#xCCAB; &#xAE00;&#xC758; &#xC8FC;&#xC81C;&#xB294; Hyper-V&#xC758; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC785;&#xB2C8;&#xB2E4;. &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; Hyper-V&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xC2DC;&#xC8E0;!</p>
<h1 id="Hyper-V"><a href="#Hyper-V" class="headerlink" title="Hyper-V"></a>Hyper-V</h1><p>Hyper-V&#xB294; Microsoft&#xC758; Type 1 Hypervisor&#xAE30;&#xBC18;&#xC758; &#xAC00;&#xC0C1;&#xD654; &#xD50C;&#xB7AB;&#xD3FC;&#xC785;&#xB2C8;&#xB2E4;. VMware&#xB098; VirtualBox&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. Type 2 &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; VMware Workstation, Play&#xC640; VirtualBox &#xB4F1;&#xC774; &#xD638;&#xC2A4;&#xD2B8; OS&#xC758; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xB2EC;&#xB9AC; Type 1 &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Hyper-V&#xB294; &#xC774;&#xB97C; &#xAD6C;&#xB3D9;&#xD558;&#xB294; &#xD638;&#xC2A4;&#xD2B8; OS &#xB610;&#xD55C; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC758; &#xC704;&#xC5D0;&#xC11C; &#xAD6C;&#xB3D9;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC544;&#xB798;&#xB294; Type 1&#xACFC; Type 2&#xC758; &#xCC28;&#xC774;&#xB97C; &#xB098;&#xD0C0;&#xB0B8; &#xADF8;&#xB9BC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image1.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://ko.wikipedia.org/wiki/%ED%95%98%EC%9D%B4%ED%8D%BC%EB%B0%94%EC%9D%B4%EC%A0%80">Wikipedia</a></p>
</blockquote>
<h2 id="&#xAC00;&#xC0C1;&#xD654;"><a href="#&#xAC00;&#xC0C1;&#xD654;" class="headerlink" title="&#xAC00;&#xC0C1;&#xD654;"></a>&#xAC00;&#xC0C1;&#xD654;</h2><p>&#xADF8;&#xB7FC; &#xC774;&#xB7F0; &#xAC00;&#xC0C1;&#xD654;&#xB294; &#xC5B4;&#xC9F8;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC77C;&#xAE4C;&#xC694;?&#x2026; &#xD574;&#xD0B9;&#xC744; &#xC0AC;&#xB791;&#xD558;&#xC2DC;&#xB294; &#xB3C5;&#xC790;&#xBD84;&#xB4E4;&#xC740; &#xC774;&#xBBF8; &#xB2E4;&#xC591;&#xD55C; &#xC774;&#xC720;&#xB85C; VMware&#xB098; VirtualBox &#xB4F1;&#xC744; &#xD1B5;&#xD574; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xBCF4;&#xC168;&#xACA0;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC2E0; &#xC801;&#xC774; &#xC5C6;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC744; &#xC704;&#xD574; &#xC81C;&#xAC00; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xAC00;&#xC0C1;&#xD654;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xB97C; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xC790;&#xBA74; &#xD558;&#xB098;&#xC758; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB85C; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; OS&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC778; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB3C4; &#xCC98;&#xC74C; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB41C; &#xACC4;&#xAE30;&#xAC00; &#xD3EC;&#xB108;&#xBE14;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xAE30; &#xC704;&#xD574; Ubuntu&#xB97C; &#xC124;&#xCE58;&#xD558;&#xAE30; &#xC704;&#xD568;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xB610;&#xD55C; &#xC0DD;&#xC131;&#xB41C; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC758; &#xAC8C;&#xC2A4;&#xD2B8; OS&#xB4E4;&#xACFC; &#xD638;&#xC2A4;&#xD2B8; OS&#xB294; &#xC11C;&#xB85C; &#xACA9;&#xB9AC;&#xB418;&#xC5B4;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAC8C;&#xC2A4;&#xD2B8; OS&#xC5D0;&#xC11C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB098; &#xBA40;&#xC6E8;&#xC5B4; &#xB4F1;&#xC744; &#xC2E4;&#xD589;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xC791;&#xB3D9; &#xC6D0;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Hyper-V-Architecture"><a href="#Hyper-V-Architecture" class="headerlink" title="Hyper-V Architecture"></a>Hyper-V Architecture</h1><p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image.gif" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/virtualization/hyper-v-on-windows/reference/hyper-v-architecture">Microsoft</a></p>
</blockquote>
<p>&#xC704;&#xB294; <del>&#xD55C;&#xB3D9;&#xC548; &#xC81C; &#xBC14;&#xD0D5;&#xD654;&#xBA74;&#xC774;&#xC5C8;&#xB358;</del> Hyper-V&#xC758; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xB300;&#xD55C; &#xADF8;&#xB9BC;&#xC785;&#xB2C8;&#xB2E4;. &#xC8FC;&#xBCC0; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xBCF4;&#xC5EC;&#xC8FC;&#xBA74; &#xB192;&#xC740; &#xD655;&#xB960;&#xB85C; &#xB208;&#xC0B4;&#xC744; &#xCC0C;&#xD478;&#xB9AC;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;&#x314B;&#x314B; &#xADF8;&#xB7FC; &#xADF8;&#xB9BC;&#xC5D0; &#xB098;&#xC640;&#xC788;&#xB294; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB4E4;&#xC744; &#xD558;&#xB098; &#xC529; &#xC0B4;&#xD3B4;&#xBCF4;&#xC2DC;&#xC8E0;!</p>
<h1 id="Partition"><a href="#Partition" class="headerlink" title="Partition"></a>Partition</h1><p>&#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xC0B4;&#xD3B4;&#xBCFC; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB294; &#xD30C;&#xD2F0;&#xC158;&#xC785;&#xB2C8;&#xB2E4;! &#xC0AC;&#xBB34;&#xC2E4; &#xB4F1;&#xC758; &#xC5C5;&#xBB34; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xCC45;&#xC0C1;&#xB4E4;&#xC744; &#xBD84;&#xB9AC;&#xC2DC;&#xD0A4;&#xB294; &#xD30C;&#xD2F0;&#xC158;&#xCC98;&#xB7FC; Hyper-V&#xC758; &#xD30C;&#xD2F0;&#xC158;&#xC740; &#xB17C;&#xB9AC;&#xC801; &#xACA9;&#xB9AC;&#xC758; &#xB2E8;&#xC704;&#xB85C;&#xC11C; &#xC2DC;&#xC2A4;&#xD15C; &#xAC04;&#xC758; &#xACA9;&#xB9AC;&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xD2F0;&#xC158; &#xAC04;&#xC758; &#xACA9;&#xB9AC;&#xB294; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC758; EPT(&#xD655;&#xC7A5; &#xD398;&#xC774;&#xC9C0; &#xD14C;&#xC774;&#xBE14;)&#xC5D0; &#xC758;&#xD55C; &#xBB3C;&#xB9AC;&#xC801; &#xBA54;&#xBAA8;&#xB9AC; &#xACA9;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xACE0; &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xD30C;&#xD2F0;&#xC158;&#xAC04; &#xAC04;&#xC12D;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xD30C;&#xD2F0;&#xC158;&#xC5D0;&#xB294; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xACFC; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC774; &#xC788;&#xACE0; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC740; &#xB2E4;&#xC2DC; Enlightened &#xC5EC;&#xBD80;&#xC5D0; &#xB530;&#xB77C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. Enlightened&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB4A4;&#xC5D0;&#xC11C; &#xB2E4;&#xC2DC; &#xB2E4;&#xB8E8;&#xB3C4;&#xB85D; &#xD558;&#xACE0; &#xBA3C;&#xC800; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="Root-Partition"><a href="#Root-Partition" class="headerlink" title="Root Partition"></a>Root Partition</h2><p>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xB294; &#xD558;&#xB098; &#xC774;&#xC0C1;&#xC758; Windows&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC744; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0;&#xC11C; &#xACA9;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xD30C;&#xD2F0;&#xC158;&#xAC04; &#xAC04;&#xC12D;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xB9D0;&#xC500;&#xB4DC;&#xB838;&#xC9C0;&#xB9CC; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC740; &#xC608;&#xC678;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB978; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xBB3C;&#xB9AC;&#xC801; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0;&#xB3C4; &#xC9C1;&#xC811; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Child-Partition"><a href="#Child-Partition" class="headerlink" title="Child Partition"></a>Child Partition</h2><p>&#xBC18;&#xBA74; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC740; &#xB2E4;&#xB978; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAC70;&#xB098; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0; &#xC9C1;&#xC811; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC774; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC774;&#xB098; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; WinHv(LinuxHv)&#xB098; VMBus &#xB4F1;&#xC758; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.  &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC811;&#xADFC;&#xC740; &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. </p>
<h3 id="Enlightened"><a href="#Enlightened" class="headerlink" title="Enlightened"></a>Enlightened</h3><p>&#xC704;&#xC5D0;&#xC11C; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC740; Enlightened &#xC5EC;&#xBD80;&#xC5D0; &#xB530;&#xB77C; &#xB098;&#xB25C;&#xB2E4;&#xACE0; &#xB9D0;&#xC500;&#xB4DC;&#xB838;&#xB294;&#xB370; Enlightened&#xB97C; &#xBC88;&#xC5ED;&#xD574;&#xBCF4;&#xBA74; &#xBB34;&#xB824; &#x201C;&#xACC4;&#xBABD;&#xD55C;&#x201D;&#xC774;&#xB77C;&#xB294; &#xC5C4;&#xCCAD;&#xB09C; &#xB2E8;&#xC5B4;&#xAC00; &#xB098;&#xC635;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B; &#xACC4;&#xBABD;&#xD55C; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#x2026; &#xBB54;&#xAC00; &#xC5C4;&#xCCAD;&#xB09C; &#xC758;&#xBBF8;&#xC778; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC; Enlightened&#xB77C;&#xB294; &#xAC83;&#xC740; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xAC00;&#xC0C1;&#xD654;&#xB418;&#xC5B4; &#xAD6C;&#xB3D9;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC778;&#xC9C0;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image2.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p><del>&#xBE68;&#xAC04;&#xC57D; &#xC904;&#xAE4C; &#xD30C;&#xB780;&#xC57D; &#xC904;&#xAE4C;</del></p>
</blockquote>
<p>Enlightened &#xAC8C;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; Enlightend I/O &#xB77C;&#xB294; &#xBC29;&#xC2DD;&#xC758; &#xC785;&#xCD9C;&#xB825;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xBC18; &#xAC00;&#xC0C1;&#xD654;(para-virtualized)&#xB41C; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xAC74;&#xB108;&#xB6F0;&#xC5B4; &#xB354; &#xBE60;&#xB978; &#xC785;&#xCD9C;&#xB825;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. </p>
<p>&#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xB354; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xB4A4;&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xB3C4;&#xB85D; &#xD558;&#xACE0; &#xB2E4;&#xC74C;&#xC73C;&#xB85C; VMMS&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xC2DC;&#xC8E0;!</p>
<h1 id="VMMS"><a href="#VMMS" class="headerlink" title="VMMS"></a>VMMS</h1><p>VMMS(Virtual Machine Management Service)&#xB294; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; &#xD6C4;&#xC220;&#xD560; WMI&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0; &#xAD00;&#xB9AC; &#xBC0F; &#xC81C;&#xC5B4; API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xB4E4;&#xC744; &#xC81C;&#xC5B4;&#xD569;&#xB2C8;&#xB2E4;. &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC758; &#xC0DD;&#xC131;/&#xC81C;&#xAC70;&#xB294; &#xBB3C;&#xB860; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC5D0; &#xD560;&#xB2F9;&#xD560; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC758; &#xC218;, &#xBA54;&#xBAA8;&#xB9AC; &#xC6A9;&#xB7C9;, &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC790;&#xC6D0; &#xB4F1; &#xB610;&#xD55C; &#xAD00;&#xB9AC;&#xD558;&#xACE0; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC774; &#xCF1C;&#xC9C8; &#xB54C; &#xD574;&#xB2F9; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xB2F4;&#xB2F9;&#xD560; VMWP&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC704; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xBCF4;&#xBA74; VMMS &#xC548;&#xC5D0; &#xC788;&#xB294; WMI&#xC5D0;&#xC11C; VID&#xC5D0; &#xD654;&#xC0B4;&#xD45C;&#xAC00; &#xBED7;&#xC5B4; &#xC788;&#xACE0; &#xB2E4;&#xC2DC; VID&#xC5D0;&#xC11C; WinHv&#xB97C; &#xAC70;&#xCCD0; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC5D0; &#xC788;&#xB294; Hypercall&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC8E0;? &#xC774; &#xBD80;&#xBD84;&#xC5D0; &#xB300;&#xD574; &#xC790;&#xC138;&#xD788; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h2 id="WMI"><a href="#WMI" class="headerlink" title="WMI"></a>WMI</h2><p>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xC5D0;&#xC120; WMI(Windows Management Instrumentation)&#xB97C; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xC758; WBEM(&#xC6F9; &#xAE30;&#xBC18; &#xC5D4;&#xD130;&#xD504;&#xB77C;&#xC774;&#xC988; &#xAD00;&#xB9AC;) &#xAD6C;&#xD604;&#xC774;&#xB77C;&#xACE0; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. WMI&#xB294; CIM(Common Information Model)<br>&#xC744; &#xD1B5;&#xD574; &#xC2DC;&#xC2A4;&#xD15C;&#xACFC; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;, &#xC7A5;&#xCE58; &#xB4F1; &#xAD00;&#xB9AC; &#xC694;&#xC18C;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xB294; Powershell, wmic, wbemtest &#xB4F1;&#xC758; &#xB3C4;&#xAD6C;&#xB97C; &#xD1B5;&#xD574; WMI&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; Windows &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. Hyper-V&#xC6A9; WMI Provider&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xAD6C;&#xC131;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xAC70;&#xB098; &#xC804;&#xC6D0;, &#xAC80;&#xC0AC;&#xC810; &#xB4F1;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; VMMS&#xB3C4; WMI&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xB4E4;&#xC744; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xC0AC;&#xC6A9; &#xC608;&#xC2DC;&#xB85C;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC81C;&#xB85C;&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xD55C; Hyper-V&#xC758; Emulated Device &#xD37C;&#xC800;&#xC778; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/googleprojectzero/hyntrospect/">Hyntrospect</a>&#xAC00; &#xD0C0;&#xAC9F; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xAC80;&#xC0AC;&#xC810;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. Hyntrospect&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xB978; &#xAE00;&#xC5D0;&#xC11C; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="VID"><a href="#VID" class="headerlink" title="VID"></a>VID</h2><p>&#xADF8;&#xB798;&#xC11C; WMI&#xB294; &#xAD00;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC74; &#xC54C;&#xACA0;&#xB294;&#xB370; VID&#xB294; &#xB610; &#xBB58;&#xAE4C;&#xC694;?&#x2026; VID(Virtual Infrastructure Driver)&#xB294; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xD544;&#xC694;&#xD55C; Infrastructure &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB098; &#xC790;&#xC6D0;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xB05D;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;&#x2026;.</p>
<h2 id="WinHv-LinuxHv-&#xC9C4;&#xC9DC;-&#xB05D;"><a href="#WinHv-LinuxHv-&#xC9C4;&#xC9DC;-&#xB05D;" class="headerlink" title="WinHv(LinuxHv) &#xC9C4;&#xC9DC; &#xB05D;"></a>WinHv(LinuxHv) <del>&#xC9C4;&#xC9DC; &#xB05D;</del></h2><p>WinHv&#xB294; Windows HyperVisor &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB85C; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC774;&#xB098; Windows &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0;&#xC11C;&#xB294; WinHv, &#xB9AC;&#xB205;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0;&#xC11C;&#xB294; LinuxHv&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB984; &#xADF8;&#xB300;&#xB85C; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC640;&#xC758; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC774; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xBC14;&#xB85C; Hypercall&#xC785;&#xB2C8;&#xB2E4;. Hyper-V &#xAD00;&#xB9AC;&#xC790;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xAC00;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC11C; &#xC218;&#xB098; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xB4F1;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xBA74; WMI, VID, WinHv&#xB97C; &#xAC70;&#xCCD0; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC5D0; &#xC694;&#xCCAD;&#xC774; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xAC83;&#xC774;&#xC8E0;&#x2026;</p>
<h1 id="VMWP"><a href="#VMWP" class="headerlink" title="VMWP"></a>VMWP</h1><p>VMWP(Virtual Machine Worker Process)&#xB294; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; VMMS&#xAC00; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC774; &#xBD80;&#xD305;&#xB420; &#xB54C; &#xD574;&#xB2F9; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC704;&#xD55C; vmwp.exe&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. vmwp.exe&#xC758; &#xB300;&#xD45C;&#xC801;&#xC778; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB294; &#xC544;&#xB798;&#xC758; &#xB124; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Virtual Device</li>
<li>Integrated Components</li>
<li>Plan9FS</li>
<li>vSMB Server<br>&#xC774; &#xC911;&#xC5D0;&#xC11C;&#xB3C4; Virtual Device&#xC640; Integrated Component&#xC5D0; &#xB300;&#xD574; &#xC790;&#xC138;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xC2DC;&#xC8E0;!</li>
</ul>
<h2 id="Integrated-Component"><a href="#Integrated-Component" class="headerlink" title="Integrated Component"></a>Integrated Component</h2><p>&#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xACFC; &#xD638;&#xC2A4;&#xD2B8;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xC704;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;. &#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC11C;&#xBE44;&#xC2A4;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<ul>
<li>Hyper-V Heartbeat Service<ul>
<li>&#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC774; &#xC81C;&#xB300;&#xB85C; &#xBD80;&#xD305;&#xD588;&#xB294;&#xC9C0;, &#xB610;&#xB294; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xB294; &#xC11C;&#xBE44;&#xC2A4;</li>
</ul>
</li>
<li>Hyper-V Guest Shutdown Service</li>
<li>Hyper-v volume shadow copy requestor<ul>
<li>&#xAC80;&#xC0AC;&#xC810;(Checkpoint) &#xC0DD;&#xC131; &#xBC0F; &#xC801;&#xC6A9;&#xC744; &#xC704;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;</li>
</ul>
</li>
<li>Hyper-V Time Synchronization<ul>
<li>&#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC758; &#xC2DC;&#xAC04;&#xACFC; &#xD638;&#xC2A4;&#xD2B8;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xB3D9;&#xAE30;&#xD654;</li>
</ul>
</li>
</ul>
<h2 id="Virtual-Device"><a href="#Virtual-Device" class="headerlink" title="Virtual Device"></a>Virtual Device</h2><p>&#xC544;&#xAE4C; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC5D0;&#xC11C; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC740; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0; &#xC9C1;&#xC811; &#xC561;&#xC138;&#xC2A4;&#xD560; &#xC218; &#xC5C6;&#xAE30;&#xC5D0; &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC5C8;&#xC8E0;? &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB294; &#xD06C;&#xAC8C; &#xC544;&#xB798;&#xC758; &#xC138; &#xCE74;&#xD14C;&#xACE0;&#xB9AC;&#xB85C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<ul>
<li>Emulated Device</li>
<li>Para-virtualized Device</li>
<li>Direct Access(Passthrough)</li>
</ul>
<p>Para-virtualized Device&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC740; &#xB4DC;&#xB838;&#xC73C;&#xB2C8; &#xAC74;&#xB108;&#xB6F0;&#xACE0; Emulated Device&#xBD80;&#xD130; &#xC0B4;&#xD3B4;&#xBCF4;&#xC2DC;&#xC8E0;!</p>
<p>Emulated Device&#xB294; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD2B8;&#xB41C; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB4E4;&#xC740; vmwp.exe&#xB098; vmwp.exe&#xAC00; &#xB85C;&#xB4DC;&#xD558;&#xB294; VmEmulatedStorage.dll, VmEmulatedNic.dll &#xB4F1;&#xC758; dll&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>Direct Access&#xB294; &#xD2B9;&#xC815; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0; &#xC9C1;&#xC811; &#xC811;&#xADFC;&#xD558;&#xAC8C; &#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Emulated Device&#xB294; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; vmwp&#xC5D0; &#xC788;&#xACE0; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xB4E4;&#xC740; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xC788;&#xC73C;&#xB2C8; &#xC774;&#xB4E4;&#xC744; &#xC774;&#xC5B4;&#xC904; &#xBB34;&#xC5B8;&#xAC00;&#xAC00; &#xD544;&#xC694;&#xD558;&#xACA0;&#xC8E0;?&#x2026; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xBA74; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC5D0; &#xC758;&#xD574; &#xC778;&#xD130;&#xC149;&#xD2B8;&#xB418;&#xACE0; VID &#xC54C;&#xB9BC;(Notification)&#xC774;&#xB780;&#xAC8C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; VND(VID Notification Dispatcher)&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xD2B9;&#xC815; VID &#xC54C;&#xB9BC;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xB54C; &#xD2B9;&#xC815; &#xB3D9;&#xC791;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5B4; vmwp&#xC5D0;&#xC11C; &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB97C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="Instruction-Decoder"><a href="#Instruction-Decoder" class="headerlink" title="Instruction Decoder"></a>Instruction Decoder</h3><p>&#xADF8;&#xB7FC; &#xAC8C;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; <code>in</code>, <code>out</code> &#xBA85;&#xB839;&#xC744; &#xD1B5;&#xD55C; port io&#xB098; mmio &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xAC8C;&#xC2A4;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;(Driver)&#xACFC; &#xD638;&#xC2A4;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;(VMWP) &#xC0AC;&#xC774;&#xC5D0;&#xC11C; context &#xC804;&#xD658;(vmentry/vmexit)&#xC774; &#xACC4;&#xC18D; &#xC77C;&#xC5B4;&#xB09C;&#xB2E4;&#xBA74; &#xC774;&#xB7F0; &#xBA85;&#xB839;&#xC774; &#xBC00;&#xC9D1;&#xB41C;(Intercept-intensive) &#xBD80;&#xBD84;&#xC5D0;&#xC11C;&#xB294; &#xB9D0;&#xB3C4; &#xC548;&#xB418;&#xB294; &#xC131;&#xB2A5;&#xC774; &#xB098;&#xC640; &#xBC84;&#xB9AC;&#xACA0;&#xC8E0;?&#x2026; &#xADF8;&#xB798;&#xC11C; vmwp&#xC5D0;&#xB294; x86&#xACFC; x64 &#xBA85;&#xB839;&#xC744; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xD574;&#xC8FC;&#xB294; <code>EmulatorVp</code>&#xB77C;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. IO &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xC774;&#xD6C4; &#xBC14;&#xB85C; &#xAC8C;&#xC2A4;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC73C;&#xB85C; &#xC804;&#xD658;&#xB418;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; vmwp&#xC5D0;&#xC11C; &#xB2E4;&#xB978; instruction&#xB3C4; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC8E0;. &#xC774;&#xB97C; &#xD1B5;&#xD574; vmwp&#xC758; context&#xC5D0; &#xBA38;&#xBB34;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xC5EC; &#xC131;&#xB2A5;&#xC5D0;&#xB3C4; &#xC88B;&#xC740; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE69;&#xB2C8;&#xB2E4;.</p>
<h1 id="VMBus-amp-VSP-amp-VSC"><a href="#VMBus-amp-VSP-amp-VSC" class="headerlink" title="VMBus &amp; VSP &amp; VSC"></a>VMBus &amp; VSP &amp; VSC</h1><p>Emulated Device&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD24;&#xC73C;&#xB2C8; &#xC774;&#xBC88;&#xC5D4; Para-virtualized Device&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xC2DC;&#xC8E0;. &#xC704;&#xC5D0;&#xC11C; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xB300;&#xD574; &#xB9D0;&#xC500;&#xB4DC;&#xB9B4; &#xB54C; Enlightened Child Partition&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; Enlightened I/O&#xB97C; &#xD1B5;&#xD574; &#xB354; &#xB098;&#xC740; &#xC131;&#xB2A5;&#xC744; &#xBC1C;&#xD718;&#xD55C;&#xB2E4;&#xACE0; &#xB9D0;&#xC500; &#xB4DC;&#xB838;&#xB294;&#xB370;&#xC694;? Para-virtualized device stack&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; VMBus, VSP, VSC&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xC2DC;&#xC8E0;!</p>
<h2 id="VMBus"><a href="#VMBus" class="headerlink" title="VMBus"></a>VMBus</h2><p>&#xAC00;&#xC7A5; &#xBA3C;&#xC800; VMBus&#xC785;&#xB2C8;&#xB2E4;. VMBus&#xB294; Hyper-V&#xAC00; &#xBC18;&#xAC00;&#xC0C1;&#xD654; &#xC9C0;&#xC6D0;&#xC744; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBA54;&#xCEE4;&#xB2C8;&#xC998; &#xC911;&#xC5D0; &#xD558;&#xB098;&#xB85C; &#xD638;&#xC2A4;&#xD2B8;&#xC640; &#xAC8C;&#xC2A4;&#xD2B8; &#xC0AC;&#xC774;&#xC5D0; &#xAC00;&#xC0C1;&#xC758; &#xCC44;&#xB110;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4; &#xC774;&#xB97C; &#xD1B5;&#xD574; VSP&#xC640; VSC&#xAC00; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. VMBus&#xC758; &#xCC44;&#xB110;&#xC740; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC; &#xBC29;&#xC2DD;&#xC758; ring buffer&#xB85C; &#xCC44;&#xB110; &#xB2F9; upstream&#xACFC; downstream&#xAC00; &#xD558;&#xB098;&#xC529; &#xD560;&#xB2F9;&#xB418;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xB0B4;&#xAC70;&#xB098; &#xBC1B;&#xC744; &#xC218;  &#xC788;&#xACE0; &#xCC44;&#xB110;&#xC5D0; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xAC00; &#xAC00;&#xC0C1; &#xC778;&#xD130;&#xB7FD;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; VSP&#xB098; VSC&#xC5D0; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBC1B;&#xC73C;&#xBA74; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xACF5;&#xC720;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF5;&#xC0AC;&#xD558;&#xACE0; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC815;&#xBCF4;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0; GPADL(Guest Physical Address Descriptor List)&#xB97C; &#xCCA8;&#xBD80;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xC758; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<h2 id="VSC-Virtualization-Service-Consumer"><a href="#VSC-Virtualization-Service-Consumer" class="headerlink" title="VSC(Virtualization Service Consumer)"></a>VSC(Virtualization Service Consumer)</h2><p>VSC&#xB294; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xCEE4;&#xB110; &#xC601;&#xC5ED;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xB2E4;&#xB978; &#xB514;&#xBC14;&#xC774;&#xC2A4; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; IO &#xC791;&#xC5C5;&#xC744; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; VSP&#xC5D0;&#xAC8C;&#xB85C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xD569;&#xB2C8;&#xB2E4;. </p>
<h2 id="VSP-Virtualization-Service-Provider"><a href="#VSP-Virtualization-Service-Provider" class="headerlink" title="VSP(Virtualization Service Provider)"></a>VSP(Virtualization Service Provider)</h2><p>&#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xCEE4;&#xB110; &#xC601;&#xC5ED;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xBA70; VMBus&#xB97C; &#xD1B5;&#xD574; VSC&#xAC00; &#xBCF4;&#xB0B8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC5B4; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC758; I/O Stack&#xC774; &#xCC98;&#xB9AC;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<h1 id="Hypervisor"><a href="#Hypervisor" class="headerlink" title="Hypervisor"></a>Hypervisor</h1><p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC54C;&#xC544;&#xBCFC; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB294; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC785;&#xB2C8;&#xB2E4;!&#x2026; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xAC00; &#xC218;&#xD589;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC740; &#xB9CC;&#xD07C; &#xC804;&#xBD80; &#xC54C;&#xC544;&#xBCF4;&#xB294; &#xAC83;&#xC740; &#xBD88;&#xAC00;&#xB2A5;&#xD560; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.<del>&#xC804;&#xBD80; &#xC54C;&#xC558;&#xC73C;&#xBA74; &#xB9C8;&#xC18C;&#xC5D0; &#xAC14;&#xACA0;&#xC9C0;</del> &#xADF8;&#xB798;&#xC11C; &#xB531; &#xD558;&#xB098;&#xB9CC; &#xACE8;&#xB77C;&#xBCF4;&#xC790;&#xBA74; &#xB2F9;&#xC5F0; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;&#x314B; &#xC55E; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xACC4;&#xC18D; &#xD0A4;&#xC6CC;&#xB4DC;&#xAC00; &#xB4F1;&#xC7A5;&#xD588;&#xB294;&#xB370; &#xBB54;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xC9C0; &#xC54A;&#xACE0; &#xB05D;&#xB098;&#xBA74; &#xCC1D;&#xCC1D;&#xD558;&#xC796;&#xC544;&#xC694;&#x2026;</p>
<h2 id="Hypercall"><a href="#Hypercall" class="headerlink" title="Hypercall"></a>Hypercall</h2><p>&#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xAC00; &#xAC8C;&#xC2A4;&#xD2B8;&#xC5D0;&#xAC8C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xD638;&#xCD9C; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC785;&#xB2C8;&#xB2E4;. &#xC2DC;&#xC2A4;&#xD15C;&#xCF5C;&#xC5D0; &#xC758;&#xD574; ring3&#xC5D0;&#xC11C; ring0&#xB85C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xC774; &#xB418;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; ring 0&#xC5D0;&#xC11C; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xB85C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xC774; &#xC77C;&#xC5B4;&#xB0A9;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; &#xCEE4;&#xB110; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC838;&#xC57C; &#xD558;&#xACE0; <code>vmcall</code>&#xC774;&#xB098; <code>vmmcall</code> &#xBA85;&#xB839;&#xC744; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xC790; &#xC804;&#xB2EC;&#xC740; &#xC2DC;&#xC2A4;&#xD15C;&#xCF5C;&#xACFC; &#xC720;&#xC0AC;&#xD558;&#xAC8C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. </p>
<h3 id="Hypercall-Classes"><a href="#Hypercall-Classes" class="headerlink" title="Hypercall Classes"></a>Hypercall Classes</h3><p>&#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC5D0;&#xB294; simple&#xACFC; repeat, &#xB450; &#xC885;&#xB958;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. simple &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; &#xD55C; &#xBC88;&#xC758; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xACE0;&#xC815;&#xB41C; &#xD06C;&#xAE30;&#xB97C; &#xAC00;&#xC9C0;&#xB294; &#xC778;&#xD48B;, &#xC544;&#xC6C3;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. repeat &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; simple &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xC5EC;&#xB7EC; &#xBC88; &#xBC18;&#xBCF5;&#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xACE0;&#xC815;&#xB41C; &#xD06C;&#xAE30;&#xC758; &#xC778;&#xD48B;/&#xC544;&#xC6C3;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC758; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xC9C0;&#xC815;&#xB41C; &#xBC18;&#xBCF5; &#xD69F;&#xC218;&#xB9CC;&#xD07C; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="Hypercall-Input-Output"><a href="#Hypercall-Input-Output" class="headerlink" title="Hypercall Input/Output"></a>Hypercall Input/Output</h3><h4 id="Input"><a href="#Input" class="headerlink" title="Input"></a>Input</h4><p>&#xB9AC;&#xB205;&#xC2A4; x86-64&#xC758; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C;&#xC5D0;&#xC11C; call code&#xB97C; rax&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; Hyper-V&#xC758; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; RCX&#xC5D0; &#xD558;&#xC774;&#xD37C;&#xCF5C; &#xC778;&#xD48B;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xACE0; &#xAD6C;&#xC870;&#xC640; &#xAC01; &#xD544;&#xB4DC;&#xC758; &#xC758;&#xBBF8;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image4.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf">MicrosoftDocs</a></p>
</blockquote>
<ul>
<li>Call Code: &#xD638;&#xCD9C;&#xB420; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC758; &#xBC88;&#xD638;</li>
<li>Fast: &#xD638;&#xCD9C;&#xB420; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xAE30;&#xBC18;&#xC758; &#xD638;&#xCD9C; &#xADDC;&#xC57D;&#xC744; &#xC0AC;&#xC6A9;&#xD568;(1), &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC74C;(0)</li>
<li>Variabe Header Size: variable header&#xC758; &#xD06C;&#xAE30;</li>
<li>Is Nested: &#xC911;&#xCCA9; &#xAC00;&#xC0C1;&#xD654; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774; L0 &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;(&#xAC00;&#xC0C1;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;)&#xC5D0; &#xC758;&#xD574; &#xCC98;&#xB9AC;&#xB418;&#xC5B4;&#xC57C;&#xD568;(1), &#xAC8C;&#xC2A4;&#xD2B8; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC5D0; &#xC758;&#xD574; &#xCC98;&#xB9AC;&#xB420; &#xC218; &#xC788;&#xC74C;(0)</li>
<li>Rep Count: Repeat &#xBC29;&#xC2DD;&#xC758; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC5D0;&#xC11C; &#xBC18;&#xBCF5;&#xD560; &#xD69F;&#xC218;, Simple&#xC778; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; 0&#xC73C;&#xB85C; &#xC124;&#xC815;</li>
<li>Rep Start Index: Repeat &#xBC29;&#xC2DD;&#xC758; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC5D0;&#xC11C; &#xBC18;&#xBCF5;&#xC744; &#xC2DC;&#xC791;&#xD560; &#xC778;&#xB371;&#xC2A4;, Simple&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; 0&#xC73C;&#xB85C; &#xC124;&#xC815;</li>
<li>RsvdZ: &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xD544;, &#xBC18;&#xB4DC;&#xC2DC; 0&#xC73C;&#xB85C; &#xC124;&#xC815;<h5 id="Parameter"><a href="#Parameter" class="headerlink" title="Parameter"></a>Parameter</h5>&#xC778;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C;  Fast&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; RDX&#xC640; R8&#xC5D0; &#xAC12;&#xC73C;&#xB85C; Non-Fast&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; RDX&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;. Fast(Register-Based)&#xC5D0;&#xC11C;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC811;&#xADFC; &#xACFC;&#xC815;&#xC774; &#xC0DD;&#xB7B5;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Fast&#xC778; &#xAC83;&#xC774;&#xC8E0;. &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD1B5;&#xD55C; Non-Fast(Memory-Based)&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB294; GPA(Guest Physical Address)&#xAC00; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC774; &#xC8FC;&#xC18C;&#xB294; 8&#xBC14;&#xC774;&#xD2B8;&#xB85C; Align&#xB418;&#xC5B4;&#xC57C;&#xB9CC; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; Repeat &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC804;&#xB2EC;&#xB41C; list&#xC77C; &#xACBD;&#xC6B0; &#xB9AC;&#xC2A4;&#xD2B8;&#xAC00; &#xB2E4;&#xB978; &#xB9AC;&#xC2A4;&#xD2B8;&#xC640; &#xACB9;&#xCE58;&#xAC70;&#xB098; &#xD398;&#xC774;&#xC9C0; &#xACBD;&#xACC4;&#xC5D0; &#xAC78;&#xCCD0;&#xC788;&#xAC8C; &#xB418;&#xBA74; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774; &#xC2E4;&#xD328;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>Fast &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xC704;&#xD55C; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xAC00; &#xACA8;&#xC6B0; &#xB450; &#xAC1C;&#xBC16;&#xC5D0; &#xC5C6;&#xC9C4; &#xC54A;&#xACA0;&#xC8E0;?&#x2026; Extended Fast Hypercall(XMM Fast Hypercall)&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xAE30;&#xC874; RDX&#xC640; R8 &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; XMM0 ~ XMM5&#xAE4C;&#xC9C0; &#xD30C;&#xB77C;&#xBBF8;&#xD130; &#xC804;&#xB2EC;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xCD5C;&#xB300; 112 &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xC804;&#xB2EC;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h4 id="Output"><a href="#Output" class="headerlink" title="Output"></a>Output</h4><p>&#xBAA8;&#xB4E0; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; 64&#xBE44;&#xD2B8;&#xC758; Hypercall result &#xAC12;&#xC774; RAX(x86&#xC5D0;&#xC11C;&#xB294; EAX:EDX)&#xB97C; &#xD1B5;&#xD574; &#xBC18;&#xD658;&#xB418;&#xACE0; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2023/09/30/pwndorei/newjeans-hyper-v-pt1/image5.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/MicrosoftDocs/Virtualization-Documentation/blob/main/tlfs/Hypervisor%20Top%20Level%20Functional%20Specification%20v6.0b.pdf">MicrosoftDocs</a></p>
</blockquote>
<ul>
<li>Result: &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; HV_STATUS &#xCF54;&#xB4DC;(&#xC131;&#xACF5; &#xD639;&#xC740; &#xC2E4;&#xD328;)</li>
<li>Reps Complete: Repeat &#xBC29;&#xC2DD;&#xC758; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC5D0;&#xC11C; &#xC644;&#xC218;&#xB41C; &#xBC18;&#xBCF5; &#xD69F;&#xC218;</li>
<li>Rsvd: &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAC12;</li>
</ul>
<p>&#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774; &#xC544;&#xC6C3;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xAC00;&#xC9C0;&#xBA74; Non-Fast&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; R8&#xB85C; &#xC804;&#xB2EC;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xC544;&#xC6C3;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xACE0; Extended Fast Hypercall&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC778;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xC544;&#xC6C3;&#xD48B; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xAC00; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="Hypercall-Continuation"><a href="#Hypercall-Continuation" class="headerlink" title="Hypercall Continuation"></a>Hypercall Continuation</h3><p>&#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC740; &#xB9CE;&#xC740; &#xC0AC;&#xC774;&#xD074;&#xC744; &#xC7A1;&#xC544;&#xBA39;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xB3D9;&#xC791;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xB294; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC758; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC744; &#xC57D; 50 &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xCD08; &#xC774;&#xD558;&#xB85C; &#xC81C;&#xD55C;&#xD558;&#xACE0; &#xC81C;&#xD55C;&#xB41C; &#xC2DC;&#xAC04;&#xC774; &#xB2E4; &#xB418;&#xBA74; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xD638;&#xCD9C;&#xD55C; &#xAC00;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xAC8C; &#xC81C;&#xC5B4;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xC81C;&#xD55C;&#xC2DC;&#xAC04; &#xBCF4;&#xB2E4; &#xC624;&#xB798; &#xAC78;&#xB9AC;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xD558;&#xB294; &#xAC78;&#xAE4C;&#xC694;?&#x2026; &#xC81C;&#xD55C;&#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB098;&#xBA74; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC758; &#xC644;&#xB8CC; &#xC5EC;&#xBD80;&#xC640; &#xC0C1;&#xAD00; &#xC5C6;&#xC774; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xD638;&#xCD9C;&#xD55C; &#xAC00;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0; &#xC81C;&#xC5B4;&#xB97C; &#xB3CC;&#xB824;&#xC8FC;&#xC9C0;&#xB9CC; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xD638;&#xCD9C;&#xD55C; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; Instruction Pointer&#xAC00; &#xC6C0;&#xC9C1;&#xC774;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xD6C4; &#xC2A4;&#xCF00;&#xC974;&#xB9C1;&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xC774; &#xC911;&#xB2E8;&#xB41C; &#xC2DC;&#xC810;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC9C4;&#xD589;&#xD574;&#xC11C; &#xD558;&#xC774;&#xD37C;&#xCF5C;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; Hyper-V&#xC758; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xB300;&#xD574; <del>&#xAC04;&#xB7B5;&#xD788;</del> &#xC54C;&#xC544;&#xBD24;&#xB294;&#xB370;&#xC694;? &#xC800;&#xB3C4; &#xC544;&#xC9C1; &#xBD80;&#xC871;&#xD574;&#xC11C; &#xB354; &#xB9CE;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xB4DC;&#xB9B4; &#xC218;&#xAC00; &#xC5C6;&#xC5C8;&#xACE0; &#xC798;&#xBABB;&#xB41C; &#xC815;&#xBCF4;&#xAC00; &#xC788;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;<del>&#xD0DC;&#xD074;&#xC740; &#xC5B8;&#xC81C;&#xB098; &#xD658;&#xC601;&#xC785;&#xB2C8;&#xB2E4;</del> &#xC774;&#xB807;&#xAC8C; &#xB9CE;&#xC740; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB4E4; &#xC911;&#xC5D0;&#xC11C; &#xACF5;&#xACA9; &#xB300;&#xC0C1;&#xC774; &#xB418;&#xB294; &#xBD80;&#xBD84;&#xC740; &#xC8FC;&#xB85C; &#xB8E8;&#xD2B8; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; VSP&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC790;&#xC2DD; &#xD30C;&#xD2F0;&#xC158;&#xC5D0; &#xC788;&#xB294; VSC&#xAC00; &#xBCF4;&#xB0B8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD30C;&#xC2F1;&#xD558;&#xBA74;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xACE0; vmwp&#xC5D0;&#xC11C;&#xB3C4; &#xAC00;&#xC0C1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC758; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xAE00;&#xC740; vmwp&#xC758; IDE &#xC7A5;&#xCE58; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; VM Escape&#xAE4C;&#xC9C0; &#xAC00;&#xB2A5;&#xD55C; CVE-2018-0959 &#xBD84;&#xC11D;&#xC73C;&#xB85C; &#xCC3E;&#xC544;&#xBD59;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/pwndorei/">pwndorei</a>
                  
                  <a class="hover-with-bg" href="/tags/hyper-v/">hyper-v</a>
                  
                  <a class="hover-with-bg" href="/tags/hypervisor/">hypervisor</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_pwndorei.jpg" srcset="/img/loading.gif" alt="pwndorei">
                  </div>

                  <div class="link-text">
                    <div class="link-title">pwndorei</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/pwndorei">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2023/10/08/pwndorei/newjeans-hyper-v-pt2/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] NewJeans' Hyper-V Part 2 - CVE-2018-0959 Analysis(1)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2023/09/03/l0ch/hackingcamp_review/">
                    <span class="hidden-mobile">[Daily-Life] 27  Review&Write-Up</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2023/09/30/pwndorei/newjeans-hyper-v-pt1/';
        this.page.identifier = '/2023/09/30/pwndorei/newjeans-hyper-v-pt1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] NewJeans' Hyper-V Part 1 - Hyper-V Architecture&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
