

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! Hackyboiz&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB0AE;&amp;#xC740; &amp;#xACF3;(low-level)&amp;#xC744; &amp;#xB9E1;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F938;&amp;#x1F3FB;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; Firmware Emulation with FirmAE Part 2&amp;#xB85C; &amp;#xBB34;&amp;#xC0AC;&amp;#xD788;(?) &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image001.jpg&#34; alt=&#34;image001.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xB354;&amp;#xC6B1; &amp;#xC88B;&amp;#xC8E0;! &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xACFC; FirmAE &amp;#xC124;&amp;#xCE58;&amp;#xB294; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&amp;#xC778; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/08/newp1ayer48/emulation1/ko/&#34;&gt;Firmware Emulation with FirmAE Part 1&lt;/a&gt;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; FirmAE&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xC2E4;&amp;#xD589;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; IP &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F64C;&amp;#x1F3FB;&lt;/p&gt;
&lt;h2 id=&#34;1-FirmAE-&amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;a href=&#34;#1-FirmAE-&amp;#xAD6C;&amp;#xC131;&#34; class=&#34;headerlink&#34; title=&#34;1. FirmAE &amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;/a&gt;1. FirmAE &amp;#xAD6C;&amp;#xC131;&lt;/h2&gt;&lt;p&gt;FirmAE&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F587;&amp;#xFE0F;&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xBC0F; &amp;#xD30C;&amp;#xC77C;&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/analyses/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;code&gt;run.sh&lt;/code&gt; &amp;#xC2E4;&amp;#xD589; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC911; analyses &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xB85C;&amp;#xADF8;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/firmwares/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&lt;code&gt;.bin&lt;/code&gt;)&amp;#xB97C; &amp;#xC704;&amp;#xCE58; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/images/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC704;&amp;#xD55C; OS &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scratch/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xAC01; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;, IID(Image ID)&amp;#xB85C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xBA70;, &amp;#xADF8; &amp;#xC548;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xCD94;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xCEE4;&amp;#xB110;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;, &amp;#xB85C;&amp;#xADF8; &amp;#xB4F1; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC911;&amp;#xAC04; &amp;#xC0B0;&amp;#xCD9C;&amp;#xBB3C;&amp;#xACFC; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;FirmAE/scratch/{IID}&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scripts/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBA54;&amp;#xC778; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC01;&amp;#xC885; &amp;#xD558;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scripts/makeNetwork.py&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xAD00;&amp;#xB828; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xCD5C;&amp;#xC885; QEMU &amp;#xC2E4;&amp;#xD589; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &lt;code&gt;FirmAE/scratch/{IID}/run.sh&lt;/code&gt;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/sources/scraper/firmware/spiders/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;code&gt;run.sh&lt;/code&gt; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &lt;code&gt;&amp;lt;brand&amp;gt;&lt;/code&gt; &amp;#xC778;&amp;#xC790;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBE0C;&amp;#xB79C;&amp;#xB4DC; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;scripts/util.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;get_brand()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/run.sh&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xBA54;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&lt;/strong&gt;&amp;#xB85C;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 5&amp;#xAC00;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&lt;code&gt;FirmAE/run.sh&lt;/code&gt; &amp;#xC758; 5&amp;#xAC00;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;code&gt;-c&lt;/code&gt;(check)&lt;/th&gt;
&lt;th&gt;&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;/&amp;#xC6F9; &amp;#xC811;&amp;#xC18D; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; check &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-r&lt;/code&gt;(run)&lt;/td&gt;
&lt;td&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-d&lt;/code&gt;(debug)&lt;/td&gt;
&lt;td&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-b&lt;/code&gt;(boot debug mode)&lt;/td&gt;
&lt;td&gt;kernel &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD80;&amp;#xD305; &amp;#xB2E8;&amp;#xACC4;&amp;#xBD80;&amp;#xD130; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-a&lt;/code&gt;(analyze)&lt;/td&gt;
&lt;td&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xBC1C;&amp;#xC0DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &lt;code&gt;analyses/&lt;/code&gt;&amp;#xC640; &lt;code&gt;scratch/{IID}/result&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&lt;img src=&#34;image002.jpg&#34; alt=&#34;image002.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#x1F62E; &amp;#xC804;&amp;#xBD80; &amp;#xBCF4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xBCF4;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD3F4;&amp;#xB354;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;run.sh&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;scratch/&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD06C;&amp;#xAC8C; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;run.sh&lt;/code&gt;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &lt;code&gt;scratch/&lt;/code&gt;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; FirmAE&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xB294; &lt;code&gt;scratch/&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&lt;/strong&gt;&amp;#xD558;&amp;#xB2C8; &amp;#xB85C;&amp;#xADF8; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC2E4;&amp;#xD589; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F50D;&lt;/p&gt;
&lt;h2 id=&#34;2-FirmAE-&amp;#xC2E4;&amp;#xD589;-&amp;#xBC0F;-FirmAE-Debugger&#34;&gt;&lt;a href=&#34;#2-FirmAE-&amp;#xC2E4;&amp;#xD589;-&amp;#xBC0F;-FirmAE-Debugger&#34; class=&#34;headerlink&#34; title=&#34;2. FirmAE &amp;#xC2E4;&amp;#xD589; &amp;#xBC0F; FirmAE Debugger&#34;&gt;&lt;/a&gt;2. FirmAE &amp;#xC2E4;&amp;#xD589; &amp;#xBC0F; FirmAE Debugger&lt;/h2&gt;&lt;p&gt;&lt;code&gt;-c&lt;/code&gt; Check &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBC0F; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC81C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD544;&amp;#xC694;&amp;#xC640; &amp;#xC6A9;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;-d&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; debug &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image003.png&#34; alt=&#34;image003.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; FirmAE Debugger &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F389; &amp;#xC774;&amp;#xC81C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; FirmAE Debugger&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; 5&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;connect to socat: python socat&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 1&amp;#xBC88; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, netcat &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30; &amp;#xC6F9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F310;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;connect to shell: shell&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xC5EC; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;br&gt;busybox &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; linux &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xAE30; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F9EA;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image004.png&#34; alt=&#34;image004.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;tcpdump: &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; tcpdump&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2709;&amp;#xFE0F; &amp;#xAE30;&amp;#xC785;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB530;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xB2C8; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image005.png&#34; alt=&#34;image005.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;run gdbserver: &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; gdb server &amp;#xC5F4;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; ARM, MIPS &amp;#xB4F1;&amp;#xC758; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC77C;&amp;#xBC18; gdb&amp;#xB85C;&amp;#xB294; &amp;#xC1A1;&amp;#xC218;&amp;#xC2E0;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x26A0;&amp;#xFE0F; &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; gdb-multiarch&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; gdb server&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;sudo apt-get install gdb-multiarch
gdb-multiarch
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; sysroot
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; follow-fork-mode child
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; solib-search-path PATH
target remote IP:PORT&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  &amp;#xC124;&amp;#xCE58; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; gdb-multiarch &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; binwalk&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; lib &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; path&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4D6;&lt;/p&gt;
&lt;p&gt;  &amp;#xC608;&amp;#xC81C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; pid&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815; &amp;#xB41C; gdb server&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC811;&amp;#xC18D;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. httpd &amp;#xAC19;&amp;#xC740; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC6F9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image006.png&#34; alt=&#34;image006.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;file transfer: &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;firmadyne/&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC774;&amp;#xC720;&amp;#xB294; &lt;code&gt;FirmAE/debug.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;file_transfer()&lt;/code&gt;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC258; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBC00;&amp;#xC5B4; &amp;#xB123;&amp;#xAC70;&amp;#xB098;, &lt;code&gt;xinetd.conf&lt;/code&gt;, &lt;code&gt;sshd_config&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2708;&amp;#xFE0F; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C;&amp;#xB294; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image007.png&#34; alt=&#34;image007.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;3-IP-&amp;#xBC0F;-&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xBC1C;&amp;#xC0DD;-&amp;#xC2DC;-&amp;#xD574;&amp;#xACB0;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-IP-&amp;#xBC0F;-&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xBC1C;&amp;#xC0DD;-&amp;#xC2DC;-&amp;#xD574;&amp;#xACB0;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3. IP &amp;#xBC0F; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3. IP &amp;#xBC0F; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;FirmAE&amp;#xB294; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xB41C; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; IP&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xC774; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC70;&amp;#xB098;, localhost&amp;#xB85C;&amp;#xB9CC; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; FirmAE &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC885;&amp;#xC885; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F62D;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image008.jpg&#34; alt=&#34;image008.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC6D0;&amp;#xC778;&amp;#xACFC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt; &amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;(&amp;#xBE0C;&amp;#xB9AC;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;)&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB300;&amp;#xCCB4; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBC29;&amp;#xC2DD;(QEMU &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBAA8;&amp;#xB4DC;)&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9; &amp;#xC804;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F6B8; &amp;#xC790;&amp;#xB3D9; &amp;#xC804;&amp;#xD658;&amp;#xC774; &amp;#xB418;&amp;#xBA74;, &lt;strong&gt;localhost&amp;#xB85C; &amp;#xC811;&amp;#xC18D; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&lt;/strong&gt;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, localhost&amp;#xB85C; &amp;#xC811;&amp;#xC18D; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image009.png&#34; alt=&#34;image009.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &lt;code&gt;scratch/{IID}/run.sh&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &lt;code&gt;QEMU_NET_OPTS&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; QEMU &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBE0C;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC870;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; FirmAE &amp;#xAD6C;&amp;#xC131;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C;, &lt;code&gt;scratch/{IID}&lt;/code&gt; &amp;#xD3F4;&amp;#xB354;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xBA74; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2DC;, &amp;#xBB34;&amp;#xC870;&amp;#xAC74; localhost&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F513;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;scripts/makeNetwork.py&lt;/code&gt; &amp;#xC218;&amp;#xC815;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;cp scripts/makeNetwork.py scripts/makeNetwork.py.bak&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  &amp;#xBA3C;&amp;#xC800; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC31;&amp;#xC5C5;&amp;#xD574;&amp;#xB461;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;isUserNetwork = any(isDhcpIp(ip) &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ip &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ips)
&lt;span class=&#34;hljs-keyword&#34;&gt;with&lt;/span&gt; open(SCRATCHDIR + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/&amp;quot;&lt;/span&gt; + str(iid) + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/isDhcp&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;w&amp;quot;&lt;/span&gt;) &lt;span class=&#34;hljs-keyword&#34;&gt;as&lt;/span&gt; out:&lt;/code&gt;&lt;/pre&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# isUserNetwork = any(isDhcpIp(ip) for ip in ips)&lt;/span&gt;
isUserNetwork = &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;with&lt;/span&gt; open(SCRATCHDIR + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/&amp;quot;&lt;/span&gt; + str(iid) + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/isDhcp&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;w&amp;quot;&lt;/span&gt;) &lt;span class=&#34;hljs-keyword&#34;&gt;as&lt;/span&gt; out:&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  IP &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xCC98;&amp;#xB7FC; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;portfwd = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&amp;quot;&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (proto, ip, port) &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ports:&lt;/code&gt;&lt;/pre&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;portfwd = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hostfwd=tcp::8888-:80,&amp;quot;&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;# portfwd = &amp;quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&amp;quot;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (proto, ip, port) &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ports:&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  port &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xCC98;&amp;#xB7FC; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image010.png&#34; alt=&#34;image010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC218;&amp;#xC815; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xBA74; IP&amp;#xAC00; localhost&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44D;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB9CC;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC544;&amp;#xB2D0; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACC4;&amp;#xC18D; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85; &amp;#xB4DC;&amp;#xB9B0; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &lt;code&gt;scratch/{IID}/&lt;/code&gt;&amp;#xC5D0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xC9C4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;, &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;QEMU&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C; &amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; FirmAE&amp;#xB294; &amp;#xC815;&amp;#xB9D0; &amp;#xB290;&amp;#xB9AC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image011.png&#34; alt=&#34;image011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xB294; &amp;#xB290;&amp;#xB9AC;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC798;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xBA85;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xAE00;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC5D0; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F64F;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44B;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Firmware Emulation with FirmAE Part 2 (ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! Hackyboiz&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB0AE;&amp;#xC740; &amp;#xACF3;(low-level)&amp;#xC744; &amp;#xB9E1;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F938;&amp;#x1F3FB;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; Firmware Emulation with FirmAE Part 2&amp;#xB85C; &amp;#xBB34;&amp;#xC0AC;&amp;#xD788;(?) &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image001.jpg&#34; alt=&#34;image001.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xB354;&amp;#xC6B1; &amp;#xC88B;&amp;#xC8E0;! &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xACFC; FirmAE &amp;#xC124;&amp;#xCE58;&amp;#xB294; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&amp;#xC778; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/08/newp1ayer48/emulation1/ko/&#34;&gt;Firmware Emulation with FirmAE Part 1&lt;/a&gt;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; FirmAE&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xC2E4;&amp;#xD589;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; IP &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F64C;&amp;#x1F3FB;&lt;/p&gt;
&lt;h2 id=&#34;1-FirmAE-&amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;a href=&#34;#1-FirmAE-&amp;#xAD6C;&amp;#xC131;&#34; class=&#34;headerlink&#34; title=&#34;1. FirmAE &amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;/a&gt;1. FirmAE &amp;#xAD6C;&amp;#xC131;&lt;/h2&gt;&lt;p&gt;FirmAE&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F587;&amp;#xFE0F;&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xBC0F; &amp;#xD30C;&amp;#xC77C;&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/analyses/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;code&gt;run.sh&lt;/code&gt; &amp;#xC2E4;&amp;#xD589; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC911; analyses &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xB85C;&amp;#xADF8;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/firmwares/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&lt;code&gt;.bin&lt;/code&gt;)&amp;#xB97C; &amp;#xC704;&amp;#xCE58; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/images/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC704;&amp;#xD55C; OS &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scratch/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xAC01; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;, IID(Image ID)&amp;#xB85C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xBA70;, &amp;#xADF8; &amp;#xC548;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xCD94;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xCEE4;&amp;#xB110;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;, &amp;#xB85C;&amp;#xADF8; &amp;#xB4F1; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC911;&amp;#xAC04; &amp;#xC0B0;&amp;#xCD9C;&amp;#xBB3C;&amp;#xACFC; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;FirmAE/scratch/{IID}&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scripts/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBA54;&amp;#xC778; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC01;&amp;#xC885; &amp;#xD558;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/scripts/makeNetwork.py&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;, &amp;#xAD00;&amp;#xB828; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xCD5C;&amp;#xC885; QEMU &amp;#xC2E4;&amp;#xD589; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &lt;code&gt;FirmAE/scratch/{IID}/run.sh&lt;/code&gt;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/sources/scraper/firmware/spiders/&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;code&gt;run.sh&lt;/code&gt; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &lt;code&gt;&amp;lt;brand&amp;gt;&lt;/code&gt; &amp;#xC778;&amp;#xC790;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBE0C;&amp;#xB79C;&amp;#xB4DC; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;scripts/util.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;get_brand()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;FirmAE/run.sh&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xBA54;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&lt;/strong&gt;&amp;#xB85C;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 5&amp;#xAC00;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&lt;code&gt;FirmAE/run.sh&lt;/code&gt; &amp;#xC758; 5&amp;#xAC00;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;code&gt;-c&lt;/code&gt;(check)&lt;/th&gt;
&lt;th&gt;&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;/&amp;#xC6F9; &amp;#xC811;&amp;#xC18D; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; check &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-r&lt;/code&gt;(run)&lt;/td&gt;
&lt;td&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-d&lt;/code&gt;(debug)&lt;/td&gt;
&lt;td&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-b&lt;/code&gt;(boot debug mode)&lt;/td&gt;
&lt;td&gt;kernel &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD80;&amp;#xD305; &amp;#xB2E8;&amp;#xACC4;&amp;#xBD80;&amp;#xD130; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;-a&lt;/code&gt;(analyze)&lt;/td&gt;
&lt;td&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xBC1C;&amp;#xC0DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &lt;code&gt;analyses/&lt;/code&gt;&amp;#xC640; &lt;code&gt;scratch/{IID}/result&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&lt;img src=&#34;image002.jpg&#34; alt=&#34;image002.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#x1F62E; &amp;#xC804;&amp;#xBD80; &amp;#xBCF4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xBCF4;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD3F4;&amp;#xB354;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;run.sh&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;scratch/&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD06C;&amp;#xAC8C; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;run.sh&lt;/code&gt;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &lt;code&gt;scratch/&lt;/code&gt;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; FirmAE&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xB294; &lt;code&gt;scratch/&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&lt;/strong&gt;&amp;#xD558;&amp;#xB2C8; &amp;#xB85C;&amp;#xADF8; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC2E4;&amp;#xD589; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F50D;&lt;/p&gt;
&lt;h2 id=&#34;2-FirmAE-&amp;#xC2E4;&amp;#xD589;-&amp;#xBC0F;-FirmAE-Debugger&#34;&gt;&lt;a href=&#34;#2-FirmAE-&amp;#xC2E4;&amp;#xD589;-&amp;#xBC0F;-FirmAE-Debugger&#34; class=&#34;headerlink&#34; title=&#34;2. FirmAE &amp;#xC2E4;&amp;#xD589; &amp;#xBC0F; FirmAE Debugger&#34;&gt;&lt;/a&gt;2. FirmAE &amp;#xC2E4;&amp;#xD589; &amp;#xBC0F; FirmAE Debugger&lt;/h2&gt;&lt;p&gt;&lt;code&gt;-c&lt;/code&gt; Check &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBC0F; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD655;&amp;#xC778;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC81C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD544;&amp;#xC694;&amp;#xC640; &amp;#xC6A9;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;-d&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; debug &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image003.png&#34; alt=&#34;image003.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; FirmAE Debugger &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F389; &amp;#xC774;&amp;#xC81C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; FirmAE Debugger&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; 5&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;connect to socat: python socat&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 1&amp;#xBC88; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, netcat &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30; &amp;#xC6F9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F310;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;connect to shell: shell&amp;#xB85C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xC5EC; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;br&gt;busybox &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; linux &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xAE30; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F9EA;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image004.png&#34; alt=&#34;image004.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;tcpdump: &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; tcpdump&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2709;&amp;#xFE0F; &amp;#xAE30;&amp;#xC785;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB530;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xB2C8; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image005.png&#34; alt=&#34;image005.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;run gdbserver: &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; gdb server &amp;#xC5F4;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; ARM, MIPS &amp;#xB4F1;&amp;#xC758; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC77C;&amp;#xBC18; gdb&amp;#xB85C;&amp;#xB294; &amp;#xC1A1;&amp;#xC218;&amp;#xC2E0;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x26A0;&amp;#xFE0F; &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; gdb-multiarch&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; gdb server&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;sudo apt-get install gdb-multiarch
gdb-multiarch
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; sysroot
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; follow-fork-mode child
&lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; solib-search-path PATH
target remote IP:PORT&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  &amp;#xC124;&amp;#xCE58; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; gdb-multiarch &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; binwalk&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; lib &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; path&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4D6;&lt;/p&gt;
&lt;p&gt;  &amp;#xC608;&amp;#xC81C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; pid&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815; &amp;#xB41C; gdb server&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC811;&amp;#xC18D;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. httpd &amp;#xAC19;&amp;#xC740; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC6F9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image006.png&#34; alt=&#34;image006.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;file transfer: &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;firmadyne/&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC774;&amp;#xC720;&amp;#xB294; &lt;code&gt;FirmAE/debug.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;file_transfer()&lt;/code&gt;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC0C1; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC258; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBC00;&amp;#xC5B4; &amp;#xB123;&amp;#xAC70;&amp;#xB098;, &lt;code&gt;xinetd.conf&lt;/code&gt;, &lt;code&gt;sshd_config&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2708;&amp;#xFE0F; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C;&amp;#xB294; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image007.png&#34; alt=&#34;image007.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;3-IP-&amp;#xBC0F;-&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xBC1C;&amp;#xC0DD;-&amp;#xC2DC;-&amp;#xD574;&amp;#xACB0;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-IP-&amp;#xBC0F;-&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xBC1C;&amp;#xC0DD;-&amp;#xC2DC;-&amp;#xD574;&amp;#xACB0;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3. IP &amp;#xBC0F; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3. IP &amp;#xBC0F; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;FirmAE&amp;#xB294; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xB41C; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xAE30;&amp;#xAE30; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; IP&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xC774; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC70;&amp;#xB098;, localhost&amp;#xB85C;&amp;#xB9CC; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; FirmAE &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC885;&amp;#xC885; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F62D;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image008.jpg&#34; alt=&#34;image008.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC6D0;&amp;#xC778;&amp;#xACFC; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt; &amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;(&amp;#xBE0C;&amp;#xB9AC;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB4DC;)&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB300;&amp;#xCCB4; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBC29;&amp;#xC2DD;(QEMU &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBAA8;&amp;#xB4DC;)&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9; &amp;#xC804;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F6B8; &amp;#xC790;&amp;#xB3D9; &amp;#xC804;&amp;#xD658;&amp;#xC774; &amp;#xB418;&amp;#xBA74;, &lt;strong&gt;localhost&amp;#xB85C; &amp;#xC811;&amp;#xC18D; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&lt;/strong&gt;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, localhost&amp;#xB85C; &amp;#xC811;&amp;#xC18D; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image009.png&#34; alt=&#34;image009.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &lt;code&gt;scratch/{IID}/run.sh&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0; &lt;code&gt;QEMU_NET_OPTS&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; QEMU &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBE0C;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC870;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; FirmAE &amp;#xAD6C;&amp;#xC131;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C;, &lt;code&gt;scratch/{IID}&lt;/code&gt; &amp;#xD3F4;&amp;#xB354;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;scripts/makeNetwork.py&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xBA74; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2DC;, &amp;#xBB34;&amp;#xC870;&amp;#xAC74; localhost&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F513;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;scripts/makeNetwork.py&lt;/code&gt; &amp;#xC218;&amp;#xC815;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;cp scripts/makeNetwork.py scripts/makeNetwork.py.bak&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  &amp;#xBA3C;&amp;#xC800; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC31;&amp;#xC5C5;&amp;#xD574;&amp;#xB461;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;isUserNetwork = any(isDhcpIp(ip) &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ip &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ips)
&lt;span class=&#34;hljs-keyword&#34;&gt;with&lt;/span&gt; open(SCRATCHDIR + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/&amp;quot;&lt;/span&gt; + str(iid) + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/isDhcp&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;w&amp;quot;&lt;/span&gt;) &lt;span class=&#34;hljs-keyword&#34;&gt;as&lt;/span&gt; out:&lt;/code&gt;&lt;/pre&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# isUserNetwork = any(isDhcpIp(ip) for ip in ips)&lt;/span&gt;
isUserNetwork = &lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;with&lt;/span&gt; open(SCRATCHDIR + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/&amp;quot;&lt;/span&gt; + str(iid) + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/isDhcp&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;w&amp;quot;&lt;/span&gt;) &lt;span class=&#34;hljs-keyword&#34;&gt;as&lt;/span&gt; out:&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  IP &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xCC98;&amp;#xB7FC; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;portfwd = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&amp;quot;&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (proto, ip, port) &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ports:&lt;/code&gt;&lt;/pre&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;portfwd = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hostfwd=tcp::8888-:80,&amp;quot;&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;# portfwd = &amp;quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&amp;quot;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (proto, ip, port) &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; ports:&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;  port &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xCC98;&amp;#xB7FC; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image010.png&#34; alt=&#34;image010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC218;&amp;#xC815; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xBA74; IP&amp;#xAC00; localhost&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44D;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB9CC;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC544;&amp;#xB2D0; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACC4;&amp;#xC18D; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85; &amp;#xB4DC;&amp;#xB9B0; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &lt;code&gt;scratch/{IID}/&lt;/code&gt;&amp;#xC5D0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xC9C4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;, &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;QEMU&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C; &amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; FirmAE&amp;#xB294; &amp;#xC815;&amp;#xB9D0; &amp;#xB290;&amp;#xB9AC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image011.png&#34; alt=&#34;image011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;FirmAE&amp;#xB294; &amp;#xB290;&amp;#xB9AC;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC798;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xBA85;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xAE00;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC5D0; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F64F;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44B;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/07/10/newp1ayer48/emulation2/ko/image001.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/07/10/newp1ayer48/emulation2/ko/">

  <title>[Research] Firmware Emulation with FirmAE Part 2 (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-07-10 22:00" pubdate>
      2025 7 10 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.7k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      54
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Firmware Emulation with FirmAE Part 2 (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! Hackyboiz&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xB0AE;&#xC740; &#xACF3;(low-level)&#xC744; &#xB9E1;&#xACE0; &#xC788;&#xB294; <code>newp1ayer48</code> &#xC785;&#xB2C8;&#xB2E4;! &#x1F938;&#x1F3FB;&#x200D;&#x2642;&#xFE0F;</p>
<p>&#xC624;&#xB79C;&#xB9CC;&#xC5D0; Firmware Emulation with FirmAE Part 2&#xB85C; &#xBB34;&#xC0AC;&#xD788;(?) &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="image001.jpg" srcset="/img/loading.gif" alt="image001.jpg"></p>
<p>FirmAE&#xB294; &#xD38C;&#xC6E8;&#xC5B4; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xC744; &#xC790;&#xB3D9;&#xD654; &#xD574;&#xC8FC;&#xB294; &#xD3B8;&#xB9AC;&#xD55C; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;! &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xD558;&#xACE0; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xB354;&#xC6B1; &#xC88B;&#xC8E0;! &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xACFC; FirmAE &#xC124;&#xCE58;&#xB294; &#xC774;&#xC804; &#xAE00;&#xC778; <a href="https://hackyboiz.github.io/2025/05/08/newp1ayer48/emulation1/ko/">Firmware Emulation with FirmAE Part 1</a>&#xC744; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>&#xC800;&#xBC88; &#xAE00;&#xC5D0; &#xC774;&#xC5B4;&#xC11C; &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; FirmAE&#xC758; &#xAD6C;&#xC131;&#xACFC; &#xC2E4;&#xD589;, &#xADF8;&#xB9AC;&#xACE0; IP &#xBB38;&#xC81C; &#xBC1C;&#xC0DD; &#xC2DC; &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xAE4C;&#xC9C0; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F64C;&#x1F3FB;</p>
<h2 id="1-FirmAE-&#xAD6C;&#xC131;"><a href="#1-FirmAE-&#xAD6C;&#xC131;" class="headerlink" title="1. FirmAE &#xAD6C;&#xC131;"></a>1. FirmAE &#xAD6C;&#xC131;</h2><p>FirmAE&#xC758; &#xC8FC;&#xC694; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC640; &#xD30C;&#xC77C;&#xC740; &#xC544;&#xB798;&#xCC98;&#xB7FC; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F587;&#xFE0F;</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xBC0F; &#xD30C;&#xC77C;</th>
<th>&#xC124;&#xBA85;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>FirmAE/analyses/</code></td>
<td><code>run.sh</code> &#xC2E4;&#xD589; &#xBAA8;&#xB4DC; &#xC911; analyses &#xBAA8;&#xB4DC;&#xC758; &#xAD00;&#xB828;&#xB41C; &#xD30C;&#xC77C;&#xACFC; &#xB85C;&#xADF8;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xACF3;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/firmwares/</code></td>
<td>&#xBD84;&#xC11D;&#xD560; &#xD38C;&#xC6E8;&#xC5B4;(<code>.bin</code>)&#xB97C; &#xC704;&#xCE58; &#xC2DC;&#xD0A4;&#xB294; &#xACF3;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/images/</code></td>
<td>&#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xC704;&#xD55C; OS &#xC774;&#xBBF8;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACF3;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/scratch/</code></td>
<td>&#xAC01; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xC2E4;&#xD589; &#xC2DC;, IID(Image ID)&#xB85C; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xBA70;, &#xADF8; &#xC548;&#xC5D0;&#xB294; <strong>&#xCD94;&#xCD9C;&#xB41C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;, &#xCEE4;&#xB110;, &#xC0DD;&#xC131;&#xB41C; &#xB514;&#xC2A4;&#xD06C; &#xC774;&#xBBF8;&#xC9C0;, &#xB85C;&#xADF8; &#xB4F1; &#xD574;&#xB2F9; &#xC2E4;&#xD589;&#xC5D0; &#xB300;&#xD55C; &#xBAA8;&#xB4E0; &#xC911;&#xAC04; &#xC0B0;&#xCD9C;&#xBB3C;&#xACFC; &#xACB0;&#xACFC;&#xAC00; &#xC800;&#xC7A5;</strong>&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB294; <code>FirmAE/scratch/{IID}</code> &#xD615;&#xD0DC;&#xB85C; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/scripts/</code></td>
<td>&#xBA54;&#xC778; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB4E4;&#xC774; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC01;&#xC885; &#xD558;&#xC704; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACF3;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/scripts/makeNetwork.py</code></td>
<td>&#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB3D9;&#xC791;&#xC744; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xACE0;, &#xAD00;&#xB828; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC124;&#xC815;&#xC744; &#xCD5C;&#xC885; QEMU &#xC2E4;&#xD589; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; <code>FirmAE/scratch/{IID}/run.sh</code>&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/sources/scraper/firmware/spiders/</code></td>
<td><code>run.sh</code> &#xC2E4;&#xD589;&#xC5D0; &#xD544;&#xC694;&#xD55C; <code>&lt;brand&gt;</code> &#xC778;&#xC790;&#xC5D0; &#xD574;&#xB2F9;&#xB418;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC785;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xC774;&#xB984;&#xC774; &#xC5C6;&#xAC70;&#xB098; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBE0C;&#xB79C;&#xB4DC; &#xC774;&#xB984;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xACBD;&#xC6B0; <code>scripts/util.py</code>&#xC5D0;&#xC11C; <code>get_brand()</code>&#xB97C; &#xD1B5;&#xD574; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>FirmAE/run.sh</code></td>
<td><strong>&#xBA54;&#xC778; &#xC2E4;&#xD589; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;</strong>&#xB85C;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; 5&#xAC00;&#xC9C0; &#xBAA8;&#xB4DC;&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</td>
</tr>
</tbody>
</table>
</div>
<p><code>FirmAE/run.sh</code> &#xC758; 5&#xAC00;&#xC9C0; &#xBAA8;&#xB4DC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th><code>-c</code>(check)</th>
<th>&#xB124;&#xD2B8;&#xC6CC;&#xD06C;/&#xC6F9; &#xC811;&#xC18D; &#xAC00;&#xB2A5; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xBAA8;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. <strong>&#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xC5D0; &#xC55E;&#xC11C; check &#xBAA8;&#xB4DC;&#xB85C; &#xD655;&#xC778;</strong>&#xD558;&#xB294; &#xAC83;&#xC774; &#xC77C;&#xBC18;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>-r</code>(run)</td>
<td>&#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBAA8;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>-d</code>(debug)</td>
<td>&#xB514;&#xBC84;&#xAE45; &#xBAA8;&#xB4DC;&#xB85C; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>-b</code>(boot debug mode)</td>
<td>kernel &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xBD80;&#xD305; &#xB2E8;&#xACC4;&#xBD80;&#xD130; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294; &#xBAA8;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</td>
</tr>
<tr>
<td><code>-a</code>(analyze)</td>
<td>&#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D; &#xBAA8;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xBAA9;&#xD45C;&#xB85C; &#xC0AC;&#xC804;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xACF5;&#xACA9;&#xB4E4;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xBC1C;&#xC0DD; &#xAC00;&#xB2A5;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xB294; <code>analyses/</code>&#xC640; <code>scratch/{IID}/result</code>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</td>
</tr>
</tbody>
</table>
</div>
<p><img src="image002.jpg" srcset="/img/loading.gif" alt="image002.jpg"></p>
<p>&#xC774;&#xC678;&#xC5D0;&#xB3C4; &#xD30C;&#xC77C;&#xC774; &#xC815;&#xB9D0; &#xB9CE;&#xC9C0;&#xB9CC;&#x2026; &#x1F62E; &#xC804;&#xBD80; &#xBCF4;&#xAE30;&#xC5D0;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC73C;&#xB2C8;, &#xC911;&#xC694;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xB418;&#xB294; &#xAC83;&#xB9CC; &#xC18C;&#xAC1C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC911;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xBCF4;&#xB294; &#xC911;&#xC694;&#xD55C; &#xD30C;&#xC77C;&#xACFC; &#xD3F4;&#xB354;&#xB294; &#xC544;&#xB798;&#xB85C; &#xC815;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>scripts/makeNetwork.py</code></li>
<li><code>run.sh</code></li>
<li><code>scratch/</code></li>
</ul>
<p>&#xB2E4;&#xB978; &#xD30C;&#xC77C;&#xB4E4;&#xB3C4; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xC9C0;&#xB9CC;, &#xD06C;&#xAC8C; <code>scripts/makeNetwork.py</code>&#xC758; &#xC124;&#xC815; &#xAC12;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC5EC; <code>run.sh</code>&#xC774; &#xC2E4;&#xD589;&#xB418;&#xACE0; <code>scratch/</code>&#xC5D0; &#xD574;&#xB2F9; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xC774;&#xBBF8;&#xC9C0;&#xC640; &#xD30C;&#xC77C;&#xB4E4;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xD750;&#xB984;&#xC73C;&#xB85C; FirmAE&#xAC00; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC758; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; <strong>&#xBAA8;&#xB4E0; &#xB85C;&#xADF8;&#xB294; <code>scratch/</code> &#xB0B4;&#xC5D0; &#xC874;&#xC7AC;</strong>&#xD558;&#xB2C8; &#xB85C;&#xADF8; &#xC815;&#xBCF4;&#xB3C4; &#xD655;&#xC778;&#xD558;&#xBA74; &#xC2E4;&#xD589; &#xC774;&#xD6C4;&#xC5D0; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB3C4; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;! &#x1F50D;</p>
<h2 id="2-FirmAE-&#xC2E4;&#xD589;-&#xBC0F;-FirmAE-Debugger"><a href="#2-FirmAE-&#xC2E4;&#xD589;-&#xBC0F;-FirmAE-Debugger" class="headerlink" title="2. FirmAE &#xC2E4;&#xD589; &#xBC0F; FirmAE Debugger"></a>2. FirmAE &#xC2E4;&#xD589; &#xBC0F; FirmAE Debugger</h2><p><code>-c</code> Check &#xC635;&#xC158;&#xC73C;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBC0F; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xD655;&#xC778;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xC5C8;&#xB2E4;&#xBA74;, &#xC774;&#xC81C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC740; &#xD544;&#xC694;&#xC640; &#xC6A9;&#xB3C4;&#xC5D0; &#xB530;&#xB77C; &#xC635;&#xC158;&#xC744; &#xBD80;&#xC5EC;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xB2E4;&#xBA74; <code>-d</code> &#xC635;&#xC158;&#xC73C;&#xB85C; debug &#xBAA8;&#xB4DC;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image003.png" srcset="/img/loading.gif" alt="image003.png"></p>
<p>&#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC774; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xBA74; &#xC704;&#xCC98;&#xB7FC; FirmAE Debugger &#xD654;&#xBA74;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#x1F389; &#xC774;&#xC81C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; FirmAE Debugger&#xC758; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAE30;&#xB2A5;&#xC740; &#xD06C;&#xAC8C; 5&#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>connect to socat: python socat&#xC744; &#xD1B5;&#xD574; &#xC811;&#xC18D;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;. 1&#xBC88; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB354;&#xB77C;&#xB3C4;, netcat &#xC5F0;&#xACB0;&#xC774; &#xC798; &#xB418;&#xC5C8;&#xB2E4;&#xBA74; &#xC0DD;&#xC131;&#xB41C; &#xC8FC;&#xC18C;&#xC640; &#xD3EC;&#xD2B8;&#xB85C; &#xAC00;&#xC0C1; &#xAE30;&#xAE30; &#xC6F9; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC811;&#xC18D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#x1F310;</p>
</li>
<li><p>connect to shell: shell&#xB85C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xB41C; &#xAC00;&#xC0C1; &#xAE30;&#xAE30;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xC5EC; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;!<br>busybox &#xB4F1;&#xC73C;&#xB85C; &#xD574;&#xB2F9; &#xD38C;&#xC6E8;&#xC5B4;&#xC5D0; &#xC815;&#xC758;&#xB41C; linux &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xAE30;&#xAE30; &#xB0B4;&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xACFC; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F9EA;</p>
</li>
</ul>
<p><img src="image004.png" srcset="/img/loading.gif" alt="image004.png"></p>
<ul>
<li>tcpdump: &#xC0DD;&#xC131;&#xD55C; &#xAC00;&#xC0C1; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; tcpdump&#xB85C; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x2709;&#xFE0F; &#xAE30;&#xC785;&#xB41C; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xB530;&#xB85C; &#xC218;&#xC815;&#xC774; &#xC548;&#xB418;&#xB2C8; &#xC0DD;&#xC131;&#xB41C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C;&#xB9CC; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="image005.png" srcset="/img/loading.gif" alt="image005.png"></p>
<ul>
<li><p>run gdbserver: &#xAC00;&#xC0C1; &#xAE30;&#xAE30; &#xB0B4;&#xBD80;&#xC5D0; gdb server &#xC5F4;&#xC5B4; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>  &#xC774; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC900;&#xBE44;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xAE30;&#xAE30; &#xD38C;&#xC6E8;&#xC5B4;&#xB294; ARM, MIPS &#xB4F1;&#xC758; RISC &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB300;&#xBD80;&#xBD84;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC77C;&#xBC18; gdb&#xB85C;&#xB294; &#xC1A1;&#xC218;&#xC2E0;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC778;&#xC2DD;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#x26A0;&#xFE0F; &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; gdb-multiarch&#xB97C; &#xD1B5;&#xD574;&#xC11C; gdb server&#xC5D0; &#xC811;&#xC18D;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
  <pre><code class="hljs bash">sudo apt-get install gdb-multiarch
gdb-multiarch
<span class="hljs-built_in">set</span> sysroot
<span class="hljs-built_in">set</span> follow-fork-mode child
<span class="hljs-built_in">set</span> solib-search-path PATH
target remote IP:PORT</code></pre>
<p>  &#xC124;&#xCE58; &#xD6C4;&#xC5D0;&#xB294; &#xC704;&#xCC98;&#xB7FC; gdb-multiarch &#xC2E4;&#xD589; &#xD6C4; &#xBA87; &#xAC00;&#xC9C0; &#xC124;&#xC815;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC804;&#xC5D0; binwalk&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xC81C;&#xD55C; &#xD38C;&#xC6E8;&#xC5B4; lib &#xC8FC;&#xC18C;&#xB97C; path&#xB85C; &#xB4F1;&#xB85D;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#x1F4D6;</p>
<p>  &#xC608;&#xC81C; &#xD38C;&#xC6E8;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC2A4; pid&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC124;&#xC815; &#xB41C; gdb server&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xC811;&#xC18D;&#xC774; &#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. httpd &#xAC19;&#xC740; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC801;&#xC6A9;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xC6F9; &#xD398;&#xC774;&#xC9C0; &#xAE30;&#xB2A5;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<p><img src="image006.png" srcset="/img/loading.gif" alt="image006.png"></p>
<ul>
<li><p>file transfer: &#xB85C;&#xCEEC;&#xC5D0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xAC00;&#xC0C1; &#xAE30;&#xAE30;&#xB85C; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>  &#xC804;&#xC1A1;&#xB41C; &#xD30C;&#xC77C;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xACBD;&#xB85C;&#xB294; &#xD38C;&#xC6E8;&#xC5B4; &#xB0B4;&#xC5D0; &#xC0DD;&#xC131;&#xB41C; <code>firmadyne/</code> &#xB0B4;&#xC5D0; &#xC704;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; &#xC774;&#xC720;&#xB294; <code>FirmAE/debug.py</code>&#xC5D0;&#xC11C; <code>file_transfer()</code>&#xC5D0; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC00;&#xC0C1; &#xAE30;&#xAE30;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB9AC;&#xBC84;&#xC2A4; &#xC258; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBC00;&#xC5B4; &#xB123;&#xAC70;&#xB098;, <code>xinetd.conf</code>, <code>sshd_config</code> &#xAC19;&#xC740; &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC744; &#xC804;&#xC1A1;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x2708;&#xFE0F; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C;&#xC11C;&#xB294; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xC640; &#xAD00;&#xB828; &#xD30C;&#xC77C;&#xC744; &#xC804;&#xC1A1;&#xD558;&#xC5EC; &#xD14C;&#xC2A4;&#xD2B8; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>  <img src="image007.png" srcset="/img/loading.gif" alt="image007.png"></p>
</li>
</ul>
<h2 id="3-IP-&#xBC0F;-&#xB124;&#xD2B8;&#xC6CC;&#xD06C;-&#xBB38;&#xC81C;-&#xBC1C;&#xC0DD;-&#xC2DC;-&#xD574;&#xACB0;-&#xBC29;&#xBC95;"><a href="#3-IP-&#xBC0F;-&#xB124;&#xD2B8;&#xC6CC;&#xD06C;-&#xBB38;&#xC81C;-&#xBC1C;&#xC0DD;-&#xC2DC;-&#xD574;&#xACB0;-&#xBC29;&#xBC95;" class="headerlink" title="3. IP &#xBC0F; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBB38;&#xC81C; &#xBC1C;&#xC0DD; &#xC2DC; &#xD574;&#xACB0; &#xBC29;&#xBC95;"></a>3. IP &#xBC0F; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBB38;&#xC81C; &#xBC1C;&#xC0DD; &#xC2DC; &#xD574;&#xACB0; &#xBC29;&#xBC95;</h2><p>FirmAE&#xB294; &#xAE30;&#xAE30; &#xD38C;&#xC6E8;&#xC5B4;&#xC5D0; &#xC124;&#xC815;&#xB41C; IP &#xC8FC;&#xC18C;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xC124;&#xC815;&#xD558;&#xACE0; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xAD6C;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xAE30;&#xAE30; &#xD38C;&#xC6E8;&#xC5B4;&#xC5D0; &#xB530;&#xB77C;&#xC11C; IP&#xAC00; &#xC124;&#xC815;&#xC774; &#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xAC70;&#xB098;, localhost&#xB85C;&#xB9CC; &#xC811;&#xC18D;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; FirmAE &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC885;&#xC885; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F62D;</p>
<p><img src="image008.jpg" srcset="/img/loading.gif" alt="image008.jpg"></p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB294; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xC6D0;&#xC778;&#xACFC; &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; <code>scripts/makeNetwork.py</code> &#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xD574;&#xACB0;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC18C;&#xAC1C;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>FirmAE&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xBCF8; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC124;&#xC815;(&#xBE0C;&#xB9AC;&#xC9C0; &#xBAA8;&#xB4DC;)&#xC5D0; &#xC2E4;&#xD328;&#xD588;&#xC744; &#xB54C;, &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xACC4;&#xC18D; &#xC9C4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB300;&#xCCB4; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBC29;&#xC2DD;(QEMU &#xC0AC;&#xC6A9;&#xC790; &#xBAA8;&#xB4DC;)&#xC73C;&#xB85C; &#xC790;&#xB3D9; &#xC804;&#xD658;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F6B8; &#xC790;&#xB3D9; &#xC804;&#xD658;&#xC774; &#xB418;&#xBA74;, <strong>localhost&#xB85C; &#xC811;&#xC18D; &#xD658;&#xACBD;&#xC774; &#xAD6C;&#xC131;</strong>&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xC758; &#xD38C;&#xC6E8;&#xC5B4;&#xB3C4; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, localhost&#xB85C; &#xC811;&#xC18D; &#xD658;&#xACBD;&#xC774; &#xAD6C;&#xC131;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image009.png" srcset="/img/loading.gif" alt="image009.png"></p>
<p>&#xC774;&#xAC83;&#xC740; <code>scratch/{IID}/run.sh</code> &#xB0B4;&#xC5D0; <code>QEMU_NET_OPTS</code> &#xBCC0;&#xC218;&#xB97C; &#xD1B5;&#xD574; QEMU &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBE0C;&#xB9AC;&#xC9C0; &#xC124;&#xC815;&#xC744; &#xC870;&#xC815;&#xD558;&#xB294; &#xACF3;&#xC5D0;&#xC11C; &#xBC8C;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xC55E;&#xC11C; FirmAE &#xAD6C;&#xC131;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD560; &#xB54C;, <code>scratch/{IID}</code> &#xD3F4;&#xB354;&#xC640; &#xD30C;&#xC77C;&#xB4E4;&#xC740; <code>scripts/makeNetwork.py</code>&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC124;&#xC815;&#xC744; &#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xD30C;&#xC774;&#xC36C; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC218;&#xC815;&#xD558;&#xBA74; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xC2DC;, &#xBB34;&#xC870;&#xAC74; localhost&#xB85C; &#xC5F4;&#xC5B4;&#xBC84;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F513;</p>
<ul>
<li><p><code>scripts/makeNetwork.py</code> &#xC218;&#xC815;</p>
  <pre><code class="hljs bash">cp scripts/makeNetwork.py scripts/makeNetwork.py.bak</code></pre>
<p>  &#xBA3C;&#xC800; &#xC6D0;&#xBCF8; &#xD30C;&#xC77C;&#xC744; &#xBC31;&#xC5C5;&#xD574;&#xB461;&#xB2C8;&#xB2E4;.</p>
  <pre><code class="hljs python">isUserNetwork = any(isDhcpIp(ip) <span class="hljs-keyword">for</span> ip <span class="hljs-keyword">in</span> ips)
<span class="hljs-keyword">with</span> open(SCRATCHDIR + <span class="hljs-string">&quot;/&quot;</span> + str(iid) + <span class="hljs-string">&quot;/isDhcp&quot;</span>, <span class="hljs-string">&quot;w&quot;</span>) <span class="hljs-keyword">as</span> out:</code></pre>
  <pre><code class="hljs python"><span class="hljs-comment"># isUserNetwork = any(isDhcpIp(ip) for ip in ips)</span>
isUserNetwork = <span class="hljs-literal">True</span>
<span class="hljs-keyword">with</span> open(SCRATCHDIR + <span class="hljs-string">&quot;/&quot;</span> + str(iid) + <span class="hljs-string">&quot;/isDhcp&quot;</span>, <span class="hljs-string">&quot;w&quot;</span>) <span class="hljs-keyword">as</span> out:</code></pre>
<p>  IP &#xC124;&#xC815; &#xBD80;&#xBD84;&#xC744; &#xCCAB; &#xBC88;&#xC9F8; &#xCF54;&#xB4DC;&#xB97C; &#xB450; &#xBC88;&#xC9F8;&#xCC98;&#xB7FC; &#xC218;&#xC815;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
  <pre><code class="hljs python">portfwd = <span class="hljs-string">&quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&quot;</span>
<span class="hljs-keyword">for</span> (proto, ip, port) <span class="hljs-keyword">in</span> ports:</code></pre>
  <pre><code class="hljs python">portfwd = <span class="hljs-string">&quot;hostfwd=tcp::8888-:80,&quot;</span>
<span class="hljs-comment"># portfwd = &quot;hostfwd=tcp::80-:80,hostfwd=tcp::443-:443,&quot;</span>

<span class="hljs-keyword">for</span> (proto, ip, port) <span class="hljs-keyword">in</span> ports:</code></pre>
<p>  port &#xC124;&#xC815; &#xBD80;&#xBD84;&#xB3C4; &#xCCAB; &#xBC88;&#xC9F8; &#xCF54;&#xB4DC;&#xB97C; &#xB450; &#xBC88;&#xC9F8;&#xCC98;&#xB7FC; &#xC218;&#xC815;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<p><img src="image010.png" srcset="/img/loading.gif" alt="image010.png"></p>
<p>&#xD30C;&#xC77C; &#xC218;&#xC815; &#xD6C4; &#xC2E4;&#xD589;&#xC744; &#xD558;&#xBA74; IP&#xAC00; localhost&#xB85C; &#xBCC0;&#xACBD;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#x1F44D;&#x1F3FB;</p>
<p>&#xC774; &#xBC29;&#xBC95;&#xC740; &#xB2E8;&#xC21C;&#xD788; &#xC124;&#xC815;&#xB418;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB9CC;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xADFC;&#xBCF8;&#xC801;&#xC778; &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xC774; &#xC544;&#xB2D0; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACC4;&#xC18D; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xC9C1;&#xC811; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC5EC; &#xC815;&#xD655;&#xD788; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC124;&#xC815;&#xC744; &#xB9DE;&#xCDB0; &#xC8FC;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC11C; &#xC124;&#xBA85; &#xB4DC;&#xB9B0; &#xAC83;&#xCC98;&#xB7FC; <code>scratch/{IID}/</code>&#xC5D0; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305; &#xC9C4;&#xD589; &#xC911;&#xC5D0; &#xBC1C;&#xC0DD;&#xD55C; &#xBAA8;&#xB4E0; &#xB85C;&#xADF8;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xAE30;&#xC5D0;, &#xB85C;&#xADF8;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C;&#xB3C4; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>QEMU&#xB97C; &#xD1B5;&#xD574; &#xC9C1;&#xC811; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC744; &#xD558;&#xB294; &#xAC83;&#xB3C4; &#xCD94;&#xCC9C; &#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xC54C;&#xACA0;&#xC9C0;&#xB9CC; FirmAE&#xB294; &#xC815;&#xB9D0; &#xB290;&#xB9AC;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;&#x2026;</p>
<p><img src="image011.png" srcset="/img/loading.gif" alt="image011.png"></p>
<p>FirmAE&#xB294; &#xB290;&#xB9AC;&#xAE34; &#xD558;&#xC9C0;&#xB9CC;, &#xC798;&#xB9CC; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xBD84;&#xBA85;&#xD788; &#xC720;&#xC6A9;&#xD55C; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;! &#xC774; &#xAE00;&#xB85C; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xD38C;&#xC6E8;&#xC5B4; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xC5D0; &#xC870;&#xAE08;&#xC774;&#xB098;&#xB9C8; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#x1F64F;&#x1F3FB;</p>
<p>&#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xB2E4;&#xB978; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC8FC;&#xC81C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;! &#x1F44B;&#x1F3FB;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/firmware/">firmware</a>
                  
                  <a class="hover-with-bg" href="/tags/newp1ayer48/">newp1ayer48</a>
                  
                  <a class="hover-with-bg" href="/tags/Embedded/">Embedded</a>
                  
                  <a class="hover-with-bg" href="/tags/Emulation/">Emulation</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_newp1ayer48.jpg" srcset="/img/loading.gif" alt="newp1ayer48">
                  </div>

                  <div class="link-text">
                    <div class="link-title">newp1ayer48</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/newp1ayer48">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/07/12/poosic/cve-2025-32463/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-32463 : sudo chroot  Local Privilege Escalation</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/07/10/newp1ayer48/emulation2/en/">
                    <span class="hidden-mobile">[Research] Firmware Emulation with FirmAE Part 2 (en)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/07/10/newp1ayer48/emulation2/ko/';
        this.page.identifier = '/2025/07/10/newp1ayer48/emulation2/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Firmware Emulation with FirmAE Part 2 (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
