

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;5&amp;#xAC1C;&amp;#xC6D4;-&amp;#xBB35;&amp;#xD78C;-&amp;#xB9C1;&amp;#xD06C;&#34;&gt;&lt;a href=&#34;#5&amp;#xAC1C;&amp;#xC6D4;-&amp;#xBB35;&amp;#xD78C;-&amp;#xB9C1;&amp;#xD06C;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xAC1C;&amp;#xC6D4; &amp;#xBB35;&amp;#xD78C; &amp;#xB9C1;&amp;#xD06C;&#34;&gt;&lt;/a&gt;5&amp;#xAC1C;&amp;#xC6D4; &amp;#xBB35;&amp;#xD78C; &amp;#xB9C1;&amp;#xD06C;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xB2EC; &amp;#xC804; Fandu&amp;#xD615;&amp;#xB2D8;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xC54C;&amp;#xB824;&amp;#xB2EC;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB358;&amp;#xC838;&amp;#xC8FC;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD560; &amp;#xC77C;&amp;#xB3C4; &amp;#xBB35;&amp;#xD600;&amp;#xB46C;&amp;#xC57C; &amp;#xC81C;&amp;#xB9DB;! 5&amp;#xB2EC; &amp;#xB3D9;&amp;#xC548; &amp;#xACE0;&amp;#xC774; &amp;#xBAA8;&amp;#xC154;&amp;#xB193;&amp;#xC740; GDBFrontend, &amp;#xB625;&amp;#xC778;&amp;#xC9C0; &amp;#xB41C;&amp;#xC7A5;&amp;#xC778;&amp;#xC9C0; &amp;#xCC0D;&amp;#xC5B4; &amp;#xBA39;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC124;&amp;#xCE58;-&amp;#xBC0F;-&amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;a href=&#34;#&amp;#xC124;&amp;#xCE58;-&amp;#xBC0F;-&amp;#xC2E4;&amp;#xD589;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC124;&amp;#xCE58; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;/a&gt;&amp;#xC124;&amp;#xCE58; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/rohanrhu/gdb-frontend&#34;&gt;rohanrhu/gdb-frontend&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; &amp;lt;https://github.com/rohanrhu/gdb-frontend.git&amp;gt; gdb-frontend
&lt;span class=&#34;hljs-built_in&#34;&gt;cd&lt;/span&gt; gdb-frontend
./gdbfrontend&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xC2DD; github&amp;#xC5D0; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD130;&amp;#xBBF8;&amp;#xB110; &amp;#xD0A4;&amp;#xC2DC;&amp;#xACE0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;GDB 8.2 &amp;#xC774;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;python3&lt;/li&gt;
&lt;li&gt;tmux&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;gdb-frontend&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC694;&amp;#xAD6C;&amp;#xC0AC;&amp;#xD56D;&amp;#xC740; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC740; Ubuntu 20.04&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; tmux&amp;#xB9CC; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305;&amp;#xC740; &amp;#xB05D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gdb-frontend&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A8; &amp;#xD6C4; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C; &lt;a href=&#34;http://127.0.0.1:5551/terminal/&#34;&gt;&lt;code&gt;http://127.0.0.1:5551/terminal/&lt;/code&gt;&lt;/a&gt;&amp;#xC5D0;  &amp;#xC811;&amp;#xC18D;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;-w&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; working directory&amp;#xB3C4; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4;-&amp;#xD3ED;&amp;#xC2A4;&amp;#xB294;-&amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#&amp;#xD30C;&amp;#xC774;&amp;#xC5B4;-&amp;#xD3ED;&amp;#xC2A4;&amp;#xB294;-&amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xD3ED;&amp;#xC2A4;&amp;#xB294; &amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xD3ED;&amp;#xC2A4;&amp;#xB294; &amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC774;&amp;#xC5B4;&amp;#xD3ED;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. gdb-frontend server&amp;#xC640;&amp;#xC758; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xB04A;&amp;#xAE30;&amp;#xAE38;&amp;#xB798; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xCC3E;&amp;#xB290;&amp;#xB77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xB97C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xC8FC; &amp;#xC560;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; gdb &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; pwndbg&amp;#xC640;&amp;#xC758; &amp;#xCDA9;&amp;#xB3CC;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; pwndbg&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBCF4;&amp;#xACE0;, &amp;#xC544;&amp;#xC608; VM&amp;#xC744; &amp;#xC0C8;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xD574;&amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACB0;&amp;#xAD6D; &amp;#xD30C;&amp;#xD3ED;&amp;#xACFC;&amp;#xC758; &amp;#xD638;&amp;#xD658; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/rohanrhu/gdb-frontend/issues/5&#34;&gt;tmux.conf invalid settings problem &amp;#xB7; Issue #5 &amp;#xB7; rohanrhu/gdb-frontend&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/5.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;gui-&amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#gui-&amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;gui &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;/a&gt;gui &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ ./gdbfrontend -w /home/fabu1ous/Desktop/
GDBFrontend v0.3.0-git
Listening on 127.0.0.1: &amp;lt;http://127.0.0.1:5551/&amp;gt;
Open this address &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; web browser: &amp;lt;http://127.0.0.1:5551/terminal/&amp;gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C; &amp;#xC811;&amp;#xC18D;&amp;#xD55C; &lt;a href=&#34;http://127.0.0.1:5551/terminal/&#34;&gt;&lt;code&gt;http://127.0.0.1:5551/terminal/&lt;/code&gt;&lt;/a&gt;&amp;#xC758; &amp;#xD654;&amp;#xBA74;&amp;#xC740; gdb shell&amp;#xC774; &amp;#xB744;&amp;#xC6CC;&amp;#xC9C4; terminal&amp;#xACFC; gui &amp;#xBD80;&amp;#xBD84;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. terminal &amp;#xBD80;&amp;#xBD84;&amp;#xC740; gdb&amp;#xC640; &amp;#xB2E4;&amp;#xB97C; &amp;#xAC8C; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0;, gui&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xAE30;&amp;#xB2A5; &amp;#xC911; &amp;#xC81C;&amp;#xAC00; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC88B;&amp;#xB2E4;&amp;#xACE0; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[ ! ] &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC368;&amp;#xBCF8; &amp;#xC801;&amp;#xC774; &amp;#xB2E8; &amp;#xD55C; &amp;#xBC88;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC720;&amp;#xC758;&amp;#xD558;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xBCC4;&amp;#xB85C; assembly &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC740; &amp;#xC5F0;&amp;#xD55C; &amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC774;&amp;#xB77C;&amp;#xC774;&amp;#xD2B8; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; Call Stack 0&amp;#xBC88;&amp;#xC5D0; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xB77C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; eip (&amp;#xD639;&amp;#xC740; rip)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xB300;&amp;#xB2E8;&amp;#xD788; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE00;&amp;#xC7AC;&amp;#xC8FC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C;&amp;#xBC16;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xBABB; &amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;break point&amp;#xB294; instruction&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131; &amp;#xD639;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC88C;&amp;#xCE21;&amp;#xC5D0; break point&amp;#xB4E4;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA70; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xB85C; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; pwndbg&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xB358; &amp;#xC810;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; break point &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xBC88;&amp;#xAC70;&amp;#xB86D;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;, gdb-frontend&amp;#xB294; GUI&amp;#xB85C; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB2C8; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC880; &amp;#xB354; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC4F8;-&amp;#xAC00;&amp;#xCE58;&amp;#xAC00;-&amp;#xC788;&amp;#xB294;&amp;#xAC00;&#34;&gt;&lt;a href=&#34;#&amp;#xC4F8;-&amp;#xAC00;&amp;#xCE58;&amp;#xAC00;-&amp;#xC788;&amp;#xB294;&amp;#xAC00;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC4F8; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xAC00;?&#34;&gt;&lt;/a&gt;&amp;#xC4F8; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xAC00;?&lt;/h1&gt;&lt;p&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C; &amp;#xC124;&amp;#xBA85;&amp;#xD560;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC9C4; &amp;#xC54A;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; gdb&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xADF8;&amp;#xB0E5; gdb&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC740; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. gdb&amp;#xB97C; &amp;#xC368;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; gdb&amp;#xB9CC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xD0DC;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9; &amp;#xC52C;&amp;#xC5D0;&amp;#xB294; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xC57C;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB098; register&amp;#xAC12;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xBA70; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; instruction &amp;#xD558;&amp;#xB098; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;info reg&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;&amp;#x2026; &amp;#xC5B4;&amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xC810;&amp;#xC744; gdb-frontend&amp;#xAC00; &amp;#xAC1C;&amp;#xC120;&amp;#xD574;&amp;#xC8FC;&amp;#xC9C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. UI&amp;#xAC00; &amp;#xC774;&amp;#xC058;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC548;&amp;#xB3FC; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#x2018;&amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xB2E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C; &amp;#xC4F0;&amp;#xB294; &amp;#xB9D0; &amp;#xC774;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC815;&amp;#xC791; Disassembly&amp;#xB294; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xB450; &amp;#xBC88;&amp;#xC774;&amp;#xB098; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch &amp;#x66F0; : &amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&amp;#xB124; &amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gdb-frontend&amp;#xB85C; CTF&amp;#xBB38;&amp;#xC81C; &amp;#xD558;&amp;#xB098; &amp;#xD480;&amp;#xACE0;, &amp;#xC5F0;&amp;#xAD6C; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC7A5;&amp;#xD55C; write-up&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB3C4;&amp;#xC800;&amp;#xD788; gdb-frontend&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480; &amp;#xC21C; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC77C;&amp;#xB9D0;&amp;#xC758; &amp;#xD76C;&amp;#xB9DD;&amp;#xC744; &amp;#xAC16;&amp;#xACE0; pwndbg&amp;#xC640; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;, gdb-frontend&amp;#xB294; &amp;#xC8FC;&amp;#xAC1D;&amp;#xC804;&amp;#xB3C4;&amp;#xB97C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. gdb-frontend&amp;#xC758; ui&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; terminal&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xD0A4;&amp;#xC6CC;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;,&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; gdb-frontend&amp;#xAC00; &amp;#xBED7;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC81C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; crash &amp;#xB098;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC740; 2&amp;#xAC00;&amp;#xC9C0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; segmentation fault&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xB54C;&lt;/li&gt;
&lt;li&gt;&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; attach &amp;#xD560; &amp;#xB54C;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC5D0;&amp;#xAC90; &amp;#xC774; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0C1;&amp;#xD669; &amp;#xBAA8;&amp;#xB450; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xB2E8;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. python exploit &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; gdb&amp;#xB97C; attach &amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC8FC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC29;&amp;#xBC95;&amp;#xC778;&amp;#xB370;, &amp;#xADF8;&amp;#xAC8C; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xB2C8;&amp;#xC694;&amp;#x2026; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; segmentation fault&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC120; &amp;#xD654;&amp;#xB531;&amp;#xC9C0;&amp;#xAC00; &amp;#xC548; &amp;#xB0A0; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;gdb&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; gui&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;? &lt;strong&gt;No&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791;&amp;#xC740; gdb terminal&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D0;.&lt;/li&gt;
&lt;li&gt;gui&amp;#xB85C; gdb&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, gdb&amp;#xC758; &amp;#xACB0;&amp;#xAD0F;&amp;#xAC12;&amp;#xC744; gui&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;chrome&amp;#xC73C;&amp;#xB85C; gdb&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB77C; &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xBD88;&amp;#xD3B8;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;pwnable&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;? &lt;strong&gt;No&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] gdb-frontend 포너블에 적합한가? - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;5&amp;#xAC1C;&amp;#xC6D4;-&amp;#xBB35;&amp;#xD78C;-&amp;#xB9C1;&amp;#xD06C;&#34;&gt;&lt;a href=&#34;#5&amp;#xAC1C;&amp;#xC6D4;-&amp;#xBB35;&amp;#xD78C;-&amp;#xB9C1;&amp;#xD06C;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xAC1C;&amp;#xC6D4; &amp;#xBB35;&amp;#xD78C; &amp;#xB9C1;&amp;#xD06C;&#34;&gt;&lt;/a&gt;5&amp;#xAC1C;&amp;#xC6D4; &amp;#xBB35;&amp;#xD78C; &amp;#xB9C1;&amp;#xD06C;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xB2EC; &amp;#xC804; Fandu&amp;#xD615;&amp;#xB2D8;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xC54C;&amp;#xB824;&amp;#xB2EC;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB358;&amp;#xC838;&amp;#xC8FC;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD560; &amp;#xC77C;&amp;#xB3C4; &amp;#xBB35;&amp;#xD600;&amp;#xB46C;&amp;#xC57C; &amp;#xC81C;&amp;#xB9DB;! 5&amp;#xB2EC; &amp;#xB3D9;&amp;#xC548; &amp;#xACE0;&amp;#xC774; &amp;#xBAA8;&amp;#xC154;&amp;#xB193;&amp;#xC740; GDBFrontend, &amp;#xB625;&amp;#xC778;&amp;#xC9C0; &amp;#xB41C;&amp;#xC7A5;&amp;#xC778;&amp;#xC9C0; &amp;#xCC0D;&amp;#xC5B4; &amp;#xBA39;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC124;&amp;#xCE58;-&amp;#xBC0F;-&amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;a href=&#34;#&amp;#xC124;&amp;#xCE58;-&amp;#xBC0F;-&amp;#xC2E4;&amp;#xD589;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC124;&amp;#xCE58; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&#34;&gt;&lt;/a&gt;&amp;#xC124;&amp;#xCE58; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/rohanrhu/gdb-frontend&#34;&gt;rohanrhu/gdb-frontend&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; &amp;lt;https://github.com/rohanrhu/gdb-frontend.git&amp;gt; gdb-frontend
&lt;span class=&#34;hljs-built_in&#34;&gt;cd&lt;/span&gt; gdb-frontend
./gdbfrontend&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xC2DD; github&amp;#xC5D0; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD130;&amp;#xBBF8;&amp;#xB110; &amp;#xD0A4;&amp;#xC2DC;&amp;#xACE0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;GDB 8.2 &amp;#xC774;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;python3&lt;/li&gt;
&lt;li&gt;tmux&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;gdb-frontend&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC694;&amp;#xAD6C;&amp;#xC0AC;&amp;#xD56D;&amp;#xC740; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC740; Ubuntu 20.04&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; tmux&amp;#xB9CC; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305;&amp;#xC740; &amp;#xB05D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gdb-frontend&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A8; &amp;#xD6C4; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C; &lt;a href=&#34;http://127.0.0.1:5551/terminal/&#34;&gt;&lt;code&gt;http://127.0.0.1:5551/terminal/&lt;/code&gt;&lt;/a&gt;&amp;#xC5D0;  &amp;#xC811;&amp;#xC18D;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;-w&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; working directory&amp;#xB3C4; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4;-&amp;#xD3ED;&amp;#xC2A4;&amp;#xB294;-&amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#&amp;#xD30C;&amp;#xC774;&amp;#xC5B4;-&amp;#xD3ED;&amp;#xC2A4;&amp;#xB294;-&amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xD3ED;&amp;#xC2A4;&amp;#xB294; &amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xD3ED;&amp;#xC2A4;&amp;#xB294; &amp;#xB098;&amp;#xAC00;&amp;#xC788;&amp;#xC5B4;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC774;&amp;#xC5B4;&amp;#xD3ED;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. gdb-frontend server&amp;#xC640;&amp;#xC758; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xACC4;&amp;#xC18D; &amp;#xB04A;&amp;#xAE30;&amp;#xAE38;&amp;#xB798; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xCC3E;&amp;#xB290;&amp;#xB77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xB97C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xC8FC; &amp;#xC560;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; gdb &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; pwndbg&amp;#xC640;&amp;#xC758; &amp;#xCDA9;&amp;#xB3CC;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; pwndbg&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBCF4;&amp;#xACE0;, &amp;#xC544;&amp;#xC608; VM&amp;#xC744; &amp;#xC0C8;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xD574;&amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACB0;&amp;#xAD6D; &amp;#xD30C;&amp;#xD3ED;&amp;#xACFC;&amp;#xC758; &amp;#xD638;&amp;#xD658; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/rohanrhu/gdb-frontend/issues/5&#34;&gt;tmux.conf invalid settings problem &amp;#xB7; Issue #5 &amp;#xB7; rohanrhu/gdb-frontend&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/5.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;gui-&amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#gui-&amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;gui &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;/a&gt;gui &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xAE30;&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ ./gdbfrontend -w /home/fabu1ous/Desktop/
GDBFrontend v0.3.0-git
Listening on 127.0.0.1: &amp;lt;http://127.0.0.1:5551/&amp;gt;
Open this address &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; web browser: &amp;lt;http://127.0.0.1:5551/terminal/&amp;gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C; &amp;#xC811;&amp;#xC18D;&amp;#xD55C; &lt;a href=&#34;http://127.0.0.1:5551/terminal/&#34;&gt;&lt;code&gt;http://127.0.0.1:5551/terminal/&lt;/code&gt;&lt;/a&gt;&amp;#xC758; &amp;#xD654;&amp;#xBA74;&amp;#xC740; gdb shell&amp;#xC774; &amp;#xB744;&amp;#xC6CC;&amp;#xC9C4; terminal&amp;#xACFC; gui &amp;#xBD80;&amp;#xBD84;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. terminal &amp;#xBD80;&amp;#xBD84;&amp;#xC740; gdb&amp;#xC640; &amp;#xB2E4;&amp;#xB97C; &amp;#xAC8C; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0;, gui&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xAE30;&amp;#xB2A5; &amp;#xC911; &amp;#xC81C;&amp;#xAC00; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC88B;&amp;#xB2E4;&amp;#xACE0; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[ ! ] &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC368;&amp;#xBCF8; &amp;#xC801;&amp;#xC774; &amp;#xB2E8; &amp;#xD55C; &amp;#xBC88;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC720;&amp;#xC758;&amp;#xD558;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xBCC4;&amp;#xB85C; assembly &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC740; &amp;#xC5F0;&amp;#xD55C; &amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC774;&amp;#xB77C;&amp;#xC774;&amp;#xD2B8; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; Call Stack 0&amp;#xBC88;&amp;#xC5D0; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xB77C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; eip (&amp;#xD639;&amp;#xC740; rip)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xB300;&amp;#xB2E8;&amp;#xD788; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE00;&amp;#xC7AC;&amp;#xC8FC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C;&amp;#xBC16;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xBABB; &amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;break point&amp;#xB294; instruction&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131; &amp;#xD639;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC88C;&amp;#xCE21;&amp;#xC5D0; break point&amp;#xB4E4;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xBA70; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xB85C; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; pwndbg&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xB358; &amp;#xC810;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; break point &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xBC88;&amp;#xAC70;&amp;#xB86D;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;, gdb-frontend&amp;#xB294; GUI&amp;#xB85C; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB2C8; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC880; &amp;#xB354; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC4F8;-&amp;#xAC00;&amp;#xCE58;&amp;#xAC00;-&amp;#xC788;&amp;#xB294;&amp;#xAC00;&#34;&gt;&lt;a href=&#34;#&amp;#xC4F8;-&amp;#xAC00;&amp;#xCE58;&amp;#xAC00;-&amp;#xC788;&amp;#xB294;&amp;#xAC00;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC4F8; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xAC00;?&#34;&gt;&lt;/a&gt;&amp;#xC4F8; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xAC00;?&lt;/h1&gt;&lt;p&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB0B4;&amp;#xC138;&amp;#xC6B0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C; &amp;#xC124;&amp;#xBA85;&amp;#xD560;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC9C4; &amp;#xC54A;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; gdb&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xADF8;&amp;#xB0E5; gdb&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB974;&amp;#xB2E4;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC740; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. gdb&amp;#xB97C; &amp;#xC368;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; gdb&amp;#xB9CC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xD0DC;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9; &amp;#xC52C;&amp;#xC5D0;&amp;#xB294; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xC57C;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB098; register&amp;#xAC12;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xBA70; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; instruction &amp;#xD558;&amp;#xB098; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;info reg&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;&amp;#x2026; &amp;#xC5B4;&amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xC810;&amp;#xC744; gdb-frontend&amp;#xAC00; &amp;#xAC1C;&amp;#xC120;&amp;#xD574;&amp;#xC8FC;&amp;#xC9C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. UI&amp;#xAC00; &amp;#xC774;&amp;#xC058;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC548;&amp;#xB3FC; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#x2018;&amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xB2E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C; &amp;#xC4F0;&amp;#xB294; &amp;#xB9D0; &amp;#xC774;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC815;&amp;#xC791; Disassembly&amp;#xB294; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xB450; &amp;#xBC88;&amp;#xC774;&amp;#xB098; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch &amp;#x66F0; : &amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&amp;#xB124; &amp;#xC774;&amp;#xC05C; &amp;#xC4F0;&amp;#xB808;&amp;#xAE30;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;gdb-frontend&amp;#xB85C; CTF&amp;#xBB38;&amp;#xC81C; &amp;#xD558;&amp;#xB098; &amp;#xD480;&amp;#xACE0;, &amp;#xC5F0;&amp;#xAD6C; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC7A5;&amp;#xD55C; write-up&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB3C4;&amp;#xC800;&amp;#xD788; gdb-frontend&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480; &amp;#xC21C; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC77C;&amp;#xB9D0;&amp;#xC758; &amp;#xD76C;&amp;#xB9DD;&amp;#xC744; &amp;#xAC16;&amp;#xACE0; pwndbg&amp;#xC640; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;, gdb-frontend&amp;#xB294; &amp;#xC8FC;&amp;#xAC1D;&amp;#xC804;&amp;#xB3C4;&amp;#xB97C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. gdb-frontend&amp;#xC758; ui&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; terminal&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xD0A4;&amp;#xC6CC;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;,&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/11/08/fabu1ous/gdb-frontend-review/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; gdb-frontend&amp;#xAC00; &amp;#xBED7;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC81C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; crash &amp;#xB098;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC740; 2&amp;#xAC00;&amp;#xC9C0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; segmentation fault&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xB54C;&lt;/li&gt;
&lt;li&gt;&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; attach &amp;#xD560; &amp;#xB54C;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC5D0;&amp;#xAC90; &amp;#xC774; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0C1;&amp;#xD669; &amp;#xBAA8;&amp;#xB450; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xB2E8;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. python exploit &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; gdb&amp;#xB97C; attach &amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC8FC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC29;&amp;#xBC95;&amp;#xC778;&amp;#xB370;, &amp;#xADF8;&amp;#xAC8C; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xB2C8;&amp;#xC694;&amp;#x2026; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; segmentation fault&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC120; &amp;#xD654;&amp;#xB531;&amp;#xC9C0;&amp;#xAC00; &amp;#xC548; &amp;#xB0A0; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;gdb&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; gui&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;? &lt;strong&gt;No&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791;&amp;#xC740; gdb terminal&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D0;.&lt;/li&gt;
&lt;li&gt;gui&amp;#xB85C; gdb&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, gdb&amp;#xC758; &amp;#xACB0;&amp;#xAD0F;&amp;#xAC12;&amp;#xC744; gui&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;chrome&amp;#xC73C;&amp;#xB85C; gdb&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB77C; &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xBD88;&amp;#xD3B8;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;pwnable&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;? &lt;strong&gt;No&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2020/11/08/fabu1ous/gdb-frontend-review/4.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2020/11/08/fabu1ous/gdb-frontend-review/">

  <title>[Research] gdb-frontend 포너블에 적합한가? - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2020-11-08 15:00" pubdate>
      2020년 11월 8일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.4k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      28
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] gdb-frontend 포너블에 적합한가?</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="5&#xAC1C;&#xC6D4;-&#xBB35;&#xD78C;-&#xB9C1;&#xD06C;"><a href="#5&#xAC1C;&#xC6D4;-&#xBB35;&#xD78C;-&#xB9C1;&#xD06C;" class="headerlink" title="5&#xAC1C;&#xC6D4; &#xBB35;&#xD78C; &#xB9C1;&#xD06C;"></a>5&#xAC1C;&#xC6D4; &#xBB35;&#xD78C; &#xB9C1;&#xD06C;</h1><p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/1.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/2.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA87; &#xB2EC; &#xC804; Fandu&#xD615;&#xB2D8;&#xC774; &#xC9C1;&#xC811; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xACE0; &#xD6C4;&#xAE30;&#xB97C; &#xC54C;&#xB824;&#xB2EC;&#xB77C;&#xB294; &#xB9D0;&#xACFC; &#xD568;&#xAED8; &#xB9C1;&#xD06C;&#xB97C; &#xD558;&#xB098; &#xB358;&#xC838;&#xC8FC;&#xC168;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD560; &#xC77C;&#xB3C4; &#xBB35;&#xD600;&#xB46C;&#xC57C; &#xC81C;&#xB9DB;! 5&#xB2EC; &#xB3D9;&#xC548; &#xACE0;&#xC774; &#xBAA8;&#xC154;&#xB193;&#xC740; GDBFrontend, &#xB625;&#xC778;&#xC9C0; &#xB41C;&#xC7A5;&#xC778;&#xC9C0; &#xCC0D;&#xC5B4; &#xBA39;&#xC5B4; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="&#xC124;&#xCE58;-&#xBC0F;-&#xC2E4;&#xD589;"><a href="#&#xC124;&#xCE58;-&#xBC0F;-&#xC2E4;&#xD589;" class="headerlink" title="&#xC124;&#xCE58; &#xBC0F; &#xC2E4;&#xD589;"></a>&#xC124;&#xCE58; &#xBC0F; &#xC2E4;&#xD589;</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/rohanrhu/gdb-frontend">rohanrhu/gdb-frontend</a></p>
<pre><code class="hljs bash">git <span class="hljs-built_in">clone</span> &lt;https://github.com/rohanrhu/gdb-frontend.git&gt; gdb-frontend
<span class="hljs-built_in">cd</span> gdb-frontend
./gdbfrontend</code></pre>
<p>&#xACF5;&#xC2DD; github&#xC5D0; &#xB098;&#xC640; &#xC788;&#xB294; &#xC124;&#xCE58; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xD130;&#xBBF8;&#xB110; &#xD0A4;&#xC2DC;&#xACE0; &#xADF8;&#xB300;&#xB85C; &#xC785;&#xB825;&#xD558;&#xC2DC;&#xBA74; &#xB418;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>GDB 8.2 &#xC774;&#xC0C1;</li>
<li>python3</li>
<li>tmux</li>
</ol>
<p>gdb-frontend&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC740; 3&#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xB294;&#xB370;, &#xC9C0;&#xAE08; &#xC800;&#xC758; &#xD658;&#xACBD;&#xC740; Ubuntu 20.04&#xC774;&#xBBC0;&#xB85C; tmux&#xB9CC; &#xCD94;&#xAC00;&#xB85C; &#xC124;&#xCE58;&#xD574;&#xC8FC;&#xBA74; &#xD658;&#xACBD; &#xC138;&#xD305;&#xC740; &#xB05D;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/3.png" srcset="/img/loading.gif" alt></p>
<p>gdb-frontend&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0A8; &#xD6C4; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C; <a target="_blank" rel="external nofollow noopener noreferrer" href="http://127.0.0.1:5551/terminal/"><code>http://127.0.0.1:5551/terminal/</code></a>&#xC5D0;  &#xC811;&#xC18D;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. <code>-w</code> &#xC635;&#xC158;&#xC73C;&#xB85C; working directory&#xB3C4; &#xC124;&#xC815;&#xD574; &#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xD30C;&#xC774;&#xC5B4;-&#xD3ED;&#xC2A4;&#xB294;-&#xB098;&#xAC00;&#xC788;&#xC5B4;"><a href="#&#xD30C;&#xC774;&#xC5B4;-&#xD3ED;&#xC2A4;&#xB294;-&#xB098;&#xAC00;&#xC788;&#xC5B4;" class="headerlink" title="&#xD30C;&#xC774;&#xC5B4; &#xD3ED;&#xC2A4;&#xB294; &#xB098;&#xAC00;&#xC788;&#xC5B4;"></a>&#xD30C;&#xC774;&#xC5B4; &#xD3ED;&#xC2A4;&#xB294; &#xB098;&#xAC00;&#xC788;&#xC5B4;</h1><p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xB9CC;&#xC57D; &#xD30C;&#xC774;&#xC5B4;&#xD3ED;&#xC2A4;&#xB97C; &#xC4F0;&#xACE0; &#xACC4;&#xC2E0;&#xB2E4;&#xBA74; &#xB2E4;&#xB978; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC154;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. gdb-frontend server&#xC640;&#xC758; &#xC5F0;&#xACB0;&#xC774; &#xACC4;&#xC18D; &#xB04A;&#xAE30;&#xAE38;&#xB798; &#xC6D0;&#xC778;&#xC744; &#xCC3E;&#xB290;&#xB77C; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44;&#xB97C; &#xC880; &#xB9CE;&#xC774; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC790;&#xC8FC; &#xC560;&#xC6A9;&#xD558;&#xB294; gdb &#xD50C;&#xB7EC;&#xADF8;&#xC778; pwndbg&#xC640;&#xC758; &#xCDA9;&#xB3CC;&#xC774; &#xBB38;&#xC81C;&#xB77C; &#xC0DD;&#xAC01;&#xD574; pwndbg&#xB3C4; &#xC9C0;&#xC6CC;&#xBCF4;&#xACE0;, &#xC544;&#xC608; VM&#xC744; &#xC0C8;&#xB85C; &#xC0DD;&#xC131;&#xD574; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xD658;&#xACBD; &#xAD6C;&#xCD95;&#xD574;&#xBD24;&#xC9C0;&#xB9CC; &#xACB0;&#xAD6D; &#xD30C;&#xD3ED;&#xACFC;&#xC758; &#xD638;&#xD658; &#xBB38;&#xC81C;&#xC600;&#xB124;&#xC694;&#x2026;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/rohanrhu/gdb-frontend/issues/5">tmux.conf invalid settings problem &#xB7; Issue #5 &#xB7; rohanrhu/gdb-frontend</a></p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/5.png" srcset="/img/loading.gif" alt></p>
<h1 id="gui-&#xD6D1;&#xC5B4;&#xBCF4;&#xAE30;"><a href="#gui-&#xD6D1;&#xC5B4;&#xBCF4;&#xAE30;" class="headerlink" title="gui &#xD6D1;&#xC5B4;&#xBCF4;&#xAE30;"></a>gui &#xD6D1;&#xC5B4;&#xBCF4;&#xAE30;</h1><pre><code class="hljs bash">$ ./gdbfrontend -w /home/fabu1ous/Desktop/
GDBFrontend v0.3.0-git
Listening on 127.0.0.1: &lt;http://127.0.0.1:5551/&gt;
Open this address <span class="hljs-keyword">in</span> web browser: &lt;http://127.0.0.1:5551/terminal/&gt;</code></pre>
<p>&#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C; &#xC811;&#xC18D;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="http://127.0.0.1:5551/terminal/"><code>http://127.0.0.1:5551/terminal/</code></a>&#xC758; &#xD654;&#xBA74;&#xC740; gdb shell&#xC774; &#xB744;&#xC6CC;&#xC9C4; terminal&#xACFC; gui &#xBD80;&#xBD84;&#xC73C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. terminal &#xBD80;&#xBD84;&#xC740; gdb&#xC640; &#xB2E4;&#xB97C; &#xAC8C; &#xC5C6;&#xC73C;&#xB2C8; &#xB118;&#xC5B4;&#xAC00;&#xACE0;, gui&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xAD6C;&#xC131;&#xACFC; &#xAE30;&#xB2A5; &#xC911; &#xC81C;&#xAC00; &#xC368;&#xBCF4;&#xBA74;&#xC11C; &#xC88B;&#xB2E4;&#xACE0; &#xB290;&#xB080; &#xC810;&#xB4E4;&#xC744; &#xC368;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>[ ! ] &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xC368;&#xBCF8; &#xC801;&#xC774; &#xB2E8; &#xD55C; &#xBC88;&#xB3C4; &#xC5C6;&#xC73C;&#xB2C8; &#xC720;&#xC758;&#xD558;&#xC138;&#xC694;.</p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xD568;&#xC218; &#xBCC4;&#xB85C; assembly &#xCF54;&#xB4DC;&#xB85C; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xBA70; &#xB2E4;&#xC74C;&#xC5D0; &#xC2E4;&#xD589;&#xB420; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC740; &#xC5F0;&#xD55C; &#xC0C9;&#xC73C;&#xB85C; &#xD558;&#xC774;&#xB77C;&#xC774;&#xD2B8; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911;&#xC5D0;&#xC11C;&#xB3C4; Call Stack 0&#xBC88;&#xC5D0; &#xB098;&#xD0C0;&#xB098;&#xB294; &#xD568;&#xC218;&#xC758; &#xD558;&#xC774;&#xB77C;&#xC774;&#xD2B8; &#xB41C; &#xBD80;&#xBD84;&#xC740; eip (&#xD639;&#xC740; rip)&#xC785;&#xB2C8;&#xB2E4;. &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD750;&#xB984;&#xC758; &#xC704;&#xCE58;&#xB97C; &#xB300;&#xB2E8;&#xD788; &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAE00;&#xC7AC;&#xC8FC;&#xAC00; &#xC5C6;&#xC5B4;&#xC11C; &#xC774;&#xB807;&#xAC8C;&#xBC16;&#xC5D0; &#xC124;&#xBA85;&#xC744; &#xBABB; &#xD558;&#xACA0;&#xB124;&#xC694;. &#x314E;&#x314E;</p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/7.png" srcset="/img/loading.gif" alt></p>
<p>break point&#xB294; instruction&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xD074;&#xB9AD;&#xD574;&#xC11C; &#xC0DD;&#xC131; &#xD639;&#xC740; &#xC0AD;&#xC81C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC88C;&#xCE21;&#xC5D0; break point&#xB4E4;&#xC758; &#xBAA9;&#xB85D;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xBA70; &#xCCB4;&#xD06C;&#xBC15;&#xC2A4;&#xB85C; &#xD65C;&#xC131;&#xD654; &#xC5EC;&#xBD80;&#xB97C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAE30;&#xC874;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB358; pwndbg&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC544;&#xC26C;&#xC6E0;&#xB358; &#xC810;&#xC774; &#xBC14;&#xB85C; break point &#xAD00;&#xB9AC;&#xAC00; &#xBC88;&#xAC70;&#xB86D;&#xB2E4;&#xB294; &#xAC83;&#xC778;&#xB370;, gdb-frontend&#xB294; GUI&#xB85C; &#xC774; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB2C8; &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xC880; &#xB354; &#xD3B8;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xC4F8;-&#xAC00;&#xCE58;&#xAC00;-&#xC788;&#xB294;&#xAC00;"><a href="#&#xC4F8;-&#xAC00;&#xCE58;&#xAC00;-&#xC788;&#xB294;&#xAC00;" class="headerlink" title="&#xC4F8; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB294;&#xAC00;?"></a>&#xC4F8; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB294;&#xAC00;?</h1><p>&#xD655;&#xC7A5;&#xC131;&#xC774; &#xC88B;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xB0B4;&#xC138;&#xC6B0;&#xACE0; &#xC788;&#xB294; &#xB9CC;&#xD07C; &#xC124;&#xBA85;&#xD560;&#xAC8C; &#xB9CE;&#xC9C4; &#xC54A;&#xB124;&#xC694;.</p>
<p>&#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xAC83;&#xB4E4;&#xC744; &#xC81C;&#xC678;&#xD558;&#xBA74; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xAE30;&#xB2A5;&#xC744; gdb&#xC5D0; &#xC758;&#xC874;&#xD558;&#xACE0; &#xC788;&#xACE0;, &#xADF8;&#xB0E5; gdb&#xB9CC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xD06C;&#xAC8C; &#xB2E4;&#xB974;&#xB2E4;&#xB294; &#xB290;&#xB08C;&#xC740; &#xBC1B;&#xC9C0; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. gdb&#xB97C; &#xC368;&#xBCF4;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xC544;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC; gdb&#xB9CC;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xBCC0;&#xD0DC;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC801;&#xC5B4;&#xB3C4; &#xD574;&#xD0B9; &#xC52C;&#xC5D0;&#xB294; &#xC5C6;&#xC744; &#xAC70;&#xC57C;. &#xBA54;&#xBAA8;&#xB9AC;&#xB098; register&#xAC12;&#xC758; &#xBCC0;&#xD654;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xBA70; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xC800;&#xC5D0;&#xAC8C; instruction &#xD558;&#xB098; &#xC2E4;&#xD589;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; <code>info reg</code> &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC785;&#xB825;&#xD558;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;&#xBA74;&#x2026; &#xC5B4;&#xD6C4;&#x2026;</p>
<p>&#xADF8;&#xB7F0; &#xC810;&#xC744; gdb-frontend&#xAC00; &#xAC1C;&#xC120;&#xD574;&#xC8FC;&#xC9C4; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. UI&#xAC00; &#xC774;&#xC058;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xC800;&#xC5D0;&#xAC8C; &#xD544;&#xC694;&#xD55C; &#xBD80;&#xBD84;&#xC740; &#xAD6C;&#xD604;&#xC774; &#xC548;&#xB3FC; &#xC788;&#xC73C;&#xB2C8; &#x2018;&#xC774;&#xC05C; &#xC4F0;&#xB808;&#xAE30;&#x2019;&#xB77C;&#xB294; &#xB2E8;&#xC5B4;&#xB294; &#xC774;&#xB7F4; &#xB54C; &#xC4F0;&#xB294; &#xB9D0; &#xC774;&#xACA0;&#xC8E0;. &#xC815;&#xC791; Disassembly&#xB294; &#xD654;&#xBA74;&#xC5D0; &#xB450; &#xBC88;&#xC774;&#xB098; &#xCD9C;&#xB825;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#x314E;&#x314E;</p>
<blockquote>
<p>L0ch &#x66F0; : &#xC774;&#xC05C; &#xC4F0;&#xB808;&#xAE30;&#xB124; &#xC774;&#xC05C; &#xC4F0;&#xB808;&#xAE30;</p>
</blockquote>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/8.png" srcset="/img/loading.gif" alt></p>
<p>gdb-frontend&#xB85C; CTF&#xBB38;&#xC81C; &#xD558;&#xB098; &#xD480;&#xACE0;, &#xC5F0;&#xAD6C; &#xAE00;&#xC744; &#xAC00;&#xC7A5;&#xD55C; write-up&#xC744; &#xC791;&#xC131;&#xD558;&#xB824; &#xD588;&#xC9C0;&#xB9CC; &#xB3C4;&#xC800;&#xD788; gdb-frontend&#xB9CC;&#xC73C;&#xB85C; &#xBB38;&#xC81C;&#xB97C; &#xD480; &#xC21C; &#xC5C6;&#xC744; &#xAC70; &#xAC19;&#xB124;&#xC694;. &#xADF8;&#xB798;&#xC11C; &#xC77C;&#xB9D0;&#xC758; &#xD76C;&#xB9DD;&#xC744; &#xAC16;&#xACE0; pwndbg&#xC640; &#xC5F0;&#xB3D9;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC;, gdb-frontend&#xB294; &#xC8FC;&#xAC1D;&#xC804;&#xB3C4;&#xB97C; &#xD5C8;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. gdb-frontend&#xC758; ui&#xAC00; &#xC5C6;&#xC5B4;&#xC9C8; &#xC815;&#xB3C4;&#xB85C; terminal&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xD0A4;&#xC6CC;&#xC57C; &#xD558;&#xACE0;,</p>
<p><img src="/2020/11/08/fabu1ous/gdb-frontend-review/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; gdb-frontend&#xAC00; &#xBED7;&#xC5B4;&#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xC81C;&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;&#xC11C; crash &#xB098;&#xB294; &#xC0C1;&#xD669;&#xC740; 2&#xAC00;&#xC9C0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; segmentation fault&#xB97C; &#xC77C;&#xC73C;&#xD0AC; &#xB54C;</li>
<li>&#xC874;&#xC7AC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; attach &#xD560; &#xB54C;</li>
</ol>
<p>&#xC800;&#xC5D0;&#xAC90; &#xC774; &#xB450; &#xAC00;&#xC9C0; &#xC0C1;&#xD669; &#xBAA8;&#xB450; &#xB9E4;&#xC6B0; &#xD070; &#xB2E8;&#xC810;&#xC785;&#xB2C8;&#xB2E4;. python exploit &#xCF54;&#xB4DC;&#xC5D0; &#xB530;&#xB77C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; gdb&#xB97C; attach &#xD574; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC8FC;&#xB41C; &#xC0AC;&#xC6A9;&#xBC29;&#xBC95;&#xC778;&#xB370;, &#xADF8;&#xAC8C; &#xC548;&#xB41C;&#xB2E4;&#xB2C8;&#xC694;&#x2026; &#xADF8;&#xB9AC;&#xACE0; segmentation fault&#xC5D0; &#xB300;&#xD55C; &#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB3C4; &#xC5BB;&#xC744; &#xC218; &#xC5C6;&#xC73C;&#xB2C8; &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC120; &#xD654;&#xB531;&#xC9C0;&#xAC00; &#xC548; &#xB0A0; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xBB34;&#xB9AC;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;"></a>&#xB9C8;&#xBB34;&#xB9AC;</h1><ol>
<li>gdb&#xC758; &#xAE30;&#xB2A5;&#xC744; gui&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;? <strong>No</strong><ul>
<li>&#xACB0;&#xAD6D; &#xBAA8;&#xB4E0; &#xB3D9;&#xC791;&#xC740; gdb terminal&#xC744; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9D0;.</li>
<li>gui&#xB85C; gdb&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C;, gdb&#xC758; &#xACB0;&#xAD0F;&#xAC12;&#xC744; gui&#xB85C; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xD50C;&#xB7EC;&#xADF8;&#xC778;</li>
<li>chrome&#xC73C;&#xB85C; gdb&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC70;&#xB77C; &#xC624;&#xD788;&#xB824; &#xBD88;&#xD3B8;&#xD568;</li>
</ul>
</li>
<li>pwnable&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;? <strong>No</strong></li>
</ol>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/gdb-frontend/">gdb-frontend</a>
                  
                  <a class="hover-with-bg" href="/tags/pwndbg/">pwndbg</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2020/11/08/fabu1ous/2020-11-08/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] Detecting Dynamic Loading in Android App</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2020/11/06/l0ch/2020-11-06/">
                    <span class="hidden-mobile">[하루한줄] CVE-2020-27955: Git-LFS RCE Exploit</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2020/11/08/fabu1ous/gdb-frontend-review/';
        this.page.identifier = '/2020/11/08/fabu1ous/gdb-frontend-review/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] gdb-frontend 포너블에 적합한가?&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
