

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758;-&amp;#xC804;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xAC74;&amp;#xC758;-&amp;#xC804;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&amp;#xB9E4;&amp;#xB144; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; &amp;#xC194;&amp;#xB85C;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD55C;(?) &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC758; &amp;#xC8FC;&amp;#xCD5C;&amp;#xB97C; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC138;&amp;#xC885;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xC548; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; SSG&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xB9E1;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB3C4; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;. Fabu1ous&amp;#xB294; &amp;#xB9E1;&amp;#xAC8C; &amp;#xB41C; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB208; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA9;&amp;#xACA9;&amp;#xD588;&amp;#xC73C;&amp;#xB098; idioth&amp;#xACFC; L0ch&amp;#xB294; &amp;#xD1B5;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??? : &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; &amp;#xB54C; &amp;#xBB50;&amp;#xD558;&amp;#xB0D0;&lt;br&gt;idioth : &amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xC694;&lt;br&gt;??? : &amp;#xC5EC;&amp;#xC790; &amp;#xCE5C;&amp;#xAD6C; &amp;#xC5C6;&amp;#xC796;&amp;#xC544;&lt;br&gt;idioth : &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;&lt;br&gt;??? : &amp;#xBB38;&amp;#xC81C;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB77C;&lt;br&gt;L0ch : &amp;#xC804; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC6A9; &amp;#x314E;&amp;#x314E;&lt;br&gt;??? : &amp;#xC54C; &amp;#xBC14; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image0.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xC548;&amp;#xD55C; &amp;#xC9C1;&amp;#xAC10;&amp;#xC740; &amp;#xC5B8;&amp;#xC81C;&amp;#xB098; &amp;#xC633;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2018;&amp;#xC6B0;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB3FC;&amp;#x2019;&amp;#xB97C; &amp;#xB4E3;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xC9C1;&amp;#xAC10;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xAD6C;&amp;#xB098;&amp;#x2026; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xC778;&amp;#xB2F9; &amp;#xB450; &amp;#xBB38;&amp;#xC81C;&amp;#xC529; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xB098;&amp;#xAC00;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xD300;&amp;#xC7A5; &amp;#xB140;&amp;#xC11D;&amp;#xC774; &amp;#xBD84;&amp;#xC57C;&amp;#xB97C; &amp;#xCC29;&amp;#xAC01;&amp;#xD574;&amp;#xC11C; &amp;#xC2E0;&amp;#xCCAD;&amp;#xC744; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAC01; 3&amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C;&amp;#x2026;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;idioth : &amp;#xC598;&amp;#xB4E4;&amp;#xC544; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC138; &amp;#xBB38;&amp;#xC81C;&amp;#xC529; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5B4; &amp;#x314E;&amp;#x314E;&lt;br&gt;L0ch, Fabu1ous : ???&lt;br&gt;idioth : &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xC2E0;&amp;#xCCAD; &amp;#xBABB;&amp;#xD568; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;&amp;#x2026;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;idioth&lt;ul&gt;
&lt;li&gt;rev : custom packer&lt;/li&gt;
&lt;li&gt;web : cve-2020-9484 tomcat rce&lt;/li&gt;
&lt;li&gt;misc : snake&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;L0ch&lt;ul&gt;
&lt;li&gt;pwn : Windows pwnable uaf&lt;/li&gt;
&lt;li&gt;pwn : Linux pwnable type confusion&lt;/li&gt;
&lt;li&gt;rev : obfuscate&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Fabu1ous&lt;ul&gt;
&lt;li&gt;pwn : angr challenge&lt;/li&gt;
&lt;li&gt;pwn : uninit stack&lt;/li&gt;
&lt;li&gt;misc : &amp;#xBBF8;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xB9CE;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xCF54;&amp;#xB85C;&amp;#xB098; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xD559;&amp;#xAE30;&amp;#xAC00; 1&amp;#xC8FC;&amp;#xC77C; &amp;#xB2F9;&amp;#xACA8;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; 11&amp;#xC6D4;&amp;#xACFC; 12&amp;#xC6D4; &amp;#xCD08;&amp;#xAC00; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xBC14;&amp;#xBE60;&amp;#xC9C8; &amp;#xC904;&amp;#xC740; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xBAB0;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD559;&amp;#xAE30;&amp;#xAC00; &amp;#xB05D;&amp;#xB09C; &amp;#xD6C4; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xB7A9;&amp;#xC2E4;&amp;#xC5D0; &amp;#xAC07;&amp;#xD600;&amp;#xC11C; &amp;#xADFC; 1&amp;#xC8FC;&amp;#xC77C;&amp;#xC744; &amp;#xBC24;&amp;#xC0C8;&amp;#xBA70; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC15;&amp;#xCC28;&amp;#xB97C; &amp;#xAC00;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C; &amp;#xC804;&amp;#xB0A0; &amp;#xADF8;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&lt;/p&gt;
&lt;h1 id=&#34;idioth&#34;&gt;&lt;a href=&#34;#idioth&#34; class=&#34;headerlink&#34; title=&#34;idioth&#34;&gt;&lt;/a&gt;idioth&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50;&amp;#x2026; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xD55C;&amp;#xB2E4; &amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; 5&amp;#xC6D4; &amp;#xC911;&amp;#xC21C;&amp;#xC5D0; &amp;#xC18C;&amp;#xC9D1; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB9C9; &amp;#xB2E4;&amp;#xC2DC; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C; &amp;#xCC38;&amp;#xC774;&amp;#xB77C;&amp;#xC11C;&amp;#x2026; &amp;#xCD9C;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; CTF&amp;#xB97C; 2&amp;#xAC1C; &amp;#xC815;&amp;#xB3C4; &amp;#xB098;&amp;#xAC14;&amp;#xB294;&amp;#xB370; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; baby-rev &amp;#xC815;&amp;#xB3C4;&amp;#xBC16;&amp;#xC5D0; &amp;#xBABB; &amp;#xD480;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB54;&amp;#xAC00; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xBC14;&amp;#xB010; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xD3EC;&amp;#xB108;&amp;#xBE14;&amp;#xC744; &amp;#xB0B4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xC5B5;&amp;#xB3C4; &amp;#xC5B4;&amp;#xB834;&amp;#xD48B;&amp;#xD558;&amp;#xACE0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; &amp;#xB298; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xAC00; &amp;#xBD24;&amp;#xB354;&amp;#xB2C8; &amp;#xC554;&amp;#xD638;&amp;#xB791; &amp;#xC811;&amp;#xBAA9;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC2DC;&amp;#xCF1C;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC554;&amp;#xD638;&amp;#xB294; &amp;#xB0B4;&amp;#xAC00; &amp;#xD560; &amp;#xC904; &amp;#xBAA8;&amp;#xB974;&amp;#xB2C8; &amp;#xD328;&amp;#xC2A4;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xBB50; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0;? &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xBCF5;&amp;#xBB34; &amp;#xC911;&amp;#xC5D0; &amp;#xD588;&amp;#xB358; Custom Packer &amp;#xC2A4;&amp;#xD130;&amp;#xB514;&amp;#xAC00; &amp;#xB5A0;&amp;#xC62C;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;! &amp;#xC774;&amp;#xAC70;&amp;#xB2E4;! &amp;#xD328;&amp;#xCEE4; &amp;#xB531; &amp;#xB300;!&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xB4E4;&amp;#xC740; &amp;#xD6C4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xB300;&amp;#xCDA9; &amp;#xC815;&amp;#xD55C; &amp;#xD6C4; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2EC;&amp;#xBD80;&amp;#xD130; &amp;#xD328;&amp;#xCEE4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xD328;&amp;#xCEE4; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740;&amp;#x2026; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC544;&amp;#xC2DC;&amp;#xC8E0;? (&amp;#x314E;&amp;#x314E;)&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;64&amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC790;&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4; &amp;#xB0B4;&amp;#xAC00; &amp;#xADF8;&amp;#xB54C; &amp;#xC2A4;&amp;#xD130;&amp;#xB514;&amp;#xD588;&amp;#xB358; &amp;#xAC74; 32&amp;#xBE44;&amp;#xD2B8;&amp;#xB124;?&lt;/li&gt;
&lt;li&gt;&amp;#xB108;&amp;#xBB34; &amp;#xC61B;&amp;#xB0A0; &amp;#xAC70;&amp;#xB124;? &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xB3C4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC84C;&amp;#xB124;?&lt;/li&gt;
&lt;li&gt;&amp;#x2026;github&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBCF4;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xBA74; &amp;#xC88B;&amp;#xC740; &amp;#xC9C0; &amp;#xBCF4;&amp;#xC790;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xD55C; &amp;#xB2EC;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC11C; &amp;#xC644;&amp;#xC131;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC5ED;&amp;#xC2DC; &amp;#xB09C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD558;&amp;#xB294; &amp;#xB0A8;&amp;#xC790;! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xBCF4;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; &amp;#xB3C4;&amp;#xB300;&amp;#xCCB4; &amp;#xC5B4;&amp;#xB514;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC544; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC5C6;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xC81C; &amp;#xACFC;&amp;#xC81C; &amp;#xD3ED;&amp;#xD48D;&amp;#xC774; &amp;#xBAB0;&amp;#xB824;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xC5B4;&amp;#xB5A1;&amp;#xD558;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; tomcat&amp;#xBD80;&amp;#xD130; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC790;&amp;#x2026; tomcat &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xAE30;&amp;#xB2A5; &amp;#xAD6C;&amp;#xD604;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAE08;&amp;#xBC29; &amp;#xD558;&amp;#xACA0;&amp;#xC9C0;? &amp;#xC6F9; &amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xB4E4;&amp;#xC774; &amp;#xB3C4;&amp;#xC640;&amp;#xC900;&amp;#xB314;&amp;#xC5B4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC751; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC70; &amp;#xC5C6;&amp;#xC5B4;~ &amp;#xC6F9; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF8;&amp;#xAC70;&amp;#xB77C;&amp;#xACE4; &amp;#xACF5;&amp;#xBD80; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; html, php&amp;#xC640; django&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF8; &amp;#xAC83;&amp;#xC774; &amp;#xC804;&amp;#xBD80;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E8; &amp;#xB545;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB529;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xD559;&amp;#xAD50;&amp;#xC5D0;&amp;#xC11C; python &amp;#xD559;&amp;#xBD80; &amp;#xC218;&amp;#xC5C5; &amp;#xC870;&amp;#xAD50;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xBB54;&amp;#xAC00; &amp;#xD560; &amp;#xC77C;&amp;#xC774; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xB9CE;&amp;#xC558;&amp;#xC8E0;(&amp;#xD551;&amp;#xACC4;&amp;#xC57C;)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC0C1; - &amp;#xD558;&amp;#xB8E8; &amp;#xD55C; &amp;#xC904; - &amp;#xC870;&amp;#xAD50; - &amp;#xACFC;&amp;#xC81C; - (&amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;) - &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC21C;&amp;#xD658;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xB3CC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC89;&amp;#xC73C;&amp;#xB85C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; 11&amp;#xC6D4; &amp;#xB9D0;&amp;#xC5D0; &amp;#xB2E4; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xC804;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824; &amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; &amp;#xC9C0;&amp;#xAE08; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC120; session &amp;#xD3F4;&amp;#xB354;&amp;#xC640; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xACFC; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8; &amp;#xB05D;&amp;#xC5D0; LFI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; path traversal &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xAC70;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC744;&amp;#xAE4C; &amp;#xB9D0;&amp;#xAE4C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &lt;code&gt;../&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAC70;&amp;#xB294; &amp;#xAC78;&amp;#xC5B4;&amp;#xB193;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744;&amp;#xAE4C;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC70; &amp;#xBCF4;&amp;#xC774;&amp;#xBA74; &amp;#xC77C;&amp;#xB2E8; &amp;#xB54C;&amp;#xB824; &amp;#xB123;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAC70;&amp;#xB294; &amp;#xAC78;&amp;#xC5B4;&amp;#xB193;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC544;.&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &lt;code&gt;gift&lt;/code&gt; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD0C4;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC6F9; &amp;#xCC98;&amp;#xC74C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC83; &amp;#xCE58;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD588;&amp;#xC73C;&amp;#xB098;&amp;#x2026; &amp;#xC800;&amp;#xC758; &amp;#xC624;&amp;#xB9CC;&amp;#xD568;&amp;#xC774;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xAE68;&amp;#xB2EC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC73C;&amp;#xC73C;&amp;#x2026; &amp;#xC800;&amp;#xB294; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC600;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x315C;&amp;#x315C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;gift&lt;/code&gt; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xB300;&amp;#xD68C;&amp;#xAC00; &amp;#xC77C;&amp;#xC8FC;&amp;#xC77C; &amp;#xB0A8;&amp;#xC558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&amp;#x2026; &amp;#xADF8;&amp;#xB0E5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC83; &amp;#xB0B4;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; crackme &amp;#xD558;&amp;#xB098; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;~ &amp;#xD558;&amp;#xACE0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xBB54;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xD5C8;&amp;#xC804;&amp;#xD574;&amp;#xC11C; &amp;#xACE0;&amp;#xBBFC;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xBB54;&amp;#xAC00; &amp;#xC5C6;&amp;#xB098;&amp;#x2026; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB531; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624; &amp;#xC774;&amp;#xC81C; &amp;#xB9E5;&amp;#xB3C4; ARM&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370; ARM &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560;&amp;#xAE4C;? &amp;#x3131;&amp;#x3131;&amp;#x3131;&amp;#x3131; arm &amp;#xC5B4;&amp;#xC148; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xB85C; &amp;#xB0B4;&amp;#xACE0;~ ida hexrays&amp;#xB97C; &amp;#xB9C9;&amp;#xC544;&amp;#xB193;&amp;#xC790;. &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xC798;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; arm&amp;#xB3C4; &amp;#xAE08;&amp;#xBC29; &amp;#xBCF4;&amp;#xC2E4; &amp;#xD14C;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; anti-hexrays&amp;#xB294; &amp;#xAE08;&amp;#xBC29; &amp;#xD478;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;ida&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE68;&amp;#xC838;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xC65C; ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;??? : &amp;#xC57C; &amp;#xADF8;&amp;#xB0E5; &amp;#xD578;&amp;#xB4DC; &amp;#xB808;&amp;#xC774;&amp;#xB85C; &amp;#xB0B4;&amp;#xC790;&lt;/p&gt;
&lt;p&gt;idioth : &amp;#x3131; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; baby &amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB0B8; &amp;#xAC70;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;-&lt;code&gt;lock&lt;/code&gt; &amp;#xB05D;-&lt;/p&gt;
&lt;p&gt;&amp;#xC544; &amp;#xC774;&amp;#xC81C; snake &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xB0A8;&amp;#xC558;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; misc &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; &amp;#xB108;&amp;#xBB34; &amp;#xBD80;&amp;#xB2F4;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xBC40; &amp;#xAC8C;&amp;#xC784; &amp;#xC7AC;&amp;#xBBF8;&amp;#xB098;&amp;#xAC8C; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&lt;del&gt;~&lt;/del&gt;&amp;#xD558;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0; &amp;#xC55E;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC808;&amp;#xB9DD;&amp;#xC758; &amp;#xAD6C;&amp;#xB801;&amp;#xD145;&amp;#xC774;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C4; &amp;#xD55C; &amp;#xB0A8;&amp;#xC790;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch : &amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB294;&amp;#xB370; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xBB34;&amp;#xC12D;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C; misc &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; reversing&amp;#xC744; &amp;#xC81C;&amp;#xAC00; &amp;#xB0B4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38;&amp;#xAC00;&amp;#xD55C; &amp;#xB300;&amp;#xD68C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC5D0;&amp;#xC11C; angr&amp;#xB85C; &amp;#xD47C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; angr &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB0B4;&amp;#xC790;. &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; arm&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xBA74; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACA0;&amp;#xB2F9;. &amp;#xD558;&amp;#xACE0; &amp;#xD6C4;&amp;#xB531; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; arm&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC65C; simulation manager&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xB3C4; &amp;#xAC12;&amp;#xC774; &amp;#xC548; &amp;#xB098;&amp;#xC624;&amp;#xC9C0;? &amp;#xADF8;&amp;#xB0E5; x64&amp;#xB85C; &amp;#xC644;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xB09C; &amp;#xD6C4; L0ch&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC40; &amp;#xAC8C;&amp;#xC784;&amp;#xC744; &amp;#xC644;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xAE30; type confusion &amp;#xBABB; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; baby pwnable &amp;#xBB50; &amp;#xB0BC; &amp;#xC9C0; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xB358;&amp;#xC838; &amp;#xC92C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. arm rop &amp;#xC7AC;&amp;#xBC0C;&amp;#xC744; &amp;#xB4EF;? &lt;code&gt;baby_RudOlPh&lt;/code&gt; &amp;#xD0C4;&amp;#xC0DD;~&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; angr &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC80;&amp;#xC218;&amp;#xD558;&amp;#xACE0; &amp;#xAC12;&amp;#xC744; &amp;#xC5F0;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xAC12;&amp;#xC774; &amp;#xBC00;&amp;#xB824;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; c++&amp;#xB85C; &amp;#xC9F0;&amp;#xC5C8;&amp;#xACE0; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC18D; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xB370; input&amp;#xC774; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAF2C;&amp;#xC5EC;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xAD6D; c&amp;#xB85C; &amp;#xC62E;&amp;#xAE30;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; c&amp;#xB85C; &amp;#xC62E;&amp;#xACA8;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC790; byte &amp;#xBA87; &amp;#xAC1C;&amp;#xAC00; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xB2F9;&amp;#xC7A5; &amp;#xB0B4;&amp;#xC77C;&amp;#xC774;&amp;#xACE0; &amp;#xAE09;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xBC94;&amp;#xC704;&amp;#xAC00; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC00; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#xD06C;&amp;#xAC8C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;angrforge&lt;/code&gt; &amp;#xD0C4;&amp;#xC0DD;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC695;&amp;#xBA39;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC190;&amp;#xC73C;&amp;#xB85C; &amp;#xD478;&amp;#xC2E0; &amp;#xBD84; &amp;#xACC4;&amp;#xC2DC;&amp;#xB358;&amp;#xB370; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC8C4;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xAE34;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &lt;em&gt;*&lt;/em&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC758;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xC870;&amp;#xCC28; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xC5EC;&amp;#xCC28;&amp;#xC800;&amp;#xCC28; &amp;#xC798; &amp;#xB05D;&amp;#xB0AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9C8;&amp;#xC74C;&amp;#xC774; &amp;#xBD88;&amp;#xD3B8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xB294; &amp;#xB098;&amp;#xB300;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;lock&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;angrforge&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0; &amp;#xCAD3;&amp;#xACA8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD070; &amp;#xACE0;&amp;#xBBFC; &amp;#xC5C6;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC774;&amp;#xB77C;&amp;#xC11C; &amp;#xB9C8;&amp;#xC74C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC81C; &amp;#xC81C;&amp;#xC791; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &lt;code&gt;gift&lt;/code&gt;&amp;#xC5D0; &amp;#xC3DF;&amp;#xC558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC6B4;&amp;#xC601;&amp;#xB3FC;&amp;#xC11C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACA0;&amp;#xB2E4;.&amp;#xB77C;&amp;#xB294; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB3C4; &amp;#xC798; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC74; &amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xC758; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xC9C0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC548; &amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xAC8C; &amp;#xB9DE;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xAC00; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xB098;&amp;#xC11C; &amp;#xC2EC;&amp;#xC57C; &amp;#xBC84;&amp;#xC2A4;&amp;#xB97C; &amp;#xD0C0;&amp;#xACE0; &amp;#xC9D1;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xC758; 40&amp;#xC2DC;&amp;#xAC04; &amp;#xB118;&amp;#xAC8C; &amp;#xAE68;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xBC84;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xB3C4; &amp;#xC548; &amp;#xC624;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#xD604;&amp;#xD0C0;&amp;#xAC00; &amp;#xC138;&amp;#xAC8C; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#x2026; &amp;#xB0B4;&amp;#xAC00; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBABB;&amp;#xD558;&amp;#xB294;&amp;#xAD6C;&amp;#xB098;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC744; &amp;#xD480;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD24;&amp;#xB358; &amp;#xB85C;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xACE0;, &amp;#xC0DD;&amp;#xAC01;&amp;#xC758; &amp;#xB113;&amp;#xC774;&amp;#xB098; &amp;#xAE4A;&amp;#xC774;&amp;#xB3C4; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC740; &amp;#xB354; &amp;#xB113;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xB294;&amp;#xAD6C;&amp;#xB098;.&lt;/p&gt;
&lt;p&gt;&amp;#xB3CC;&amp;#xC774;&amp;#xCF1C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xBD24;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB098; &amp;#xCEE8;&amp;#xC149;&amp;#xC774; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACE0; &amp;#xC2E0;&amp;#xC120;&amp;#xD55C; &amp;#xAC83;&amp;#xC5D0;&amp;#xB9CC; &amp;#xB108;&amp;#xBB34; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB098;? &amp;#xB0B4;&amp;#xAC00; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xADF8; &amp;#xC7AC;&amp;#xBBF8;&amp;#xB97C; &amp;#xC628;&amp;#xC804;&amp;#xD788; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xB9CC;&amp;#xD07C;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xB418;&amp;#xB294;&amp;#xAC00;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9D1;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C; &amp;#xC0E4;&amp;#xC6CC;&amp;#xD558;&amp;#xACE0; &amp;#xB204;&amp;#xC6E0;&amp;#xB294;&amp;#xB370; &amp;#xD574;&amp;#xAC00; &amp;#xB730; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC7A0;&amp;#xC744; &amp;#xBABB; &amp;#xC7A4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7A1;&amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &amp;#xC9C0;&amp;#xCCD0;&amp;#xC11C; &amp;#xC7A0;&amp;#xB4E4;&amp;#xACE0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB2C8; &amp;#xC0C1;&amp;#xC704;&amp;#xAD8C; &amp;#xD300;&amp;#xB4E4; &amp;#xB77C;&amp;#xC5C5;&amp;#xC774; &amp;#xAE30;&amp;#xB300;&amp;#xAC00; &amp;#xB418;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &lt;code&gt;lock&lt;/code&gt;&amp;#xC774;&amp;#xB791; &lt;code&gt;angrforge&lt;/code&gt;&amp;#xB294; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xACE0; &lt;code&gt;gift&lt;/code&gt;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD478;&amp;#xC168;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB290;&amp;#xB07C;&amp;#xC168;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xCEF8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4; &amp;#xBCF4;&amp;#xACE0; &amp;#xB098;&amp;#xC11C; &amp;#xB77C;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4; &amp;#xB72F;&amp;#xC5B4;&amp;#xACE0;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC880; &amp;#xB354; &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xACFC; &amp;#xACE0;&amp;#xBBFC;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 2021&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC744;&amp;#xC9C0; &amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xBD80;&amp;#xC871;&amp;#xD588;&amp;#xB358; &amp;#xAC83;, &amp;#xBD80;&amp;#xC871;&amp;#xD568;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC560;&amp;#xC368; &amp;#xC678;&amp;#xBA74;&amp;#xD558;&amp;#xB358; &amp;#xAC83;&amp;#xB4E4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xBA74;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB4E4; &amp;#xBBF8;&amp;#xCC9C;&amp;#xD55C;(?) &amp;#xBB38;&amp;#xC81C; &amp;#xD478;&amp;#xC2DC;&amp;#xB290;&amp;#xB77C; &amp;#xACE0;&amp;#xC0DD; &amp;#xB9CE;&amp;#xC73C;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xC990;&amp;#xAE30;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC815;&amp;#xB9D0; &amp;#xC88B;&amp;#xC558;&amp;#xC744; &amp;#xD150;&amp;#xB370;&amp;#x2026;! &amp;#xB2E4;&amp;#xB4E4; &amp;#xC0C8;&amp;#xD574; &amp;#xBCF5; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1B;&amp;#xC73C;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h1 id=&#34;L0ch&#34;&gt;&lt;a href=&#34;#L0ch&#34; class=&#34;headerlink&#34; title=&#34;L0ch&#34;&gt;&lt;/a&gt;L0ch&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! CTF &amp;#xBB38;&amp;#xC81C; &amp;#xCD9C;&amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80; CTF &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xB358; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??????? &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;???&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC9C4;&amp;#xC9DC; &amp;#xB531; &amp;#xC800; &amp;#xD45C;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xBC29;&amp;#xC758; &amp;#xC758;&amp;#xBB34;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC31;&amp;#xC9C0;&amp;#xAC00; &amp;#xB41C; &amp;#xBA38;&amp;#xB9AC;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xB358; &amp;#xC640;&amp;#xC911;&amp;#xC5D0; (&amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xAD70;&amp;#xC778;&amp;#xB4E4; &amp;#xD654;&amp;#xC774;&amp;#xD305; &amp;#x3160;&amp;#x3160;) CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xADF8;&amp;#xAC83;&amp;#xB3C4; &amp;#xC138; &amp;#xBB38;&amp;#xC81C;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB77C;&amp;#xB2C8;&amp;#xC694;.. &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xC2E0;&amp;#xCCAD; &amp;#xBABB;&amp;#xD55C; &amp;#xD300;&amp;#xC7A5; &amp;#xD0D3;&amp;#xC784; @idioth @idioth @idioth&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xCD5C;&amp;#xADFC; CTF &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xD2C0;&amp;#xC744; &amp;#xC7A1;&amp;#xC544;&amp;#xAC00;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB358; address_book &amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xB41C; &amp;#xBC30;&amp;#xACBD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB54C;&amp;#xB294; &amp;#xD558;&amp;#xB8E8; &amp;#xD55C; &amp;#xC904;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB5A0;&amp;#xB3CC;&amp;#xC544;&amp;#xB2E4;&amp;#xB2C8;&amp;#xB358; &amp;#xC911; Chrome&amp;#xC758; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xAD00;&amp;#xB828; UAF &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC8E0;. &lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xC601;&amp;#xAC10;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC11C; &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCFC;&amp;#xAE4C;? &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;MS tuesday patch&amp;#xC758; diff &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; binary diffing&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;? &lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC0AC;&amp;#xB78C; &amp;#xC778;&amp;#xC0DD;&amp;#xC774; &amp;#xACC4;&amp;#xD68D;&amp;#xB300;&amp;#xB85C;&amp;#xB9CC; &amp;#xB420; &amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xB098;&amp;#xC694; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC708;&amp;#xB108;&amp;#xBE14; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xB370;&amp;#xC774; &amp;#xBA87; &amp;#xBC88; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF8; &amp;#xAC8C; &amp;#xC804;&amp;#xBD80;&amp;#xC778; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC124;&amp;#xACC4;&amp;#xBD80;&amp;#xD130; &amp;#xC775;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD55C;&amp;#xB2E4;? &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xC544;&amp;#xC8FC; &amp;#xACF1;&amp;#xAC8C; &amp;#xAC08;&amp;#xB9B4; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xAC78; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xD130; &amp;#xC608;&amp;#xAC10;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; C++&amp;#xC758; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; C++&amp;#xC744; &amp;#xC368;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; OOP &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB358; &amp;#xC911; &amp;#xCF54;&amp;#xB4DC; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC9C4;&amp;#xC9DC; &amp;#xAC1C;&amp;#xD310; &amp;#xC624; &amp;#xBD84; &amp;#xC804;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xB354;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xACE0;&amp;#xCCD0;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xBAB0;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..   &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xAC70; &amp;#xC65C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC9DC; &amp;#xB1A8;&amp;#xC9C0; &amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC744; &amp;#xD150;&amp;#xB370;, &amp;#xB2E4; &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xC800;&amp;#xC758; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC2E4;&amp;#xB825; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.. &lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xD558;&amp;#xB098; &amp;#xBB38;&amp;#xC81C;&amp;#xB294;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8; &amp;#xB2E4; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xC65C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xB370;!!!!!!!!!!!!!!!!!!!!!!!!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC775;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294; &amp;#xACFC;&amp;#xC815; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC600;&amp;#xB358; &lt;code&gt;flag.txt&lt;/code&gt; &amp;#xD30C;&amp;#xC77C; open&amp;#xC744; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xACC4;&amp;#xC18D; &lt;code&gt;&amp;#xC751; &amp;#xD30C;&amp;#xC77C; &amp;#xBABB; &amp;#xC5F4;&amp;#xC5C8;&amp;#xC5B4; &amp;#x314B;&amp;#x314B;&lt;/code&gt; &amp;#xB97C; &amp;#xBC49;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xACBD;&amp;#xC6B0;&amp;#xC9C0;? &amp;#xC65C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBABB; &amp;#xC5EC;&amp;#xB294; &amp;#xAC70;&amp;#xC9C0;?? &amp;#xD63C;&amp;#xC7A3;&amp;#xB9D0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC695;&amp;#xB3C4; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xB2EC;&amp;#xB798;&amp;#xB3C4; &amp;#xBCF4;&amp;#xACE0; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xACB0;&amp;#xAD6D; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;flag.txt&lt;/code&gt; &amp;#xB97C; open&amp;#xB9CC; &amp;#xD558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4; &amp;#xACFC;&amp;#xC815; &amp;#xC911; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; open &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBE7C;&amp;#xACE0; file descriptor&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; flag&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xD611;&amp;#xC744; &amp;#xBCFC; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD6C4;&amp;#xC77C;&amp;#xB2F4;&lt;br&gt;idioth : &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xB108; address book &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBB34;&amp;#xC11C;&amp;#xC6E0;&amp;#xB358; &amp;#xAC70; &amp;#xC544;&amp;#xB0D0;&lt;br&gt;&amp;#xBCF8;&amp;#xC778; : ??? &amp;#xC65C;&amp;#xC694; &amp;#xB098; &amp;#xC65C;&lt;br&gt;idioth : &amp;#xB204;&amp;#xAD6C; &amp;#xD558;&amp;#xB098; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC8FD;&amp;#xB294;&amp;#xB2E8; &amp;#xD45C;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC5B4;&lt;br&gt;Fabu1ous : &amp;#x3147;&amp;#x3148;&lt;br&gt;&amp;#xBCF8;&amp;#xC778; :&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC774;&amp;#xC720;&amp;#xAC00; diff patch&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; binary diffing&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xAC70;&amp;#xC9C0;&amp;#xB9CC;.. &amp;#xACC4;&amp;#xD68D;&amp;#xC5D0; &amp;#xCC28;&amp;#xC9C8;&amp;#xC774; &amp;#xC0DD;&amp;#xACA8; diff patch&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xBABB;&amp;#xD574; &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC758; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;,  &amp;#xC65C; &amp;#xC2DC;&amp;#xC791;&amp;#xB3C4; &amp;#xC548; &amp;#xD55C; &amp;#xB450; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xB9D0;&amp;#xACE0;&amp;#xC0AC;&amp;#xB97C; &amp;#xB208;&amp;#xC55E;&amp;#xC5D0; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C;.. &amp;#xD559;&amp;#xC810;&amp;#xC744; &amp;#xB193;&amp;#xC544;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD559;&amp;#xC810;&amp;#xC744; &amp;#xD3EC;&amp;#xAE30;&amp;#xD55C; &amp;#xB300;&amp;#xAC00;&amp;#xB85C; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; baby_RudOlPh&amp;#xC640; picky_eater&amp;#xB97C; &amp;#xAD6C;&amp;#xC0C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;em&gt;&lt;del&gt;&amp;#xB4F1;&amp;#xAC00;&amp;#xAD50;&amp;#xD658;&amp;#xC758; &amp;#xBC95;&amp;#xCE59;&lt;/del&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;picky_eater&amp;#xB294; idioth &amp;#xD300;&amp;#xC7A5;&amp;#xB2D8;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC3D9; &amp;#xBE7C;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. address book&amp;#xACFC; &amp;#xACE0;&amp;#xAD70;&amp;#xBD84;&amp;#xD22C;&amp;#xD558;&amp;#xACE0;&amp;#xC788;&amp;#xB358; &amp;#xC800;&amp;#xB97C; &amp;#xBD88;&amp;#xC30D;&amp;#xD558;&amp;#xAC8C; &amp;#xBD24;&amp;#xC5C8;&amp;#xB098;&amp;#xBD10;&amp;#xC694;. &amp;#x201C;&amp;#xC774;&amp;#xAC70; &amp;#xB124;&amp;#xAC00; &amp;#xD560;&amp;#xB798;?&amp;#x201D; &amp;#xB77C;&amp;#xBA70; snake &amp;#xAC8C;&amp;#xC784; &amp;#xCEE8;&amp;#xC149;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC8FC;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xBD88;&amp;#xC30D;&amp;#xD574; &amp;#xBCF4;&amp;#xC600;&amp;#xB098;?;; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;br&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB550; &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; baby_RudOlPh&amp;#xB294; &amp;#xB450; &amp;#xC904;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??? : (&amp;#xD68C;&amp;#xC758; &amp;#xB3C4;&amp;#xC911;) &amp;#xB2D8;&amp;#xB4E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB274;&amp;#xBE44;&amp;#xC6A9; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAC8C; &amp;#xB41C; ARM(AArch64) ROP &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB0B4;&amp;#xBA74; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC5C6;&amp;#xC796;&amp;#xC544;&amp;#xC694;! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; ARM&amp;#xC744; &amp;#xB07C;&amp;#xC5B9;&amp;#xC5C8;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xAE30;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC6D0;&amp;#xB798; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; type confusion &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBABB; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB274;&amp;#xBE44;&amp;#xBB38;&amp;#xC81C; &amp;#xB0C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xC548; &amp;#xBE44;&amp;#xBC00;)&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB354; &amp;#xC798;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB7EC;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xAC10;&amp;#xC815;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB0A8;&amp;#xB294; &amp;#xB300;&amp;#xD68C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4DC;&amp;#xB124;&amp;#xC694;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; CTF&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xCD9C;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC62C;&amp;#xC9C4; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB354; &amp;#xB9CE;&amp;#xC774;, &amp;#xCCA0;&amp;#xC800;&amp;#xD558;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xC81C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2E0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xAC00;&amp;#xC790; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;h1 id=&#34;Fabu1ous&#34;&gt;&lt;a href=&#34;#Fabu1ous&#34; class=&#34;headerlink&#34; title=&#34;Fabu1ous&#34;&gt;&lt;/a&gt;Fabu1ous&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;Oil-system &amp;amp; Match-maker&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xC7A1;&amp;#xB294; &amp;#xAC74; &amp;#xC815;&amp;#xB9D0; &amp;#xD798;&amp;#xB4E0; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xAD70;&amp;#xC694;. &amp;#xB300;&amp;#xD68C; &amp;#xB54C; oil-system&amp;#xC758; &amp;#xD480;&amp;#xC774; &amp;#xC218;&amp;#xAC00; 20&amp;#xC774;&amp;#xB358;&amp;#xB370; &amp;#xC544;&amp;#xB9C8; &amp;#xBAA8;&amp;#xB450; &amp;#xC5B8;&amp;#xC778;&amp;#xD150;&amp;#xB514;&amp;#xB4DC;&amp;#xC77C;&amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Match-maker&amp;#xB3C4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; leak &amp;#xC911; &amp;#xC5B8;&amp;#xC778;&amp;#xD150;&amp;#xB514;&amp;#xB4DC;&amp;#xAC00; &amp;#xD55C; &amp;#xAC1C; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC194;&amp;#xC9C1;&amp;#xD788; &amp;#xC544;&amp;#xC8FC; &amp;#xC870;&amp;#xAE08; &amp;#xC5B5;&amp;#xC6B8;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026; &amp;#xC774;&amp;#xB7F0; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xC801;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC131;&amp;#xCC30;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xB098; &amp;#xAC00;&amp;#xC838;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBC41;&amp;#xC0C8;&amp;#xAC00; &amp;#xD669;&amp;#xC0C8;&amp;#xB97C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &amp;#xB2E4;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC22;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C4; &amp;#xBAB0;&amp;#xB790;&amp;#xB294;&amp;#xB370; &amp;#xC9C0;&amp;#xAE08; &amp;#xBCF4;&amp;#xB2C8; &amp;#xC815;&amp;#xB9D0; &amp;#xBCC4;&amp;#xAC70; &amp;#xC5C6;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xD070; &amp;#xD2C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xACFC; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB97C; &amp;#xAC8C; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD754;&amp;#xD788; &amp;#xC544;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xC8E0;. &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xC695;&amp;#xC740; &amp;#xC55E;&amp;#xC130;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xB825;&amp;#xC740; &amp;#xC548; &amp;#xB530;&amp;#xB77C;&amp;#xC8FC;&amp;#xACE0; &amp;#xACB0;&amp;#xAD6D; &amp;#xC4F8;&amp;#xB370;&amp;#xC5C6;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD0C4;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB3CC;&amp;#xB2E4;&amp;#xB9AC;&amp;#xB3C4; &amp;#xB450;&amp;#xB4E4;&amp;#xACA8; &amp;#xBCF4;&amp;#xACE0; &amp;#xAC74;&amp;#xB108;&amp;#xB77C;.&lt;/p&gt;
&lt;p&gt; &amp;#xCD5C;&amp;#xC885; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xB450; &amp;#xBC88; &amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xCD5C;&amp;#xC885; &amp;#xAC80;&amp;#xC0AC;&amp;#xC758; &amp;#xAC80;&amp;#xC0AC;&amp;#xB3C4; &amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xC0AC;&amp;#xAC74; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xC27D;&amp;#xAC8C; &amp;#xD655;&amp;#xC2E0;&amp;#xC744; &amp;#xAC16;&amp;#xC9C4; &amp;#xC54A;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;No g&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC124;&amp;#xBB38; &amp;#xC870;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xBC88; &amp;#xB300;&amp;#xD68C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xBD88;&amp;#xD638;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xC2EC;&amp;#xD588;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xB124;&amp;#xC694;. &amp;#xC15C;&amp;#xB85D;&amp;#xD648;&amp;#xC988; &amp;#xC554;&amp;#xD638;( &amp;#xCDA4;&amp;#xCD94;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C; &amp;#xADF8;&amp;#xB9BC; &amp;#xC554;&amp;#xD638; )&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xB290;&amp;#xB08C;&amp;#xC73C;&amp;#xB85C; crypto&amp;#xC640; misc &amp;#xADF8; &amp;#xC0AC;&amp;#xC774; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB824;&amp;#xACE0; &amp;#xD574; &amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. No g&amp;#xB77C;&amp;#xB294; &amp;#xC81C;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC27D;&amp;#xAC8C; &amp;#xD478;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7EC;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xC0C1;&amp;#xCC9C;&amp;#xC678;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; misc&amp;#xB098; &amp;#xD480;&amp;#xBA74;&amp;#xC11C; &amp;#xBA38;&amp;#xB9AC; &amp;#xC2DD;&amp;#xD788;&amp;#xB824;&amp;#xACE0; &amp;#xBD24;&amp;#xB2E4;&amp;#xAC00; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xC0AC;&amp;#xC8C4;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8C4;&amp;#xC1A1;&amp;#xD574;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;2&amp;#xB144; &amp;#xC5F0;&amp;#xC18D; Christmas CTF&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548; &amp;#xC88B;&amp;#xC740; &amp;#xAE30;&amp;#xC5B5;&amp;#xB9CC; &amp;#xB0A8;&amp;#xB124;&amp;#xC694;. &amp;#xC62C;&amp;#xD574;&amp;#xB294; &amp;#xAF2D; &amp;#xC5EC;&amp;#xCE5C; &amp;#xC0AC;&amp;#xADC0;&amp;#xC5B4;&amp;#xC11C; Christmas CTF &amp;#xB9D0;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xC57C;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC544;&amp;#xC774;&amp;#xC528;&amp;#x2026; &amp;#xB204;&amp;#xAC00; &amp;#xC5EC;&amp;#xAE30;&amp;#xB2E4; &amp;#xC591;&amp;#xD30C;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xB2E4; &amp;#xB193;&amp;#xC740; &amp;#xAC70;&amp;#xC57C;!?&lt;/del&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Daily-Life]  CTF 2020   - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758;-&amp;#xC804;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xAC74;&amp;#xC758;-&amp;#xC804;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xAC74;&amp;#xC758; &amp;#xC804;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&amp;#xB9E4;&amp;#xB144; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; &amp;#xC194;&amp;#xB85C;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xD55C;(?) &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC758; &amp;#xC8FC;&amp;#xCD5C;&amp;#xB97C; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC138;&amp;#xC885;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xC548; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; SSG&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xB9E1;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB3C4; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;. Fabu1ous&amp;#xB294; &amp;#xB9E1;&amp;#xAC8C; &amp;#xB41C; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB208; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA9;&amp;#xACA9;&amp;#xD588;&amp;#xC73C;&amp;#xB098; idioth&amp;#xACFC; L0ch&amp;#xB294; &amp;#xD1B5;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??? : &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; &amp;#xB54C; &amp;#xBB50;&amp;#xD558;&amp;#xB0D0;&lt;br&gt;idioth : &amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xC694;&lt;br&gt;??? : &amp;#xC5EC;&amp;#xC790; &amp;#xCE5C;&amp;#xAD6C; &amp;#xC5C6;&amp;#xC796;&amp;#xC544;&lt;br&gt;idioth : &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;&lt;br&gt;??? : &amp;#xBB38;&amp;#xC81C;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB77C;&lt;br&gt;L0ch : &amp;#xC804; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC6A9; &amp;#x314E;&amp;#x314E;&lt;br&gt;??? : &amp;#xC54C; &amp;#xBC14; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image0.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD88;&amp;#xC548;&amp;#xD55C; &amp;#xC9C1;&amp;#xAC10;&amp;#xC740; &amp;#xC5B8;&amp;#xC81C;&amp;#xB098; &amp;#xC633;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2018;&amp;#xC6B0;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB3FC;&amp;#x2019;&amp;#xB97C; &amp;#xB4E3;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xC9C1;&amp;#xAC10;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xAD6C;&amp;#xB098;&amp;#x2026; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xC778;&amp;#xB2F9; &amp;#xB450; &amp;#xBB38;&amp;#xC81C;&amp;#xC529; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xB098;&amp;#xAC00;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xD300;&amp;#xC7A5; &amp;#xB140;&amp;#xC11D;&amp;#xC774; &amp;#xBD84;&amp;#xC57C;&amp;#xB97C; &amp;#xCC29;&amp;#xAC01;&amp;#xD574;&amp;#xC11C; &amp;#xC2E0;&amp;#xCCAD;&amp;#xC744; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAC01; 3&amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C;&amp;#x2026;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;idioth : &amp;#xC598;&amp;#xB4E4;&amp;#xC544; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC138; &amp;#xBB38;&amp;#xC81C;&amp;#xC529; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5B4; &amp;#x314E;&amp;#x314E;&lt;br&gt;L0ch, Fabu1ous : ???&lt;br&gt;idioth : &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xC2E0;&amp;#xCCAD; &amp;#xBABB;&amp;#xD568; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xB85C; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;&amp;#x2026;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;idioth&lt;ul&gt;
&lt;li&gt;rev : custom packer&lt;/li&gt;
&lt;li&gt;web : cve-2020-9484 tomcat rce&lt;/li&gt;
&lt;li&gt;misc : snake&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;L0ch&lt;ul&gt;
&lt;li&gt;pwn : Windows pwnable uaf&lt;/li&gt;
&lt;li&gt;pwn : Linux pwnable type confusion&lt;/li&gt;
&lt;li&gt;rev : obfuscate&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Fabu1ous&lt;ul&gt;
&lt;li&gt;pwn : angr challenge&lt;/li&gt;
&lt;li&gt;pwn : uninit stack&lt;/li&gt;
&lt;li&gt;misc : &amp;#xBBF8;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xB9CE;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xCF54;&amp;#xB85C;&amp;#xB098; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xD559;&amp;#xAE30;&amp;#xAC00; 1&amp;#xC8FC;&amp;#xC77C; &amp;#xB2F9;&amp;#xACA8;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; 11&amp;#xC6D4;&amp;#xACFC; 12&amp;#xC6D4; &amp;#xCD08;&amp;#xAC00; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xBC14;&amp;#xBE60;&amp;#xC9C8; &amp;#xC904;&amp;#xC740; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xBAB0;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD559;&amp;#xAE30;&amp;#xAC00; &amp;#xB05D;&amp;#xB09C; &amp;#xD6C4; &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xB7A9;&amp;#xC2E4;&amp;#xC5D0; &amp;#xAC07;&amp;#xD600;&amp;#xC11C; &amp;#xADFC; 1&amp;#xC8FC;&amp;#xC77C;&amp;#xC744; &amp;#xBC24;&amp;#xC0C8;&amp;#xBA70; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC15;&amp;#xCC28;&amp;#xB97C; &amp;#xAC00;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C; &amp;#xC804;&amp;#xB0A0; &amp;#xADF8;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA8;&amp;#xC2B5;&lt;/p&gt;
&lt;h1 id=&#34;idioth&#34;&gt;&lt;a href=&#34;#idioth&#34; class=&#34;headerlink&#34; title=&#34;idioth&#34;&gt;&lt;/a&gt;idioth&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50;&amp;#x2026; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xD55C;&amp;#xB2E4; &amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; 5&amp;#xC6D4; &amp;#xC911;&amp;#xC21C;&amp;#xC5D0; &amp;#xC18C;&amp;#xC9D1; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB9C9; &amp;#xB2E4;&amp;#xC2DC; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C; &amp;#xCC38;&amp;#xC774;&amp;#xB77C;&amp;#xC11C;&amp;#x2026; &amp;#xCD9C;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; CTF&amp;#xB97C; 2&amp;#xAC1C; &amp;#xC815;&amp;#xB3C4; &amp;#xB098;&amp;#xAC14;&amp;#xB294;&amp;#xB370; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; baby-rev &amp;#xC815;&amp;#xB3C4;&amp;#xBC16;&amp;#xC5D0; &amp;#xBABB; &amp;#xD480;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB54;&amp;#xAC00; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xBC14;&amp;#xB010; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xD3EC;&amp;#xB108;&amp;#xBE14;&amp;#xC744; &amp;#xB0B4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xC5B5;&amp;#xB3C4; &amp;#xC5B4;&amp;#xB834;&amp;#xD48B;&amp;#xD558;&amp;#xACE0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; &amp;#xB298; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xAC00; &amp;#xBD24;&amp;#xB354;&amp;#xB2C8; &amp;#xC554;&amp;#xD638;&amp;#xB791; &amp;#xC811;&amp;#xBAA9;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC2DC;&amp;#xCF1C;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC554;&amp;#xD638;&amp;#xB294; &amp;#xB0B4;&amp;#xAC00; &amp;#xD560; &amp;#xC904; &amp;#xBAA8;&amp;#xB974;&amp;#xB2C8; &amp;#xD328;&amp;#xC2A4;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xBB50; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0;? &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xBCF5;&amp;#xBB34; &amp;#xC911;&amp;#xC5D0; &amp;#xD588;&amp;#xB358; Custom Packer &amp;#xC2A4;&amp;#xD130;&amp;#xB514;&amp;#xAC00; &amp;#xB5A0;&amp;#xC62C;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;! &amp;#xC774;&amp;#xAC70;&amp;#xB2E4;! &amp;#xD328;&amp;#xCEE4; &amp;#xB531; &amp;#xB300;!&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xB4E4;&amp;#xC740; &amp;#xD6C4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xB300;&amp;#xCDA9; &amp;#xC815;&amp;#xD55C; &amp;#xD6C4; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2EC;&amp;#xBD80;&amp;#xD130; &amp;#xD328;&amp;#xCEE4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xD328;&amp;#xCEE4; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740;&amp;#x2026; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC544;&amp;#xC2DC;&amp;#xC8E0;? (&amp;#x314E;&amp;#x314E;)&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;64&amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC790;&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4; &amp;#xB0B4;&amp;#xAC00; &amp;#xADF8;&amp;#xB54C; &amp;#xC2A4;&amp;#xD130;&amp;#xB514;&amp;#xD588;&amp;#xB358; &amp;#xAC74; 32&amp;#xBE44;&amp;#xD2B8;&amp;#xB124;?&lt;/li&gt;
&lt;li&gt;&amp;#xB108;&amp;#xBB34; &amp;#xC61B;&amp;#xB0A0; &amp;#xAC70;&amp;#xB124;? &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xB3C4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC84C;&amp;#xB124;?&lt;/li&gt;
&lt;li&gt;&amp;#x2026;github&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xAC78; &amp;#xBCF4;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xBA74; &amp;#xC88B;&amp;#xC740; &amp;#xC9C0; &amp;#xBCF4;&amp;#xC790;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xD55C; &amp;#xB2EC;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC11C; &amp;#xC644;&amp;#xC131;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC5ED;&amp;#xC2DC; &amp;#xB09C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD558;&amp;#xB294; &amp;#xB0A8;&amp;#xC790;! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xBCF4;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; &amp;#xB3C4;&amp;#xB300;&amp;#xCCB4; &amp;#xC5B4;&amp;#xB514;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC544; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC5C6;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xC81C; &amp;#xACFC;&amp;#xC81C; &amp;#xD3ED;&amp;#xD48D;&amp;#xC774; &amp;#xBAB0;&amp;#xB824;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xC5B4;&amp;#xB5A1;&amp;#xD558;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; tomcat&amp;#xBD80;&amp;#xD130; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC790;&amp;#x2026; tomcat &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xAE30;&amp;#xB2A5; &amp;#xAD6C;&amp;#xD604;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAE08;&amp;#xBC29; &amp;#xD558;&amp;#xACA0;&amp;#xC9C0;? &amp;#xC6F9; &amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xB4E4;&amp;#xC774; &amp;#xB3C4;&amp;#xC640;&amp;#xC900;&amp;#xB314;&amp;#xC5B4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC751; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC70; &amp;#xC5C6;&amp;#xC5B4;~ &amp;#xC6F9; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF8;&amp;#xAC70;&amp;#xB77C;&amp;#xACE4; &amp;#xACF5;&amp;#xBD80; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xD560; &amp;#xB54C; html, php&amp;#xC640; django&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xBCF8; &amp;#xAC83;&amp;#xC774; &amp;#xC804;&amp;#xBD80;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E8; &amp;#xB545;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB529;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xD559;&amp;#xAD50;&amp;#xC5D0;&amp;#xC11C; python &amp;#xD559;&amp;#xBD80; &amp;#xC218;&amp;#xC5C5; &amp;#xC870;&amp;#xAD50;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xBB54;&amp;#xAC00; &amp;#xD560; &amp;#xC77C;&amp;#xC774; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xB9CE;&amp;#xC558;&amp;#xC8E0;(&amp;#xD551;&amp;#xACC4;&amp;#xC57C;)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC0C1; - &amp;#xD558;&amp;#xB8E8; &amp;#xD55C; &amp;#xC904; - &amp;#xC870;&amp;#xAD50; - &amp;#xACFC;&amp;#xC81C; - (&amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;) - &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC21C;&amp;#xD658;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xB3CC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC89;&amp;#xC73C;&amp;#xB85C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xB3C4; 11&amp;#xC6D4; &amp;#xB9D0;&amp;#xC5D0; &amp;#xB2E4; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xC804;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824; &amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; &amp;#xC9C0;&amp;#xAE08; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC120; session &amp;#xD3F4;&amp;#xB354;&amp;#xC640; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xACFC; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8; &amp;#xB05D;&amp;#xC5D0; LFI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; path traversal &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xAC70;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC744;&amp;#xAE4C; &amp;#xB9D0;&amp;#xAE4C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &lt;code&gt;../&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAC70;&amp;#xB294; &amp;#xAC78;&amp;#xC5B4;&amp;#xB193;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744;&amp;#xAE4C;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC70; &amp;#xBCF4;&amp;#xC774;&amp;#xBA74; &amp;#xC77C;&amp;#xB2E8; &amp;#xB54C;&amp;#xB824; &amp;#xB123;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xAC70;&amp;#xB294; &amp;#xAC78;&amp;#xC5B4;&amp;#xB193;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC544;.&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &lt;code&gt;gift&lt;/code&gt; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD0C4;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC6F9; &amp;#xCC98;&amp;#xC74C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC83; &amp;#xCE58;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD588;&amp;#xC73C;&amp;#xB098;&amp;#x2026; &amp;#xC800;&amp;#xC758; &amp;#xC624;&amp;#xB9CC;&amp;#xD568;&amp;#xC774;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xAE68;&amp;#xB2EC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC73C;&amp;#xC73C;&amp;#x2026; &amp;#xC800;&amp;#xB294; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC600;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x315C;&amp;#x315C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;gift&lt;/code&gt; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xB300;&amp;#xD68C;&amp;#xAC00; &amp;#xC77C;&amp;#xC8FC;&amp;#xC77C; &amp;#xB0A8;&amp;#xC558;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&amp;#x2026; &amp;#xADF8;&amp;#xB0E5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC83; &amp;#xB0B4;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; crackme &amp;#xD558;&amp;#xB098; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;~ &amp;#xD558;&amp;#xACE0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xBB54;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xD5C8;&amp;#xC804;&amp;#xD574;&amp;#xC11C; &amp;#xACE0;&amp;#xBBFC;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xBB54;&amp;#xAC00; &amp;#xC5C6;&amp;#xB098;&amp;#x2026; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB531; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624; &amp;#xC774;&amp;#xC81C; &amp;#xB9E5;&amp;#xB3C4; ARM&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370; ARM &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560;&amp;#xAE4C;? &amp;#x3131;&amp;#x3131;&amp;#x3131;&amp;#x3131; arm &amp;#xC5B4;&amp;#xC148; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xB85C; &amp;#xB0B4;&amp;#xACE0;~ ida hexrays&amp;#xB97C; &amp;#xB9C9;&amp;#xC544;&amp;#xB193;&amp;#xC790;. &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xC798;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; arm&amp;#xB3C4; &amp;#xAE08;&amp;#xBC29; &amp;#xBCF4;&amp;#xC2E4; &amp;#xD14C;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; anti-hexrays&amp;#xB294; &amp;#xAE08;&amp;#xBC29; &amp;#xD478;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;ida&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE68;&amp;#xC838;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xC65C; ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;??? : &amp;#xC57C; &amp;#xADF8;&amp;#xB0E5; &amp;#xD578;&amp;#xB4DC; &amp;#xB808;&amp;#xC774;&amp;#xB85C; &amp;#xB0B4;&amp;#xC790;&lt;/p&gt;
&lt;p&gt;idioth : &amp;#x3131; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; baby &amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB0B8; &amp;#xAC70;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;-&lt;code&gt;lock&lt;/code&gt; &amp;#xB05D;-&lt;/p&gt;
&lt;p&gt;&amp;#xC544; &amp;#xC774;&amp;#xC81C; snake &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xB0A8;&amp;#xC558;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; misc &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xC11C; &amp;#xB108;&amp;#xBB34; &amp;#xBD80;&amp;#xB2F4;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~ &amp;#xBC40; &amp;#xAC8C;&amp;#xC784; &amp;#xC7AC;&amp;#xBBF8;&amp;#xB098;&amp;#xAC8C; &amp;#xD558;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&lt;del&gt;~&lt;/del&gt;&amp;#xD558;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0; &amp;#xC55E;&amp;#xC744; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC808;&amp;#xB9DD;&amp;#xC758; &amp;#xAD6C;&amp;#xB801;&amp;#xD145;&amp;#xC774;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C4; &amp;#xD55C; &amp;#xB0A8;&amp;#xC790;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch : &amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&amp;#xB098;&amp;#xB9CC;&amp;#xC775;&amp;#xC2A4;&amp;#xC548;&amp;#xB3FC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB294;&amp;#xB370; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xBB34;&amp;#xC12D;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C; misc &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; reversing&amp;#xC744; &amp;#xC81C;&amp;#xAC00; &amp;#xB0B4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38;&amp;#xAC00;&amp;#xD55C; &amp;#xB300;&amp;#xD68C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC5D0;&amp;#xC11C; angr&amp;#xB85C; &amp;#xD47C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; angr &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB0B4;&amp;#xC790;. &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; arm&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xBA74; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACA0;&amp;#xB2F9;. &amp;#xD558;&amp;#xACE0; &amp;#xD6C4;&amp;#xB531; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; arm&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC65C; simulation manager&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xB3C4; &amp;#xAC12;&amp;#xC774; &amp;#xC548; &amp;#xB098;&amp;#xC624;&amp;#xC9C0;? &amp;#xADF8;&amp;#xB0E5; x64&amp;#xB85C; &amp;#xC644;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xB09C; &amp;#xD6C4; L0ch&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC40; &amp;#xAC8C;&amp;#xC784;&amp;#xC744; &amp;#xC644;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xAE30; type confusion &amp;#xBABB; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; baby pwnable &amp;#xBB50; &amp;#xB0BC; &amp;#xC9C0; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xB358;&amp;#xC838; &amp;#xC92C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. arm rop &amp;#xC7AC;&amp;#xBC0C;&amp;#xC744; &amp;#xB4EF;? &lt;code&gt;baby_RudOlPh&lt;/code&gt; &amp;#xD0C4;&amp;#xC0DD;~&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; angr &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC80;&amp;#xC218;&amp;#xD558;&amp;#xACE0; &amp;#xAC12;&amp;#xC744; &amp;#xC5F0;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xAC12;&amp;#xC774; &amp;#xBC00;&amp;#xB824;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; c++&amp;#xB85C; &amp;#xC9F0;&amp;#xC5C8;&amp;#xACE0; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC18D; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xB370; input&amp;#xC774; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAF2C;&amp;#xC5EC;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xAD6D; c&amp;#xB85C; &amp;#xC62E;&amp;#xAE30;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; c&amp;#xB85C; &amp;#xC62E;&amp;#xACA8;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC790; byte &amp;#xBA87; &amp;#xAC1C;&amp;#xAC00; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xB2F9;&amp;#xC7A5; &amp;#xB0B4;&amp;#xC77C;&amp;#xC774;&amp;#xACE0; &amp;#xAE09;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xBC94;&amp;#xC704;&amp;#xAC00; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xADF8;&amp;#xB7F0;&amp;#xAC00; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#xD06C;&amp;#xAC8C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBC84;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;angrforge&lt;/code&gt; &amp;#xD0C4;&amp;#xC0DD;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC695;&amp;#xBA39;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC190;&amp;#xC73C;&amp;#xB85C; &amp;#xD478;&amp;#xC2E0; &amp;#xBD84; &amp;#xACC4;&amp;#xC2DC;&amp;#xB358;&amp;#xB370; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC8C4;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xAE34;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &lt;em&gt;*&lt;/em&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC758;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xC870;&amp;#xCC28; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xC5EC;&amp;#xCC28;&amp;#xC800;&amp;#xCC28; &amp;#xC798; &amp;#xB05D;&amp;#xB0AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9C8;&amp;#xC74C;&amp;#xC774; &amp;#xBD88;&amp;#xD3B8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xB294; &amp;#xB098;&amp;#xB300;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC774; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;lock&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;angrforge&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0; &amp;#xCAD3;&amp;#xACA8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD070; &amp;#xACE0;&amp;#xBBFC; &amp;#xC5C6;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC774;&amp;#xB77C;&amp;#xC11C; &amp;#xB9C8;&amp;#xC74C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC81C; &amp;#xC81C;&amp;#xC791; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &lt;code&gt;gift&lt;/code&gt;&amp;#xC5D0; &amp;#xC3DF;&amp;#xC558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC6B4;&amp;#xC601;&amp;#xB3FC;&amp;#xC11C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACA0;&amp;#xB2E4;.&amp;#xB77C;&amp;#xB294; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB3C4; &amp;#xC798; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC74; &amp;#xCD9C;&amp;#xC81C;&amp;#xC790;&amp;#xC758; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774;&amp;#xC9C0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC548; &amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xAC8C; &amp;#xB9DE;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C;&amp;#xAC00; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xB098;&amp;#xC11C; &amp;#xC2EC;&amp;#xC57C; &amp;#xBC84;&amp;#xC2A4;&amp;#xB97C; &amp;#xD0C0;&amp;#xACE0; &amp;#xC9D1;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xC758; 40&amp;#xC2DC;&amp;#xAC04; &amp;#xB118;&amp;#xAC8C; &amp;#xAE68;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xBC84;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xB3C4; &amp;#xC548; &amp;#xC624;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#xD604;&amp;#xD0C0;&amp;#xAC00; &amp;#xC138;&amp;#xAC8C; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#x2026; &amp;#xB0B4;&amp;#xAC00; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBABB;&amp;#xD558;&amp;#xB294;&amp;#xAD6C;&amp;#xB098;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC744; &amp;#xD480;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD24;&amp;#xB358; &amp;#xB85C;&amp;#xC9C1;&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xACE0;, &amp;#xC0DD;&amp;#xAC01;&amp;#xC758; &amp;#xB113;&amp;#xC774;&amp;#xB098; &amp;#xAE4A;&amp;#xC774;&amp;#xB3C4; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC740; &amp;#xB354; &amp;#xB113;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xB294;&amp;#xAD6C;&amp;#xB098;.&lt;/p&gt;
&lt;p&gt;&amp;#xB3CC;&amp;#xC774;&amp;#xCF1C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xBD24;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB098; &amp;#xCEE8;&amp;#xC149;&amp;#xC774; &amp;#xC7AC;&amp;#xBC0C;&amp;#xACE0; &amp;#xC2E0;&amp;#xC120;&amp;#xD55C; &amp;#xAC83;&amp;#xC5D0;&amp;#xB9CC; &amp;#xB108;&amp;#xBB34; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB098;? &amp;#xB0B4;&amp;#xAC00; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xADF8; &amp;#xC7AC;&amp;#xBBF8;&amp;#xB97C; &amp;#xC628;&amp;#xC804;&amp;#xD788; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xB9CC;&amp;#xD07C;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xB418;&amp;#xB294;&amp;#xAC00;?&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9D1;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C; &amp;#xC0E4;&amp;#xC6CC;&amp;#xD558;&amp;#xACE0; &amp;#xB204;&amp;#xC6E0;&amp;#xB294;&amp;#xB370; &amp;#xD574;&amp;#xAC00; &amp;#xB730; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC7A0;&amp;#xC744; &amp;#xBABB; &amp;#xC7A4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7A1;&amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &amp;#xC9C0;&amp;#xCCD0;&amp;#xC11C; &amp;#xC7A0;&amp;#xB4E4;&amp;#xACE0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB2C8; &amp;#xC0C1;&amp;#xC704;&amp;#xAD8C; &amp;#xD300;&amp;#xB4E4; &amp;#xB77C;&amp;#xC5C5;&amp;#xC774; &amp;#xAE30;&amp;#xB300;&amp;#xAC00; &amp;#xB418;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &lt;code&gt;lock&lt;/code&gt;&amp;#xC774;&amp;#xB791; &lt;code&gt;angrforge&lt;/code&gt;&amp;#xB294; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xACE0; &lt;code&gt;gift&lt;/code&gt;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD478;&amp;#xC168;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB290;&amp;#xB07C;&amp;#xC168;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xC815;&amp;#xB9D0; &amp;#xCEF8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4; &amp;#xBCF4;&amp;#xACE0; &amp;#xB098;&amp;#xC11C; &amp;#xB77C;&amp;#xC5C5;&amp;#xC744; &amp;#xB2E4; &amp;#xB72F;&amp;#xC5B4;&amp;#xACE0;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC880; &amp;#xB354; &amp;#xB0B4;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xACFC; &amp;#xACE0;&amp;#xBBFC;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 2021&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC744;&amp;#xC9C0; &amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xBD80;&amp;#xC871;&amp;#xD588;&amp;#xB358; &amp;#xAC83;, &amp;#xBD80;&amp;#xC871;&amp;#xD568;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC560;&amp;#xC368; &amp;#xC678;&amp;#xBA74;&amp;#xD558;&amp;#xB358; &amp;#xAC83;&amp;#xB4E4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xBA74;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB4E4; &amp;#xBBF8;&amp;#xCC9C;&amp;#xD55C;(?) &amp;#xBB38;&amp;#xC81C; &amp;#xD478;&amp;#xC2DC;&amp;#xB290;&amp;#xB77C; &amp;#xACE0;&amp;#xC0DD; &amp;#xB9CE;&amp;#xC73C;&amp;#xC168;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xC990;&amp;#xAE30;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC815;&amp;#xB9D0; &amp;#xC88B;&amp;#xC558;&amp;#xC744; &amp;#xD150;&amp;#xB370;&amp;#x2026;! &amp;#xB2E4;&amp;#xB4E4; &amp;#xC0C8;&amp;#xD574; &amp;#xBCF5; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1B;&amp;#xC73C;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h1 id=&#34;L0ch&#34;&gt;&lt;a href=&#34;#L0ch&#34; class=&#34;headerlink&#34; title=&#34;L0ch&#34;&gt;&lt;/a&gt;L0ch&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! CTF &amp;#xBB38;&amp;#xC81C; &amp;#xCD9C;&amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80; CTF &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xB358; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??????? &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;???&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC9C4;&amp;#xC9DC; &amp;#xB531; &amp;#xC800; &amp;#xD45C;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xBC29;&amp;#xC758; &amp;#xC758;&amp;#xBB34;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xBC31;&amp;#xC9C0;&amp;#xAC00; &amp;#xB41C; &amp;#xBA38;&amp;#xB9AC;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xB358; &amp;#xC640;&amp;#xC911;&amp;#xC5D0; (&amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xAD70;&amp;#xC778;&amp;#xB4E4; &amp;#xD654;&amp;#xC774;&amp;#xD305; &amp;#x3160;&amp;#x3160;) CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xADF8;&amp;#xAC83;&amp;#xB3C4; &amp;#xC138; &amp;#xBB38;&amp;#xC81C;&amp;#xB098; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB77C;&amp;#xB2C8;&amp;#xC694;.. &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xC2E0;&amp;#xCCAD; &amp;#xBABB;&amp;#xD55C; &amp;#xD300;&amp;#xC7A5; &amp;#xD0D3;&amp;#xC784; @idioth @idioth @idioth&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xCD5C;&amp;#xADFC; CTF &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xD2C0;&amp;#xC744; &amp;#xC7A1;&amp;#xC544;&amp;#xAC00;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB358; address_book &amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xB41C; &amp;#xBC30;&amp;#xACBD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB54C;&amp;#xB294; &amp;#xD558;&amp;#xB8E8; &amp;#xD55C; &amp;#xC904;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB5A0;&amp;#xB3CC;&amp;#xC544;&amp;#xB2E4;&amp;#xB2C8;&amp;#xB358; &amp;#xC911; Chrome&amp;#xC758; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xAD00;&amp;#xB828; UAF &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC8E0;. &lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xC601;&amp;#xAC10;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC11C; &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCFC;&amp;#xAE4C;? &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;MS tuesday patch&amp;#xC758; diff &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; binary diffing&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;? &lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC0AC;&amp;#xB78C; &amp;#xC778;&amp;#xC0DD;&amp;#xC774; &amp;#xACC4;&amp;#xD68D;&amp;#xB300;&amp;#xB85C;&amp;#xB9CC; &amp;#xB420; &amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xB098;&amp;#xC694; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC708;&amp;#xB108;&amp;#xBE14; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC6D0;&amp;#xB370;&amp;#xC774; &amp;#xBA87; &amp;#xBC88; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF8; &amp;#xAC8C; &amp;#xC804;&amp;#xBD80;&amp;#xC778; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC124;&amp;#xACC4;&amp;#xBD80;&amp;#xD130; &amp;#xC775;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD55C;&amp;#xB2E4;? &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xC544;&amp;#xC8FC; &amp;#xACF1;&amp;#xAC8C; &amp;#xAC08;&amp;#xB9B4; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xAC78; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xD130; &amp;#xC608;&amp;#xAC10;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; C++&amp;#xC758; &amp;#xACF5;&amp;#xC720; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; C++&amp;#xC744; &amp;#xC368;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; OOP &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB358; &amp;#xC911; &amp;#xCF54;&amp;#xB4DC; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC9C4;&amp;#xC9DC; &amp;#xAC1C;&amp;#xD310; &amp;#xC624; &amp;#xBD84; &amp;#xC804;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xB354;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xACE0;&amp;#xCCD0;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xBAB0;&amp;#xB790;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..   &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xAC70; &amp;#xC65C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC9DC; &amp;#xB1A8;&amp;#xC9C0; &amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC744; &amp;#xD150;&amp;#xB370;, &amp;#xB2E4; &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xC800;&amp;#xC758; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC2E4;&amp;#xB825; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.. &lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xD558;&amp;#xB098; &amp;#xBB38;&amp;#xC81C;&amp;#xB294;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8; &amp;#xB2E4; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB193;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xC65C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xB370;!!!!!!!!!!!!!!!!!!!!!!!!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC775;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294; &amp;#xACFC;&amp;#xC815; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC600;&amp;#xB358; &lt;code&gt;flag.txt&lt;/code&gt; &amp;#xD30C;&amp;#xC77C; open&amp;#xC744; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xACC4;&amp;#xC18D; &lt;code&gt;&amp;#xC751; &amp;#xD30C;&amp;#xC77C; &amp;#xBABB; &amp;#xC5F4;&amp;#xC5C8;&amp;#xC5B4; &amp;#x314B;&amp;#x314B;&lt;/code&gt; &amp;#xB97C; &amp;#xBC49;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xACBD;&amp;#xC6B0;&amp;#xC9C0;? &amp;#xC65C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBABB; &amp;#xC5EC;&amp;#xB294; &amp;#xAC70;&amp;#xC9C0;?? &amp;#xD63C;&amp;#xC7A3;&amp;#xB9D0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC695;&amp;#xB3C4; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xB2EC;&amp;#xB798;&amp;#xB3C4; &amp;#xBCF4;&amp;#xACE0; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xACB0;&amp;#xAD6D; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;flag.txt&lt;/code&gt; &amp;#xB97C; open&amp;#xB9CC; &amp;#xD558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4; &amp;#xACFC;&amp;#xC815; &amp;#xC911; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; open &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBE7C;&amp;#xACE0; file descriptor&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; flag&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xD611;&amp;#xC744; &amp;#xBCFC; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD6C4;&amp;#xC77C;&amp;#xB2F4;&lt;br&gt;idioth : &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xB108; address book &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBB34;&amp;#xC11C;&amp;#xC6E0;&amp;#xB358; &amp;#xAC70; &amp;#xC544;&amp;#xB0D0;&lt;br&gt;&amp;#xBCF8;&amp;#xC778; : ??? &amp;#xC65C;&amp;#xC694; &amp;#xB098; &amp;#xC65C;&lt;br&gt;idioth : &amp;#xB204;&amp;#xAD6C; &amp;#xD558;&amp;#xB098; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC8FD;&amp;#xB294;&amp;#xB2E8; &amp;#xD45C;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC5B4;&lt;br&gt;Fabu1ous : &amp;#x3147;&amp;#x3148;&lt;br&gt;&amp;#xBCF8;&amp;#xC778; :&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC774;&amp;#xC720;&amp;#xAC00; diff patch&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; binary diffing&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xAC70;&amp;#xC9C0;&amp;#xB9CC;.. &amp;#xACC4;&amp;#xD68D;&amp;#xC5D0; &amp;#xCC28;&amp;#xC9C8;&amp;#xC774; &amp;#xC0DD;&amp;#xACA8; diff patch&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xBABB;&amp;#xD574; &amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC88B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC758; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;,  &amp;#xC65C; &amp;#xC2DC;&amp;#xC791;&amp;#xB3C4; &amp;#xC548; &amp;#xD55C; &amp;#xB450; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xB9D0;&amp;#xACE0;&amp;#xC0AC;&amp;#xB97C; &amp;#xB208;&amp;#xC55E;&amp;#xC5D0; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C;.. &amp;#xD559;&amp;#xC810;&amp;#xC744; &amp;#xB193;&amp;#xC544;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD559;&amp;#xC810;&amp;#xC744; &amp;#xD3EC;&amp;#xAE30;&amp;#xD55C; &amp;#xB300;&amp;#xAC00;&amp;#xB85C; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; baby_RudOlPh&amp;#xC640; picky_eater&amp;#xB97C; &amp;#xAD6C;&amp;#xC0C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;em&gt;&lt;del&gt;&amp;#xB4F1;&amp;#xAC00;&amp;#xAD50;&amp;#xD658;&amp;#xC758; &amp;#xBC95;&amp;#xCE59;&lt;/del&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;picky_eater&amp;#xB294; idioth &amp;#xD300;&amp;#xC7A5;&amp;#xB2D8;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC3D9; &amp;#xBE7C;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. address book&amp;#xACFC; &amp;#xACE0;&amp;#xAD70;&amp;#xBD84;&amp;#xD22C;&amp;#xD558;&amp;#xACE0;&amp;#xC788;&amp;#xB358; &amp;#xC800;&amp;#xB97C; &amp;#xBD88;&amp;#xC30D;&amp;#xD558;&amp;#xAC8C; &amp;#xBD24;&amp;#xC5C8;&amp;#xB098;&amp;#xBD10;&amp;#xC694;. &amp;#x201C;&amp;#xC774;&amp;#xAC70; &amp;#xB124;&amp;#xAC00; &amp;#xD560;&amp;#xB798;?&amp;#x201D; &amp;#xB77C;&amp;#xBA70; snake &amp;#xAC8C;&amp;#xC784; &amp;#xCEE8;&amp;#xC149;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC8FC;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xADF8; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xBD88;&amp;#xC30D;&amp;#xD574; &amp;#xBCF4;&amp;#xC600;&amp;#xB098;?;; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;br&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB550; &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; baby_RudOlPh&amp;#xB294; &amp;#xB450; &amp;#xC904;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;??? : (&amp;#xD68C;&amp;#xC758; &amp;#xB3C4;&amp;#xC911;) &amp;#xB2D8;&amp;#xB4E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB274;&amp;#xBE44;&amp;#xC6A9; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAC8C; &amp;#xB41C; ARM(AArch64) ROP &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB0B4;&amp;#xBA74; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC5C6;&amp;#xC796;&amp;#xC544;&amp;#xC694;! &amp;#xADF8;&amp;#xB798;&amp;#xC11C; ARM&amp;#xC744; &amp;#xB07C;&amp;#xC5B9;&amp;#xC5C8;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xAE30;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC6D0;&amp;#xB798; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xB358; type confusion &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBABB; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB274;&amp;#xBE44;&amp;#xBB38;&amp;#xC81C; &amp;#xB0C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xC548; &amp;#xBE44;&amp;#xBC00;)&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB354; &amp;#xC798;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB7EC;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xAC10;&amp;#xC815;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB0A8;&amp;#xB294; &amp;#xB300;&amp;#xD68C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4DC;&amp;#xB124;&amp;#xC694;. &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; CTF&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xCD9C;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC62C;&amp;#xC9C4; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB354; &amp;#xB9CE;&amp;#xC774;, &amp;#xCCA0;&amp;#xC800;&amp;#xD558;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xC81C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2E0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xAC00;&amp;#xC790; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;h1 id=&#34;Fabu1ous&#34;&gt;&lt;a href=&#34;#Fabu1ous&#34; class=&#34;headerlink&#34; title=&#34;Fabu1ous&#34;&gt;&lt;/a&gt;Fabu1ous&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;Oil-system &amp;amp; Match-maker&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xC7A1;&amp;#xB294; &amp;#xAC74; &amp;#xC815;&amp;#xB9D0; &amp;#xD798;&amp;#xB4E0; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xAD70;&amp;#xC694;. &amp;#xB300;&amp;#xD68C; &amp;#xB54C; oil-system&amp;#xC758; &amp;#xD480;&amp;#xC774; &amp;#xC218;&amp;#xAC00; 20&amp;#xC774;&amp;#xB358;&amp;#xB370; &amp;#xC544;&amp;#xB9C8; &amp;#xBAA8;&amp;#xB450; &amp;#xC5B8;&amp;#xC778;&amp;#xD150;&amp;#xB514;&amp;#xB4DC;&amp;#xC77C;&amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Match-maker&amp;#xB3C4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; leak &amp;#xC911; &amp;#xC5B8;&amp;#xC778;&amp;#xD150;&amp;#xB514;&amp;#xB4DC;&amp;#xAC00; &amp;#xD55C; &amp;#xAC1C; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC194;&amp;#xC9C1;&amp;#xD788; &amp;#xC544;&amp;#xC8FC; &amp;#xC870;&amp;#xAE08; &amp;#xC5B5;&amp;#xC6B8;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xAC8C; &amp;#xBB34;&amp;#xC2A8; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026; &amp;#xC774;&amp;#xB7F0; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xC801;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC131;&amp;#xCC30;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xB098; &amp;#xAC00;&amp;#xC838;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBC41;&amp;#xC0C8;&amp;#xAC00; &amp;#xD669;&amp;#xC0C8;&amp;#xB97C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &amp;#xB2E4;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC22;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C4; &amp;#xBAB0;&amp;#xB790;&amp;#xB294;&amp;#xB370; &amp;#xC9C0;&amp;#xAE08; &amp;#xBCF4;&amp;#xB2C8; &amp;#xC815;&amp;#xB9D0; &amp;#xBCC4;&amp;#xAC70; &amp;#xC5C6;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xD070; &amp;#xD2C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xACFC; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB97C; &amp;#xAC8C; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD754;&amp;#xD788; &amp;#xC544;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xC8E0;. &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xC695;&amp;#xC740; &amp;#xC55E;&amp;#xC130;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xB825;&amp;#xC740; &amp;#xC548; &amp;#xB530;&amp;#xB77C;&amp;#xC8FC;&amp;#xACE0; &amp;#xACB0;&amp;#xAD6D; &amp;#xC4F8;&amp;#xB370;&amp;#xC5C6;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD0C4;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB3CC;&amp;#xB2E4;&amp;#xB9AC;&amp;#xB3C4; &amp;#xB450;&amp;#xB4E4;&amp;#xACA8; &amp;#xBCF4;&amp;#xACE0; &amp;#xAC74;&amp;#xB108;&amp;#xB77C;.&lt;/p&gt;
&lt;p&gt; &amp;#xCD5C;&amp;#xC885; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xB450; &amp;#xBC88; &amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xCD5C;&amp;#xC885; &amp;#xAC80;&amp;#xC0AC;&amp;#xC758; &amp;#xAC80;&amp;#xC0AC;&amp;#xB3C4; &amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xC0AC;&amp;#xAC74; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xC27D;&amp;#xAC8C; &amp;#xD655;&amp;#xC2E0;&amp;#xC744; &amp;#xAC16;&amp;#xC9C4; &amp;#xC54A;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;No g&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC124;&amp;#xBB38; &amp;#xC870;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xBC88; &amp;#xB300;&amp;#xD68C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xBD88;&amp;#xD638;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xC2EC;&amp;#xD588;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xB124;&amp;#xC694;. &amp;#xC15C;&amp;#xB85D;&amp;#xD648;&amp;#xC988; &amp;#xC554;&amp;#xD638;( &amp;#xCDA4;&amp;#xCD94;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C; &amp;#xADF8;&amp;#xB9BC; &amp;#xC554;&amp;#xD638; )&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xB290;&amp;#xB08C;&amp;#xC73C;&amp;#xB85C; crypto&amp;#xC640; misc &amp;#xADF8; &amp;#xC0AC;&amp;#xC774; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xB824;&amp;#xACE0; &amp;#xD574; &amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. No g&amp;#xB77C;&amp;#xB294; &amp;#xC81C;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC27D;&amp;#xAC8C; &amp;#xD478;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB7EC;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xC0C1;&amp;#xCC9C;&amp;#xC678;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xB354;&amp;#xAD70;&amp;#xC694;. &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; misc&amp;#xB098; &amp;#xD480;&amp;#xBA74;&amp;#xC11C; &amp;#xBA38;&amp;#xB9AC; &amp;#xC2DD;&amp;#xD788;&amp;#xB824;&amp;#xACE0; &amp;#xBD24;&amp;#xB2E4;&amp;#xAC00; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xC0AC;&amp;#xC8C4;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8C4;&amp;#xC1A1;&amp;#xD574;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;2&amp;#xB144; &amp;#xC5F0;&amp;#xC18D; Christmas CTF&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548; &amp;#xC88B;&amp;#xC740; &amp;#xAE30;&amp;#xC5B5;&amp;#xB9CC; &amp;#xB0A8;&amp;#xB124;&amp;#xC694;. &amp;#xC62C;&amp;#xD574;&amp;#xB294; &amp;#xAF2D; &amp;#xC5EC;&amp;#xCE5C; &amp;#xC0AC;&amp;#xADC0;&amp;#xC5B4;&amp;#xC11C; Christmas CTF &amp;#xB9D0;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xC57C;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/03/idioth/christmasctf2020-review/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC544;&amp;#xC774;&amp;#xC528;&amp;#x2026; &amp;#xB204;&amp;#xAC00; &amp;#xC5EC;&amp;#xAE30;&amp;#xB2E4; &amp;#xC591;&amp;#xD30C;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xB2E4; &amp;#xB193;&amp;#xC740; &amp;#xAC70;&amp;#xC57C;!?&lt;/del&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/01/03/idioth/christmasctf2020-review/image6.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/01/03/idioth/christmasctf2020-review/">

  <title>[Daily-Life]  CTF 2020   - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-01-03 17:00" pubdate>
      2021 1 3 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      96
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Daily-Life]  CTF 2020  </h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xC0AC;&#xAC74;&#xC758;-&#xC804;&#xB9D0;"><a href="#&#xC0AC;&#xAC74;&#xC758;-&#xC804;&#xB9D0;" class="headerlink" title="&#xC0AC;&#xAC74;&#xC758; &#xC804;&#xB9D0;"></a>&#xC0AC;&#xAC74;&#xC758; &#xC804;&#xB9D0;</h1><p>&#xB9E4;&#xB144; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4;&#xC5D0; &#xC774;&#xBCA4;&#xD2B8; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC5F4;&#xB9AC;&#xB294; &#xC194;&#xB85C;&#xB4E4;&#xC744; &#xC704;&#xD55C;(?) &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF&#xC758; &#xC8FC;&#xCD5C;&#xB97C; &#xC774;&#xBC88;&#xC5D0; &#xC138;&#xC885;&#xB300;&#xD559;&#xAD50; &#xC815;&#xBCF4;&#xBCF4;&#xC548; &#xB3D9;&#xC544;&#xB9AC; SSG&#xC640; &#xD568;&#xAED8; &#xB9E1;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC6B0;&#xB9AC;&#xAC00; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xB41C;&#xB2E4;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xB3C4; &#xAC11;&#xC790;&#xAE30; &#xB4E4;&#xC5C8;&#xC8E0;. Fabu1ous&#xB294; &#xB9E1;&#xAC8C; &#xB41C; &#xACFC;&#xC815;&#xC744; &#xB208; &#xC55E;&#xC5D0;&#xC11C; &#xBAA9;&#xACA9;&#xD588;&#xC73C;&#xB098; idioth&#xACFC; L0ch&#xB294; &#xD1B5;&#xBCF4;&#xB97C; &#xBC1B;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<blockquote>
<p>??? : &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; &#xB54C; &#xBB50;&#xD558;&#xB0D0;<br>idioth : &#xB370;&#xC774;&#xD2B8;&#xC694;<br>??? : &#xC5EC;&#xC790; &#xCE5C;&#xAD6C; &#xC5C6;&#xC796;&#xC544;<br>idioth : &#xADF8;&#xB54C;&#xB294; &#xC788;&#xACA0;&#xC8E0;<br>??? : &#xBB38;&#xC81C;&#xB098; &#xB9CC;&#xB4E4;&#xC5B4;&#xB77C;<br>L0ch : &#xC804; &#xC788;&#xB294;&#xB370;&#xC6A9; &#x314E;&#x314E;<br>??? : &#xC54C; &#xBC14; &#xC544;&#xB2C8;&#xACE0;</p>
</blockquote>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image0.png" srcset="/img/loading.gif" alt></p>
<p>&#xBD88;&#xC548;&#xD55C; &#xC9C1;&#xAC10;&#xC740; &#xC5B8;&#xC81C;&#xB098; &#xC633;&#xC2B5;&#xB2C8;&#xB2E4;. &#x2018;&#xC6B0;&#xB9AC; &#xBB38;&#xC81C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xB3FC;&#x2019;&#xB97C; &#xB4E3;&#xC790;&#xB9C8;&#xC790; &#xC9C1;&#xAC10;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF&#xAD6C;&#xB098;&#x2026; &#xCC98;&#xC74C;&#xC5D4; &#xC778;&#xB2F9; &#xB450; &#xBB38;&#xC81C;&#xC529; &#xB9CC;&#xB4E4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xC0AC;&#xAC74;&#xC774; &#xD558;&#xB098; &#xBC8C;&#xC5B4;&#xC9C0;&#xB294;&#xB370;&#x2026;</p>
<p>&#xB370;&#xC774;&#xD130; &#xCC4C;&#xB9B0;&#xC9C0;&#xB97C; &#xB098;&#xAC00;&#xAE30;&#xB85C; &#xD588;&#xC5C8;&#xB294;&#xB370; &#xD300;&#xC7A5; &#xB140;&#xC11D;&#xC774; &#xBD84;&#xC57C;&#xB97C; &#xCC29;&#xAC01;&#xD574;&#xC11C; &#xC2E0;&#xCCAD;&#xC744; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB85C; &#xC778;&#xD574; &#xAC01; 3&#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xAE30;&#xB85C;&#x2026;&#x314B;&#x314B;&#x314B;&#x314B;</p>
<blockquote>
<p>idioth : &#xC598;&#xB4E4;&#xC544; &#xC6B0;&#xB9AC; &#xC138; &#xBB38;&#xC81C;&#xC529; &#xB9CC;&#xB4E4;&#xAE30;&#xB85C; &#xD588;&#xC5B4; &#x314E;&#x314E;<br>L0ch, Fabu1ous : ???<br>idioth : &#xB370;&#xC774;&#xD130; &#xCC4C;&#xB9B0;&#xC9C0; &#xC2E0;&#xCCAD; &#xBABB;&#xD568; &#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;</p>
</blockquote>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image1.png" srcset="/img/loading.gif" alt></p>
<p>&#xCC98;&#xC74C;&#xC5D0; &#xB9CC;&#xB4E4;&#xAE30;&#xB85C; &#xD55C; &#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD55C; &#xBC84;&#xADF8; &#xD074;&#xB798;&#xC2A4;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC;&#x2026;</p>
<ul>
<li>idioth<ul>
<li>rev : custom packer</li>
<li>web : cve-2020-9484 tomcat rce</li>
<li>misc : snake</li>
</ul>
</li>
<li>L0ch<ul>
<li>pwn : Windows pwnable uaf</li>
<li>pwn : Linux pwnable type confusion</li>
<li>rev : obfuscate</li>
</ul>
</li>
<li>Fabu1ous<ul>
<li>pwn : angr challenge</li>
<li>pwn : uninit stack</li>
<li>misc : &#xBBF8;&#xC815;</li>
</ul>
</li>
</ul>
<p>&#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; &#xB9CE;&#xC774; &#xBC14;&#xB00C;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xCF54;&#xB85C;&#xB098; &#xB54C;&#xBB38;&#xC5D0; &#xAC11;&#xC790;&#xAE30; &#xD559;&#xAE30;&#xAC00; 1&#xC8FC;&#xC77C; &#xB2F9;&#xACA8;&#xC9C0;&#xBA74;&#xC11C; 11&#xC6D4;&#xACFC; 12&#xC6D4; &#xCD08;&#xAC00; &#xD1B5;&#xC9F8;&#xB85C; &#xBC14;&#xBE60;&#xC9C8; &#xC904;&#xC740; &#xADF8;&#xB4E4;&#xC740; &#xBAB0;&#xB790;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xD559;&#xAE30;&#xAC00; &#xB05D;&#xB09C; &#xD6C4; &#xADF8;&#xB4E4;&#xC740; &#xB7A9;&#xC2E4;&#xC5D0; &#xAC07;&#xD600;&#xC11C; &#xADFC; 1&#xC8FC;&#xC77C;&#xC744; &#xBC24;&#xC0C8;&#xBA70; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xAE30;&#xC5D0; &#xBC15;&#xCC28;&#xB97C; &#xAC00;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xB300;&#xD68C; &#xC804;&#xB0A0; &#xADF8;&#xB4E4;&#xC758; &#xBAA8;&#xC2B5;</p>
<h1 id="idioth"><a href="#idioth" class="headerlink" title="idioth"></a>idioth</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. idioth&#xC785;&#xB2C8;&#xB2E4;. &#xBB50;&#x2026; &#xCC98;&#xC74C;&#xC5D0; &#xB300;&#xD68C;&#xB97C; &#xD55C;&#xB2E4; &#xD588;&#xC744; &#xB54C;&#xB294; &#xC880; &#xB9CE;&#xC774; &#xB2F9;&#xD669;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; 5&#xC6D4; &#xC911;&#xC21C;&#xC5D0; &#xC18C;&#xC9D1; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xC774;&#xC81C; &#xB9C9; &#xB2E4;&#xC2DC; &#xACF5;&#xBD80;&#xB97C; &#xC2DC;&#xC791;&#xD55C; &#xCC38;&#xC774;&#xB77C;&#xC11C;&#x2026; &#xCD9C;&#xC81C;&#xD558;&#xAE30; &#xC804;&#xAE4C;&#xC9C0; CTF&#xB97C; 2&#xAC1C; &#xC815;&#xB3C4; &#xB098;&#xAC14;&#xB294;&#xB370; &#xBB38;&#xC81C;&#xB97C; baby-rev &#xC815;&#xB3C4;&#xBC16;&#xC5D0; &#xBABB; &#xD480;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB54;&#xAC00; &#xC880; &#xB9CE;&#xC774; &#xBC14;&#xB010; &#xAC83; &#xAC19;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xD3EC;&#xB108;&#xBE14;&#xC744; &#xB0B4;&#xAE30;&#xC5D0;&#xB294; &#xAE30;&#xC5B5;&#xB3C4; &#xC5B4;&#xB834;&#xD48B;&#xD558;&#xACE0;&#x2026;</p>
<p>&#xC554;&#xD638; &#xACF5;&#xBD80;&#xB97C; &#xD574;&#xC57C;&#xACA0;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC740; &#xB298; &#xD558;&#xACE0; &#xC788;&#xC5C8;&#xB294;&#xB370; &#xCD5C;&#xADFC;&#xC5D0; &#xC5B4;&#xB5A4; &#xBB38;&#xC81C;&#xB4E4;&#xC774; &#xB9CE;&#xC740;&#xAC00; &#xBD24;&#xB354;&#xB2C8; &#xC554;&#xD638;&#xB791; &#xC811;&#xBAA9;&#xC744; &#xB9CE;&#xC774; &#xC2DC;&#xCF1C;&#xC11C; &#xB098;&#xC624;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xC77C;&#xB2E8; &#xC554;&#xD638;&#xB294; &#xB0B4;&#xAC00; &#xD560; &#xC904; &#xBAA8;&#xB974;&#xB2C8; &#xD328;&#xC2A4;&#x2026; &#xADF8;&#xB7FC; &#xBB50; &#xB9CC;&#xB4E4;&#xC9C0;? &#xD558;&#xB2E4;&#xAC00; &#xBCF5;&#xBB34; &#xC911;&#xC5D0; &#xD588;&#xB358; Custom Packer &#xC2A4;&#xD130;&#xB514;&#xAC00; &#xB5A0;&#xC62C;&#xB790;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC544;! &#xC774;&#xAC70;&#xB2E4;! &#xD328;&#xCEE4; &#xB531; &#xB300;!</p>
<p>&#xBB38;&#xC81C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xB41C;&#xB2E4;&#xB294; &#xC18C;&#xB9AC;&#xB97C; &#xB4E4;&#xC740; &#xD6C4; &#xC8FC;&#xC81C;&#xB97C; &#xB300;&#xCDA9; &#xC815;&#xD55C; &#xD6C4; &#xBC14;&#xB85C; &#xB2E4;&#xC74C; &#xB2EC;&#xBD80;&#xD130; &#xD328;&#xCEE4; &#xAC1C;&#xBC1C;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC14;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xD328;&#xCEE4; &#xAD00;&#xB828;&#xB41C; &#xBB38;&#xC81C;&#xAC00; &#xB098;&#xC624;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB294; &#xAC83;&#xC740;&#x2026; &#xB2E4;&#xB4E4; &#xC544;&#xC2DC;&#xC8E0;? (&#x314E;&#x314E;)</p>
<ol>
<li>64&#xBE44;&#xD2B8;&#xB85C; &#xB9CC;&#xB4E4;&#xC790;</li>
<li>&#xC5B4; &#xB0B4;&#xAC00; &#xADF8;&#xB54C; &#xC2A4;&#xD130;&#xB514;&#xD588;&#xB358; &#xAC74; 32&#xBE44;&#xD2B8;&#xB124;?</li>
<li>&#xB108;&#xBB34; &#xC61B;&#xB0A0; &#xAC70;&#xB124;? &#xAC8C;&#xB2E4;&#xAC00; &#xAC8C;&#xC2DC;&#xAE00;&#xB3C4; &#xC0AC;&#xB77C;&#xC84C;&#xB124;?</li>
<li>&#x2026;github&#xC5D0; &#xC62C;&#xB77C;&#xC640;&#xC788;&#xB294; &#xAC78; &#xBCF4;&#xACE0; &#xC5B4;&#xB5A4; &#xD750;&#xB984;&#xC73C;&#xB85C; &#xAC00;&#xBA74; &#xC88B;&#xC740; &#xC9C0; &#xBCF4;&#xC790;</li>
</ol>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC5F4;&#xC2EC;&#xD788; &#xC5F4;&#xC2EC;&#xD788; &#xD55C; &#xB2EC;&#xC5D0; &#xAC78;&#xCCD0;&#xC11C; &#xC644;&#xC131;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC5ED;&#xC2DC; &#xB09C; &#xD55C;&#xB2E4;&#xBA74; &#xD558;&#xB294; &#xB0A8;&#xC790;! &#xD558;&#xC9C0;&#xB9CC;&#x2026;</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image4.png" srcset="/img/loading.gif" alt></p>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xACC4;&#xC18D; &#xBCF4;&#xB294;&#xB370;&#xB3C4; &#xB3C4;&#xB300;&#xCCB4; &#xC5B4;&#xB514;&#xAC00; &#xBB38;&#xC81C;&#xC778;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xC544; &#xC2DC;&#xAC04;&#xC774; &#xC5C6;&#xB294;&#xB370; &#xC774;&#xC81C; &#xACFC;&#xC81C; &#xD3ED;&#xD48D;&#xC774; &#xBAB0;&#xB824;&#xC624;&#xACE0; &#xC788;&#xB294;&#xB370;&#x2026; &#xC5B4;&#xB5A1;&#xD558;&#xC9C0;?</p>
<p>&#xC77C;&#xB2E8; tomcat&#xBD80;&#xD130; &#xB9CC;&#xB4E4;&#xC790;&#x2026; tomcat &#xC790;&#xCCB4;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xC73C;&#xB2C8; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8; &#xAD6C;&#xD604;&#xD558;&#xACE0; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xAE30;&#xB2A5; &#xAD6C;&#xD604;&#xB9CC; &#xD558;&#xBA74; &#xB418;&#xB2C8;&#xAE4C; &#xAE08;&#xBC29; &#xD558;&#xACA0;&#xC9C0;? &#xC6F9; &#xD558;&#xB294; &#xC560;&#xB4E4;&#xC774; &#xB3C4;&#xC640;&#xC900;&#xB314;&#xC5B4;.</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xC751; &#xADF8;&#xB7F0;&#xAC70; &#xC5C6;&#xC5B4;~ &#xC6F9; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCF8;&#xAC70;&#xB77C;&#xACE4; &#xACF5;&#xBD80; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C; html, php&#xC640; django&#xB97C; &#xD1B5;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCF8; &#xAC83;&#xC774; &#xC804;&#xBD80;&#xB77C;&#xC11C; &#xB9E8; &#xB545;&#xC5D0; &#xD5E4;&#xB529;&#xC744; &#xD558;&#xBA74;&#xC11C; &#xAD6C;&#xD604;&#xC744; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; &#xD559;&#xAD50;&#xC5D0;&#xC11C; python &#xD559;&#xBD80; &#xC218;&#xC5C5; &#xC870;&#xAD50;&#xB3C4; &#xC9C4;&#xD589;&#xD574;&#xC11C; &#xBB54;&#xAC00; &#xD560; &#xC77C;&#xC774; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC558;&#xC8E0;(&#xD551;&#xACC4;&#xC57C;)</p>
<blockquote>
<p>&#xAE30;&#xC0C1; - &#xD558;&#xB8E8; &#xD55C; &#xC904; - &#xC870;&#xAD50; - &#xACFC;&#xC81C; - (&#xBE14;&#xB85C;&#xADF8; &#xAE00;) - &#xBB38;&#xC81C; &#xB9CC;&#xB4E4;&#xAE30;</p>
</blockquote>
<p>&#xC704;&#xC758; &#xC21C;&#xD658;&#xC744; &#xACC4;&#xC18D; &#xB3CC;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC89;&#xC73C;&#xB85C;&#xC758; &#xAD6C;&#xD604;&#xB3C4; &#xB05D;&#xB098;&#xACE0; &#xD30C;&#xC77C; &#xC5C5;&#xB85C;&#xB4DC; &#xB4F1;&#xC758; &#xAD6C;&#xD604;&#xB3C4; 11&#xC6D4; &#xB9D0;&#xC5D0; &#xB2E4; &#xB05D;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xD070; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC84;&#xC804;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xC54C;&#xB824; &#xC904; &#xAC83;&#xC774;&#xACE0; &#xC9C0;&#xAE08; &#xC0C1;&#xD0DC;&#xC5D0;&#xC120; session &#xD3F4;&#xB354;&#xC640; &#xBAA8;&#xB4E0; &#xAC83;&#xC774; &#xAC8C;&#xC2F1;&#xC774;&#xB2E4;.</p>
<p>&#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC0AC;&#xB78C;&#xB4E4;&#xACFC; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xD574;&#xBCF8; &#xB05D;&#xC5D0; LFI&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xB2E4; &#xC77D;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; path traversal &#xD544;&#xD130;&#xB9C1;&#xC744; &#xAC70;&#xB294; &#xAC8C; &#xC88B;&#xC744;&#xAE4C; &#xB9D0;&#xAE4C;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xADF8;&#xB798;&#xB3C4; <code>../</code> &#xAC19;&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xAC70;&#xB294; &#xAC78;&#xC5B4;&#xB193;&#xB294; &#xAC8C; &#xC88B;&#xC9C0; &#xC54A;&#xC744;&#xAE4C;?&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADFC;&#xB370; &#xC8FC;&#xBCC0;&#xC5D0;&#xC11C; &#xC5B4;&#xCC28;&#xD53C; &#xADF8;&#xB7F0; &#xAC70; &#xBCF4;&#xC774;&#xBA74; &#xC77C;&#xB2E8; &#xB54C;&#xB824; &#xB123;&#xACE0; &#xBCF4;&#xB2C8;&#xAE4C; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xAC70;&#xB294; &#xAC78;&#xC5B4;&#xB193;&#xB294; &#xAC8C; &#xC88B;&#xC544;.&#xB77C;&#xB294; &#xB9D0;&#xC744; &#xB4E3;&#xACE0; <code>gift</code> &#xBB38;&#xC81C;&#xAC00; &#xD0C4;&#xC0DD;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4; &#xB9CC;&#xB4E4;&#xC5C8;&#xC744; &#xB54C;&#xB294; &#xADF8;&#xB798;&#xB3C4; &#xC6F9; &#xCC98;&#xC74C; &#xB9CC;&#xB4E0; &#xAC83; &#xCE58;&#xACE0; &#xAD1C;&#xCC2E;&#xC740; &#xAC83; &#xAC19;&#xC740;&#xB370;?&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC744; &#xD588;&#xC73C;&#xB098;&#x2026; &#xC800;&#xC758; &#xC624;&#xB9CC;&#xD568;&#xC774;&#xC5C8;&#xC74C;&#xC744; &#xAE68;&#xB2EC;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC73C;&#xC73C;&#x2026; &#xC800;&#xB294; &#xAC8C;&#xC2F1;&#xC744; &#xCD5C;&#xB300;&#xD55C; &#xC904;&#xC600;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC9C0;&#xB9CC; &#xC81C;&#xAC00; &#xB9CC;&#xB4E4;&#xC5C8;&#xB358; &#xBB38;&#xC81C;&#xB77C;&#xC11C; &#xADF8;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4; &#x315C;&#x315C;&#x2026;</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xD070; &#xBB38;&#xC81C;&#xB294; <code>gift</code> &#xD558;&#xB098; &#xB9CC;&#xB4E4;&#xC5C8;&#xB294;&#xB370; &#xB300;&#xD68C;&#xAC00; &#xC77C;&#xC8FC;&#xC77C; &#xB0A8;&#xC558;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; &#xB9AC;&#xBC84;&#xC2F1; &#xBB38;&#xC81C;&#xB97C; &#xD558;&#xB098; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C;&#xC9C0;&#x2026; &#xADF8;&#xB0E5; &#xAC04;&#xB2E8;&#xD55C; &#xAC83; &#xB0B4;&#xC57C;&#xACA0;&#xB2E4;&#x2026; crackme &#xD558;&#xB098; &#xD574;&#xC57C;&#xC9C0;~ &#xD558;&#xACE0; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADFC;&#xB370; &#xBB54;&#xAC00; &#xB108;&#xBB34; &#xD5C8;&#xC804;&#xD574;&#xC11C; &#xACE0;&#xBBFC;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544; &#xBB54;&#xAC00; &#xC5C6;&#xB098;&#x2026; &#xD558;&#xB2E4;&#xAC00; &#xB531; &#xC0DD;&#xAC01;&#xC774; &#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC624; &#xC774;&#xC81C; &#xB9E5;&#xB3C4; ARM&#xC73C;&#xB85C; &#xB098;&#xC624;&#xB294;&#xB370; ARM &#xB9AC;&#xBC84;&#xC2F1; &#xD560;&#xAE4C;? &#x3131;&#x3131;&#x3131;&#x3131; arm &#xC5B4;&#xC148; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAC78;&#xB85C; &#xB0B4;&#xACE0;~ ida hexrays&#xB97C; &#xB9C9;&#xC544;&#xB193;&#xC790;. &#xC5B4;&#xCC28;&#xD53C; &#xC798;&#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC740; arm&#xB3C4; &#xAE08;&#xBC29; &#xBCF4;&#xC2E4; &#xD14C;&#xACE0; &#xD558;&#xB2C8;&#xAE4C; anti-hexrays&#xB294; &#xAE08;&#xBC29; &#xD478;&#xC2DC;&#xACA0;&#xC9C0;?</p>
<p>ida&#xC5D0;&#xC11C;&#xB294; &#xAE68;&#xC838;&#xC11C; &#xB098;&#xC624;&#xB294;&#xB370;&#x2026; &#xC65C; ghidra&#xC5D0;&#xC11C;&#xB294; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xB294; &#xAC78;&#xAE4C;&#x2026;?</p>
<p>??? : &#xC57C; &#xADF8;&#xB0E5; &#xD578;&#xB4DC; &#xB808;&#xC774;&#xB85C; &#xB0B4;&#xC790;</p>
<p>idioth : &#x3131; &#xC5B4;&#xCC28;&#xD53C; baby &#xC6A9;&#xC73C;&#xB85C; &#xB0B8; &#xAC70;&#xB2C8;&#xAE4C; &#xAD1C;&#xCC2E;&#xACA0;&#xC9C0;?</p>
<p>-<code>lock</code> &#xB05D;-</p>
<p>&#xC544; &#xC774;&#xC81C; snake &#xD558;&#xB098;&#xB9CC; &#xB0A8;&#xC558;&#xB124;&#xC694; &#x314E;&#x314E; misc &#xBB38;&#xC81C;&#xB77C;&#xC11C; &#xB108;&#xBB34; &#xBD80;&#xB2F4;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;~ &#xBC40; &#xAC8C;&#xC784; &#xC7AC;&#xBBF8;&#xB098;&#xAC8C; &#xD558;&#xB098; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C;&#xC9C0;<del>~</del>&#xD558;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xC640;&#xC911;&#xC5D0; &#xC55E;&#xC744; &#xBCF4;&#xB2C8;&#xAE4C; &#xC808;&#xB9DD;&#xC758; &#xAD6C;&#xB801;&#xD145;&#xC774;&#xC5D0; &#xBE60;&#xC9C4; &#xD55C; &#xB0A8;&#xC790;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image6.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>L0ch : &#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;&#xB098;&#xB9CC;&#xC775;&#xC2A4;&#xC548;&#xB3FC;</p>
</blockquote>
<p>&#xC55E;&#xC5D0;&#xC11C; &#xBCF4;&#xB294;&#xB370; &#xC9C4;&#xC9DC; &#xB108;&#xBB34; &#xBB34;&#xC12D;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xADF8;&#xB798;&#xC11C; &#xADF8;&#xB0E5; &#xC81C; misc &#xBB38;&#xC81C;&#xB97C; &#xC8FC;&#xACE0; reversing&#xC744; &#xC81C;&#xAC00; &#xB0B4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC38;&#xAC00;&#xD55C; &#xB300;&#xD68C; &#xC911; &#xD558;&#xB098;&#xC5D0;&#xC11C; angr&#xB85C; &#xD47C; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC5B4;&#xC11C; angr &#xBB38;&#xC81C;&#xB97C; &#xB0B4;&#xC790;. &#xADFC;&#xB370; &#xC774;&#xAC83;&#xB3C4; arm&#xC73C;&#xB85C; &#xB0B4;&#xBA74; &#xC7AC;&#xBC0C;&#xACA0;&#xB2F9;. &#xD558;&#xACE0; &#xD6C4;&#xB531; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADFC;&#xB370; arm&#xC5D0;&#xC11C;&#xB294; &#xC65C; simulation manager&#xB97C; &#xB3CC;&#xB824;&#xB3C4; &#xAC12;&#xC774; &#xC548; &#xB098;&#xC624;&#xC9C0;? &#xADF8;&#xB0E5; x64&#xB85C; &#xC644;&#xC131;&#xD558;&#xACE0; &#xB09C; &#xD6C4; L0ch&#xB97C; &#xBCF4;&#xB2C8; &#xBC40; &#xAC8C;&#xC784;&#xC744; &#xC644;&#xC131;&#xD558;&#xACE0; &#xC790;&#xAE30; type confusion &#xBABB; &#xB9CC;&#xB4E4; &#xAC83; &#xAC19;&#xC740;&#xB370; baby pwnable &#xBB50; &#xB0BC; &#xC9C0; &#xBB3C;&#xC5B4;&#xBCF4;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xADF8;&#xB798;&#xC11C; &#xADF8;&#xB0E5; &#xB358;&#xC838; &#xC92C;&#xC2B5;&#xB2C8;&#xB2E4;. arm rop &#xC7AC;&#xBC0C;&#xC744; &#xB4EF;? <code>baby_RudOlPh</code> &#xD0C4;&#xC0DD;~</p>
<p>&#xADFC;&#xB370; angr &#xBB38;&#xC81C;&#xB97C; &#xAC80;&#xC218;&#xD558;&#xACE0; &#xAC12;&#xC744; &#xC5F0;&#xC0B0;&#xD558;&#xB294; &#xB85C;&#xC9C1;&#xC744; &#xC218;&#xC815;&#xD558;&#xACE0; &#xB098;&#xB2C8;&#xAE4C; &#xC774;&#xC0C1;&#xD558;&#xAC8C; &#xAC12;&#xC774; &#xBC00;&#xB824;&#xC11C; &#xB098;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xC5D0; c++&#xB85C; &#xC9F0;&#xC5C8;&#xACE0; &#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xACC4;&#xC18D; &#xC218;&#xC815;&#xC744; &#xD588;&#xB294;&#xB370; input&#xC774; &#xC774;&#xC0C1;&#xD558;&#xAC8C; &#xB4E4;&#xC5B4;&#xAC00;&#xAC70;&#xB098; &#xD574;&#xC11C; &#xCF54;&#xB4DC;&#xAC00; &#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xAF2C;&#xC5EC;&#xBC84;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACB0;&#xAD6D; c&#xB85C; &#xC62E;&#xAE30;&#xAC8C; &#xB418;&#xC5C8;&#xACE0; c&#xB85C; &#xC62E;&#xACA8;&#xC11C; &#xB098;&#xC624;&#xB294; &#xAC12;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xC790; byte &#xBA87; &#xAC1C;&#xAC00; &#xC0AC;&#xB77C;&#xC9C0;&#xB354;&#xB77C;&#xACE0;&#xC694;.</p>
<p>&#xB300;&#xD68C;&#xB294; &#xB2F9;&#xC7A5; &#xB0B4;&#xC77C;&#xC774;&#xACE0; &#xAE09;&#xD558;&#xB2C8;&#xAE4C; &#xBC94;&#xC704;&#xAC00; &#xB118;&#xC5B4;&#xAC00;&#xC11C; &#xADF8;&#xB7F0;&#xAC00; &#xBCF4;&#xB2E4; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xADF8;&#xB0E5; &#xD06C;&#xAC8C; &#xC5F0;&#xC0B0;&#xD558;&#xB294; &#xB85C;&#xC9C1;&#xB4E4;&#xC744; &#xC9C0;&#xC6CC;&#xBC84;&#xB9AC;&#xACE0; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; <code>angrforge</code> &#xD0C4;&#xC0DD;. &#xC0AC;&#xC2E4; &#xC774; &#xBB38;&#xC81C;&#xB294; &#xC695;&#xBA39;&#xC744; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC190;&#xC73C;&#xB85C; &#xD478;&#xC2E0; &#xBD84; &#xACC4;&#xC2DC;&#xB358;&#xB370; &#xC9C4;&#xC9DC; &#xC8C4;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;&#x2026; &#xB2E4;&#xC74C;&#xC5D0; &#xBB38;&#xC81C; &#xB9CC;&#xB4E4; &#xC77C;&#xC774; &#xC0DD;&#xAE34;&#xB2E4;&#xBA74; &#xC774;&#xB7F0; <em>*</em> &#xAC19;&#xC740; &#xC758;&#xB3C4; &#xD30C;&#xC545;&#xC870;&#xCC28; &#xC548; &#xB418;&#xB294; &#xBB38;&#xC81C;&#xB294; &#xB9CC;&#xB4E4;&#xC9C0; &#xC54A;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xD68C;&#xB294; &#xC5EC;&#xCC28;&#xC800;&#xCC28; &#xC798; &#xB05D;&#xB0AC;&#xC9C0;&#xB9CC; &#xB9C8;&#xC74C;&#xC774; &#xBD88;&#xD3B8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB098;&#xB294; &#xB098;&#xB300;&#xB85C; &#xC5F4;&#xC2EC;&#xD788; &#xD588;&#xB294;&#xB370; &#xACB0;&#xACFC;&#xBB3C;&#xC774; &#xC88B;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xB2C8;&#xAE4C;&#xC694;. &#xC77C;&#xB2E8; &#xB0B4;&#xAC00; &#xC0DD;&#xAC01;&#xD55C; &#xB300;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <code>lock</code>&#xC774;&#xB098; <code>angrforge</code> &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xB294; &#xC2DC;&#xAC04;&#xC5D0; &#xCAD3;&#xACA8; &#xB85C;&#xC9C1;&#xC5D0; &#xB300;&#xD55C; &#xD070; &#xACE0;&#xBBFC; &#xC5C6;&#xC774; &#xB9CC;&#xB4E0; &#xBB38;&#xC81C;&#xB4E4;&#xC774;&#xB77C;&#xC11C; &#xB9C8;&#xC74C;&#xC5D0; &#xB4E4;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC70;&#xC758; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBB38;&#xC81C; &#xC81C;&#xC791; &#xC2DC;&#xAC04;&#xC744; <code>gift</code>&#xC5D0; &#xC3DF;&#xC558;&#xACE0;, &#xC2E4;&#xC81C; &#xC774;&#xB7EC;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC6B4;&#xC601;&#xB3FC;&#xC11C; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xBA74; &#xC774;&#xB807;&#xAC8C; &#xC811;&#xADFC;&#xD558;&#xBA74; &#xC7AC;&#xBC0C;&#xACA0;&#xB2E4;.&#xB77C;&#xB294; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB3C4; &#xC798; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADFC;&#xB370; &#xC774;&#xAC74; &#xCD9C;&#xC81C;&#xC790;&#xC758; &#xC0DD;&#xAC01;&#xC774;&#xC9C0; &#xCC38;&#xC5EC;&#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xC774; &#xADF8;&#xB807;&#xAC8C; &#xC0DD;&#xAC01; &#xC548; &#xD558;&#xC2E0;&#xB2E4;&#xBA74; &#xADF8;&#xAC8C; &#xB9DE;&#xB294; &#xAC70;&#xC8E0;.</p>
<p>&#xB300;&#xD68C;&#xAC00; &#xB05D;&#xB098;&#xACE0; &#xB098;&#xC11C; &#xC2EC;&#xC57C; &#xBC84;&#xC2A4;&#xB97C; &#xD0C0;&#xACE0; &#xC9D1;&#xC73C;&#xB85C; &#xCD9C;&#xBC1C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC70;&#xC758; 40&#xC2DC;&#xAC04; &#xB118;&#xAC8C; &#xAE68;&#xC5B4; &#xC788;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xB124;&#xC694;. &#xBC84;&#xC2A4;&#xC5D0;&#xC11C; &#xC7A0;&#xB3C4; &#xC548; &#xC624;&#xB354;&#xAD70;&#xC694;. &#xADF8;&#xB0E5; &#xD604;&#xD0C0;&#xAC00; &#xC138;&#xAC8C; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#x2026; &#xB0B4;&#xAC00; &#xC9C4;&#xC9DC; &#xBABB;&#xD558;&#xB294;&#xAD6C;&#xB098;. &#xB0B4;&#xAC00; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xC774;&#xB098; &#xB2E4;&#xB978; &#xBB38;&#xC81C;&#xB4E4;&#xC744; &#xD480;&#xAC70;&#xB098; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C; &#xBD24;&#xB358; &#xB85C;&#xC9C1;&#xB4E4;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xC9C0;&#xB3C4; &#xBABB;&#xD558;&#xACE0;, &#xC0DD;&#xAC01;&#xC758; &#xB113;&#xC774;&#xB098; &#xAE4A;&#xC774;&#xB3C4; &#xBD80;&#xC871;&#xD558;&#xAD6C;&#xB098;. &#xB0B4;&#xAC00; &#xC0DD;&#xAC01;&#xD55C; &#xAC83;&#xBCF4;&#xB2E4; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; &#xB354; &#xB113;&#xC740; &#xAC83;&#xC744; &#xBCF4;&#xB294;&#xAD6C;&#xB098;.</p>
<p>&#xB3CC;&#xC774;&#xCF1C; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xBD24;&#xC744; &#xB54C; &#xC8FC;&#xC81C;&#xB098; &#xCEE8;&#xC149;&#xC774; &#xC7AC;&#xBC0C;&#xACE0; &#xC2E0;&#xC120;&#xD55C; &#xAC83;&#xC5D0;&#xB9CC; &#xB108;&#xBB34; &#xC2E0;&#xACBD; &#xC4F0;&#xC9C0; &#xC54A;&#xC558;&#xB098;? &#xB0B4;&#xAC00; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xADF8; &#xC7AC;&#xBBF8;&#xB97C; &#xC628;&#xC804;&#xD788; &#xC804;&#xB2EC;&#xD560; &#xB9CC;&#xD07C;&#xC758; &#xAE30;&#xBCF8; &#xBCA0;&#xC774;&#xC2A4;&#xAC00; &#xB418;&#xB294;&#xAC00;?&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9D1;&#xC5D0; &#xB3CC;&#xC544;&#xC640;&#xC11C; &#xC0E4;&#xC6CC;&#xD558;&#xACE0; &#xB204;&#xC6E0;&#xB294;&#xB370; &#xD574;&#xAC00; &#xB730; &#xB54C;&#xAE4C;&#xC9C0; &#xC7A0;&#xC744; &#xBABB; &#xC7A4;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC7A1;&#xC0DD;&#xAC01;&#xC774; &#xB9CE;&#xC544;&#xC11C; &#xC77C;&#xB2E8; &#xC9C0;&#xCCD0;&#xC11C; &#xC7A0;&#xB4E4;&#xACE0; &#xC77C;&#xC5B4;&#xB098;&#xB2C8; &#xC0C1;&#xC704;&#xAD8C; &#xD300;&#xB4E4; &#xB77C;&#xC5C5;&#xC774; &#xAE30;&#xB300;&#xAC00; &#xB418;&#xB354;&#xAD70;&#xC694;. <code>lock</code>&#xC774;&#xB791; <code>angrforge</code>&#xB294; &#xBAA8;&#xB974;&#xACA0;&#xACE0; <code>gift</code>&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD478;&#xC168;&#xACE0; &#xC5B4;&#xB5BB;&#xAC8C; &#xB290;&#xB07C;&#xC168;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xC0DD;&#xAC01;&#xC774; &#xC815;&#xB9D0; &#xCEF8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB77C;&#xC5C5;&#xC744; &#xB2E4; &#xBCF4;&#xACE0; &#xB098;&#xC11C; &#xB77C;&#xC5C5;&#xC744; &#xB2E4; &#xB72F;&#xC5B4;&#xACE0;&#xCCE4;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC880; &#xB354; &#xB0B4;&#xAC00; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xACFC; &#xACE0;&#xBBFC;&#xD588;&#xB358; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xADF8;&#xB9AC;&#xACE0; 2021&#xB144;&#xC5D0;&#xB294; &#xC5B4;&#xB5A4; &#xC2DD;&#xC73C;&#xB85C; &#xACF5;&#xBD80;&#xD558;&#xBA74; &#xC88B;&#xC744;&#xC9C0; &#xC774;&#xBC88; &#xAE30;&#xD68C;&#xC5D0; &#xC81C;&#xAC00; &#xBD80;&#xC871;&#xD588;&#xB358; &#xAC83;, &#xBD80;&#xC871;&#xD568;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xC560;&#xC368; &#xC678;&#xBA74;&#xD558;&#xB358; &#xAC83;&#xB4E4;&#xC5D0; &#xC9C1;&#xBA74;&#xD558;&#xAC8C; &#xB418;&#xC5B4;&#xC11C; &#xC88B;&#xC740; &#xACBD;&#xD5D8;&#xC774;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xB4E4; &#xBBF8;&#xCC9C;&#xD55C;(?) &#xBB38;&#xC81C; &#xD478;&#xC2DC;&#xB290;&#xB77C; &#xACE0;&#xC0DD; &#xB9CE;&#xC73C;&#xC168;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC7AC;&#xBC0C;&#xAC8C; &#xC990;&#xAE30;&#xC168;&#xB2E4;&#xBA74; &#xC815;&#xB9D0; &#xC88B;&#xC558;&#xC744; &#xD150;&#xB370;&#x2026;! &#xB2E4;&#xB4E4; &#xC0C8;&#xD574; &#xBCF5; &#xB9CE;&#xC774; &#xBC1B;&#xC73C;&#xC138;&#xC694;!</p>
<h1 id="L0ch"><a href="#L0ch" class="headerlink" title="L0ch"></a>L0ch</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. L0ch&#xC785;&#xB2C8;&#xB2E4;! CTF &#xBB38;&#xC81C; &#xCD9C;&#xC81C; &#xACBD;&#xD5D8;&#xC774;&#xB77C;&#xACE0;&#xB294; &#xB3D9;&#xC544;&#xB9AC; &#xB0B4;&#xBD80; CTF &#xBC16;&#xC5D0; &#xC5C6;&#xB358; &#xC800;&#xC5D0;&#xAC8C; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC18C;&#xC2DD;&#xC744; &#xB4E4;&#xC5C8;&#xC744; &#xB54C;..</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image7.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image8.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>??????? &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xB77C;&#xAD6C;&#xC694;???</p>
</blockquote>
<p>&#xC9C4;&#xC9DC; &#xB531; &#xC800; &#xD45C;&#xC815;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC70;&#xC9D3;&#xB9D0; &#xC544;&#xB2C8;&#xACE0; &#xC9C4;&#xC9DC;&#xB85C;&#xC694;.</p>
<p>&#xAD6D;&#xBC29;&#xC758; &#xC758;&#xBB34;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB290;&#xB77C; &#xBC31;&#xC9C0;&#xAC00; &#xB41C; &#xBA38;&#xB9AC;&#xB85C; &#xC5F4;&#xC2EC;&#xD788; &#xB530;&#xB77C;&#xAC00;&#xACE0; &#xC788;&#xB358; &#xC640;&#xC911;&#xC5D0; (&#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xAD70;&#xC778;&#xB4E4; &#xD654;&#xC774;&#xD305; &#x3160;&#x3160;) CTF &#xBB38;&#xC81C;&#xB97C; &#xADF8;&#xAC83;&#xB3C4; &#xC138; &#xBB38;&#xC81C;&#xB098; &#xB9CC;&#xB4E4;&#xB77C;&#xB2C8;&#xC694;.. &#xC544;&#xBB34;&#xD2BC; &#xB370;&#xC774;&#xD130; &#xCC4C;&#xB9B0;&#xC9C0; &#xC2E0;&#xCCAD; &#xBABB;&#xD55C; &#xD300;&#xC7A5; &#xD0D3;&#xC784; @idioth @idioth @idioth</p>
<p>&#xADF8;&#xB807;&#xAC8C; &#xC5F4;&#xC2EC;&#xD788; &#xCD5C;&#xADFC; CTF &#xD2B8;&#xB80C;&#xB4DC;&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xACE0; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xD2C0;&#xC744; &#xC7A1;&#xC544;&#xAC00;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xBB38;&#xC81C;&#xC600;&#xB358; address_book &#xC774; &#xB098;&#xC624;&#xAC8C; &#xB41C; &#xBC30;&#xACBD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB54C;&#xB294; &#xD558;&#xB8E8; &#xD55C; &#xC904;&#xC744; &#xC4F0;&#xAE30; &#xC704;&#xD574; &#xB5A0;&#xB3CC;&#xC544;&#xB2E4;&#xB2C8;&#xB358; &#xC911; Chrome&#xC758; &#xACF5;&#xC720; &#xD3EC;&#xC778;&#xD130; &#xAD00;&#xB828; UAF &#xCDE8;&#xC57D;&#xC810; &#xC815;&#xBCF4;&#xB97C; &#xBCF4;&#xAC8C; &#xB418;&#xC5C8;&#xC8E0;. </p>
<p>&#xAC70;&#xAE30;&#xC5D0; &#xC601;&#xAC10;&#xC744; &#xBC1B;&#xC544; &#xACF5;&#xC720; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xCEE4;&#xC2A4;&#xD140;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD574;&#xC11C; &#xAC70;&#xAE30;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCFC;&#xAE4C;? </p>
<ul>
<li>MS tuesday patch&#xC758; diff &#xD328;&#xCE58;&#xB97C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xC801;&#xC6A9;&#xD574; binary diffing&#xC73C;&#xB85C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD574;&#xBCFC;&#xAE4C;? </li>
</ul>
<p>&#xC774;&#xB807;&#xAC8C; &#xD574;&#xC11C; &#xB098;&#xC628; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC0AC;&#xB78C; &#xC778;&#xC0DD;&#xC774; &#xACC4;&#xD68D;&#xB300;&#xB85C;&#xB9CC; &#xB420; &#xB9AC;&#xAC00; &#xC788;&#xB098;&#xC694; &#x314E;&#x314E;</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image9.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB38;&#xC81C;&#xB294; &#xC81C;&#xAC00; &#xC708;&#xB108;&#xBE14; &#xACBD;&#xD5D8;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC744; &#xD558;&#xBA74;&#xC11C; &#xC6D0;&#xB370;&#xC774; &#xBA87; &#xBC88; &#xBD84;&#xC11D;&#xD574;&#xBCF8; &#xAC8C; &#xC804;&#xBD80;&#xC778; &#xC800;&#xC5D0;&#xAC8C; &#xCDE8;&#xC57D;&#xC810; &#xC124;&#xACC4;&#xBD80;&#xD130; &#xC775;&#xC2A4;&#xAE4C;&#xC9C0; &#xD55C;&#xB2E4;? &#xBA58;&#xD0C8;&#xC774; &#xC544;&#xC8FC; &#xACF1;&#xAC8C; &#xAC08;&#xB9B4; &#xAC70;&#xB77C;&#xB294; &#xAC78; &#xC2DC;&#xC791;&#xBD80;&#xD130; &#xC608;&#xAC10;&#xD588;&#xC8E0;.</p>
<p>&#xC6B0;&#xC120; C++&#xC758; &#xACF5;&#xC720; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB824;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; C++&#xC744; &#xC368;&#xC57C; &#xD558;&#xB294;&#xB370; &#xAE30;&#xBCF8;&#xC801;&#xC778; OOP &#xAC1C;&#xB150;&#xC774; &#xBD80;&#xC871;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xB358; &#xC911; &#xCF54;&#xB4DC; &#xB9AC;&#xBDF0;&#xB97C; &#xD574;&#xBCF4;&#xB2C8;&#xAE4C; &#xC9C4;&#xC9DC; &#xAC1C;&#xD310; &#xC624; &#xBD84; &#xC804;&#xC774;&#xC5C8;&#xB294;&#xB370; &#xB354;&#xD55C; &#xBB38;&#xC81C;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xACE0;&#xCCD0;&#xC57C; &#xD560;&#xC9C0;&#xB97C; &#xBAB0;&#xB790;&#xC2B5;&#xB2C8;&#xB2E4;..   &#xBD84;&#xC11D;&#xD558;&#xC2DC;&#xBA74;&#xC11C; &#xC774;&#xAC70; &#xC65C; &#xC774;&#xB807;&#xAC8C; &#xC9DC; &#xB1A8;&#xC9C0; &#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xC5C8;&#xC744; &#xD150;&#xB370;, &#xB2E4; &#xBD80;&#xC871;&#xD55C; &#xC800;&#xC758; &#xAC1C;&#xBC1C;&#xC2E4;&#xB825; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.. </p>
<p>&#xB610; &#xD558;&#xB098; &#xBB38;&#xC81C;&#xB294;.. </p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image10.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xC544;&#xB2C8; &#xB2E4; &#xB9CC;&#xB4E4;&#xC5B4;&#xB193;&#xACE0; &#xC775;&#xC2A4;&#xAC00; &#xC65C; &#xC548;&#xB418;&#xB294;&#xB370;!!!!!!!!!!!!!!!!!!!!!!!!!!</p>
</blockquote>
<p>&#xC6D0;&#xB798; &#xC775;&#xC2A4;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xB294; &#xACFC;&#xC815; &#xC911; &#xD558;&#xB098;&#xC600;&#xB358; <code>flag.txt</code> &#xD30C;&#xC77C; open&#xC744; &#xD568;&#xC218;&#xAC00; &#xACC4;&#xC18D; <code>&#xC751; &#xD30C;&#xC77C; &#xBABB; &#xC5F4;&#xC5C8;&#xC5B4; &#x314B;&#x314B;</code> &#xB97C; &#xBC49;&#xB294;&#xB370; &#xC774;&#xAC8C; &#xBB34;&#xC2A8; &#xACBD;&#xC6B0;&#xC9C0;? &#xC65C; &#xD30C;&#xC77C;&#xC744; &#xBABB; &#xC5EC;&#xB294; &#xAC70;&#xC9C0;?? &#xD63C;&#xC7A3;&#xB9D0;&#xD558;&#xBA74;&#xC11C; &#xC695;&#xB3C4; &#xD574;&#xBCF4;&#xACE0; &#xB2EC;&#xB798;&#xB3C4; &#xBCF4;&#xACE0; &#xC5F4;&#xC2EC;&#xD788; &#xC0BD;&#xC9C8;&#xC744; &#xD588;&#xC9C0;&#xB9CC; &#xC6D0;&#xC778;&#xC744; &#xCC3E;&#xC9C0; &#xBABB;&#xD574; &#xACB0;&#xAD6D; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; <code>flag.txt</code> &#xB97C; open&#xB9CC; &#xD558;&#xACE0; &#xC775;&#xC2A4; &#xACFC;&#xC815; &#xC911; ROP &#xCCB4;&#xC778;&#xC5D0;&#xC11C; open &#xACFC;&#xC815;&#xC744; &#xBE7C;&#xACE0; file descriptor&#xB97C; &#xC774;&#xC6A9;&#xD574; flag&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD0C0;&#xD611;&#xC744; &#xBCFC; &#xC218;&#xBC16;&#xC5D0; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xD6C4;&#xC77C;&#xB2F4;<br>idioth : &#x314B;&#x314B;&#x314B;&#x314B; &#xB108; address book &#xC775;&#xC2A4; &#xD560; &#xB54C; &#xC9C4;&#xC9DC; &#xBB34;&#xC11C;&#xC6E0;&#xB358; &#xAC70; &#xC544;&#xB0D0;<br>&#xBCF8;&#xC778; : ??? &#xC65C;&#xC694; &#xB098; &#xC65C;<br>idioth : &#xB204;&#xAD6C; &#xD558;&#xB098; &#xAC78;&#xB9AC;&#xBA74; &#xC9C4;&#xC9DC; &#xC8FD;&#xB294;&#xB2E8; &#xD45C;&#xC815;&#xC774;&#xC5C8;&#xC5B4;<br>Fabu1ous : &#x3147;&#x3148;<br>&#xBCF8;&#xC778; :</p>
</blockquote>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4E0; &#xC774;&#xC720;&#xAC00; diff patch&#xB97C; &#xC774;&#xC6A9;&#xD55C; binary diffing&#xC73C;&#xB85C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC758;&#xB3C4;&#xD55C; &#xAC70;&#xC9C0;&#xB9CC;.. &#xACC4;&#xD68D;&#xC5D0; &#xCC28;&#xC9C8;&#xC774; &#xC0DD;&#xACA8; diff patch&#xB3C4; &#xC801;&#xC6A9;&#xC744; &#xBABB;&#xD574; &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC88B;&#xC9C0; &#xC54A;&#xC740; &#xD004;&#xB9AC;&#xD2F0;&#xC758; &#xC544;&#xC26C;&#xC6B4; &#xBB38;&#xC81C;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;&#x2026; </p>
<p>&#xADF8;&#xB807;&#xAC8C; &#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xACE0; &#xBCF4;&#xB2C8;,  &#xC65C; &#xC2DC;&#xC791;&#xB3C4; &#xC548; &#xD55C; &#xB450; &#xBB38;&#xC81C;&#xAC00; &#xB0A8;&#xC544;&#xC788;&#xACE0; &#xC800;&#xB294; &#xAE30;&#xB9D0;&#xACE0;&#xC0AC;&#xB97C; &#xB208;&#xC55E;&#xC5D0; &#xB450;&#xACE0; &#xC788;&#xB294; &#xAC78;&#xAE4C;&#xC694;?</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image11.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image12.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xC800;&#xB294; &#xADF8;&#xB807;&#xAC8C;.. &#xD559;&#xC810;&#xC744; &#xB193;&#xC544;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;</p>
</blockquote>
<p>&#xD559;&#xC810;&#xC744; &#xD3EC;&#xAE30;&#xD55C; &#xB300;&#xAC00;&#xB85C; &#xB098;&#xBA38;&#xC9C0; baby_RudOlPh&#xC640; picky_eater&#xB97C; &#xAD6C;&#xC0C1;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <em><del>&#xB4F1;&#xAC00;&#xAD50;&#xD658;&#xC758; &#xBC95;&#xCE59;</del></em></p>
<p>picky_eater&#xB294; idioth &#xD300;&#xC7A5;&#xB2D8;&#xC758; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC3D9; &#xBE7C;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. address book&#xACFC; &#xACE0;&#xAD70;&#xBD84;&#xD22C;&#xD558;&#xACE0;&#xC788;&#xB358; &#xC800;&#xB97C; &#xBD88;&#xC30D;&#xD558;&#xAC8C; &#xBD24;&#xC5C8;&#xB098;&#xBD10;&#xC694;. &#x201C;&#xC774;&#xAC70; &#xB124;&#xAC00; &#xD560;&#xB798;?&#x201D; &#xB77C;&#xBA70; snake &#xAC8C;&#xC784; &#xCEE8;&#xC149;&#xC758; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC8FC;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xADF8; &#xC815;&#xB3C4;&#xB85C; &#xBD88;&#xC30D;&#xD574; &#xBCF4;&#xC600;&#xB098;?;; &#xC544;&#xBB34;&#xD2BC; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4; &#x314E;&#x314E;<br>&#xADF8;&#xB798;&#xB3C4; &#xB9CC;&#xB4E4; &#xB550; &#xC7AC;&#xBC0C;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5C8;&#xB358; &#xBB38;&#xC81C;&#xC778; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9; baby_RudOlPh&#xB294; &#xB450; &#xC904;&#xB85C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<blockquote>
<p>??? : (&#xD68C;&#xC758; &#xB3C4;&#xC911;) &#xB2D8;&#xB4E4; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8;&#xAE4C; &#xB274;&#xBE44;&#xC6A9; &#xD3EC;&#xB108;&#xBE14; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xB294;&#xB370;&#xC694;?</p>
</blockquote>
<p>&#xADF8;&#xB798;&#xC11C; &#xB9CC;&#xB4E4;&#xAC8C; &#xB41C; ARM(AArch64) ROP &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB0E5; &#xB0B4;&#xBA74; &#xC7AC;&#xBBF8;&#xC5C6;&#xC796;&#xC544;&#xC694;! &#xADF8;&#xB798;&#xC11C; ARM&#xC744; &#xB07C;&#xC5B9;&#xC5C8;&#xC8E0;</p>
<p>(&#xC0AC;&#xC2E4; &#xAE30;&#xAC04; &#xB0B4;&#xC5D0; &#xC6D0;&#xB798; &#xC0DD;&#xAC01;&#xD588;&#xB358; type confusion &#xBB38;&#xC81C;&#xB97C; &#xBABB; &#xB9CC;&#xB4E4; &#xAC83; &#xAC19;&#xC544;&#xC11C; &#xB274;&#xBE44;&#xBB38;&#xC81C; &#xB0C8;&#xB2E4;&#xB294; &#xAC74; &#xC548; &#xBE44;&#xBC00;)</p>
<p>&#xC815;&#xB9AC;&#xD558;&#xACE0; &#xBCF4;&#xB2C8;&#xAE4C; &#xB354; &#xC798;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC74C;&#xC5D0;&#xB3C4; &#xADF8;&#xB7EC;&#xC9C0; &#xBABB;&#xD574; &#xC544;&#xC26C;&#xC6B4; &#xAC10;&#xC815;&#xC774; &#xB9CE;&#xC774; &#xB0A8;&#xB294; &#xB300;&#xD68C;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xC774; &#xB4DC;&#xB124;&#xC694;. &#xB098;&#xC911;&#xC5D0; &#xB2E4;&#xB978; CTF&#xC5D0; &#xBB38;&#xC81C;&#xB97C; &#xCD9C;&#xC81C;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xD68C;&#xAC00; &#xC62C;&#xC9C4; &#xBAA8;&#xB974;&#xACA0;&#xC9C0;&#xB9CC; &#xAE30;&#xD68C;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; &#xB354; &#xB9CE;&#xC774;, &#xCCA0;&#xC800;&#xD558;&#xAC8C; &#xC900;&#xBE44;&#xD574;&#xC11C; &#xC88B;&#xC740; &#xD004;&#xB9AC;&#xD2F0;&#xC758; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB178;&#xB825;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD80;&#xC871;&#xD55C; &#xC81C; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xC8FC;&#xC2E0; &#xBAA8;&#xB4E0; &#xCC38;&#xAC00;&#xC790; &#xC5EC;&#xB7EC;&#xBD84;&#xB4E4;&#xAED8; &#xAC10;&#xC0AC;&#xC758; &#xB9D0;&#xC500;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;..!</p>
<h1 id="Fabu1ous"><a href="#Fabu1ous" class="headerlink" title="Fabu1ous"></a>Fabu1ous</h1><ul>
<li>Oil-system &amp; Match-maker</li>
</ul>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image13.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC84;&#xADF8; &#xC7A1;&#xB294; &#xAC74; &#xC815;&#xB9D0; &#xD798;&#xB4E0; &#xC791;&#xC5C5;&#xC774;&#xAD70;&#xC694;. &#xB300;&#xD68C; &#xB54C; oil-system&#xC758; &#xD480;&#xC774; &#xC218;&#xAC00; 20&#xC774;&#xB358;&#xB370; &#xC544;&#xB9C8; &#xBAA8;&#xB450; &#xC5B8;&#xC778;&#xD150;&#xB514;&#xB4DC;&#xC77C;&#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. Match-maker&#xB3C4; &#xBA54;&#xBAA8;&#xB9AC; leak &#xC911; &#xC5B8;&#xC778;&#xD150;&#xB514;&#xB4DC;&#xAC00; &#xD55C; &#xAC1C; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC194;&#xC9C1;&#xD788; &#xC544;&#xC8FC; &#xC870;&#xAE08; &#xC5B5;&#xC6B8;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xADF8;&#xAC8C; &#xBB34;&#xC2A8; &#xC758;&#xBBF8;&#xAC00; &#xC788;&#xACA0;&#xC2B5;&#xB2C8;&#xAE4C;&#x2026; &#xC774;&#xB7F0; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD55C; &#xC774;&#xC720;&#xB97C; &#xC801;&#xC5B4;&#xBCF4;&#xACE0; &#xC131;&#xCC30;&#xC758; &#xC2DC;&#xAC04;&#xC774;&#xB098; &#xAC00;&#xC838;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<ol>
<li><p>&#xBC41;&#xC0C8;&#xAC00; &#xD669;&#xC0C8;&#xB97C; &#xB530;&#xB77C;&#xAC00;&#xBA74; &#xB2E4;&#xB9AC;&#xAC00; &#xCC22;&#xC5B4;&#xC9C4;&#xB2E4;</p>
<p> &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4; &#xB54C;&#xAE4C;&#xC9C4; &#xBAB0;&#xB790;&#xB294;&#xB370; &#xC9C0;&#xAE08; &#xBCF4;&#xB2C8; &#xC815;&#xB9D0; &#xBCC4;&#xAC70; &#xC5C6;&#xB294; &#xBB38;&#xC81C;&#xB354;&#xAD70;&#xC694;. &#xD070; &#xD2C0;&#xB9CC; &#xBCF4;&#xBA74; &#xB9AC;&#xD134; &#xAC12;&#xC744; &#xC870;&#xC791;&#xD574; <code>win()</code> &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB4E4;&#xACFC; &#xD06C;&#xAC8C; &#xB2E4;&#xB97C; &#xAC8C; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD754;&#xD788; &#xC544;&#xB294; &#xB9CC;&#xD07C; &#xBCF4;&#xC778;&#xB2E4;&#xACE0; &#xD558;&#xC8E0;. &#xC5B4;&#xB824;&#xC6B4; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xACA0;&#xB2E4;&#xB294; &#xC758;&#xC695;&#xC740; &#xC55E;&#xC130;&#xC9C0;&#xB9CC; &#xC2E4;&#xB825;&#xC740; &#xC548; &#xB530;&#xB77C;&#xC8FC;&#xACE0; &#xACB0;&#xAD6D; &#xC4F8;&#xB370;&#xC5C6;&#xC774; &#xBCF5;&#xC7A1;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xD0C4;&#xC0DD;&#xD55C; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>&#xB3CC;&#xB2E4;&#xB9AC;&#xB3C4; &#xB450;&#xB4E4;&#xACA8; &#xBCF4;&#xACE0; &#xAC74;&#xB108;&#xB77C;.</p>
<p> &#xCD5C;&#xC885; &#xAC80;&#xC0AC;&#xD558;&#xC138;&#xC694;. &#xB450; &#xBC88; &#xD558;&#xC138;&#xC694;. &#xCD5C;&#xC885; &#xAC80;&#xC0AC;&#xC758; &#xAC80;&#xC0AC;&#xB3C4; &#xD558;&#xC138;&#xC694;. &#xC774;&#xBC88; &#xC0AC;&#xAC74; &#xC774;&#xD6C4;&#xB85C; &#xC5B4;&#xB5A4; &#xC77C;&#xC774;&#xB4E0; &#xC27D;&#xAC8C; &#xD655;&#xC2E0;&#xC744; &#xAC16;&#xC9C4; &#xC54A;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<ul>
<li>No g</li>
</ul>
<p>&#xC124;&#xBB38; &#xC870;&#xC0AC;&#xC5D0; &#xC758;&#xD558;&#xBA74; &#xC774;&#xBC88; &#xB300;&#xD68C;&#xC5D0;&#xC11C; &#xD638;&#xBD88;&#xD638;&#xAC00; &#xAC00;&#xC7A5; &#xC2EC;&#xD588;&#xB358; &#xBB38;&#xC81C;&#xB124;&#xC694;. &#xC15C;&#xB85D;&#xD648;&#xC988; &#xC554;&#xD638;( &#xCDA4;&#xCD94;&#xB294; &#xC0AC;&#xB78C; &#xADF8;&#xB9BC; &#xC554;&#xD638; )&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xB290;&#xB08C;&#xC73C;&#xB85C; crypto&#xC640; misc &#xADF8; &#xC0AC;&#xC774; &#xC5B4;&#xB518;&#xAC00;&#xC758; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E4;&#xB824;&#xACE0; &#xD574; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. No g&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC5D0;&#xC11C; &#xD78C;&#xD2B8;&#xB97C; &#xC5BB;&#xC5B4; &#xC27D;&#xAC8C; &#xD478;&#xC2E0; &#xBD84;&#xB4E4;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xADF8;&#xB7EC;&#xC9C0; &#xBABB;&#xD558;&#xACE0; &#xAE30;&#xC0C1;&#xCC9C;&#xC678;&#xD55C; &#xC0BD;&#xC9C8;&#xC744; &#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xB3C4; &#xC788;&#xB354;&#xAD70;&#xC694;. &#xAC00;&#xBCCD;&#xAC8C; misc&#xB098; &#xD480;&#xBA74;&#xC11C; &#xBA38;&#xB9AC; &#xC2DD;&#xD788;&#xB824;&#xACE0; &#xBD24;&#xB2E4;&#xAC00; &#xACE0;&#xD1B5;&#xBC1B;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xAED8; &#xC0AC;&#xC8C4;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#x314E;&#x314E;</p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image14.png" srcset="/img/loading.gif" alt></p>
<p>&#xC8C4;&#xC1A1;&#xD574;&#xC694; &#x3160;&#x3160;&#x3160;&#x3160;&#x3160;</p>
<p>2&#xB144; &#xC5F0;&#xC18D; Christmas CTF&#xC5D0; &#xB300;&#xD574; &#xC548; &#xC88B;&#xC740; &#xAE30;&#xC5B5;&#xB9CC; &#xB0A8;&#xB124;&#xC694;. &#xC62C;&#xD574;&#xB294; &#xAF2D; &#xC5EC;&#xCE5C; &#xC0AC;&#xADC0;&#xC5B4;&#xC11C; Christmas CTF &#xB9D0;&#xACE0; &#xB370;&#xC774;&#xD2B8;&#xD558;&#xB7EC; &#xAC00;&#xC57C;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2021/01/03/idioth/christmasctf2020-review/image15.png" srcset="/img/loading.gif" alt></p>
<p><del>&#xC544;&#xC774;&#xC528;&#x2026; &#xB204;&#xAC00; &#xC5EC;&#xAE30;&#xB2E4; &#xC591;&#xD30C;&#xB97C; &#xAC00;&#xC838;&#xB2E4; &#xB193;&#xC740; &#xAC70;&#xC57C;!?</del></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Daily-Life/">Daily-Life</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/ctf/">ctf</a>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/review/">review</a>
                  
                  <a class="hover-with-bg" href="/tags/christmas-ctf-2020/">christmas ctf 2020</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/01/04/idioth/2021-01-04/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2020-29583: Zyxel , VPN    </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/01/02/fabu1ous/2021-01-02/">
                    <span class="hidden-mobile">[] CVE-2020-10148: SolarWinds Orion API auth bypass to RCE</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/01/03/idioth/christmasctf2020-review/';
        this.page.identifier = '/2021/01/03/idioth/christmasctf2020-review/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Daily-Life]  CTF 2020  &nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
