

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD5C;&amp;#xADFC; CPG(Code Property Graph)&amp;#xC5D0; &amp;#xD765;&amp;#xBBF8;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xC11C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC800;&amp;#xAE30; &amp;#xAE30;&amp;#xC6C3;&amp;#xB300;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; USENIX Security &amp;#x2018;25 &amp;#xB17C;&amp;#xBB38;&amp;#xC778; LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models&amp;#xB97C; &amp;#xB9AC;&amp;#xBDF0;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBCF8; &amp;#xB17C;&amp;#xBB38;: &lt;a href=&#34;https://arxiv.org/pdf/2507.16585&#34;&gt;https://arxiv.org/pdf/2507.16585&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBD84;&amp;#xC57C;&amp;#xAC00; &amp;#xADF8;&amp;#xB807;&amp;#xB4EF;&amp;#xC774;, &amp;#xCD5C;&amp;#xADFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; LLM&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; &amp;#xC694;&amp;#xC998; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC744; &amp;#xC4F0;&amp;#xB294; &amp;#xB4F1; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&amp;#xB098; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; LLM&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xB9C9;&amp;#xC0C1; &amp;#xD070; &amp;#xADDC;&amp;#xBAA8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, &amp;#xC544;&amp;#xC608; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4; &amp;#xC218;&amp;#xB3D9; &amp;#xAC1C;&amp;#xC785;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC885;&amp;#xC885; &amp;#xACAA;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC694;&amp;#xC998; gemini&amp;#xB098; gpt&amp;#xAC19;&amp;#xC740; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC740; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC804;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xBA74; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC84C;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD30C;&amp;#xC778; &amp;#xD29C;&amp;#xB2DD;&amp;#xC774;&amp;#xB098; &amp;#xD559;&amp;#xC2B5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC18C;&amp;#xADDC;&amp;#xBAA8; &amp;#xC784;&amp;#xBCA0;&amp;#xB529; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC740; &lt;del&gt;&amp;#xAC00;&amp;#xB09C;&amp;#xD55C; GPU&lt;/del&gt; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xB4B7;&amp;#xBC1B;&amp;#xCE68;&amp;#xB418;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xB530;&amp;#xB974;&amp;#xC8E0;. &lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; LLM &amp;#xAE30;&amp;#xBC18; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC758; &amp;#xC811;&amp;#xADFC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; LLM&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC28;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC911;&amp;#xC774; &amp;#xC791;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9D0;&amp;#xD558;&amp;#xBA74;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9; &amp;#xC99D;&amp;#xAC00;, &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xB9AC;&amp;#xBDF0;&amp;#xD560; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; LLM&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Code Property Graphs(CPG): Abstract Syntax Tree(AST), Control Flow Graph(CFG), Program Dependence Graph(PDG)&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD45C;&amp;#xD604; &amp;#xBC29;&amp;#xC2DD;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Methodology&#34;&gt;&lt;a href=&#34;#Methodology&#34; class=&#34;headerlink&#34; title=&#34;Methodology&#34;&gt;&lt;/a&gt;Methodology&lt;/h1&gt;&lt;h2 id=&#34;0-System-Overview&#34;&gt;&lt;a href=&#34;#0-System-Overview&#34; class=&#34;headerlink&#34; title=&#34;0. System Overview&#34;&gt;&lt;/a&gt;0. System Overview&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC548;&amp;#xD55C;, CPG&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xD45C;&amp;#xD604;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xD574; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC874;&amp;#xC7AC; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAC1C;&amp;#xC694;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xAC8C; Query Generation, Slice Construction, Code Classification &amp;#xC138; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-Query-Generation&#34;&gt;&lt;a href=&#34;#1-Query-Generation&#34; class=&#34;headerlink&#34; title=&#34;1. Query Generation&#34;&gt;&lt;/a&gt;1. Query Generation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;LLMxCPG-Q&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC544; &amp;#xD6C4;&amp;#xC220;&amp;#xD560; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &lt;code&gt;Qwen2.5-Coder-32B Instruct&lt;/code&gt;&amp;#xB97C; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; fine tuning&amp;#xD55C; &amp;#xBAA8;&amp;#xB378;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD559;&amp;#xC2B5;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC8FC;&amp;#xC694; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xCD94;&amp;#xCD9C;&amp;#xACFC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xC804;&amp;#xBC18;&amp;#xC5D0; &amp;#xAC78;&amp;#xCE5C; &amp;#xCFFC;&amp;#xB9AC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;2-Slice-Construction&#34;&gt;&lt;a href=&#34;#2-Slice-Construction&#34; class=&#34;headerlink&#34; title=&#34;2. Slice Construction&#34;&gt;&lt;/a&gt;2. Slice Construction&lt;/h2&gt;&lt;p&gt;1&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB294; &lt;a href=&#34;https://github.com/joernio/joern&#34;&gt;Joern&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Joern&amp;#xC740; CPG&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; Scala &amp;#xAE30;&amp;#xBC18;&amp;#xC758; CPGQL&amp;#xB85C; &amp;#xCFFC;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; SAST &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Joern &amp;#xBC0F; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;execution path&amp;#xB97C; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC; &amp;#xB0B4; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; root cause &amp;#xC2DD;&amp;#xBCC4;&lt;/li&gt;
&lt;li&gt;execution path&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xC218; &amp;#xC2DD;&amp;#xBCC4; &lt;/li&gt;
&lt;li&gt;1&amp;#xACFC; 2&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xCD5C;&amp;#xC885; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2A4; &amp;#xAD6C;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;2-1-Taint-Path-&amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;a href=&#34;#2-1-Taint-Path-&amp;#xCD94;&amp;#xCD9C;&#34; class=&#34;headerlink&#34; title=&#34;2-1) Taint Path &amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;/a&gt;2-1) Taint Path &amp;#xCD94;&amp;#xCD9C;&lt;/h3&gt;&lt;p&gt;&amp;#xC608;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &lt;a href=&#34;https://github.com/torvalds/linux/commit/c85ce65ecac078ab1a1835c87c4a6319cf74660a&#34;&gt;CVE-2011-3359&lt;/a&gt; &amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD37C; &amp;#xAE38;&amp;#xC774; &lt;code&gt;len&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC871;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; buffer overflow &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;skb_put&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;code&gt;len&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; overflow &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;val source = cpg.identifier.name(&amp;quot;len&amp;quot;)
val sink = cpg.call.name(&amp;quot;skb_put&amp;quot;).where(_.argument.order(2).codeExact(&amp;quot;len + ring-&amp;gt;frameoffset&amp;quot;))
val execution_paths = sink.reachableByFlows(source)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; source (&amp;#xBCC0;&amp;#xC218; &lt;code&gt;len&lt;/code&gt;), sink( &lt;code&gt;skb_put&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;), execution paths &amp;#xB4F1; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; Taint Path&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-Execution-Path-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xBCC0;&amp;#xC218;-&amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;a href=&#34;#2-2-Execution-Path-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xBCC0;&amp;#xC218;-&amp;#xCD94;&amp;#xCD9C;&#34; class=&#34;headerlink&#34; title=&#34;2-2) Execution Path &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;/a&gt;2-2) Execution Path &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;val execution_path_nodes = &amp;lt;&amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C; &amp;#xCFFC;&amp;#xB9AC;(LLMxCPG-Q&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;)&amp;gt;
cpg.identifier.filter(id =&amp;gt; execution_path_nodes.lineNumber.toSet.intersect(id.lineNumber.l.toSet).size.equals(1))&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;execution_path_nodes&lt;/code&gt; &amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;&amp;#xB97C; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-&amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5;-&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;-&amp;#xBC0F;-&amp;#xCD5C;&amp;#xC885;-&amp;#xCF54;&amp;#xB4DC;-&amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;-&amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;a href=&#34;#2-3-&amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5;-&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;-&amp;#xBC0F;-&amp;#xCD5C;&amp;#xC885;-&amp;#xCF54;&amp;#xB4DC;-&amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;-&amp;#xAD6C;&amp;#xC131;&#34; class=&#34;headerlink&#34; title=&#34;2-3) &amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC885; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;/a&gt;2-3) &amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC885; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xAD6C;&amp;#xC131;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCFFC;&amp;#xB9AC;
execution_path_and_interacters.reachableByFlows(cpg.all)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PDG(Program Dependency Graph)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Joern&amp;#xC758; &lt;code&gt;reachableByFlows&lt;/code&gt; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; backward slice&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;backward slice&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB8E8;&amp;#xD504;, &amp;#xBCC0;&amp;#xC218; &amp;#xC120;&amp;#xC5B8; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xB4F1; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;, &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;static void dma_rx(struct b43_dmaring *ring, int *slot)
{
	u16 len;
	len = le16_to_cpu(rxhdr-&amp;gt;frame_len);
	if (unlikely(len &amp;gt; ring-&amp;gt;rx_buffersize)) {
		s32 tmp = len;
		while (1) {
			tmp -= ring-&amp;gt;rx_buffersize;
			if (tmp &amp;lt;= 0)
				break;
		}
		goto drop;
	}

	skb_put(skb, len + ring-&amp;gt;frameoffset);
	drop:
	return;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xACB0;&amp;#xACFC; 85&amp;#xC904;&amp;#xC778; &amp;#xC6D0;&amp;#xBCF8; &lt;code&gt;dma_rx()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; CVE-2011-3359 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294; 18&amp;#xC904;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;3-Code-Classification-Vulnerability-Detection&#34;&gt;&lt;a href=&#34;#3-Code-Classification-Vulnerability-Detection&#34; class=&#34;headerlink&#34; title=&#34;3. Code Classification (Vulnerability Detection)&#34;&gt;&lt;/a&gt;3. Code Classification (Vulnerability Detection)&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC555;&amp;#xCD95;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;code&gt;QwQ-32B-Preview&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; fine tuning&amp;#xD55C; &lt;code&gt;LLMxCPG-D&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Vuln &amp;#xB610;&amp;#xB294; Safe&amp;#xB85C; &amp;#xC774;&amp;#xC9C4; &amp;#xBD84;&amp;#xB958;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;LLMxCPG-D&lt;/code&gt;&amp;#xB294; &amp;#xBD84;&amp;#xB958; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xB418;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8;&amp;#xB9C1;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; fine tuning&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58; &amp;#xCF54;&amp;#xB4DC; &amp;#xB610;&amp;#xD55C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &amp;#xAC15;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC774;&amp;#xD6C4; &amp;#xBAA8;&amp;#xB378; &amp;#xD559;&amp;#xC2B5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B; &amp;#xC0DD;&amp;#xC131; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Performance-Analysis&#34;&gt;&lt;a href=&#34;#Performance-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Performance Analysis&#34;&gt;&lt;/a&gt;Performance Analysis&lt;/h1&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3C9;&amp;#xAC00;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; 6&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC218;&amp;#xCE58; &amp;#xBC0F; &amp;#xBE44;&amp;#xAD50; &amp;#xD45C;&amp;#xB294; &amp;#xC6D0;&amp;#xBB38; &amp;#xCC38;&amp;#xACE0;)&lt;/p&gt;
&lt;h3 id=&#34;Query-Generation&#34;&gt;&lt;a href=&#34;#Query-Generation&#34; class=&#34;headerlink&#34; title=&#34;Query Generation&#34;&gt;&lt;/a&gt;Query Generation&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;1278&amp;#xAC1C;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; CPGQL&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&lt;/li&gt;
&lt;li&gt;50&amp;#xAC1C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; human-auditing &amp;#xACB0;&amp;#xACFC;, 76% &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC77C;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;&amp;#xC624;&amp;#xBD84;&amp;#xB958;&amp;#xB41C; 25&amp;#xAC1C; &amp;#xC0D8;&amp;#xD50C;&lt;ul&gt;
&lt;li&gt;28%&amp;#xB294; &amp;#xCFFC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD655;&amp;#xD588;&amp;#xC73C;&amp;#xB098; LLMxCPG-D&amp;#xAC00; &amp;#xC798;&amp;#xBABB; &amp;#xBD84;&amp;#xB958;&lt;/li&gt;
&lt;li&gt;40%&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; CWE &amp;#xB3C4;&amp;#xCD9C;&lt;/li&gt;
&lt;li&gt;32%&amp;#xB294; CWE&amp;#xB97C; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC911;&amp;#xC694; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC694;&amp;#xC18C; &amp;#xAC80;&amp;#xC0C9; &amp;#xC2E4;&amp;#xD328;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Code-Reduction&#34;&gt;&lt;a href=&#34;#Code-Reduction&#34; class=&#34;headerlink&#34; title=&#34;Code Reduction&#34;&gt;&lt;/a&gt;Code Reduction&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC18C; 67.87%, &amp;#xCD5C;&amp;#xB300; 90.93%&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC555;&amp;#xCD95;&amp;#xB960;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Function-level-Vulnerability-Detection&#34;&gt;&lt;a href=&#34;#Function-level-Vulnerability-Detection&#34; class=&#34;headerlink&#34; title=&#34;Function-level Vulnerability Detection&#34;&gt;&lt;/a&gt;Function-level Vulnerability Detection&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xD788; &amp;#xD568;&amp;#xC218; &amp;#xB808;&amp;#xBCA8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xBC84;&amp;#xADF8; &amp;#xD0C0;&amp;#xC785;(&lt;a href=&#34;https://cwe.mitre.org/data/definitions/119.html&#34;&gt;CWE-119&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/415.html&#34;&gt;CWE-415&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/416.html&#34;&gt;CWE-416&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/190.html&#34;&gt;CWE-190&lt;/a&gt;) &amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB192;&amp;#xC740; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC728;&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Generalizability&#34;&gt;&lt;a href=&#34;#Generalizability&#34; class=&#34;headerlink&#34; title=&#34;Generalizability&#34;&gt;&lt;/a&gt;Generalizability&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Generalizability&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; VulSim, VulBERTA-CNN, VulBERTA-MLP, ReGVD &amp;#xBAA8;&amp;#xB378; &amp;#xB300;&amp;#xBE44; &amp;#xC815;&amp;#xD655;&amp;#xB3C4; 20% &amp;#xD5A5;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131; &amp;#xC99D;&amp;#xAC00;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558; &amp;#xC5C6;&amp;#xC774; &amp;#xC77C;&amp;#xAD00;&amp;#xB41C; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&lt;/li&gt;
&lt;li&gt;&amp;#xC9C0;&amp;#xC2DD; &amp;#xB2E8;&amp;#xC808; &amp;#xC774;&amp;#xD6C4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xD134;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xD654; &amp;#xC131;&amp;#xB2A5; &amp;#xB610;&amp;#xD55C; &amp;#xC900;&amp;#xC218;&amp;#xD574; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; CVE&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Misclassification-Analysis&#34;&gt;&lt;a href=&#34;#Misclassification-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Misclassification Analysis&#34;&gt;&lt;/a&gt;Misclassification Analysis&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;CWE-120 (Classic Buffer Overflow) &amp;#xBC0F; CWE-125 (Out-of-bounds Read)&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&lt;ul&gt;
&lt;li&gt;&amp;#xD6C8;&amp;#xB828; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; CWE&amp;#xC758; &amp;#xC0D8;&amp;#xD50C; &amp;#xC218;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB294; &amp;#xACE0;&amp;#xD488;&amp;#xC9C8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Robustness-to-Code-Augmentation&#34;&gt;&lt;a href=&#34;#Robustness-to-Code-Augmentation&#34; class=&#34;headerlink&#34; title=&#34;Robustness to Code Augmentation&#34;&gt;&lt;/a&gt;Robustness to Code Augmentation&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801; &amp;#xBCF4;&amp;#xC874;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;(&amp;#xC8FC;&amp;#xC11D; &amp;#xC601;&amp;#xD5A5;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B; &amp;#xC758;&amp;#xC874;&amp;#xC131;, &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658; &amp;#xB178;&amp;#xC774;&amp;#xC988;)&lt;/li&gt;
&lt;li&gt;&amp;#xB2E8;, T3 &amp;#xBCC0;&amp;#xD658;(&amp;#xD568;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;)&amp;#xC740; &amp;#xBAA8;&amp;#xB378; &amp;#xC131;&amp;#xB2A5;, &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC7AC;&amp;#xD604;&amp;#xC728;(recall)&amp;#xC5D0; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC90C; &amp;#x2192; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; T3 &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC18C; &amp;#xBBFC;&amp;#xAC10;&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xB9AC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAC70;&amp;#xB098;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD569;&amp;#xCE58;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBCC0;&amp;#xD658;&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBCC0;&amp;#xD658;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; CPG &amp;#xB0B4;&amp;#xC758; &amp;#xD568;&amp;#xC218; &amp;#xBC0F; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xB610;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xC640;&amp;#xC758; &amp;#xD638;&amp;#xCD9C; &amp;#xAD00;&amp;#xACC4; &amp;#xAD6C;&amp;#xC870; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE68;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion&#34;&gt;&lt;/a&gt;Conclusion&lt;/h1&gt;&lt;p&gt;LLMxCPG&amp;#xB294; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC5EC; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB294; LLM&amp;#xC758; &amp;#xD559;&amp;#xC2B5; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xACE0;, &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801; &amp;#xC77C;&amp;#xAD00;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xD654; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xD06C;&amp;#xAC8C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xC790;&amp;#xAC00; Limitations &amp;#xD56D;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCFFC;&amp;#xB9AC; &amp;#xBAA8;&amp;#xB378;(&lt;code&gt;LLMxCPG-Q&lt;/code&gt;)&amp;#xC774; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC804;&amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xD30C;&amp;#xC6CC; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC744; &amp;#xD074;&amp;#xB9AC;&amp;#xC5B4;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0;, CPG &amp;#xC790;&amp;#xCCB4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xC778; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC18D;&amp;#xC131;&amp;#xC758; race condition&amp;#xC774;&amp;#xB098; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xB85C;&amp;#xC9C1; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC758; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xACC4;&amp;#xC2B9;&amp;#xD574; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xC555;&amp;#xCD95;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC640; &amp;#xC2E4;&amp;#xD604;&amp;#xC774; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xB124;&amp;#xC694;. LLM&amp;#xC758; &amp;#xCD94;&amp;#xB860; &amp;#xB2A5;&amp;#xB825;&amp;#xACFC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC08;&amp;#xC218;&amp;#xB85D; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB378; &amp;#xC131;&amp;#xB2A5; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB9CC; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83; &amp;#xBCF4;&amp;#xB2E8; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xACE0;&amp;#xB3C4;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB97C; &amp;#xC55E;&amp;#xB2F9;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC678; &amp;#xAD6C;&amp;#xD604; &amp;#xD30C;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &lt;a href=&#34;https://github.com/qcri/llmxcpg&#34;&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://huggingface.co/collections/QCRI/llmxcpg-6855f80e601774b43eba2d14&#34;&gt;&amp;#xBAA8;&amp;#xB378;&lt;/a&gt;&amp;#xC744; &amp;#xC368;&amp;#xBCF8; &amp;#xB4A4; &amp;#xB9AC;&amp;#xBDF0; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC62C; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xC885; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294; &amp;#xB17C;&amp;#xBB38; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB85C; &amp;#xB610; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (KR) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD5C;&amp;#xADFC; CPG(Code Property Graph)&amp;#xC5D0; &amp;#xD765;&amp;#xBBF8;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xC11C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC800;&amp;#xAE30; &amp;#xAE30;&amp;#xC6C3;&amp;#xB300;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; USENIX Security &amp;#x2018;25 &amp;#xB17C;&amp;#xBB38;&amp;#xC778; LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models&amp;#xB97C; &amp;#xB9AC;&amp;#xBDF0;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBCF8; &amp;#xB17C;&amp;#xBB38;: &lt;a href=&#34;https://arxiv.org/pdf/2507.16585&#34;&gt;https://arxiv.org/pdf/2507.16585&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBD84;&amp;#xC57C;&amp;#xAC00; &amp;#xADF8;&amp;#xB807;&amp;#xB4EF;&amp;#xC774;, &amp;#xCD5C;&amp;#xADFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; LLM&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; &amp;#xC694;&amp;#xC998; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC744; &amp;#xC4F0;&amp;#xB294; &amp;#xB4F1; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&amp;#xB098; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; LLM&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xB9C9;&amp;#xC0C1; &amp;#xD070; &amp;#xADDC;&amp;#xBAA8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, &amp;#xC544;&amp;#xC608; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4; &amp;#xC218;&amp;#xB3D9; &amp;#xAC1C;&amp;#xC785;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC885;&amp;#xC885; &amp;#xACAA;&amp;#xC740; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC694;&amp;#xC998; gemini&amp;#xB098; gpt&amp;#xAC19;&amp;#xC740; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC740; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xC804;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xBA74; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC84C;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD30C;&amp;#xC778; &amp;#xD29C;&amp;#xB2DD;&amp;#xC774;&amp;#xB098; &amp;#xD559;&amp;#xC2B5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC18C;&amp;#xADDC;&amp;#xBAA8; &amp;#xC784;&amp;#xBCA0;&amp;#xB529; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC740; &lt;del&gt;&amp;#xAC00;&amp;#xB09C;&amp;#xD55C; GPU&lt;/del&gt; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xB4B7;&amp;#xBC1B;&amp;#xCE68;&amp;#xB418;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xB530;&amp;#xB974;&amp;#xC8E0;. &lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; LLM &amp;#xAE30;&amp;#xBC18; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC758; &amp;#xC811;&amp;#xADFC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; LLM&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC28;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC911;&amp;#xC774; &amp;#xC791;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9D0;&amp;#xD558;&amp;#xBA74;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8;&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9; &amp;#xC99D;&amp;#xAC00;, &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xB9AC;&amp;#xBDF0;&amp;#xD560; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; LLM&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Code Property Graphs(CPG): Abstract Syntax Tree(AST), Control Flow Graph(CFG), Program Dependence Graph(PDG)&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD45C;&amp;#xD604; &amp;#xBC29;&amp;#xC2DD;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;Methodology&#34;&gt;&lt;a href=&#34;#Methodology&#34; class=&#34;headerlink&#34; title=&#34;Methodology&#34;&gt;&lt;/a&gt;Methodology&lt;/h1&gt;&lt;h2 id=&#34;0-System-Overview&#34;&gt;&lt;a href=&#34;#0-System-Overview&#34; class=&#34;headerlink&#34; title=&#34;0. System Overview&#34;&gt;&lt;/a&gt;0. System Overview&lt;/h2&gt;&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC548;&amp;#xD55C;, CPG&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xD45C;&amp;#xD604;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xD574; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC874;&amp;#xC7AC; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAC1C;&amp;#xC694;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xAC8C; Query Generation, Slice Construction, Code Classification &amp;#xC138; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-Query-Generation&#34;&gt;&lt;a href=&#34;#1-Query-Generation&#34; class=&#34;headerlink&#34; title=&#34;1. Query Generation&#34;&gt;&lt;/a&gt;1. Query Generation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;LLMxCPG-Q&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC544; &amp;#xD6C4;&amp;#xC220;&amp;#xD560; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &lt;code&gt;Qwen2.5-Coder-32B Instruct&lt;/code&gt;&amp;#xB97C; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; fine tuning&amp;#xD55C; &amp;#xBAA8;&amp;#xB378;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD559;&amp;#xC2B5;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC8FC;&amp;#xC694; &amp;#xCF54;&amp;#xB4DC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xCD94;&amp;#xCD9C;&amp;#xACFC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xC804;&amp;#xBC18;&amp;#xC5D0; &amp;#xAC78;&amp;#xCE5C; &amp;#xCFFC;&amp;#xB9AC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;2-Slice-Construction&#34;&gt;&lt;a href=&#34;#2-Slice-Construction&#34; class=&#34;headerlink&#34; title=&#34;2. Slice Construction&#34;&gt;&lt;/a&gt;2. Slice Construction&lt;/h2&gt;&lt;p&gt;1&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB294; &lt;a href=&#34;https://github.com/joernio/joern&#34;&gt;Joern&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Joern&amp;#xC740; CPG&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; Scala &amp;#xAE30;&amp;#xBC18;&amp;#xC758; CPGQL&amp;#xB85C; &amp;#xCFFC;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; SAST &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Joern &amp;#xBC0F; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;execution path&amp;#xB97C; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC; &amp;#xB0B4; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; root cause &amp;#xC2DD;&amp;#xBCC4;&lt;/li&gt;
&lt;li&gt;execution path&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xC218; &amp;#xC2DD;&amp;#xBCC4; &lt;/li&gt;
&lt;li&gt;1&amp;#xACFC; 2&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xCD5C;&amp;#xC885; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2A4; &amp;#xAD6C;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;2-1-Taint-Path-&amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;a href=&#34;#2-1-Taint-Path-&amp;#xCD94;&amp;#xCD9C;&#34; class=&#34;headerlink&#34; title=&#34;2-1) Taint Path &amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;/a&gt;2-1) Taint Path &amp;#xCD94;&amp;#xCD9C;&lt;/h3&gt;&lt;p&gt;&amp;#xC608;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &lt;a href=&#34;https://github.com/torvalds/linux/commit/c85ce65ecac078ab1a1835c87c4a6319cf74660a&#34;&gt;CVE-2011-3359&lt;/a&gt; &amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD37C; &amp;#xAE38;&amp;#xC774; &lt;code&gt;len&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC871;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; buffer overflow &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;skb_put&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;code&gt;len&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; overflow &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;val source = cpg.identifier.name(&amp;quot;len&amp;quot;)
val sink = cpg.call.name(&amp;quot;skb_put&amp;quot;).where(_.argument.order(2).codeExact(&amp;quot;len + ring-&amp;gt;frameoffset&amp;quot;))
val execution_paths = sink.reachableByFlows(source)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; source (&amp;#xBCC0;&amp;#xC218; &lt;code&gt;len&lt;/code&gt;), sink( &lt;code&gt;skb_put&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;), execution paths &amp;#xB4F1; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; Taint Path&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-Execution-Path-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xBCC0;&amp;#xC218;-&amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;a href=&#34;#2-2-Execution-Path-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xBCC0;&amp;#xC218;-&amp;#xCD94;&amp;#xCD9C;&#34; class=&#34;headerlink&#34; title=&#34;2-2) Execution Path &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&#34;&gt;&lt;/a&gt;2-2) Execution Path &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;val execution_path_nodes = &amp;lt;&amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C; &amp;#xCFFC;&amp;#xB9AC;(LLMxCPG-Q&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;)&amp;gt;
cpg.identifier.filter(id =&amp;gt; execution_path_nodes.lineNumber.toSet.intersect(id.lineNumber.l.toSet).size.equals(1))&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;execution_path_nodes&lt;/code&gt; &amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;&amp;#xB97C; CPGQL &amp;#xCFFC;&amp;#xB9AC;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-&amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5;-&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;-&amp;#xBC0F;-&amp;#xCD5C;&amp;#xC885;-&amp;#xCF54;&amp;#xB4DC;-&amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;-&amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;a href=&#34;#2-3-&amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5;-&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;-&amp;#xBC0F;-&amp;#xCD5C;&amp;#xC885;-&amp;#xCF54;&amp;#xB4DC;-&amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;-&amp;#xAD6C;&amp;#xC131;&#34; class=&#34;headerlink&#34; title=&#34;2-3) &amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC885; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xAD6C;&amp;#xC131;&#34;&gt;&lt;/a&gt;2-3) &amp;#xC5ED;&amp;#xBC29;&amp;#xD5A5; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC885; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xAD6C;&amp;#xC131;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCFFC;&amp;#xB9AC;
execution_path_and_interacters.reachableByFlows(cpg.all)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PDG(Program Dependency Graph)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Joern&amp;#xC758; &lt;code&gt;reachableByFlows&lt;/code&gt; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; backward slice&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;backward slice&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB8E8;&amp;#xD504;, &amp;#xBCC0;&amp;#xC218; &amp;#xC120;&amp;#xC5B8; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xB4F1; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;, &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs graphql&#34;&gt;static void dma_rx(struct b43_dmaring *ring, int *slot)
{
	u16 len;
	len = le16_to_cpu(rxhdr-&amp;gt;frame_len);
	if (unlikely(len &amp;gt; ring-&amp;gt;rx_buffersize)) {
		s32 tmp = len;
		while (1) {
			tmp -= ring-&amp;gt;rx_buffersize;
			if (tmp &amp;lt;= 0)
				break;
		}
		goto drop;
	}

	skb_put(skb, len + ring-&amp;gt;frameoffset);
	drop:
	return;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1; &amp;#xACB0;&amp;#xACFC; 85&amp;#xC904;&amp;#xC778; &amp;#xC6D0;&amp;#xBCF8; &lt;code&gt;dma_rx()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; CVE-2011-3359 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294; 18&amp;#xC904;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;3-Code-Classification-Vulnerability-Detection&#34;&gt;&lt;a href=&#34;#3-Code-Classification-Vulnerability-Detection&#34; class=&#34;headerlink&#34; title=&#34;3. Code Classification (Vulnerability Detection)&#34;&gt;&lt;/a&gt;3. Code Classification (Vulnerability Detection)&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC555;&amp;#xCD95;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;code&gt;QwQ-32B-Preview&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; fine tuning&amp;#xD55C; &lt;code&gt;LLMxCPG-D&lt;/code&gt; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Vuln &amp;#xB610;&amp;#xB294; Safe&amp;#xB85C; &amp;#xC774;&amp;#xC9C4; &amp;#xBD84;&amp;#xB958;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;LLMxCPG-D&lt;/code&gt;&amp;#xB294; &amp;#xBD84;&amp;#xB958; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xB418;&amp;#xACE0; &amp;#xB77C;&amp;#xBCA8;&amp;#xB9C1;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; fine tuning&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58; &amp;#xCF54;&amp;#xB4DC; &amp;#xB610;&amp;#xD55C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &amp;#xAC15;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC774;&amp;#xD6C4; &amp;#xBAA8;&amp;#xB378; &amp;#xD559;&amp;#xC2B5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B; &amp;#xC0DD;&amp;#xC131; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Performance-Analysis&#34;&gt;&lt;a href=&#34;#Performance-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Performance Analysis&#34;&gt;&lt;/a&gt;Performance Analysis&lt;/h1&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3C9;&amp;#xAC00;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; 6&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC218;&amp;#xCE58; &amp;#xBC0F; &amp;#xBE44;&amp;#xAD50; &amp;#xD45C;&amp;#xB294; &amp;#xC6D0;&amp;#xBB38; &amp;#xCC38;&amp;#xACE0;)&lt;/p&gt;
&lt;h3 id=&#34;Query-Generation&#34;&gt;&lt;a href=&#34;#Query-Generation&#34; class=&#34;headerlink&#34; title=&#34;Query Generation&#34;&gt;&lt;/a&gt;Query Generation&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;1278&amp;#xAC1C;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; CPGQL&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&lt;/li&gt;
&lt;li&gt;50&amp;#xAC1C; &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; human-auditing &amp;#xACB0;&amp;#xACFC;, 76% &amp;#xC0D8;&amp;#xD50C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC77C;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;&amp;#xC624;&amp;#xBD84;&amp;#xB958;&amp;#xB41C; 25&amp;#xAC1C; &amp;#xC0D8;&amp;#xD50C;&lt;ul&gt;
&lt;li&gt;28%&amp;#xB294; &amp;#xCFFC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD655;&amp;#xD588;&amp;#xC73C;&amp;#xB098; LLMxCPG-D&amp;#xAC00; &amp;#xC798;&amp;#xBABB; &amp;#xBD84;&amp;#xB958;&lt;/li&gt;
&lt;li&gt;40%&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; CWE &amp;#xB3C4;&amp;#xCD9C;&lt;/li&gt;
&lt;li&gt;32%&amp;#xB294; CWE&amp;#xB97C; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC911;&amp;#xC694; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC694;&amp;#xC18C; &amp;#xAC80;&amp;#xC0C9; &amp;#xC2E4;&amp;#xD328;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Code-Reduction&#34;&gt;&lt;a href=&#34;#Code-Reduction&#34; class=&#34;headerlink&#34; title=&#34;Code Reduction&#34;&gt;&lt;/a&gt;Code Reduction&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC18C; 67.87%, &amp;#xCD5C;&amp;#xB300; 90.93%&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC555;&amp;#xCD95;&amp;#xB960;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Function-level-Vulnerability-Detection&#34;&gt;&lt;a href=&#34;#Function-level-Vulnerability-Detection&#34; class=&#34;headerlink&#34; title=&#34;Function-level Vulnerability Detection&#34;&gt;&lt;/a&gt;Function-level Vulnerability Detection&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xD788; &amp;#xD568;&amp;#xC218; &amp;#xB808;&amp;#xBCA8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xBC84;&amp;#xADF8; &amp;#xD0C0;&amp;#xC785;(&lt;a href=&#34;https://cwe.mitre.org/data/definitions/119.html&#34;&gt;CWE-119&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/415.html&#34;&gt;CWE-415&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/416.html&#34;&gt;CWE-416&lt;/a&gt;, &lt;a href=&#34;https://cwe.mitre.org/data/definitions/190.html&#34;&gt;CWE-190&lt;/a&gt;) &amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB192;&amp;#xC740; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC728;&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Generalizability&#34;&gt;&lt;a href=&#34;#Generalizability&#34; class=&#34;headerlink&#34; title=&#34;Generalizability&#34;&gt;&lt;/a&gt;Generalizability&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Generalizability&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; VulSim, VulBERTA-CNN, VulBERTA-MLP, ReGVD &amp;#xBAA8;&amp;#xB378; &amp;#xB300;&amp;#xBE44; &amp;#xC815;&amp;#xD655;&amp;#xB3C4; 20% &amp;#xD5A5;&amp;#xC0C1;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131; &amp;#xC99D;&amp;#xAC00;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558; &amp;#xC5C6;&amp;#xC774; &amp;#xC77C;&amp;#xAD00;&amp;#xB41C; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&lt;/li&gt;
&lt;li&gt;&amp;#xC9C0;&amp;#xC2DD; &amp;#xB2E8;&amp;#xC808; &amp;#xC774;&amp;#xD6C4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xD134;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xD654; &amp;#xC131;&amp;#xB2A5; &amp;#xB610;&amp;#xD55C; &amp;#xC900;&amp;#xC218;&amp;#xD574; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; CVE&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Misclassification-Analysis&#34;&gt;&lt;a href=&#34;#Misclassification-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Misclassification Analysis&#34;&gt;&lt;/a&gt;Misclassification Analysis&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;CWE-120 (Classic Buffer Overflow) &amp;#xBC0F; CWE-125 (Out-of-bounds Read)&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&lt;ul&gt;
&lt;li&gt;&amp;#xD6C8;&amp;#xB828; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; CWE&amp;#xC758; &amp;#xC0D8;&amp;#xD50C; &amp;#xC218;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB294; &amp;#xACE0;&amp;#xD488;&amp;#xC9C8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Robustness-to-Code-Augmentation&#34;&gt;&lt;a href=&#34;#Robustness-to-Code-Augmentation&#34; class=&#34;headerlink&#34; title=&#34;Robustness to Code Augmentation&#34;&gt;&lt;/a&gt;Robustness to Code Augmentation&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801; &amp;#xBCF4;&amp;#xC874;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;(&amp;#xC8FC;&amp;#xC11D; &amp;#xC601;&amp;#xD5A5;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B; &amp;#xC758;&amp;#xC874;&amp;#xC131;, &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658; &amp;#xB178;&amp;#xC774;&amp;#xC988;)&lt;/li&gt;
&lt;li&gt;&amp;#xB2E8;, T3 &amp;#xBCC0;&amp;#xD658;(&amp;#xD568;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;)&amp;#xC740; &amp;#xBAA8;&amp;#xB378; &amp;#xC131;&amp;#xB2A5;, &amp;#xADF8;&amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC7AC;&amp;#xD604;&amp;#xC728;(recall)&amp;#xC5D0; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC90C; &amp;#x2192; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; T3 &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC18C; &amp;#xBBFC;&amp;#xAC10;&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218; &amp;#xCD94;&amp;#xCD9C;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xB9AC;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAC70;&amp;#xB098;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD569;&amp;#xCE58;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBCC0;&amp;#xD658;&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBCC0;&amp;#xD658;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; CPG &amp;#xB0B4;&amp;#xC758; &amp;#xD568;&amp;#xC218; &amp;#xBC0F; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xB610;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xC640;&amp;#xC758; &amp;#xD638;&amp;#xCD9C; &amp;#xAD00;&amp;#xACC4; &amp;#xAD6C;&amp;#xC870; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xC7AC;&amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC5D0; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE68;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion&#34;&gt;&lt;/a&gt;Conclusion&lt;/h1&gt;&lt;p&gt;LLMxCPG&amp;#xB294; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xC2F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC5EC; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB294; LLM&amp;#xC758; &amp;#xD559;&amp;#xC2B5; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xACE0;, &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xD658;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801; &amp;#xC77C;&amp;#xAD00;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC77C;&amp;#xBC18;&amp;#xD654; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xD06C;&amp;#xAC8C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xC790;&amp;#xAC00; Limitations &amp;#xD56D;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCFFC;&amp;#xB9AC; &amp;#xBAA8;&amp;#xB378;(&lt;code&gt;LLMxCPG-Q&lt;/code&gt;)&amp;#xC774; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xC804;&amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xD30C;&amp;#xC6CC; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC744; &amp;#xD074;&amp;#xB9AC;&amp;#xC5B4;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0;, CPG &amp;#xC790;&amp;#xCCB4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xC778; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC18D;&amp;#xC131;&amp;#xC758; race condition&amp;#xC774;&amp;#xB098; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xB85C;&amp;#xC9C1; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC758; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xACC4;&amp;#xC2B9;&amp;#xD574; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC6D0;&amp;#xBCF8; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; CPG &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC758;&amp;#xBBF8;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xC555;&amp;#xCD95;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC640; &amp;#xC2E4;&amp;#xD604;&amp;#xC774; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xB124;&amp;#xC694;. LLM&amp;#xC758; &amp;#xCD94;&amp;#xB860; &amp;#xB2A5;&amp;#xB825;&amp;#xACFC; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC08;&amp;#xC218;&amp;#xB85D; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB378; &amp;#xC131;&amp;#xB2A5; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB9CC; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83; &amp;#xBCF4;&amp;#xB2E8; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xACE0;&amp;#xB3C4;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD0D0;&amp;#xC9C0; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB97C; &amp;#xC55E;&amp;#xB2F9;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC678; &amp;#xAD6C;&amp;#xD604; &amp;#xD30C;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &lt;a href=&#34;https://github.com/qcri/llmxcpg&#34;&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://huggingface.co/collections/QCRI/llmxcpg-6855f80e601774b43eba2d14&#34;&gt;&amp;#xBAA8;&amp;#xB378;&lt;/a&gt;&amp;#xC744; &amp;#xC368;&amp;#xBCF8; &amp;#xB4A4; &amp;#xB9AC;&amp;#xBDF0; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC62C; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xC885; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294; &amp;#xB17C;&amp;#xBB38; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB85C; &amp;#xB610; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2025/09/22/l0ch/llmxcpg_paper_review/kr/thumbnail.jpeg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/09/22/l0ch/llmxcpg_paper_review/kr/">

  <title>[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-09-22 19:00" pubdate>
      2025년 9월 22일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.6k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      51
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xC11C;&#xB860;"><a href="#&#xC11C;&#xB860;" class="headerlink" title="&#xC11C;&#xB860;"></a>&#xC11C;&#xB860;</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, L0ch&#xC785;&#xB2C8;&#xB2E4;! &#xCD5C;&#xADFC; CPG(Code Property Graph)&#xC5D0; &#xD765;&#xBBF8;&#xAC00; &#xC0DD;&#xACA8;&#xC11C; &#xC5EC;&#xAE30;&#xC800;&#xAE30; &#xAE30;&#xC6C3;&#xB300;&#xACE0; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; USENIX Security &#x2018;25 &#xB17C;&#xBB38;&#xC778; LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models&#xB97C; &#xB9AC;&#xBDF0;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xC6D0;&#xBCF8; &#xB17C;&#xBB38;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://arxiv.org/pdf/2507.16585">https://arxiv.org/pdf/2507.16585</a></p>
</blockquote>
<h1 id="Background"><a href="#Background" class="headerlink" title="Background"></a>Background</h1><p>&#xBAA8;&#xB4E0; &#xBD84;&#xC57C;&#xAC00; &#xADF8;&#xB807;&#xB4EF;&#xC774;, &#xCD5C;&#xADFC; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0;&#xC5D0;&#xC11C;&#xB3C4; LLM&#xC774; &#xB9CE;&#xC774; &#xD65C;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC800;&#xB3C4; &#xC694;&#xC998; &#xD558;&#xB8E8;&#xD55C;&#xC904;&#xC744; &#xC4F0;&#xB294; &#xB4F1; 1-day &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD560; &#xB54C;&#xB098; &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB97C; &#xCC3E;&#xC744; &#xB54C; LLM&#xC744; &#xB9CE;&#xC774; &#xD65C;&#xC6A9;&#xD558;&#xC8E0;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xB9C9;&#xC0C1; &#xD070; &#xADDC;&#xBAA8;&#xC758; &#xCF54;&#xB4DC;&#xBCA0;&#xC774;&#xC2A4;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xC774; &#xC2E4;&#xD328;&#xD55C;&#xB2E4;&#xAC70;&#xB098;, &#xC544;&#xC608; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD06C;&#xAE30;&#xB97C; &#xB118;&#xC5B4; &#xC218;&#xB3D9; &#xAC1C;&#xC785;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xC885;&#xC885; &#xACAA;&#xC740; &#xACBD;&#xD5D8;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC694;&#xC998; gemini&#xB098; gpt&#xAC19;&#xC740; &#xB300;&#xADDC;&#xBAA8; &#xBAA8;&#xB378;&#xB4E4;&#xC740; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD06C;&#xAE30;&#xAC00; &#xC804;&#xACFC; &#xBE44;&#xAD50;&#xD558;&#xBA74; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xCEE4;&#xC84C;&#xC9C0;&#xB9CC;, &#xD30C;&#xC778; &#xD29C;&#xB2DD;&#xC774;&#xB098; &#xD559;&#xC2B5;&#xC744; &#xC704;&#xD55C; &#xC18C;&#xADDC;&#xBAA8; &#xC784;&#xBCA0;&#xB529; &#xBAA8;&#xB378;&#xB4E4;&#xC740; <del>&#xAC00;&#xB09C;&#xD55C; GPU</del> &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC131;&#xB2A5;&#xC774; &#xB4B7;&#xBC1B;&#xCE68;&#xB418;&#xAE30; &#xC5B4;&#xB824;&#xC6CC; &#xC5EC;&#xC804;&#xD788; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC708;&#xB3C4;&#xC6B0; &#xD06C;&#xAE30;&#xC5D0; &#xC81C;&#xC57D;&#xC774; &#xB530;&#xB974;&#xC8E0;. </p>
<p>&#xAE30;&#xC874; LLM &#xAE30;&#xBC18; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0; &#xBC29;&#xBC95;&#xB860;&#xC758; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC740; &#xC2E4;&#xC81C; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xCF54;&#xB4DC;&#xAC00; LLM&#xC774; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xC804;&#xCCB4; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0;&#xC11C; &#xCC28;&#xC9C0;&#xD558;&#xB294; &#xBE44;&#xC911;&#xC774; &#xC791;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xB9D0;&#xD558;&#xBA74;, &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828; &#xC5C6;&#xB294; &#xCF54;&#xB4DC;&#xAC00; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xB300;&#xBD80;&#xBD84;&#xC744; &#xCC28;&#xC9C0;&#xD55C;&#xB2E4;&#xB294; &#xAC70;&#xC8E0;. &#xC774;&#xB294; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xD1A0;&#xD070; &#xC0AC;&#xC6A9;&#xB7C9; &#xC99D;&#xAC00;, &#xBAA8;&#xB378;&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828; &#xC5C6;&#xB294; &#xCF54;&#xB4DC; &#xD328;&#xD134; &#xC815;&#xBCF4;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xB294; &#xB4F1; &#xC5EC;&#xB7EC; &#xBB38;&#xC81C;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xC624;&#xB298; &#xB9AC;&#xBDF0;&#xD560; &#xB17C;&#xBB38;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xACE0; &#xB300;&#xADDC;&#xBAA8; &#xCF54;&#xB4DC;&#xBCA0;&#xC774;&#xC2A4; &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;&#xC5D0;&#xC11C;&#xC758; LLM&#xC758; &#xD55C;&#xACC4;&#xB97C; &#xADF9;&#xBCF5;&#xD558;&#xAE30; &#xC704;&#xD574; CPG &#xAE30;&#xBC18;&#xC758; &#xCF54;&#xB4DC; &#xC2AC;&#xB77C;&#xC774;&#xC2F1; &#xAE30;&#xBC95;&#xC744; &#xB3C4;&#xC785;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>Code Property Graphs(CPG): Abstract Syntax Tree(AST), Control Flow Graph(CFG), Program Dependence Graph(PDG)&#xC640; &#xAC19;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xCF54;&#xB4DC;&#xC758; &#xD45C;&#xD604; &#xBC29;&#xC2DD;&#xB4E4;&#xC744; &#xD558;&#xB098;&#xC758; &#xADF8;&#xB798;&#xD504;&#xB85C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBC29;&#xC2DD;</p>
</blockquote>
<h1 id="Methodology"><a href="#Methodology" class="headerlink" title="Methodology"></a>Methodology</h1><h2 id="0-System-Overview"><a href="#0-System-Overview" class="headerlink" title="0. System Overview"></a>0. System Overview</h2><p>&#xC544;&#xB798; &#xADF8;&#xB9BC;&#xC740; &#xB17C;&#xBB38;&#xC5D0;&#xC11C; &#xC81C;&#xC548;&#xD55C;, CPG&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xCF54;&#xB4DC; &#xD45C;&#xD604;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xD574; &#xD06C;&#xAE30;&#xB97C; &#xC904;&#xC774;&#xACE0; &#xCDE8;&#xC57D;&#xC810; &#xC874;&#xC7AC; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xAC1C;&#xC694;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xD06C;&#xAC8C; Query Generation, Slice Construction, Code Classification &#xC138; &#xB2E8;&#xACC4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="1-Query-Generation"><a href="#1-Query-Generation" class="headerlink" title="1. Query Generation"></a>1. Query Generation</h2><p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>LLMxCPG-Q</code> &#xBAA8;&#xB378;&#xC740; &#xBD84;&#xC11D;&#xD560; &#xCF54;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xBC1B;&#xC544; &#xD6C4;&#xC220;&#xD560; CPGQL &#xCFFC;&#xB9AC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB3C4;&#xB85D; <code>Qwen2.5-Coder-32B Instruct</code>&#xB97C; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; fine tuning&#xD55C; &#xBAA8;&#xB378;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD559;&#xC2B5;&#xB41C; &#xBAA8;&#xB378;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xC8FC;&#xC694; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xCD94;&#xCD9C;&#xACFC; &#xCF54;&#xB4DC; &#xC2AC;&#xB77C;&#xC774;&#xC2F1; &#xC804;&#xBC18;&#xC5D0; &#xAC78;&#xCE5C; &#xCFFC;&#xB9AC; &#xC0DD;&#xC131;&#xC744; &#xC790;&#xB3D9;&#xD654;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC8E0;.</p>
<h2 id="2-Slice-Construction"><a href="#2-Slice-Construction" class="headerlink" title="2. Slice Construction"></a>2. Slice Construction</h2><p>1&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; CPGQL &#xCFFC;&#xB9AC;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/joernio/joern">Joern</a>&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;. Joern&#xC740; CPG&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xC774;&#xB97C; Scala &#xAE30;&#xBC18;&#xC758; CPGQL&#xB85C; &#xCFFC;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; SAST &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Joern &#xBC0F; CPGQL &#xCFFC;&#xB9AC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC544;&#xB798; &#xC138; &#xB2E8;&#xACC4;&#xB97C; &#xD1B5;&#xD574; &#xCF54;&#xB4DC; &#xC2AC;&#xB77C;&#xC774;&#xC2A4;&#xB97C; &#xAD6C;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>execution path&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xCF54;&#xB4DC; &#xB0B4; &#xC7A0;&#xC7AC;&#xC801;&#xC778; &#xCDE8;&#xC57D;&#xC810; root cause &#xC2DD;&#xBCC4;</li>
<li>execution path&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xB294; &#xBCC0;&#xC218; &#xC2DD;&#xBCC4; </li>
<li>1&#xACFC; 2&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xB294; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC; &#xC694;&#xC18C;&#xB97C; &#xCC3E;&#xC544; &#xCD5C;&#xC885; &#xC2AC;&#xB77C;&#xC774;&#xC2A4; &#xAD6C;&#xC131;</li>
</ol>
<h3 id="2-1-Taint-Path-&#xCD94;&#xCD9C;"><a href="#2-1-Taint-Path-&#xCD94;&#xCD9C;" class="headerlink" title="2-1) Taint Path &#xCD94;&#xCD9C;"></a>2-1) Taint Path &#xCD94;&#xCD9C;</h3><p>&#xC608;&#xC81C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/torvalds/linux/commit/c85ce65ecac078ab1a1835c87c4a6319cf74660a">CVE-2011-3359</a> &#xC744; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBC84;&#xD37C; &#xAE38;&#xC774; <code>len</code>&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC99D; &#xBD80;&#xC871;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; buffer overflow &#xCDE8;&#xC57D;&#xC810;</li>
<li><code>skb_put</code> &#xD568;&#xC218; &#xD638;&#xCD9C; &#xC2DC; <code>len</code>&#xB9CC;&#xD07C; &#xBCF5;&#xC0AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; overflow &#xD2B8;&#xB9AC;&#xAC70;</li>
</ul>
<pre><code class="hljs graphql">val source = cpg.identifier.name(&quot;len&quot;)
val sink = cpg.call.name(&quot;skb_put&quot;).where(_.argument.order(2).codeExact(&quot;len + ring-&gt;frameoffset&quot;))
val execution_paths = sink.reachableByFlows(source)</code></pre>
<p>&#xC704; CPGQL &#xCFFC;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; source (&#xBCC0;&#xC218; <code>len</code>), sink( <code>skb_put</code> &#xD638;&#xCD9C;), execution paths &#xB4F1; &#xCDE8;&#xC57D;&#xC810;&#xC758; Taint Path&#xB97C; &#xCD94;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-2-Execution-Path-&#xC0C1;&#xD638;&#xC791;&#xC6A9;-&#xBCC0;&#xC218;-&#xCD94;&#xCD9C;"><a href="#2-2-Execution-Path-&#xC0C1;&#xD638;&#xC791;&#xC6A9;-&#xBCC0;&#xC218;-&#xCD94;&#xCD9C;" class="headerlink" title="2-2) Execution Path &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xBCC0;&#xC218; &#xCD94;&#xCD9C;"></a>2-2) Execution Path &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xBCC0;&#xC218; &#xCD94;&#xCD9C;</h3><pre><code class="hljs graphql">val execution_path_nodes = &lt;&#xC2E4;&#xD589; &#xACBD;&#xB85C; &#xCD94;&#xCD9C; &#xCFFC;&#xB9AC;(LLMxCPG-Q&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB428;)&gt;
cpg.identifier.filter(id =&gt; execution_path_nodes.lineNumber.toSet.intersect(id.lineNumber.l.toSet).size.equals(1))</code></pre>
<p><code>execution_path_nodes</code> &#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xB294; &#xB178;&#xB4DC;&#xB97C; CPGQL &#xCFFC;&#xB9AC;&#xB85C; &#xD0D0;&#xC0C9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-3-&#xC5ED;&#xBC29;&#xD5A5;-&#xC2AC;&#xB77C;&#xC774;&#xC2F1;-&#xBC0F;-&#xCD5C;&#xC885;-&#xCF54;&#xB4DC;-&#xC2A4;&#xB2C8;&#xD3AB;-&#xAD6C;&#xC131;"><a href="#2-3-&#xC5ED;&#xBC29;&#xD5A5;-&#xC2AC;&#xB77C;&#xC774;&#xC2F1;-&#xBC0F;-&#xCD5C;&#xC885;-&#xCF54;&#xB4DC;-&#xC2A4;&#xB2C8;&#xD3AB;-&#xAD6C;&#xC131;" class="headerlink" title="2-3) &#xC5ED;&#xBC29;&#xD5A5; &#xC2AC;&#xB77C;&#xC774;&#xC2F1; &#xBC0F; &#xCD5C;&#xC885; &#xCF54;&#xB4DC; &#xC2A4;&#xB2C8;&#xD3AB; &#xAD6C;&#xC131;"></a>2-3) &#xC5ED;&#xBC29;&#xD5A5; &#xC2AC;&#xB77C;&#xC774;&#xC2F1; &#xBC0F; &#xCD5C;&#xC885; &#xCF54;&#xB4DC; &#xC2A4;&#xB2C8;&#xD3AB; &#xAD6C;&#xC131;</h3><pre><code class="hljs graphql">&#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCFFC;&#xB9AC;
execution_path_and_interacters.reachableByFlows(cpg.all)</code></pre>
<p>&#xC774; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C;&#xB294; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; PDG(Program Dependency Graph)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Joern&#xC758; <code>reachableByFlows</code> API&#xB97C; &#xD1B5;&#xD574; backward slice&#xB97C; &#xAD6C;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>backward slice&#xB97C; &#xD1B5;&#xD574; &#xB8E8;&#xD504;, &#xBCC0;&#xC218; &#xC120;&#xC5B8; &#xBC0F; &#xCD08;&#xAE30;&#xD654; &#xB4F1; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;, &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs graphql">static void dma_rx(struct b43_dmaring *ring, int *slot)
{
	u16 len;
	len = le16_to_cpu(rxhdr-&gt;frame_len);
	if (unlikely(len &gt; ring-&gt;rx_buffersize)) {
		s32 tmp = len;
		while (1) {
			tmp -= ring-&gt;rx_buffersize;
			if (tmp &lt;= 0)
				break;
		}
		goto drop;
	}

	skb_put(skb, len + ring-&gt;frameoffset);
	drop:
	return;
}</code></pre>
<p>&#xC2AC;&#xB77C;&#xC774;&#xC2F1; &#xACB0;&#xACFC; 85&#xC904;&#xC778; &#xC6D0;&#xBCF8; <code>dma_rx()</code> &#xD568;&#xC218;&#xAC00; CVE-2011-3359 &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xC640; &#xC758;&#xBBF8;&#xB860;&#xC801;&#xC73C;&#xB85C; &#xC77C;&#xCE58;&#xD558;&#xB294; 18&#xC904;&#xC758; &#xCF54;&#xB4DC; &#xC2A4;&#xB2C8;&#xD3AB;&#xC73C;&#xB85C; &#xC555;&#xCD95;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<h2 id="3-Code-Classification-Vulnerability-Detection"><a href="#3-Code-Classification-Vulnerability-Detection" class="headerlink" title="3. Code Classification (Vulnerability Detection)"></a>3. Code Classification (Vulnerability Detection)</h2><p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xC744; &#xD1B5;&#xD574; &#xC555;&#xCD95;&#xB41C; &#xCF54;&#xB4DC;&#xB294; <code>QwQ-32B-Preview</code> &#xBAA8;&#xB378;&#xC744; fine tuning&#xD55C; <code>LLMxCPG-D</code> &#xBAA8;&#xB378;&#xC744; &#xD1B5;&#xD574; Vuln &#xB610;&#xB294; Safe&#xB85C; &#xC774;&#xC9C4; &#xBD84;&#xB958;&#xB429;&#xB2C8;&#xB2E4;. <code>LLMxCPG-D</code>&#xB294; &#xBD84;&#xB958; &#xC815;&#xD655;&#xB3C4;&#xB97C; &#xC704;&#xD574; &#xCDE8;&#xC57D;&#xD55C; &#xCF54;&#xB4DC;&#xC640; &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC740; &#xCF54;&#xB4DC; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xB418;&#xACE0; &#xB77C;&#xBCA8;&#xB9C1;&#xB41C; &#xCF54;&#xB4DC; &#xC2A4;&#xB2C8;&#xD3AB; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC73C;&#xB85C; fine tuning&#xB41C; &#xBAA8;&#xB378;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC811;&#xADFC;&#xBC95;&#xC740; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C;, &#xD328;&#xCE58;&#xB41C; &#xCF54;&#xB4DC; &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810; &#xD328;&#xCE58; &#xCF54;&#xB4DC; &#xB610;&#xD55C; &#xC2DD;&#xBCC4;&#xD558;&#xACE0; &#xAC15;&#xC870;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xC774;&#xD6C4; &#xBAA8;&#xB378; &#xD559;&#xC2B5;&#xC744; &#xC704;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC14B; &#xC0DD;&#xC131; &#xC790;&#xB3D9;&#xD654;&#xC5D0;&#xB3C4; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Performance-Analysis"><a href="#Performance-Analysis" class="headerlink" title="Performance Analysis"></a>Performance Analysis</h1><p>&#xAD6C;&#xD604;&#xB41C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB300;&#xD55C; &#xD3C9;&#xAC00;&#xB294; &#xD06C;&#xAC8C; 6&#xAC00;&#xC9C0;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xB294;&#xB370;&#xC694;. &#xD558;&#xB098;&#xC529; &#xACB0;&#xACFC;&#xB97C; &#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xC790;&#xC138;&#xD55C; &#xC218;&#xCE58; &#xBC0F; &#xBE44;&#xAD50; &#xD45C;&#xB294; &#xC6D0;&#xBB38; &#xCC38;&#xACE0;)</p>
<h3 id="Query-Generation"><a href="#Query-Generation" class="headerlink" title="Query Generation"></a>Query Generation</h3><ul>
<li>1278&#xAC1C;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xC0D8;&#xD50C;&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xCFFC;&#xB9AC;&#xB97C; &#xC720;&#xD6A8;&#xD558;&#xAC8C; &#xC0DD;&#xC131;&#xD574; CPGQL&#xC744; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xD559;&#xC2B5;</li>
<li>50&#xAC1C; &#xC0D8;&#xD50C;&#xC5D0; &#xB300;&#xD55C; human-auditing &#xACB0;&#xACFC;, 76% &#xC0D8;&#xD50C;&#xC5D0;&#xC11C; &#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xB41C; &#xCF54;&#xB4DC;&#xAC00; &#xC758;&#xB3C4;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xC758;&#xBBF8;&#xB860;&#xC801;&#xC73C;&#xB85C; &#xC77C;&#xCE58;</li>
<li>&#xC624;&#xBD84;&#xB958;&#xB41C; 25&#xAC1C; &#xC0D8;&#xD50C;<ul>
<li>28%&#xB294; &#xCFFC;&#xB9AC;&#xAC00; &#xC758;&#xBBF8;&#xB860;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xD655;&#xD588;&#xC73C;&#xB098; LLMxCPG-D&#xAC00; &#xC798;&#xBABB; &#xBD84;&#xB958;</li>
<li>40%&#xB294; &#xC798;&#xBABB;&#xB41C; CWE &#xB3C4;&#xCD9C;</li>
<li>32%&#xB294; CWE&#xB97C; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xC2DD;&#xBCC4;&#xD588;&#xC9C0;&#xB9CC; &#xC911;&#xC694; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC694;&#xC18C; &#xAC80;&#xC0C9; &#xC2E4;&#xD328;</li>
</ul>
</li>
</ul>
<h3 id="Code-Reduction"><a href="#Code-Reduction" class="headerlink" title="Code Reduction"></a>Code Reduction</h3><ul>
<li>&#xC5EC;&#xB7EC; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC5D0;&#xC11C; &#xCD5C;&#xC18C; 67.87%, &#xCD5C;&#xB300; 90.93%&#xC758; &#xCF54;&#xB4DC; &#xC555;&#xCD95;&#xB960;</li>
</ul>
<h3 id="Function-level-Vulnerability-Detection"><a href="#Function-level-Vulnerability-Detection" class="headerlink" title="Function-level Vulnerability Detection"></a>Function-level Vulnerability Detection</h3><ul>
<li>&#xD2B9;&#xD788; &#xD568;&#xC218; &#xB808;&#xBCA8; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0;&#xC5D0; &#xB192;&#xC740; &#xC131;&#xB2A5;</li>
<li><p>&#xD2B9;&#xC815; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xBC84;&#xADF8; &#xD0C0;&#xC785;(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/119.html">CWE-119</a>, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/415.html">CWE-415</a>, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/416.html">CWE-416</a>, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://cwe.mitre.org/data/definitions/190.html">CWE-190</a>) &#xC5D0; &#xB300;&#xD574; &#xB192;&#xC740; &#xD0D0;&#xC9C0;&#xC728;</p>
<p>  <img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
</ul>
<h3 id="Generalizability"><a href="#Generalizability" class="headerlink" title="Generalizability"></a>Generalizability</h3><ul>
<li>&#xD568;&#xC218; &#xB808;&#xBCA8;&#xC5D0;&#xC11C;&#xC758; Generalizability&#xB294; &#xAE30;&#xC874;&#xC758; VulSim, VulBERTA-CNN, VulBERTA-MLP, ReGVD &#xBAA8;&#xB378; &#xB300;&#xBE44; &#xC815;&#xD655;&#xB3C4; 20% &#xD5A5;&#xC0C1;</li>
<li>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB808;&#xBCA8;&#xC5D0;&#xC11C;&#xB294; &#xBCF5;&#xC7A1;&#xC131; &#xC99D;&#xAC00;&#xC5D0;&#xB3C4; &#xC131;&#xB2A5; &#xC800;&#xD558; &#xC5C6;&#xC774; &#xC77C;&#xAD00;&#xB41C; &#xC131;&#xB2A5;&#xC744; &#xC720;&#xC9C0;</li>
<li>&#xC9C0;&#xC2DD; &#xB2E8;&#xC808; &#xC774;&#xD6C4; &#xC0C8;&#xB85C;&#xC6B4; &#xCDE8;&#xC57D;&#xC810; &#xD328;&#xD134;&#xC5D0; &#xB300;&#xD55C; &#xC77C;&#xBC18;&#xD654; &#xC131;&#xB2A5; &#xB610;&#xD55C; &#xC900;&#xC218;&#xD574; &#xC54C;&#xB824;&#xC9C4; CVE&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xADFC;&#xBCF8;&#xC801;&#xC778; &#xD2B9;&#xC131;&#xC744; &#xD559;&#xC2B5;&#xD55C; &#xAC83;&#xC744; &#xD655;&#xC778;</li>
</ul>
<h3 id="Misclassification-Analysis"><a href="#Misclassification-Analysis" class="headerlink" title="Misclassification Analysis"></a>Misclassification Analysis</h3><ul>
<li>CWE-120 (Classic Buffer Overflow) &#xBC0F; CWE-125 (Out-of-bounds Read)&#xC5D0;&#xC11C;&#xC758; &#xC131;&#xB2A5; &#xC800;&#xD558;<ul>
<li>&#xD6C8;&#xB828; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC5D0; &#xD574;&#xB2F9; CWE&#xC758; &#xC0D8;&#xD50C; &#xC218;&#xAC00; &#xC81C;&#xD55C;&#xC801;&#xC774;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC73C;&#xB85C;, &#xC774;&#xB294; &#xACE0;&#xD488;&#xC9C8; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC73C;&#xB85C; &#xD574;&#xACB0; &#xAC00;&#xB2A5;</li>
</ul>
</li>
</ul>
<h3 id="Robustness-to-Code-Augmentation"><a href="#Robustness-to-Code-Augmentation" class="headerlink" title="Robustness to Code Augmentation"></a>Robustness to Code Augmentation</h3><ul>
<li>&#xC758;&#xBBF8;&#xB860;&#xC801; &#xBCF4;&#xC874;&#xC5D0; &#xB300;&#xD55C; &#xB192;&#xC740; &#xC131;&#xB2A5;(&#xC8FC;&#xC11D; &#xC601;&#xD5A5;, &#xB370;&#xC774;&#xD130;&#xC14B; &#xC758;&#xC874;&#xC131;, &#xCF54;&#xB4DC; &#xBCC0;&#xD658; &#xB178;&#xC774;&#xC988;)</li>
<li>&#xB2E8;, T3 &#xBCC0;&#xD658;(&#xD568;&#xC218; &#xCD94;&#xCD9C;)&#xC740; &#xBAA8;&#xB378; &#xC131;&#xB2A5;, &#xADF8;&#xC911;&#xC5D0;&#xC11C;&#xB3C4; &#xC7AC;&#xD604;&#xC728;(recall)&#xC5D0; &#xD070; &#xC601;&#xD5A5;&#xC744; &#xC90C; &#x2192; &#xBAA8;&#xB378;&#xC774; T3 &#xBCC0;&#xD658;&#xC5D0; &#xB2E4;&#xC18C; &#xBBFC;&#xAC10;<ul>
<li>&#xD568;&#xC218; &#xCD94;&#xCD9C;&#xC740; &#xD568;&#xC218;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xB9AC;&#xD558;&#xC5EC; &#xC0C8;&#xB85C;&#xC6B4; &#xD568;&#xC218;&#xB97C; &#xB9CC;&#xB4E4;&#xAC70;&#xB098;, &#xC5EC;&#xB7EC; &#xD568;&#xC218;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xD558;&#xB098;&#xB85C; &#xD569;&#xCE58;&#xB294; &#xB4F1;&#xC758; &#xBCC0;&#xD658;</li>
<li>&#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xD658;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; CPG &#xB0B4;&#xC758; &#xD568;&#xC218; &#xBC0F; &#xB370;&#xC774;&#xD130;&#xC758; &#xD750;&#xB984; &#xB610;&#xB294; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xC640;&#xC758; &#xD638;&#xCD9C; &#xAD00;&#xACC4; &#xAD6C;&#xC870; &#xC790;&#xCCB4;&#xAC00; &#xC7AC;&#xAD6C;&#xC131;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB2E4;&#xB978; &#xBCC0;&#xD658;&#xC5D0; &#xBE44;&#xD574; &#xBAA8;&#xB378;&#xC758; &#xC131;&#xB2A5;&#xC5D0; &#xD070; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE68;</li>
</ul>
</li>
</ul>
<h1 id="Conclusion"><a href="#Conclusion" class="headerlink" title="Conclusion"></a>Conclusion</h1><p>LLMxCPG&#xB294; &#xC885;&#xD569;&#xC801;&#xC73C;&#xB85C; CPG &#xAE30;&#xBC18;&#xC758; &#xCF54;&#xB4DC; &#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xC744; &#xD1B5;&#xD574; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xC5EC; &#xCF54;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xCD5C;&#xC801;&#xD654;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xCD5C;&#xC801;&#xD654;&#xB294; LLM&#xC758; &#xD559;&#xC2B5; &#xD6A8;&#xC728;&#xC744; &#xB192;&#xC774;&#xACE0;, &#xAE30;&#xC874; &#xBAA8;&#xB378;&#xC758; &#xD55C;&#xACC4;&#xB97C; &#xADF9;&#xBCF5;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xCF54;&#xB4DC; &#xBCC0;&#xD658;&#xC5D0;&#xB3C4; &#xC758;&#xBBF8;&#xB860;&#xC801; &#xC77C;&#xAD00;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xBA70;, &#xBCF5;&#xC7A1;&#xD55C; &#xCF54;&#xB4DC;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC77C;&#xBC18;&#xD654; &#xC131;&#xB2A5;&#xC744; &#xD06C;&#xAC8C; &#xD5A5;&#xC0C1;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>&#xC800;&#xC790;&#xAC00; Limitations &#xD56D;&#xBAA9;&#xC5D0;&#xC11C;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xC9C0;&#xB9CC;, &#xCFFC;&#xB9AC; &#xBAA8;&#xB378;(<code>LLMxCPG-Q</code>)&#xC774; &#xB300;&#xADDC;&#xBAA8; &#xCF54;&#xB4DC;&#xBCA0;&#xC774;&#xC2A4;&#xB97C; &#xC804;&#xCC98;&#xB9AC;&#xD560; &#xB54C;&#xC758; &#xCEF4;&#xD4E8;&#xD305; &#xD30C;&#xC6CC; &#xC758;&#xC874;&#xC131;&#xC744; &#xD074;&#xB9AC;&#xC5B4;&#xD558;&#xAC8C; &#xD574;&#xACB0;&#xD558;&#xAE30;&#xB294; &#xC5B4;&#xB835;&#xACE0;, CPG &#xC790;&#xCCB4;&#xC758; &#xD55C;&#xACC4;&#xC778; &#xB7F0;&#xD0C0;&#xC784; &#xC18D;&#xC131;&#xC758; race condition&#xC774;&#xB098; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1; &#xC5D0;&#xB7EC;&#xC640; &#xAC19;&#xC740; &#xD0C0;&#xC785;&#xC758; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0;&#xC758; &#xC5B4;&#xB824;&#xC6C0;&#xB3C4; &#xADF8;&#xB300;&#xB85C; &#xACC4;&#xC2B9;&#xD574; &#xD55C;&#xACC4;&#xAC00; &#xBA85;&#xD655;&#xD558;&#xAE34; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xB3C4; &#xC6D0;&#xBCF8; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB828;&#xB41C; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; CPG &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC758;&#xBBF8;&#xB860;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xC0DD;&#xC131; &#xBC0F; &#xC555;&#xCD95;&#xD574; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xC640; &#xC2E4;&#xD604;&#xC774; &#xD765;&#xBBF8;&#xB85C;&#xC6E0;&#xB124;&#xC694;. LLM&#xC758; &#xCD94;&#xB860; &#xB2A5;&#xB825;&#xACFC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD06C;&#xAE30;&#xB294; &#xAC08;&#xC218;&#xB85D; &#xBC1C;&#xC804;&#xD558;&#xACE0; &#xC788;&#xC9C0;&#xB9CC;, &#xBAA8;&#xB378; &#xC131;&#xB2A5; &#xD5A5;&#xC0C1;&#xB9CC; &#xAE30;&#xB2E4;&#xB9AC;&#xB294; &#xAC83; &#xBCF4;&#xB2E8; &#xC774;&#xB7EC;&#xD55C; &#xCD5C;&#xC801;&#xD654; &#xC5F0;&#xAD6C;&#xB97C; &#xACE0;&#xB3C4;&#xD654;&#xD558;&#xBA74; &#xB354; &#xBE60;&#xB974;&#xACE0; &#xC815;&#xD655;&#xD55C; &#xCDE8;&#xC57D;&#xC810; &#xD0D0;&#xC9C0; &#xC790;&#xB3D9;&#xD654;&#xB97C; &#xC55E;&#xB2F9;&#xAE38; &#xC218; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8; &#xC678; &#xAD6C;&#xD604; &#xD30C;&#xD2B8;&#xB294; &#xB2E4;&#xB8E8;&#xC9C0; &#xBABB;&#xD588;&#xB294;&#xB370;, &#xACF5;&#xAC1C;&#xB41C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/qcri/llmxcpg">&#xC18C;&#xC2A4;&#xCF54;&#xB4DC;</a>&#xC640; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://huggingface.co/collections/QCRI/llmxcpg-6855f80e601774b43eba2d14">&#xBAA8;&#xB378;</a>&#xC744; &#xC368;&#xBCF8; &#xB4A4; &#xB9AC;&#xBDF0; &#xD30C;&#xD2B8; 2&#xB85C; &#xB3CC;&#xC544;&#xC62C; &#xC218;&#xB3C4; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC544;&#xC694;.&#xAD00;&#xC2EC; &#xC788;&#xB294; &#xBD84;&#xB4E4;&#xC740; &#xBA3C;&#xC800; &#xC0B4;&#xD3B4;&#xBCF4;&#xC2DC;&#xBA74; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC55E;&#xC73C;&#xB85C; &#xC885;&#xC885; &#xC7AC;&#xBC0C;&#xB294; &#xB17C;&#xBB38; &#xB9AC;&#xBDF0;&#xB85C; &#xB610; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;~</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/review/">review</a>
                  
                  <a class="hover-with-bg" href="/tags/llm/">llm</a>
                  
                  <a class="hover-with-bg" href="/tags/usenix/">usenix</a>
                  
                  <a class="hover-with-bg" href="/tags/cpg/">cpg</a>
                  
                  <a class="hover-with-bg" href="/tags/vulnerability-detection/">vulnerability detection</a>
                  
                  <a class="hover-with-bg" href="/tags/paper/">paper</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/09/22/l0ch/llmxcpg_paper_review/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/09/20/bekim/2025-09-20/">
                    <span class="hidden-mobile">[하루한줄] CVE-2025-53770(RCE), CVE-2025-53771(Authentication bypass) :Microsoft SharePoint 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/09/22/l0ch/llmxcpg_paper_review/kr/';
        this.page.identifier = '/2025/09/22/l0ch/llmxcpg_paper_review/kr/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] “LLMxCPG: Context-Aware Vulnerability Detection Through Code Property Graph-Guided Large Language Models” Paper Review (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
