

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, hunjison &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#x2026; &amp;#xC5EC;&amp;#xAE30; &amp;#xC800;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC8E0;? &amp;#x1F440; &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC815;&amp;#xC791; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xCDE8;&amp;#xC5C5;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;&amp;#x2026;. &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;&lt;/strong&gt;&amp;#xB294; &amp;#xCE7C;&amp;#xB7FC;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&amp;#xB3C4; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F4;&amp;#xC544; &amp;#xBCF4;&amp;#xC558;&amp;#xC5B4;&amp;#xC694; &amp;#x1F4A5;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.11 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://boannews.com/media/view.asp?idx=130004&amp;amp;page=5&amp;amp;kind=3&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;*&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC758;&amp;#xACAC;&amp;#xC744; &amp;#xB367;&amp;#xBD99;&amp;#xC5EC; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image01.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#x2026;&amp;#x201D;&lt;/strong&gt; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#xB298; &amp;#xD558;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC815;&amp;#xC791; &amp;#xCDE8;&amp;#xC900;&amp;#xC0DD;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;&amp;#xC628;&amp;#xAC16; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;, &amp;#xD559;&amp;#xBC8C;, &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC5C5;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/strong&gt;&amp;#xACE0; &amp;#xD558;&amp;#xC18C;&amp;#xC5F0;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB41C; &amp;#xC77C;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC740; SailPoint CISO Rex Booth&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#x2019;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xD559;&amp;#xC704;&amp;#xB97C; &amp;#xC5EC;&amp;#xB7FF; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xC218;&amp;#xB144; &amp;#xAC04;&amp;#xC758; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xACFC; &amp;#xD559;&amp;#xC704;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC18C;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC6D0;, &amp;#xC18C;&amp;#xC704; &amp;#x2018;&amp;#xC6B0;&amp;#xC218;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#x2019;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xD5E4;&amp;#xB4DC;&amp;#xD5CC;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xACBD;&amp;#xC7C1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC6B0;&amp;#xC218;&amp;#xD55C; &amp;#xC778;&amp;#xB825;&amp;#xACFC; &amp;#xC6B0;&amp;#xC218;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC778;&amp;#xB825;, &amp;#xC989; &amp;#xD751;&amp;#xBC31;&amp;#xB17C;&amp;#xB9AC;&amp;#xB85C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xAC00;&amp;#xB974;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC560;&amp;#xCD08;&amp;#xC5D0; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB192;&amp;#xC73C;&amp;#xB2C8; &amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xAC00; &amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xC778;&amp;#xC7AC;&amp;#xB4E4;&amp;#xC774; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#x2019;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xBCBD;&amp;#xC744; &amp;#xB290;&amp;#xB07C;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xBE60;&amp;#xC838; &amp;#xB098;&amp;#xAC00;&amp;#xB294; &amp;#xC911;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#x2018;&amp;#xD0C8;(&amp;#x812B;) &amp;#xBCF4;&amp;#xC548;&amp;#xC774; &amp;#xB2F5;&amp;#xC774;&amp;#xB2E4;&amp;#x2019;&amp;#xB77C;&amp;#xBA70; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774;&amp;#xB098; IT &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xC804;&amp;#xD5A5;&amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC2EC;&amp;#xC2EC;&amp;#xCE58; &amp;#xC54A;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F627;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9C8;&amp;#xC8FC;&amp;#xD55C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;, &amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xB208;&amp;#xB192;&amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC900;&amp;#xBE44;&amp;#xD574; &amp;#xB098;&amp;#xAC08; &amp;#xC218; &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5ED;&amp;#xC124;&amp;#xC801;&amp;#xC774;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xACFC; &amp;#xD559;&amp;#xC704;&amp;#xAC00;, &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB113;&amp;#xAC8C; &amp;#x2018;&amp;#xADF8;&amp;#xB7F4; &amp;#xB4EF;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#x2019;&amp;#xAC00; &amp;#xC774;&amp;#xB825;&amp;#xC11C;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD559;&amp;#xC0DD;&amp;#xB4E4;&amp;#xC774; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5F0;&amp;#xD569; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;(&lt;a href=&#34;https://kisia.or.kr/talent_support/kucis_info/&#34;&gt;KUCIS&lt;/a&gt;, CCA &amp;#xB4F1;) &amp;#xD639;&amp;#xC740; &amp;#xB300;&amp;#xC678; &amp;#xD65C;&amp;#xB3D9;(BoB &amp;#xB4F1;)&amp;#xB4E4;&amp;#xC774; &amp;#xADF8;&amp;#xB7EC;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574; &amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xACFC; &amp;#xB2A5;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xB274;&amp;#xBE44;&amp;#x2019;&amp;#xB4E4;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC778;&amp;#xC815; &amp;#xBC1B;&amp;#xACE0; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xADFC;&amp;#xBB34;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5EC;&amp;#xAC74;&amp;#xC774; &amp;#xB9C8;&amp;#xB828;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F625;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294; Sleepy Pickle &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.13 | TheHackerNews | &lt;a href=&#34;https://thehackernews.com/2024/06/new-attack-technique-sleepy-pickle.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image02.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;! &amp;#x1F61D;&lt;/p&gt;
&lt;p&gt;Pickle&amp;#xC740; PyTorch&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Serialization) &amp;#xD615;&amp;#xC2DD;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB780; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#x2018;Sleepy Pickle&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD88;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xCC98;&amp;#xB7FC; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;strong&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xD45C;&amp;#xC801;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC740;&amp;#xBC00;&amp;#xD558;&amp;#xACE0;(Stealthy) &amp;#xAE30;&amp;#xBC1C;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &amp;#x1F4AF;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &lt;a href=&#34;https://github.com/trailofbits/fickling&#34;&gt;Fickling&lt;/a&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD53C;&amp;#xD074; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xD53C;&amp;#xD074; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Deserialization)&lt;/a&gt;&amp;#xD558;&amp;#xBA74; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; 1) &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC218;&amp;#xC815;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, 2) &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, 3) &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x2620;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;Hugging Face&lt;/a&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x1F928;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; UNC5537&amp;#xC758; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C8;&amp;#xCDE8; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.11 | Google | &lt;a href=&#34;https://cloud.google.com/blog/topics/threat-intelligence/unc5537-snowflake-data-theft-extortion?hl=en&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;UNC5537&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACE0;&amp;#xAC1D; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xCCB4;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCE68;&amp;#xD574;&amp;#xD558;&amp;#xC5EC; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F621;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image03.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C;(Snowflake)&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC6E8;&amp;#xC5B4;&amp;#xD558;&amp;#xC6B0;&amp;#xC2A4;(Data Warehouse) &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5;/&amp;#xBD84;&amp;#xC11D;/&amp;#xACF5;&amp;#xC720;/&amp;#xCC98;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xB294; AWS, Azure, GCP &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC778;&amp;#xD504;&amp;#xB77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B4;&amp;#xC601;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC0B0;&amp;#xC5C5; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBAA8;&amp;#xC5EC; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;? &lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;(Infostealer)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD68D;&amp;#xB4DD;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD588;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xB2F9;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xC99D;(Multi-Factor Authentication)&lt;/a&gt;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB410;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xB0B4; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C;, &amp;#xB098; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xBE45;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xAC01;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xB054;&amp;#xCC0D;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;. &amp;#x1F975; &amp;#xD68C;&amp;#xC0AC; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; &amp;#xAC1C;&amp;#xC778; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0;, &amp;#xC815;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xAC10;&amp;#xC5FC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xC704;, AI &amp;#xC751;&amp;#xC6A9;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; SKT&amp;#xC5D0;&amp;#xC774;&amp;#xB2F7;&amp;#xB7;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB7;DeepL&amp;#xB7;&amp;#xBDF0;&amp;#xB178; &amp;#xC0AC;&amp;#xC804; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC;&amp;#xB294;?&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.13 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://boannews.com/media/view.asp?idx=130576&amp;amp;page=2&amp;amp;kind=2&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xC704;&amp;#xC6D0;&amp;#xD68C;&amp;#xC5D0;&amp;#xC11C; AI &amp;#xAE30;&amp;#xBC18; &amp;#xC751;&amp;#xC6A9;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; SKT, &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;, DeepL, &amp;#xBDF0;&amp;#xB178; 4&amp;#xAC1C; &amp;#xC0AC;&amp;#xC5C5;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0AC;&amp;#xC804; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F440; &amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC; SKT&amp;#xC640; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB294; &amp;#xC2DC;&amp;#xC815; &amp;#xBC0F; &amp;#xAC1C;&amp;#xC120;&amp;#xAD8C;&amp;#xACE0;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xACE0;, DeepL&amp;#xACFC; &amp;#xBDF0;&amp;#xB178;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F60D;&lt;/p&gt;
&lt;p&gt;SKT&amp;#xC758; AI &amp;#xAC1C;&amp;#xC778;&amp;#xBE44;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#x2018;&amp;#xC5D0;&amp;#xC774;&amp;#xB2F7;&amp;#x2019;&amp;#xC740; &amp;#xD1B5;&amp;#xD654; &amp;#xB179;&amp;#xC74C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; SKT &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xC5EC; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C; &amp;#xBCF4;&amp;#xAD00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D; &amp;#xAE30;&amp;#xB85D;&amp;#xC774; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2DC;&amp;#xC815; &amp;#xAD8C;&amp;#xACE0;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#x1F528; &lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7;&amp;#xCC98;&amp;#xB9AC;&amp;#xD568;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xCC98;&amp;#xB9AC;&amp;#xBC29;&amp;#xCE68;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC548;&amp;#xB0B4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; &amp;#xC2DC;&amp;#xC815; &amp;#xAD8C;&amp;#xACE0;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;AI&amp;#xAC00; &amp;#xC2DC;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB85C; &amp;#xC790;&amp;#xB9AC; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#xC55E;&amp;#xB2E4;&amp;#xD248; AI &amp;#xAE30;&amp;#xBC18; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD9C;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xD750;&amp;#xB984; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC18C;&amp;#xC911;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xC810;&amp;#xAC80;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBD84;&amp;#xC57C;&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;! &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB3C4; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x2763;&amp;#xFE0F;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Serialization)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB098; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xBCC0;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Deserialization)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB098; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Hugging Face&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;(AI)&amp;#xACFC; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD;(ML)&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;(AI) &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xC99D;(Multi-Factor Authentication)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC554;&amp;#xD638; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC911; &amp;#xB2E8;&amp;#xACC4; &amp;#xACC4;&amp;#xC815; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://boannews.com/media/view.asp?idx=130512&amp;amp;page=4&amp;amp;kind=3&#34;&gt;2024&amp;#xB144; 6&amp;#xC6D4; &amp;#xC14B;&amp;#xC9F8; &amp;#xC8FC;, LH&amp;#xB7;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD398;&amp;#xC774;&amp;#xB7;&amp;#xBE44;&amp;#xBC14;&amp;#xB9AC;&amp;#xD37C;&amp;#xBE14;&amp;#xB9AC;&amp;#xCE74; &amp;#xB4F1; &amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825; &amp;#xCC44;&amp;#xC6A9;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/security/new-phishing-toolkit-uses-pwas-to-steal-login-credentials/&#34;&gt;New phishing toolkit uses PWAs to steal login credentials&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://boannews.com/media/view.asp?idx=130570&amp;amp;page=2&amp;amp;kind=5&#34;&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95; &amp;#x2018;&amp;#xC704;&amp;#xD611; &amp;#xD5CC;&amp;#xD305;&amp;#x2019; , &amp;#xC120;&amp;#xC81C;&amp;#xC801; &amp;#xB300;&amp;#xC751;&amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xBAA9;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.reddit.com/r/privacy/comments/1de8ofk/youtube_is_currently_experimenting_with/&#34;&gt;YouTube is currently experimenting with server-side ad injection&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true&#34;&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; &lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;&lt;/a&gt;| &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | 2024.06.20&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://research.samsung.com/scpc&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~24.08.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/1014&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;amp;bbsNo=11489&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8; 2&amp;#xAE30;&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.06.17 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] ì‚¬ì´ë²„ ë³´ì•ˆ ì¸ë ¥ì´ ë¶€ì¡±í•˜ë‹¤ëŠ” ê±´ ê±°ì§“ë§ì´ë‹¤?! - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, hunjison &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#x2026; &amp;#xC5EC;&amp;#xAE30; &amp;#xC800;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC8E0;? &amp;#x1F440; &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC815;&amp;#xC791; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xCDE8;&amp;#xC5C5;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;&amp;#x2026;. &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;&lt;/strong&gt;&amp;#xB294; &amp;#xCE7C;&amp;#xB7FC;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&amp;#xB3C4; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F4;&amp;#xC544; &amp;#xBCF4;&amp;#xC558;&amp;#xC5B4;&amp;#xC694; &amp;#x1F4A5;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.11 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://boannews.com/media/view.asp?idx=130004&amp;amp;page=5&amp;amp;kind=3&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;*&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC758;&amp;#xACAC;&amp;#xC744; &amp;#xB367;&amp;#xBD99;&amp;#xC5EC; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image01.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#x2026;&amp;#x201D;&lt;/strong&gt; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#xB298; &amp;#xD558;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC815;&amp;#xC791; &amp;#xCDE8;&amp;#xC900;&amp;#xC0DD;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;&amp;#xC628;&amp;#xAC16; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;, &amp;#xD559;&amp;#xBC8C;, &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC5C5;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/strong&gt;&amp;#xACE0; &amp;#xD558;&amp;#xC18C;&amp;#xC5F0;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB41C; &amp;#xC77C;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC740; SailPoint CISO Rex Booth&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCE7C;&amp;#xB7FC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#x2019;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xD559;&amp;#xC704;&amp;#xB97C; &amp;#xC5EC;&amp;#xB7FF; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xC218;&amp;#xB144; &amp;#xAC04;&amp;#xC758; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xACFC; &amp;#xD559;&amp;#xC704;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC18C;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC6D0;, &amp;#xC18C;&amp;#xC704; &amp;#x2018;&amp;#xC6B0;&amp;#xC218;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825;&amp;#x2019;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xD5E4;&amp;#xB4DC;&amp;#xD5CC;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xACBD;&amp;#xC7C1;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC6B0;&amp;#xC218;&amp;#xD55C; &amp;#xC778;&amp;#xB825;&amp;#xACFC; &amp;#xC6B0;&amp;#xC218;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC778;&amp;#xB825;, &amp;#xC989; &amp;#xD751;&amp;#xBC31;&amp;#xB17C;&amp;#xB9AC;&amp;#xB85C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC744; &amp;#xAC00;&amp;#xB974;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC560;&amp;#xCD08;&amp;#xC5D0; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB192;&amp;#xC73C;&amp;#xB2C8; &amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xAC00; &amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xC778;&amp;#xC7AC;&amp;#xB4E4;&amp;#xC774; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#x2019;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xBCBD;&amp;#xC744; &amp;#xB290;&amp;#xB07C;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xBE60;&amp;#xC838; &amp;#xB098;&amp;#xAC00;&amp;#xB294; &amp;#xC911;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#x2018;&amp;#xD0C8;(&amp;#x812B;) &amp;#xBCF4;&amp;#xC548;&amp;#xC774; &amp;#xB2F5;&amp;#xC774;&amp;#xB2E4;&amp;#x2019;&amp;#xB77C;&amp;#xBA70; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774;&amp;#xB098; IT &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xC804;&amp;#xD5A5;&amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC2EC;&amp;#xC2EC;&amp;#xCE58; &amp;#xC54A;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F627;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9C8;&amp;#xC8FC;&amp;#xD55C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;, &amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xB208;&amp;#xB192;&amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC900;&amp;#xBE44;&amp;#xD574; &amp;#xB098;&amp;#xAC08; &amp;#xC218; &amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5ED;&amp;#xC124;&amp;#xC801;&amp;#xC774;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC790;&amp;#xACA9;&amp;#xC99D;&amp;#xACFC; &amp;#xD559;&amp;#xC704;&amp;#xAC00;, &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB113;&amp;#xAC8C; &amp;#x2018;&amp;#xADF8;&amp;#xB7F4; &amp;#xB4EF;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#x2019;&amp;#xAC00; &amp;#xC774;&amp;#xB825;&amp;#xC11C;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xD559;&amp;#xC0DD;&amp;#xB4E4;&amp;#xC774; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5F0;&amp;#xD569; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC;(&lt;a href=&#34;https://kisia.or.kr/talent_support/kucis_info/&#34;&gt;KUCIS&lt;/a&gt;, CCA &amp;#xB4F1;) &amp;#xD639;&amp;#xC740; &amp;#xB300;&amp;#xC678; &amp;#xD65C;&amp;#xB3D9;(BoB &amp;#xB4F1;)&amp;#xB4E4;&amp;#xC774; &amp;#xADF8;&amp;#xB7EC;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574; &amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xACFC; &amp;#xB2A5;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#x2018;&amp;#xBCF4;&amp;#xC548; &amp;#xB274;&amp;#xBE44;&amp;#x2019;&amp;#xB4E4;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC778;&amp;#xC815; &amp;#xBC1B;&amp;#xACE0; &amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xADFC;&amp;#xBB34;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5EC;&amp;#xAC74;&amp;#xC774; &amp;#xB9C8;&amp;#xB828;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F625;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294; Sleepy Pickle &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.13 | TheHackerNews | &lt;a href=&#34;https://thehackernews.com/2024/06/new-attack-technique-sleepy-pickle.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image02.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;! &amp;#x1F61D;&lt;/p&gt;
&lt;p&gt;Pickle&amp;#xC740; PyTorch&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Serialization) &amp;#xD615;&amp;#xC2DD;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB780; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#x2018;Sleepy Pickle&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD88;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xCC98;&amp;#xB7FC; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;strong&gt;&amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xD45C;&amp;#xC801;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC740;&amp;#xBC00;&amp;#xD558;&amp;#xACE0;(Stealthy) &amp;#xAE30;&amp;#xBC1C;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &amp;#x1F4AF;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &lt;a href=&#34;https://github.com/trailofbits/fickling&#34;&gt;Fickling&lt;/a&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD53C;&amp;#xD074; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xD53C;&amp;#xD074; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Deserialization)&lt;/a&gt;&amp;#xD558;&amp;#xBA74; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; 1) &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC218;&amp;#xC815;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, 2) &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, 3) &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x2620;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;Hugging Face&lt;/a&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x1F928;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; UNC5537&amp;#xC758; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C8;&amp;#xCDE8; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.11 | Google | &lt;a href=&#34;https://cloud.google.com/blog/topics/threat-intelligence/unc5537-snowflake-data-theft-extortion?hl=en&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;UNC5537&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACE0;&amp;#xAC1D; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xCCB4;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCE68;&amp;#xD574;&amp;#xD558;&amp;#xC5EC; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F621;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/17/hunjison/newsletter0617/image03.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C;(Snowflake)&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC6E8;&amp;#xC5B4;&amp;#xD558;&amp;#xC6B0;&amp;#xC2A4;(Data Warehouse) &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5;/&amp;#xBD84;&amp;#xC11D;/&amp;#xACF5;&amp;#xC720;/&amp;#xCC98;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xB294; AWS, Azure, GCP &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC778;&amp;#xD504;&amp;#xB77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B4;&amp;#xC601;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC0B0;&amp;#xC5C5; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBAA8;&amp;#xC5EC; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;? &lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;(Infostealer)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD68D;&amp;#xB4DD;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD588;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xB2F9;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xC99D;(Multi-Factor Authentication)&lt;/a&gt;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB410;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xB0B4; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C;, &amp;#xB098; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xBE45;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC0DD;&amp;#xAC01;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xB054;&amp;#xCC0D;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;. &amp;#x1F975; &amp;#xD68C;&amp;#xC0AC; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; &amp;#xAC1C;&amp;#xC778; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0;, &amp;#xC815;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xAC10;&amp;#xC5FC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xC704;, AI &amp;#xC751;&amp;#xC6A9;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; SKT&amp;#xC5D0;&amp;#xC774;&amp;#xB2F7;&amp;#xB7;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB7;DeepL&amp;#xB7;&amp;#xBDF0;&amp;#xB178; &amp;#xC0AC;&amp;#xC804; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC;&amp;#xB294;?&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.13 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://boannews.com/media/view.asp?idx=130576&amp;amp;page=2&amp;amp;kind=2&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xC704;&amp;#xC6D0;&amp;#xD68C;&amp;#xC5D0;&amp;#xC11C; AI &amp;#xAE30;&amp;#xBC18; &amp;#xC751;&amp;#xC6A9;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; SKT, &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;, DeepL, &amp;#xBDF0;&amp;#xB178; 4&amp;#xAC1C; &amp;#xC0AC;&amp;#xC5C5;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0AC;&amp;#xC804; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F440; &amp;#xC810;&amp;#xAC80; &amp;#xACB0;&amp;#xACFC; SKT&amp;#xC640; &amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB294; &amp;#xC2DC;&amp;#xC815; &amp;#xBC0F; &amp;#xAC1C;&amp;#xC120;&amp;#xAD8C;&amp;#xACE0;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xACE0;, DeepL&amp;#xACFC; &amp;#xBDF0;&amp;#xB178;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F60D;&lt;/p&gt;
&lt;p&gt;SKT&amp;#xC758; AI &amp;#xAC1C;&amp;#xC778;&amp;#xBE44;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#x2018;&amp;#xC5D0;&amp;#xC774;&amp;#xB2F7;&amp;#x2019;&amp;#xC740; &amp;#xD1B5;&amp;#xD654; &amp;#xB179;&amp;#xC74C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; SKT &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xC5EC; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C; &amp;#xBCF4;&amp;#xAD00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D; &amp;#xAE30;&amp;#xB85D;&amp;#xC774; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2DC;&amp;#xC815; &amp;#xAD8C;&amp;#xACE0;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#x1F528; &lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB178;&amp;#xC6B0;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7;&amp;#xCC98;&amp;#xB9AC;&amp;#xD568;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xCC98;&amp;#xB9AC;&amp;#xBC29;&amp;#xCE68;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC548;&amp;#xB0B4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; &amp;#xC2DC;&amp;#xC815; &amp;#xAD8C;&amp;#xACE0;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;AI&amp;#xAC00; &amp;#xC2DC;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB85C; &amp;#xC790;&amp;#xB9AC; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC774; &amp;#xC55E;&amp;#xB2E4;&amp;#xD248; AI &amp;#xAE30;&amp;#xBC18; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD9C;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xD750;&amp;#xB984; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC18C;&amp;#xC911;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xC810;&amp;#xAC80;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBD84;&amp;#xC57C;&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;! &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xB3C4; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x2763;&amp;#xFE0F;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Serialization)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB098; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xBCC0;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC5ED;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;(Deserialization)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xB82C;&amp;#xD654;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&amp;#xB098; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Hugging Face&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;(AI)&amp;#xACFC; &amp;#xBA38;&amp;#xC2E0;&amp;#xB7EC;&amp;#xB2DD;(ML)&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;(AI) &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xC99D;(Multi-Factor Authentication)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC554;&amp;#xD638; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC911; &amp;#xB2E8;&amp;#xACC4; &amp;#xACC4;&amp;#xC815; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://boannews.com/media/view.asp?idx=130512&amp;amp;page=4&amp;amp;kind=3&#34;&gt;2024&amp;#xB144; 6&amp;#xC6D4; &amp;#xC14B;&amp;#xC9F8; &amp;#xC8FC;, LH&amp;#xB7;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD398;&amp;#xC774;&amp;#xB7;&amp;#xBE44;&amp;#xBC14;&amp;#xB9AC;&amp;#xD37C;&amp;#xBE14;&amp;#xB9AC;&amp;#xCE74; &amp;#xB4F1; &amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xB825; &amp;#xCC44;&amp;#xC6A9;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/security/new-phishing-toolkit-uses-pwas-to-steal-login-credentials/&#34;&gt;New phishing toolkit uses PWAs to steal login credentials&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://boannews.com/media/view.asp?idx=130570&amp;amp;page=2&amp;amp;kind=5&#34;&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95; &amp;#x2018;&amp;#xC704;&amp;#xD611; &amp;#xD5CC;&amp;#xD305;&amp;#x2019; , &amp;#xC120;&amp;#xC81C;&amp;#xC801; &amp;#xB300;&amp;#xC751;&amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xBAA9;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.reddit.com/r/privacy/comments/1de8ofk/youtube_is_currently_experimenting_with/&#34;&gt;YouTube is currently experimenting with server-side ad injection&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true&#34;&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; &lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;&lt;/a&gt;| &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | 2024.06.20&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://research.samsung.com/scpc&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~24.08.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/1014&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;amp;bbsNo=11489&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8; 2&amp;#xAE30;&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.06.17 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/Newsletter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/06/17/hunjison/newsletter0617/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] ì‚¬ì´ë²„ ë³´ì•ˆ ì¸ë ¥ì´ ë¶€ì¡±í•˜ë‹¤ëŠ” ê±´ ê±°ì§“ë§ì´ë‹¤?! - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-06-17 15:00" pubdate>
      2024ë…„ 6ì›” 17ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.4k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      47
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] ì‚¬ì´ë²„ ë³´ì•ˆ ì¸ë ¥ì´ ë¶€ì¡±í•˜ë‹¤ëŠ” ê±´ ê±°ì§“ë§ì´ë‹¤?!</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, hunjison &#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xC778;&#xB825;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xB294; &#xB9D0;&#x2026; &#xC5EC;&#xAE30; &#xC800;&#xAE30;&#xC5D0;&#xC11C; &#xB9CE;&#xC774; &#xB4E4;&#xC5B4;&#xBCF4;&#xC168;&#xC8E0;? &#x1F440; &#xADF8;&#xB7F0;&#xB370; &#xC815;&#xC791; &#xC8FC;&#xBCC0;&#xC744; &#xBCF4;&#xBA74; &#xCDE8;&#xC5C5;&#xD558;&#xAE30;&#xAC00; &#xC27D;&#xC9C0; &#xC54A;&#xC740; &#xAC83; &#xAC19;&#xC544;&#xC694;&#x2026;. &#x1F631;</p>
<p><strong>&#x201C;&#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xC778;&#xB825;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xB294; &#xAC74; &#xAC70;&#xC9D3;&#xB9D0;&#xC774;&#xB2E4;&#x201D;</strong>&#xB294; &#xCE7C;&#xB7FC;&#xACFC; &#xD568;&#xAED8; &#xC774;&#xBC88; &#xC8FC; &#xB274;&#xC2A4;&#xB808;&#xD130;&#xB3C4; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC774;&#xC57C;&#xAE30;&#xB4E4;&#xC744; &#xB2F4;&#xC544; &#xBCF4;&#xC558;&#xC5B4;&#xC694; &#x1F4A5;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x1F5E3;&#xFE0F; <strong>&#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xC778;&#xB825;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xB294; &#xAC74; &#xAC70;&#xC9D3;&#xB9D0;&#xC774;&#xB2E4;</strong></p>
</blockquote>
<p>2024.06.11 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://boannews.com/media/view.asp?idx=130004&amp;page=5&amp;kind=3">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>*&#xC628;&#xB77C;&#xC778; &#xCE7C;&#xB7FC;&#xC5D0; &#xAC1C;&#xC778;&#xC801;&#xC778; &#xC758;&#xACAC;&#xC744; &#xB367;&#xBD99;&#xC5EC; &#xC791;&#xC131;&#xD55C; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;.<br><img src="/2024/06/17/hunjison/newsletter0617/image01.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p><strong>&#x201C;&#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xC778;&#xB825;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#x2026;&#x201D;</strong> &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#xB298; &#xD558;&#xB294; &#xB9D0;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xC815;&#xC791; &#xCDE8;&#xC900;&#xC0DD;&#xB4E4;&#xC740; <strong>&#xC628;&#xAC16; &#xC790;&#xACA9;&#xC99D;, &#xD559;&#xBC8C;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xAC00;&#xC9C0;&#xACE0;&#xB3C4; &#xCDE8;&#xC5C5;&#xC774; &#xC798; &#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;</strong>&#xACE0; &#xD558;&#xC18C;&#xC5F0;&#xD558;&#xB294;&#xB370;, &#xC5B4;&#xB5BB;&#xAC8C; &#xB41C; &#xC77C;&#xC77C;&#xAE4C;&#xC694;? &#x1F631;</p>
<p>&#xD574;&#xB2F9; &#xCE7C;&#xB7FC;&#xC740; SailPoint CISO Rex Booth&#xAC00; &#xC791;&#xC131;&#xD55C; &#xCE7C;&#xB7FC;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#x2018;&#xBCF4;&#xC548; &#xC804;&#xBB38;&#xAC00;&#x2019;&#xB97C; &#xCC3E;&#xC744; &#xB54C; &#xC790;&#xACA9;&#xC99D;&#xC774;&#xB098; &#xD559;&#xC704;&#xB97C; &#xC5EC;&#xB7FF; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC73C;&#xBA74;&#xC11C; &#xC218;&#xB144; &#xAC04;&#xC758; &#xACBD;&#xD5D8;&#xC744; &#xAC00;&#xC9C4; &#xC0AC;&#xB78C;&#xC744; &#xCC3E;&#xB294;&#xB2E4;&#xACE0; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC790;&#xACA9;&#xC99D;&#xACFC; &#xD559;&#xC704;&#xB97C; &#xAC00;&#xC9C4; &#xC18C;&#xC218;&#xC758; &#xC778;&#xC6D0;, &#xC18C;&#xC704; &#x2018;&#xC6B0;&#xC218;&#xD55C; &#xBCF4;&#xC548; &#xC778;&#xB825;&#x2019;&#xC744; &#xB450;&#xACE0; &#xAE30;&#xC5C5;&#xACFC; &#xD5E4;&#xB4DC;&#xD5CC;&#xD130;&#xB4E4;&#xC774; &#xC11C;&#xB85C; &#xACBD;&#xC7C1;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<p>&#xBB38;&#xC81C;&#xB294; &#xC774;&#xB807;&#xAC8C; &#xC6B0;&#xC218;&#xD55C; &#xC778;&#xB825;&#xACFC; &#xC6B0;&#xC218;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC778;&#xB825;, &#xC989; &#xD751;&#xBC31;&#xB17C;&#xB9AC;&#xB85C; &#xC0AC;&#xB78C;&#xC744; &#xAC00;&#xB974;&#xB294; &#xB370;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC560;&#xCD08;&#xC5D0; &#xAE30;&#xC900;&#xC774; &#xB108;&#xBB34; &#xB192;&#xC73C;&#xB2C8; &#xCD08;&#xC2EC;&#xC790;&#xB4E4;&#xC774; &#xC811;&#xADFC;&#xD558;&#xB824; &#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xC8E0;. &#xBCF4;&#xC548; &#xC804;&#xBB38;&#xAC00;&#xAC00; &#xB420; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xB294; &#xC218;&#xB9CE;&#xC740; &#xC778;&#xC7AC;&#xB4E4;&#xC774; &#x2018;&#xBCF4;&#xC548; &#xC804;&#xBB38;&#xAC00;&#x2019;&#xC758; &#xB192;&#xC740; &#xBCBD;&#xC744; &#xB290;&#xB07C;&#xACE0; &#xB2E4;&#xB978; &#xBD84;&#xC57C;&#xB85C; &#xBE60;&#xC838; &#xB098;&#xAC00;&#xB294; &#xC911;&#xC785;&#xB2C8;&#xB2E4;. &#xC81C; &#xC8FC;&#xBCC0;&#xC5D0;&#xC11C;&#xB3C4; &#x2018;&#xD0C8;(&#x812B;) &#xBCF4;&#xC548;&#xC774; &#xB2F5;&#xC774;&#xB2E4;&#x2019;&#xB77C;&#xBA70; &#xAC1C;&#xBC1C;&#xC774;&#xB098; IT &#xBD84;&#xC57C;&#xB85C; &#xC804;&#xD5A5;&#xD55C; &#xC0AC;&#xB78C;&#xC774; &#xC2EC;&#xC2EC;&#xCE58; &#xC54A;&#xAC8C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4; &#x1F627;</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC0C1;&#xD669;&#xC744; &#xB9C8;&#xC8FC;&#xD55C; &#xC6B0;&#xB9AC;&#xB294;, &#xC548;&#xD0C0;&#xAE5D;&#xC9C0;&#xB9CC; &#xAE30;&#xC5C5;&#xC758; &#xB208;&#xB192;&#xC774;&#xC5D0; &#xB9DE;&#xCDB0; &#xC900;&#xBE44;&#xD574; &#xB098;&#xAC08; &#xC218; &#xBC16;&#xC5D0; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5ED;&#xC124;&#xC801;&#xC774;&#xAC8C;&#xB3C4; &#xC790;&#xACA9;&#xC99D;&#xACFC; &#xD559;&#xC704;&#xAC00;, &#xC870;&#xAE08; &#xB354; &#xB113;&#xAC8C; &#x2018;&#xADF8;&#xB7F4; &#xB4EF;&#xD574; &#xBCF4;&#xC774;&#xB294; &#xBB34;&#xC5B8;&#xAC00;&#x2019;&#xAC00; &#xC774;&#xB825;&#xC11C;&#xC5D0; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xC785;&#xB2C8;&#xB2E4;. &#xB300;&#xD559;&#xC0DD;&#xB4E4;&#xC774; &#xCC38;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC5F0;&#xD569; &#xB3D9;&#xC544;&#xB9AC;(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://kisia.or.kr/talent_support/kucis_info/">KUCIS</a>, CCA &#xB4F1;) &#xD639;&#xC740; &#xB300;&#xC678; &#xD65C;&#xB3D9;(BoB &#xB4F1;)&#xB4E4;&#xC774; &#xADF8;&#xB7EC;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xD574; &#xC8FC;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCDA9;&#xBD84;&#xD55C; &#xAC00;&#xB2A5;&#xC131;&#xACFC; &#xB2A5;&#xB825;&#xC774; &#xC788;&#xB294; &#x2018;&#xBCF4;&#xC548; &#xB274;&#xBE44;&#x2019;&#xB4E4;&#xC774; &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xCDA9;&#xBD84;&#xD788; &#xC778;&#xC815; &#xBC1B;&#xACE0; &#xB354; &#xB098;&#xC740; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xADFC;&#xBB34;&#xD560; &#xC218; &#xC788;&#xB294; &#xC5EC;&#xAC74;&#xC774; &#xB9C8;&#xB828;&#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xB2E4;&#xB294; &#xC774;&#xC0C1;&#xC801;&#xC778; &#xC0DD;&#xAC01;&#xC744; &#xD574;&#xBD05;&#xB2C8;&#xB2E4; &#x1F625;</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xBA38;&#xC2E0;&#xB7EC;&#xB2DD; &#xBAA8;&#xB378;&#xC744; &#xC9C1;&#xC811; &#xACF5;&#xACA9;&#xD558;&#xB294; Sleepy Pickle &#xACF5;&#xACA9; &#xAE30;&#xBC95;</strong></p>
</blockquote>
<p>2024.06.13 | TheHackerNews | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://thehackernews.com/2024/06/new-attack-technique-sleepy-pickle.html">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/06/17/hunjison/newsletter0617/image02.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xBA38;&#xC2E0;&#xB7EC;&#xB2DD; &#xBAA8;&#xB378;&#xC744; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xD560; &#xC218; &#xC788;&#xB294; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xC774; &#xB4F1;&#xC7A5;&#xD588;&#xC5B4;&#xC694;! &#x1F61D;</p>
<p>Pickle&#xC740; PyTorch&#xC640; &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xB7EC;&#xB2DD; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130; &#xC9C1;&#xB82C;&#xD654;(Serialization) &#xD615;&#xC2DD;&#xC774;&#xC5D0;&#xC694;. &#xB370;&#xC774;&#xD130; &#xC9C1;&#xB82C;&#xD654;&#xB780; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xB2E4;&#xB978; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC758;&#xBBF8;&#xD574;&#xC694;. </p>
<p>&#x2018;Sleepy Pickle&#x2019;&#xC774;&#xB77C;&#xACE0; &#xBD88;&#xB9AC;&#xB294; &#xC774; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xC740; &#xBCF4;&#xD1B5;&#xC758; &#xACF5;&#xACA9;&#xCC98;&#xB7FC; &#xBA38;&#xC2E0;&#xB7EC;&#xB2DD;&#xC774; &#xC218;&#xD589;&#xB418;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xACF5;&#xACA9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C;, <strong>&#xBA38;&#xC2E0;&#xB7EC;&#xB2DD; &#xBAA8;&#xB378; &#xC790;&#xCCB4;&#xB97C; &#xD45C;&#xC801;</strong>&#xC73C;&#xB85C; &#xC0BC;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xC740;&#xBC00;&#xD558;&#xACE0;(Stealthy) &#xAE30;&#xBC1C;&#xD55C; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xC774;&#xB77C;&#xACE0; &#xD558;&#xB124;&#xC694;! &#x1F4AF;</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/trailofbits/fickling">Fickling</a>&#xACFC; &#xAC19;&#xC740; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xB3C4;&#xAD6C;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD53C;&#xD074; &#xD30C;&#xC77C;&#xC5D0; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xD53C;&#xD574;&#xC790;&#xAC00; &#xD574;&#xB2F9; &#xD53C;&#xD074; &#xD30C;&#xC77C;&#xC744; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xC5ED;&#xC9C1;&#xB82C;&#xD654;(Deserialization)</a>&#xD558;&#xBA74; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xC5B4; 1) &#xBAA8;&#xB378;&#xC774; &#xC218;&#xC815;&#xB418;&#xAC70;&#xB098;, 2) &#xCD9C;&#xB825;&#xC744; &#xC81C;&#xC5B4;&#xD558;&#xAC70;&#xB098;, 3) &#xCC98;&#xB9AC;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xBC18;&#xD658;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xBCC0;&#xC870;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694; &#x2620;&#xFE0F;</p>
<p><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">Hugging Face</a>&#xC640; &#xAC19;&#xC740; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xBA38;&#xC2E0;&#xB7EC;&#xB2DD; &#xBAA8;&#xB378;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xB54C;&#xC5D0;&#xB3C4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xC18C;&#xC2A4;&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB9DE;&#xB294;&#xC9C0; &#xC8FC;&#xC758;&#xD574;&#xC57C;&#xACA0;&#xB124;&#xC694; &#x1F928;</p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xC2A4;&#xB178;&#xC6B0;&#xD50C;&#xB808;&#xC774;&#xD06C; &#xACE0;&#xAC1D;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD55C; UNC5537&#xC758; &#xB300;&#xADDC;&#xBAA8; &#xB370;&#xC774;&#xD130; &#xD0C8;&#xCDE8; &#xACF5;&#xACA9;</strong></p>
</blockquote>
<p>2024.06.11 | Google | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://cloud.google.com/blog/topics/threat-intelligence/unc5537-snowflake-data-theft-extortion?hl=en">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>UNC5537&#xC774;&#xB77C;&#xB294; &#xACF5;&#xACA9; &#xB2E8;&#xCCB4;&#xAC00; &#xC2A4;&#xB178;&#xC6B0;&#xD50C;&#xB808;&#xC774;&#xD06C; &#xACE0;&#xAC1D; &#xACC4;&#xC815;&#xC744; &#xCCB4;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xCE68;&#xD574;&#xD558;&#xC5EC; &#xBBFC;&#xAC10;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F621;</p>
<p><img src="/2024/06/17/hunjison/newsletter0617/image03.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC2A4;&#xB178;&#xC6B0;&#xD50C;&#xB808;&#xC774;&#xD06C;(Snowflake)&#xB294; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xAE30;&#xBC18;&#xC758; &#xB370;&#xC774;&#xD130; &#xC6E8;&#xC5B4;&#xD558;&#xC6B0;&#xC2A4;(Data Warehouse) &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C;, &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5;/&#xBD84;&#xC11D;/&#xACF5;&#xC720;/&#xCC98;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xB178;&#xC6B0;&#xD50C;&#xB808;&#xC774;&#xB294; AWS, Azure, GCP &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC778;&#xD504;&#xB77C;&#xC5D0;&#xC11C; &#xC6B4;&#xC601;&#xB420; &#xC218; &#xC788;&#xACE0;, &#xB2E4;&#xC591;&#xD55C; &#xC0B0;&#xC5C5; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xB300;&#xADDC;&#xBAA8; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xBC0F; &#xCC98;&#xB9AC;&#xB97C; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;. &#xC27D;&#xAC8C; &#xB9D0;&#xD574; &#xB9CE;&#xC740; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBAA8;&#xC5EC; &#xC788;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xD574;&#xD558;&#xBA74; &#xB418;&#xACA0;&#xC8E0;? </p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB4E4;&#xC740; &#xC815;&#xBCF4; &#xD0C8;&#xCDE8; &#xC545;&#xC131;&#xCF54;&#xB4DC;(Infostealer)&#xB97C; &#xD1B5;&#xD574; &#xD68D;&#xB4DD;&#xD55C; &#xACE0;&#xAC1D; &#xAC1C;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC2A4;&#xB178;&#xC6B0;&#xD50C;&#xB808;&#xC774;&#xD06C; &#xACC4;&#xC815;&#xC5D0; &#xC811;&#xADFC;&#xD588;&#xACE0;, &#xC2E4;&#xC81C; &#xD53C;&#xD574;&#xB97C; &#xB2F9;&#xD55C; &#xACE0;&#xAC1D;&#xC740; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB2E4;&#xC911; &#xC778;&#xC99D;(Multi-Factor Authentication)</a>&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB410;&#xB2E4;&#xACE0; &#xD574;&#xC694;.</p>
<p>&#xB9CC;&#xC57D; &#xB0B4; &#xC815;&#xBCF4;&#xAC00; &#xC720;&#xCD9C;&#xB418;&#xC5B4;&#xC11C;, &#xB098; &#xB54C;&#xBB38;&#xC5D0; &#xD68C;&#xC0AC;&#xC758; &#xBE45;&#xB370;&#xC774;&#xD130; &#xC815;&#xBCF4;&#xAC00; &#xBAA8;&#xB450; &#xC720;&#xCD9C;&#xB41C;&#xB2E4;&#xBA74; &#xC0DD;&#xAC01;&#xB9CC; &#xD574;&#xB3C4; &#xB054;&#xCC0D;&#xD560; &#xAC83; &#xAC19;&#xC544;&#xC694;. &#x1F975; &#xD68C;&#xC0AC; &#xACC4;&#xC815;&#xACFC; &#xAC1C;&#xC778; &#xACC4;&#xC815;&#xC758; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xB2E4;&#xB974;&#xAC8C; &#xD558;&#xACE0;, &#xC815;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xAC10;&#xC5FC;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xC544;&#xC694;.</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xC704;, AI &#xC751;&#xC6A9;&#xC11C;&#xBE44;&#xC2A4; SKT&#xC5D0;&#xC774;&#xB2F7;&#xB7;&#xC2A4;&#xB178;&#xC6B0;&#xB7;DeepL&#xB7;&#xBDF0;&#xB178; &#xC0AC;&#xC804; &#xC2E4;&#xD0DC;&#xC810;&#xAC80; &#xACB0;&#xACFC;&#xB294;?</strong></p>
</blockquote>
<p>2024.06.13 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://boannews.com/media/view.asp?idx=130576&amp;page=2&amp;kind=2">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xC704;&#xC6D0;&#xD68C;&#xC5D0;&#xC11C; AI &#xAE30;&#xBC18; &#xC751;&#xC6A9;&#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xB294; SKT, &#xC2A4;&#xB178;&#xC6B0;, DeepL, &#xBDF0;&#xB178; 4&#xAC1C; &#xC0AC;&#xC5C5;&#xC790;&#xC5D0; &#xB300;&#xD574; &#xC0AC;&#xC804; &#xC2E4;&#xD0DC;&#xC810;&#xAC80; &#xACB0;&#xACFC;&#xB97C; &#xBC1C;&#xD45C;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F440; &#xC810;&#xAC80; &#xACB0;&#xACFC; SKT&#xC640; &#xC2A4;&#xB178;&#xC6B0;&#xB294; &#xC2DC;&#xC815; &#xBC0F; &#xAC1C;&#xC120;&#xAD8C;&#xACE0;&#xB97C; &#xBC1B;&#xC558;&#xACE0;, DeepL&#xACFC; &#xBDF0;&#xB178;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xC81C;&#xC7AC; &#xC0AC;&#xD56D;&#xC774; &#xC5C6;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694; &#x1F60D;</p>
<p>SKT&#xC758; AI &#xAC1C;&#xC778;&#xBE44;&#xC11C; &#xC11C;&#xBE44;&#xC2A4; &#x2018;&#xC5D0;&#xC774;&#xB2F7;&#x2019;&#xC740; &#xD1B5;&#xD654; &#xB179;&#xC74C; &#xD30C;&#xC77C;&#xC744; SKT &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xD14D;&#xC2A4;&#xD2B8;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xC5EC; &#xC800;&#xC7A5;&#xD558;&#xB294;&#xB370;, &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C; &#xBCF4;&#xAD00; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC811;&#xC18D; &#xAE30;&#xB85D;&#xC774; &#xBCF4;&#xAD00;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC0AC;&#xC2E4;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5B4; &#xC2DC;&#xC815; &#xAD8C;&#xACE0;&#xAC00; &#xB0B4;&#xB824;&#xC84C;&#xC5B4;&#xC694;. &#x1F528; </p>
<p>&#xC2A4;&#xB178;&#xC6B0;&#xB294; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xC11C;&#xBC84;&#xB85C; &#xC804;&#xC1A1;&#xD574; &#xC0AC;&#xC6A9;&#xB7;&#xCC98;&#xB9AC;&#xD568;&#xC5D0;&#xB3C4; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xCC98;&#xB9AC;&#xBC29;&#xCE68;&#xC5D0;&#xB294; &#xC774;&#xC6A9;&#xC790;&#xAC00; &#xC54C;&#xAE30; &#xC5B4;&#xB824;&#xC6B4; &#xD615;&#xD0DC;&#xB85C; &#xC548;&#xB0B4;&#xD558;&#xACE0; &#xC788;&#xC5B4; &#xC2DC;&#xC815; &#xAD8C;&#xACE0;&#xAC00; &#xB0B4;&#xB824;&#xC84C;&#xC5B4;&#xC694;. &#x1F47D;</p>
<p>AI&#xAC00; &#xC2DC;&#xB300;&#xC801;&#xC778; &#xD2B8;&#xB80C;&#xB4DC;&#xB85C; &#xC790;&#xB9AC; &#xC7A1;&#xC73C;&#xBA74;&#xC11C; &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#xC55E;&#xB2E4;&#xD248; AI &#xAE30;&#xBC18; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xCD9C;&#xC2DC;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xC774;&#xB7F0; &#xD750;&#xB984; &#xC18D;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xC758; &#xC18C;&#xC911;&#xD55C; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xC11C;&#xBE44;&#xC2A4; &#xB0B4;&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xB418;&#xB294;&#xC9C0; &#xC0AC;&#xC804;&#xC5D0; &#xC810;&#xAC80;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC0C1;&#xB2F9;&#xD788; &#xC911;&#xC694;&#xD55C; &#xAC83; &#xAC19;&#xC544;&#xC694;.</p>
<p>&#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xBD84;&#xC57C;&#xB294; &#xC55E;&#xC73C;&#xB85C; &#xB354; &#xB9CE;&#xC740; &#xAD00;&#xC2EC;&#xC744; &#xBC1B;&#xAC8C; &#xB420; &#xAC83; &#xAC19;&#xC544;&#xC694;! &#xC5EC;&#xB7EC;&#xBD84;&#xB3C4; &#xC8FC;&#xBAA9;&#xD574;&#xC8FC;&#xC138;&#xC694; &#x2763;&#xFE0F;</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>&#xB370;&#xC774;&#xD130; &#xC9C1;&#xB82C;&#xD654;(Serialization)</strong></p>
<p>&#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xB2E4;&#xB978; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xACFC;&#xC815;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB97C; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD615;&#xD0DC;&#xB85C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xBCC0;&#xD658;&#xD560; &#xC218; &#xC788;&#xC74C;</p>
<p><strong>&#xB370;&#xC774;&#xD130; &#xC5ED;&#xC9C1;&#xB82C;&#xD654;(Deserialization)</strong></p>
<p>&#xC9C1;&#xB82C;&#xD654;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xACFC;&#xC815;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD615;&#xD0DC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB85C; &#xBCC0;&#xD658;&#xD560; &#xC218; &#xC788;&#xC74C;</p>
<p><strong>Hugging Face</strong></p>
<p>&#xC778;&#xACF5;&#xC9C0;&#xB2A5;(AI)&#xACFC; &#xBA38;&#xC2E0;&#xB7EC;&#xB2DD;(ML)&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBC0F; &#xC778;&#xACF5;&#xC9C0;&#xB2A5;(AI) &#xBAA8;&#xB378;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;</p>
<p><strong>&#xB2E4;&#xC911; &#xC778;&#xC99D;(Multi-Factor Authentication)</strong></p>
<p>&#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC554;&#xD638; &#xC774;&#xC678;&#xC758; &#xCD94;&#xAC00; &#xC815;&#xBCF4;&#xB97C; &#xC785;&#xB825;&#xD558;&#xB3C4;&#xB85D; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xB2E4;&#xC911; &#xB2E8;&#xACC4; &#xACC4;&#xC815; &#xB85C;&#xADF8;&#xC778; &#xACFC;&#xC815;</p>
<h2 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://boannews.com/media/view.asp?idx=130512&amp;page=4&amp;kind=3">2024&#xB144; 6&#xC6D4; &#xC14B;&#xC9F8; &#xC8FC;, LH&#xB7;&#xCE74;&#xCE74;&#xC624;&#xD398;&#xC774;&#xB7;&#xBE44;&#xBC14;&#xB9AC;&#xD37C;&#xBE14;&#xB9AC;&#xCE74; &#xB4F1; &#xC815;&#xBCF4;&#xBCF4;&#xC548; &#xC778;&#xB825; &#xCC44;&#xC6A9;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bleepingcomputer.com/news/security/new-phishing-toolkit-uses-pwas-to-steal-login-credentials/">New phishing toolkit uses PWAs to steal login credentials</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://boannews.com/media/view.asp?idx=130570&amp;page=2&amp;kind=5">&#xD655;&#xC7A5;&#xB41C; &#xBCF4;&#xC548; &#xBD84;&#xC11D; &#xAE30;&#xBC95; &#x2018;&#xC704;&#xD611; &#xD5CC;&#xD305;&#x2019; , &#xC120;&#xC81C;&#xC801; &#xB300;&#xC751;&#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC8FC;&#xBAA9;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.reddit.com/r/privacy/comments/1de8ofk/youtube_is_currently_experimenting_with/">YouTube is currently experimenting with server-side ad injection</a></p>
<h2 id="6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;"><a href="#6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;" class="headerlink" title="6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C; &#x1F425;"></a><strong>6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C;</strong> &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true">&#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548;&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;per_page=15&amp;st=subject&amp;q=#"></a>| &#xC870;&#xC120;&#xBE44;&#xC988; | 2024.06.20</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/">AI &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB7A9;</a> | &#xCF54;&#xB4DC;&#xAC8C;&#xC774;&#xD2B8; | ~ 2024.06.30 &#xC811;&#xC218;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://research.samsung.com/scpc">&#xC81C;10&#xD68C; &#xB300;&#xD559;&#xC0DD; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xC0BC;&#xC131;&#xC804;&#xC790; | ~ 24.07.04</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cryptocontest.kr/challenge/">&#xC554;&#xD638;&#xBD84;&#xC11D;&#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xD55C;&#xAD6D;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xD559;&#xD68C; | ~24.08.31 </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.fsec.or.kr/bbs/1014">&#xAE08;&#xC735;&#xAD8C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xC2E0;&#xACE0;&#xD3EC;&#xC0C1;&#xC81C; (&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;)</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~24.08.31</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;bbsNo=11489">&#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC544;&#xCE74;&#xB370;&#xBBF8; 2&#xAE30;</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~ 24.06.17 &#xC811;&#xC218;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                  <a class="hover-with-bg" href="/tags/hunjison/">hunjison</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_hunjison.jpg" srcset="/img/loading.gif" alt="hunjison">
                  </div>

                  <div class="link-text">
                    <div class="link-title">hunjison</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/hunjison">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/06/22/pwndorei/2024-06-22/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-37273 : Janì˜ ìž„ì˜ íŒŒì¼ ì—…ë¡œë“œ ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/06/15/j0ker/2024-06-15/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-28995: SolarWindsì‚¬ ì œí’ˆë“¤ì˜ Directory Traversal ì·¨ì•½ì ìœ¼ë¡œ ì¸í•œ Information Leak</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/06/17/hunjison/newsletter0617/';
        this.page.identifier = '/2024/06/17/hunjison/newsletter0617/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] ì‚¬ì´ë²„ ë³´ì•ˆ ì¸ë ¥ì´ ë¶€ì¡±í•˜ë‹¤ëŠ” ê±´ ê±°ì§“ë§ì´ë‹¤?!&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
