

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; AI &amp;#xBAA8;&amp;#xB378;, &amp;#xD2B9;&amp;#xD788; LLM &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xAD00;&amp;#xB9AC;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; MCP (Model Context Protocol)&amp;#xC774; &amp;#xC81C;&amp;#xC548;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC774; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MCP&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#MCP&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34;&gt;&lt;/a&gt;MCP&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC778; GPT, Claude, Gemini &amp;#xB4F1;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xCF54;&amp;#xB4DC; &amp;#xC791;&amp;#xC131;, &amp;#xBB38;&amp;#xC11C; &amp;#xC694;&amp;#xC57D;, &amp;#xC9C8;&amp;#xC758;&amp;#xC751;&amp;#xB2F5; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xB3C4; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xAE30; &amp;#xB9C8;&amp;#xB828;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &lt;strong&gt;&amp;#x201C;&amp;#xBB38;&amp;#xB9E5;(Context)&amp;#xC744; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#x201D;&lt;/strong&gt;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xB3C4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; Model Context Protocol (MCP)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. MCP&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; AI &amp;#xBAA8;&amp;#xB378;, &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;, &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC774; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xB9E5; &amp;#xAC1D;&amp;#xCCB4;(Context Object)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP&amp;#xB294; 2024&amp;#xB144; 11&amp;#xC6D4; Claude&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &lt;a href=&#34;https://www.anthropic.com/news/model-context-protocol&#34;&gt;Anthropic&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xC74C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AI&amp;#xAC00; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xACFC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD45C;&amp;#xC900; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xACE0;, &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xC77C;&amp;#xAD00;&amp;#xB418;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xC2E4;&amp;#xC9C8;&amp;#xC801; &amp;#xBB38;&amp;#xC81C; &amp;#xD574;&amp;#xACB0;&amp;#xC5D0; &amp;#xB354;&amp;#xC6B1; &amp;#xBC00;&amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xAC00;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC624;&amp;#xD508; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC8E0;? MCP &amp;#xAC1C;&amp;#xBC1C; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xC758; introduction&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBE44;&amp;#xC720;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;MCP&amp;#xB294; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC704;&amp;#xD55C; USB-C &amp;#xD3EC;&amp;#xD2B8;&amp;#xC774;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/](https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&#34;&gt;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MCP is an open protocol that standardizes how applications provide context to LLMs. Think of MCP like a USB-C port for AI applications. Just as USB-C provides a standardized way to connect your devices to various peripherals and accessories, MCP provides a standardized way to connect AI models to different data sources and tools. &lt;/p&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; :&lt;a href=&#34;https://modelcontextprotocol.io/introduction&#34;&gt;modelcontextprotocol.io&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;USB-C&amp;#xAC00; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xD3F0;, &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;, &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, MCP&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;(Google Drive, GitHub, Slack &amp;#xB4F1;)&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; MCP &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xB450;&amp;#xBA74;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; LLM&amp;#xC774; &amp;#xB098;&amp;#xC640;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9CC;&amp;#xB4E4; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0;, AI &amp;#xBAA8;&amp;#xB378; &amp;#xC81C;&amp;#xACF5;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC640; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image1.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://techblog.woowahan.com/22342/](https://techblog.woowahan.com/22342/)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://techblog.woowahan.com/22342/&#34;&gt;https://techblog.woowahan.com/22342/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC544;&amp;#xD55C;&amp;#xD615;&amp;#xC81C;&amp;#xB4E4; &amp;#xAE30;&amp;#xC220; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD480;&amp;#xC5B4;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xADDC;&amp;#xC57D;, &amp;#xC774;&amp;#xC81C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC6A9;&amp;#xC5B4;&amp;#xAC00; &amp;#xC870;&amp;#xAE08; &amp;#xC640;&amp;#xB2FF;&amp;#xB294;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC65C;-MCP&amp;#xAC00;-&amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#&amp;#xC65C;-MCP&amp;#xAC00;-&amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC65C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;?&#34;&gt;&lt;/a&gt;&amp;#xC65C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;?&lt;/h2&gt;&lt;p&gt;LLM&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC785;&amp;#xB825; &amp;#xD1A0;&amp;#xD070; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. GPT-4&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xCD5C;&amp;#xB300; 128K &amp;#xD1A0;&amp;#xD070;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAF64; &amp;#xAE34; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774; &amp;#xC5ED;&amp;#xC2DC; &amp;#xB2E8;&amp;#xC77C; &amp;#xC138;&amp;#xC158; &amp;#xD55C;&amp;#xC815;&amp;#xC774;&amp;#xBA70; &amp;#xC678;&amp;#xBD80; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774;&amp;#xB098; &amp;#xC7A5;&amp;#xAE30;&amp;#xC801; &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &lt;strong&gt;&amp;#xB2E4;&amp;#xC218;&amp;#xC758; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xC640; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xD568;&amp;#xAED8; &amp;#xC791;&amp;#xB3D9;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x2192; &amp;#xC694;&amp;#xC57D; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#x2192; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xBD84;&amp;#xC11D; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#x2192; &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC785;&amp;#xB825; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC758;&amp;#xB3C4;&amp;#xB098; &amp;#xC791;&amp;#xC5C5; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC01; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, &amp;#xBB38;&amp;#xB9E5;&amp;#xC774; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;MCP-&amp;#xC791;&amp;#xB3D9;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#MCP-&amp;#xC791;&amp;#xB3D9;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;MCP &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;MCP &lt;strong&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image2.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/introduction](https://modelcontextprotocol.io/introduction)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/introduction&#34;&gt;https://modelcontextprotocol.io/introduction&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC694;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&lt;/strong&gt;: &amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4; (&amp;#xC608;: Claude Desktop, AI &amp;#xAE30;&amp;#xBC18; IDE &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&lt;/strong&gt;: MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xC804;&amp;#xB2F4; 1:1 &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;: &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Google Drive, GitHub &amp;#xB4F1;)&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB85C;&amp;#xCEEC;/&amp;#xC6D0;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;: &amp;#xD30C;&amp;#xC77C;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;, API &amp;#xB4F1; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xC6D0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC720;&amp;#xB85C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;, &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; CEO, &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xBD80;&amp;#xC11C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xAC01; &amp;#xBD80;&amp;#xC11C;&amp;#xC758; &amp;#xC804;&amp;#xB2F4; &amp;#xBE44;&amp;#xC11C;, MCP&amp;#xB294; &amp;#xD1B5;&amp;#xC77C;&amp;#xB41C; &amp;#xBB38;&amp;#xC11C;&amp;#xC591;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  CEO&amp;#xB294; &amp;#xBB38;&amp;#xC11C; &amp;#xC591;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01; &amp;#xBD80;&amp;#xC11C;&amp;#xC758; &amp;#xBE44;&amp;#xC11C;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;)&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xBA70;, &amp;#xBD80;&amp;#xC11C;&amp;#xB294; &amp;#xCC98;&amp;#xB9AC; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD68C;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC815;&amp;#xBCF4; &amp;#xB204;&amp;#xB77D; &amp;#xC5C6;&amp;#xC774;, &amp;#xD63C;&amp;#xC120; &amp;#xC5C6;&amp;#xC774; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xD611;&amp;#xC5C5;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5; &amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;MCP&amp;#xC758;-&amp;#xC2E4;&amp;#xC81C;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;a href=&#34;#MCP&amp;#xC758;-&amp;#xC2E4;&amp;#xC81C;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD65C;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;/a&gt;MCP&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD65C;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xCD08;&amp;#xAE30; &amp;#xB2E8;&amp;#xACC4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xAC1C;&amp;#xBC1C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3C4;&amp;#xC785;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xB840; 1: Claude + Google Drive &amp;#xBB38;&amp;#xC11C; &amp;#xC694;&amp;#xC57D;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Claude Desktop &amp;#xC571;&amp;#xC5D0; &amp;#x201C;&amp;#xC9C0;&amp;#xB09C; &amp;#xD68C;&amp;#xC758;&amp;#xB85D;&amp;#xC744; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Claude&amp;#xB294; MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; Google Drive MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;, &amp;#xD68C;&amp;#xC758;&amp;#xB85D; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xC694;&amp;#xC57D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; Google Drive&amp;#xC5D0; &amp;#xC694;&amp;#xC57D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB294; Google Drive API&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC778;&amp;#xC99D;, &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, MCP&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xD45C;&amp;#xC900; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xB840; 2: Claude + GitHub &amp;#xCF54;&amp;#xB4DC; &amp;#xB9AC;&amp;#xBDF0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; Claude&amp;#xC5D0;&amp;#xAC8C; &amp;#x201C;&amp;#xC774; Pull Request&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xBB3B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Claude&amp;#xB294; GitHub MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; PR&amp;#xC758; &amp;#xBCC0;&amp;#xACBD;&amp;#xC0AC;&amp;#xD56D;, &amp;#xB9AC;&amp;#xBDF0; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;, &amp;#xCEE4;&amp;#xBC0B; &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xBB38;&amp;#xB9E5;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xC544; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBDF0; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Claude&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#x2018;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC694;&amp;#xC57D;&amp;#x2019;&amp;#xC774; &amp;#xC544;&amp;#xB2CC;, &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC758;&amp;#xB3C4;&amp;#xC640; &amp;#xC804;&amp;#xCCB4; &amp;#xB9E5;&amp;#xB77D;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xACE0;&amp;#xAE09; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&amp;#xACFC;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC774;-&amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&amp;#xACFC;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC774;-&amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;?&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;?&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC0C8;&amp;#xB86D;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294;, &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xB4E4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xB098;&amp;#xC628; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC;&amp;#xB294; &amp;#xB2EC;&amp;#xB9AC; MCP&amp;#xB294; &amp;#x201C;&amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xC9C0;&amp;#xC18D;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC5F0;&amp;#xACB0; &amp;#xAD6C;&amp;#xC870;&amp;#x201D;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB454; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xAD6C;&amp;#xBD84;&lt;/th&gt;
&lt;th&gt;Function Calling (OpenAI)&lt;/th&gt;
&lt;th&gt;LangChain Memory&lt;/th&gt;
&lt;th&gt;Vector Search + RAG&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;MCP&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xBAA9;&amp;#xC801;&lt;/td&gt;
&lt;td&gt;&amp;#xC678;&amp;#xBD80; &amp;#xAE30;&amp;#xB2A5; &amp;#xD638;&amp;#xCD9C;&lt;/td&gt;
&lt;td&gt;&amp;#xC138;&amp;#xC158; &amp;#xB0B4; &amp;#xAE30;&amp;#xC5B5; &amp;#xC720;&amp;#xC9C0;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xC11C; &amp;#xAE30;&amp;#xBC18; &amp;#xC9C8;&amp;#xC758;&amp;#xC751;&amp;#xB2F5;&lt;/td&gt;
&lt;td&gt;&amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD45C;&amp;#xC900;&amp;#xD654; &amp;#xBC0F; &amp;#xACF5;&amp;#xC720;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC811;&amp;#xADFC;&lt;/td&gt;
&lt;td&gt;&amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; API &amp;#xD638;&amp;#xCD9C;&lt;/td&gt;
&lt;td&gt;&amp;#xACFC;&amp;#xAC70; &amp;#xB300;&amp;#xD654; &amp;#xAE30;&amp;#xB85D; &amp;#xC720;&amp;#xC9C0;&lt;/td&gt;
&lt;td&gt;&amp;#xBCA1;&amp;#xD130; &amp;#xAC80;&amp;#xC0C9; &amp;#xAE30;&amp;#xBC18; &amp;#xBB38;&amp;#xC11C; &amp;#xAC80;&amp;#xC0C9;&lt;/td&gt;
&lt;td&gt;&amp;#xD30C;&amp;#xC77C;, API, DB &amp;#xB4F1; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBC94;&amp;#xC704;&lt;/td&gt;
&lt;td&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xBAA8;&amp;#xB378; &amp;#xC138;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xBAA8;&amp;#xB378; &amp;#xB0B4;&amp;#xBD80;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378; &amp;#xC790;&amp;#xCCB4;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xB3C4;&amp;#xAD6C;/&amp;#xBAA8;&amp;#xB378; &amp;#xAC04; &amp;#xACF5;&amp;#xC720;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xD45C;&amp;#xC900;&amp;#xD654;&lt;/td&gt;
&lt;td&gt;X (&amp;#xBAA8;&amp;#xB378; &amp;#xC885;&amp;#xC18D;)&lt;/td&gt;
&lt;td&gt;&amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC758;&amp;#xC874;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBE44;&amp;#xD45C;&amp;#xC900;&lt;/td&gt;
&lt;td&gt;JSON &amp;#xAE30;&amp;#xBC18; &amp;#xBA85;&amp;#xC138; &amp;#xC874;&amp;#xC7AC;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xAD00;&amp;#xB9AC;&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C; (&amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;)&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xAE30;&amp;#xBC18; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC131;&lt;/td&gt;
&lt;td&gt;&amp;#xB0AE;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xB0AE;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xD1B5;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xB192;&amp;#xC74C; (&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xD615; &amp;#xAD6C;&amp;#xC870;)&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; MCP&amp;#xC758; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB2E4;&amp;#xC74C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC62C;&amp;#xAC8C;&amp;#xC694;-!!(&amp;#xC544;&amp;#xB9C8;&amp;#xB450;_&amp;#x314E;&amp;#x314E;)&lt;/p&gt;
&lt;h2 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://techblog.woowahan.com/22342/&#34;&gt;https://techblog.woowahan.com/22342/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&#34;&gt;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://channel.io/ko/blog/articles/what-is-mcp-52c77e72&#34;&gt;https://channel.io/ko/blog/articles/what-is-mcp-52c77e72&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] MCP (Model Context Protocol) Part 1 (ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; AI &amp;#xBAA8;&amp;#xB378;, &amp;#xD2B9;&amp;#xD788; LLM &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xAD00;&amp;#xB9AC;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC811;&amp;#xADFC;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; MCP (Model Context Protocol)&amp;#xC774; &amp;#xC81C;&amp;#xC548;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC774; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MCP&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#MCP&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&#34;&gt;&lt;/a&gt;MCP&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&lt;/h2&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC778; GPT, Claude, Gemini &amp;#xB4F1;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xCF54;&amp;#xB4DC; &amp;#xC791;&amp;#xC131;, &amp;#xBB38;&amp;#xC11C; &amp;#xC694;&amp;#xC57D;, &amp;#xC9C8;&amp;#xC758;&amp;#xC751;&amp;#xB2F5; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xB192;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xB3C4; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xAE30; &amp;#xB9C8;&amp;#xB828;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &lt;strong&gt;&amp;#x201C;&amp;#xBB38;&amp;#xB9E5;(Context)&amp;#xC744; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#x201D;&lt;/strong&gt;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xB3C4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; Model Context Protocol (MCP)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. MCP&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; AI &amp;#xBAA8;&amp;#xB378;, &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;, &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC774; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xB9E5; &amp;#xAC1D;&amp;#xCCB4;(Context Object)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP&amp;#xB294; 2024&amp;#xB144; 11&amp;#xC6D4; Claude&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &lt;a href=&#34;https://www.anthropic.com/news/model-context-protocol&#34;&gt;Anthropic&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xC74C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AI&amp;#xAC00; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xACFC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD45C;&amp;#xC900; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xACE0;, &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xC77C;&amp;#xAD00;&amp;#xB418;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xC2E4;&amp;#xC9C8;&amp;#xC801; &amp;#xBB38;&amp;#xC81C; &amp;#xD574;&amp;#xACB0;&amp;#xC5D0; &amp;#xB354;&amp;#xC6B1; &amp;#xBC00;&amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xAC00;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC624;&amp;#xD508; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC8E0;? MCP &amp;#xAC1C;&amp;#xBC1C; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xC758; introduction&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBE44;&amp;#xC720;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;MCP&amp;#xB294; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC704;&amp;#xD55C; USB-C &amp;#xD3EC;&amp;#xD2B8;&amp;#xC774;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/](https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&#34;&gt;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MCP is an open protocol that standardizes how applications provide context to LLMs. Think of MCP like a USB-C port for AI applications. Just as USB-C provides a standardized way to connect your devices to various peripherals and accessories, MCP provides a standardized way to connect AI models to different data sources and tools. &lt;/p&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; :&lt;a href=&#34;https://modelcontextprotocol.io/introduction&#34;&gt;modelcontextprotocol.io&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;USB-C&amp;#xAC00; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xD3F0;, &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;, &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, MCP&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;(Google Drive, GitHub, Slack &amp;#xB4F1;)&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; MCP &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xB450;&amp;#xBA74;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; LLM&amp;#xC774; &amp;#xB098;&amp;#xC640;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9CC;&amp;#xB4E4; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0;, AI &amp;#xBAA8;&amp;#xB378; &amp;#xC81C;&amp;#xACF5;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC640; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image1.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://techblog.woowahan.com/22342/](https://techblog.woowahan.com/22342/)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://techblog.woowahan.com/22342/&#34;&gt;https://techblog.woowahan.com/22342/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC544;&amp;#xD55C;&amp;#xD615;&amp;#xC81C;&amp;#xB4E4; &amp;#xAE30;&amp;#xC220; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD480;&amp;#xC5B4;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xADDC;&amp;#xC57D;, &amp;#xC774;&amp;#xC81C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC6A9;&amp;#xC5B4;&amp;#xAC00; &amp;#xC870;&amp;#xAE08; &amp;#xC640;&amp;#xB2FF;&amp;#xB294;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC65C;-MCP&amp;#xAC00;-&amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#&amp;#xC65C;-MCP&amp;#xAC00;-&amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC65C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;?&#34;&gt;&lt;/a&gt;&amp;#xC65C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;?&lt;/h2&gt;&lt;p&gt;LLM&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC785;&amp;#xB825; &amp;#xD1A0;&amp;#xD070; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. GPT-4&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xCD5C;&amp;#xB300; 128K &amp;#xD1A0;&amp;#xD070;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAF64; &amp;#xAE34; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774; &amp;#xC5ED;&amp;#xC2DC; &amp;#xB2E8;&amp;#xC77C; &amp;#xC138;&amp;#xC158; &amp;#xD55C;&amp;#xC815;&amp;#xC774;&amp;#xBA70; &amp;#xC678;&amp;#xBD80; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774;&amp;#xB098; &amp;#xC7A5;&amp;#xAE30;&amp;#xC801; &amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &lt;strong&gt;&amp;#xB2E4;&amp;#xC218;&amp;#xC758; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xC640; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xD568;&amp;#xAED8; &amp;#xC791;&amp;#xB3D9;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x2192; &amp;#xC694;&amp;#xC57D; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#x2192; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xBD84;&amp;#xC11D; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#x2192; &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC785;&amp;#xB825; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC758;&amp;#xB3C4;&amp;#xB098; &amp;#xC791;&amp;#xC5C5; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC01; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, &amp;#xBB38;&amp;#xB9E5;&amp;#xC774; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C; MCP&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;MCP-&amp;#xC791;&amp;#xB3D9;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#MCP-&amp;#xC791;&amp;#xB3D9;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;MCP &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;MCP &lt;strong&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/24/romi0x/MCP_Part1_ko/image2.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/introduction](https://modelcontextprotocol.io/introduction)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/introduction&#34;&gt;https://modelcontextprotocol.io/introduction&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC694;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&lt;/strong&gt;: &amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4; (&amp;#xC608;: Claude Desktop, AI &amp;#xAE30;&amp;#xBC18; IDE &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&lt;/strong&gt;: MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xC804;&amp;#xB2F4; 1:1 &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MCP &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;: &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Google Drive, GitHub &amp;#xB4F1;)&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB85C;&amp;#xCEEC;/&amp;#xC6D0;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;: &amp;#xD30C;&amp;#xC77C;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;, API &amp;#xB4F1; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xC6D0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC720;&amp;#xB85C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;, &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; CEO, &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xBD80;&amp;#xC11C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xAC01; &amp;#xBD80;&amp;#xC11C;&amp;#xC758; &amp;#xC804;&amp;#xB2F4; &amp;#xBE44;&amp;#xC11C;, MCP&amp;#xB294; &amp;#xD1B5;&amp;#xC77C;&amp;#xB41C; &amp;#xBB38;&amp;#xC11C;&amp;#xC591;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  CEO&amp;#xB294; &amp;#xBB38;&amp;#xC11C; &amp;#xC591;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01; &amp;#xBD80;&amp;#xC11C;&amp;#xC758; &amp;#xBE44;&amp;#xC11C;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;)&amp;#xAC00; &amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xBA70;, &amp;#xBD80;&amp;#xC11C;&amp;#xB294; &amp;#xCC98;&amp;#xB9AC; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC815;&amp;#xD574;&amp;#xC9C4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD68C;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC815;&amp;#xBCF4; &amp;#xB204;&amp;#xB77D; &amp;#xC5C6;&amp;#xC774;, &amp;#xD63C;&amp;#xC120; &amp;#xC5C6;&amp;#xC774; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xD611;&amp;#xC5C5;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5; &amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;MCP&amp;#xC758;-&amp;#xC2E4;&amp;#xC81C;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;a href=&#34;#MCP&amp;#xC758;-&amp;#xC2E4;&amp;#xC81C;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD65C;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;/a&gt;MCP&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xD65C;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xCD08;&amp;#xAE30; &amp;#xB2E8;&amp;#xACC4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xAC1C;&amp;#xBC1C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3C4;&amp;#xC785;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xB840; 1: Claude + Google Drive &amp;#xBB38;&amp;#xC11C; &amp;#xC694;&amp;#xC57D;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Claude Desktop &amp;#xC571;&amp;#xC5D0; &amp;#x201C;&amp;#xC9C0;&amp;#xB09C; &amp;#xD68C;&amp;#xC758;&amp;#xB85D;&amp;#xC744; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Claude&amp;#xB294; MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; Google Drive MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;, &amp;#xD68C;&amp;#xC758;&amp;#xB85D; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xC694;&amp;#xC57D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; Google Drive&amp;#xC5D0; &amp;#xC694;&amp;#xC57D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB294; Google Drive API&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC778;&amp;#xC99D;, &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, MCP&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xD45C;&amp;#xC900; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xB840; 2: Claude + GitHub &amp;#xCF54;&amp;#xB4DC; &amp;#xB9AC;&amp;#xBDF0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; Claude&amp;#xC5D0;&amp;#xAC8C; &amp;#x201C;&amp;#xC774; Pull Request&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xBB3B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Claude&amp;#xB294; GitHub MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; PR&amp;#xC758; &amp;#xBCC0;&amp;#xACBD;&amp;#xC0AC;&amp;#xD56D;, &amp;#xB9AC;&amp;#xBDF0; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;, &amp;#xCEE4;&amp;#xBC0B; &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xBB38;&amp;#xB9E5;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xC544; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBDF0; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Claude&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#x2018;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC694;&amp;#xC57D;&amp;#x2019;&amp;#xC774; &amp;#xC544;&amp;#xB2CC;, &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC758;&amp;#xB3C4;&amp;#xC640; &amp;#xC804;&amp;#xCCB4; &amp;#xB9E5;&amp;#xB77D;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xACE0;&amp;#xAE09; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&amp;#xACFC;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC774;-&amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;&#34;&gt;&lt;a href=&#34;#&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&amp;#xACFC;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC774;-&amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;?&#34;&gt;&lt;/a&gt;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C;&amp;#xAE4C;?&lt;/h2&gt;&lt;p&gt;MCP&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC0C8;&amp;#xB86D;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294;, &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xB4E4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xADF9;&amp;#xBCF5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xB098;&amp;#xC628; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xACFC;&amp;#xB294; &amp;#xB2EC;&amp;#xB9AC; MCP&amp;#xB294; &amp;#x201C;&amp;#xBB38;&amp;#xB9E5;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xC9C0;&amp;#xC18D;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC5F0;&amp;#xACB0; &amp;#xAD6C;&amp;#xC870;&amp;#x201D;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB454; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xAD6C;&amp;#xBD84;&lt;/th&gt;
&lt;th&gt;Function Calling (OpenAI)&lt;/th&gt;
&lt;th&gt;LangChain Memory&lt;/th&gt;
&lt;th&gt;Vector Search + RAG&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;MCP&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xBAA9;&amp;#xC801;&lt;/td&gt;
&lt;td&gt;&amp;#xC678;&amp;#xBD80; &amp;#xAE30;&amp;#xB2A5; &amp;#xD638;&amp;#xCD9C;&lt;/td&gt;
&lt;td&gt;&amp;#xC138;&amp;#xC158; &amp;#xB0B4; &amp;#xAE30;&amp;#xC5B5; &amp;#xC720;&amp;#xC9C0;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xC11C; &amp;#xAE30;&amp;#xBC18; &amp;#xC9C8;&amp;#xC758;&amp;#xC751;&amp;#xB2F5;&lt;/td&gt;
&lt;td&gt;&amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD45C;&amp;#xC900;&amp;#xD654; &amp;#xBC0F; &amp;#xACF5;&amp;#xC720;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC811;&amp;#xADFC;&lt;/td&gt;
&lt;td&gt;&amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; API &amp;#xD638;&amp;#xCD9C;&lt;/td&gt;
&lt;td&gt;&amp;#xACFC;&amp;#xAC70; &amp;#xB300;&amp;#xD654; &amp;#xAE30;&amp;#xB85D; &amp;#xC720;&amp;#xC9C0;&lt;/td&gt;
&lt;td&gt;&amp;#xBCA1;&amp;#xD130; &amp;#xAC80;&amp;#xC0C9; &amp;#xAE30;&amp;#xBC18; &amp;#xBB38;&amp;#xC11C; &amp;#xAC80;&amp;#xC0C9;&lt;/td&gt;
&lt;td&gt;&amp;#xD30C;&amp;#xC77C;, API, DB &amp;#xB4F1; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBC94;&amp;#xC704;&lt;/td&gt;
&lt;td&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xBAA8;&amp;#xB378; &amp;#xC138;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xB2E8;&amp;#xC77C; &amp;#xBAA8;&amp;#xB378; &amp;#xB0B4;&amp;#xBD80;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378; &amp;#xC790;&amp;#xCCB4;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xB3C4;&amp;#xAD6C;/&amp;#xBAA8;&amp;#xB378; &amp;#xAC04; &amp;#xACF5;&amp;#xC720;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xD45C;&amp;#xC900;&amp;#xD654;&lt;/td&gt;
&lt;td&gt;X (&amp;#xBAA8;&amp;#xB378; &amp;#xC885;&amp;#xC18D;)&lt;/td&gt;
&lt;td&gt;&amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC758;&amp;#xC874;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBE44;&amp;#xD45C;&amp;#xC900;&lt;/td&gt;
&lt;td&gt;JSON &amp;#xAE30;&amp;#xBC18; &amp;#xBA85;&amp;#xC138; &amp;#xC874;&amp;#xC7AC;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xAD00;&amp;#xB9AC;&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C; (&amp;#xC9C1;&amp;#xC811; &amp;#xAD6C;&amp;#xD604;)&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBC84; &amp;#xAE30;&amp;#xBC18; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC131;&lt;/td&gt;
&lt;td&gt;&amp;#xB0AE;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xB0AE;&amp;#xC74C;&lt;/td&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xD1B5;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;#xB192;&amp;#xC74C; (&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xD615; &amp;#xAD6C;&amp;#xC870;)&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; MCP&amp;#xC758; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB2E4;&amp;#xC74C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC62C;&amp;#xAC8C;&amp;#xC694;-!!(&amp;#xC544;&amp;#xB9C8;&amp;#xB450;_&amp;#x314E;&amp;#x314E;)&lt;/p&gt;
&lt;h2 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://techblog.woowahan.com/22342/&#34;&gt;https://techblog.woowahan.com/22342/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&#34;&gt;https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://channel.io/ko/blog/articles/what-is-mcp-52c77e72&#34;&gt;https://channel.io/ko/blog/articles/what-is-mcp-52c77e72&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/07/24/romi0x/MCP_Part1_ko/index.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/07/24/romi0x/mcp_part1_ko/">

  <title>[Research] MCP (Model Context Protocol) Part 1 (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-07-24 17:00" pubdate>
      2025 7 24 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      39
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] MCP (Model Context Protocol) Part 1 (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; romi0x&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xCD5C;&#xADFC; AI &#xBAA8;&#xB378;, &#xD2B9;&#xD788; LLM &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xBB38;&#xB9E5;(Context) &#xAD00;&#xB9AC;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD6A8;&#xC728;&#xC131;&#xC744; &#xB192;&#xC774;&#xAE30; &#xC704;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xC811;&#xADFC;&#xBC95;&#xC73C;&#xB85C; MCP (Model Context Protocol)&#xC774; &#xC81C;&#xC548;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB298;&#xC740; &#xC774; MCP&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC18C;&#xAC1C;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="MCP&#xB780;-&#xBB34;&#xC5C7;&#xC77C;&#xAE4C;"><a href="#MCP&#xB780;-&#xBB34;&#xC5C7;&#xC77C;&#xAE4C;" class="headerlink" title="MCP&#xB780; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;"></a>MCP&#xB780; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;</h2><p>&#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294; AI &#xBAA8;&#xB378;&#xC778; GPT, Claude, Gemini &#xB4F1;&#xC740; &#xC774;&#xBBF8; &#xCF54;&#xB4DC; &#xC791;&#xC131;, &#xBB38;&#xC11C; &#xC694;&#xC57D;, &#xC9C8;&#xC758;&#xC751;&#xB2F5; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC791;&#xC5C5;&#xC5D0;&#xC11C; &#xB192;&#xC740; &#xC131;&#xB2A5;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xBAA8;&#xB378;&#xB4E4;&#xB3C4; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xAE30; &#xB9C8;&#xB828;&#xC774;&#xC8E0;.</p>
<p>&#xBC14;&#xB85C; <strong>&#x201C;&#xBB38;&#xB9E5;(Context)&#xC744; &#xC644;&#xC804;&#xD788; &#xC774;&#xD574;&#xD558;&#xAC70;&#xB098; &#xC720;&#xC9C0;&#xD558;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;&#x201D;</strong>&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC2DC;&#xB3C4; &#xC911; &#xD558;&#xB098;&#xAC00; &#xBC14;&#xB85C; Model Context Protocol (MCP)&#xC785;&#xB2C8;&#xB2E4;. MCP&#xB294; &#xC5EC;&#xB7EC; AI &#xBAA8;&#xB378;, &#xC5D0;&#xC774;&#xC804;&#xD2B8;, &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xB4E4;&#xC774; &#xACF5;&#xC720;&#xD560; &#xC218; &#xC788;&#xB294; &#xBB38;&#xB9E5; &#xAC1D;&#xCCB4;(Context Object)&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xD45C;&#xC900;&#xD654;&#xB41C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC8FC;&#xACE0;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>MCP&#xB294; 2024&#xB144; 11&#xC6D4; Claude&#xB97C; &#xAC1C;&#xBC1C;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.anthropic.com/news/model-context-protocol">Anthropic</a>&#xC5D0; &#xC758;&#xD574; &#xCC98;&#xC74C; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. AI&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C;&#xACFC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD45C;&#xC900; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC8FC;&#xACE0;&#xBC1B;&#xACE0;, &#xBB38;&#xB9E5;&#xC744; &#xC77C;&#xAD00;&#xB418;&#xAC8C; &#xC720;&#xC9C0;&#xD558;&#xBA70;, &#xC2E4;&#xC9C8;&#xC801; &#xBB38;&#xC81C; &#xD574;&#xACB0;&#xC5D0; &#xB354;&#xC6B1; &#xBC00;&#xC811;&#xD558;&#xAC8C; &#xB2E4;&#xAC00;&#xAC08; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xC624;&#xD508; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC798; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xC9C0; &#xC54A;&#xC8E0;? MCP &#xAC1C;&#xBC1C; &#xAC00;&#xC774;&#xB4DC;&#xC758; introduction&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC788;&#xB294; &#xBE44;&#xC720;&#xB97C; &#xAC00;&#xC838;&#xC640; &#xC124;&#xBA85;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<blockquote>
<p>&#x201C;MCP&#xB294; AI &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC704;&#xD55C; USB-C &#xD3EC;&#xD2B8;&#xC774;&#xB2E4;.&#x201D;</p>
</blockquote>
<p><img src="/2025/07/24/romi0x/MCP_Part1_ko/image.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: [https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/](https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/)"><br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/">https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/</a></p>
<blockquote>
<p>MCP is an open protocol that standardizes how applications provide context to LLMs. Think of MCP like a USB-C port for AI applications. Just as USB-C provides a standardized way to connect your devices to various peripherals and accessories, MCP provides a standardized way to connect AI models to different data sources and tools. </p>
<p>&#xCD9C;&#xCC98; :<a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/introduction">modelcontextprotocol.io</a></p>
</blockquote>
<p>USB-C&#xAC00; &#xB178;&#xD2B8;&#xBD81;, &#xC2A4;&#xB9C8;&#xD2B8;&#xD3F0;, &#xB9C8;&#xC6B0;&#xC2A4;, &#xBAA8;&#xB2C8;&#xD130; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xAE30;&#xB97C; &#xD558;&#xB098;&#xC758; &#xD3EC;&#xD2B8;&#xB85C; &#xC5F0;&#xACB0;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC;, MCP&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4;(Google Drive, GitHub, Slack &#xB4F1;)&#xB97C; &#xD558;&#xB098;&#xC758; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; AI &#xBAA8;&#xB378;&#xC5D0; &#xC5F0;&#xACB0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC989;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; MCP &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD55C; &#xBC88;&#xB9CC; &#xC5F0;&#xACB0;&#xC744; &#xAD6C;&#xD604;&#xD574;&#xB450;&#xBA74;, &#xC0C8;&#xB85C;&#xC6B4; LLM&#xC774; &#xB098;&#xC640;&#xB3C4; &#xB2E4;&#xC2DC; &#xB9CC;&#xB4E4; &#xD544;&#xC694; &#xC5C6;&#xC774; &#xC7AC;&#xC0AC;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, AI &#xBAA8;&#xB378; &#xC81C;&#xACF5;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB3C4; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC9C1;&#xC811; &#xC5F0;&#xACB0;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xB2E4;&#xC591;&#xD55C; &#xB3C4;&#xAD6C;&#xC640; &#xC5F0;&#xB3D9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/07/24/romi0x/MCP_Part1_ko/image1.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: [https://techblog.woowahan.com/22342/](https://techblog.woowahan.com/22342/)"><br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://techblog.woowahan.com/22342/">https://techblog.woowahan.com/22342/</a></p>
<p>&#xC6B0;&#xC544;&#xD55C;&#xD615;&#xC81C;&#xB4E4; &#xAE30;&#xC220; &#xBE14;&#xB85C;&#xADF8;&#xC5D0;&#xC11C;&#xB294; MCP&#xC5D0; &#xB300;&#xD55C; &#xC6A9;&#xC5B4;&#xB97C; &#xC774;&#xB807;&#xAC8C; &#xD480;&#xC5B4;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xC5B4;&#xC694;.</p>
<p>AI &#xBAA8;&#xB378;&#xC5D0;&#xAC8C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xADDC;&#xC57D;, &#xC774;&#xC81C; &#xC5B4;&#xB824;&#xC6B4; &#xC6A9;&#xC5B4;&#xAC00; &#xC870;&#xAE08; &#xC640;&#xB2FF;&#xB294;&#xAC70; &#xAC19;&#xB124;&#xC694;.</p>
<h2 id="&#xC65C;-MCP&#xAC00;-&#xD544;&#xC694;&#xD560;&#xAE4C;"><a href="#&#xC65C;-MCP&#xAC00;-&#xD544;&#xC694;&#xD560;&#xAE4C;" class="headerlink" title="&#xC65C; MCP&#xAC00; &#xD544;&#xC694;&#xD560;&#xAE4C;?"></a>&#xC65C; MCP&#xAC00; &#xD544;&#xC694;&#xD560;&#xAE4C;?</h2><p>LLM&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC785;&#xB825; &#xD1A0;&#xD070; &#xB0B4;&#xC5D0;&#xC11C;&#xB9CC; &#xBB38;&#xB9E5;&#xC744; &#xC720;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. GPT-4&#xC758; &#xACBD;&#xC6B0; &#xCD5C;&#xB300; 128K &#xD1A0;&#xD070;&#xC774;&#xB77C;&#xB294; &#xAF64; &#xAE34; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC708;&#xB3C4;&#xC6B0;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0;&#xB9CC;, &#xC774; &#xC5ED;&#xC2DC; &#xB2E8;&#xC77C; &#xC138;&#xC158; &#xD55C;&#xC815;&#xC774;&#xBA70; &#xC678;&#xBD80; &#xAE30;&#xC5B5;&#xC774;&#xB098; &#xC7A5;&#xAE30;&#xC801; &#xBB38;&#xB9E5;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB370;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>AI &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC740; &#xD558;&#xB098;&#xC758; &#xBAA8;&#xB378;&#xC774; &#xC544;&#xB2CC; <strong>&#xB2E4;&#xC218;&#xC758; &#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xC640; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC774; &#xD568;&#xAED8; &#xC791;&#xB3D9;</strong>&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC0AC;&#xC6A9;&#xC790; &#x2192; &#xC694;&#xC57D; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#x2192; &#xC774;&#xBA54;&#xC77C; &#xBD84;&#xC11D; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#x2192; &#xCE98;&#xB9B0;&#xB354; &#xC785;&#xB825; &#xD50C;&#xB7EC;&#xADF8;&#xC778;</li>
</ul>
<p>&#xC774;&#xB7F0; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB3D9;&#xC77C;&#xD55C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC758;&#xB3C4;&#xB098; &#xC791;&#xC5C5; &#xD750;&#xB984;&#xC744; &#xAC01; &#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xAC00; &#xD30C;&#xC545;&#xD558;&#xB824;&#xBA74;, &#xBB38;&#xB9E5;&#xC774; &#xD45C;&#xC900;&#xD654;&#xB41C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xACF5;&#xC720;&#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574;&#xC11C; MCP&#xAC00; &#xD544;&#xC694;&#xD55C;&#xAC70;&#xC8E0;.</p>
<h2 id="MCP-&#xC791;&#xB3D9;-&#xBC29;&#xC2DD;"><a href="#MCP-&#xC791;&#xB3D9;-&#xBC29;&#xC2DD;" class="headerlink" title="MCP &#xC791;&#xB3D9; &#xBC29;&#xC2DD;"></a>MCP <strong>&#xC791;&#xB3D9; &#xBC29;&#xC2DD;</strong></h2><p>MCP&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBC84; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/07/24/romi0x/MCP_Part1_ko/image2.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: [https://modelcontextprotocol.io/introduction](https://modelcontextprotocol.io/introduction)"><br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/introduction">https://modelcontextprotocol.io/introduction</a></p>
<p>&#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC544;&#xC694;</p>
<ul>
<li><strong>MCP &#xD638;&#xC2A4;&#xD2B8;</strong>: &#xC678;&#xBD80; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB824;&#xB294; &#xC8FC;&#xCCB4; (&#xC608;: Claude Desktop, AI &#xAE30;&#xBC18; IDE &#xB4F1;)</li>
<li><strong>MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;</strong>: MCP &#xC11C;&#xBC84;&#xC640; &#xC804;&#xB2F4; 1:1 &#xC5F0;&#xACB0;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xBA70; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;</li>
<li><strong>MCP &#xC11C;&#xBC84;</strong>: &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130;(Google Drive, GitHub &#xB4F1;)&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC815;&#xBCF4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xAC70;&#xB098; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;</li>
<li><strong>&#xB85C;&#xCEEC;/&#xC6D0;&#xACA9; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4;</strong>: &#xD30C;&#xC77C;, &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;, API &#xB4F1; MCP &#xC11C;&#xBC84;&#xAC00; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC790;&#xC6D0;</li>
</ul>
<p>&#xBE44;&#xC720;&#xB85C; &#xD480;&#xC5B4;&#xBCF4;&#xC790;&#xBA74;, &#xD638;&#xC2A4;&#xD2B8;&#xB294; CEO, &#xC11C;&#xBC84;&#xB294; &#xAC01;&#xAC01;&#xC758; &#xBD80;&#xC11C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xAC01; &#xBD80;&#xC11C;&#xC758; &#xC804;&#xB2F4; &#xBE44;&#xC11C;, MCP&#xB294; &#xD1B5;&#xC77C;&#xB41C; &#xBB38;&#xC11C;&#xC591;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.  CEO&#xB294; &#xBB38;&#xC11C; &#xC591;&#xC2DD;&#xC5D0; &#xB9DE;&#xCDB0; &#xC694;&#xCCAD;&#xC744; &#xC791;&#xC131;&#xD558;&#xACE0;, &#xAC01; &#xBD80;&#xC11C;&#xC758; &#xBE44;&#xC11C;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;)&#xAC00; &#xC774;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xBA70;, &#xBD80;&#xC11C;&#xB294; &#xCC98;&#xB9AC; &#xD6C4; &#xB2E4;&#xC2DC; &#xC815;&#xD574;&#xC9C4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD68C;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB355;&#xBD84;&#xC5D0; &#xC815;&#xBCF4; &#xB204;&#xB77D; &#xC5C6;&#xC774;, &#xD63C;&#xC120; &#xC5C6;&#xC774; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xD611;&#xC5C5;&#xC774; &#xAC00;&#xB2A5; &#xD574;&#xC9C0;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<h2 id="MCP&#xC758;-&#xC2E4;&#xC81C;-&#xD65C;&#xC6A9;-&#xC608;&#xC2DC;"><a href="#MCP&#xC758;-&#xC2E4;&#xC81C;-&#xD65C;&#xC6A9;-&#xC608;&#xC2DC;" class="headerlink" title="MCP&#xC758; &#xC2E4;&#xC81C; &#xD65C;&#xC6A9; &#xC608;&#xC2DC;"></a>MCP&#xC758; &#xC2E4;&#xC81C; &#xD65C;&#xC6A9; &#xC608;&#xC2DC;</h2><p>MCP&#xB294; &#xC544;&#xC9C1; &#xCD08;&#xAE30; &#xB2E8;&#xACC4;&#xC774;&#xC9C0;&#xB9CC;, &#xC774;&#xBBF8; &#xC5EC;&#xB7EC; &#xAE30;&#xC5C5;&#xACFC; &#xAC1C;&#xBC1C; &#xB3C4;&#xAD6C;&#xC5D0;&#xC11C; &#xB3C4;&#xC785;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC0AC;&#xB840; 1: Claude + Google Drive &#xBB38;&#xC11C; &#xC694;&#xC57D;</li>
</ul>
<p>&#xC0AC;&#xC6A9;&#xC790;&#xB294; Claude Desktop &#xC571;&#xC5D0; &#x201C;&#xC9C0;&#xB09C; &#xD68C;&#xC758;&#xB85D;&#xC744; &#xC694;&#xC57D;&#xD574;&#xC918;&#x201D;&#xB77C;&#xACE0; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. Claude&#xB294; MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xCEEC;&#xC5D0; &#xC124;&#xCE58;&#xB41C; Google Drive MCP &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xACE0;, &#xD68C;&#xC758;&#xB85D; &#xBB38;&#xC11C;&#xB97C; &#xCC3E;&#xC544; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xC694;&#xC57D; &#xACB0;&#xACFC;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xBCF4;&#xC5EC;&#xC8FC;&#xACE0;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC6D0;&#xD55C;&#xB2E4;&#xBA74; &#xB2E4;&#xC2DC; Google Drive&#xC5D0; &#xC694;&#xC57D; &#xACB0;&#xACFC;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xACFC;&#xAC70;&#xC5D0;&#xB294; Google Drive API&#xB97C; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xC5F0;&#xB3D9;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xC790; &#xC778;&#xC99D;, &#xD30C;&#xC77C; &#xAD6C;&#xC870; &#xD30C;&#xC2F1;&#xC744; &#xC9C1;&#xC811; &#xAD6C;&#xD604;&#xD574;&#xC57C; &#xD588;&#xC9C0;&#xB9CC;, MCP&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xC774; &#xBAA8;&#xB4E0; &#xD750;&#xB984;&#xC774; &#xD45C;&#xC900; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD3EC;&#xB9F7;&#xC5D0; &#xB530;&#xB77C; &#xC790;&#xB3D9;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<ul>
<li>&#xC0AC;&#xB840; 2: Claude + GitHub &#xCF54;&#xB4DC; &#xB9AC;&#xBDF0;</li>
</ul>
<p>&#xAC1C;&#xBC1C;&#xC790;&#xAC00; Claude&#xC5D0;&#xAC8C; &#x201C;&#xC774; Pull Request&#xC5D0; &#xC5B4;&#xB5A4; &#xBB38;&#xC81C;&#xC810;&#xC774; &#xC788;&#xC744;&#xAE4C;?&#x201D;&#xB77C;&#xACE0; &#xBB3B;&#xC2B5;&#xB2C8;&#xB2E4;. Claude&#xB294; GitHub MCP &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574; PR&#xC758; &#xBCC0;&#xACBD;&#xC0AC;&#xD56D;, &#xB9AC;&#xBDF0; &#xCF54;&#xBA58;&#xD2B8;, &#xCEE4;&#xBC0B; &#xD788;&#xC2A4;&#xD1A0;&#xB9AC;&#xB97C; &#xC77D;&#xC5B4;&#xB4E4;&#xC774;&#xACE0; &#xBB38;&#xB9E5;&#xC73C;&#xB85C; &#xC0BC;&#xC544; &#xBD84;&#xC11D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC815;&#xBCF4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB9AC;&#xBDF0; &#xD53C;&#xB4DC;&#xBC31;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC8E0;.</p>
<blockquote>
<p>&#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; Claude&#xB294; &#xB2E8;&#xC21C;&#xD788; &#x2018;&#xD14D;&#xC2A4;&#xD2B8; &#xC694;&#xC57D;&#x2019;&#xC774; &#xC544;&#xB2CC;, &#xCF54;&#xB4DC; &#xBCC0;&#xACBD; &#xC758;&#xB3C4;&#xC640; &#xC804;&#xCCB4; &#xB9E5;&#xB77D;&#xC744; &#xC774;&#xD574;&#xD55C; &#xACE0;&#xAE09; &#xBD84;&#xC11D;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h2 id="&#xAE30;&#xC874;-&#xAE30;&#xC220;&#xACFC;-&#xBB34;&#xC5C7;&#xC774;-&#xB2E4;&#xB97C;&#xAE4C;"><a href="#&#xAE30;&#xC874;-&#xAE30;&#xC220;&#xACFC;-&#xBB34;&#xC5C7;&#xC774;-&#xB2E4;&#xB97C;&#xAE4C;" class="headerlink" title="&#xAE30;&#xC874; &#xAE30;&#xC220;&#xACFC; &#xBB34;&#xC5C7;&#xC774; &#xB2E4;&#xB97C;&#xAE4C;?"></a>&#xAE30;&#xC874; &#xAE30;&#xC220;&#xACFC; &#xBB34;&#xC5C7;&#xC774; &#xB2E4;&#xB97C;&#xAE4C;?</h2><p>MCP&#xB294; &#xC0AC;&#xC2E4; &#xC644;&#xC804;&#xD788; &#xC0C8;&#xB86D;&#xAE30;&#xBCF4;&#xB2E4;&#xB294;, &#xAE30;&#xC874; &#xAE30;&#xC220;&#xB4E4;&#xC758; &#xD55C;&#xACC4;&#xB97C; &#xADF9;&#xBCF5;&#xD558;&#xACE0;&#xC790; &#xB098;&#xC628; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE30;&#xC874; &#xAE30;&#xC220;&#xACFC;&#xB294; &#xB2EC;&#xB9AC; MCP&#xB294; &#x201C;&#xBB38;&#xB9E5;&#xC744; &#xACF5;&#xC720;&#xD558;&#xACE0; &#xC9C0;&#xC18D;&#xC2DC;&#xD0A4;&#xB294; &#xC5F0;&#xACB0; &#xAD6C;&#xC870;&#x201D;&#xC5D0; &#xCD08;&#xC810;&#xC744; &#xB454; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#xAD6C;&#xBD84;</th>
<th>Function Calling (OpenAI)</th>
<th>LangChain Memory</th>
<th>Vector Search + RAG</th>
<th><strong>MCP</strong></th>
</tr>
</thead>
<tbody>
<tr>
<td>&#xBAA9;&#xC801;</td>
<td>&#xC678;&#xBD80; &#xAE30;&#xB2A5; &#xD638;&#xCD9C;</td>
<td>&#xC138;&#xC158; &#xB0B4; &#xAE30;&#xC5B5; &#xC720;&#xC9C0;</td>
<td>&#xBB38;&#xC11C; &#xAE30;&#xBC18; &#xC9C8;&#xC758;&#xC751;&#xB2F5;</td>
<td>&#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD45C;&#xC900;&#xD654; &#xBC0F; &#xACF5;&#xC720;</td>
</tr>
<tr>
<td>&#xB370;&#xC774;&#xD130; &#xC811;&#xADFC;</td>
<td>&#xC2E4;&#xC2DC;&#xAC04; API &#xD638;&#xCD9C;</td>
<td>&#xACFC;&#xAC70; &#xB300;&#xD654; &#xAE30;&#xB85D; &#xC720;&#xC9C0;</td>
<td>&#xBCA1;&#xD130; &#xAC80;&#xC0C9; &#xAE30;&#xBC18; &#xBB38;&#xC11C; &#xAC80;&#xC0C9;</td>
<td>&#xD30C;&#xC77C;, API, DB &#xB4F1; &#xAD11;&#xBC94;&#xC704;</td>
</tr>
<tr>
<td>&#xACF5;&#xC720; &#xBC94;&#xC704;</td>
<td>&#xB2E8;&#xC77C; &#xBAA8;&#xB378; &#xC138;&#xC158;</td>
<td>&#xB2E8;&#xC77C; &#xBAA8;&#xB378; &#xB0B4;&#xBD80;</td>
<td>&#xBAA8;&#xB378; &#xC790;&#xCCB4;&#xB9CC; &#xC0AC;&#xC6A9;</td>
<td><strong>&#xC5EC;&#xB7EC; &#xB3C4;&#xAD6C;/&#xBAA8;&#xB378; &#xAC04; &#xACF5;&#xC720;</strong></td>
</tr>
<tr>
<td>&#xD45C;&#xC900;&#xD654;</td>
<td>X (&#xBAA8;&#xB378; &#xC885;&#xC18D;)</td>
<td>&#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C; &#xC758;&#xC874;</td>
<td>&#xBB38;&#xC11C; &#xD3EC;&#xB9F7; &#xBE44;&#xD45C;&#xC900;</td>
<td>JSON &#xAE30;&#xBC18; &#xBA85;&#xC138; &#xC874;&#xC7AC;</td>
</tr>
<tr>
<td>&#xBCF4;&#xC548; &#xAD00;&#xB9AC;</td>
<td>&#xC5C6;&#xC74C; (&#xC9C1;&#xC811; &#xAD6C;&#xD604;)</td>
<td>&#xC5C6;&#xC74C;</td>
<td>&#xC5C6;&#xC74C;</td>
<td>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBC84; &#xAE30;&#xBC18; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;</td>
</tr>
<tr>
<td>&#xD655;&#xC7A5;&#xC131;</td>
<td>&#xB0AE;&#xC74C;</td>
<td>&#xB0AE;&#xC74C;</td>
<td>&#xBCF4;&#xD1B5;</td>
<td><strong>&#xB192;&#xC74C; (&#xD50C;&#xB7EC;&#xADF8;&#xD615; &#xAD6C;&#xC870;)</strong></td>
</tr>
</tbody>
</table>
</div>
<p>&#xC624;&#xB298;&#xC740; MCP&#xC758; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xAC1C;&#xB150;&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xC558;&#xB294;&#xB370;&#xC694;. &#xB2E4;&#xC74C; &#xC2DC;&#xB9AC;&#xC988;&#xC5D0;&#xC11C;&#xB294; MCP &#xAD00;&#xB828;&#xD55C; &#xB17C;&#xBB38;&#xC744; &#xAC00;&#xC838;&#xC62C;&#xAC8C;&#xC694;-!!(&#xC544;&#xB9C8;&#xB450;_&#x314E;&#x314E;)</p>
<h2 id="Ref"><a href="#Ref" class="headerlink" title="Ref"></a>Ref</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://techblog.woowahan.com/22342/">https://techblog.woowahan.com/22342/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/">https://norahsakal.com/blog/mcp-vs-api-model-context-protocol-explained/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://channel.io/ko/blog/articles/what-is-mcp-52c77e72">https://channel.io/ko/blog/articles/what-is-mcp-52c77e72</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/mcp/">mcp</a>
                  
                  <a class="hover-with-bg" href="/tags/romi0x/">romi0x</a>
                  
                  <a class="hover-with-bg" href="/tags/llm/">llm</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_romi0x.jpg" srcset="/img/loading.gif" alt="romi0x">
                  </div>

                  <div class="link-text">
                    <div class="link-title">romi0x</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/romi0x">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/07/24/romi0x/MCP_Part1_en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] MCP (Model Context Protocol) Part 1 (en)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/07/23/clalxk/CVE-2025-34508/">
                    <span class="hidden-mobile">[] CVE-2025-34508: ZendTo Path Traversal </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/07/24/romi0x/MCP_Part1_ko/';
        this.page.identifier = '/2025/07/24/romi0x/MCP_Part1_ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] MCP (Model Context Protocol) Part 1 (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
