

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h3 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h3&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!! &lt;/p&gt;
&lt;p&gt;Part3&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;, &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Cross Session Activation&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &lt;a href=&#34;https://hackyboiz.github.io/2024/12/22/ogu123/COM_Object_part2/ko/&#34;&gt;Part2&lt;/a&gt; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4; &amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB7FC; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;h3 id=&#34;COM-Security&#34;&gt;&lt;a href=&#34;#COM-Security&#34; class=&#34;headerlink&#34; title=&#34;COM Security&#34;&gt;&lt;/a&gt;COM Security&lt;/h3&gt;&lt;p&gt;COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; COM Security&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC0DD;&amp;#xC131;, &amp;#xC811;&amp;#xADFC;, &amp;#xAD8C;&amp;#xD55C; &amp;#xB4F1;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COM Security&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC124;&amp;#xC815; &amp;#xC911; Application Identity&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xACC4;&amp;#xC815; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/2.png&#34; alt&gt;&lt;br&gt;&amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xD574;&amp;#xB2F9; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; Interactive User(&amp;#xB300;&amp;#xD654;&amp;#xD615; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;)&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Interactive User&amp;#xB780;, &amp;#xD604;&amp;#xC7AC; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Cross-Session Activation&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB354; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Windows Session Isolation &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Windows-Session-Isolation&#34;&gt;&lt;a href=&#34;#Windows-Session-Isolation&#34; class=&#34;headerlink&#34; title=&#34;Windows Session Isolation&#34;&gt;&lt;/a&gt;Windows Session Isolation&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows XP &amp;#xBC0F; Windows Server 2003 &amp;#xC774;&amp;#xD558; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, &amp;#xC720;&amp;#xC800; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; Windows &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; Session 0&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C;, &amp;#xC720;&amp;#xC800; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windows 7 &amp;#xC774;&amp;#xD6C4; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC815;&amp;#xCC45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xAC01;&amp;#xAE30; &amp;#xB2E4;&amp;#xB978; &amp;#xC138;&amp;#xC158;(1, 2, 3&amp;#x2026;)&amp;#xC744; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&lt;/li&gt;
&lt;li&gt;&amp;#xC138;&amp;#xC158; 0&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC138;&amp;#xC158;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;(interact) &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC138;&amp;#xC158;&amp;#xC774; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBD84;&amp;#xB9AC;&amp;#xB418;&amp;#xBA74;&amp;#xC11C;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC138;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370;.. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; Cross-Session Activation&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Cross-Session-Activation&#34;&gt;&lt;a href=&#34;#Cross-Session-Activation&#34; class=&#34;headerlink&#34; title=&#34;Cross-Session Activation&#34;&gt;&lt;/a&gt;Cross-Session Activation&lt;/h3&gt;&lt;p&gt;Cross-Session Activation&amp;#xC740; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB3C4; &amp;#xC138;&amp;#xC158; &amp;#xAC04; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; interactive user &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C; Session Moniker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC138;&amp;#xC158; &amp;#xAC04; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; INTERACTIVE &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; Access Security&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC874;&amp;#xC7AC;(Authenticated Users, &amp;#x2026;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://decoder.cloud/2024/08/02/the-fake-potato/&#34;&gt;Windows File Explorer EoP(CVE-2024-38100)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2024-38100&amp;#xC740; Explorer(Hight IL) &amp;#xB0B4;&amp;#xC5D0; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; Cross-Session Activation &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xACE0;, ShellExecute &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4; COM Cross-Session Activation&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; EoP &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Cross-Session Activation&amp;#xC774; Interactive User&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &lt;a href=&#34;https://issues.chromium.org/issues/341803763&#34;&gt;Chrome Updater EoP(CVE-2024-7023)&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SYSTEM&amp;#xB3C4; Cross-Session Activation &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Cross-Session-Activation-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Cross-Session-Activation-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Cross Session Activation COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Cross Session Activation COM &amp;#xCC3E;&amp;#xAE30;&lt;/h3&gt;&lt;p&gt;Cross Session Activation&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; PowerShell&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;Interactive User&amp;#x201D;&amp;#xB85C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xACE0;, &amp;#xC55E;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &lt;a href=&#34;https://github.com/CICADA8-Research/COMThanasia&#34;&gt;COMThanasia Tool&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; RunAs, AppID, CLSID &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xD6E8;&amp;#xC52C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; Part2&amp;#xB97C; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; Antivirus &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; Name(A)&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx) &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; CLSID&amp;#xC744; &amp;#xCC3E;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;, &amp;#xB450; &amp;#xAC1C;&amp;#xC758; CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler)&lt;/li&gt;
&lt;li&gt;xxxxxxxx-xxxx-xxxx-BBBB-BBBBBBBBBBBB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; OleView.Net&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler) CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C; IDispatch &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; Typelib&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB5A8;&amp;#xB9AC;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; Typelib&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, File Handler &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC911; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;, CLSID(xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA)&amp;#xB294; TARGET.exe &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC774;&amp;#xACE0;, TARGET.exe&amp;#xC758; IL(Integrity Level)&amp;#xC774; System &amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; Application Identity &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; System32 &amp;#xD3F4;&amp;#xB354; &amp;#xC548;&amp;#xC5D0; notepad.exe &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xC11C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC88C;&amp;#xC808;&amp;#xD558;&amp;#xBA70; &amp;#xADF8; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; Application Identity &amp;#xAC12;&amp;#xC774; The Launching User&amp;#xB77C;&amp;#xACE0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xAC01; &amp;#xD6C4; &amp;#xB118;&amp;#xC5B4;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C;, Application Identity &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC548; &amp;#xD588;&amp;#xB358; &amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xB098;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; SYSTEM&amp;#xC774;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;?!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC65C;? GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xCD94;&amp;#xCE21;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;File Delete &amp;#xD558;&amp;#xAE30; &amp;#xC804;, C:\Windows, C:\windows\system32, C:\Program Files&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xB0B4;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC740; &amp;#xD55C;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;.exe, .dll, .db &amp;#xB4F1; &amp;#xD30C;&amp;#xC77C; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xBA85;&amp;#xC744; &amp;#xBE14;&amp;#xB799;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD55C;&amp;#xB2E4;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;System32 &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; GoFileDelete &amp;#xD55C; &amp;#xACB0;&amp;#xACFC; exe, dll, db&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ini, chm &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#x2026; &amp;#xC774;&amp;#xC81C; &amp;#xB0A8;&amp;#xC740; &amp;#xAC74; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC815;&amp;#xD655;&amp;#xD788; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AD;&amp;#xC81C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! (&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Cross Session Activation &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; AntiVirus &amp;#xB0B4;&amp;#xC5D0; COM&amp;#xC5D0;&amp;#xC11C; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xBED4;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA&amp;#xB85C; &amp;#xBD84;&amp;#xC11D; &amp;#xD6C4; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAC70;&amp;#xB098; &amp;#xC815; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC798; &amp;#xC5EE;&amp;#xC5B4;&amp;#xC11C; COM &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xB4E4;&amp;#xACE0; &amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB098;&amp;#xB294; &amp;#xC65C; Execute &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC9C0;..)&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xCC38;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xCC38;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCC38;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xCC38;&amp;#xACE0;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html&#34;&gt;https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.compass-security.com/2024/10/com-cross-session-activation/&#34;&gt;https://blog.compass-security.com/2024/10/com-cross-session-activation/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://note-ing.tistory.com/65&#34;&gt;https://note-ing.tistory.com/65&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] COM Object - Part 3(Cross-Session Activation)(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h3 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h3&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!! &lt;/p&gt;
&lt;p&gt;Part3&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;, &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Cross Session Activation&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &lt;a href=&#34;https://hackyboiz.github.io/2024/12/22/ogu123/COM_Object_part2/ko/&#34;&gt;Part2&lt;/a&gt; &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4; &amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADF8;&amp;#xB7FC; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;h3 id=&#34;COM-Security&#34;&gt;&lt;a href=&#34;#COM-Security&#34; class=&#34;headerlink&#34; title=&#34;COM Security&#34;&gt;&lt;/a&gt;COM Security&lt;/h3&gt;&lt;p&gt;COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; COM Security&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1D;&amp;#xCCB4; &amp;#xC0DD;&amp;#xC131;, &amp;#xC811;&amp;#xADFC;, &amp;#xAD8C;&amp;#xD55C; &amp;#xB4F1;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COM Security&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC124;&amp;#xC815; &amp;#xC911; Application Identity&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xACC4;&amp;#xC815; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/2.png&#34; alt&gt;&lt;br&gt;&amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xD574;&amp;#xB2F9; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; Interactive User(&amp;#xB300;&amp;#xD654;&amp;#xD615; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;)&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Interactive User&amp;#xB780;, &amp;#xD604;&amp;#xC7AC; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Cross-Session Activation&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB354; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Windows Session Isolation &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Windows-Session-Isolation&#34;&gt;&lt;a href=&#34;#Windows-Session-Isolation&#34; class=&#34;headerlink&#34; title=&#34;Windows Session Isolation&#34;&gt;&lt;/a&gt;Windows Session Isolation&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows XP &amp;#xBC0F; Windows Server 2003 &amp;#xC774;&amp;#xD558; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD558;&amp;#xBA74;, &amp;#xC720;&amp;#xC800; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; Windows &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; Session 0&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C;, &amp;#xC720;&amp;#xC800; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windows 7 &amp;#xC774;&amp;#xD6C4; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC815;&amp;#xCC45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xAC01;&amp;#xAE30; &amp;#xB2E4;&amp;#xB978; &amp;#xC138;&amp;#xC158;(1, 2, 3&amp;#x2026;)&amp;#xC744; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&lt;/li&gt;
&lt;li&gt;&amp;#xC138;&amp;#xC158; 0&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC138;&amp;#xC158;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;(interact) &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC138;&amp;#xC158;&amp;#xC774; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBD84;&amp;#xB9AC;&amp;#xB418;&amp;#xBA74;&amp;#xC11C;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC138;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370;.. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Interactive User&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; Cross-Session Activation&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Cross-Session-Activation&#34;&gt;&lt;a href=&#34;#Cross-Session-Activation&#34; class=&#34;headerlink&#34; title=&#34;Cross-Session Activation&#34;&gt;&lt;/a&gt;Cross-Session Activation&lt;/h3&gt;&lt;p&gt;Cross-Session Activation&amp;#xC740; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB3C4; &amp;#xC138;&amp;#xC158; &amp;#xAC04; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; interactive user &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C; Session Moniker&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC138;&amp;#xC158; &amp;#xAC04; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBC0F; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; INTERACTIVE &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; Access Security&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC874;&amp;#xC7AC;(Authenticated Users, &amp;#x2026;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://decoder.cloud/2024/08/02/the-fake-potato/&#34;&gt;Windows File Explorer EoP(CVE-2024-38100)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2024-38100&amp;#xC740; Explorer(Hight IL) &amp;#xB0B4;&amp;#xC5D0; DCOM &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; Cross-Session Activation &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xACE0;, ShellExecute &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4; COM Cross-Session Activation&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; EoP &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Cross-Session Activation&amp;#xC774; Interactive User&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &lt;a href=&#34;https://issues.chromium.org/issues/341803763&#34;&gt;Chrome Updater EoP(CVE-2024-7023)&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SYSTEM&amp;#xB3C4; Cross-Session Activation &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Cross-Session-Activation-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Cross-Session-Activation-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Cross Session Activation COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Cross Session Activation COM &amp;#xCC3E;&amp;#xAE30;&lt;/h3&gt;&lt;p&gt;Cross Session Activation&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; PowerShell&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;Interactive User&amp;#x201D;&amp;#xB85C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xACE0;, &amp;#xC55E;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &lt;a href=&#34;https://github.com/CICADA8-Research/COMThanasia&#34;&gt;COMThanasia Tool&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; RunAs, AppID, CLSID &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xD6E8;&amp;#xC52C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xD2B9;&amp;#xC815;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;-&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C;-COM-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xCC3E;&amp;#xAE30;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; Part2&amp;#xB97C; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; Antivirus &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Launch &amp;#xAD8C;&amp;#xD55C;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; Name(A)&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx) &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB098;&amp;#xC624;&amp;#xB294;&amp;#xB370;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; CLSID&amp;#xC744; &amp;#xCC3E;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;, &amp;#xB450; &amp;#xAC1C;&amp;#xC758; CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler)&lt;/li&gt;
&lt;li&gt;xxxxxxxx-xxxx-xxxx-BBBB-BBBBBBBBBBBB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; OleView.Net&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler) CLSID&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C; IDispatch &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; Typelib&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB5A8;&amp;#xB9AC;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; Typelib&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, File Handler &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC911; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;, CLSID(xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA)&amp;#xB294; TARGET.exe &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC774;&amp;#xACE0;, TARGET.exe&amp;#xC758; IL(Integrity Level)&amp;#xC774; System &amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; Application Identity &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; System32 &amp;#xD3F4;&amp;#xB354; &amp;#xC548;&amp;#xC5D0; notepad.exe &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xC11C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC88C;&amp;#xC808;&amp;#xD558;&amp;#xBA70; &amp;#xADF8; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; Application Identity &amp;#xAC12;&amp;#xC774; The Launching User&amp;#xB77C;&amp;#xACE0;&amp;#xB9CC; &amp;#xC0DD;&amp;#xAC01; &amp;#xD6C4; &amp;#xB118;&amp;#xC5B4;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C;, Application Identity &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC548; &amp;#xD588;&amp;#xB358; &amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xB098;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; SYSTEM&amp;#xC774;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;?!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC65C;? GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC9C0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBCF8; &amp;#xACB0;&amp;#xACFC; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xCD94;&amp;#xCE21;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;File Delete &amp;#xD558;&amp;#xAE30; &amp;#xC804;, C:\Windows, C:\windows\system32, C:\Program Files&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xB0B4;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC740; &amp;#xD55C;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;.exe, .dll, .db &amp;#xB4F1; &amp;#xD30C;&amp;#xC77C; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xBA85;&amp;#xC744; &amp;#xBE14;&amp;#xB799;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD55C;&amp;#xB2E4;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/16/ogu123/Com_Object_Part3/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;System32 &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; GoFileDelete &amp;#xD55C; &amp;#xACB0;&amp;#xACFC; exe, dll, db&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ini, chm &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#x2026; &amp;#xC774;&amp;#xC81C; &amp;#xB0A8;&amp;#xC740; &amp;#xAC74; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC815;&amp;#xD655;&amp;#xD788; GoFileDelete &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0AD;&amp;#xC81C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! (&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Cross Session Activation &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; AntiVirus &amp;#xB0B4;&amp;#xC5D0; COM&amp;#xC5D0;&amp;#xC11C; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xBED4;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA&amp;#xB85C; &amp;#xBD84;&amp;#xC11D; &amp;#xD6C4; File Delete &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAC70;&amp;#xB098; &amp;#xC815; &amp;#xC548;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; &amp;#xB2E4;&amp;#xB978; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC798; &amp;#xC5EE;&amp;#xC5B4;&amp;#xC11C; COM &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xB4E4;&amp;#xACE0; &amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB098;&amp;#xB294; &amp;#xC65C; Execute &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC9C0;..)&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xCC38;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xCC38;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCC38;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xCC38;&amp;#xACE0;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html&#34;&gt;https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.compass-security.com/2024/10/com-cross-session-activation/&#34;&gt;https://blog.compass-security.com/2024/10/com-cross-session-activation/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://note-ing.tistory.com/65&#34;&gt;https://note-ing.tistory.com/65&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/03/16/ogu123/Com_Object_Part3/KR/1.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/03/16/ogu123/com_object_part3/kr/">

  <title>[Research] COM Object - Part 3(Cross-Session Activation)(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-03-16 17:00" pubdate>
      2025 3 16 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.7k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      34
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] COM Object - Part 3(Cross-Session Activation)(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h3 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h3><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! ogu123&#xC785;&#xB2C8;&#xB2E4;!! </p>
<p>Part3&#xB294; COM &#xAC1D;&#xCCB4;&#xAC00; Interactive User&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5C8;&#xC744; &#xB54C;, &#xBC1C;&#xC0DD;&#xD558;&#xB294; Cross Session Activation&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0; <a href="https://hackyboiz.github.io/2024/12/22/ogu123/COM_Object_part2/ko/">Part2</a> &#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xCC3E;&#xAE30;&#xB97C; &#xC774;&#xC5B4; &#xAC00;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC774;&#xBC88;&#xC5D0;&#xB294; &#xC774;&#xB860;&#xC774; &#xB9CE;&#xC774; &#xC5C6;&#xC5B4; &#xD3B8;&#xD558;&#xAC8C; &#xBCF4;&#xC2DC;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;! &#xADF8;&#xB7FC; &#xC2E0;&#xB098;&#xAC8C; &#xACF5;&#xBD80;&#xD558;&#xB7EC; &#xAC00;&#xBCF4;&#xC8E0;!</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/1.jpg" srcset="/img/loading.gif" alt></p>
<h3 id="COM-Security"><a href="#COM-Security" class="headerlink" title="COM Security"></a>COM Security</h3><p>COM &#xAC1D;&#xCCB4;&#xB294; COM Security&#xC744; &#xD1B5;&#xD574; &#xAC1D;&#xCCB4; &#xC0DD;&#xC131;, &#xC811;&#xADFC;, &#xAD8C;&#xD55C; &#xB4F1;&#xC744; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>COM Security&#xC744; &#xC704;&#xD55C; &#xC5EC;&#xB7EC; &#xC124;&#xC815; &#xC911; Application Identity&#xB294; COM &#xAC1D;&#xCCB4;&#xAC00; &#xC2E4;&#xD589;&#xB420; &#xB54C; &#xC0AC;&#xC6A9;&#xD560; &#xACC4;&#xC815; &#xAD8C;&#xD55C;&#xC744; &#xACB0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/2.png" srcset="/img/loading.gif" alt><br>&#xAD6C;&#xC131; &#xC694;&#xC18C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; DCOM &#xAC1D;&#xCCB4;&#xC758; &#xC18D;&#xC131;&#xC744; &#xD655;&#xC778;&#xD55C; &#xACB0;&#xACFC;, &#xD574;&#xB2F9; &#xAC1D;&#xCCB4;&#xB294; Interactive User(&#xB300;&#xD654;&#xD615; &#xC0AC;&#xC6A9;&#xC790;)&#xB85C; &#xC124;&#xC815;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; Interactive User&#xB780;, &#xD604;&#xC7AC; &#xB85C;&#xADF8;&#xC778;&#xD55C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC124;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Cross-Session Activation&#xC774; &#xAC00;&#xB2A5;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB294; Interactive User&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; </p>
<p>&#xC774;&#xB97C; &#xB354; &#xC798; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574;, Windows Session Isolation &#xAC1C;&#xB150;&#xC744; &#xBA3C;&#xC800; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Windows-Session-Isolation"><a href="#Windows-Session-Isolation" class="headerlink" title="Windows Session Isolation"></a>Windows Session Isolation</h3><p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/3.png" srcset="/img/loading.gif" alt></p>
<p>Windows XP &#xBC0F; Windows Server 2003 &#xC774;&#xD558; &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCC98;&#xC74C; &#xB85C;&#xADF8;&#xC778;&#xD558;&#xBA74;, &#xC720;&#xC800; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; Windows &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xBAA8;&#xB450; Session 0&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB4E4;&#xC740; &#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD558;&#xC5EC; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C4; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C;, &#xC720;&#xC800; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xC2DC;&#xB3C4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; Windows 7 &#xC774;&#xD6C4; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xBCF4;&#xC548; &#xC815;&#xCC45;&#xC774; &#xC801;&#xC6A9;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xB85C;&#xADF8;&#xC778;&#xD55C; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xAC01;&#xAE30; &#xB2E4;&#xB978; &#xC138;&#xC158;(1, 2, 3&#x2026;)&#xC744; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;</li>
<li>&#xC138;&#xC158; 0&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC138;&#xC158;&#xACFC; &#xC0C1;&#xD638;&#xC791;&#xC6A9;(interact) &#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;</li>
</ol>
<p>&#xC774;&#xB85C; &#xC778;&#xD574; &#xC138;&#xC158;&#xC774; &#xC644;&#xC804;&#xD788; &#xBD84;&#xB9AC;&#xB418;&#xBA74;&#xC11C;, &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xB2E4;&#xB978; &#xC138;&#xC158;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xC9C1;&#xC811; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370;.. &#xC5EC;&#xAE30;&#xC11C; Interactive User&#xB85C; &#xC124;&#xC815;&#xB41C; COM &#xAC1D;&#xCCB4;&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xACBD;&#xC6B0; Cross-Session Activation&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Cross-Session-Activation"><a href="#Cross-Session-Activation" class="headerlink" title="Cross-Session Activation"></a>Cross-Session Activation</h3><p>Cross-Session Activation&#xC740; &#xB9D0; &#xADF8;&#xB300;&#xB3C4; &#xC138;&#xC158; &#xAC04; COM &#xAC1D;&#xCCB4;&#xB97C; &#xD65C;&#xC131;&#xD654;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB97C; &#xB9CC;&#xC871;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; interactive user &#xB9D0;&#xACE0;&#xB3C4; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD574;&#xC57C; Session Moniker&#xB97C; &#xD1B5;&#xD574; &#xC138;&#xC158; &#xAC04; COM &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>COM &#xAC1D;&#xCCB4;&#xC758; &#xC2DC;&#xC791; &#xBC0F; &#xD65C;&#xC131;&#xD654; &#xAD8C;&#xD55C;&#xC5D0; INTERACTIVE &#xC874;&#xC7AC;</li>
<li>&#xD504;&#xB85C;&#xC138;&#xC2A4; Access Security&#xC5D0; &#xC801;&#xC808;&#xD55C; &#xAD8C;&#xD55C; &#xC874;&#xC7AC;(Authenticated Users, &#x2026;)</li>
</ul>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/5.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://decoder.cloud/2024/08/02/the-fake-potato/">Windows File Explorer EoP(CVE-2024-38100)</a></p>
</blockquote>
<p>CVE-2024-38100&#xC740; Explorer(Hight IL) &#xB0B4;&#xC5D0; DCOM &#xAC1D;&#xCCB4;&#xAC00; Cross-Session Activation &#xC870;&#xAC74;&#xC744; &#xBAA8;&#xB450; &#xB9CC;&#xC871;&#xD558;&#xACE0;, ShellExecute &#xBA54;&#xC18C;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC5B4; COM Cross-Session Activation&#xC73C;&#xB85C; &#xC778;&#xD55C; EoP &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>MS&#xC5D0;&#xC11C;&#xB294; Cross-Session Activation&#xC774; Interactive User&#xC5D0;&#xC11C;&#xB9CC; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xD588;&#xC9C0;&#xB9CC;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://issues.chromium.org/issues/341803763">Chrome Updater EoP(CVE-2024-7023)</a>&#xB97C; &#xD1B5;&#xD574; SYSTEM&#xB3C4; Cross-Session Activation &#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBC1D;&#xD600;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Cross-Session-Activation-COM-&#xCC3E;&#xAE30;"><a href="#Cross-Session-Activation-COM-&#xCC3E;&#xAE30;" class="headerlink" title="Cross Session Activation COM &#xCC3E;&#xAE30;"></a>Cross Session Activation COM &#xCC3E;&#xAE30;</h3><p>Cross Session Activation&#xC5D0; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; COM &#xAC1D;&#xCCB4;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC744;&#xAE4C;&#xC694;?</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; PowerShell&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB4F1;&#xB85D;&#xB41C; &#xBAA8;&#xB4E0; COM &#xAC1D;&#xCCB4;&#xC5D0;&#xC11C; &#x201C;Interactive User&#x201D;&#xB85C; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xACE0;, &#xC55E;&#xC11C; &#xC5EC;&#xB7EC; &#xC870;&#xAC74;&#xB4E4;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294;&#xC9C0; &#xD558;&#xB098;&#xD558;&#xB098; &#xD655;&#xC778;&#xD558;&#xBA74;&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC81C;&#xAC00; &#xCD94;&#xCC9C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/CICADA8-Research/COMThanasia">COMThanasia Tool</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; RunAs, AppID, CLSID &#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xD55C;&#xB208;&#xC5D0; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xD6E8;&#xC52C; &#xD3B8;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xD2B9;&#xC815;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;-&#xCDE8;&#xC57D;&#xD55C;-COM-&#xCC3E;&#xAE30;"><a href="#&#xD2B9;&#xC815;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;-&#xCDE8;&#xC57D;&#xD55C;-COM-&#xCC3E;&#xAE30;" class="headerlink" title="&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xCC3E;&#xAE30;"></a>&#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xCC3E;&#xAE30;</h3><p>&#xC774;&#xC81C; Part2&#xB97C; &#xC774;&#xC5B4;&#xC11C; Antivirus &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; COM &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/7.png" srcset="/img/loading.gif" alt></p>
<p>Launch &#xAD8C;&#xD55C;&#xB9CC; &#xD655;&#xC778;&#xD55C; &#xACB0;&#xACFC;, &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB294; Name(A)&#xB97C; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx) &#xAC1D;&#xCCB4;&#xB294; &#xC0AC;&#xC6A9;&#xC740; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xB098;&#xC624;&#xB294;&#xB370;, &#xC815;&#xC801; &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xC774;&#xBBC0;&#xB85C; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131; &#xD6C4; &#xB2E4;&#xC2DC; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/8.png" srcset="/img/loading.gif" alt></p>
<p>AppID(xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; CLSID&#xC744; &#xCC3E;&#xC740; &#xACB0;&#xACFC;, &#xB450; &#xAC1C;&#xC758; CLSID&#xB97C; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler)</li>
<li>xxxxxxxx-xxxx-xxxx-BBBB-BBBBBBBBBBBB</li>
</ul>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; OleView.Net&#xB97C; &#xD1B5;&#xD574; xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA (File Handler) CLSID&#xB97C; &#xD655;&#xC778;&#xD55C; &#xACB0;&#xACFC;, &#xC6B4;&#xC774; &#xC88B;&#xAC8C; IDispatch &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC640; Typelib&#xB97C; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xB5A8;&#xB9AC;&#xB294; &#xB9C8;&#xC74C;&#xC73C;&#xB85C; Typelib&#xB97C; &#xC0B4;&#xD3B4;&#xBCF8; &#xACB0;&#xACFC;, File Handler &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xB0B4;&#xC5D0; &#xC5EC;&#xB7EC; &#xD30C;&#xC77C; &#xAD00;&#xB828; &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xC911; GoFileDelete &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; File Delete &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBA3C;&#xC800; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xB0B4;&#xC6A9;&#xC744; &#xC815;&#xB9AC;&#xD558;&#xBA74;, CLSID(xxxxxxxx-xxxx-xxxx-AAAA-AAAAAAAAAAAA)&#xB294; TARGET.exe &#xB0B4;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; COM &#xAC1D;&#xCCB4;&#xC774;&#xACE0;, TARGET.exe&#xC758; IL(Integrity Level)&#xC774; System &#xC784;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; COM &#xAC1D;&#xCCB4;&#xC758; Application Identity &#xAC12;&#xC744; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD558;&#xC9C0;&#xB9CC;, &#xC774;&#xBBF8; &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB97C; &#xCC3E;&#xC558;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC5D0; &#xD655;&#xC778;&#xC744; &#xC548; &#xD558;&#xACE0; &#xBC14;&#xB85C; GoFileDelete &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/12.png" srcset="/img/loading.gif" alt></p>
<p>GoFileDelete &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; System32 &#xD3F4;&#xB354; &#xC548;&#xC5D0; notepad.exe &#xC0AD;&#xC81C;&#xD558;&#xB824; &#xD588;&#xC9C0;&#xB9CC; &#xC2E4;&#xD328;&#xD574;&#xC11C;&#x2026;</p>
<p>&#xC88C;&#xC808;&#xD558;&#xBA70; &#xADF8; &#xB2F9;&#xC2DC;&#xC5D0;&#xB294; Application Identity &#xAC12;&#xC774; The Launching User&#xB77C;&#xACE0;&#xB9CC; &#xC0DD;&#xAC01; &#xD6C4; &#xB118;&#xC5B4;&#xAC14;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xD558;</p>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/13.png" srcset="/img/loading.gif" alt></p>
<p>&#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC4F0;&#xBA74;&#xC11C;, Application Identity &#xD655;&#xC778;&#xC744; &#xC548; &#xD588;&#xB358; &#xAC8C; &#xC0DD;&#xAC01;&#xB098;&#xC11C; &#xD655;&#xC778;&#xD55C; &#xACB0;&#xACFC; SYSTEM&#xC774;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;?!</p>
<p>&#xADF8;&#xB7FC; &#xC65C;? GoFileDelete &#xBA54;&#xC18C;&#xB4DC;&#xAC00; &#xC2E4;&#xD328;&#xD588;&#xC9C0; &#xC0DD;&#xAC01;&#xD574; &#xBCF8; &#xACB0;&#xACFC; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xCD94;&#xCE21;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>File Delete &#xD558;&#xAE30; &#xC804;, C:\Windows, C:\windows\system32, C:\Program Files&#xC640; &#xAC19;&#xC774; &#xBCF4;&#xD638;&#xB41C; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xB0B4;&#xC5D0; &#xD30C;&#xC77C;&#xC740; &#xD544;&#xD130;&#xB9C1;&#xC740; &#xD55C;&#xB2E4;</li>
<li>.exe, .dll, .db &#xB4F1; &#xD30C;&#xC77C; &#xD655;&#xC7A5;&#xC790;&#xBA85;&#xC744; &#xBE14;&#xB799;&#xB9AC;&#xC2A4;&#xD2B8;&#xB85C; &#xB123;&#xC5B4;&#xC11C; &#xD544;&#xD130;&#xB9C1;&#xD55C;&#xB2E4;</li>
</ol>
<p><img src="/2025/03/16/ogu123/Com_Object_Part3/KR/14.png" srcset="/img/loading.gif" alt></p>
<p>System32 &#xD3F4;&#xB354;&#xC5D0; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC5D0; GoFileDelete &#xD55C; &#xACB0;&#xACFC; exe, dll, db&#xC640; &#xAC19;&#xC740; &#xD30C;&#xC77C;&#xC740; &#xC0AD;&#xC81C;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xC9C0;&#xB9CC; ini, chm &#xD30C;&#xC77C; &#xB4F1;&#xC740; &#xC0AD;&#xC81C; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC;&#x2026; &#xC774;&#xC81C; &#xB0A8;&#xC740; &#xAC74; IDA&#xB97C; &#xD1B5;&#xD574; &#xC815;&#xD655;&#xD788; GoFileDelete &#xBA54;&#xC18C;&#xB4DC;&#xAC00; &#xC5B4;&#xB5A4; &#xD30C;&#xC77C;&#xC744; &#xC0AD;&#xC81C; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xC744; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;! (&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;)</p>
<h3 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h3><p>&#xC774;&#xBC88; &#xAE00;&#xC744; &#xD1B5;&#xD574; Cross Session Activation &#xAC1C;&#xB150;&#xACFC; AntiVirus &#xB0B4;&#xC5D0; COM&#xC5D0;&#xC11C; File Delete &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xBED4;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;!</p>
<p>&#xC774;&#xC81C; IDA&#xB85C; &#xBD84;&#xC11D; &#xD6C4; File Delete &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAC70;&#xB098; &#xC815; &#xC548;&#xB41C;&#xB2E4;&#xBA74;, &#xD30C;&#xC77C; &#xAD00;&#xB828; &#xB2E4;&#xB978; &#xBA54;&#xC18C;&#xB4DC;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC798; &#xC5EE;&#xC5B4;&#xC11C; COM &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB97C; &#xB4E4;&#xACE0; &#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xB098;&#xB294; &#xC65C; Execute &#xBA54;&#xC18C;&#xB4DC;&#xAC00; &#xC5C6;&#xC9C0;..)</p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2F9; &#x314E;&#x314E;</p>
<h3 id="&#xCC38;&#xACE0;"><a href="#&#xCC38;&#xACE0;" class="headerlink" title="&#xCC38;&#xACE0;"></a>&#xCC38;&#xACE0;</h3><ul>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html">https://www.tiraniddo.dev/2018/09/finding-interactive-user-com-objects_9.html</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.compass-security.com/2024/10/com-cross-session-activation/">https://blog.compass-security.com/2024/10/com-cross-session-activation/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://note-ing.tistory.com/65">https://note-ing.tistory.com/65</a></p>
</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/ogu123/">ogu123</a>
                  
                  <a class="hover-with-bg" href="/tags/COM-Object/">COM Object</a>
                  
                  <a class="hover-with-bg" href="/tags/Cross-Session-Activation/">Cross-Session Activation</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows-Session-Isolation/">Windows Session Isolation</a>
                  
                  <a class="hover-with-bg" href="/tags/AntiVirus/">AntiVirus</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_ogu123.jpg" srcset="/img/loading.gif" alt="ogu123">
                  </div>

                  <div class="link-text">
                    <div class="link-title">ogu123</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/ogu123">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/03/16/ogu123/Com_Object_Part3/EN/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] COM Object - Part 3(Cross-Session Activation)(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/03/15/mungsul/2025-03-15/">
                    <span class="hidden-mobile">[] CVE-2024-9487: GitHub Enterprise SAML Authentication Bypass </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/03/16/ogu123/Com_Object_Part3/KR/';
        this.page.identifier = '/2025/03/16/ogu123/Com_Object_Part3/KR/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] COM Object - Part 3(Cross-Session Activation)(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
