

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC5EC;&amp;#xB984;&amp;#xB9DE;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xBE44;&amp;#xC0C1;! &amp;#x1F31E;&amp;#x1F349;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xCF54;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xAC00;&amp;#xC628; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xB0A0;&amp;#xC528;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xB0A0; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xC218;&amp;#xBC15;&amp;#x1F349;&amp;#x1F349;&amp;#xACFC; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#x1F423;&amp;#x1F423; &amp;#xC5B4;&amp;#xB5A0;&amp;#xC138;&amp;#xC694;~~?&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;, QR&amp;#xCF54;&amp;#xB4DC; &amp;#xD050;&amp;#xC2F1; &amp;#xC0AC;&amp;#xAE30;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;, &amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xAE4C;&amp;#xC9C0;!&lt;/p&gt;
&lt;p&gt;&amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC704;&amp;#xD611; &amp;#xC18C;&amp;#xC2DD;! &amp;#xB193;&amp;#xCE58;&amp;#xBA74; &amp;#xD070;&amp;#xC77C; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x1F525;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;, CVE-2024-26169 Windows OS&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130624&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &lt;a href=&#34;https://symantec-enterprise-blogs.security.com/threat-intelligence/black-basta-ransomware-zero-day&#34;&gt;&amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xCD5C;&amp;#xC2E0; Windows &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB85C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xD654;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2024-26169)&amp;#xC740; Windows &amp;#xC624;&amp;#xB958; &amp;#xBCF4;&amp;#xACE0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC0C1;&amp;#xC2B9;&amp;#x1F199;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&lt;/strong&gt;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xC740; 2024&amp;#xB144; 3&amp;#xC6D4; 12&amp;#xC77C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xB2F9;&amp;#xC2DC; &lt;strong&gt;&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xC545;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&amp;#xB294; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&lt;/strong&gt;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098;!! Symantec&amp;#xC758; &amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;, &amp;#xCD5C;&amp;#xADFC; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5B4;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F635;&amp;#x200D;&amp;#x1F4AB;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D;&amp;#xC740; &amp;#xCD5C;&amp;#xADFC; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC;&amp;#xB3C4; &amp;#xC0AC;&amp;#xAC74;&amp;#xC744; &amp;#xC870;&amp;#xC0AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&lt;/a&gt;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xACE0;, werkernel.sys &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB110; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;&lt;/a&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xB294; 2022&amp;#xB144; 4&amp;#xC6D4; &amp;#xCC98;&amp;#xC74C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D;&amp;#xC740; &amp;#xCE74;&amp;#xB514;&amp;#xB110;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xAC00; &amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xB77C;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xCE75;&amp;#xBD07;(Qakbot) &amp;#xBD07;&amp;#xB137;&lt;/a&gt;&amp;#xACFC; &amp;#xAE4A;&amp;#xC740; &amp;#xC5F0;&amp;#xAD00;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xCE75;&amp;#xBD07;&amp;#xC774; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xC790; &amp;#xC7A0;&amp;#xC2DC; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8;(DarkGate)&lt;/a&gt;&amp;#xB85C;&amp;#xB354;&amp;#xC640; &amp;#xC190;&amp;#xC7A1;&amp;#xACE0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#x2018;&amp;#xD050;&amp;#xC2F1;&amp;#x2019; &amp;#xC8FC;&amp;#xC758;&amp;#xBCF4;&amp;#x2026;&amp;#xACF5;&amp;#xC720;&amp;#xC790;&amp;#xC804;&amp;#xAC70; QR &amp;#xCC0D;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC7A5; &amp;#xD138;&amp;#xB824;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xB9E4;&amp;#xC77C;&amp;#xACBD;&amp;#xC81C; | &lt;a href=&#34;https://m.mk.co.kr/amp/11043900&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#x1F50D;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xC2E0;&amp;#xC885; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xAE08;&amp;#xC735;&amp;#xC0AC;&amp;#xAE30;&amp;#x1F4B0;&amp;#xC778; &amp;#x2018;&amp;#xD050;&amp;#xC2F1;(Qshing)&amp;#x2019; &amp;#xC0AC;&amp;#xB840;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD050;&amp;#xC2F1;&amp;#xC740; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xD53C;&amp;#xC2F1;(Phishing)&amp;#xC744; &amp;#xACB0;&amp;#xD569;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB85C;, &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xBA74; &amp;#xC545;&amp;#xC131; &amp;#xC571;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xAE30; &amp;#xC218;&amp;#xBC95;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC804;&amp;#xB3D9;&amp;#xD0A5;&amp;#xBCF4;&amp;#xB4DC;&amp;#xB098; &amp;#xACE0;&amp;#xAC1D; &amp;#xC0AC;&amp;#xC740;&amp;#xD488; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC704;&amp;#xC7A5;&amp;#xB41C; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC720;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC8FC;&amp;#xCC28;&amp;#xB41C; &amp;#xCC28;&amp;#xB7C9;&amp;#xC5D0; &amp;#xBD80;&amp;#xCC29;&amp;#xB41C; &amp;#xAC00;&amp;#xC9DC; &amp;#x2018;&amp;#xBD88;&amp;#xBC95; &amp;#xC8FC;&amp;#xCC28; &amp;#xACBD;&amp;#xACE0;&amp;#xC7A5;&amp;#x2019;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD050;&amp;#xC2F1;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &lt;strong&gt;QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; &amp;#xADF8; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&lt;/strong&gt;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F4F1; &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC0AC;&amp;#xAE30;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xC6B1; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xAD6D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC815;&amp;#xBD80;&amp;#xB97C; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD55C; &amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCD9C;&amp;#xCC98;&amp;#xB97C; &amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xC571; &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC571;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC8FC;&amp;#xC758;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xACF5;&amp;#xACF5;&amp;#xC7A5;&amp;#xC18C;&amp;#xB098; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#xC804;&amp;#xAD6D; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xD53C;&amp;#xD574;, &amp;#xC62C;&amp;#xD574;&amp;#xB9CC; 50&amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &amp;#x2018;&amp;#xC5ED;&amp;#xB300; &amp;#xCD5C;&amp;#xB2E4;&amp;#x2019; &amp;#xCC0D;&amp;#xC5B4;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.20 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130758&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC62C;&amp;#xD574;&amp;#xB9CC; &amp;#xBC8C;&amp;#xC368; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C;&amp;#xAC70; &amp;#xC54C;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xC704;&amp;#xC6D0;&amp;#xD68C; &amp;#xC790;&amp;#xB8CC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;strong&gt;2024&amp;#xB144; 1&amp;#xC6D4;&amp;#xBD80;&amp;#xD130; 5&amp;#xC6D4;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC774; &amp;#xC2E0;&amp;#xACE0;&lt;/strong&gt;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD55C; &amp;#xB2EC; &amp;#xD3C9;&amp;#xADE0; &amp;#xC57D; 10&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC2EC;&amp;#xAC01;&amp;#xD568;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. 2019&amp;#xB144; 8&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; 2023&amp;#xB144;&amp;#xC5D0;&amp;#xB294; 41&amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC62C;&amp;#xD574;&amp;#xB294; &amp;#xC774;&amp;#xBBF8; &amp;#xC808;&amp;#xBC18;&amp;#xC744; &amp;#xB118;&amp;#xC5B4; &amp;#xC5ED;&amp;#xB300; &amp;#xCD5C;&amp;#xACE0;&amp;#xCE58;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F926;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; &lt;a href=&#34;https://hackyboiz.github.io/2024/05/13/romi0x/newsletter0513/#-3&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358;  2024&amp;#xB144; 4&amp;#xC6D4;, &amp;#xD589;&amp;#xC548;&amp;#xBD80;&amp;#xC758; &amp;#x2018;&amp;#xC815;&amp;#xBD80;24&amp;#x2019; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC624;&amp;#xB958;&amp;#xB85C; &amp;#xC778;&amp;#xD574; 1,200&amp;#xAC74; &amp;#xB118;&amp;#xB294; &amp;#xBBFC;&amp;#xC6D0;&amp;#xC11C;&amp;#xB958;&amp;#xAC00; &amp;#xD0C0;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xBA70; &amp;#xC774;&amp;#xB984;, &amp;#xC8FC;&amp;#xC18C;, &amp;#xC8FC;&amp;#xBBFC;&amp;#xB4F1;&amp;#xB85D;&amp;#xBC88;&amp;#xD638; &amp;#xB4F1;&amp;#xC774; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;a href=&#34;https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/#%EC%9D%B4%EB%B2%88-%EC%A3%BC-%EC%A7%B9%EC%A7%B9-PICK%F0%9F%90%A5&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &amp;#xBC95;&amp;#xC6D0; &amp;#xD574;&amp;#xD0B9;&amp;#xC73C;&amp;#xB85C; 1,014GB &amp;#xBD84;&amp;#xB7C9;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC870;&amp;#xC0AC;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F9;&amp;#xAD6D;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xBE44;&amp;#xD310;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F4E2;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC62C;&amp;#xD574;&amp;#xB9CC; &amp;#xBC8C;&amp;#xC368; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C;&amp;#xAC70; &amp;#xC54C;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.18 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130643&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00; &amp;#xBC0F; &amp;#xAE30;&amp;#xC5C5; &amp;#xB4F1; 22&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F3AF;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544; &amp;#xD574;&amp;#xCEE4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC758; &amp;#xD589;&amp;#xB3D9;&amp;#xC5D0; &amp;#xBD88;&amp;#xB9CC;&amp;#xC744; &amp;#xD488;&amp;#xC5B4; &amp;#xAC10;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;strong&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC740; 12&amp;#xC77C;&amp;#xC5D0; 7&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, 13&amp;#xC77C;&amp;#xC5D0; 3&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, 15&amp;#xC77C;&amp;#xC5D0; 2&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 17&amp;#xC77C;&amp;#xC5D0; 10&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBC1B;&amp;#xC740; &amp;#xC8FC;&amp;#xC694; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C;&amp;#xB294; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xB300;&amp;#xD1B5;&amp;#xB839;&amp;#xC2E4;, &amp;#xC778;&amp;#xCC9C;&amp;#xAD6D;&amp;#xC81C;&amp;#xACF5;&amp;#xD56D;, &amp;#xC2E0;&amp;#xD55C;&amp;#xAE08;&amp;#xC735;&amp;#xC9C0;&amp;#xC8FC;&amp;#xD68C;&amp;#xC0AC;, &amp;#xD55C;&amp;#xAD6D;&amp;#xC218;&amp;#xCD9C;&amp;#xC785;&amp;#xC740;&amp;#xD589;, &amp;#xAD00;&amp;#xC138;&amp;#xCCAD;, &amp;#xACBD;&amp;#xCC30;&amp;#xCCAD;, &amp;#xAD6D;&amp;#xC138;&amp;#xCCAD;, &amp;#xC6B0;&amp;#xC815;&amp;#xC0AC;&amp;#xC5C5;&amp;#xBCF8;&amp;#xBD80;, &amp;#xC11C;&amp;#xC6B8;&amp;#xD2B9;&amp;#xBCC4;&amp;#xC2DC;, &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50;, &amp;#xC0B0;&amp;#xC5C5;&amp;#xD1B5;&amp;#xC0C1;&amp;#xC790;&amp;#xC6D0;&amp;#xBD80;, &amp;#xC678;&amp;#xAD50;&amp;#xBD80;, &amp;#xAD6D;&amp;#xBB34;&amp;#xC870;&amp;#xC815;&amp;#xC2E4;&amp;#xAD6D;&amp;#xBB34;&amp;#xCD1D;&amp;#xB9AC;&amp;#xBE44;&amp;#xC11C;&amp;#xC2E4;, &amp;#xC778;&amp;#xC0AC;&amp;#xD601;&amp;#xC2E0;&amp;#xCC98;, &amp;#xC2DD;&amp;#xD488;&amp;#xC758;&amp;#xC57D;&amp;#xD488;&amp;#xC548;&amp;#xC804;&amp;#xCC98;, &amp;#xBB38;&amp;#xD654;&amp;#xCCB4;&amp;#xC721;&amp;#xAD00;&amp;#xAD11;&amp;#xBD80;, &amp;#xAD50;&amp;#xC721;&amp;#xBD80;, &amp;#xD658;&amp;#xACBD;&amp;#xBD80;, &amp;#xAD6D;&amp;#xD1A0;&amp;#xAD50;&amp;#xD1B5;&amp;#xBD80;, &amp;#xACE0;&amp;#xC6A9;&amp;#xB178;&amp;#xB3D9;&amp;#xBD80;, &amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;, &amp;#xD574;&amp;#xC591;&amp;#xC218;&amp;#xC0B0;&amp;#xBD80; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB300;&amp;#xC751;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xD558;&amp;#xC5EC; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xACFC; &amp;#xD611;&amp;#xB825;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#x1F914;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB110; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;(null security descriptor)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; null &amp;#xB610;&amp;#xB294; &amp;#xBE48; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;(&amp;#xD30C;&amp;#xC77C;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB4F1; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;)&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;(Black Basta)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;2022&amp;#xB144; 4&amp;#xC6D4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xC885; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C; &amp;#xD53C;&amp;#xD574; &amp;#xD0C0;&amp;#xAE43; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB2A5;&amp;#xB825;&amp;#xACFC; &amp;#xD611;&amp;#xC0C1; &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C;&amp;#xB85C; &amp;#xAE09;&amp;#xBD80;&amp;#xC0C1;&amp;#xD55C; &amp;#xADF8;&amp;#xB8F9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xCE75;&amp;#xBD07;(Qakbot)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE08;&amp;#xC735; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE58;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xC545;&amp;#xC131; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD07;&amp;#xB137;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8;(DarkGate)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;, &amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xCD5C;&amp;#xADFC; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC758; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC545;&amp;#xC6A9;&amp;#xD568;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.yna.co.kr/view/AKR20240617160200001&#34;&gt;&amp;#xC120;&amp;#xAD00;&amp;#xC704;, &amp;#xBCF4;&amp;#xC548;&amp;#xC810;&amp;#xAC80;&amp;#xC11C; &amp;#xC9C1;&amp;#xC6D0; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C;&amp;#x2026;&amp;#x201D;&amp;#xC678;&amp;#xC8FC; &amp;#xC9C1;&amp;#xC6D0; &amp;#xC2E4;&amp;#xC218;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.busan.com/view/busan/view.php?code=2024061716524399705&#34;&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xBC95; &amp;#xC2DC;&amp;#xD589; &amp;#xCF54;&amp;#xC55E;&amp;#xC778;&amp;#xB370;&amp;#x2026;&amp;#xBCF4;&amp;#xC548;&amp;#xB7;&amp;#xB0B4;&amp;#xBD80;&amp;#xD1B5;&amp;#xC81C; &amp;#xC544;&amp;#xC9C1; &amp;#x2018;&amp;#xBBF8;&amp;#xD761;&amp;#x2019;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.ddaily.co.kr/page/view/2024061610443973019&#34;&gt;&amp;#xBA85;&amp;#xD488;&amp;#xC2DC;&amp;#xACC4; &amp;#x2018;&amp;#xD0DC;&amp;#xADF8;&amp;#xD638;&amp;#xC774;&amp;#xC5B4;&amp;#x2019; &amp;#x97D3; &amp;#xACE0;&amp;#xAC1D;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#x2026;&amp;#xACFC;&amp;#xC9D5;&amp;#xAE08; 1&amp;#xC5B5;2600&amp;#xB9CC;&amp;#xC6D0;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.etnews.com/20240617000165&#34;&gt;&amp;#xAC1C;&amp;#xC815;&amp;#xC704; &amp;#x201C;&amp;#xC27D;&amp;#xAC8C; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C;&amp;#x201D; vs &amp;#xCE74;&amp;#xCE74;&amp;#xC624; &amp;#x201C;&amp;#xD574;&amp;#xCEE4; &amp;#xD0D3;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.hankyung.com/article/2024061849591&#34;&gt;&amp;#xC218;&amp;#xC775;&amp;#xB960; 120%&amp;#x201D;&amp;#x2026;&amp;#x2019;&amp;#xC2A4;&amp;#xD338;&amp;#xBB38;&amp;#xC790;&amp;#x2019; &amp;#xC720;&amp;#xB3C5; &amp;#xB9CE;&amp;#xC774; &amp;#xC624;&amp;#xB294; &amp;#xC774;&amp;#xC720; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.codeground.org/&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~ 2408.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://www.itdaily.kr/news/articleView.html?idxno=223547&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.08.31&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] ì˜¤ëŠ˜ë„ íƒˆíƒˆ í„¸ë¦¬ëŠ”..ðŸ‡°ðŸ‡· - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC5EC;&amp;#xB984;&amp;#xB9DE;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xBE44;&amp;#xC0C1;! &amp;#x1F31E;&amp;#x1F349;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xCF54;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xAC00;&amp;#xC628; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xB0A0;&amp;#xC528;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xB0A0; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xC218;&amp;#xBC15;&amp;#x1F349;&amp;#x1F349;&amp;#xACFC; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#x1F423;&amp;#x1F423; &amp;#xC5B4;&amp;#xB5A0;&amp;#xC138;&amp;#xC694;~~?&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;, QR&amp;#xCF54;&amp;#xB4DC; &amp;#xD050;&amp;#xC2F1; &amp;#xC0AC;&amp;#xAE30;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;, &amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xAE4C;&amp;#xC9C0;!&lt;/p&gt;
&lt;p&gt;&amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC704;&amp;#xD611; &amp;#xC18C;&amp;#xC2DD;! &amp;#xB193;&amp;#xCE58;&amp;#xBA74; &amp;#xD070;&amp;#xC77C; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;!&amp;#x1F525;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;, CVE-2024-26169 Windows OS&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130624&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &lt;a href=&#34;https://symantec-enterprise-blogs.security.com/threat-intelligence/black-basta-ransomware-zero-day&#34;&gt;&amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xCD5C;&amp;#xC2E0; Windows &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB85C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xD654;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(CVE-2024-26169)&amp;#xC740; Windows &amp;#xC624;&amp;#xB958; &amp;#xBCF4;&amp;#xACE0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC0C1;&amp;#xC2B9;&amp;#x1F199;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&lt;/strong&gt;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Microsoft&amp;#xC740; 2024&amp;#xB144; 3&amp;#xC6D4; 12&amp;#xC77C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xB2F9;&amp;#xC2DC; &lt;strong&gt;&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xC545;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&amp;#xB294; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&lt;/strong&gt;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098;!! Symantec&amp;#xC758; &amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;, &amp;#xCD5C;&amp;#xADFC; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5B4;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F635;&amp;#x200D;&amp;#x1F4AB;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D;&amp;#xC740; &amp;#xCD5C;&amp;#xADFC; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC;&amp;#xB3C4; &amp;#xC0AC;&amp;#xAC74;&amp;#xC744; &amp;#xC870;&amp;#xC0AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&lt;/a&gt;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xACE0;, werkernel.sys &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB110; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;&lt;/a&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xB294; 2022&amp;#xB144; 4&amp;#xC6D4; &amp;#xCC98;&amp;#xC74C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2DC;&amp;#xB9CC;&amp;#xD14D;&amp;#xC740; &amp;#xCE74;&amp;#xB514;&amp;#xB110;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xAC00; &amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;&amp;#xB77C;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xCE75;&amp;#xBD07;(Qakbot) &amp;#xBD07;&amp;#xB137;&lt;/a&gt;&amp;#xACFC; &amp;#xAE4A;&amp;#xC740; &amp;#xC5F0;&amp;#xAD00;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xCE75;&amp;#xBD07;&amp;#xC774; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xC790; &amp;#xC7A0;&amp;#xC2DC; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8;(DarkGate)&lt;/a&gt;&amp;#xB85C;&amp;#xB354;&amp;#xC640; &amp;#xC190;&amp;#xC7A1;&amp;#xACE0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#x2018;&amp;#xD050;&amp;#xC2F1;&amp;#x2019; &amp;#xC8FC;&amp;#xC758;&amp;#xBCF4;&amp;#x2026;&amp;#xACF5;&amp;#xC720;&amp;#xC790;&amp;#xC804;&amp;#xAC70; QR &amp;#xCC0D;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC7A5; &amp;#xD138;&amp;#xB824;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xB9E4;&amp;#xC77C;&amp;#xACBD;&amp;#xC81C; | &lt;a href=&#34;https://m.mk.co.kr/amp/11043900&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#x1F50D;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &amp;#xC2E0;&amp;#xC885; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xAE08;&amp;#xC735;&amp;#xC0AC;&amp;#xAE30;&amp;#x1F4B0;&amp;#xC778; &amp;#x2018;&amp;#xD050;&amp;#xC2F1;(Qshing)&amp;#x2019; &amp;#xC0AC;&amp;#xB840;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD050;&amp;#xC2F1;&amp;#xC740; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xD53C;&amp;#xC2F1;(Phishing)&amp;#xC744; &amp;#xACB0;&amp;#xD569;&amp;#xD55C; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB85C;, &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xBA74; &amp;#xC545;&amp;#xC131; &amp;#xC571;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xAE30; &amp;#xC218;&amp;#xBC95;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC804;&amp;#xB3D9;&amp;#xD0A5;&amp;#xBCF4;&amp;#xB4DC;&amp;#xB098; &amp;#xACE0;&amp;#xAC1D; &amp;#xC0AC;&amp;#xC740;&amp;#xD488; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC704;&amp;#xC7A5;&amp;#xB41C; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC720;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC8FC;&amp;#xCC28;&amp;#xB41C; &amp;#xCC28;&amp;#xB7C9;&amp;#xC5D0; &amp;#xBD80;&amp;#xCC29;&amp;#xB41C; &amp;#xAC00;&amp;#xC9DC; &amp;#x2018;&amp;#xBD88;&amp;#xBC95; &amp;#xC8FC;&amp;#xCC28; &amp;#xACBD;&amp;#xACE0;&amp;#xC7A5;&amp;#x2019;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD050;&amp;#xC2F1;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &lt;strong&gt;QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; &amp;#xADF8; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&lt;/strong&gt;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F4F1; &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC0AC;&amp;#xAE30;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xC6B1; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xAD6D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC815;&amp;#xBD80;&amp;#xB97C; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD55C; &amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xCD9C;&amp;#xCC98;&amp;#xB97C; &amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xC571; &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC571;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC8FC;&amp;#xC758;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xACF5;&amp;#xACF5;&amp;#xC7A5;&amp;#xC18C;&amp;#xB098; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; QR&amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#xC804;&amp;#xAD6D; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xD53C;&amp;#xD574;, &amp;#xC62C;&amp;#xD574;&amp;#xB9CC; 50&amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &amp;#x2018;&amp;#xC5ED;&amp;#xB300; &amp;#xCD5C;&amp;#xB2E4;&amp;#x2019; &amp;#xCC0D;&amp;#xC5B4;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.20 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130758&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC62C;&amp;#xD574;&amp;#xB9CC; &amp;#xBC8C;&amp;#xC368; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C;&amp;#xAC70; &amp;#xC54C;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xC704;&amp;#xC6D0;&amp;#xD68C; &amp;#xC790;&amp;#xB8CC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;strong&gt;2024&amp;#xB144; 1&amp;#xC6D4;&amp;#xBD80;&amp;#xD130; 5&amp;#xC6D4;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC774; &amp;#xC2E0;&amp;#xACE0;&lt;/strong&gt;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD55C; &amp;#xB2EC; &amp;#xD3C9;&amp;#xADE0; &amp;#xC57D; 10&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC2EC;&amp;#xAC01;&amp;#xD568;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. 2019&amp;#xB144; 8&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; 2023&amp;#xB144;&amp;#xC5D0;&amp;#xB294; 41&amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC62C;&amp;#xD574;&amp;#xB294; &amp;#xC774;&amp;#xBBF8; &amp;#xC808;&amp;#xBC18;&amp;#xC744; &amp;#xB118;&amp;#xC5B4; &amp;#xC5ED;&amp;#xB300; &amp;#xCD5C;&amp;#xACE0;&amp;#xCE58;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F926;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; &lt;a href=&#34;https://hackyboiz.github.io/2024/05/13/romi0x/newsletter0513/#-3&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358;  2024&amp;#xB144; 4&amp;#xC6D4;, &amp;#xD589;&amp;#xC548;&amp;#xBD80;&amp;#xC758; &amp;#x2018;&amp;#xC815;&amp;#xBD80;24&amp;#x2019; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC624;&amp;#xB958;&amp;#xB85C; &amp;#xC778;&amp;#xD574; 1,200&amp;#xAC74; &amp;#xB118;&amp;#xB294; &amp;#xBBFC;&amp;#xC6D0;&amp;#xC11C;&amp;#xB958;&amp;#xAC00; &amp;#xD0C0;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xBA70; &amp;#xC774;&amp;#xB984;, &amp;#xC8FC;&amp;#xC18C;, &amp;#xC8FC;&amp;#xBBFC;&amp;#xB4F1;&amp;#xB85D;&amp;#xBC88;&amp;#xD638; &amp;#xB4F1;&amp;#xC774; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;a href=&#34;https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/#%EC%9D%B4%EB%B2%88-%EC%A3%BC-%EC%A7%B9%EC%A7%B9-PICK%F0%9F%90%A5&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &amp;#xBC95;&amp;#xC6D0; &amp;#xD574;&amp;#xD0B9;&amp;#xC73C;&amp;#xB85C; 1,014GB &amp;#xBD84;&amp;#xB7C9;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC870;&amp;#xC0AC;&amp;#xB3C4; &amp;#xC9C4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F9;&amp;#xAD6D;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xBE44;&amp;#xD310;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F4E2;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC62C;&amp;#xD574;&amp;#xB9CC; &amp;#xBC8C;&amp;#xC368; 50&amp;#xACF3;&amp;#xC758; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C;&amp;#xAC70; &amp;#xC54C;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.18 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130643&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/24/romi0x/newsletter0624/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00; &amp;#xBC0F; &amp;#xAE30;&amp;#xC5C5; &amp;#xB4F1; 22&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F3AF;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544; &amp;#xD574;&amp;#xCEE4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC758; &amp;#xD589;&amp;#xB3D9;&amp;#xC5D0; &amp;#xBD88;&amp;#xB9CC;&amp;#xC744; &amp;#xD488;&amp;#xC5B4; &amp;#xAC10;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;strong&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC740; 12&amp;#xC77C;&amp;#xC5D0; 7&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, 13&amp;#xC77C;&amp;#xC5D0; 3&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, 15&amp;#xC77C;&amp;#xC5D0; 2&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 17&amp;#xC77C;&amp;#xC5D0; 10&amp;#xAC1C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBC1B;&amp;#xC740; &amp;#xC8FC;&amp;#xC694; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C;&amp;#xB294; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xB300;&amp;#xD1B5;&amp;#xB839;&amp;#xC2E4;, &amp;#xC778;&amp;#xCC9C;&amp;#xAD6D;&amp;#xC81C;&amp;#xACF5;&amp;#xD56D;, &amp;#xC2E0;&amp;#xD55C;&amp;#xAE08;&amp;#xC735;&amp;#xC9C0;&amp;#xC8FC;&amp;#xD68C;&amp;#xC0AC;, &amp;#xD55C;&amp;#xAD6D;&amp;#xC218;&amp;#xCD9C;&amp;#xC785;&amp;#xC740;&amp;#xD589;, &amp;#xAD00;&amp;#xC138;&amp;#xCCAD;, &amp;#xACBD;&amp;#xCC30;&amp;#xCCAD;, &amp;#xAD6D;&amp;#xC138;&amp;#xCCAD;, &amp;#xC6B0;&amp;#xC815;&amp;#xC0AC;&amp;#xC5C5;&amp;#xBCF8;&amp;#xBD80;, &amp;#xC11C;&amp;#xC6B8;&amp;#xD2B9;&amp;#xBCC4;&amp;#xC2DC;, &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50;, &amp;#xC0B0;&amp;#xC5C5;&amp;#xD1B5;&amp;#xC0C1;&amp;#xC790;&amp;#xC6D0;&amp;#xBD80;, &amp;#xC678;&amp;#xAD50;&amp;#xBD80;, &amp;#xAD6D;&amp;#xBB34;&amp;#xC870;&amp;#xC815;&amp;#xC2E4;&amp;#xAD6D;&amp;#xBB34;&amp;#xCD1D;&amp;#xB9AC;&amp;#xBE44;&amp;#xC11C;&amp;#xC2E4;, &amp;#xC778;&amp;#xC0AC;&amp;#xD601;&amp;#xC2E0;&amp;#xCC98;, &amp;#xC2DD;&amp;#xD488;&amp;#xC758;&amp;#xC57D;&amp;#xD488;&amp;#xC548;&amp;#xC804;&amp;#xCC98;, &amp;#xBB38;&amp;#xD654;&amp;#xCCB4;&amp;#xC721;&amp;#xAD00;&amp;#xAD11;&amp;#xBD80;, &amp;#xAD50;&amp;#xC721;&amp;#xBD80;, &amp;#xD658;&amp;#xACBD;&amp;#xBD80;, &amp;#xAD6D;&amp;#xD1A0;&amp;#xAD50;&amp;#xD1B5;&amp;#xBD80;, &amp;#xACE0;&amp;#xC6A9;&amp;#xB178;&amp;#xB3D9;&amp;#xBD80;, &amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;, &amp;#xD574;&amp;#xC591;&amp;#xC218;&amp;#xC0B0;&amp;#xBD80; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB514;&amp;#xB3C4;&amp;#xC2A4; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB300;&amp;#xC751;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xD558;&amp;#xC5EC; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xACFC; &amp;#xD611;&amp;#xB825;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#x1F914;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB110; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;(null security descriptor)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; null &amp;#xB610;&amp;#xB294; &amp;#xBE48; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD130;(&amp;#xD30C;&amp;#xC77C;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB4F1; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;)&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBE14;&amp;#xB799;&amp;#xBC14;&amp;#xC2A4;&amp;#xD0C0;(Black Basta)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;2022&amp;#xB144; 4&amp;#xC6D4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xC885; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C; &amp;#xD53C;&amp;#xD574; &amp;#xD0C0;&amp;#xAE43; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB2A5;&amp;#xB825;&amp;#xACFC; &amp;#xD611;&amp;#xC0C1; &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C;&amp;#xB85C; &amp;#xAE09;&amp;#xBD80;&amp;#xC0C1;&amp;#xD55C; &amp;#xADF8;&amp;#xB8F9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xCE75;&amp;#xBD07;(Qakbot)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE08;&amp;#xC735; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE58;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xC545;&amp;#xC131; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD07;&amp;#xB137;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8;(DarkGate)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;, &amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xCD5C;&amp;#xADFC; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC758; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC545;&amp;#xC6A9;&amp;#xD568;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.yna.co.kr/view/AKR20240617160200001&#34;&gt;&amp;#xC120;&amp;#xAD00;&amp;#xC704;, &amp;#xBCF4;&amp;#xC548;&amp;#xC810;&amp;#xAC80;&amp;#xC11C; &amp;#xC9C1;&amp;#xC6D0; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C;&amp;#x2026;&amp;#x201D;&amp;#xC678;&amp;#xC8FC; &amp;#xC9C1;&amp;#xC6D0; &amp;#xC2E4;&amp;#xC218;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.busan.com/view/busan/view.php?code=2024061716524399705&#34;&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xBC95; &amp;#xC2DC;&amp;#xD589; &amp;#xCF54;&amp;#xC55E;&amp;#xC778;&amp;#xB370;&amp;#x2026;&amp;#xBCF4;&amp;#xC548;&amp;#xB7;&amp;#xB0B4;&amp;#xBD80;&amp;#xD1B5;&amp;#xC81C; &amp;#xC544;&amp;#xC9C1; &amp;#x2018;&amp;#xBBF8;&amp;#xD761;&amp;#x2019;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.ddaily.co.kr/page/view/2024061610443973019&#34;&gt;&amp;#xBA85;&amp;#xD488;&amp;#xC2DC;&amp;#xACC4; &amp;#x2018;&amp;#xD0DC;&amp;#xADF8;&amp;#xD638;&amp;#xC774;&amp;#xC5B4;&amp;#x2019; &amp;#x97D3; &amp;#xACE0;&amp;#xAC1D;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#x2026;&amp;#xACFC;&amp;#xC9D5;&amp;#xAE08; 1&amp;#xC5B5;2600&amp;#xB9CC;&amp;#xC6D0;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.etnews.com/20240617000165&#34;&gt;&amp;#xAC1C;&amp;#xC815;&amp;#xC704; &amp;#x201C;&amp;#xC27D;&amp;#xAC8C; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C;&amp;#x201D; vs &amp;#xCE74;&amp;#xCE74;&amp;#xC624; &amp;#x201C;&amp;#xD574;&amp;#xCEE4; &amp;#xD0D3;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.hankyung.com/article/2024061849591&#34;&gt;&amp;#xC218;&amp;#xC775;&amp;#xB960; 120%&amp;#x201D;&amp;#x2026;&amp;#x2019;&amp;#xC2A4;&amp;#xD338;&amp;#xBB38;&amp;#xC790;&amp;#x2019; &amp;#xC720;&amp;#xB3C5; &amp;#xB9CE;&amp;#xC774; &amp;#xC624;&amp;#xB294; &amp;#xC774;&amp;#xC720; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.codeground.org/&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~ 2408.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://www.itdaily.kr/news/articleView.html?idxno=223547&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.08.31&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/NewsletterBanner.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/06/24/romi0x/newsletter0624/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] ì˜¤ëŠ˜ë„ íƒˆíƒˆ í„¸ë¦¬ëŠ”..ðŸ‡°ðŸ‡· - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-06-24 17:00" pubdate>
      2024ë…„ 6ì›” 24ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.3k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      45
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] ì˜¤ëŠ˜ë„ íƒˆíƒˆ í„¸ë¦¬ëŠ”..ðŸ‡°ðŸ‡·</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC5EC;&#xB984;&#xB9DE;&#xC774; &#xBCF4;&#xC548; &#xBE44;&#xC0C1;! &#x1F31E;&#x1F349;</p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! romi0x&#xC785;&#xB2C8;&#xB2E4; &#x1F600;</p>
<p>&#xC774;&#xC81C; &#xC5EC;&#xB984;&#xC774; &#xCF54;&#xC55E;&#xC73C;&#xB85C; &#xB2E4;&#xAC00;&#xC628; &#xAC83;&#xB9CC; &#xAC19;&#xC740; &#xB0A0;&#xC528;&#xC785;&#xB2C8;&#xB2E4;&#x1F60E;</p>
<p>&#xC774;&#xB7F0; &#xB0A0; &#xC2DC;&#xC6D0;&#xD55C; &#xC218;&#xBC15;&#x1F349;&#x1F349;&#xACFC; &#xD574;&#xD0B9;&#xC9F9;&#xC9F9;&#x1F423;&#x1F423; &#xC5B4;&#xB5A0;&#xC138;&#xC694;~~?</p>
<p>&#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC758; &#xC708;&#xB3C4;&#xC6B0; &#xC81C;&#xB85C;&#xB370;&#xC774; &#xCDE8;&#xC57D;&#xC810; &#xC545;&#xC6A9; &#xC0AC;&#xB840;, QR&#xCF54;&#xB4DC; &#xD050;&#xC2F1; &#xC0AC;&#xAE30;, &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C;, &#xB514;&#xB3C4;&#xC2A4; &#xACF5;&#xACA9;&#xAE4C;&#xC9C0;!</p>
<p>&#xCDA9;&#xACA9;&#xC801;&#xC778; &#xC0AC;&#xC774;&#xBC84; &#xC704;&#xD611; &#xC18C;&#xC2DD;! &#xB193;&#xCE58;&#xBA74; &#xD070;&#xC77C; &#xB0A9;&#xB2C8;&#xB2E4;!&#x1F525;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;, CVE-2024-26169 Windows OS&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810;</strong></p>
</blockquote>
<p>2024.06.17 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130624&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/06/24/romi0x/newsletter0624/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xCD5C;&#xADFC;&#xC5D0; &#xBC1C;&#xD45C;&#xB41C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://symantec-enterprise-blogs.security.com/threat-intelligence/black-basta-ransomware-zero-day">&#xC2DC;&#xB9CC;&#xD14D; &#xBCF4;&#xACE0;&#xC11C;</a>&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0;&#xC640; &#xC5F0;&#xACB0;&#xB41C; &#xACF5;&#xACA9;&#xC790;&#xB4E4;&#xC774; &#xCD5C;&#xC2E0; Windows &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB85C; &#xC545;&#xC6A9;&#xD55C; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xC5B4; &#xD654;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. <strong>&#xC774; &#xCDE8;&#xC57D;&#xC810;(CVE-2024-26169)&#xC740; Windows &#xC624;&#xB958; &#xBCF4;&#xACE0; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD574;&#xB2F9; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xAD8C;&#xD55C;&#xC744; &#xC0C1;&#xC2B9;&#x1F199;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD3EC;&#xD568;</strong>&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;.</p>
<p>Microsoft&#xC740; 2024&#xB144; 3&#xC6D4; 12&#xC77C; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xD328;&#xCE58;&#xB97C; &#xBC30;&#xD3EC;&#xD588;&#xC73C;&#xBA70;, &#xB2F9;&#xC2DC; <strong>&#xC678;&#xBD80;&#xC5D0;&#xC11C;&#xC758; &#xC2E4;&#xC81C; &#xC545;&#xC6A9; &#xC0AC;&#xB840;&#xB294; &#xBC1C;&#xACAC;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;</strong>&#xACE0; &#xBC1D;&#xD614;&#xC5B4;&#xC694;. </p>
<p>&#xADF8;&#xB7EC;&#xB098;!! Symantec&#xC758; &#xC870;&#xC0AC; &#xACB0;&#xACFC;, &#xCD5C;&#xADFC; &#xACF5;&#xACA9;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xB3C4;&#xAD6C;&#xB294; &#xD328;&#xCE58; &#xC774;&#xC804;&#xC5D0; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5B4;, &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xACF5;&#xAC1C;&#xB418;&#xAE30; &#xC804;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD574;&#xC11C; &#xACF5;&#xACA9;&#xC744; &#xC2DC;&#xB3C4;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4; &#x1F635;&#x200D;&#x1F4AB;</p>
<p>&#xC2DC;&#xB9CC;&#xD14D;&#xC740; &#xCD5C;&#xADFC; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xACF5;&#xACA9; &#xC2DC;&#xB3C4; &#xC0AC;&#xAC74;&#xC744; &#xC870;&#xC0AC;&#xD558;&#xBA74;&#xC11C; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0;</a>&#xC640; &#xC720;&#xC0AC;&#xD55C; &#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB4E4;&#xC740; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xB3C4;&#xAD6C;&#xB97C; &#xD65C;&#xC6A9;&#xD588;&#xACE0;, werkernel.sys &#xD30C;&#xC77C;&#xC758; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB110; &#xBCF4;&#xC548; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;</a> &#xD2B9;&#xC131;&#xC744; &#xC545;&#xC6A9;&#xD574; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC744; &#xD68D;&#xB4DD;&#xD558;&#xB824; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0;&#xB294; 2022&#xB144; 4&#xC6D4; &#xCC98;&#xC74C; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC2DC;&#xB9CC;&#xD14D;&#xC740; &#xCE74;&#xB514;&#xB110;&#xC774;&#xB77C;&#xB294; &#xACF5;&#xACA9; &#xB2E8;&#xCCB4;&#xAC00; &#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0;&#xB77C;&#xB294; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xC124;&#xBA85;&#xD588;&#xC5B4;&#xC694;. &#xC774; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xCE75;&#xBD07;(Qakbot) &#xBD07;&#xB137;</a>&#xACFC; &#xAE4A;&#xC740; &#xC5F0;&#xAD00;&#xC774; &#xC788;&#xC73C;&#xBA70;, &#xCE75;&#xBD07;&#xC774; &#xD3D0;&#xC1C4;&#xB418;&#xC790; &#xC7A0;&#xC2DC; &#xD65C;&#xB3D9;&#xC774; &#xC904;&#xC5B4;&#xB4E4;&#xC5C8;&#xC73C;&#xB098;, <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB2E4;&#xD06C;&#xAC8C;&#xC774;&#xD2B8;(DarkGate)</a>&#xB85C;&#xB354;&#xC640; &#xC190;&#xC7A1;&#xACE0; &#xB2E4;&#xC2DC; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3; <strong>&#x2018;&#xD050;&#xC2F1;&#x2019; &#xC8FC;&#xC758;&#xBCF4;&#x2026;&#xACF5;&#xC720;&#xC790;&#xC804;&#xAC70; QR &#xCC0D;&#xC5C8;&#xB2E4;&#xAC00; &#xD1B5;&#xC7A5; &#xD138;&#xB824;</strong></p>
</blockquote>
<p>2024.06.17 | &#xB9E4;&#xC77C;&#xACBD;&#xC81C; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.mk.co.kr/amp/11043900">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/06/24/romi0x/newsletter0624/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xCD5C;&#xADFC;&#xC5D0;&#xB294; QR&#xCF54;&#xB4DC;&#x1F50D;&#xB97C; &#xC545;&#xC6A9;&#xD55C; &#xC2E0;&#xC885; &#xC0AC;&#xC774;&#xBC84; &#xAE08;&#xC735;&#xC0AC;&#xAE30;&#x1F4B0;&#xC778; &#x2018;&#xD050;&#xC2F1;(Qshing)&#x2019; &#xC0AC;&#xB840;&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD050;&#xC2F1;&#xC740; QR&#xCF54;&#xB4DC;&#xC640; &#xD53C;&#xC2F1;(Phishing)&#xC744; &#xACB0;&#xD569;&#xD55C; &#xC6A9;&#xC5B4;&#xB85C;, <strong>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; QR&#xCF54;&#xB4DC;&#xB97C; &#xC2A4;&#xCE94;&#xD558;&#xBA74; &#xC545;&#xC131; &#xC571;&#xC744; &#xC124;&#xCE58;&#xD558;&#xB3C4;&#xB85D; &#xC720;&#xB3C4;&#xD558;&#xB294; &#xC0AC;&#xAE30; &#xC218;&#xBC95;</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>QR&#xCF54;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xACF5;&#xACA9;&#xC740; &#xB2E4;&#xC591;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC804;&#xB3D9;&#xD0A5;&#xBCF4;&#xB4DC;&#xB098; &#xACE0;&#xAC1D; &#xC0AC;&#xC740;&#xD488; &#xC774;&#xBCA4;&#xD2B8;&#xC640; &#xAC19;&#xC740; &#xC704;&#xC7A5;&#xB41C; QR&#xCF54;&#xB4DC;&#xB97C; &#xC81C;&#xC791;&#xD558;&#xC5EC; &#xC720;&#xC778;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC8FC;&#xCC28;&#xB41C; &#xCC28;&#xB7C9;&#xC5D0; &#xBD80;&#xCC29;&#xB41C; &#xAC00;&#xC9DC; &#x2018;&#xBD88;&#xBC95; &#xC8FC;&#xCC28; &#xACBD;&#xACE0;&#xC7A5;&#x2019;&#xC744; &#xD1B5;&#xD574; QR&#xCF54;&#xB4DC;&#xB97C; &#xC2A4;&#xCE94;&#xD558;&#xB3C4;&#xB85D; &#xC720;&#xB3C4;&#xD558;&#xC5EC; &#xAC1C;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD050;&#xC2F1;&#xC758; &#xD2B9;&#xC9D5;&#xC740; <strong>QR&#xCF54;&#xB4DC;&#xB97C; &#xC2A4;&#xCE94;&#xD558;&#xAE30; &#xC804;&#xAE4C;&#xC9C0; &#xADF8; &#xC2E0;&#xB8B0;&#xC131;&#xC744; &#xD310;&#xB2E8;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB2E4;</strong>&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.&#x1F4F1; &#xC774;&#xB85C; &#xC778;&#xD574; &#xC0AC;&#xAE30;&#xB97C; &#xAC10;&#xC9C0;&#xD558;&#xAE30;&#xAC00; &#xB354;&#xC6B1; &#xC5B4;&#xB824;&#xC6B4; &#xC0C1;&#xD669;&#xC785;&#xB2C8;&#xB2E4;. &#xC911;&#xAD6D;&#xC5D0;&#xC11C;&#xB294; &#xC815;&#xBD80;&#xB97C; &#xC0AC;&#xCE6D;&#xD55C; &#xBA54;&#xC77C;&#xC744; &#xD1B5;&#xD574; QR&#xCF54;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xAC1C;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xB824;&#xB294; &#xC0AC;&#xB840;&#xB3C4; &#xBC1C;&#xC0DD;&#xD588;&#xC5B4;&#xC694; &#x1F631;</p>
<p>&#xC0AC;&#xC6A9;&#xC790;&#xB294; QR&#xCF54;&#xB4DC;&#xB97C; &#xC2A4;&#xCE94;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xCD9C;&#xCC98;&#xB97C; &#xD655;&#xC2E4;&#xD788; &#xD655;&#xC778;&#xD558;&#xACE0;, &#xC54C;&#xB824;&#xC9C4; &#xC571; &#xC2A4;&#xD1A0;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xC548;&#xC804;&#xD55C; &#xC571;&#xB9CC; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC8FC;&#xC758;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xACF5;&#xACF5;&#xC7A5;&#xC18C;&#xB098; &#xAE30;&#xC5C5;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; QR&#xCF54;&#xB4DC;&#xB3C4; &#xAC00;&#xB2A5;&#xD55C; &#xC8FC;&#xC758;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3; <strong>&#xC804;&#xAD6D; &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C; &#xD53C;&#xD574;, &#xC62C;&#xD574;&#xB9CC; 50&#xACF3;&#xC73C;&#xB85C; &#x2018;&#xC5ED;&#xB300; &#xCD5C;&#xB2E4;&#x2019; &#xCC0D;&#xC5B4;&#x201D;</strong></p>
</blockquote>
<p>2024.06.20 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130758&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/06/24/romi0x/newsletter0624/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC62C;&#xD574;&#xB9CC; &#xBC8C;&#xC368; 50&#xACF3;&#xC758; &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C; &#xC0AC;&#xACE0;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xAC70; &#xC54C;&#xACE0; &#xACC4;&#xC2E0;&#xAC00;&#xC694;?!</p>
<p>&#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xC704;&#xC6D0;&#xD68C; &#xC790;&#xB8CC;&#xC5D0; &#xB530;&#xB974;&#xBA74; <strong>2024&#xB144; 1&#xC6D4;&#xBD80;&#xD130; 5&#xC6D4;&#xAE4C;&#xC9C0;&#xB9CC; 50&#xACF3;&#xC758; &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xC774; &#xC2E0;&#xACE0;</strong>&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD55C; &#xB2EC; &#xD3C9;&#xADE0; &#xC57D; 10&#xACF3;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xAC83;&#xC73C;&#xB85C;, &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC758; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xBCF4;&#xD638; &#xC0C1;&#xD669;&#xC774; &#xC2EC;&#xAC01;&#xD568;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. 2019&#xB144; 8&#xACF3;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD574; 2023&#xB144;&#xC5D0;&#xB294; 41&#xACF3;&#xC73C;&#xB85C; &#xC99D;&#xAC00;&#xD55C; &#xB4A4;, &#xC62C;&#xD574;&#xB294; &#xC774;&#xBBF8; &#xC808;&#xBC18;&#xC744; &#xB118;&#xC5B4; &#xC5ED;&#xB300; &#xCD5C;&#xACE0;&#xCE58;&#xB97C; &#xAE30;&#xB85D;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.&#x1F926;&#x200D;&#x2642;&#xFE0F;</p>
<p>&#xD2B9;&#xD788; <a href="https://hackyboiz.github.io/2024/05/13/romi0x/newsletter0513/#-3">&#xC9C0;&#xB09C; &#xB274;&#xC2A4;&#xB808;&#xD130;</a>&#xC5D0;&#xB3C4; &#xC18C;&#xAC1C;&#xB418;&#xC5C8;&#xB358;  2024&#xB144; 4&#xC6D4;, &#xD589;&#xC548;&#xBD80;&#xC758; &#x2018;&#xC815;&#xBD80;24&#x2019; &#xC2DC;&#xC2A4;&#xD15C; &#xC624;&#xB958;&#xB85C; &#xC778;&#xD574; 1,200&#xAC74; &#xB118;&#xB294; &#xBBFC;&#xC6D0;&#xC11C;&#xB958;&#xAC00; &#xD0C0;&#xC778;&#xC5D0;&#xAC8C; &#xBC1C;&#xAE09;&#xB418;&#xBA70; &#xC774;&#xB984;, &#xC8FC;&#xC18C;, &#xC8FC;&#xBBFC;&#xB4F1;&#xB85D;&#xBC88;&#xD638; &#xB4F1;&#xC774; &#xC720;&#xCD9C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; <a href="https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/#%EC%9D%B4%EB%B2%88-%EC%A3%BC-%EC%A7%B9%EC%A7%B9-PICK%F0%9F%90%A5">&#xC9C0;&#xB09C; &#xB274;&#xC2A4;&#xB808;&#xD130;</a>&#xC5D0;&#xC11C;&#xB3C4; &#xC18C;&#xAC1C;&#xB418;&#xC5C8;&#xB358; &#xBD81;&#xD55C;&#xC758; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC778;&#xD55C; &#xBC95;&#xC6D0; &#xD574;&#xD0B9;&#xC73C;&#xB85C; 1,014GB &#xBD84;&#xB7C9;&#xC758; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xC720;&#xCD9C;&#xB41C; &#xC0AC;&#xAC74;&#xC5D0; &#xB300;&#xD55C; &#xC870;&#xC0AC;&#xB3C4; &#xC9C4;&#xD589; &#xC911;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC5D0;&#xC11C;&#xC758; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C; &#xC0AC;&#xAC74;&#xC740; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xC5D0; &#xB300;&#xD55C; &#xB2F9;&#xAD6D;&#xC758; &#xC81C;&#xC7AC;&#xAC00; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xC9C0; &#xC54A;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xBE44;&#xD310;&#xC774; &#xB098;&#xC624;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.&#x1F4E2;</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; <strong>&#xC62C;&#xD574;&#xB9CC; &#xBC8C;&#xC368; 50&#xACF3;&#xC758; &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C; &#xC0AC;&#xACE0;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xAC70; &#xC54C;&#xACE0; &#xACC4;&#xC2E0;&#xAC00;&#xC694;?!</strong></p>
</blockquote>
<p>2024.06.18 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130643&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/06/24/romi0x/newsletter0624/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xB514;&#xB3C4;&#xC2A4; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xC815;&#xBD80; &#xAE30;&#xAD00; &#xBC0F; &#xAE30;&#xC5C5; &#xB4F1; 22&#xAC1C; &#xC0AC;&#xC774;&#xD2B8;&#xAC00; &#xACF5;&#xACA9;&#xB2F9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.&#x1F3AF;</p>
<p>&#xC774; &#xACF5;&#xACA9;&#xC740; &#xB7EC;&#xC2DC;&#xC544; &#xD574;&#xCEE4; &#xADF8;&#xB8F9;&#xC774; &#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xD55C;&#xAD6D;&#xC758; &#xD589;&#xB3D9;&#xC5D0; &#xBD88;&#xB9CC;&#xC744; &#xD488;&#xC5B4; &#xAC10;&#xD589;&#xD588;&#xB2E4;&#xACE0; &#xC8FC;&#xC7A5;&#xD558;&#xACE0; &#xC788;&#xB294;&#xB370;&#xC694;. <strong>&#xACF5;&#xACA9;&#xC740; 12&#xC77C;&#xC5D0; 7&#xAC1C; &#xC0AC;&#xC774;&#xD2B8;, 13&#xC77C;&#xC5D0; 3&#xAC1C; &#xC0AC;&#xC774;&#xD2B8;, 15&#xC77C;&#xC5D0; 2&#xAC1C; &#xC0AC;&#xC774;&#xD2B8;, &#xADF8;&#xB9AC;&#xACE0; 17&#xC77C;&#xC5D0; 10&#xAC1C; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></p>
<p>&#xACF5;&#xACA9;&#xC744; &#xBC1B;&#xC740; &#xC8FC;&#xC694; &#xC0AC;&#xC774;&#xD2B8;&#xB85C;&#xB294; &#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xB300;&#xD1B5;&#xB839;&#xC2E4;, &#xC778;&#xCC9C;&#xAD6D;&#xC81C;&#xACF5;&#xD56D;, &#xC2E0;&#xD55C;&#xAE08;&#xC735;&#xC9C0;&#xC8FC;&#xD68C;&#xC0AC;, &#xD55C;&#xAD6D;&#xC218;&#xCD9C;&#xC785;&#xC740;&#xD589;, &#xAD00;&#xC138;&#xCCAD;, &#xACBD;&#xCC30;&#xCCAD;, &#xAD6D;&#xC138;&#xCCAD;, &#xC6B0;&#xC815;&#xC0AC;&#xC5C5;&#xBCF8;&#xBD80;, &#xC11C;&#xC6B8;&#xD2B9;&#xBCC4;&#xC2DC;, &#xC81C;&#xC8FC;&#xB300;&#xD559;&#xAD50;, &#xC0B0;&#xC5C5;&#xD1B5;&#xC0C1;&#xC790;&#xC6D0;&#xBD80;, &#xC678;&#xAD50;&#xBD80;, &#xAD6D;&#xBB34;&#xC870;&#xC815;&#xC2E4;&#xAD6D;&#xBB34;&#xCD1D;&#xB9AC;&#xBE44;&#xC11C;&#xC2E4;, &#xC778;&#xC0AC;&#xD601;&#xC2E0;&#xCC98;, &#xC2DD;&#xD488;&#xC758;&#xC57D;&#xD488;&#xC548;&#xC804;&#xCC98;, &#xBB38;&#xD654;&#xCCB4;&#xC721;&#xAD00;&#xAD11;&#xBD80;, &#xAD50;&#xC721;&#xBD80;, &#xD658;&#xACBD;&#xBD80;, &#xAD6D;&#xD1A0;&#xAD50;&#xD1B5;&#xBD80;, &#xACE0;&#xC6A9;&#xB178;&#xB3D9;&#xBD80;, &#xACFC;&#xD559;&#xAE30;&#xC220;&#xC815;&#xBCF4;&#xD1B5;&#xC2E0;&#xBD80;, &#xD574;&#xC591;&#xC218;&#xC0B0;&#xBD80; &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC;&#xB294; &#xBAA8;&#xB4E0; &#xC0AC;&#xC774;&#xD2B8;&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC6B4;&#xC601;&#xB418;&#xACE0; &#xC788;&#xC9C0;&#xB9CC;, &#xB514;&#xB3C4;&#xC2A4; &#xACF5;&#xACA9;&#xC5D0; &#xB300;&#xD55C; &#xB300;&#xC751;&#xACFC; &#xAD00;&#xB828;&#xD558;&#xC5EC; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xACFC; &#xD611;&#xB825;&#xC774; &#xD544;&#xC694;&#xD558;&#xACA0;&#xB124;&#xC694;. &#x1F914;</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>&#xB110; &#xBCF4;&#xC548; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;(null security descriptor)</strong></p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; null &#xB610;&#xB294; &#xBE48; &#xC0C1;&#xD0DC;&#xB85C; &#xC124;&#xC815;&#xB41C; &#xBCF4;&#xC548; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;(&#xD30C;&#xC77C;, &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;, &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB4F1; &#xAC1D;&#xCCB4;&#xC758; &#xBCF4;&#xC548; &#xC18D;&#xC131;&#xC744; &#xC815;&#xC758;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;)</p>
<p><strong>&#xBE14;&#xB799;&#xBC14;&#xC2A4;&#xD0C0;(Black Basta)</strong></p>
<p>2022&#xB144; 4&#xC6D4;&#xC5D0; &#xBC1C;&#xACAC;&#xB41C; &#xC0C8;&#xB85C;&#xC6B4; &#xBCC0;&#xC885; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB85C; &#xD53C;&#xD574; &#xD0C0;&#xAE43; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xC218;&#xC9D1;&#xD560; &#xC218; &#xC788;&#xB294; &#xB2A5;&#xB825;&#xACFC; &#xD611;&#xC0C1; &#xC2A4;&#xD0C0;&#xC77C;&#xB85C; &#xAE09;&#xBD80;&#xC0C1;&#xD55C; &#xADF8;&#xB8F9;</p>
<p><strong>&#xCE75;&#xBD07;(Qakbot)</strong></p>
<p>&#xAE08;&#xC735; &#xC815;&#xBCF4;&#xB97C; &#xD6D4;&#xCE58;&#xACE0; &#xB2E4;&#xB978; &#xC545;&#xC131; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xBC30;&#xD3EC;&#xD558;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD07;&#xB137;</p>
<p><strong>&#xB2E4;&#xD06C;&#xAC8C;&#xC774;&#xD2B8;(DarkGate)</strong></p>
<p>&#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; &#xC545;&#xC131; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;, &#xC774; &#xACF5;&#xACA9;&#xC740; &#xCD5C;&#xADFC; &#xD328;&#xCE58;&#xB41C; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xC758; &#xC81C;&#xB85C;&#xB370;&#xC774; &#xACF5;&#xACA9; &#xACB0;&#xD568;&#xC744; &#xAD50;&#xBB18;&#xD558;&#xAC8C; &#xC545;&#xC6A9;&#xD568;</p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.yna.co.kr/view/AKR20240617160200001">&#xC120;&#xAD00;&#xC704;, &#xBCF4;&#xC548;&#xC810;&#xAC80;&#xC11C; &#xC9C1;&#xC6D0; &#xC815;&#xBCF4;&#xC720;&#xCD9C;&#x2026;&#x201D;&#xC678;&#xC8FC; &#xC9C1;&#xC6D0; &#xC2E4;&#xC218;&#x201D;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.busan.com/view/busan/view.php?code=2024061716524399705">&#xAC00;&#xC0C1;&#xC790;&#xC0B0;&#xBC95; &#xC2DC;&#xD589; &#xCF54;&#xC55E;&#xC778;&#xB370;&#x2026;&#xBCF4;&#xC548;&#xB7;&#xB0B4;&#xBD80;&#xD1B5;&#xC81C; &#xC544;&#xC9C1; &#x2018;&#xBBF8;&#xD761;&#x2019;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.ddaily.co.kr/page/view/2024061610443973019">&#xBA85;&#xD488;&#xC2DC;&#xACC4; &#x2018;&#xD0DC;&#xADF8;&#xD638;&#xC774;&#xC5B4;&#x2019; &#x97D3; &#xACE0;&#xAC1D;&#xC815;&#xBCF4; &#xC720;&#xCD9C;&#x2026;&#xACFC;&#xC9D5;&#xAE08; 1&#xC5B5;2600&#xB9CC;&#xC6D0;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.etnews.com/20240617000165">&#xAC1C;&#xC815;&#xC704; &#x201C;&#xC27D;&#xAC8C; &#xC815;&#xBCF4;&#xC720;&#xCD9C;&#x201D; vs &#xCE74;&#xCE74;&#xC624; &#x201C;&#xD574;&#xCEE4; &#xD0D3;&#x201D;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.hankyung.com/article/2024061849591">&#xC218;&#xC775;&#xB960; 120%&#x201D;&#x2026;&#x2019;&#xC2A4;&#xD338;&#xBB38;&#xC790;&#x2019; &#xC720;&#xB3C5; &#xB9CE;&#xC774; &#xC624;&#xB294; &#xC774;&#xC720; &#xC788;&#xC5C8;&#xB2E4;</a></li>
</ul>
<h2 id="6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;"><a href="#6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;" class="headerlink" title="6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#x1F425;"></a><strong>6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</strong> &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/">AI &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB7A9;</a> | &#xCF54;&#xB4DC;&#xAC8C;&#xC774;&#xD2B8; | ~ 2024.06.30 &#xC811;&#xC218;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.codeground.org/">&#xC81C;10&#xD68C; &#xB300;&#xD559;&#xC0DD; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xC0BC;&#xC131;&#xC804;&#xC790; | ~ 24.07.04</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cryptocontest.kr/challenge/">&#xC554;&#xD638;&#xBD84;&#xC11D;&#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xD55C;&#xAD6D;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xD559;&#xD68C; | ~ 2408.31</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.itdaily.kr/news/articleView.html?idxno=223547">&#xAE08;&#xC735;&#xAD8C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xC2E0;&#xACE0;&#xD3EC;&#xC0C1;&#xC81C; (&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;)</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~ 24.08.31</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                  <a class="hover-with-bg" href="/tags/romi0x/">romi0x</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_romi0x.jpg" srcset="/img/loading.gif" alt="romi0x">
                  </div>

                  <div class="link-text">
                    <div class="link-title">romi0x</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/romi0x">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/06/26/ogu123/cve-2024-4323/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-4323: Fluent Bitì˜ Memory Corruptionìœ¼ë¡œ ì¸í•œ DoS ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/06/22/pwndorei/2024-06-22/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-37273 : Janì˜ ìž„ì˜ íŒŒì¼ ì—…ë¡œë“œ ì·¨ì•½ì </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/06/24/romi0x/newsletter0624/';
        this.page.identifier = '/2024/06/24/romi0x/newsletter0624/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] ì˜¤ëŠ˜ë„ íƒˆíƒˆ í„¸ë¦¬ëŠ”..ðŸ‡°ðŸ‡·&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
