

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Intro&#34;&gt;&lt;a href=&#34;#Intro&#34; class=&#34;headerlink&#34; title=&#34;Intro&#34;&gt;&lt;/a&gt;Intro&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; tobe &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. poosic&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC774; &amp;#xB625;&amp;#xC2F8;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC; &amp;#xAC19;&amp;#xB2E4;&amp;#xB294; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &amp;#xCDA9;&amp;#xACA9;&amp;#xC5D0; tobe&amp;#xB85C; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xB798; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC774; &amp;#xC6C3;&amp;#xC74C;&amp;#xC18C;&amp;#xB9AC; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC544;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC5ED;&amp;#xC2DC; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;&amp;#x3160;&amp;#x3160;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; tobe&amp;#xB77C;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xC5BB;&amp;#xAC8C;&amp;#xB418;&amp;#xC5B4; &amp;#xC88B;&amp;#xC740; &amp;#xAE30;&amp;#xD68C;&amp;#xC600;&amp;#xB358;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;gt;_-&lt;/p&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xB860;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC790;&amp;#xBA74;, &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; HALucinaotr &amp;#xB9AC;&amp;#xBDF0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! HALucinator&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC;, FirmAE&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC804;&amp;#xCCB4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB77C;&amp;#xBA74; HALucinator&amp;#xB294; RTOS&amp;#xB098; &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; dependency&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC911;&amp;#xC810;&amp;#xC744; &amp;#xB454; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#x2018;Emulator&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xC778;&amp;#xAC00;?!&amp;#x2019;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xD588;&amp;#xB358; &amp;#xAC74;&amp;#xB370; &amp;#xC2E4;&amp;#xC0C1;&amp;#xC740; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130; &amp;#xACE0;&amp;#xAE09; &amp;#xD65C;&amp;#xC6A9;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xC801;&amp;#xC796;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xBDF0;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xC2E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;(rehosting, HAL &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB4F1;..)&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBA3C;&amp;#xC800; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB97C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-About-Rehosting&#34;&gt;&lt;a href=&#34;#1-About-Rehosting&#34; class=&#34;headerlink&#34; title=&#34;1. About Rehosting&#34;&gt;&lt;/a&gt;1. About Rehosting&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/thumbnail.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Rehosting&amp;#xC740; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xB9AC;&amp;#xD574; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC2DD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; Emulating&amp;#xACFC; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB450; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xBAA9;&amp;#xD45C;&amp;#xD558;&amp;#xB294; &amp;#xBC14;&amp;#xB294; &amp;#xC870;&amp;#xAE08; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; SoC&amp;#xB098; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xACE0; &amp;#xD3EC;&amp;#xAD04;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, Rehosting&amp;#xC740; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xBCF5;&amp;#xC81C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E8;&amp;#xC77C;&amp;#xBCF4;&amp;#xB4DC;&amp;#xC758; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC598;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xB4E4;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC598;&amp;#xAE30;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;| &lt;a href=&#34;https://www.youtube.com/shorts/MRu8wNogkjk&#34;&gt;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBED8;&amp;#xC9D3;&amp;#xC5F0;&amp;#xAD6C;&amp;#xC18C; Youtube&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC7A5; &amp;#xC704; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC758; &amp;#xB9C8;&amp;#xC744;&amp;#xBC84;&amp;#xC2A4; &amp;#xC804;&amp;#xAD11;&amp;#xD310; &amp;#xB0B4;&amp;#xBD80;&amp;#xB9CC; &amp;#xBCF4;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xB77C;&amp;#xC988;&amp;#xBCA0;&amp;#xB9AC;&amp;#xD30C;&amp;#xC774;&amp;#xB098; &amp;#xACF5;&amp;#xC720;&amp;#xAE30; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xAE30;&amp;#xB4E4;&amp;#xC774; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;.(&lt;del&gt;&amp;#xC800;&amp;#xB3C4; &amp;#xB9C8;&amp;#xC744;&amp;#xBC84;&amp;#xC2A4; &amp;#xC804;&amp;#xAD11;&amp;#xD310;&amp;#xC744; &amp;#xBCFC; &amp;#xAE30;&amp;#xD68C;&amp;#xB294; &amp;#xC5C6;&amp;#xC5B4; &amp;#xB108;&amp;#xBB34; &amp;#xC2E0;&amp;#xAE30;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9;&amp;#xCC28;&amp;#xC758; &amp;#xAE34;&amp;#xAE09; &amp;#xC790;&amp;#xB3D9; &amp;#xC81C;&amp;#xB3D9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, AEB &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;, &amp;#xC7A5;&amp;#xC560;&amp;#xBB3C; &amp;#xC778;&amp;#xC2DD;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC804;&amp;#xBC29; &amp;#xC13C;&amp;#xC11C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xC720;&amp;#xC555;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xC561;&amp;#xCE04;&amp;#xC5D0;&amp;#xC774;&amp;#xD130;, &amp;#xB0B4;&amp;#xBD80; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; CAN &amp;#xBC84;&amp;#xC2A4;, &amp;#xB4F1;&amp;#xC758; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD560;&amp;#xD150;&amp;#xB370;&amp;#xC694;. AEB &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xAC04; &amp;#xBA54;&amp;#xC778; &amp;#xBCF4;&amp;#xB4DC;&amp;#xB9CC; &amp;#xB35C;&amp;#xB801; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? CAN &amp;#xBC84;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xCC28;&amp;#xB7C9; &amp;#xC18D;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC870;&amp;#xCC28; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xBA48;&amp;#xCDB0;&amp;#xBC84;&amp;#xB9AC;&amp;#xACE0;, CAN &amp;#xBC84;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C;&amp;#xB2E4; &amp;#xD574;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC904; &amp;#xC13C;&amp;#xC11C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xC790;&amp;#xB2C8; &amp;#xBD84;&amp;#xC11D;&amp;#xB3C4; &amp;#xC804;&amp;#xC5D0; &amp;#xC9C0;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xB824;&amp;#xB2E4;&amp;#xAC00;, &amp;#xC798;&amp;#xBABB;&amp;#xD558;&amp;#xBA74; &amp;#xBCF4;&amp;#xB4DC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBD88;&amp;#xC0C1;&amp;#xC0AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCE58; &amp;#xBC18;&amp;#xC2E0;&amp;#xC695; &amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC695;&amp;#xC870;&amp;#xC5D0; &amp;#xBB3C; &amp;#xAC00;&amp;#xB4DD; &amp;#xB2F4;&amp;#xACE0;, &amp;#xC785;&amp;#xC695;&amp;#xC81C; &amp;#xD480;&amp;#xACE0;, &amp;#xCD1B;&amp;#xBD88; &amp;#xCF1C;&amp;#xACE0;, &amp;#xC7A5;&amp;#xBBF8; &amp;#xAF43;&amp;#xC78E;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB744;&amp;#xC6E0;&amp;#xB294;&amp;#xB370;(&lt;del&gt;&amp;#xD3C9;&amp;#xC18C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC18;&amp;#xC2E0;&amp;#xC695;&amp;#xC744; &amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;) &amp;#xC138;&amp;#xC218;&amp;#xB9CC; &amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC774;&amp;#xB784;&amp;#xAE4C;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC720;&amp;#xD615;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC720;&amp;#xD615;&#34; class=&#34;headerlink&#34; title=&#34;1.1. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&#34;&gt;&lt;/a&gt;1.1. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Rehosting&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC778; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;I&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xD615;): Linux, Windows &amp;#xAC19;&amp;#xC740; &amp;#xBC94;&amp;#xC6A9; OS &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB2E8;&amp;#xC77C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;II&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(OS &amp;#xAE30;&amp;#xBC18;&amp;#xD615;): Linux, VxWorks &amp;#xB4F1; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xB41C; OS&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;III&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8;&amp;#xD615;): OS &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;. MCU&amp;#xAC00; &amp;#xD0D1;&amp;#xC7AC;&amp;#xB41C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC18C;&amp;#xD615; IoT, &amp;#xC790;&amp;#xB3D9;&amp;#xCC28; ECU, &amp;#xC0B0;&amp;#xC5C5;&amp;#xC6A9; &amp;#xC81C;&amp;#xC5B4; &amp;#xC7A5;&amp;#xBE44; &amp;#xB4F1;&amp;#xC774; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &lt;strong&gt;III&amp;#xD615;, &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&lt;/strong&gt;(Bare-metal) &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xBC1C;&amp;#xC804;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. I&amp;#xD615;, II&amp;#xD615;&amp;#xC740; OS&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, OS &amp;#xC5C6;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; III&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xADF9;&amp;#xB3C4;&amp;#xB85C; &amp;#xB192;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8;&amp;#xC740; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2018;&amp;#xB9E8;&amp;#xBAB8;&amp;#xC758; &amp;#xAE08;&amp;#xC18D;&amp;#x2019;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#xC758;&amp;#xC5ED;&amp;#xC744; &amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2018;&amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC704;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xAC78;&amp;#xCE58;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#x2019;&amp;#xB294; &amp;#xB73B; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. OS&amp;#xB77C;&amp;#xB294; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35; &amp;#xC5C6;&amp;#xC774; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; &amp;#xB0A0;&amp;#xAC83; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &lt;code&gt;&amp;#xC800;&amp;#xC7A5;&lt;/code&gt; &amp;#xBC84;&amp;#xD2BC;&amp;#xB9CC; &amp;#xB538;&amp;#xAE4D;&amp;#xD558;&amp;#xBA74; OS&amp;#xAC00; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC368;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774; &amp;#xC800;&amp;#xC7A5; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC758; 0x40011000&amp;#xBC88; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#x2018;&amp;#xC900;&amp;#xBE44;&amp;#x2019; &amp;#xC2E0;&amp;#xD638;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xACE0;, 0x40011004&amp;#xBC88; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC4F4; &amp;#xB2E4;&amp;#xC74C;, &amp;#xC0C1;&amp;#xD0DC; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; 1&amp;#xC774; &amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9B0;&amp;#xB2E4;&amp;#x2019; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &lt;strong&gt;MMIO(Memory-Mapped I/O)&lt;/strong&gt; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB9D0; &amp;#xC548;&amp;#xB4E3;&amp;#xB294; &amp;#xAE08;&amp;#xCABD;&amp;#xC774;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-Rehosting&amp;#xACFC;-Emulating&amp;#xC758;-&amp;#xCC28;&amp;#xC774;&#34;&gt;&lt;a href=&#34;#1-2-Rehosting&amp;#xACFC;-Emulating&amp;#xC758;-&amp;#xCC28;&amp;#xC774;&#34; class=&#34;headerlink&#34; title=&#34;1.2. Rehosting&amp;#xACFC; Emulating&amp;#xC758; &amp;#xCC28;&amp;#xC774;&#34;&gt;&lt;/a&gt;1.2. Rehosting&amp;#xACFC; Emulating&amp;#xC758; &amp;#xCC28;&amp;#xC774;&lt;/h3&gt;&lt;p&gt;Emulating&amp;#xC774; CPU&amp;#xC758; Instruction Set(&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC9D1;&amp;#xD569;)&amp;#xC744; &amp;#xAC00;&amp;#xC0C1; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, Rehosting&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xC7AC;&amp;#xD604;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &lt;strong&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xD750;&amp;#xB984;(Flow)&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#x2018;&amp;#xCC28;&amp;#xC774;&amp;#x2019;&amp;#xB77C;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, Rehosting&amp;#xC740; Emulating&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB098;&amp;#xC628; &amp;#xBCF4;&amp;#xC644; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE5D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xCA0C;&amp;#xB4E0; Rehosting&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xADF8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;(Instruction)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC73C;&amp;#xB85C; Emulating &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xC989;, &lt;strong&gt;&amp;#xAE30;&amp;#xBC18; &amp;#xAE30;&amp;#xC220;&amp;#xC740; Emulating&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-3-&amp;#xB2E4;&amp;#xC591;&amp;#xD55C;-Rehosting-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#1-3-&amp;#xB2E4;&amp;#xC591;&amp;#xD55C;-Rehosting-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;1.3. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;1.3. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&lt;/h3&gt;&lt;p&gt;Rehosting&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; Crash &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xB098;&amp;#xAC00;&amp;#xB294; &amp;#xC624;&amp;#xB958; &amp;#xAE30;&amp;#xBC18; &amp;#xCD94;&amp;#xB860; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xC788;&amp;#xC5B4; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; nop&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; flag&amp;#xAC12;&amp;#xC744; &amp;#xBB34;&amp;#xC870;&amp;#xAC74; True&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xB9CC;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xD569;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294;&lt;strong&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; Rehosting&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC18; &amp;#xBC29;&amp;#xBC95;&lt;/strong&gt;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xB978; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB192;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5; &amp;#xC2E4;&amp;#xD589;&amp;#xB960;&amp;#xACFC; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC758; &amp;#xCE74;&amp;#xD53C;&amp;#xC728;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560;&amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; Rehosting&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798;&amp;#xAC78;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xB354;&amp;#xC6B1; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC138;&amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC54C;&amp;#xAC8C;&amp;#xB41C; &lt;strong&gt;HAL &amp;#xACC4;&amp;#xCE35; &amp;#xD6C4;&amp;#xD0B9;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC;&amp;#xB294; &amp;#xBCA4;&amp;#xB354;&amp;#xC0AC;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; SDK&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xB9E4;&amp;#xC6B0; smart&amp;#xD55C; &amp;#xBC1C;&amp;#xC0C1;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD; &amp;#xB300;&amp;#xC2E0; &amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; HAL &amp;#xACC4;&amp;#xCE35;&amp;#xC774;&amp;#xB098; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-4-About-HAL-Hardware-Abstraction-Layer&#34;&gt;&lt;a href=&#34;#1-4-About-HAL-Hardware-Abstraction-Layer&#34; class=&#34;headerlink&#34; title=&#34;1.4. About HAL(Hardware Abstraction Layer)&#34;&gt;&lt;/a&gt;1.4. About HAL(Hardware Abstraction Layer)&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC804;&amp;#xC5D0; HAL&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. HAL&amp;#xC740; Hardware Abstraction Layer&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD574; &amp;#xC81C;&amp;#xC5B4;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; low level&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xB4E4;&amp;#xC744; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; high level&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; layer&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; asm coding&amp;#xC774; &amp;#xC544;&amp;#xB2CC; c coding&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HAL&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC0C1;&amp;#xC138;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; HAL &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xD560; &amp;#xC218;&amp;#xC788;&amp;#xB3C4;&amp;#xB85D; API&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xACFC; &amp;#xB2E4;&amp;#xC591;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC8FC;&amp;#xB294; &amp;#xACE0;&amp;#xB9C8;&amp;#xC6B4; &amp;#xC874;&amp;#xC7AC;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xCE69; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB77C;&amp;#xB3C4; &amp;#xCE69;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// 1. GPIOC &amp;#xD3EC;&amp;#xD2B8;&amp;#xC758; &amp;#xD074;&amp;#xB7ED;&amp;#xC744; &amp;#xCF1C;&amp;#xC900;&amp;#xB2E4;.&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40023830&lt;/span&gt; |= (&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// 2. PC13 &amp;#xD540;&amp;#xC744; &amp;#xCD9C;&amp;#xB825; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;.&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020800&lt;/span&gt; &amp;amp;= ~(&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;);
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020800&lt;/span&gt; |= (&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// 3. PC13 &amp;#xD540;&amp;#xC758; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC744; 0&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4; (LED ON)&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020814&lt;/span&gt; &amp;amp;= ~(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &lt;strong&gt;GPIO(General-Purpose Input/Output) &amp;#xD540;&lt;/strong&gt;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xC5EC; LED&amp;#xB97C; &amp;#xCF1C;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. HAL&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;&amp;#xBA74;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xCE69;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC2DC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xC2ED; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC529; &amp;#xB4A4;&amp;#xC838;&amp;#xAC00;&amp;#xBA70; &amp;#xC704;&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;(&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;)&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xAC12;&amp;#xC744; &amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9D0;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC774;&amp;#xB9C8;&amp;#xC800;&amp;#xB3C4; &amp;#xCE69;&amp;#xC774; &amp;#xBC14;&amp;#xB010;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC2DC;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA70; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xC8E0;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; HAL&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; API&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xC27D;&amp;#xACE0; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD55C;&amp;#xC904;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC791;&amp;#xC131; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB098; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. HAL &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xCE69;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xCC98;&amp;#xB9AC;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &lt;/p&gt;
&lt;h2 id=&#34;2-HALucinator&#34;&gt;&lt;a href=&#34;#2-HALucinator&#34; class=&#34;headerlink&#34; title=&#34;2. HALucinator&#34;&gt;&lt;/a&gt;2. HALucinator&lt;/h2&gt;&lt;p&gt;HALucinator&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; HAL(Harware Abstraction Layer) &amp;#xD6C4;&amp;#xD0B9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; Rehosting &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD658;&amp;#xAC01;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294; hallcination&amp;#xACFC; Rehosting&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC808;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB824;&amp;#xC11C; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC13C;&amp;#xC2A4;&amp;#xC5D0; &amp;#xAC10;&amp;#xD0C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;HALucinator&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB3C4;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Config File: HALucinator&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; YAML &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;QEMU Emulator: ARM, MIPS &amp;#xB4F1;&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCCD0;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC904; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;GDB: QEMU&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;BP Handler:HALucinator &amp;#xD6C4;&amp;#xD0B9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC778; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Config &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xC5B4;&amp;#xAD8C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Peripheral Models: &amp;#xAC00;&amp;#xC0C1; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Peripheral Server: &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC911;&amp;#xC778; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; UART &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xB0B4;&amp;#xBCF4;&amp;#xB0B4;&amp;#xAC70;&amp;#xB098;, &amp;#xC678;&amp;#xBD80; &amp;#xC13C;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC911;&amp;#xACC4;&amp;#xAE30; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;External Device: Peripheral Server&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCE69;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB9E1;&amp;#xAE30;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC798; &amp;#xC548; &amp;#xAC08; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB3D9;&amp;#xC791; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;Config File&lt;/code&gt;&amp;#xC5D0; &amp;#xB9AC;&amp;#xD638;&amp;#xC2A4;&amp;#xD305;&amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;, &amp;#xD6C4;&amp;#xD0B9;&amp;#xD560; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HALucinator&amp;#xB294; &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;QEMU Emulator&lt;/code&gt;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB300;&amp;#xC0C1; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74;, &lt;code&gt;BP Handler&lt;/code&gt;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44; &lt;code&gt;Peripheral Model&lt;/code&gt;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; Python &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;code&gt;Peripheral Server&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Peripheral Model&lt;/code&gt;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xD6C4;, &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &lt;code&gt;QEMU Emulator&lt;/code&gt; &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774; &lt;code&gt;BP Handler&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xCC29;&amp;#xAC01;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC815;&amp;#xC0C1; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; Handler code&amp;#xB97C; &amp;#xC2E0;&amp;#xACBD;&amp;#xC368;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB193;&amp;#xCE5C;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00; &amp;#xD558;&amp;#xB294; &amp;#xBD88;&amp;#xC0C1;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; MIMO &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; HAL &amp;#xD568;&amp;#xC218; &amp;#xD6C4;&amp;#xD0B9;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xAC00; &amp;#xC555;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC904;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC57D;&amp;#xAC04;&amp;#xC758;(?) &amp;#xB178;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xCEE4;&amp;#xBC84;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, HALucinator&amp;#xB294; &amp;#xC774; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC791;&amp;#xC131; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCEE4;&amp;#xBC84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xAC10;&amp;#xC774; &amp;#xC0DD;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Env-Setting&#34;&gt;&lt;a href=&#34;#2-1-Env-Setting&#34; class=&#34;headerlink&#34; title=&#34;2.1. Env Setting&#34;&gt;&lt;/a&gt;2.1. Env Setting&lt;/h3&gt;&lt;p&gt;&amp;#xD658;&amp;#xACBD;&amp;#xC138;&amp;#xD305;&amp;#xC740; WSL&amp;#xC758; Ubuntu &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. submodule&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; Avatar2&amp;#xC5D0;&amp;#xC11C; Ubuntu&amp;#xC5D0; &amp;#xB300;&amp;#xD55C;dependency&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; WSL&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; git &amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xAC04;&amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; git submodule&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xB3C4;&amp;#xCEE4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;git clone https://github.com/halucinator/halucinator.git
cd ./halucinator
git submodule update --init
docker build -t halucinator ./
docker run --name halucinator --rm -i -t halucinator bash&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;! HALucinator&amp;#xB97C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC8FC;&amp;#xC18C; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD130; &amp;#xD30C;&amp;#xC77C;(&amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD130; &amp;#xD568;&amp;#xC218; &amp;#xBC0F; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xB3D9;&amp;#xC5EC;&amp;#xBD80;&amp;#xB9CC; &amp;#xD655;&amp;#xC778; &amp;#xD558;&amp;#xB824;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB2C8;! &amp;#xBAA8;&amp;#xB4E0; &amp;#xC124;&amp;#xC815; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB9C8;&amp;#xCE58;&amp;#xACE0; &amp;#xAD6C;&amp;#xB3D9;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xD53C;&amp;#xACE4;&amp;#xD574;&amp;#xC9C8;&amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; HALucinator Repo&amp;#xC5D0; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; t&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0; &lt;code&gt;hal_dev_uart -i=1073811456&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD560; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xBD99;&amp;#xC77C; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; UART&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xB978; &amp;#xD130;&amp;#xBBF8;&amp;#xB110; &amp;#xCC3D;&amp;#xC744; &amp;#xB744;&amp;#xC6CC; &lt;code&gt;docker exec -it halucinator bash&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; build&amp;#xD55C; &amp;#xB3C4;&amp;#xCEE4;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &lt;code&gt;./test/STM32/example/run.sh&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xC608;&amp;#xC81C;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; MCU&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#in current terminal&lt;/span&gt;
hal_dev_uart -i=&lt;span class=&#34;hljs-number&#34;&gt;1073811456&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#in new terminal&lt;/span&gt;
docker &lt;span class=&#34;hljs-keyword&#34;&gt;exec&lt;/span&gt; -it halucinator bash
./test/STM32/example/run.sh&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; UART&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xB358; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0; &lt;code&gt;hackyboiz&lt;/code&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74;, &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xAE30;&amp;#xAE30;&amp;#xAC00; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC2E0;(rx_data)&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Outro&#34;&gt;&lt;a href=&#34;#Outro&#34; class=&#34;headerlink&#34; title=&#34;Outro&#34;&gt;&lt;/a&gt;Outro&lt;/h2&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! Rehosting&amp;#xBD80;&amp;#xD130; HALucinator&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC1C;&amp;#xC694;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. GDB&amp;#xB85C; &amp;#xC2E4;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAD6C;&amp;#xCD95;&amp;#xD55C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; AFL&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Fuzzing &amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;&amp;#xC744; &amp;#xC8FC;&amp;#xC800;&amp;#xB9AC;&amp;#xC8FC;&amp;#xC800;&amp;#xB9AC; &amp;#xC4F0;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAE00; &amp;#xBD84;&amp;#xB7C9;&amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;&amp;#xC640; &amp;#xC2E4;&amp;#xC81C; binary&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB294;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0; &amp;#xC788;&amp;#xB294; &amp;#xAE00;&amp;#xC774; &amp;#xB420;&amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; Part2&amp;#xC5D0;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! Part2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; STM32&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; HAL &amp;#xAC1C;&amp;#xBC1C;&amp;#xB3C4; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; HALucinator&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xACFC; gdb&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB2C8; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xB3C4; &amp;#xCC3E;&amp;#xC544;&amp;#xC640; &amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; HALucinator&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB610;&amp;#xD55C; Part2&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0AC;&amp;#xAE4C; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; HALucinator github&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://github.com/halucinator/halucinator/blob/master/doc/tutorial/2_run_uart_example.md&#34;&gt;tutorial&lt;/a&gt;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xD574;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAC8C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; Windows&amp;#xC5D0;&amp;#xC11C; docker build&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC368;&amp;#xC11C; &amp;#xC124;&amp;#xCE58; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9C9;&amp;#xD788;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xC5C6;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC774;&amp;#xC5C8;&amp;#xB2EC;&amp;#xAE4C;&amp;#xC694;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C;&amp;#xAE00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/halucinator/halucinator&#34;&gt;HALucinator github&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.usenix.org/conference/usenixsecurity20/presentation/clements&#34;&gt;Usenix-HALucinator: Firmware Re-hosting Through Abstraction Layer Emulation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Rehosting - Part 1(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Intro&#34;&gt;&lt;a href=&#34;#Intro&#34; class=&#34;headerlink&#34; title=&#34;Intro&#34;&gt;&lt;/a&gt;Intro&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; tobe &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. poosic&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC774; &amp;#xB625;&amp;#xC2F8;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC; &amp;#xAC19;&amp;#xB2E4;&amp;#xB294; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xB4E3;&amp;#xACE0; &amp;#xCDA9;&amp;#xACA9;&amp;#xC5D0; tobe&amp;#xB85C; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xB798; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC774; &amp;#xC6C3;&amp;#xC74C;&amp;#xC18C;&amp;#xB9AC; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC544;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC5ED;&amp;#xC2DC; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;&amp;#x3160;&amp;#x3160;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; tobe&amp;#xB77C;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xC5BB;&amp;#xAC8C;&amp;#xB418;&amp;#xC5B4; &amp;#xC88B;&amp;#xC740; &amp;#xAE30;&amp;#xD68C;&amp;#xC600;&amp;#xB358;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;gt;_-&lt;/p&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xB860;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC790;&amp;#xBA74;, &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; HALucinaotr &amp;#xB9AC;&amp;#xBDF0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! HALucinator&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC;, FirmAE&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC804;&amp;#xCCB4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB77C;&amp;#xBA74; HALucinator&amp;#xB294; RTOS&amp;#xB098; &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; dependency&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC911;&amp;#xC810;&amp;#xC744; &amp;#xB454; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#x2018;Emulator&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xC778;&amp;#xAC00;?!&amp;#x2019;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xD588;&amp;#xB358; &amp;#xAC74;&amp;#xB370; &amp;#xC2E4;&amp;#xC0C1;&amp;#xC740; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130; &amp;#xACE0;&amp;#xAE09; &amp;#xD65C;&amp;#xC6A9;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xC801;&amp;#xC796;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xBDF0;&amp;#xC5D0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xC2E4; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;(rehosting, HAL &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB4F1;..)&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBA3C;&amp;#xC800; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xB9AC;&amp;#xBDF0;&amp;#xB97C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-About-Rehosting&#34;&gt;&lt;a href=&#34;#1-About-Rehosting&#34; class=&#34;headerlink&#34; title=&#34;1. About Rehosting&#34;&gt;&lt;/a&gt;1. About Rehosting&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/thumbnail.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Rehosting&amp;#xC740; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xB9AC;&amp;#xD574; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC2DD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; Emulating&amp;#xACFC; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB450; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xBAA9;&amp;#xD45C;&amp;#xD558;&amp;#xB294; &amp;#xBC14;&amp;#xB294; &amp;#xC870;&amp;#xAE08; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; SoC&amp;#xB098; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xACE0; &amp;#xD3EC;&amp;#xAD04;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, Rehosting&amp;#xC740; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xBCF5;&amp;#xC81C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E8;&amp;#xC77C;&amp;#xBCF4;&amp;#xB4DC;&amp;#xC758; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC598;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xB4E4;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC598;&amp;#xAE30;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;| &lt;a href=&#34;https://www.youtube.com/shorts/MRu8wNogkjk&#34;&gt;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBED8;&amp;#xC9D3;&amp;#xC5F0;&amp;#xAD6C;&amp;#xC18C; Youtube&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC7A5; &amp;#xC704; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC758; &amp;#xB9C8;&amp;#xC744;&amp;#xBC84;&amp;#xC2A4; &amp;#xC804;&amp;#xAD11;&amp;#xD310; &amp;#xB0B4;&amp;#xBD80;&amp;#xB9CC; &amp;#xBCF4;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xB77C;&amp;#xC988;&amp;#xBCA0;&amp;#xB9AC;&amp;#xD30C;&amp;#xC774;&amp;#xB098; &amp;#xACF5;&amp;#xC720;&amp;#xAE30; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xAE30;&amp;#xB4E4;&amp;#xC774; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;.(&lt;del&gt;&amp;#xC800;&amp;#xB3C4; &amp;#xB9C8;&amp;#xC744;&amp;#xBC84;&amp;#xC2A4; &amp;#xC804;&amp;#xAD11;&amp;#xD310;&amp;#xC744; &amp;#xBCFC; &amp;#xAE30;&amp;#xD68C;&amp;#xB294; &amp;#xC5C6;&amp;#xC5B4; &amp;#xB108;&amp;#xBB34; &amp;#xC2E0;&amp;#xAE30;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9;&amp;#xCC28;&amp;#xC758; &amp;#xAE34;&amp;#xAE09; &amp;#xC790;&amp;#xB3D9; &amp;#xC81C;&amp;#xB3D9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, AEB &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;, &amp;#xC7A5;&amp;#xC560;&amp;#xBB3C; &amp;#xC778;&amp;#xC2DD;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC804;&amp;#xBC29; &amp;#xC13C;&amp;#xC11C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xC720;&amp;#xC555;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xC561;&amp;#xCE04;&amp;#xC5D0;&amp;#xC774;&amp;#xD130;, &amp;#xB0B4;&amp;#xBD80; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; CAN &amp;#xBC84;&amp;#xC2A4;, &amp;#xB4F1;&amp;#xC758; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD560;&amp;#xD150;&amp;#xB370;&amp;#xC694;. AEB &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xAC04; &amp;#xBA54;&amp;#xC778; &amp;#xBCF4;&amp;#xB4DC;&amp;#xB9CC; &amp;#xB35C;&amp;#xB801; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;? CAN &amp;#xBC84;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xCC28;&amp;#xB7C9; &amp;#xC18D;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC870;&amp;#xCC28; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xBA48;&amp;#xCDB0;&amp;#xBC84;&amp;#xB9AC;&amp;#xACE0;, CAN &amp;#xBC84;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C;&amp;#xB2E4; &amp;#xD574;&amp;#xB3C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC904; &amp;#xC13C;&amp;#xC11C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5B4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xC790;&amp;#xB2C8; &amp;#xBD84;&amp;#xC11D;&amp;#xB3C4; &amp;#xC804;&amp;#xC5D0; &amp;#xC9C0;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xB824;&amp;#xB2E4;&amp;#xAC00;, &amp;#xC798;&amp;#xBABB;&amp;#xD558;&amp;#xBA74; &amp;#xBCF4;&amp;#xB4DC; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBD88;&amp;#xC0C1;&amp;#xC0AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCE58; &amp;#xBC18;&amp;#xC2E0;&amp;#xC695; &amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC695;&amp;#xC870;&amp;#xC5D0; &amp;#xBB3C; &amp;#xAC00;&amp;#xB4DD; &amp;#xB2F4;&amp;#xACE0;, &amp;#xC785;&amp;#xC695;&amp;#xC81C; &amp;#xD480;&amp;#xACE0;, &amp;#xCD1B;&amp;#xBD88; &amp;#xCF1C;&amp;#xACE0;, &amp;#xC7A5;&amp;#xBBF8; &amp;#xAF43;&amp;#xC78E;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB744;&amp;#xC6E0;&amp;#xB294;&amp;#xB370;(&lt;del&gt;&amp;#xD3C9;&amp;#xC18C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC18;&amp;#xC2E0;&amp;#xC695;&amp;#xC744; &amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt;) &amp;#xC138;&amp;#xC218;&amp;#xB9CC; &amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC774;&amp;#xB784;&amp;#xAE4C;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC720;&amp;#xD615;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC720;&amp;#xD615;&#34; class=&#34;headerlink&#34; title=&#34;1.1. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&#34;&gt;&lt;/a&gt;1.1. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Rehosting&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC778; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; &amp;#xC544;&amp;#xB798; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;I&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xD615;): Linux, Windows &amp;#xAC19;&amp;#xC740; &amp;#xBC94;&amp;#xC6A9; OS &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB2E8;&amp;#xC77C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;II&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(OS &amp;#xAE30;&amp;#xBC18;&amp;#xD615;): Linux, VxWorks &amp;#xB4F1; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xB41C; OS&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;III&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;(&amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8;&amp;#xD615;): OS &amp;#xC5C6;&amp;#xC774; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;. MCU&amp;#xAC00; &amp;#xD0D1;&amp;#xC7AC;&amp;#xB41C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC18C;&amp;#xD615; IoT, &amp;#xC790;&amp;#xB3D9;&amp;#xCC28; ECU, &amp;#xC0B0;&amp;#xC5C5;&amp;#xC6A9; &amp;#xC81C;&amp;#xC5B4; &amp;#xC7A5;&amp;#xBE44; &amp;#xB4F1;&amp;#xC774; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD638;&amp;#xC2A4;&amp;#xD305; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &lt;strong&gt;III&amp;#xD615;, &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&lt;/strong&gt;(Bare-metal) &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xBC1C;&amp;#xC804;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. I&amp;#xD615;, II&amp;#xD615;&amp;#xC740; OS&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, OS &amp;#xC5C6;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; III&amp;#xD615; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xADF9;&amp;#xB3C4;&amp;#xB85C; &amp;#xB192;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8;&amp;#xC740; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2018;&amp;#xB9E8;&amp;#xBAB8;&amp;#xC758; &amp;#xAE08;&amp;#xC18D;&amp;#x2019;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#xC758;&amp;#xC5ED;&amp;#xC744; &amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2018;&amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC704;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xAC78;&amp;#xCE58;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#x2019;&amp;#xB294; &amp;#xB73B; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. OS&amp;#xB77C;&amp;#xB294; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35; &amp;#xC5C6;&amp;#xC774; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; &amp;#xB0A0;&amp;#xAC83; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &lt;code&gt;&amp;#xC800;&amp;#xC7A5;&lt;/code&gt; &amp;#xBC84;&amp;#xD2BC;&amp;#xB9CC; &amp;#xB538;&amp;#xAE4D;&amp;#xD558;&amp;#xBA74; OS&amp;#xAC00; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC368;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBCA0;&amp;#xC5B4;&amp;#xBA54;&amp;#xD0C8; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774; &amp;#xC800;&amp;#xC7A5; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC758; 0x40011000&amp;#xBC88; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#x2018;&amp;#xC900;&amp;#xBE44;&amp;#x2019; &amp;#xC2E0;&amp;#xD638;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xACE0;, 0x40011004&amp;#xBC88; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xCCAB; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC4F4; &amp;#xB2E4;&amp;#xC74C;, &amp;#xC0C1;&amp;#xD0DC; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; 1&amp;#xC774; &amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9B0;&amp;#xB2E4;&amp;#x2019; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &lt;strong&gt;MMIO(Memory-Mapped I/O)&lt;/strong&gt; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB9D0; &amp;#xC548;&amp;#xB4E3;&amp;#xB294; &amp;#xAE08;&amp;#xCABD;&amp;#xC774;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-Rehosting&amp;#xACFC;-Emulating&amp;#xC758;-&amp;#xCC28;&amp;#xC774;&#34;&gt;&lt;a href=&#34;#1-2-Rehosting&amp;#xACFC;-Emulating&amp;#xC758;-&amp;#xCC28;&amp;#xC774;&#34; class=&#34;headerlink&#34; title=&#34;1.2. Rehosting&amp;#xACFC; Emulating&amp;#xC758; &amp;#xCC28;&amp;#xC774;&#34;&gt;&lt;/a&gt;1.2. Rehosting&amp;#xACFC; Emulating&amp;#xC758; &amp;#xCC28;&amp;#xC774;&lt;/h3&gt;&lt;p&gt;Emulating&amp;#xC774; CPU&amp;#xC758; Instruction Set(&amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC9D1;&amp;#xD569;)&amp;#xC744; &amp;#xAC00;&amp;#xC0C1; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, Rehosting&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xC7AC;&amp;#xD604;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &lt;strong&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xD750;&amp;#xB984;(Flow)&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#x2018;&amp;#xCC28;&amp;#xC774;&amp;#x2019;&amp;#xB77C;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, Rehosting&amp;#xC740; Emulating&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB098;&amp;#xC628; &amp;#xBCF4;&amp;#xC644; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE5D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xCA0C;&amp;#xB4E0; Rehosting&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xADF8; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;(Instruction)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC73C;&amp;#xB85C; Emulating &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xC989;, &lt;strong&gt;&amp;#xAE30;&amp;#xBC18; &amp;#xAE30;&amp;#xC220;&amp;#xC740; Emulating&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-3-&amp;#xB2E4;&amp;#xC591;&amp;#xD55C;-Rehosting-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#1-3-&amp;#xB2E4;&amp;#xC591;&amp;#xD55C;-Rehosting-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;1.3. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;1.3. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&lt;/h3&gt;&lt;p&gt;Rehosting&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD06C;&amp;#xAC8C; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; Crash &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xB098;&amp;#xAC00;&amp;#xB294; &amp;#xC624;&amp;#xB958; &amp;#xAE30;&amp;#xBC18; &amp;#xCD94;&amp;#xB860; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xC788;&amp;#xC5B4; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; nop&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; flag&amp;#xAC12;&amp;#xC744; &amp;#xBB34;&amp;#xC870;&amp;#xAC74; True&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xB9CC;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC00;&amp;#xC7A5; &amp;#xC801;&amp;#xD569;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294;&lt;strong&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; Rehosting&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC18; &amp;#xBC29;&amp;#xBC95;&lt;/strong&gt;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xB978; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB192;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5; &amp;#xC2E4;&amp;#xD589;&amp;#xB960;&amp;#xACFC; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC758; &amp;#xCE74;&amp;#xD53C;&amp;#xC728;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560;&amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; Rehosting&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798;&amp;#xAC78;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xB354;&amp;#xC6B1; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC138;&amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC54C;&amp;#xAC8C;&amp;#xB41C; &lt;strong&gt;HAL &amp;#xACC4;&amp;#xCE35; &amp;#xD6C4;&amp;#xD0B9;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; Rehosting &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC;&amp;#xB294; &amp;#xBCA4;&amp;#xB354;&amp;#xC0AC;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; SDK&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xB9E4;&amp;#xC6B0; smart&amp;#xD55C; &amp;#xBC1C;&amp;#xC0C1;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD; &amp;#xB300;&amp;#xC2E0; &amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; HAL &amp;#xACC4;&amp;#xCE35;&amp;#xC774;&amp;#xB098; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-4-About-HAL-Hardware-Abstraction-Layer&#34;&gt;&lt;a href=&#34;#1-4-About-HAL-Hardware-Abstraction-Layer&#34; class=&#34;headerlink&#34; title=&#34;1.4. About HAL(Hardware Abstraction Layer)&#34;&gt;&lt;/a&gt;1.4. About HAL(Hardware Abstraction Layer)&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC804;&amp;#xC5D0; HAL&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. HAL&amp;#xC740; Hardware Abstraction Layer&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD574; &amp;#xC81C;&amp;#xC5B4;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; low level&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xB4E4;&amp;#xC744; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; high level&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; layer&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; asm coding&amp;#xC774; &amp;#xC544;&amp;#xB2CC; c coding&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HAL&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC0C1;&amp;#xC138;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; HAL &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xD560; &amp;#xC218;&amp;#xC788;&amp;#xB3C4;&amp;#xB85D; API&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xACFC; &amp;#xB2E4;&amp;#xC591;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC8FC;&amp;#xB294; &amp;#xACE0;&amp;#xB9C8;&amp;#xC6B4; &amp;#xC874;&amp;#xC7AC;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xCE69; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB77C;&amp;#xB3C4; &amp;#xCE69;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// 1. GPIOC &amp;#xD3EC;&amp;#xD2B8;&amp;#xC758; &amp;#xD074;&amp;#xB7ED;&amp;#xC744; &amp;#xCF1C;&amp;#xC900;&amp;#xB2E4;.&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40023830&lt;/span&gt; |= (&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// 2. PC13 &amp;#xD540;&amp;#xC744; &amp;#xCD9C;&amp;#xB825; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;.&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020800&lt;/span&gt; &amp;amp;= ~(&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;);
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020800&lt;/span&gt; |= (&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// 3. PC13 &amp;#xD540;&amp;#xC758; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC744; 0&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4; (LED ON)&lt;/span&gt;
*(&lt;span class=&#34;hljs-keyword&#34;&gt;volatile&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt;*)&lt;span class=&#34;hljs-number&#34;&gt;0x40020814&lt;/span&gt; &amp;amp;= ~(&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &amp;lt;&amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &lt;strong&gt;GPIO(General-Purpose Input/Output) &amp;#xD540;&lt;/strong&gt;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xC5EC; LED&amp;#xB97C; &amp;#xCF1C;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. HAL&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;&amp;#xBA74;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xCE69;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC2DC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC218;&amp;#xC2ED; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC529; &amp;#xB4A4;&amp;#xC838;&amp;#xAC00;&amp;#xBA70; &amp;#xC704;&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;(&amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;)&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xAC12;&amp;#xC744; &amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9D0;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC774;&amp;#xB9C8;&amp;#xC800;&amp;#xB3C4; &amp;#xCE69;&amp;#xC774; &amp;#xBC14;&amp;#xB010;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC2DC;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA70; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xC8E0;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; HAL&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; API&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xC27D;&amp;#xACE0; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD55C;&amp;#xC904;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC791;&amp;#xC131; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB098; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. HAL &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xCE69;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xCC98;&amp;#xB9AC;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &lt;/p&gt;
&lt;h2 id=&#34;2-HALucinator&#34;&gt;&lt;a href=&#34;#2-HALucinator&#34; class=&#34;headerlink&#34; title=&#34;2. HALucinator&#34;&gt;&lt;/a&gt;2. HALucinator&lt;/h2&gt;&lt;p&gt;HALucinator&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; HAL(Harware Abstraction Layer) &amp;#xD6C4;&amp;#xD0B9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; Rehosting &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD658;&amp;#xAC01;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294; hallcination&amp;#xACFC; Rehosting&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC808;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xC6B8;&amp;#xB824;&amp;#xC11C; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC13C;&amp;#xC2A4;&amp;#xC5D0; &amp;#xAC10;&amp;#xD0C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;HALucinator&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB3C4;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Config File: HALucinator&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; YAML &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;QEMU Emulator: ARM, MIPS &amp;#xB4F1;&amp;#xC758; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCCD0;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC0C1;&amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC904; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;GDB: QEMU&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;BP Handler:HALucinator &amp;#xD6C4;&amp;#xD0B9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC778; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Config &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xC5B4;&amp;#xAD8C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Peripheral Models: &amp;#xAC00;&amp;#xC0C1; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Peripheral Server: &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC911;&amp;#xC778; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; UART &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xB0B4;&amp;#xBCF4;&amp;#xB0B4;&amp;#xAC70;&amp;#xB098;, &amp;#xC678;&amp;#xBD80; &amp;#xC13C;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xC911;&amp;#xACC4;&amp;#xAE30; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;External Device: Peripheral Server&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCE69;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB9E1;&amp;#xAE30;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xB9AC;&amp;#xB4DC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC798; &amp;#xC548; &amp;#xAC08; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB3D9;&amp;#xC791; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;Config File&lt;/code&gt;&amp;#xC5D0; &amp;#xB9AC;&amp;#xD638;&amp;#xC2A4;&amp;#xD305;&amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;, &amp;#xD6C4;&amp;#xD0B9;&amp;#xD560; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HALucinator&amp;#xB294; &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;QEMU Emulator&lt;/code&gt;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB300;&amp;#xC0C1; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74;, &lt;code&gt;BP Handler&lt;/code&gt;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44; &lt;code&gt;Peripheral Model&lt;/code&gt;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; Python &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;code&gt;Peripheral Server&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Peripheral Model&lt;/code&gt;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C; &amp;#xD6C4;, &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xB2E4;&amp;#xC2DC; &lt;code&gt;QEMU Emulator&lt;/code&gt; &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774; &lt;code&gt;BP Handler&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xCC29;&amp;#xAC01;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC815;&amp;#xC0C1; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; Handler code&amp;#xB97C; &amp;#xC2E0;&amp;#xACBD;&amp;#xC368;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74; &amp;#xC8FC;&amp;#xBCC0;&amp;#xAE30;&amp;#xAE30;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB193;&amp;#xCE5C;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00; &amp;#xD558;&amp;#xB294; &amp;#xBD88;&amp;#xC0C1;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC800;&amp;#xC218;&amp;#xC900;&amp;#xC758; MIMO &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; HAL &amp;#xD568;&amp;#xC218; &amp;#xD6C4;&amp;#xD0B9;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xAC00; &amp;#xC555;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC904;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC57D;&amp;#xAC04;&amp;#xC758;(?) &amp;#xB178;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xCEE4;&amp;#xBC84;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, HALucinator&amp;#xB294; &amp;#xC774; &amp;#xD6C4;&amp;#xD0B9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xC791;&amp;#xC131; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCEE4;&amp;#xBC84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xAC10;&amp;#xC774; &amp;#xC0DD;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Env-Setting&#34;&gt;&lt;a href=&#34;#2-1-Env-Setting&#34; class=&#34;headerlink&#34; title=&#34;2.1. Env Setting&#34;&gt;&lt;/a&gt;2.1. Env Setting&lt;/h3&gt;&lt;p&gt;&amp;#xD658;&amp;#xACBD;&amp;#xC138;&amp;#xD305;&amp;#xC740; WSL&amp;#xC758; Ubuntu &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. submodule&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; Avatar2&amp;#xC5D0;&amp;#xC11C; Ubuntu&amp;#xC5D0; &amp;#xB300;&amp;#xD55C;dependency&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; WSL&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; git &amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xAC04;&amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; git submodule&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xB3C4;&amp;#xCEE4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;git clone https://github.com/halucinator/halucinator.git
cd ./halucinator
git submodule update --init
docker build -t halucinator ./
docker run --name halucinator --rm -i -t halucinator bash&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;! HALucinator&amp;#xB97C; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC8FC;&amp;#xC18C; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD130; &amp;#xD30C;&amp;#xC77C;(&amp;#xC778;&amp;#xD130;&amp;#xC149;&amp;#xD130; &amp;#xD568;&amp;#xC218; &amp;#xBC0F; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xB3D9;&amp;#xC5EC;&amp;#xBD80;&amp;#xB9CC; &amp;#xD655;&amp;#xC778; &amp;#xD558;&amp;#xB824;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB2C8;! &amp;#xBAA8;&amp;#xB4E0; &amp;#xC124;&amp;#xC815; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB9C8;&amp;#xCE58;&amp;#xACE0; &amp;#xAD6C;&amp;#xB3D9;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xD53C;&amp;#xACE4;&amp;#xD574;&amp;#xC9C8;&amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xB2E4;&amp;#xD589;&amp;#xD788; HALucinator Repo&amp;#xC5D0; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; t&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0; &lt;code&gt;hal_dev_uart -i=1073811456&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305;&amp;#xD560; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xBD99;&amp;#xC77C; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; UART&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xB978; &amp;#xD130;&amp;#xBBF8;&amp;#xB110; &amp;#xCC3D;&amp;#xC744; &amp;#xB744;&amp;#xC6CC; &lt;code&gt;docker exec -it halucinator bash&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; build&amp;#xD55C; &amp;#xB3C4;&amp;#xCEE4;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &lt;code&gt;./test/STM32/example/run.sh&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xC608;&amp;#xC81C;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; MCU&amp;#xB97C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#in current terminal&lt;/span&gt;
hal_dev_uart -i=&lt;span class=&#34;hljs-number&#34;&gt;1073811456&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;#in new terminal&lt;/span&gt;
docker &lt;span class=&#34;hljs-keyword&#34;&gt;exec&lt;/span&gt; -it halucinator bash
./test/STM32/example/run.sh&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/14/poosic/[Research]Rehosting/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC758; UART&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xB358; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0; &lt;code&gt;hackyboiz&lt;/code&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74;, &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xAE30;&amp;#xAE30;&amp;#xAC00; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC2E0;(rx_data)&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Outro&#34;&gt;&lt;a href=&#34;#Outro&#34; class=&#34;headerlink&#34; title=&#34;Outro&#34;&gt;&lt;/a&gt;Outro&lt;/h2&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! Rehosting&amp;#xBD80;&amp;#xD130; HALucinator&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC1C;&amp;#xC694;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. GDB&amp;#xB85C; &amp;#xC2E4;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAD6C;&amp;#xCD95;&amp;#xD55C; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; AFL&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Fuzzing &amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB824; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;&amp;#xC744; &amp;#xC8FC;&amp;#xC800;&amp;#xB9AC;&amp;#xC8FC;&amp;#xC800;&amp;#xB9AC; &amp;#xC4F0;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAE00; &amp;#xBD84;&amp;#xB7C9;&amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;&amp;#xC640; &amp;#xC2E4;&amp;#xC81C; binary&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB294;&amp;#xAC8C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xD004;&amp;#xB9AC;&amp;#xD2F0; &amp;#xC788;&amp;#xB294; &amp;#xAE00;&amp;#xC774; &amp;#xB420;&amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; Part2&amp;#xC5D0;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! Part2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; STM32&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; HAL &amp;#xAC1C;&amp;#xBC1C;&amp;#xB3C4; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; HALucinator&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD305; &amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xACFC; gdb&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB2C8; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xB3C4; &amp;#xCC3E;&amp;#xC544;&amp;#xC640; &amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; HALucinator&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB610;&amp;#xD55C; Part2&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0AC;&amp;#xAE4C; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; HALucinator github&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://github.com/halucinator/halucinator/blob/master/doc/tutorial/2_run_uart_example.md&#34;&gt;tutorial&lt;/a&gt;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xD574;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAC8C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; Windows&amp;#xC5D0;&amp;#xC11C; docker build&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC368;&amp;#xC11C; &amp;#xC124;&amp;#xCE58; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9C9;&amp;#xD788;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xC5C6;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC774;&amp;#xC5C8;&amp;#xB2EC;&amp;#xAE4C;&amp;#xC694;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C;&amp;#xAE00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/halucinator/halucinator&#34;&gt;HALucinator github&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.usenix.org/conference/usenixsecurity20/presentation/clements&#34;&gt;Usenix-HALucinator: Firmware Re-hosting Through Abstraction Layer Emulation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/09/14/poosic/[Research]Rehosting/KR/thumbnail.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/09/14/poosic/[research]rehosting/kr/">

  <title>[Research] Rehosting - Part 1(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-09-14 17:00" pubdate>
      2025 9 14 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      92
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Rehosting - Part 1(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="Intro"><a href="#Intro" class="headerlink" title="Intro"></a>Intro</h2><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xC5F0;&#xAD6C;&#xAE00;&#xB85C; &#xC18C;&#xC2DD;&#xC744; &#xB4E4;&#xACE0; &#xB3CC;&#xC544;&#xC628; tobe &#xC785;&#xB2C8;&#xB2E4;. poosic&#xC774;&#xB77C;&#xB294; &#xB2C9;&#xB124;&#xC784;&#xC774; &#xB625;&#xC2F8;&#xB294; &#xC18C;&#xB9AC; &#xAC19;&#xB2E4;&#xB294; &#xD53C;&#xB4DC;&#xBC31;&#xC744; &#xB4E3;&#xACE0; &#xCDA9;&#xACA9;&#xC5D0; tobe&#xB85C; &#xB2C9;&#xB124;&#xC784;&#xC744; &#xBC14;&#xAFB8;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xC6D0;&#xB798; &#xB2C9;&#xB124;&#xC784;&#xC774; &#xC6C3;&#xC74C;&#xC18C;&#xB9AC; &#xAC19;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574;&#xC11C; &#xC88B;&#xC544;&#xD588;&#xB294;&#xB370; &#xC5ED;&#xC2DC; &#xAC01;&#xC790;&#xC758; &#xAD00;&#xC810;&#xC774; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;&#x3160;&#x3160;. &#xADF8;&#xB798;&#xB3C4; tobe&#xB77C;&#xB294; &#xC88B;&#xC740; &#xB2C9;&#xB124;&#xC784;&#xC744; &#xC5BB;&#xAC8C;&#xB418;&#xC5B4; &#xC88B;&#xC740; &#xAE30;&#xD68C;&#xC600;&#xB358;&#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4; &gt;_-</p>
<p>&#xBCF8;&#xB860;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xC790;&#xBA74;, &#xC624;&#xB298;&#xC758; &#xC5F0;&#xAD6C;&#xAE00;&#xC740; HALucinaotr &#xB9AC;&#xBDF0;&#xC785;&#xB2C8;&#xB2E4;! HALucinator&#xC740; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC;, FirmAE&#xB294; &#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xC804;&#xCCB4; &#xC2DC;&#xC2A4;&#xD15C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xC6A9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB77C;&#xBA74; HALucinator&#xB294; RTOS&#xB098; &#xBCA0;&#xC5B4;&#xBA54;&#xD0C8; &#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; dependency&#xB97C; &#xD574;&#xACB0;&#xD558;&#xACE0; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xD558;&#xB294;&#xB370; &#xC911;&#xC810;&#xC744; &#xB454; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#x2018;Emulator&#xB97C; &#xB300;&#xCCB4;&#xD560; &#xC218; &#xC788;&#xB294; &#xC5C4;&#xCCAD;&#xB09C; &#xCE5C;&#xAD6C;&#xC778;&#xAC00;?!&#x2019;&#xD558;&#xACE0; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xB824;&#xD588;&#xB358; &#xAC74;&#xB370; &#xC2E4;&#xC0C1;&#xC740; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130; &#xACE0;&#xAE09; &#xD65C;&#xC6A9;&#xC778; &#xAC83; &#xAC19;&#xC544;&#xC11C; &#xC801;&#xC796;&#xC774; &#xB2F9;&#xD669;&#xD588;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9AC;&#xBDF0;&#xC5D0; &#xC55E;&#xC11C; &#xC0DD;&#xC18C;&#xD558;&#xC2E4; &#xAC83; &#xAC19;&#xC740; &#xAC1C;&#xB150;&#xB4E4;(rehosting, HAL &#xBCA0;&#xC5B4;&#xBA54;&#xD0C8; &#xD38C;&#xC6E8;&#xC5B4; &#xB4F1;..)&#xC5D0; &#xB300;&#xD574; &#xBA3C;&#xC800; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xBCF8;&#xACA9;&#xC801;&#xC778; &#xB9AC;&#xBDF0;&#xB97C; &#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="1-About-Rehosting"><a href="#1-About-Rehosting" class="headerlink" title="1. About Rehosting"></a>1. About Rehosting</h2><p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/thumbnail.png" srcset="/img/loading.gif" alt></p>
<p>Rehosting&#xC740; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB85C;&#xBD80;&#xD130; &#xBD84;&#xB9AC;&#xD574; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAE30;&#xBC18;&#xC758; &#xAC00;&#xC0C1; &#xD658;&#xACBD;&#xC73C;&#xB85C; &#xC774;&#xC2DD;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; Emulating&#xACFC; &#xAC1C;&#xB150;&#xC774; &#xBE44;&#xC2B7;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB450; &#xAE30;&#xC220;&#xC774; &#xBAA9;&#xD45C;&#xD558;&#xB294; &#xBC14;&#xB294; &#xC870;&#xAE08; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xB294; &#xD2B9;&#xC815; SoC&#xB098; &#xBCF4;&#xB4DC;&#xC758; &#xBAA8;&#xB4E0; &#xAE30;&#xB2A5;&#xACFC; &#xB3D9;&#xC791;&#xC744; &#xAC00;&#xB2A5;&#xD55C; &#xD55C; &#xC815;&#xD655;&#xD558;&#xACE0; &#xD3EC;&#xAD04;&#xC801;&#xC73C;&#xB85C; &#xAC00;&#xC0C1;&#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC7AC;&#xD604;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD558;&#xC9C0;&#xB9CC;, Rehosting&#xC740; &#xC644;&#xBCBD;&#xD55C; &#xBCF5;&#xC81C;&#xAC00; &#xC544;&#xB2C8;&#xB77C; <strong>&#xBD84;&#xC11D;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC774; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xB370; &#xD544;&#xC694;&#xD55C; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xD658;&#xACBD;&#xC744; &#xAD6C;&#xCD95;</strong>&#xD558;&#xB294; &#xAC83;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2F9;&#xC5F0;&#xD788; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xAC00;&#xC0C1;&#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC7AC;&#xD604; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xBA74; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xACA0;&#xC9C0;&#xB9CC; &#xB2E8;&#xC77C;&#xBCF4;&#xB4DC;&#xC758; &#xAE30;&#xAE30;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xAC00;&#xB2A5;&#xD560; &#xC218; &#xC788;&#xB294; &#xC598;&#xAE30;&#xC9C0;&#xB9CC; &#xB2E4;&#xC591;&#xD55C; &#xC8FC;&#xBCC0;&#xAE30;&#xAE30;&#xB4E4;&#xACFC; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD574;&#xC57C;&#xD558;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xD604;&#xC2E4;&#xC801;&#xC73C;&#xB85C; &#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xC598;&#xAE30;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/1.png" srcset="/img/loading.gif" alt></p>
<p>| <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/shorts/MRu8wNogkjk">&#xCD9C;&#xCC98;: &#xBED8;&#xC9D3;&#xC5F0;&#xAD6C;&#xC18C; Youtube</a></p>
<p>&#xB2F9;&#xC7A5; &#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xC758; &#xB9C8;&#xC744;&#xBC84;&#xC2A4; &#xC804;&#xAD11;&#xD310; &#xB0B4;&#xBD80;&#xB9CC; &#xBCF4;&#xB354;&#xB77C;&#xB3C4; &#xB77C;&#xC988;&#xBCA0;&#xB9AC;&#xD30C;&#xC774;&#xB098; &#xACF5;&#xC720;&#xAE30; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xAE30;&#xB4E4;&#xC774; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xB2C8;&#xAE4C;&#xC694;.(<del>&#xC800;&#xB3C4; &#xB9C8;&#xC744;&#xBC84;&#xC2A4; &#xC804;&#xAD11;&#xD310;&#xC744; &#xBCFC; &#xAE30;&#xD68C;&#xB294; &#xC5C6;&#xC5B4; &#xB108;&#xBB34; &#xC2E0;&#xAE30;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;</del>)</p>
<p>&#xC608;&#xC2DC;&#xB85C; &#xC790;&#xB3D9;&#xCC28;&#xC758; &#xAE34;&#xAE09; &#xC790;&#xB3D9; &#xC81C;&#xB3D9; &#xC2DC;&#xC2A4;&#xD15C;, AEB &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xB4E4;&#xC5B4;&#xBCF4;&#xC790;&#xBA74;, &#xC7A5;&#xC560;&#xBB3C; &#xC778;&#xC2DD;&#xC744; &#xC704;&#xD55C; &#xC804;&#xBC29; &#xC13C;&#xC11C;, &#xC2E4;&#xC81C; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xC720;&#xC555;&#xC744; &#xC81C;&#xC5B4;&#xD574;&#xD558;&#xB294; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xC561;&#xCE04;&#xC5D0;&#xC774;&#xD130;, &#xB0B4;&#xBD80; &#xD1B5;&#xC2E0;&#xC744; &#xC804;&#xB2EC;&#xD560; CAN &#xBC84;&#xC2A4;, &#xB4F1;&#xC758; &#xC8FC;&#xBCC0;&#xAE30;&#xAE30;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD560;&#xD150;&#xB370;&#xC694;. AEB &#xD38C;&#xC6E8;&#xC5B4;&#xAC00; &#xC62C;&#xB77C;&#xAC04; &#xBA54;&#xC778; &#xBCF4;&#xB4DC;&#xB9CC; &#xB35C;&#xB801; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xD558;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;? CAN &#xBC84;&#xC2A4;&#xAC00; &#xC5C6;&#xC73C;&#xB2C8; &#xCC28;&#xB7C9; &#xC18D;&#xB3C4; &#xB370;&#xC774;&#xD130;&#xC870;&#xCC28; &#xBC1B;&#xC9C0; &#xBABB;&#xD574; &#xBA48;&#xCDB0;&#xBC84;&#xB9AC;&#xACE0;, CAN &#xBC84;&#xC2A4;&#xB97C; &#xAC00;&#xC0C1;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD55C;&#xB2E4; &#xD574;&#xB3C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xB0B4;&#xC904; &#xC13C;&#xC11C;&#xAC00; &#xC5C6;&#xC5B4; &#xACB0;&#xAD6D; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xBD84;&#xC11D;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xACA0;&#xC8E0;. &#xADF8;&#xB807;&#xB2E4;&#xACE0; &#xC774; &#xBAA8;&#xB4E0; &#xC8FC;&#xBCC0;&#xAE30;&#xAE30;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xC11C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xD558;&#xC790;&#xB2C8; &#xBD84;&#xC11D;&#xB3C4; &#xC804;&#xC5D0; &#xC9C0;&#xCCD0;&#xBC84;&#xB9AC;&#xB294; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xB2A5; &#xD558;&#xB098; &#xBCF4;&#xB824;&#xB2E4;&#xAC00;, &#xC798;&#xBABB;&#xD558;&#xBA74; &#xBCF4;&#xB4DC; &#xC5EC;&#xB7EC; &#xAC1C;&#xB97C; &#xAC00;&#xC0C1;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC77C;&#xC77C;&#xC774; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xCF54;&#xB4DC;&#xB97C; &#xC9DC;&#xC57C; &#xD558;&#xB294; &#xBD88;&#xC0C1;&#xC0AC;&#xAC00; &#xC0DD;&#xACA8;&#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;. &#xB9C8;&#xCE58; &#xBC18;&#xC2E0;&#xC695; &#xD558;&#xB824;&#xACE0; &#xC695;&#xC870;&#xC5D0; &#xBB3C; &#xAC00;&#xB4DD; &#xB2F4;&#xACE0;, &#xC785;&#xC695;&#xC81C; &#xD480;&#xACE0;, &#xCD1B;&#xBD88; &#xCF1C;&#xACE0;, &#xC7A5;&#xBBF8; &#xAF43;&#xC78E;&#xAE4C;&#xC9C0; &#xB744;&#xC6E0;&#xB294;&#xB370;(<del>&#xD3C9;&#xC18C;&#xC5D0; &#xC81C;&#xAC00; &#xC774;&#xB807;&#xAC8C; &#xBC18;&#xC2E0;&#xC695;&#xC744; &#xD558;&#xC9C4; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;</del>) &#xC138;&#xC218;&#xB9CC; &#xD558;&#xACE0; &#xB098;&#xC624;&#xB294; &#xB290;&#xB08C;&#xC774;&#xB784;&#xAE4C;&#xC694;.</p>
<h3 id="1-1-&#xD38C;&#xC6E8;&#xC5B4;-&#xC720;&#xD615;"><a href="#1-1-&#xD38C;&#xC6E8;&#xC5B4;-&#xC720;&#xD615;" class="headerlink" title="1.1. &#xD38C;&#xC6E8;&#xC5B4; &#xC720;&#xD615;"></a>1.1. &#xD38C;&#xC6E8;&#xC5B4; &#xC720;&#xD615;</h3><p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/2.png" srcset="/img/loading.gif" alt></p>
<p>Rehosting&#xC740; &#xBAA8;&#xB4E0; &#xD38C;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD574; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xBCF4;&#xB2E4; &#xD6A8;&#xACFC;&#xC801;&#xC778; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xAC00;&#xC0C1;&#xD654;&#xD558;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xD38C;&#xC6E8;&#xC5B4; &#xC720;&#xD615;&#xC740; &#xD06C;&#xAC8C; &#xC544;&#xB798; &#xC138; &#xAC00;&#xC9C0;&#xB85C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;.</p>
<ol>
<li>I&#xD615; &#xD38C;&#xC6E8;&#xC5B4;(&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xD615;): Linux, Windows &#xAC19;&#xC740; &#xBC94;&#xC6A9; OS &#xC704;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xB2E8;&#xC77C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xD615;&#xD0DC;&#xC758; &#xD38C;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>II&#xD615; &#xD38C;&#xC6E8;&#xC5B4;(OS &#xAE30;&#xBC18;&#xD615;): Linux, VxWorks &#xB4F1; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xB41C; OS&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD38C;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;</li>
<li>III&#xD615; &#xD38C;&#xC6E8;&#xC5B4;(&#xBCA0;&#xC5B4;&#xBA54;&#xD0C8;&#xD615;): OS &#xC5C6;&#xC774; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB97C; &#xC9C1;&#xC811; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xD38C;&#xC6E8;&#xC5B4;. MCU&#xAC00; &#xD0D1;&#xC7AC;&#xB41C; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC18C;&#xD615; IoT, &#xC790;&#xB3D9;&#xCC28; ECU, &#xC0B0;&#xC5C5;&#xC6A9; &#xC81C;&#xC5B4; &#xC7A5;&#xBE44; &#xB4F1;&#xC774; &#xC5EC;&#xAE30;&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xB9AC;&#xD638;&#xC2A4;&#xD305; &#xAE30;&#xC220;&#xC740; &#xC8FC;&#xB85C; <strong>III&#xD615;, &#xBCA0;&#xC5B4;&#xBA54;&#xD0C8; &#xD38C;&#xC6E8;&#xC5B4;</strong>(Bare-metal) &#xBD84;&#xC11D;&#xC744; &#xC704;&#xD574; &#xBC1C;&#xC804;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. I&#xD615;, II&#xD615;&#xC740; OS&#xB97C; &#xD1B5;&#xD574; &#xC5B4;&#xB290; &#xC815;&#xB3C4;&#xC758; &#xCD94;&#xC0C1;&#xD654; &#xACC4;&#xCE35;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC9C0;&#xB9CC;, OS &#xC5C6;&#xC774; &#xC9C1;&#xC811; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xB294; III&#xD615; &#xD38C;&#xC6E8;&#xC5B4;&#xB294; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC758;&#xC874;&#xC131;&#xC774; &#xADF9;&#xB3C4;&#xB85C; &#xB192;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBCA0;&#xC5B4;&#xBA54;&#xD0C8;&#xC740; &#xC9C1;&#xC5ED;&#xD558;&#xC790;&#xBA74; &#x2018;&#xB9E8;&#xBAB8;&#xC758; &#xAE08;&#xC18D;&#x2019;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.&#xC758;&#xC5ED;&#xC744; &#xD558;&#xC790;&#xBA74; &#x2018;&#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC704;&#xC5D0; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xAC78;&#xCE58;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#x2019;&#xB294; &#xB73B; &#xC815;&#xB3C4;&#xAC00; &#xB418;&#xACA0;&#xB124;&#xC694;. OS&#xB77C;&#xB294; &#xCD94;&#xC0C1;&#xD654; &#xACC4;&#xCE35; &#xC5C6;&#xC774; &#xD38C;&#xC6E8;&#xC5B4;&#xAC00; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xBAA8;&#xB4E0; &#xAC83;&#xC744; &#xB0A0;&#xAC83; &#xADF8;&#xB300;&#xB85C; &#xC9C1;&#xC811; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; PC&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD30C;&#xC77C;&#xC744; &#xC800;&#xC7A5;&#xD560; &#xB54C; <code>&#xC800;&#xC7A5;</code> &#xBC84;&#xD2BC;&#xB9CC; &#xB538;&#xAE4D;&#xD558;&#xBA74; OS&#xAC00; &#xC54C;&#xC544;&#xC11C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC368;&#xC8FC;&#xC9C0;&#xB9CC;, &#xBCA0;&#xC5B4;&#xBA54;&#xD0C8; &#xD38C;&#xC6E8;&#xC5B4;&#xB294; &#xC774; &#xC800;&#xC7A5; &#xC791;&#xC5C5;&#xC744; &#xC704;&#xD574;&#xC11C; &#x2018;&#xB514;&#xC2A4;&#xD06C; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC758; 0x40011000&#xBC88; &#xC8FC;&#xC18C;&#xC5D0; &#x2018;&#xC900;&#xBE44;&#x2019; &#xC2E0;&#xD638;&#xB97C; &#xBCF4;&#xB0B4;&#xACE0;, 0x40011004&#xBC88; &#xC8FC;&#xC18C;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xC758; &#xCCAB; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC4F4; &#xB2E4;&#xC74C;, &#xC0C1;&#xD0DC; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC758; &#xD2B9;&#xC815; &#xBE44;&#xD2B8;&#xAC00; 1&#xC774; &#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xAE30;&#xB2E4;&#xB9B0;&#xB2E4;&#x2019; &#xC640; &#xAC19;&#xC740; &#xC800;&#xC218;&#xC900;&#xC758; &#xC791;&#xC5C5;&#xC744; &#xBAA8;&#xB450; &#xC9C1;&#xC811; &#xC218;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xCC98;&#xB7FC; &#xBAA8;&#xB4E0; &#xD1B5;&#xC2E0;&#xC744; &#xD2B9;&#xC815; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xAC12;&#xC744; &#xC77D;&#xACE0; &#xC4F0;&#xB294; <strong>MMIO(Memory-Mapped I/O)</strong> &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xAC00; &#xC5C6;&#xC73C;&#xBA74; &#xD38C;&#xC6E8;&#xC5B4;&#xB294; &#xB9D0; &#xC548;&#xB4E3;&#xB294; &#xAE08;&#xCABD;&#xC774;&#xAC00; &#xB418;&#xC5B4;&#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-2-Rehosting&#xACFC;-Emulating&#xC758;-&#xCC28;&#xC774;"><a href="#1-2-Rehosting&#xACFC;-Emulating&#xC758;-&#xCC28;&#xC774;" class="headerlink" title="1.2. Rehosting&#xACFC; Emulating&#xC758; &#xCC28;&#xC774;"></a>1.2. Rehosting&#xACFC; Emulating&#xC758; &#xCC28;&#xC774;</h3><p>Emulating&#xC774; CPU&#xC758; Instruction Set(&#xBA85;&#xB839;&#xC5B4; &#xC9D1;&#xD569;)&#xC744; &#xAC00;&#xC0C1; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD55C;&#xB2E4;&#xBA74;, Rehosting&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC644;&#xBCBD;&#xD55C; &#xC7AC;&#xD604;&#xBCF4;&#xB2E4;&#xB294; <strong>&#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC774; &#xC644;&#xC804;&#xD55C; &#xD750;&#xB984;(Flow)&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC83;</strong>&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC2E4; &#x2018;&#xCC28;&#xC774;&#x2019;&#xB77C;&#xACE0; &#xC5B8;&#xAE09;&#xD588;&#xC9C0;&#xB9CC;, Rehosting&#xC740; Emulating&#xC758; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB098;&#xC628; &#xBCF4;&#xC644; &#xAE30;&#xC220;&#xC5D0; &#xAC00;&#xAE5D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xCA0C;&#xB4E0; Rehosting&#xC73C;&#xB85C; &#xAE30;&#xB2A5;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB824;&#xBA74; &#xADF8; &#xAE30;&#xB2A5;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;(Instruction)&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC5D4;&#xC9C4;&#xC774; &#xBC18;&#xB4DC;&#xC2DC; &#xD544;&#xC694;&#xD558;&#xACE0;, &#xC774; &#xC5D4;&#xC9C4;&#xC73C;&#xB85C; Emulating &#xAE30;&#xC220;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. &#xC989;, <strong>&#xAE30;&#xBC18; &#xAE30;&#xC220;&#xC740; Emulating</strong>&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<h3 id="1-3-&#xB2E4;&#xC591;&#xD55C;-Rehosting-&#xBC29;&#xC2DD;"><a href="#1-3-&#xB2E4;&#xC591;&#xD55C;-Rehosting-&#xBC29;&#xC2DD;" class="headerlink" title="1.3. &#xB2E4;&#xC591;&#xD55C; Rehosting &#xBC29;&#xC2DD;"></a>1.3. &#xB2E4;&#xC591;&#xD55C; Rehosting &#xBC29;&#xC2DD;</h3><p>Rehosting&#xC744; &#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC740; &#xD06C;&#xAC8C; 3&#xAC00;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xCCAB;&#xBC88;&#xC9F8;&#xB85C;&#xB294; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xB97C; &#xD1B5;&#xD574; <strong>&#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; Crash &#xC9C0;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC218;&#xC815;&#xD574;&#xB098;&#xAC00;&#xB294; &#xC624;&#xB958; &#xAE30;&#xBC18; &#xCD94;&#xB860; &#xBC29;&#xC2DD;</strong>&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD84;&#xC11D;&#xC5D0; &#xC788;&#xC5B4; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xC9C0;&#xB9CC; &#xC624;&#xB958;&#xAC00; &#xB098;&#xB294; &#xCF54;&#xB4DC;&#xC5D0; &#xB300;&#xD574; nop&#xC73C;&#xB85C; &#xBC14;&#xAFB8;&#xAC70;&#xB098; flag&#xAC12;&#xC744; &#xBB34;&#xC870;&#xAC74; True&#xB85C; &#xC124;&#xC815;&#xD574; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC774;&#xB7EC;&#xD55C; &#xBC29;&#xC2DD;&#xC911; &#xD558;&#xB098;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. &#xD38C;&#xC6E8;&#xC5B4;&#xC758; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xB9CC;&#xC744; &#xC704;&#xD55C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xB97C; &#xAD6C;&#xC131;&#xD55C;&#xB2E4;&#xBA74; &#xAC00;&#xC7A5; &#xC801;&#xD569;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xB450;&#xBC88;&#xC9F8;&#xB85C;&#xB294;<strong>&#xC2E4;&#xD589; &#xC804; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xBD84;&#xC11D;&#xD574; Rehosting&#xC744; &#xD558;&#xB294; &#xBD84;&#xC11D; &#xAE30;&#xBC18; &#xBC29;&#xBC95;</strong>&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xB2E4;&#xB978; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC640;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xB85C;&#xC9C1;&#xC744; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xAC00;&#xC0C1; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB97C; &#xAD6C;&#xCD95;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xB192;&#xC740; &#xAE30;&#xB2A5; &#xC2E4;&#xD589;&#xB960;&#xACFC; &#xC2E4;&#xC81C; &#xB3D9;&#xC791;&#xC758; &#xCE74;&#xD53C;&#xC728;&#xC744; &#xB2EC;&#xC131;&#xD560;&#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xADF8;&#xB9CC;&#xD07C; Rehosting&#xC744; &#xC704;&#xD574; &#xAC78;&#xB9AC;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC624;&#xB798;&#xAC78;&#xB9BD;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB807;&#xAE30;&#xC5D0; &#xB354;&#xC6B1; &#xC2E4;&#xC81C; &#xB3D9;&#xC791;&#xACFC; &#xAC19;&#xC740; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACA0;&#xC8E0;!</p>
<p>&#xC138;&#xBC88;&#xC9F8;&#xB294; &#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74;&#xC11C; &#xC54C;&#xAC8C;&#xB41C; <strong>HAL &#xACC4;&#xCE35; &#xD6C4;&#xD0B9;&#xC744; &#xD65C;&#xC6A9;&#xD55C; Rehosting &#xBC29;&#xC2DD;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC784;&#xBCA0;&#xB514;&#xB4DC;&#xB294; &#xBCA4;&#xB354;&#xC0AC;&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; SDK&#xC5D0; &#xC758;&#xC874;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xB9E4;&#xC6B0; smart&#xD55C; &#xBC1C;&#xC0C1;&#xC758; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xC800;&#xC218;&#xC900;&#xC758; &#xBCF5;&#xC7A1;&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xC870;&#xC791;&#xC744; &#xC9C1;&#xC811; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC7AC;&#xD604;&#xD558;&#xB294; &#xBC29;&#xC2DD; &#xB300;&#xC2E0; &#xC774; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xC870;&#xC791;&#xC774; &#xCD94;&#xC0C1;&#xD654;&#xB41C; HAL &#xACC4;&#xCE35;&#xC774;&#xB098; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. </p>
<h3 id="1-4-About-HAL-Hardware-Abstraction-Layer"><a href="#1-4-About-HAL-Hardware-Abstraction-Layer" class="headerlink" title="1.4. About HAL(Hardware Abstraction Layer)"></a>1.4. About HAL(Hardware Abstraction Layer)</h3><p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xC804;&#xC5D0; HAL&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xAC04;&#xB2E8;&#xD788; &#xC9DA;&#xACE0; &#xB118;&#xC5B4;&#xAC00; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. HAL&#xC740; Hardware Abstraction Layer&#xC778;&#xB370;&#xC694;. &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0; &#xC9C1;&#xC811; &#xC811;&#xADFC;&#xD574; &#xC81C;&#xC5B4;&#xD574;&#xC57C;&#xD558;&#xB294; low level&#xC758; &#xB3D9;&#xC791;&#xB4E4;&#xC744; &#xCD94;&#xC0C1;&#xD654;&#xD558;&#xC5EC; high level&#xB85C; &#xC81C;&#xACF5;&#xD574;&#xC8FC;&#xB294; layer&#xC785;&#xB2C8;&#xB2E4;. &#xC27D;&#xAC8C; &#xB9D0;&#xD558;&#xC790;&#xBA74; asm coding&#xC774; &#xC544;&#xB2CC; c coding&#xC744; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. HAL&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xC0C1;&#xC138;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xBAA8;&#xB974;&#xB354;&#xB77C;&#xB3C4; &#xD45C;&#xC900;&#xD654;&#xB41C; HAL &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC744; &#xD560; &#xC218;&#xC788;&#xB3C4;&#xB85D; API&#xB97C; &#xC81C;&#xACF5;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xACFC; &#xB2E4;&#xC591;&#xC131;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xC9C0;&#xCF1C;&#xC8FC;&#xB294; &#xACE0;&#xB9C8;&#xC6B4; &#xC874;&#xC7AC;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC8E0;.</p>
<p>&#xCE69; &#xC81C;&#xC870;&#xC0AC;&#xB9C8;&#xB2E4; &#xC2EC;&#xC9C0;&#xC5B4;&#xB294; &#xAC19;&#xC740; &#xC81C;&#xC870;&#xC0AC;&#xB77C;&#xB3C4; &#xCE69;&#xB9C8;&#xB2E4; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. </p>
<pre><code class="hljs c"><span class="hljs-comment">// 1. GPIOC &#xD3EC;&#xD2B8;&#xC758; &#xD074;&#xB7ED;&#xC744; &#xCF1C;&#xC900;&#xB2E4;.</span>
*(<span class="hljs-keyword">volatile</span> <span class="hljs-keyword">uint32_t</span>*)<span class="hljs-number">0x40023830</span> |= (<span class="hljs-number">1</span> &lt;&lt; <span class="hljs-number">2</span>);
<span class="hljs-comment">// 2. PC13 &#xD540;&#xC744; &#xCD9C;&#xB825; &#xBAA8;&#xB4DC;&#xB85C; &#xC124;&#xC815;&#xD55C;&#xB2E4;.</span>
*(<span class="hljs-keyword">volatile</span> <span class="hljs-keyword">uint32_t</span>*)<span class="hljs-number">0x40020800</span> &amp;= ~(<span class="hljs-number">3</span> &lt;&lt; <span class="hljs-number">26</span>);
*(<span class="hljs-keyword">volatile</span> <span class="hljs-keyword">uint32_t</span>*)<span class="hljs-number">0x40020800</span> |= (<span class="hljs-number">1</span> &lt;&lt; <span class="hljs-number">26</span>);
<span class="hljs-comment">// 3. PC13 &#xD540;&#xC758; &#xCD9C;&#xB825; &#xAC12;&#xC744; 0&#xC73C;&#xB85C; &#xB9CC;&#xB4E0;&#xB2E4; (LED ON)</span>
*(<span class="hljs-keyword">volatile</span> <span class="hljs-keyword">uint32_t</span>*)<span class="hljs-number">0x40020814</span> &amp;= ~(<span class="hljs-number">1</span> &lt;&lt; <span class="hljs-number">13</span>);</code></pre>
<p>&#xC608;&#xC2DC;&#xB85C; <strong>GPIO(General-Purpose Input/Output) &#xD540;</strong>&#xC744; &#xC81C;&#xC5B4;&#xD558;&#xC5EC; LED&#xB97C; &#xCF1C;&#xB294; &#xACBD;&#xC6B0;&#xB97C; &#xC0DD;&#xAC01;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;. HAL&#xC774; &#xC5C6;&#xB2E4;&#xBA74;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xCE69;&#xC758; &#xB370;&#xC774;&#xD130;&#xC2DC;&#xD2B8;&#xB97C; &#xC218;&#xC2ED; &#xD398;&#xC774;&#xC9C0;&#xC529; &#xB4A4;&#xC838;&#xAC00;&#xBA70; &#xC704;&#xC758; &#xC608;&#xC2DC;&#xCC98;&#xB7FC; &#xD2B9;&#xC815; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;(&#xB808;&#xC9C0;&#xC2A4;&#xD130;)&#xC5D0; &#xC9C1;&#xC811; &#xAC12;&#xC744; &#xC368;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB9D0;&#xD588;&#xB4EF;&#xC774; &#xC774;&#xB9C8;&#xC800;&#xB3C4; &#xCE69;&#xC774; &#xBC14;&#xB010;&#xB2E4;&#xBA74; &#xB2E4;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xC2DC;&#xD2B8;&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xBA70; &#xC791;&#xC131;&#xD574;&#xC57C;&#xD558;&#xC8E0;. </p>
<pre><code class="hljs c">HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);</code></pre>
<p>&#xD558;&#xC9C0;&#xB9CC; HAL&#xC774; &#xC81C;&#xACF5;&#xD558;&#xB294; API&#xB97C; &#xC774;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xC704;&#xCC98;&#xB7FC; &#xC27D;&#xACE0; &#xBE60;&#xB974;&#xAC8C; &#xD55C;&#xC904;&#xC758; &#xCF54;&#xB4DC;&#xB85C; &#xC791;&#xC131; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xAD6C;&#xC870;&#xB098; &#xB3D9;&#xC791;&#xC744; &#xC790;&#xC138;&#xD788; &#xC774;&#xD574;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xAC1C;&#xBC1C;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. HAL &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xAC00; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xD604;&#xC7AC; &#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xCE69;&#xC5D0; &#xB9DE;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xC870;&#xC791;&#xC744; &#xB300;&#xC2E0; &#xCC98;&#xB9AC;&#xD574;&#xC8FC;&#xB294; &#xAC83;&#xC774;&#xC8E0;. </p>
<h2 id="2-HALucinator"><a href="#2-HALucinator" class="headerlink" title="2. HALucinator"></a>2. HALucinator</h2><p>HALucinator&#xB294; &#xC774;&#xB984;&#xC5D0;&#xC11C;&#xB3C4; &#xC720;&#xCD94;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; &#xC124;&#xBA85;&#xD55C; HAL(Harware Abstraction Layer) &#xD6C4;&#xD0B9; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD38C;&#xC6E8;&#xC5B4; Rehosting &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C; &#xC785;&#xB2C8;&#xB2E4;. (&#xD658;&#xAC01;&#xC744; &#xB73B;&#xD558;&#xB294; hallcination&#xACFC; Rehosting&#xC758; &#xAC1C;&#xB150;&#xC774; &#xC808;&#xBB18;&#xD558;&#xAC8C; &#xC5B4;&#xC6B8;&#xB824;&#xC11C; &#xC5C4;&#xCCAD;&#xB09C; &#xB124;&#xC774;&#xBC0D; &#xC13C;&#xC2A4;&#xC5D0; &#xAC10;&#xD0C4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/4.png" srcset="/img/loading.gif" alt></p>
<p>HALucinator&#xC758; &#xAD6C;&#xC870;&#xB3C4;&#xB97C; &#xD55C;&#xBC88; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Config File: HALucinator&#xC758; &#xBAA8;&#xB4E0; &#xB3D9;&#xC791; &#xC124;&#xC815;&#xC744; &#xC815;&#xC758;&#xD558;&#xB294; YAML &#xD615;&#xC2DD;&#xC758; &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>QEMU Emulator: ARM, MIPS &#xB4F1;&#xC758; &#xC544;&#xD0A4;&#xD14D;&#xCCD0;&#xB97C; &#xC774;&#xD574;&#xD558;&#xACE0; &#xAC00;&#xC0C1;&#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xD38C;&#xC6E8;&#xC5B4; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C;&#xC904; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>GDB: QEMU&#xC758; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xB2A5;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xB514;&#xBC84;&#xAE45; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>BP Handler:HALucinator &#xD6C4;&#xD0B9; &#xAE30;&#xB2A5;&#xC758; &#xD575;&#xC2EC;&#xC778; &#xBE0C;&#xB808;&#xC774;&#xD06C;&#xD3EC;&#xC778;&#xD2B8; &#xD578;&#xB4E4;&#xB7EC;&#xC785;&#xB2C8;&#xB2E4;. Config &#xD30C;&#xC77C;&#xC5D0; &#xC124;&#xC815;&#xB41C; &#xC8FC;&#xC18C;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; &#xC81C;&#xC5B4;&#xAD8C;&#xC744; &#xAC00;&#xC838;&#xC640; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC815;&#xC758;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Peripheral Models: &#xAC00;&#xC0C1; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xC2E4;&#xC81C; &#xB3D9;&#xC791;&#xC774; &#xC815;&#xC758;&#xB41C; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; Python&#xC73C;&#xB85C; &#xC791;&#xC131;&#xD55C; &#xD6C4;&#xD0B9; &#xB85C;&#xC9C1;&#xC774; &#xBC14;&#xB85C; &#xC5EC;&#xAE30;&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Peripheral Server: &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xC158; &#xC911;&#xC778; &#xD38C;&#xC6E8;&#xC5B4;&#xC758; UART &#xCD9C;&#xB825;&#xC744; &#xC2E4;&#xC81C; &#xC2DC;&#xB9AC;&#xC5BC; &#xD3EC;&#xD2B8;&#xB85C; &#xB0B4;&#xBCF4;&#xB0B4;&#xAC70;&#xB098;, &#xC678;&#xBD80; &#xC13C;&#xC11C; &#xAC12;&#xC744; &#xC77D;&#xC5B4;&#xC624;&#xB294; &#xB4F1;&#xC758; &#xC911;&#xACC4;&#xAE30; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>External Device: Peripheral Server&#xB97C; &#xD1B5;&#xD574; &#xC5F0;&#xACB0;&#xB418;&#xB294; &#xC2E4;&#xC81C; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC2DC;&#xBBAC;&#xB808;&#xC774;&#xC158;&#xB9CC;&#xC73C;&#xB85C;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xCE69;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC2E4;&#xC81C; &#xC7A5;&#xCE58;&#xC5D0; &#xB9E1;&#xAE30;&#xB294; &#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC; &#xBC29;&#xC2DD;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xAC01; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xB9CC; &#xBCF4;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xC798; &#xC548; &#xAC08; &#xC218;&#xB3C4; &#xC788;&#xC73C;&#xB2C8;, &#xB3D9;&#xC791; &#xD750;&#xB984;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>Config File</code>&#xC5D0; &#xB9AC;&#xD638;&#xC2A4;&#xD305;&#xD560; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xB9F5; &#xC815;&#xBCF4;, &#xD6C4;&#xD0B9;&#xD560; &#xD568;&#xC218; &#xC8FC;&#xC18C; &#xB4F1;&#xC744; &#xC791;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. HALucinator&#xB294; &#xC774; &#xD30C;&#xC77C;&#xC744; &#xCC38;&#xC870;&#xD558;&#xC5EC; <code>QEMU Emulator</code>&#xB85C; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD38C;&#xC6E8;&#xC5B4;&#xAC00; &#xD6C4;&#xD0B9; &#xB300;&#xC0C1; &#xD568;&#xC218; &#xC8FC;&#xC18C;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74;, <code>BP Handler</code>&#xAC00; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xAC00;&#xB85C;&#xCC44; <code>Peripheral Model</code>&#xC5D0; &#xC815;&#xC758;&#xB41C; Python &#xCF54;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <code>Peripheral Server</code>&#xB97C; &#xD1B5;&#xD574; &#xC2E4;&#xC81C; &#xAE30;&#xAE30;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0;&#xBC1B;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>Peripheral Model</code>&#xC758; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB41C; &#xD6C4;, &#xADF8; &#xACB0;&#xACFC;&#xB294; &#xB2E4;&#xC2DC; <code>QEMU Emulator</code> &#xCABD;&#xC73C;&#xB85C; &#xBC18;&#xD658;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C;, &#xC774; <code>BP Handler</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC8FC;&#xBCC0;&#xAE30;&#xAE30;&#xC640;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC744; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD588;&#xB2E4;&#xACE0; &#xCC29;&#xAC01;&#xD558;&#xAC8C; &#xB418;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC815;&#xC0C1; &#xB85C;&#xC9C1;&#xC5D0; &#xB300;&#xD55C; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; Handler code&#xB97C; &#xC2E0;&#xACBD;&#xC368;&#xC11C; &#xC791;&#xC131;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xBA74; &#xC8FC;&#xBCC0;&#xAE30;&#xAE30;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC5D0;&#xC11C; &#xB098;&#xC62C; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB193;&#xCE5C;&#xB2E4;&#xB358;&#xAC00;, &#xC2E4;&#xC81C; &#xB3D9;&#xC791; &#xD750;&#xB984;&#xACFC; &#xB2EC;&#xB77C;&#xC9C4;&#xB2E4;&#xB358;&#xAC00; &#xD558;&#xB294; &#xBD88;&#xC0C1;&#xC0AC;&#xAC00; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBD84;&#xC11D;&#xD658;&#xACBD; &#xAD6C;&#xCD95;&#xC744; &#xC704;&#xD574; &#xC800;&#xC218;&#xC900;&#xC758; MIMO &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xBAA8;&#xB450; &#xBD84;&#xC11D;&#xD574;&#xC57C;&#xD558;&#xB294; &#xAE30;&#xC874;&#xC758; &#xC791;&#xC5C5;&#xC744; HAL &#xD568;&#xC218; &#xD6C4;&#xD0B9;&#xC5D0;&#xB9CC; &#xC9D1;&#xC911;&#xD558;&#xBA74; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xC555;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xC904;&#xC77C; &#xC218; &#xC788;&#xC5B4; &#xC57D;&#xAC04;&#xC758;(?) &#xB178;&#xB825;&#xC73C;&#xB85C; &#xC5F4;&#xC2EC;&#xD788; &#xCEE4;&#xBC84;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, HALucinator&#xB294; &#xC774; &#xD6C4;&#xD0B9; &#xB85C;&#xC9C1;&#xC744; &#xC775;&#xC219;&#xD55C; Python&#xC73C;&#xB85C; &#xC9C1;&#xC811; &#xC791;&#xC131; &#xAC00;&#xB2A5;&#xD574; &#xB2E8;&#xC810;&#xC744; &#xBAA8;&#xB450; &#xCEE4;&#xBC84;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83;&#xB9CC; &#xAC19;&#xC740; &#xC790;&#xC2E0;&#xAC10;&#xC774; &#xC0DD;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-1-Env-Setting"><a href="#2-1-Env-Setting" class="headerlink" title="2.1. Env Setting"></a>2.1. Env Setting</h3><p>&#xD658;&#xACBD;&#xC138;&#xD305;&#xC740; WSL&#xC758; Ubuntu &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. submodule&#xC5D0; &#xD3EC;&#xD568;&#xB41C; Avatar2&#xC5D0;&#xC11C; Ubuntu&#xC5D0; &#xB300;&#xD55C;dependency&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; WSL&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xC2DC;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xC758; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; git &#xC744; &#xD1B5;&#xD574; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xAC04;&#xD3B8;&#xD558;&#xAC8C; git submodule&#xC744; &#xC774;&#xC6A9;&#xD574; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xB3C4;&#xCEE4;&#xB97C; &#xD1B5;&#xD574; &#xBE4C;&#xB4DC; &#xD6C4; &#xC2E4;&#xD589; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python">git clone https://github.com/halucinator/halucinator.git
cd ./halucinator
git submodule update --init
docker build -t halucinator ./
docker run --name halucinator --rm -i -t halucinator bash</code></pre>
<p>&#xC774;&#xC81C; &#xC798; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574; &#xBD10;&#xC57C;&#xACA0;&#xC8E0;! HALucinator&#xB97C; &#xAD6C;&#xB3D9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xAC83;&#xB4E4;&#xC774; &#xD544;&#xC694;&#xD55C;&#xB370;&#xC694;.</p>
<ul>
<li>&#xD38C;&#xC6E8;&#xC5B4; &#xD30C;&#xC77C;</li>
<li>&#xBA54;&#xBAA8;&#xB9AC; &#xB808;&#xC774;&#xC544;&#xC6C3; &#xC124;&#xC815;</li>
<li>&#xC8FC;&#xC18C; &#xD30C;&#xC77C;</li>
<li>&#xC778;&#xD130;&#xC149;&#xD130; &#xD30C;&#xC77C;(&#xC778;&#xD130;&#xC149;&#xD130; &#xD568;&#xC218; &#xBC0F; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xC758; &#xD578;&#xB4E4;&#xB7EC;)</li>
</ul>
<p>&#xAD6C;&#xB3D9;&#xC5EC;&#xBD80;&#xB9CC; &#xD655;&#xC778; &#xD558;&#xB824;&#xB294;&#xB370; &#xC774; &#xBAA8;&#xB4E0; &#xC791;&#xC5C5;&#xC744; &#xD574;&#xC918;&#xC57C; &#xD55C;&#xB2E4;&#xB2C8;! &#xBAA8;&#xB4E0; &#xC124;&#xC815; &#xC791;&#xC5C5;&#xC744; &#xB9C8;&#xCE58;&#xACE0; &#xAD6C;&#xB3D9;&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xB294;&#xAC78; &#xD655;&#xC778;&#xD558;&#xBA74; &#xC0C1;&#xB2F9;&#xD788; &#xD53C;&#xACE4;&#xD574;&#xC9C8;&#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xB2E4;&#xD589;&#xD788; HALucinator Repo&#xC5D0; &#xC608;&#xC81C; &#xD30C;&#xC77C;&#xC774; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xAC83;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; t&#xD14C;&#xC2A4;&#xD2B8;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; &#xC2E4;&#xD589;&#xD55C; &#xD130;&#xBBF8;&#xB110;&#xC5D0; <code>hal_dev_uart -i=1073811456</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305;&#xD560; &#xD38C;&#xC6E8;&#xC5B4;&#xC5D0; &#xBD99;&#xC77C; &#xAC00;&#xC0C1;&#xC758; UART&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4; &#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774;&#xC81C; &#xB2E4;&#xB978; &#xD130;&#xBBF8;&#xB110; &#xCC3D;&#xC744; &#xB744;&#xC6CC; <code>docker exec -it halucinator bash</code> &#xB97C; &#xD1B5;&#xD574; build&#xD55C; &#xB3C4;&#xCEE4;&#xC5D0; &#xC811;&#xC18D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; <code>./test/STM32/example/run.sh</code> &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xC608;&#xC81C;&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xB294; MCU&#xB97C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305; &#xD574;&#xC90D;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-comment">#in current terminal</span>
hal_dev_uart -i=<span class="hljs-number">1073811456</span>

<span class="hljs-comment">#in new terminal</span>
docker <span class="hljs-keyword">exec</span> -it halucinator bash
./test/STM32/example/run.sh</code></pre>
<p><img src="/2025/09/14/poosic/[Research]Rehosting/KR/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC804;&#xC5D0; &#xAC00;&#xC0C1;&#xC758; UART&#xB97C; &#xC2E4;&#xD589;&#xD588;&#xB358; &#xCCAB; &#xBC88;&#xC9F8; &#xD130;&#xBBF8;&#xB110;&#xC5D0; <code>hackyboiz</code>&#xB77C;&#xACE0; &#xC785;&#xB825;&#xD558;&#xBA74;, &#xB450; &#xBC88;&#xC9F8; &#xD130;&#xBBF8;&#xB110;&#xC5D0;&#xC11C; &#xAC00;&#xC0C1;&#xD654;&#xB41C; &#xAE30;&#xAE30;&#xAC00; &#xC774; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC218;&#xC2E0;(rx_data)&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="Outro"><a href="#Outro" class="headerlink" title="Outro"></a>Outro</h2><p>&#xC624;&#xB298;&#xC758; &#xC5F0;&#xAD6C;&#xAE00;&#xC740; &#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;! Rehosting&#xBD80;&#xD130; HALucinator&#xC758; &#xAC04;&#xB2E8;&#xD55C; &#xAC1C;&#xC694;&#xAE4C;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xB294;&#xB370;&#xC694;. GDB&#xB85C; &#xC2E4;&#xC81C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAD6C;&#xCD95;&#xD55C; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130;&#xC5D0;&#xC11C; AFL&#xC744; &#xC774;&#xC6A9;&#xD574; Fuzzing &#xD558;&#xB294; &#xBD80;&#xBD84;&#xAE4C;&#xC9C0; &#xB2E4;&#xB8E8;&#xC5B4;&#xBCF4;&#xB824; &#xD588;&#xC9C0;&#xB9CC; &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xD544;&#xC694;&#xD55C; &#xAC1C;&#xB150;&#xB4E4;&#xC744; &#xC8FC;&#xC800;&#xB9AC;&#xC8FC;&#xC800;&#xB9AC; &#xC4F0;&#xB2E4;&#xBCF4;&#xB2C8; &#xAE00; &#xBD84;&#xB7C9;&#xC870;&#xC808; &#xC2E4;&#xD328;&#xC640; &#xC2E4;&#xC81C; binary&#xC5D0; &#xC801;&#xC6A9;&#xD55C; &#xC608;&#xC2DC;&#xB97C; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9AC;&#xB294;&#xAC8C; &#xC870;&#xAE08; &#xB354; &#xD004;&#xB9AC;&#xD2F0; &#xC788;&#xB294; &#xAE00;&#xC774; &#xB420;&#xAC83; &#xAC19;&#xC544; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xC774;&#xC5B4;&#xC9C8; Part2&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! Part2&#xC5D0;&#xC11C;&#xB294; STM32&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC9C1;&#xC811; HAL &#xAC1C;&#xBC1C;&#xB3C4; &#xD574;&#xBCF4;&#xACE0; &#xAC1C;&#xBC1C;&#xD55C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; HALucinator&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD305; &#xD574;&#xBCF4;&#xB294; &#xACFC;&#xC815;&#xACFC; gdb&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC774;&#xB2C8; &#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xB3C4; &#xCC3E;&#xC544;&#xC640; &#xC8FC;&#xC2DC;&#xBA74; &#xAC10;&#xC0AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC0AC;&#xC2E4; HALucinator&#xB97C; &#xC124;&#xCE58;&#xD558;&#xB294; &#xB0B4;&#xC6A9;&#xB610;&#xD55C; Part2&#xC5D0; &#xD3EC;&#xD568;&#xC2DC;&#xD0AC;&#xAE4C; &#xD588;&#xC9C0;&#xB9CC; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; HALucinator github&#xC5D0;&#xC11C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/halucinator/halucinator/blob/master/doc/tutorial/2_run_uart_example.md">tutorial</a>&#xC744; &#xB530;&#xB77C;&#xD574;&#xBCF4;&#xC2DC;&#xBA74; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC544; &#xC774;&#xB807;&#xAC8C; &#xD3EC;&#xD568;&#xC2DC;&#xD0A4;&#xAC8C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC5D0; Windows&#xC5D0;&#xC11C; docker build&#xD558;&#xB294;&#xB370; &#xC2DC;&#xAC04;&#xC744; &#xB9CE;&#xC774; &#xC368;&#xC11C; &#xC124;&#xCE58; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xB9C9;&#xD788;&#xB294; &#xBD84;&#xB4E4;&#xC774; &#xC5C6;&#xAE38; &#xBC14;&#xB77C;&#xB294; &#xB9C8;&#xC74C;&#xC774;&#xC5C8;&#xB2EC;&#xAE4C;&#xC694;&#x2026;?</p>
<p>&#xADF8;&#xB7FC; &#xB2E4;&#xC74C;&#xAE00;&#xB85C; &#xCC3E;&#xC544;&#xBD59;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!</p>
<h2 id="Ref"><a href="#Ref" class="headerlink" title="Ref"></a>Ref</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/halucinator/halucinator">HALucinator github</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.usenix.org/conference/usenixsecurity20/presentation/clements">Usenix-HALucinator: Firmware Re-hosting Through Abstraction Layer Emulation</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/poosic/">poosic</a>
                  
                  <a class="hover-with-bg" href="/tags/Embedded/">Embedded</a>
                  
                  <a class="hover-with-bg" href="/tags/rehosting/">rehosting</a>
                  
                  <a class="hover-with-bg" href="/tags/emulator/">emulator</a>
                  
                  <a class="hover-with-bg" href="/tags/HALucinator/">HALucinator</a>
                  
                  <a class="hover-with-bg" href="/tags/HAL/">HAL</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_poosic.jpg" srcset="/img/loading.gif" alt="poosic">
                  </div>

                  <div class="link-text">
                    <div class="link-title">poosic</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/poosic">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/09/17/newp1ayer48/CVE-2025-6752/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-6752 : Linksys WRT1900ACS, EA7200, EA7450, EA7500 Stack-based Buffer Overflow  RCE </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/09/14/poosic/%5BResearch%5DRehosting/EN/">
                    <span class="hidden-mobile">[Research] Rehosting - Part 1(EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/09/14/poosic/[Research]Rehosting/KR/';
        this.page.identifier = '/2025/09/14/poosic/%5BResearch%5DRehosting/KR/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Rehosting - Part 1(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
