

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://winternl.com/memfuck/&#34;&gt;MemFuck: Bypassing User-Mode Hooks&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xC11C;&amp;#xBB38;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xBB38;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xBB38;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xBB38;&lt;/h2&gt;&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; AV/EDR/MDS&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC728;&amp;#xC774; &amp;#xB192;&amp;#xB2E4;. system call&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD558;&amp;#xB294;  &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; user-level hook&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; hook&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC48;&amp;#xB2E4;. &amp;#xC784;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; API &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs ebnf&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;OpenProcess&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;VirtualAllocEx&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;WriteProcessMemory&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;CreateRemoteThreadEx&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;QueueUserAPC&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;NtAlertResumeThread&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; &amp;#xD638;&amp;#xCD9C;&amp;#xC774;&amp;#xB098; &amp;#xADF8; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xC758; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C; &amp;#xC870;&amp;#xD569;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xC778;&amp;#xC81D;&amp;#xC158;&amp;#xC774;&amp;#xBA70; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD589;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;user-mode hook&amp;#xC740; &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xC640; NGAV, EDR, sandbox, anti-cheat, DRM &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xACFC; &amp;#xD234;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;. user-mode hook&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xACE0;, &amp;#xC548;&amp;#xC815;&amp;#xC801;&amp;#xC774;&amp;#xACE0;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xBA70; &amp;#xC131;&amp;#xB2A5; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&amp;#xAC00; &amp;#xC801;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; user-land hook&amp;#xC740; inline hook&amp;#xC774;&amp;#xBA70; control flow&amp;#xB97C; custom handler&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xD2B8; &amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB300;&amp;#xC0C1; &amp;#xD568;&amp;#xC218; rewrite&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF4;&amp;#xC874;&amp;#xB418;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC798; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;32-bit-Hooks&#34;&gt;&lt;a href=&#34;#32-bit-Hooks&#34; class=&#34;headerlink&#34; title=&#34;32-bit Hooks&#34;&gt;&lt;/a&gt;32-bit Hooks&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image0.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; user-land hook&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAE4A;&amp;#xC740; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; hook &amp;#xD558;&amp;#xBA70; ntdll&amp;#xC5D0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC758;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;(NtQueueApcThread &amp;#xB4F1;)&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; system call&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Ring3 &amp;#xD6C4;&amp;#xD0B9;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; 5&amp;#xB144; &amp;#xB3D9;&amp;#xC548; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB97C; &amp;#xC811;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC778; WoW64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-32&amp;#xBE44;&amp;#xD2B8;-&amp;#xD6C4;&amp;#xD0B9;&#34;&gt;&lt;a href=&#34;#WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-32&amp;#xBE44;&amp;#xD2B8;-&amp;#xD6C4;&amp;#xD0B9;&#34; class=&#34;headerlink&#34; title=&#34;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD6C4;&amp;#xD0B9;&#34;&gt;&lt;/a&gt;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD6C4;&amp;#xD0B9;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB294; Wow64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;(64&amp;#xBE44;&amp;#xD2B8; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;). NGAV&amp;#xC640; EDR&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; hook &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xBBF8;&amp;#xD761;&amp;#xD558;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC740; x86 &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; hook&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;. user-mode hook&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB294; WoW64 layer&amp;#xC5D0; hook&amp;#xC744; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xADF8;&amp;#xAC83;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &lt;a href=&#34;https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/&#34;&gt;Sophos &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0; &amp;#xAD00;&amp;#xD55C; MDSec&amp;#xC758; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xBCF4;&amp;#xC544;&amp;#xB77C;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xB4E4;&amp;#xC774; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; WoW64 &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/&#34;&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC81C;&amp;#xC791;&amp;#xC790;&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://outflank.nl/blog/2019/06/19/red-team-tactics-combining-direct-system-calls-and-srdi-to-bypass-av-edr/&#34;&gt;red-team&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC911;&amp;#xC5D0; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &lt;a href=&#34;https://github.com/rwfpl/rewolf-wow64ext&#34;&gt;rewolf&amp;#x2019;s wow64ext&lt;/a&gt;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB9D0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC694;&amp;#xC57D;-&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&#34;&gt;&lt;a href=&#34;#&amp;#xC694;&amp;#xC57D;-&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC694;&amp;#xC57D; : &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&#34;&gt;&lt;/a&gt;&amp;#xC694;&amp;#xC57D; : &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD568;&amp;#xC218;&amp;#xC758; Ntdll &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://web.archive.org/web/20190407064851/https://blog.ensilo.com/globeimposter-ransomware-technical&#34;&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; Wow64 &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://cdn2.hubspot.net/hubfs/487909/ENSILO%20WHITEPAPER%20ENTER%20THE%20DARK%20GATE.pdf&#34;&gt;&amp;#xC9C1;&amp;#xC811; Syscall &amp;#xD638;&amp;#xCD9C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xBCF8; thunk &amp;#xCD94;&amp;#xC801; (&lt;a href=&#34;https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/&#34;&gt;FireWalker&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/03/hancitor-fileless-attack-with-a-copy-trick/&#34;&gt;&amp;#xBCF4;&amp;#xC870; DLL &amp;#xB9E4;&amp;#xD551;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;Code splicing (byte stealing)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB450; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xBC84;&amp;#xC804;&amp;#xC758; ntdll&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; hook&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xCC30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xB808;&amp;#xBCA8;&amp;#xC758; hook&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; public &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;&amp;#xB3C4; &amp;#xBCF8; &amp;#xC801;&amp;#xC774; &amp;#xC5C6;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB3C4; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD655;&amp;#xC2E0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MemFuck&amp;#xC5D0;-&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#MemFuck&amp;#xC5D0;-&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;MemFuck&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;/a&gt;MemFuck&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;Memfuck&amp;#xC740; &amp;#xC624;&amp;#xC9C1; PoC&amp;#xC774;&amp;#xBA70; production code&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;. &amp;#xC989; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xC720;&amp;#xC800; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; anti-analysis &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MemFuck&amp;#xC740; &amp;#xB2E4;&amp;#xB978; anti-analysis &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD5D8;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;. &amp;#xBCF8;&amp;#xC9C8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xBE44;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE38; &amp;#xC6D0;&amp;#xD588;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; DLL&amp;#xC774;&amp;#xB098; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC218;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC744; attach &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xB294; 2008&amp;#xB144;&amp;#xC5D0; &amp;#xC774; &lt;a href=&#34;https://gynvael.coldwind.pl/?id=93&#34;&gt;&amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; XP&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC740; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xB9CE;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD638;&amp;#xD658;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xC774; ntdll&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xBAA8;&amp;#xB4E0; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; DLL&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xB9DD;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;&lt;/p&gt;
&lt;h2 id=&#34;Unmap-Everything&#34;&gt;&lt;a href=&#34;#Unmap-Everything&#34; class=&#34;headerlink&#34; title=&#34;Unmap Everything&#34;&gt;&lt;/a&gt;Unmap Everything&lt;/h2&gt;&lt;p&gt;MemFuck&amp;#xC740; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; unmap &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; PEB/PEB64, TEB/TEB64&amp;#xC640; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/ns-ntddk-kuser_shared_data&#34;&gt;KUSER_SHARED_DATA&lt;/a&gt; (&amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xB9C8;&amp;#xCE68;&amp;#xB0B4; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;) &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC5D0; NtUnmapViewOfSection&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; x86 &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; ntdll&amp;#xC744; unmap &amp;#xD558;&amp;#xBA74; &amp;#xBB34;&amp;#xC2A8; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;? Ntdll&amp;#xC740; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; unmap &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC790;&amp;#xB294; code segment switching(Heaven&amp;#x2019;s Gate)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; syscall &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC2DC;&amp;#xD5D8;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; 64&amp;#xBE44;&amp;#xD2B8; syscall &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B8; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;64&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC740; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC190;&amp;#xC0C1;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC740; user-mode hook&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xBBF8; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC804;&amp;#xBD80;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; Ring3 hook&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AV/EDR &amp;#xC5C5;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAC00;&amp;#xC815;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;. WoW64 &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; 4GB&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xACC4;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC774; &amp;#xC81C;&amp;#xD55C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;. Alex Ionescu&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;a href=&#34;https://twitter.com/aionescu/status/677599528409677824?lang=en&#34;&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&lt;/a&gt;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; Petr Benes&amp;#xC640; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xD6C4; &amp;#xADF8;&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;10&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;10 Build 19041.508&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;64&amp;#xBE44;&amp;#xD2B8; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntifs/nf-ntifs-ntallocatevirtualmemory&#34;&gt;NtAllocateVirtualMemory&lt;/a&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;a href=&#34;https://github.com/rwfpl/rewolf-wow64ext&#34;&gt;rewolf&amp;#x2019;s wow64ext&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBD24;&amp;#xB2E4;. BaseAddress &amp;#xC694;&amp;#xCCAD;&amp;#xC774; Null&amp;#xC774;&amp;#xBA74; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;&amp;#xB294; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xD638;&amp;#xCD9C;&amp;#xC740; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC798; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD55C;&amp;#xB2E4;. ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xB9DD;&amp;#xCE58;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;? &amp;#xD544;&amp;#xC790;&amp;#xB294; ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; request &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://stackoverflow.com/questions/50429365/what-is-the-most-reliable-portable-way-to-allocate-memory-at-low-addresses-on&#34;&gt;stackoverflow &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xD544;&amp;#xC790;&amp;#xB294; ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; 64&amp;#xBE44;&amp;#xD2B8; NtAllocateVirtual request&amp;#xC5D0; MEM_TOP_DOWN &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0B4;&amp;#xC9DD; &amp;#xB192;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB0AC;&amp;#xB2E4;. &amp;#xC774; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xC790;! &amp;#xD544;&amp;#xC790;&amp;#xB294; BaseAddress&amp;#xB97C; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;(&amp;#xB9CE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; 3&amp;#xAC1C;&amp;#xC758; DLL)&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xACE0; &amp;#xB180;&amp;#xB78D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD589;&amp;#xB3D9;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/jackullrich/ShellcodeStdio&#34;&gt;ShellcodeStdio&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC27D;&amp;#xAC8C; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xACE0; &amp;#xC4F0;&amp;#xC774;&amp;#xBA70; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC5D0; unmap&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC2DC;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC218;&amp;#xB3C4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DEFINE_FUNC_PTR(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntdll.dll&amp;quot;&lt;/span&gt;, NtUnmapViewOfSection);
DEFINE_FUNC_PTR(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntdll.dll&amp;quot;&lt;/span&gt;, NtProtectVirtualMemory);
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (DWORD m = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; m &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;; m += &lt;span class=&#34;hljs-number&#34;&gt;0x1000&lt;/span&gt;)
    {
      PVOID ptrToProtect = (PVOID)m;
      ULONG dwBytesToProtect = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
      ULONG dwOldProt = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
      NtProtectVirtualMemory((HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, &amp;amp;ptrToProtect, &amp;amp;dwBytesToProtect, PAGE_READWRITE, &amp;amp;dwOldProt);
      NtUnmapViewOfSection((HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, (PVOID)m);
    }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5C9;&amp;#xB9DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. anti-analysis&amp;#xC744; &amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC88B;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC774;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC5B8;&amp;#xB85C;&amp;#xB4DC; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. OllyDbg&amp;#xC640; x64dbg &amp;#xAC19;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB4E4;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xACC4;&amp;#xC18D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;An-Interstring-Intermission&#34;&gt;&lt;a href=&#34;#An-Interstring-Intermission&#34; class=&#34;headerlink&#34; title=&#34;An Interstring Intermission&#34;&gt;&lt;/a&gt;An Interstring Intermission&lt;/h2&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC758;&amp;#xB3C4;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xC5D0; &amp;#xAC70;&amp;#xC758; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xC640; &amp;#xBC29;&amp;#xC5B4;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xAC19;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xC774; &amp;#xAE30;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xAC00;&amp;#xC7A5; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/winprog64/exception-handling-under-wow64&#34;&gt;MSDN &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&lt;/a&gt;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;WOW64&amp;#xB294; x86 &amp;#xC608;&amp;#xC678;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC804;&amp;#xC1A1;&amp;#xC73C;&amp;#xB85C; native x64, ia64 &amp;#xB610;&amp;#xB294; ARM64 &amp;#xC608;&amp;#xC678;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; WOW64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xCC29;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC608;&amp;#xC678;&amp;#xB294; native 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC608;&amp;#xC678;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;4GB &amp;#xACBD;&amp;#xACC4; &amp;#xC704;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, 64&amp;#xBE44;&amp;#xD2B8; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xBCA1;&amp;#xD130; &amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC;&amp;#xAE30;(Vectored Exception Handler)&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xBA70; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC608;&amp;#xC678;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xB418;&amp;#xACE0; Control Flow&amp;#xAC00; 64bit VEH&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158; &amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; ntdll&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB410;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC2E0;&amp;#xD588;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; unmap &amp;#xB41C; &amp;#xC608;&amp;#xC678;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC27D;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; WoW64 &amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC7A0;&amp;#xC7AC;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Ntdll-No-More&#34;&gt;&lt;a href=&#34;#Ntdll-No-More&#34; class=&#34;headerlink&#34; title=&#34;Ntdll No More&#34;&gt;&lt;/a&gt;Ntdll No More&lt;/h2&gt;&lt;p&gt;&amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB4E0; ntdll&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xB798; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC11C; WoW64 &amp;#xACC4;&amp;#xCE35;&amp;#xC5D0; &amp;#xB0A8;&amp;#xC740; 3&amp;#xAC1C;&amp;#xC758; dll&amp;#xC744; unmapping &amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xB0A8;&amp;#xC558;&amp;#xB2E4;. WoW64&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC70;&amp;#xC758; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xB2E4;.(WoW64.dll, wow64win.dll, ntdll.dll)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB2C8; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC774; dll&amp;#xB4E4;&amp;#xC744; unmap &amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DWORD64 addrWoW64 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  DWORD64 addrWoW64Win = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  DWORD64 addrNtdll = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  PPEB peb64 = getPEB();
  LIST_ENTRY* first = peb64-&amp;gt;Ldr-&amp;gt;InMemoryOrderModuleList.Flink;
  LIST_ENTRY* ptr = first;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; cntr = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  &lt;span class=&#34;hljs-keyword&#34;&gt;do&lt;/span&gt; {
    LDR_DATA_TABLE_ENTRY* dte = getDataTableEntry(ptr);
    ptr = ptr-&amp;gt;Flink;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) {
      addrNtdll = (DWORD64)dte-&amp;gt;DllBase;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;) {
      addrWoW64 = (DWORD64)dte-&amp;gt;DllBase;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;) {
      addrWoW64Win = (DWORD64)dte-&amp;gt;DllBase;
    }
    cntr++;
  } &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; (ptr != first);
  NtUnmapViewOfSection(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, addrWoW64);
  NtUnmapViewOfSection(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, addrWoW64Win);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; hook&amp;#xC740; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; WoW64 dll(Wow64SystemServiceEx &amp;#xB4F1;)&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xB2E4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC84C;&amp;#xB2E4;. &amp;#xB0A8;&amp;#xC740; &amp;#xC77C;&amp;#xC740; ntdll&amp;#xC744; unmap &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xBD80;&amp;#xBAA8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; NtUnmapViewOfSection&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; system call&amp;#xC744; &amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;64&amp;#xBE44;&amp;#xD2B8; MSVC &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; inline assembly&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; function ordering, &amp;#xB0B4;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC30;&amp;#xCE58; &amp;#xC81C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; system call stub&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; 10 64&amp;#xBE44;&amp;#xD2B8;&amp;#xC758; Syscall stub&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs x86asm&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;mov&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;r10&lt;/span&gt;, &lt;span class=&#34;hljs-built_in&#34;&gt;rcx&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;mov&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;eax&lt;/span&gt;, xxh
&lt;span class=&#34;hljs-keyword&#34;&gt;syscall&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;retn&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;NtdllVirtualMemory&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; DWORD by DWORD&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xB77C;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; typedef prototype&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74; Nt* &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DWORD dwCode1 = &lt;span class=&#34;hljs-number&#34;&gt;0xb8d18b4c&lt;/span&gt;;
  DWORD dwCode2 = &lt;span class=&#34;hljs-number&#34;&gt;0x0000002a&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// syscall code for NtUnmapViewOfSection&lt;/span&gt;
  DWORD dwCode3 = &lt;span class=&#34;hljs-number&#34;&gt;0x90c3050f&lt;/span&gt;;
  &lt;span class=&#34;hljs-comment&#34;&gt;// mov r10, rcx ; 0x4c 0x8b 0xd1&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// mov eax, xxh ; 0xb8 xx 00 00 00&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// syscall ; 0x0f 0x05&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// retn ; 0xc3&lt;/span&gt;
  *(DWORD*)syscallbase = dwCode1;
  *((DWORD*)syscallbase + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) = dwCode2;
  *((DWORD*)syscallbase + &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;) = dwCode3;
  p_SysUnmapViewOfSection sysUnmap = (p_SysUnmapViewOfSection)syscallbase;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; 64&amp;#xBE44;&amp;#xD2B8; ntdll&amp;#xC5D0; &amp;#xB300;&amp;#xD574; NtUnmapViewOfSection&amp;#xC758; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; system call &amp;#xD6C4;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xAC00; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; hook &amp;#xD558;&amp;#xB294; user-mode&amp;#xC5D0; &amp;#xB0A8;&amp;#xC740; &amp;#xAC83;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC785;&amp;#xB41C; DLL&amp;#xC774; unmap &amp;#xB41C;&amp;#xC9C0;&amp;#xB294; &amp;#xC624;&amp;#xB798;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xBD80;&amp;#xD130; Rtl* &amp;#xD568;&amp;#xC218; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC5C6;&amp;#xC774; syscall&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; code injection&amp;#xC774;&amp;#xB098; detected code&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; WoW64&amp;#xC5D0; &amp;#xAD00;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBC30;&amp;#xC6E0;&amp;#xACE0;, &amp;#xD55C;&amp;#xACC4;&amp;#xC810;&amp;#xACFC; &amp;#xD2B9;&amp;#xC774;&amp;#xC810;, 32&amp;#xBE44;&amp;#xD2B8;&amp;#xC640; 64&amp;#xBE44;&amp;#xD2B8; VEH &amp;#xAC19;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD0D0;&amp;#xAD6C; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Source-Code&#34;&gt;&lt;a href=&#34;#Source-Code&#34; class=&#34;headerlink&#34; title=&#34;Source Code&#34;&gt;&lt;/a&gt;Source Code&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/jackullrich/memfuck&#34;&gt;Github &amp;#xC8FC;&amp;#xC18C;&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] MeMFuck: 유저 모드 후킹 우회 - hackyboiz">
  <meta property="og:description" content="&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://winternl.com/memfuck/&#34;&gt;MemFuck: Bypassing User-Mode Hooks&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xC11C;&amp;#xBB38;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xBB38;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xBB38;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xBB38;&lt;/h2&gt;&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; AV/EDR/MDS&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC728;&amp;#xC774; &amp;#xB192;&amp;#xB2E4;. system call&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD558;&amp;#xB294;  &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; user-level hook&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; hook&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC48;&amp;#xB2E4;. &amp;#xC784;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; API &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs ebnf&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;OpenProcess&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;VirtualAllocEx&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;WriteProcessMemory&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;CreateRemoteThreadEx&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;QueueUserAPC&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;NtAlertResumeThread&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; &amp;#xD638;&amp;#xCD9C;&amp;#xC774;&amp;#xB098; &amp;#xADF8; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xC758; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C; &amp;#xC870;&amp;#xD569;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xC778;&amp;#xC81D;&amp;#xC158;&amp;#xC774;&amp;#xBA70; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD589;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD310;&amp;#xB2E8;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;user-mode hook&amp;#xC740; &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xC640; NGAV, EDR, sandbox, anti-cheat, DRM &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xACFC; &amp;#xD234;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;. user-mode hook&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xACE0;, &amp;#xC548;&amp;#xC815;&amp;#xC801;&amp;#xC774;&amp;#xACE0;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xBA70; &amp;#xC131;&amp;#xB2A5; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC;&amp;#xAC00; &amp;#xC801;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xBD80;&amp;#xBD84; user-land hook&amp;#xC740; inline hook&amp;#xC774;&amp;#xBA70; control flow&amp;#xB97C; custom handler&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xD2B8; &amp;#xC2DC;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB300;&amp;#xC0C1; &amp;#xD568;&amp;#xC218; rewrite&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF4;&amp;#xC874;&amp;#xB418;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC798; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;32-bit-Hooks&#34;&gt;&lt;a href=&#34;#32-bit-Hooks&#34; class=&#34;headerlink&#34; title=&#34;32-bit Hooks&#34;&gt;&lt;/a&gt;32-bit Hooks&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image0.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; user-land hook&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAE4A;&amp;#xC740; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; hook &amp;#xD558;&amp;#xBA70; ntdll&amp;#xC5D0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC758;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;(NtQueueApcThread &amp;#xB4F1;)&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;. &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; system call&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Ring3 &amp;#xD6C4;&amp;#xD0B9;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; 5&amp;#xB144; &amp;#xB3D9;&amp;#xC548; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB97C; &amp;#xC811;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC778; WoW64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-32&amp;#xBE44;&amp;#xD2B8;-&amp;#xD6C4;&amp;#xD0B9;&#34;&gt;&lt;a href=&#34;#WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-32&amp;#xBE44;&amp;#xD2B8;-&amp;#xD6C4;&amp;#xD0B9;&#34; class=&#34;headerlink&#34; title=&#34;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD6C4;&amp;#xD0B9;&#34;&gt;&lt;/a&gt;WoW64&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD6C4;&amp;#xD0B9;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xD754;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xB294; Wow64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;(64&amp;#xBE44;&amp;#xD2B8; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;). NGAV&amp;#xC640; EDR&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; hook &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xBBF8;&amp;#xD761;&amp;#xD558;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC740; x86 &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; hook&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;. user-mode hook&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB294; WoW64 layer&amp;#xC5D0; hook&amp;#xC744; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xADF8;&amp;#xAC83;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &lt;a href=&#34;https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/&#34;&gt;Sophos &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0; &amp;#xAD00;&amp;#xD55C; MDSec&amp;#xC758; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xBCF4;&amp;#xC544;&amp;#xB77C;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xB4E4;&amp;#xC774; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; WoW64 &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/&#34;&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC81C;&amp;#xC791;&amp;#xC790;&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://outflank.nl/blog/2019/06/19/red-team-tactics-combining-direct-system-calls-and-srdi-to-bypass-av-edr/&#34;&gt;red-team&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC911;&amp;#xC5D0; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD55C; &lt;a href=&#34;https://github.com/rwfpl/rewolf-wow64ext&#34;&gt;rewolf&amp;#x2019;s wow64ext&lt;/a&gt;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB9D0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC694;&amp;#xC57D;-&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&#34;&gt;&lt;a href=&#34;#&amp;#xC694;&amp;#xC57D;-&amp;#xAE30;&amp;#xC874;-&amp;#xAE30;&amp;#xC220;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC694;&amp;#xC57D; : &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&#34;&gt;&lt;/a&gt;&amp;#xC694;&amp;#xC57D; : &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD568;&amp;#xC218;&amp;#xC758; Ntdll &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://web.archive.org/web/20190407064851/https://blog.ensilo.com/globeimposter-ransomware-technical&#34;&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; Wow64 &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://cdn2.hubspot.net/hubfs/487909/ENSILO%20WHITEPAPER%20ENTER%20THE%20DARK%20GATE.pdf&#34;&gt;&amp;#xC9C1;&amp;#xC811; Syscall &amp;#xD638;&amp;#xCD9C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xBCF8; thunk &amp;#xCD94;&amp;#xC801; (&lt;a href=&#34;https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/&#34;&gt;FireWalker&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/03/hancitor-fileless-attack-with-a-copy-trick/&#34;&gt;&amp;#xBCF4;&amp;#xC870; DLL &amp;#xB9E4;&amp;#xD551;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;Code splicing (byte stealing)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB450; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xBC84;&amp;#xC804;&amp;#xC758; ntdll&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; hook&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xAD00;&amp;#xCC30;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xB808;&amp;#xBCA8;&amp;#xC758; hook&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; public &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;&amp;#xB3C4; &amp;#xBCF8; &amp;#xC801;&amp;#xC774; &amp;#xC5C6;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB3C4; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD655;&amp;#xC2E0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MemFuck&amp;#xC5D0;-&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#MemFuck&amp;#xC5D0;-&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;MemFuck&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&#34;&gt;&lt;/a&gt;MemFuck&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;Memfuck&amp;#xC740; &amp;#xC624;&amp;#xC9C1; PoC&amp;#xC774;&amp;#xBA70; production code&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;. &amp;#xC989; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xC720;&amp;#xC800; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; anti-analysis &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MemFuck&amp;#xC740; &amp;#xB2E4;&amp;#xB978; anti-analysis &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD5D8;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;. &amp;#xBCF8;&amp;#xC9C8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xBE44;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE38; &amp;#xC6D0;&amp;#xD588;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; DLL&amp;#xC774;&amp;#xB098; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC218;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC744; attach &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xB294; 2008&amp;#xB144;&amp;#xC5D0; &amp;#xC774; &lt;a href=&#34;https://gynvael.coldwind.pl/?id=93&#34;&gt;&amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; XP&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC740; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xB9CE;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD638;&amp;#xD658;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xC774; ntdll&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xBAA8;&amp;#xB4E0; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; DLL&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xB9DD;&amp;#xCCD0;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;&lt;/p&gt;
&lt;h2 id=&#34;Unmap-Everything&#34;&gt;&lt;a href=&#34;#Unmap-Everything&#34; class=&#34;headerlink&#34; title=&#34;Unmap Everything&#34;&gt;&lt;/a&gt;Unmap Everything&lt;/h2&gt;&lt;p&gt;MemFuck&amp;#xC740; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC744; unmap &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; PEB/PEB64, TEB/TEB64&amp;#xC640; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/ns-ntddk-kuser_shared_data&#34;&gt;KUSER_SHARED_DATA&lt;/a&gt; (&amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xB9C8;&amp;#xCE68;&amp;#xB0B4; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;) &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC5D0; NtUnmapViewOfSection&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; x86 &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; ntdll&amp;#xC744; unmap &amp;#xD558;&amp;#xBA74; &amp;#xBB34;&amp;#xC2A8; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;? Ntdll&amp;#xC740; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; unmap &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC790;&amp;#xB294; code segment switching(Heaven&amp;#x2019;s Gate)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; syscall &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC2DC;&amp;#xD5D8;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; 64&amp;#xBE44;&amp;#xD2B8; syscall &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC774;&amp;#xC0C1;&amp;#xC801;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B8; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;64&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC740; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC190;&amp;#xC0C1;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC740; user-mode hook&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xBBF8; &amp;#xBB38;&amp;#xC11C;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC804;&amp;#xBD80;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; Ring3 hook&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AV/EDR &amp;#xC5C5;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xAC00;&amp;#xC815;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;. WoW64 &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; 4GB&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xACC4;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC774; &amp;#xC81C;&amp;#xD55C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;. Alex Ionescu&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &lt;a href=&#34;https://twitter.com/aionescu/status/677599528409677824?lang=en&#34;&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&lt;/a&gt;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; Petr Benes&amp;#xC640; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xD6C4; &amp;#xADF8;&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;10&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;10 Build 19041.508&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;64&amp;#xBE44;&amp;#xD2B8; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntifs/nf-ntifs-ntallocatevirtualmemory&#34;&gt;NtAllocateVirtualMemory&lt;/a&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;a href=&#34;https://github.com/rwfpl/rewolf-wow64ext&#34;&gt;rewolf&amp;#x2019;s wow64ext&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBD24;&amp;#xB2E4;. BaseAddress &amp;#xC694;&amp;#xCCAD;&amp;#xC774; Null&amp;#xC774;&amp;#xBA74; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;&amp;#xB294; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xD638;&amp;#xCD9C;&amp;#xC740; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC798; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD55C;&amp;#xB2E4;. ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xB9DD;&amp;#xCE58;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;? &amp;#xD544;&amp;#xC790;&amp;#xB294; ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB192;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; request &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://stackoverflow.com/questions/50429365/what-is-the-most-reliable-portable-way-to-allocate-memory-at-low-addresses-on&#34;&gt;stackoverflow &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&lt;/a&gt;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xD544;&amp;#xC790;&amp;#xB294; ZeroBit &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; 64&amp;#xBE44;&amp;#xD2B8; NtAllocateVirtual request&amp;#xC5D0; MEM_TOP_DOWN &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0B4;&amp;#xC9DD; &amp;#xB192;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB9CC;&amp;#xB0AC;&amp;#xB2E4;. &amp;#xC774; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xC790;! &amp;#xD544;&amp;#xC790;&amp;#xB294; BaseAddress&amp;#xB97C; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;(&amp;#xB9CE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; 3&amp;#xAC1C;&amp;#xC758; DLL)&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xACE0; &amp;#xB180;&amp;#xB78D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; &amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD589;&amp;#xB3D9;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &lt;a href=&#34;https://github.com/jackullrich/ShellcodeStdio&#34;&gt;ShellcodeStdio&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC27D;&amp;#xAC8C; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xACE0; &amp;#xC4F0;&amp;#xC774;&amp;#xBA70; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC5D0; unmap&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC2DC;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC218;&amp;#xB3C4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DEFINE_FUNC_PTR(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntdll.dll&amp;quot;&lt;/span&gt;, NtUnmapViewOfSection);
DEFINE_FUNC_PTR(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntdll.dll&amp;quot;&lt;/span&gt;, NtProtectVirtualMemory);
&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (DWORD m = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; m &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000000&lt;/span&gt;; m += &lt;span class=&#34;hljs-number&#34;&gt;0x1000&lt;/span&gt;)
    {
      PVOID ptrToProtect = (PVOID)m;
      ULONG dwBytesToProtect = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
      ULONG dwOldProt = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
      NtProtectVirtualMemory((HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, &amp;amp;ptrToProtect, &amp;amp;dwBytesToProtect, PAGE_READWRITE, &amp;amp;dwOldProt);
      NtUnmapViewOfSection((HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, (PVOID)m);
    }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5C9;&amp;#xB9DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. anti-analysis&amp;#xC744; &amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC88B;&amp;#xC740; &amp;#xD658;&amp;#xACBD;&amp;#xC774;&amp;#xB2E4;. 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC758; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC2E4;&amp;#xD788; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC5B8;&amp;#xB85C;&amp;#xB4DC; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. OllyDbg&amp;#xC640; x64dbg &amp;#xAC19;&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB4E4;&amp;#xC740; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xACC4;&amp;#xC18D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;An-Interstring-Intermission&#34;&gt;&lt;a href=&#34;#An-Interstring-Intermission&#34; class=&#34;headerlink&#34; title=&#34;An Interstring Intermission&#34;&gt;&lt;/a&gt;An Interstring Intermission&lt;/h2&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xC9C0;&amp;#xC6CC;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC758;&amp;#xB3C4;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xC5D0; &amp;#xAC70;&amp;#xC758; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC5C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xC640; &amp;#xBC29;&amp;#xC5B4;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xAC19;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xC774; &amp;#xAE30;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xAC00;&amp;#xC7A5; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/winprog64/exception-handling-under-wow64&#34;&gt;MSDN &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&lt;/a&gt;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;WOW64&amp;#xB294; x86 &amp;#xC608;&amp;#xC678;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC804;&amp;#xC1A1;&amp;#xC73C;&amp;#xB85C; native x64, ia64 &amp;#xB610;&amp;#xB294; ARM64 &amp;#xC608;&amp;#xC678;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; WOW64&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xCC29;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC608;&amp;#xC678;&amp;#xB294; native 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC608;&amp;#xC678;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;4GB &amp;#xACBD;&amp;#xACC4; &amp;#xC704;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xC258; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, 64&amp;#xBE44;&amp;#xD2B8; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xBCA1;&amp;#xD130; &amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC;&amp;#xAE30;(Vectored Exception Handler)&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xBA70; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xC608;&amp;#xC678;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xB418;&amp;#xACE0; Control Flow&amp;#xAC00; 64bit VEH&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158; &amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; ntdll&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB410;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC2E0;&amp;#xD588;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; unmap &amp;#xB41C; &amp;#xC608;&amp;#xC678;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC27D;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; WoW64 &amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC7A0;&amp;#xC7AC;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Ntdll-No-More&#34;&gt;&lt;a href=&#34;#Ntdll-No-More&#34; class=&#34;headerlink&#34; title=&#34;Ntdll No More&#34;&gt;&lt;/a&gt;Ntdll No More&lt;/h2&gt;&lt;p&gt;&amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB4E0; ntdll&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC6D0;&amp;#xB798; &amp;#xAC1C;&amp;#xB150;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC11C; WoW64 &amp;#xACC4;&amp;#xCE35;&amp;#xC5D0; &amp;#xB0A8;&amp;#xC740; 3&amp;#xAC1C;&amp;#xC758; dll&amp;#xC744; unmapping &amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xB0A8;&amp;#xC558;&amp;#xB2E4;. WoW64&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC70;&amp;#xC758; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xB2E4;.(WoW64.dll, wow64win.dll, ntdll.dll)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB2C8; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC774; dll&amp;#xB4E4;&amp;#xC744; unmap &amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DWORD64 addrWoW64 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  DWORD64 addrWoW64Win = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  DWORD64 addrNtdll = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  PPEB peb64 = getPEB();
  LIST_ENTRY* first = peb64-&amp;gt;Ldr-&amp;gt;InMemoryOrderModuleList.Flink;
  LIST_ENTRY* ptr = first;
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; cntr = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  &lt;span class=&#34;hljs-keyword&#34;&gt;do&lt;/span&gt; {
    LDR_DATA_TABLE_ENTRY* dte = getDataTableEntry(ptr);
    ptr = ptr-&amp;gt;Flink;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) {
      addrNtdll = (DWORD64)dte-&amp;gt;DllBase;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;) {
      addrWoW64 = (DWORD64)dte-&amp;gt;DllBase;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cntr == &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;) {
      addrWoW64Win = (DWORD64)dte-&amp;gt;DllBase;
    }
    cntr++;
  } &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; (ptr != first);
  NtUnmapViewOfSection(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, addrWoW64);
  NtUnmapViewOfSection(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;, addrWoW64Win);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; hook&amp;#xC740; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; WoW64 dll(Wow64SystemServiceEx &amp;#xB4F1;)&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xB2E4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC84C;&amp;#xB2E4;. &amp;#xB0A8;&amp;#xC740; &amp;#xC77C;&amp;#xC740; ntdll&amp;#xC744; unmap &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xBD80;&amp;#xBAA8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; NtUnmapViewOfSection&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; system call&amp;#xC744; &amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;64&amp;#xBE44;&amp;#xD2B8; MSVC &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; inline assembly&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; function ordering, &amp;#xB0B4;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC30;&amp;#xCE58; &amp;#xC81C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; system call stub&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; 10 64&amp;#xBE44;&amp;#xD2B8;&amp;#xC758; Syscall stub&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs x86asm&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;mov&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;r10&lt;/span&gt;, &lt;span class=&#34;hljs-built_in&#34;&gt;rcx&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;mov&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;eax&lt;/span&gt;, xxh
&lt;span class=&#34;hljs-keyword&#34;&gt;syscall&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;retn&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;NtdllVirtualMemory&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; DWORD by DWORD&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xB77C;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; typedef prototype&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74; Nt* &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;DWORD dwCode1 = &lt;span class=&#34;hljs-number&#34;&gt;0xb8d18b4c&lt;/span&gt;;
  DWORD dwCode2 = &lt;span class=&#34;hljs-number&#34;&gt;0x0000002a&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// syscall code for NtUnmapViewOfSection&lt;/span&gt;
  DWORD dwCode3 = &lt;span class=&#34;hljs-number&#34;&gt;0x90c3050f&lt;/span&gt;;
  &lt;span class=&#34;hljs-comment&#34;&gt;// mov r10, rcx ; 0x4c 0x8b 0xd1&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// mov eax, xxh ; 0xb8 xx 00 00 00&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// syscall ; 0x0f 0x05&lt;/span&gt;
  &lt;span class=&#34;hljs-comment&#34;&gt;// retn ; 0xc3&lt;/span&gt;
  *(DWORD*)syscallbase = dwCode1;
  *((DWORD*)syscallbase + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) = dwCode2;
  *((DWORD*)syscallbase + &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;) = dwCode3;
  p_SysUnmapViewOfSection sysUnmap = (p_SysUnmapViewOfSection)syscallbase;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; 64&amp;#xBE44;&amp;#xD2B8; ntdll&amp;#xC5D0; &amp;#xB300;&amp;#xD574; NtUnmapViewOfSection&amp;#xC758; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; system call &amp;#xD6C4;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xAC00; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; hook &amp;#xD558;&amp;#xB294; user-mode&amp;#xC5D0; &amp;#xB0A8;&amp;#xC740; &amp;#xAC83;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC785;&amp;#xB41C; DLL&amp;#xC774; unmap &amp;#xB41C;&amp;#xC9C0;&amp;#xB294; &amp;#xC624;&amp;#xB798;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/01/10/idioth/memfuck/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xBD80;&amp;#xD130; Rtl* &amp;#xD568;&amp;#xC218; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC5C6;&amp;#xC774; syscall&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; code injection&amp;#xC774;&amp;#xB098; detected code&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; WoW64&amp;#xC5D0; &amp;#xAD00;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBC30;&amp;#xC6E0;&amp;#xACE0;, &amp;#xD55C;&amp;#xACC4;&amp;#xC810;&amp;#xACFC; &amp;#xD2B9;&amp;#xC774;&amp;#xC810;, 32&amp;#xBE44;&amp;#xD2B8;&amp;#xC640; 64&amp;#xBE44;&amp;#xD2B8; VEH &amp;#xAC19;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD0D0;&amp;#xAD6C; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Source-Code&#34;&gt;&lt;a href=&#34;#Source-Code&#34; class=&#34;headerlink&#34; title=&#34;Source Code&#34;&gt;&lt;/a&gt;Source Code&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/jackullrich/memfuck&#34;&gt;Github &amp;#xC8FC;&amp;#xC18C;&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/01/10/idioth/memfuck/image4.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/01/10/idioth/memfuck/">

  <title>[Translation] MeMFuck: 유저 모드 후킹 우회 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-01-10 14:00" pubdate>
      2021년 1월 10일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.2k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      64
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] MeMFuck: 유저 모드 후킹 우회</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <blockquote>
<p>&#xC6D0;&#xBB38; &#xAE00; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://winternl.com/memfuck/">MemFuck: Bypassing User-Mode Hooks</a></p>
</blockquote>
<h2 id="&#xC11C;&#xBB38;"><a href="#&#xC11C;&#xBB38;" class="headerlink" title="&#xC11C;&#xBB38;"></a>&#xC11C;&#xBB38;</h2><p>&#xB3D9;&#xC801; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC740; &#xB9CE;&#xC740; AV/EDR/MDS&#xC5D0;&#xC11C; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD0D0;&#xC9C0;&#xD558;&#xB294;&#xB370; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774;&#xB2E4;. &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC740; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB2EC;&#xB9AC; &#xC2E4;&#xD589; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xC708;&#xB3C4;&#xC6B0; API &#xD638;&#xCD9C;&#xC744; &#xCEA1;&#xCC98;&#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD558;&#xBA70; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xBCF4;&#xB2E4; &#xD0D0;&#xC9C0;&#xC728;&#xC774; &#xB192;&#xB2E4;. system call&#xC744; &#xCEA1;&#xCC98;&#xD558;&#xB294;  &#xB9CE;&#xC740; &#xAE30;&#xC220;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; user-level hook&#xC774;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; hook&#xC740; &#xC545;&#xC131; &#xAE30;&#xB2A5;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC744; &#xAC00;&#xB85C;&#xCC48;&#xB2E4;. &#xC784;&#xC758; &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; API &#xD638;&#xCD9C;&#xC758; &#xC2DC;&#xD000;&#xC2A4;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<pre><code class="hljs ebnf"><span class="hljs-attribute">OpenProcess</span>
<span class="hljs-attribute">VirtualAllocEx</span>
<span class="hljs-attribute">WriteProcessMemory</span>
<span class="hljs-attribute">CreateRemoteThreadEx</span>
<span class="hljs-attribute">QueueUserAPC</span>
<span class="hljs-attribute">NtAlertResumeThread</span></code></pre>
<p>&#xC548;&#xD2F0; &#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xB4E4;&#xC740; &#xD638;&#xCD9C;&#xC774;&#xB098; &#xADF8; &#xC870;&#xD569;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC545;&#xC131; &#xD589;&#xC704;&#xB97C; &#xC815;&#xC758;&#xD55C;&#xB2E4;. &#xC548;&#xD2F0; &#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xC758; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xD2B9;&#xC815;&#xD55C; &#xD638;&#xCD9C; &#xC870;&#xD569;&#xC740; &#xCF54;&#xB4DC; &#xC778;&#xC81D;&#xC158;&#xC774;&#xBA70; &#xB300;&#xBD80;&#xBD84; &#xC545;&#xC758;&#xC801;&#xC774;&#xAC70;&#xB098; &#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD589;&#xB3D9;&#xC73C;&#xB85C; &#xD310;&#xB2E8;&#xB41C;&#xB2E4;.</p>
<p>user-mode hook&#xC740; &#xC548;&#xD2F0; &#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xC640; NGAV, EDR, sandbox, anti-cheat, DRM &#xB4F1;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xB9CE;&#xC740; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xACFC; &#xD234;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;. user-mode hook&#xC740; &#xAD6C;&#xD604;&#xD558;&#xAE30; &#xC27D;&#xACE0;, &#xC548;&#xC815;&#xC801;&#xC774;&#xACE0;, &#xAC04;&#xB2E8;&#xD558;&#xBA70; &#xC131;&#xB2A5; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xC801;&#xB2E4;.</p>
<p>&#xB300;&#xBD80;&#xBD84; user-land hook&#xC740; inline hook&#xC774;&#xBA70; control flow&#xB97C; custom handler&#xB85C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xD2B8; &#xC2DC;&#xD0A4;&#xAE30; &#xC704;&#xD55C; &#xB300;&#xC0C1; &#xD568;&#xC218; rewrite&#xB97C; &#xD3EC;&#xD568;&#xD55C;&#xB2E4;. &#xD578;&#xB4E4;&#xB7EC;&#xC758; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB4E4;&#xC740; &#xBCF4;&#xC874;&#xB418;&#xACE0; &#xC694;&#xCCAD;&#xB41C; &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAC70;&#xB098; &#xBD84;&#xC11D;&#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xAC83;&#xB4E4;&#xC740; &#xC798; &#xBB38;&#xC11C;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xB150;&#xC5D0; &#xC775;&#xC219;&#xD560; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xAC00;&#xC815;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<h2 id="32-bit-Hooks"><a href="#32-bit-Hooks" class="headerlink" title="32-bit Hooks"></a>32-bit Hooks</h2><p><img src="/2021/01/10/idioth/memfuck/image0.png" srcset="/img/loading.gif" alt></p>
<p>32&#xBE44;&#xD2B8; user-land hook&#xC774; &#xD3EC;&#xD568;&#xB41C;&#xB2E4;. 32&#xBE44;&#xD2B8; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xC740; &#xB300;&#xBD80;&#xBD84; &#xAC00;&#xB2A5;&#xD55C; &#xAE4A;&#xC740; &#xC704;&#xCE58;&#xC5D0;&#xC11C; hook &#xD558;&#xBA70; ntdll&#xC5D0; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC758;&#xC2EC;&#xC2A4;&#xB7EC;&#xC6B4; &#xD568;&#xC218;&#xB4E4;(NtQueueApcThread &#xB4F1;)&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;. &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xC740; system call&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC6D0;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. Ring3 &#xD6C4;&#xD0B9;&#xC73C;&#xB85C; &#xBAA8;&#xB4E0; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xD544;&#xC790;&#xB294; 5&#xB144; &#xB3D9;&#xC548; 32&#xBE44;&#xD2B8; &#xC708;&#xB3C4;&#xC6B0;&#xB97C; &#xC811;&#xD55C; &#xACBD;&#xC6B0;&#xAC00; &#xD558;&#xB098;&#xB3C4; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xACBD;&#xC6B0;&#xC778; WoW64&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; 32&#xBE44;&#xD2B8; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB300;&#xD574; &#xC0B4;&#xD3B4;&#xBCFC; &#xAC83;&#xC774;&#xB2E4;.</p>
<h2 id="WoW64&#xC5D0;&#xC11C;&#xC758;-32&#xBE44;&#xD2B8;-&#xD6C4;&#xD0B9;"><a href="#WoW64&#xC5D0;&#xC11C;&#xC758;-32&#xBE44;&#xD2B8;-&#xD6C4;&#xD0B9;" class="headerlink" title="WoW64&#xC5D0;&#xC11C;&#xC758; 32&#xBE44;&#xD2B8; &#xD6C4;&#xD0B9;"></a>WoW64&#xC5D0;&#xC11C;&#xC758; 32&#xBE44;&#xD2B8; &#xD6C4;&#xD0B9;</h2><p><img src="/2021/01/10/idioth/memfuck/image1.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC00;&#xC7A5; &#xD754;&#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB294; Wow64&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; 32&#xBE44;&#xD2B8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xB2E4;(64&#xBE44;&#xD2B8; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;). NGAV&#xC640; EDR&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0;&#xC11C;&#xC758; hook &#xAD6C;&#xD604;&#xC774; &#xBBF8;&#xD761;&#xD558;&#xB2E4;. &#xB300;&#xBD80;&#xBD84; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xC740; x86 &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xC601;&#xC5ED;&#xC5D0;&#xC11C;&#xB9CC; hook&#xC744; &#xD55C;&#xB2E4;. user-mode hook&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xC548;&#xD2F0;&#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xB294; WoW64 layer&#xC5D0; hook&#xC744; &#xC704;&#xCE58;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC9C0;&#xB9CC; &#xBAA8;&#xB4E0; &#xC5C5;&#xCCB4;&#xAC00; &#xADF8;&#xAC83;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xB294;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/">Sophos &#xC6B0;&#xD68C;&#xC5D0; &#xAD00;&#xD55C; MDSec&#xC758; &#xAC8C;&#xC2DC;&#xAE00;</a>&#xC744; &#xBCF4;&#xC544;&#xB77C;.</p>
<p>&#xB9CE;&#xC740; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xB4E4;&#xC774; 32&#xBE44;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; WoW64 &#xC2E4;&#xD589;&#xC744; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC740; &#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xC54C;&#xB824;&#xC838; &#xC788;&#xC5C8;&#xACE0; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/">&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC81C;&#xC791;&#xC790;</a>&#xC640; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://outflank.nl/blog/2019/06/19/red-team-tactics-combining-direct-system-calls-and-srdi-to-bypass-av-edr/">red-team</a>&#xC5D0; &#xC758;&#xD574; &#xACF5;&#xACA9;&#xB2F9;&#xD588;&#xB2E4;. &#xD544;&#xC790;&#xAC00; &#xBD84;&#xC11D;&#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC911;&#xC5D0; &#xC5BC;&#xB9C8;&#xB098; &#xB9CE;&#xC740; &#xAC83;&#xB4E4;&#xC774; &#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/rwfpl/rewolf-wow64ext">rewolf&#x2019;s wow64ext</a>&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294;&#xC9C0; &#xB9D0;&#xD560; &#xC218; &#xC5C6;&#xB2E4;.</p>
<h2 id="&#xC694;&#xC57D;-&#xAE30;&#xC874;-&#xAE30;&#xC220;"><a href="#&#xC694;&#xC57D;-&#xAE30;&#xC874;-&#xAE30;&#xC220;" class="headerlink" title="&#xC694;&#xC57D; : &#xAE30;&#xC874; &#xAE30;&#xC220;"></a>&#xC694;&#xC57D; : &#xAE30;&#xC874; &#xAE30;&#xC220;</h2><ul>
<li>&#xB2E8;&#xC21C;&#xD788; &#xD568;&#xC218;&#xC758; Ntdll &#xBC84;&#xC804;&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://web.archive.org/web/20190407064851/https://blog.ensilo.com/globeimposter-ransomware-technical">&#xD568;&#xC218;&#xC758; Wow64 &#xBC84;&#xC804;&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cdn2.hubspot.net/hubfs/487909/ENSILO%20WHITEPAPER%20ENTER%20THE%20DARK%20GATE.pdf">&#xC9C1;&#xC811; Syscall &#xD638;&#xCD9C;</a></li>
<li>&#xC6D0;&#xBCF8; thunk &#xCD94;&#xC801; (<a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.mdsec.co.uk/2020/08/firewalker-a-new-approach-to-generically-bypass-user-space-edr-hooking/">FireWalker</a>)</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.malwarebytes.com/threat-analysis/2018/03/hancitor-fileless-attack-with-a-copy-trick/">&#xBCF4;&#xC870; DLL &#xB9E4;&#xD551;</a></li>
<li>Code splicing (byte stealing)</li>
</ul>
<p>&#xBAA8;&#xB450; &#xC798; &#xC791;&#xB3D9;&#xD558;&#xACE0; &#xC88B;&#xC9C0;&#xB9CC; 64&#xBE44;&#xD2B8; &#xBC84;&#xC804;&#xC758; ntdll&#xC5D0; &#xC704;&#xCE58;&#xD55C; hook&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xB2E4;. &#xD544;&#xC790;&#xC758; &#xAD00;&#xCC30;&#xC5D0;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xB808;&#xBCA8;&#xC758; hook&#xC740; &#xC5B4;&#xB5A4; public &#xCF54;&#xB4DC;&#xB85C;&#xB3C4; &#xBCF8; &#xC801;&#xC774; &#xC5C6;&#xACE0; &#xC5B4;&#xB5A4; &#xC548;&#xD2F0;&#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xB3C4; &#xAD6C;&#xD604;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xBA87; &#xAC00;&#xC9C0; &#xC874;&#xC7AC;&#xD560; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xD655;&#xC2E0;&#xD558;&#xC9C0;&#xB9CC; &#xBCF4;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;.</p>
<h2 id="MemFuck&#xC5D0;-&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;"><a href="#MemFuck&#xC5D0;-&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;" class="headerlink" title="MemFuck&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xBA70;"></a>MemFuck&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xBA70;</h2><p>Memfuck&#xC740; &#xC624;&#xC9C1; PoC&#xC774;&#xBA70; production code&#xC640; &#xC720;&#xC0AC;&#xD558;&#xC9C0; &#xC54A;&#xB2E4;. &#xC989; &#xD544;&#xC790;&#xB294; &#xC720;&#xC800; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xAC00;&#xB2A5;&#xD55C; &#xAC15;&#xB825;&#xD55C; anti-analysis &#xAE30;&#xC220;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xB2E4;.</p>
<p>MemFuck&#xC740; &#xB2E4;&#xB978; anti-analysis &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC2E4;&#xD5D8;&#xC744; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xBCF8;&#xC9C8;&#xC801;&#xC73C;&#xB85C; &#xAC00;&#xB2A5;&#xD55C; &#xD55C; &#xBE44;&#xC5B4;&#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE38; &#xC6D0;&#xD588;&#xC73C;&#xBBC0;&#xB85C; DLL&#xC774;&#xB098; &#xC258; &#xCF54;&#xB4DC;&#xC758; &#xC218;&#xC815; &#xC5C6;&#xC774; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xC744; attach &#xD560; &#xC218; &#xC5C6;&#xC5C8;&#xB2E4;. &#xD544;&#xC790;&#xB294; 2008&#xB144;&#xC5D0; &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://gynvael.coldwind.pl/?id=93">&#xAC8C;&#xC2DC;&#xAE00;</a>&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xB294;&#xB370; &#xB9E4;&#xC6B0; &#xD765;&#xBBF8;&#xB85C;&#xC6E0;&#xB2E4;. &#xBB3C;&#xB860; 32&#xBE44;&#xD2B8; &#xC708;&#xB3C4;&#xC6B0; XP&#xC5D0;&#xC11C; &#xB9CE;&#xC740; &#xBCC0;&#xD654;&#xAC00; &#xC788;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C; &#xB9CE;&#xC740; &#xCF54;&#xB4DC;&#xAC00; &#xD638;&#xD658;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xAC1C;&#xB150;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;.</p>
<p><img src="/2021/01/10/idioth/memfuck/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB34;&#xC5C7;&#xC774; ntdll&#xC744; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294;&#xAC00;? &#xBAA8;&#xB4E0; &#xACB0;&#xACFC;&#xB294; &#xD2B9;&#xC815;&#xD55C; DLL&#xC5D0; &#xC758;&#xC874;&#xD558;&#xBBC0;&#xB85C; &#xC774;&#xB97C; &#xB9DD;&#xCCD0;&#xBC84;&#xB9AC;&#xBA74; &#xC5B4;&#xB5A0;&#xD55C; &#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB0A0;&#xAE4C;</p>
<h2 id="Unmap-Everything"><a href="#Unmap-Everything" class="headerlink" title="Unmap Everything"></a>Unmap Everything</h2><p>MemFuck&#xC740; 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xAC00;&#xB2A5;&#xD55C; &#xBAA8;&#xB4E0; &#xAC83;&#xC744; unmap &#xD558;&#xB294; &#xAC83;&#xC5D0; &#xC758;&#xD574; &#xC2DC;&#xC791;&#xB41C;&#xB2E4;. &#xBB3C;&#xB860; PEB/PEB64, TEB/TEB64&#xC640; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/ns-ntddk-kuser_shared_data">KUSER_SHARED_DATA</a> (&#xC791;&#xB144;&#xC5D0; &#xB9C8;&#xCE68;&#xB0B4; &#xBB38;&#xC11C;&#xD654;&#xB418;&#xC5C8;&#xB2E4;) &#xAC19;&#xC774; &#xD574;&#xC81C;&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xB4E4;&#xB3C4; &#xC788;&#xB2E4;. &#xC774;&#xC5D0; &#xB300;&#xD574; &#xBA87; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xAC00;&#xB2A5;&#xD55C; &#xADC0;&#xCC2E;&#xC9C0; &#xC54A;&#xC740; &#xBC29;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xBAA8;&#xB4E0; &#xAC83;&#xC5D0; NtUnmapViewOfSection&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; x86 &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xD560;&#xB2F9;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xADF8;&#xB807;&#xAC8C; ntdll&#xC744; unmap &#xD558;&#xBA74; &#xBB34;&#xC2A8; &#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB0A0;&#xAE4C;? Ntdll&#xC740; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC744; unmap &#xD560; &#xC218; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; &#xC774; &#xBC29;&#xBC95;&#xC740; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xD544;&#xC790;&#xB294; code segment switching(Heaven&#x2019;s Gate)&#xC744; &#xD1B5;&#xD574; &#xC9C1;&#xC811; syscall &#xD638;&#xCD9C;&#xC744; &#xC2DC;&#xD5D8;&#xD574;&#xBCF4;&#xC558;&#xB2E4;. 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; 64&#xBE44;&#xD2B8; syscall &#xC2E4;&#xD589;&#xC740; &#xCDA9;&#xBD84;&#xD788; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xBC29;&#xBC95;&#xC740; &#xBA87; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; &#xC774;&#xC0C1;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;.</p>
<ul>
<li>32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xCF54;&#xB4DC;&#xAC00; &#xB9E4;&#xD551;&#xB418;&#xACE0; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC26C;&#xC6B8; &#xAC83;&#xC774;&#xB2E4;.</li>
<li>64&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC740; &#xC5EC;&#xC804;&#xD788; &#xC190;&#xC0C1;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xB2E4;.</li>
<li>&#xC774; &#xAE30;&#xC220;&#xC740; user-mode hook&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xD6A8;&#xACFC;&#xC801;&#xC774;&#xC9C0;&#xB9CC; &#xC774;&#xBBF8; &#xBB38;&#xC11C;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;.</li>
</ul>
<p>&#xC804;&#xBD80;&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xB300;&#xBD80;&#xBD84; Ring3 hook&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; AV/EDR &#xC5C5;&#xCCB4;&#xB4E4;&#xC740; &#xD558;&#xB098;&#xC758; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xAC00;&#xC815;&#xC744; &#xD55C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xB2E4;. WoW64 &#xC704;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; 32&#xBE44;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; 4GB&#xB85C; &#xC81C;&#xD55C;&#xB41C; &#xC8FC;&#xC18C; &#xC544;&#xB798;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xAC00;&#xC9C4;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xB9E4;&#xD551;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xCF54;&#xB4DC;&#xB97C; &#xB354; &#xB9CE;&#xC774; &#xBC30;&#xCE58;&#xD558;&#xACE0; &#xAE30;&#xB2A5;&#xC744; &#xACC4;&#xC18D;&#xD560; &#xC218; &#xC788;&#xB294; &#xC774; &#xC81C;&#xD55C; &#xC774;&#xC0C1;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD574;&#xBCF4;&#xC790;. Alex Ionescu&#xC5D0; &#xB530;&#xB974;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://twitter.com/aionescu/status/677599528409677824?lang=en">&#xC774;&#xAC83;&#xC740; &#xAC00;&#xB2A5;&#xD558;&#xC9C0; &#xC54A;&#xB2E4;</a>. &#xADF8;&#xB7EC;&#xB098; Petr Benes&#xC640; &#xC598;&#xAE30;&#xD55C; &#xD6C4; &#xADF8;&#xB294; &#xCD5C;&#xADFC; &#xBC84;&#xC804;&#xC758; &#xC708;&#xB3C4;&#xC6B0;10&#xC5D0;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xC81C;&#xD55C;&#xC774; &#xD574;&#xC81C;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xB2E4;. &#xC708;&#xB3C4;&#xC6B0;10 Build 19041.508&#xC5D0;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8;&#xD588;&#xB2E4;.</p>
<p>64&#xBE44;&#xD2B8; &#xBC84;&#xC804;&#xC758; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/ntifs/nf-ntifs-ntallocatevirtualmemory">NtAllocateVirtualMemory</a> &#xD638;&#xCD9C;&#xD558;&#xAE30; &#xC704;&#xD574; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/rwfpl/rewolf-wow64ext">rewolf&#x2019;s wow64ext</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;. &#xD544;&#xC790;&#xAC00; &#xCC98;&#xC74C; &#xD638;&#xCD9C;&#xC744; &#xC2DC;&#xB3C4;&#xD588;&#xC744; &#xB54C; &#xD63C;&#xB780;&#xC2A4;&#xB7EC;&#xC6B4; &#xACB0;&#xACFC;&#xB97C; &#xBD24;&#xB2E4;. BaseAddress &#xC694;&#xCCAD;&#xC774; Null&#xC774;&#xBA74; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC; &#xD560;&#xB2F9;&#xD560; &#xC704;&#xCE58;&#xB97C; &#xACB0;&#xC815;&#xD55C;&#xB2E4;. &#xBB3C;&#xB860; &#xC708;&#xB3C4;&#xC6B0;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xC788;&#xC5B4;&#xC11C;&#xB294; &#xC548; &#xB418;&#xB294; &#xACF3;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; 64&#xBE44;&#xD2B8; &#xD638;&#xCD9C;&#xC740; 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC5D0; &#xC798; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xBC18;&#xD658;&#xD55C;&#xB2E4;. ZeroBit &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xB9DD;&#xCE58;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB5A8;&#xAE4C;? &#xD544;&#xC790;&#xB294; ZeroBit &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC870;&#xC791;&#xD574;&#xC11C; &#xAC00;&#xB2A5;&#xD55C; &#xB192;&#xC740; &#xC8FC;&#xC18C;&#xC5D0; request &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://stackoverflow.com/questions/50429365/what-is-the-most-reliable-portable-way-to-allocate-memory-at-low-addresses-on">stackoverflow &#xAC8C;&#xC2DC;&#xAE00;</a>&#xC744; &#xCC3E;&#xC558;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD544;&#xC790;&#xB294; ZeroBit &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC870;&#xC791;&#xD558;&#xC5EC; 64&#xBE44;&#xD2B8; NtAllocateVirtual request&#xC5D0; MEM_TOP_DOWN &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xCD94;&#xAC00;&#xD574;&#xBCF4;&#xC558;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC0B4;&#xC9DD; &#xB192;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C;&#xB97C; &#xB9CC;&#xB0AC;&#xB2E4;. &#xC774; &#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC870;&#xC791;&#xD558;&#xB294; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC5BB;&#xC5C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xB97C; &#xC694;&#xCCAD;&#xD558;&#xC790;! &#xD544;&#xC790;&#xB294; BaseAddress&#xB97C; 64&#xBE44;&#xD2B8; &#xC8FC;&#xC18C;(&#xB9CE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; 3&#xAC1C;&#xC758; DLL)&#xB85C; &#xC124;&#xC815;&#xD588;&#xACE0; &#xB180;&#xB78D;&#xAC8C;&#xB3C4; &#xADF8; &#xC8FC;&#xC18C;&#xC5D0; &#xD560;&#xB2F9;&#xB410;&#xB2E4;.</p>
<p><img src="/2021/01/10/idioth/memfuck/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xBB3C;&#xB860; &#xC5EC;&#xAE30;&#xC11C; &#xC6B0;&#xB9AC;&#xAC00; &#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xD574;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xC5EC;&#xAE30;&#xC5D0; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC368;&#xC11C; &#xC5B4;&#xB5A0;&#xD55C; &#xD589;&#xB3D9;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xB294;&#xC9C0; &#xBCF4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/jackullrich/ShellcodeStdio">ShellcodeStdio</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xBE60;&#xB974;&#xACE0; &#xC27D;&#xAC8C; 64&#xBE44;&#xD2B8; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD588;&#xB2E4;. &#xC774; &#xC258; &#xCF54;&#xB4DC;&#xB294; 64&#xBE44;&#xD2B8; &#xACF5;&#xAC04;&#xC5D0; &#xD560;&#xB2F9;&#xB418;&#xACE0; &#xC4F0;&#xC774;&#xBA70; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; 32&#xBE44;&#xD2B8; &#xC720;&#xC800; &#xBAA8;&#xB4DC;&#xC758; &#xBAA8;&#xB4E0; &#xAC83;&#xC5D0; unmap&#xC744; &#xC2DC;&#xB3C4;&#xD55C;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC2DC;&#xB3C4;&#xC5D0; &#xB300;&#xD55C; &#xC218;&#xB3C4; &#xCF54;&#xB4DC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xB2E4;.</p>
<pre><code class="hljs cpp">DEFINE_FUNC_PTR(<span class="hljs-string">&quot;ntdll.dll&quot;</span>, NtUnmapViewOfSection);
DEFINE_FUNC_PTR(<span class="hljs-string">&quot;ntdll.dll&quot;</span>, NtProtectVirtualMemory);
<span class="hljs-keyword">for</span> (DWORD m = <span class="hljs-number">0</span>; m &lt; <span class="hljs-number">0x80000000</span>; m += <span class="hljs-number">0x1000</span>)
    {
      PVOID ptrToProtect = (PVOID)m;
      ULONG dwBytesToProtect = <span class="hljs-number">1</span>;
      ULONG dwOldProt = <span class="hljs-number">0</span>;
      NtProtectVirtualMemory((HANDLE)<span class="hljs-number">-1</span>, &amp;ptrToProtect, &amp;dwBytesToProtect, PAGE_READWRITE, &amp;dwOldProt);
      NtUnmapViewOfSection((HANDLE)<span class="hljs-number">-1</span>, (PVOID)m);
    }</code></pre>
<p><img src="/2021/01/10/idioth/memfuck/image4.png" srcset="/img/loading.gif" alt></p>
<p>&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5C9;&#xB9DD;&#xC774;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC5EC;&#xC804;&#xD788; &#xCF54;&#xB4DC;&#xB294; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xC73C;&#xBA70; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB2E4;. anti-analysis&#xC744; &#xD558;&#xAE30;&#xC5D0; &#xC0C1;&#xB2F9;&#xD788; &#xC88B;&#xC740; &#xD658;&#xACBD;&#xC774;&#xB2E4;. 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC758; &#xC644;&#xC804;&#xD55C; &#xC81C;&#xC5B4;&#xB97C; &#xAC16;&#xACE0; &#xC6B0;&#xB9AC;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC2E4;&#xD788; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC5B8;&#xB85C;&#xB4DC; &#xD560; &#xC218; &#xC788;&#xB2E4;. OllyDbg&#xC640; x64dbg &#xAC19;&#xC740; &#xB9CE;&#xC740; &#xB514;&#xBC84;&#xAC70;&#xB4E4;&#xC740; &#xC5EC;&#xAE30;&#xC11C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB098;&#xC11C; &#xBD84;&#xC11D;&#xC744; &#xACC4;&#xC18D;&#xD558;&#xAE30; &#xC704;&#xD574; Windbg&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;.</p>
<h2 id="An-Interstring-Intermission"><a href="#An-Interstring-Intermission" class="headerlink" title="An Interstring Intermission"></a>An Interstring Intermission</h2><p>&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; 32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xC601;&#xC5ED;&#xC744; &#xC644;&#xC804;&#xD788; &#xC9C0;&#xC6CC;&#xBC84;&#xB9AC;&#xBA74;&#xC11C; &#xCF54;&#xB4DC;&#xB294; &#xC758;&#xB3C4;&#xB300;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xB3D9;&#xC791;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xBAA9;&#xD45C;&#xC5D0; &#xAC70;&#xC758; &#xC131;&#xACF5;&#xD588;&#xC5C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xACF5;&#xACA9;&#xC801;&#xC778; &#xACB0;&#xACFC;&#xC640; &#xBC29;&#xC5B4;&#xC801;&#xC778; &#xACB0;&#xACFC;&#xAC00; &#xAC19;&#xC774; &#xC788;&#xB2E4;. &#xC544;&#xB9C8; &#xC774; &#xAE30;&#xAC04; &#xB3D9;&#xC548; &#xAC00;&#xC7A5; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC0AC;&#xC2E4; &#xC911; &#xD558;&#xB098;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows/win32/winprog64/exception-handling-under-wow64">MSDN &#xD398;&#xC774;&#xC9C0;</a>&#xB97C; &#xBC1C;&#xACAC;&#xD588;&#xC744; &#xB54C;&#xC774;&#xB2E4;.</p>
<blockquote>
<p>WOW64&#xB294; x86 &#xC608;&#xC678;&#xC5D0; &#xB300;&#xD55C; &#xC804;&#xC1A1;&#xC73C;&#xB85C; native x64, ia64 &#xB610;&#xB294; ARM64 &#xC608;&#xC678;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; WOW64&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; 32&#xBE44;&#xD2B8; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xD3EC;&#xCC29;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC608;&#xC678;&#xB294; native 64&#xBE44;&#xD2B8; &#xC608;&#xC678;&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;.</p>
</blockquote>
<p>4GB &#xACBD;&#xACC4; &#xC704;&#xC758; &#xC8FC;&#xC18C;&#xC5D0; 64&#xBE44;&#xD2B8; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC4F8; &#xC218; &#xC788;&#xB294;&#xB370;, 64&#xBE44;&#xD2B8; &#xACF5;&#xAC04;&#xC5D0; 64&#xBE44;&#xD2B8; &#xBCA1;&#xD130; &#xC608;&#xC678; &#xCC98;&#xB9AC;&#xAE30;(Vectored Exception Handler)&#xB97C; &#xC124;&#xCE58;&#xD558;&#xBA70; 32&#xBE44;&#xD2B8; &#xC608;&#xC678;&#xC5D0; &#xC758;&#xD574; &#xD2B8;&#xB9AC;&#xAC70; &#xB418;&#xACE0; Control Flow&#xAC00; 64bit VEH&#xC5D0; &#xC758;&#xD574; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158; &#xB41C;&#xB2E4;.</p>
<p><img src="/2021/01/10/idioth/memfuck/image5.png" srcset="/img/loading.gif" alt></p>
<p>32&#xBE44;&#xD2B8; ntdll&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xC5B4; &#xC81C;&#xB300;&#xB85C; &#xB410;&#xC74C;&#xC744; &#xD655;&#xC2E0;&#xD588;&#xB2E4;. &#xBAA8;&#xB4E0; &#xAC83;&#xC774; unmap &#xB41C; &#xC608;&#xC678;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC27D;&#xC9C0;&#xB9CC; &#xCC98;&#xB9AC;&#xD560; WoW64 &#xB808;&#xC774;&#xC5B4;&#xB85C; &#xC804;&#xD658;&#xD560; &#xCF54;&#xB4DC;&#xAC00; &#xC5C6;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xC5D0;&#xB294; &#xB9CE;&#xC740; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC7A0;&#xC7AC;&#xB825;&#xC774; &#xC788;&#xB2E4;.</p>
<h2 id="Ntdll-No-More"><a href="#Ntdll-No-More" class="headerlink" title="Ntdll No More"></a>Ntdll No More</h2><p>&#xB354; &#xC774;&#xC0C1; &#xC5B4;&#xB5A4; &#xBAA9;&#xC801;&#xC744; &#xC704;&#xD574;&#xC11C;&#xB4E0; ntdll&#xC5D0; &#xC758;&#xC874;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC6D0;&#xB798; &#xAC1C;&#xB150;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xC11C; WoW64 &#xACC4;&#xCE35;&#xC5D0; &#xB0A8;&#xC740; 3&#xAC1C;&#xC758; dll&#xC744; unmapping &#xD558;&#xB294; &#xC77C;&#xC774; &#xB0A8;&#xC558;&#xB2E4;. WoW64&#xB294; &#xB300;&#xBD80;&#xBD84; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xAC70;&#xC758; &#xB3D9;&#xC77C;&#xD558;&#xB2E4;.(WoW64.dll, wow64win.dll, ntdll.dll)</p>
<p><img src="/2021/01/10/idioth/memfuck/image6.png" srcset="/img/loading.gif" alt></p>
<p>32&#xBE44;&#xD2B8; &#xCF54;&#xB4DC;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB2C8; &#xB354; &#xC774;&#xC0C1; &#xD544;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC774; dll&#xB4E4;&#xC744; unmap &#xD558;&#xC790;.</p>
<pre><code class="hljs cpp">DWORD64 addrWoW64 = <span class="hljs-number">0</span>;
  DWORD64 addrWoW64Win = <span class="hljs-number">0</span>;
  DWORD64 addrNtdll = <span class="hljs-number">0</span>;
  PPEB peb64 = getPEB();
  LIST_ENTRY* first = peb64-&gt;Ldr-&gt;InMemoryOrderModuleList.Flink;
  LIST_ENTRY* ptr = first;
  <span class="hljs-keyword">int</span> cntr = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">do</span> {
    LDR_DATA_TABLE_ENTRY* dte = getDataTableEntry(ptr);
    ptr = ptr-&gt;Flink;
    <span class="hljs-keyword">if</span> (cntr == <span class="hljs-number">1</span>) {
      addrNtdll = (DWORD64)dte-&gt;DllBase;
    }
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (cntr == <span class="hljs-number">2</span>) {
      addrWoW64 = (DWORD64)dte-&gt;DllBase;
    }
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (cntr == <span class="hljs-number">3</span>) {
      addrWoW64Win = (DWORD64)dte-&gt;DllBase;
    }
    cntr++;
  } <span class="hljs-keyword">while</span> (ptr != first);
  NtUnmapViewOfSection(<span class="hljs-number">-1</span>, addrWoW64);
  NtUnmapViewOfSection(<span class="hljs-number">-1</span>, addrWoW64Win);</code></pre>
<p><img src="/2021/01/10/idioth/memfuck/image7.png" srcset="/img/loading.gif" alt></p>
<p>32&#xBE44;&#xD2B8; &#xC8FC;&#xC18C; &#xACF5;&#xAC04;&#xC5D0; &#xB354; &#xC774;&#xC0C1; hook&#xC740; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; WoW64 dll(Wow64SystemServiceEx &#xB4F1;)&#xC5D0; &#xC788;&#xB294; &#xAC83;&#xB3C4; &#xB2E4; &#xC0AC;&#xB77C;&#xC84C;&#xB2E4;. &#xB0A8;&#xC740; &#xC77C;&#xC740; ntdll&#xC744; unmap &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xBD80;&#xBAA8; &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; NtUnmapViewOfSection&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC0DD;&#xACBC;&#xB2E4;. &#xC9C1;&#xC811; system call&#xC744; &#xD558;&#xC790;.</p>
<p>64&#xBE44;&#xD2B8; MSVC &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; inline assembly&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; function ordering, &#xB0B4;&#xBD80; &#xCF54;&#xB4DC; &#xBC30;&#xCE58; &#xC81C;&#xD55C;&#xC73C;&#xB85C; &#xC778;&#xD574; system call stub&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xD560;&#xB2F9;&#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xB2E4;. &#xC708;&#xB3C4;&#xC6B0; 10 64&#xBE44;&#xD2B8;&#xC758; Syscall stub&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xB2E4;.</p>
<pre><code class="hljs x86asm"><span class="hljs-keyword">mov</span> <span class="hljs-built_in">r10</span>, <span class="hljs-built_in">rcx</span>
<span class="hljs-keyword">mov</span> <span class="hljs-built_in">eax</span>, xxh
<span class="hljs-keyword">syscall</span>
<span class="hljs-keyword">retn</span></code></pre>
<p>NtdllVirtualMemory&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xACE0; DWORD by DWORD&#xB85C; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD574;&#xB77C;. &#xADF8;&#xB9AC;&#xACE0; typedef prototype&#xC744; &#xD560;&#xB2F9;&#xD558;&#xBA74; Nt* &#xD568;&#xC218;&#xB97C; &#xC27D;&#xAC8C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<pre><code class="hljs cpp">DWORD dwCode1 = <span class="hljs-number">0xb8d18b4c</span>;
  DWORD dwCode2 = <span class="hljs-number">0x0000002a</span>; <span class="hljs-comment">// syscall code for NtUnmapViewOfSection</span>
  DWORD dwCode3 = <span class="hljs-number">0x90c3050f</span>;
  <span class="hljs-comment">// mov r10, rcx ; 0x4c 0x8b 0xd1</span>
  <span class="hljs-comment">// mov eax, xxh ; 0xb8 xx 00 00 00</span>
  <span class="hljs-comment">// syscall ; 0x0f 0x05</span>
  <span class="hljs-comment">// retn ; 0xc3</span>
  *(DWORD*)syscallbase = dwCode1;
  *((DWORD*)syscallbase + <span class="hljs-number">1</span>) = dwCode2;
  *((DWORD*)syscallbase + <span class="hljs-number">2</span>) = dwCode3;
  p_SysUnmapViewOfSection sysUnmap = (p_SysUnmapViewOfSection)syscallbase;</code></pre>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; 64&#xBE44;&#xD2B8; ntdll&#xC5D0; &#xB300;&#xD574; NtUnmapViewOfSection&#xC758; &#xC9C1;&#xC811;&#xC801;&#xC778; system call &#xD6C4;&#xC5D0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xB294; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC5C6;&#xB2E4;. &#xC548;&#xD2F0; &#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xAC00; &#xC2DC;&#xB3C4;&#xD558;&#xACE0; hook &#xD558;&#xB294; user-mode&#xC5D0; &#xB0A8;&#xC740; &#xAC83;&#xC774; &#xC5C6;&#xB2E4;. &#xC8FC;&#xC785;&#xB41C; DLL&#xC774; unmap &#xB41C;&#xC9C0;&#xB294; &#xC624;&#xB798;&#xB410;&#xB2E4;.</p>
<p><img src="/2021/01/10/idioth/memfuck/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xC5EC;&#xAE30;&#xBD80;&#xD130; Rtl* &#xD568;&#xC218; &#xC0AC;&#xC6A9; &#xC5C6;&#xC774; syscall&#xC744; &#xD1B5;&#xD574; &#xC9C1;&#xC811; code injection&#xC774;&#xB098; detected code&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC774;&#xAC83;&#xC744; &#xD558;&#xBA74;&#xC11C; WoW64&#xC5D0; &#xAD00;&#xD574; &#xB9CE;&#xC740; &#xAC83;&#xC744; &#xBC30;&#xC6E0;&#xACE0;, &#xD55C;&#xACC4;&#xC810;&#xACFC; &#xD2B9;&#xC774;&#xC810;, 32&#xBE44;&#xD2B8;&#xC640; 64&#xBE44;&#xD2B8; VEH &#xAC19;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; &#xD0D0;&#xAD6C; &#xC601;&#xC5ED;&#xC744; &#xC5BB;&#xC5C8;&#xB2E4;.</p>
<h2 id="Source-Code"><a href="#Source-Code" class="headerlink" title="Source Code"></a>Source Code</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/jackullrich/memfuck">Github &#xC8FC;&#xC18C;</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                  <a class="hover-with-bg" href="/tags/memfuck/">memfuck</a>
                  
                  <a class="hover-with-bg" href="/tags/hook/">hook</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/01/11/idioth/2021-01-11/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] 유엔환경계획(UNEP) 10만명 이상 직원 기록 접근</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/01/09/fabu1ous/2021-01-09/">
                    <span class="hidden-mobile">[하루한줄] PsExec 0-day LPE non-official patch</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/01/10/idioth/memfuck/';
        this.page.identifier = '/2021/01/10/idioth/memfuck/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] MeMFuck: 유저 모드 후킹 우회&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
