

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging                            &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/14/l0ch/windows-driver-part2/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(2)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(3)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C;&amp;#xBC88; pwn cool sexy &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!  &amp;#xADF8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xAE30;&amp;#xB9D0;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xB41C; &amp;#xAC74; &amp;#xB364;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%201.png&#34; alt=&#34;windows-driver/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAC70;&amp;#xC758; &amp;#xB098;&amp;#xC57C;.. &amp;#xB108; &amp;#xAE30;&amp;#xB9D0;&amp;#xB3C4; &amp;#xB9DD;&amp;#xD588;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%202.png&#34; alt=&#34;windows-driver/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD50;&amp;#xC218;&amp;#xB2D8; &amp;#xC885;&amp;#xAC15;&amp;#xC880;&amp;#xC694;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC744; &amp;#xBCF4;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xAF64; &amp;#xC790;&amp;#xC8FC; &amp;#xB098;&amp;#xC624;&amp;#xB294; Windows third-party driver&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%203.png&#34; alt=&#34;windows-driver/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC544;&amp;#xB2D8;&amp;#x314E;&amp;#x314E;;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;.. &amp;#xCD5C;&amp;#xADFC; &amp;#xC774;&amp;#xC288;&amp;#xAC00; &amp;#xB41C; Dell&amp;#xC758; BIOS &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/07/l0ch/2021-05-07/&#34;&gt;[&amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;] CVE-2021-21551: &amp;#xC218;&amp;#xC5B5; &amp;#xB300;&amp;#xC758; Dell PC&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &lt;/a&gt; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xB300;&amp;#xCDA9; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xAC74; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370; IOCTL&amp;#xC740; &amp;#xBB50;&amp;#xACE0;&amp;#x2026; &lt;code&gt;EPROCESS&lt;/code&gt;? &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0; &amp;#xB610; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0;.. &amp;#xC815;&amp;#xB9D0; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC6A9;&amp;#xC5B4;, &amp;#xAC1C;&amp;#xB150; &amp;#xD22C;&amp;#xC131;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC8C; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC; &amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5B8;&amp;#xC820;&amp;#xAC00;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744;&amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xCCAB; &amp;#xAE00;&amp;#xC774;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; exploit &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0;, one-day &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB05D;&amp;#xC73C;&amp;#xB85C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB3C4; &amp;#xAE38;&amp;#xC5B4;&amp;#xC9C8; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; &amp;#xC608;&amp;#xAC10;&amp;#xC774; &amp;#xB4DC;&amp;#xB294; &amp;#xAC74;.. &amp;#xAE30;&amp;#xBD84; &amp;#xD0D3;&amp;#xC778;&amp;#xAC00;..?&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC900;&amp;#xBE44;&#34;&gt;&lt;a href=&#34;#&amp;#xC900;&amp;#xBE44;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC900;&amp;#xBE44;&#34;&gt;&lt;/a&gt;&amp;#xC900;&amp;#xBE44;&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB9CE;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C;! &amp;#xBCF4;&amp;#xD1B5;&amp;#xC740; &amp;#xC6D0;&amp;#xACA9;&amp;#xC9C0; PC&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xAD6C;&amp;#xC131;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC138;&amp;#xD305;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; named pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC18D;&amp;#xB3C4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB85C; KDNET &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC900;&amp;#xBE44;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC640; VMware or Hyper-V&amp;#xC758; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE30; Windows&amp;#xC640; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; Windows&amp;#xAC00; &amp;#xAC01;&amp;#xAC01; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC774;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows VM &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xC62C;&amp;#xB9AC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/tempsnip.png&#34; alt=&#34;windows-driver/tempsnip.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC800;&amp;#xB294; &amp;#xB9E5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;&amp;#x2026;..  Windows VM &amp;#xB450;&amp;#xAC1C;&amp;#xB97C; &amp;#xC62C;&amp;#xB824;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB124;? &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xBB50;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC; &amp;#xC548;&amp;#xB098;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%204.png&#34; alt=&#34;windows-driver/Untitled%204.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB959;&amp;#xD55C;&amp;#xB4DC;&amp;#xC544;&amp;#xC544;&amp;#x314F;&amp;#x314F; !!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB9E5;&amp;#xC774; &amp;#xC798; &amp;#xBC84;&amp;#xD168;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2E4;&amp;#xD589;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; &amp;#xC544;&amp;#xB2D8;&amp;#xB9D0;&amp;#xACE0;&lt;br&gt;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD3B8;&amp;#xC758;&amp;#xC0C1; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xAC00; Windows&amp;#xB77C;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB514;&amp;#xBC84;&amp;#xAE30; Windows&amp;#xB97C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2. &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC744; &amp;#xCE5C;&amp;#xAD6C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAC15;&amp;#xC778;&amp;#xD55C; &amp;#xBA58;&amp;#xD0C8;(?)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC740; &amp;#xACE7; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC744; &amp;#xBCF8;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC1C;&amp;#xC774;&amp;#xB4DD;&amp;#xC774;&amp;#xC8E0;&amp;#x314B;&amp;#x314B;  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%205.png&#34; alt=&#34;windows-driver/Untitled%205.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%206.png&#34; alt=&#34;windows-driver/Untitled%206.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD3B8;&amp;#xC548;-&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBA58;&amp;#xD0C8;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;? &amp;#xBC14;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xACE0;&amp;#xACE0;&lt;/p&gt;
&lt;h1 id=&#34;Setting-Up-Debugging&#34;&gt;&lt;a href=&#34;#Setting-Up-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Setting Up Debugging&#34;&gt;&lt;/a&gt;Setting Up Debugging&lt;/h1&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0; &lt;a href=&#34;https://docs.microsoft.com/ko-kr/windows-hardware/drivers/debugger/debugger-download-tools&#34;&gt;Windbg&lt;/a&gt;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0;&amp;#xB294; Windbg Preview&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xB3C4; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; Windbg Preview&amp;#xB294; kdnet&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0;&amp;#xB294; Windbg&amp;#xB97C; SDK&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/tempsnip%201.png&#34; alt=&#34;windows-driver/tempsnip%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Windbg &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xB05D;&amp;#xB0C8;&amp;#xC73C;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; VM &amp;#xC124;&amp;#xC815;&amp;#x2192;Network Adapter&amp;#xC5D0;&amp;#xC11C; Network connection&amp;#xC744; Bridged&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB4A4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%207.png&#34; alt=&#34;windows-driver/Untitled%207.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD551; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB450; &amp;#xBC29;&amp;#xD654;&amp;#xBCBD;&amp;#xC5D0;&amp;#xC11C; ICMP &amp;#xC778;&amp;#xBC14;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xC78A;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%208.png&#34; alt=&#34;windows-driver/Untitled%208.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; host name&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%209.png&#34; alt=&#34;windows-driver/Untitled%209.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; cmd&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &lt;code&gt;kdnet.exe&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; 50000 ~ 50039 &amp;#xBC94;&amp;#xC704; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;&amp;gt; kdnet.exe &amp;lt;host name&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;50001&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2010.png&#34; alt=&#34;windows-driver/Untitled%2010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &amp;#xBE68;&amp;#xAC04; &amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xB193;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; Windbg Preview&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Start debugging &amp;#x2192; Attach to Kernel &amp;#x2192; Net &amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xD2B8;&amp;#xC640; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2011.png&#34; alt=&#34;windows-driver/Untitled%2011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;OK&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; Windbg Preview&amp;#xAC00; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &lt;code&gt;shutdown -r -t 0&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD558;&amp;#xBA74;..!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2012.png&#34; alt=&#34;windows-driver/Untitled%2012.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC798; &amp;#xBD99;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &amp;#xB514;&amp;#xBC84;&amp;#xAE30; &amp;#xBA38;&amp;#xC2E0;&amp;#xC778; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2013.png&#34; alt=&#34;windows-driver/Untitled%2013.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD80;&amp;#xD305;&amp;#xB418;&amp;#xBA74; &amp;#xC6B0;&amp;#xCE21; &amp;#xD558;&amp;#xB2E8;&amp;#xC5D0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Windows&amp;#xC758; third-party driver&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, one-day &amp;#xBD84;&amp;#xC11D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 공대오빠가 알려주는 Windows Driver Part 1 - Setting Up Kernel Debugging - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging                            &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/14/l0ch/windows-driver-part2/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(2)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(3)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C;&amp;#xBC88; pwn cool sexy &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!  &amp;#xADF8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xAE30;&amp;#xB9D0;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xB41C; &amp;#xAC74; &amp;#xB364;.. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%201.png&#34; alt=&#34;windows-driver/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAC70;&amp;#xC758; &amp;#xB098;&amp;#xC57C;.. &amp;#xB108; &amp;#xAE30;&amp;#xB9D0;&amp;#xB3C4; &amp;#xB9DD;&amp;#xD588;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%202.png&#34; alt=&#34;windows-driver/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD50;&amp;#xC218;&amp;#xB2D8; &amp;#xC885;&amp;#xAC15;&amp;#xC880;&amp;#xC694;&amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC744; &amp;#xBCF4;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xAF64; &amp;#xC790;&amp;#xC8FC; &amp;#xB098;&amp;#xC624;&amp;#xB294; Windows third-party driver&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%203.png&#34; alt=&#34;windows-driver/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC544;&amp;#xB2D8;&amp;#x314E;&amp;#x314E;;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74;.. &amp;#xCD5C;&amp;#xADFC; &amp;#xC774;&amp;#xC288;&amp;#xAC00; &amp;#xB41C; Dell&amp;#xC758; BIOS &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/07/l0ch/2021-05-07/&#34;&gt;[&amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;] CVE-2021-21551: &amp;#xC218;&amp;#xC5B5; &amp;#xB300;&amp;#xC758; Dell PC&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &lt;/a&gt; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xB300;&amp;#xCDA9; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xAC74; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370; IOCTL&amp;#xC740; &amp;#xBB50;&amp;#xACE0;&amp;#x2026; &lt;code&gt;EPROCESS&lt;/code&gt;? &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0; &amp;#xB610; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0;.. &amp;#xC815;&amp;#xB9D0; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC6A9;&amp;#xC5B4;, &amp;#xAC1C;&amp;#xB150; &amp;#xD22C;&amp;#xC131;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC8C; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC; &amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5B8;&amp;#xC820;&amp;#xAC00;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744;&amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xCCAB; &amp;#xAE00;&amp;#xC774;&amp;#xB2C8; &amp;#xAC00;&amp;#xBCCD;&amp;#xAC8C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; exploit &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0;, one-day &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB05D;&amp;#xC73C;&amp;#xB85C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB3C4; &amp;#xAE38;&amp;#xC5B4;&amp;#xC9C8; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; &amp;#xC608;&amp;#xAC10;&amp;#xC774; &amp;#xB4DC;&amp;#xB294; &amp;#xAC74;.. &amp;#xAE30;&amp;#xBD84; &amp;#xD0D3;&amp;#xC778;&amp;#xAC00;..?&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC900;&amp;#xBE44;&#34;&gt;&lt;a href=&#34;#&amp;#xC900;&amp;#xBE44;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC900;&amp;#xBE44;&#34;&gt;&lt;/a&gt;&amp;#xC900;&amp;#xBE44;&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB9CE;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C;! &amp;#xBCF4;&amp;#xD1B5;&amp;#xC740; &amp;#xC6D0;&amp;#xACA9;&amp;#xC9C0; PC&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xAD6C;&amp;#xC131;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC138;&amp;#xD305;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; named pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC18D;&amp;#xB3C4;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB85C; KDNET &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC900;&amp;#xBE44;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC640; VMware or Hyper-V&amp;#xC758; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE30; Windows&amp;#xC640; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; Windows&amp;#xAC00; &amp;#xAC01;&amp;#xAC01; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC774;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows VM &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xC62C;&amp;#xB9AC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/tempsnip.png&#34; alt=&#34;windows-driver/tempsnip.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC800;&amp;#xB294; &amp;#xB9E5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;&amp;#x2026;..  Windows VM &amp;#xB450;&amp;#xAC1C;&amp;#xB97C; &amp;#xC62C;&amp;#xB824;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB124;? &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xBB50;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC; &amp;#xC548;&amp;#xB098;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%204.png&#34; alt=&#34;windows-driver/Untitled%204.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB959;&amp;#xD55C;&amp;#xB4DC;&amp;#xC544;&amp;#xC544;&amp;#x314F;&amp;#x314F; !!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB9E5;&amp;#xC774; &amp;#xC798; &amp;#xBC84;&amp;#xD168;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2E4;&amp;#xD589;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; &amp;#xC544;&amp;#xB2D8;&amp;#xB9D0;&amp;#xACE0;&lt;br&gt;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD3B8;&amp;#xC758;&amp;#xC0C1; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; OS&amp;#xAC00; Windows&amp;#xB77C;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB514;&amp;#xBC84;&amp;#xAE30; Windows&amp;#xB97C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2. &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC744; &amp;#xCE5C;&amp;#xAD6C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xAC15;&amp;#xC778;&amp;#xD55C; &amp;#xBA58;&amp;#xD0C8;(?)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC740; &amp;#xACE7; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC744; &amp;#xBCF8;&amp;#xB2E4;&amp;#xBA74; &amp;#xAC1C;&amp;#xC774;&amp;#xB4DD;&amp;#xC774;&amp;#xC8E0;&amp;#x314B;&amp;#x314B;  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%205.png&#34; alt=&#34;windows-driver/Untitled%205.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%206.png&#34; alt=&#34;windows-driver/Untitled%206.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD3B8;&amp;#xC548;-&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBA58;&amp;#xD0C8;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;? &amp;#xBC14;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xACE0;&amp;#xACE0;&lt;/p&gt;
&lt;h1 id=&#34;Setting-Up-Debugging&#34;&gt;&lt;a href=&#34;#Setting-Up-Debugging&#34; class=&#34;headerlink&#34; title=&#34;Setting Up Debugging&#34;&gt;&lt;/a&gt;Setting Up Debugging&lt;/h1&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0; &lt;a href=&#34;https://docs.microsoft.com/ko-kr/windows-hardware/drivers/debugger/debugger-download-tools&#34;&gt;Windbg&lt;/a&gt;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0;&amp;#xB294; Windbg Preview&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xB3C4; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; Windbg Preview&amp;#xB294; kdnet&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xC5D0;&amp;#xB294; Windbg&amp;#xB97C; SDK&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/tempsnip%201.png&#34; alt=&#34;windows-driver/tempsnip%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Windbg &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xB05D;&amp;#xB0C8;&amp;#xC73C;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; VM &amp;#xC124;&amp;#xC815;&amp;#x2192;Network Adapter&amp;#xC5D0;&amp;#xC11C; Network connection&amp;#xC744; Bridged&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB4A4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xC798; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%207.png&#34; alt=&#34;windows-driver/Untitled%207.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD551; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD560; &amp;#xB54C;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB450; &amp;#xBC29;&amp;#xD654;&amp;#xBCBD;&amp;#xC5D0;&amp;#xC11C; ICMP &amp;#xC778;&amp;#xBC14;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xC78A;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%208.png&#34; alt=&#34;windows-driver/Untitled%208.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; host name&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%209.png&#34; alt=&#34;windows-driver/Untitled%209.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; cmd&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &lt;code&gt;kdnet.exe&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; 50000 ~ 50039 &amp;#xBC94;&amp;#xC704; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs angelscript&#34;&gt;&amp;gt; kdnet.exe &amp;lt;host name&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;50001&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2010.png&#34; alt=&#34;windows-driver/Untitled%2010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBA38;&amp;#xC2E0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &amp;#xBE68;&amp;#xAC04; &amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xB193;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; Windbg Preview&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Start debugging &amp;#x2192; Attach to Kernel &amp;#x2192; Net &amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xD2B8;&amp;#xC640; &amp;#xCEE4;&amp;#xB9E8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2011.png&#34; alt=&#34;windows-driver/Untitled%2011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;OK&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; Windbg Preview&amp;#xAC00; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &lt;code&gt;shutdown -r -t 0&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD558;&amp;#xBA74;..!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2012.png&#34; alt=&#34;windows-driver/Untitled%2012.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC798; &amp;#xBD99;&amp;#xC740; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &amp;#xB514;&amp;#xBC84;&amp;#xAE30; &amp;#xBA38;&amp;#xC2E0;&amp;#xC778; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8; Windows&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/05/30/l0ch/windows-driver/Untitled%2013.png&#34; alt=&#34;windows-driver/Untitled%2013.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD80;&amp;#xD305;&amp;#xB418;&amp;#xBA74; &amp;#xC6B0;&amp;#xCE21; &amp;#xD558;&amp;#xB2E8;&amp;#xC5D0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Windows&amp;#xC758; third-party driver&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, one-day &amp;#xBD84;&amp;#xC11D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/05/30/l0ch/windows-driver/Untitled.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/">

  <title>[Research] 공대오빠가 알려주는 Windows Driver Part 1 - Setting Up Kernel Debugging - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-05-30 18:00" pubdate>
      2021년 5월 30일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.4k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      27
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 공대오빠가 알려주는 Windows Driver Part 1 - Setting Up Kernel Debugging</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;"><a href="#&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;" class="headerlink" title="&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;"></a>&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;</h1><p>&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging                            &#x2190; Now!</p>
<p><a href="https://hackyboiz.github.io/2021/07/14/l0ch/windows-driver-part2/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(1)</a></p>
<p><a href="http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(2)</a></p>
<p><a href="http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(3)</a></p>
<hr>
<h1 id="&#xC11C;&#xB860;"><a href="#&#xC11C;&#xB860;" class="headerlink" title="&#xC11C;&#xB860;"></a>&#xC11C;&#xB860;</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! L0ch&#xC785;&#xB2C8;&#xB2E4;. &#xC9C0;&#xB09C;&#xBC88; pwn cool sexy &#xC2DC;&#xB9AC;&#xC988;&#xC5D0; &#xC774;&#xC5B4; &#xC0C8;&#xB85C;&#xC6B4; &#xC2DC;&#xB9AC;&#xC988;&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;!  &#xADF8; &#xC0AC;&#xC774;&#xC5D0; &#xAE30;&#xB9D0;&#xACE0;&#xC0AC; &#xAE30;&#xAC04;&#xC774; &#xB41C; &#xAC74; &#xB364;.. </p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%201.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%201.png"></p>
<blockquote>
<p>&#xACFC;&#xAC70;&#xC758; &#xB098;&#xC57C;.. &#xB108; &#xAE30;&#xB9D0;&#xB3C4; &#xB9DD;&#xD588;&#xC5B4;</p>
</blockquote>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%202.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%202.png"></p>
<p>&#xAD50;&#xC218;&#xB2D8; &#xC885;&#xAC15;&#xC880;&#xC694;&#x3160;&#x3160;&#x3160;</p>
<p>&#xC774;&#xBC88; &#xC2DC;&#xB9AC;&#xC988;&#xC5D0;&#xC11C;&#xB294; &#xD558;&#xB8E8;&#xD55C;&#xC904;&#xC744; &#xBCF4;&#xB2E4; &#xBCF4;&#xBA74; &#xAF64; &#xC790;&#xC8FC; &#xB098;&#xC624;&#xB294; Windows third-party driver&#xC758; &#xAD8C;&#xD55C;&#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;! </p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%203.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%203.png"></p>
<blockquote>
<p>&#xC774; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC544;&#xB2D8;&#x314E;&#x314E;;</p>
</blockquote>
<p>&#xC608;&#xC2DC;&#xB97C; &#xD558;&#xB098; &#xB4E4;&#xC5B4;&#xBCF4;&#xC790;&#xBA74;.. &#xCD5C;&#xADFC; &#xC774;&#xC288;&#xAC00; &#xB41C; Dell&#xC758; BIOS &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xB098;&#xC628; <a href="https://hackyboiz.github.io/2021/05/07/l0ch/2021-05-07/">[&#xD558;&#xB8E8;&#xD55C;&#xC904;] CVE-2021-21551: &#xC218;&#xC5B5; &#xB300;&#xC758; Dell PC&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xB294; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810; </a> &#xC815;&#xB3C4;&#xAC00; &#xC788;&#xACA0;&#xB124;&#xC694;. &#xB300;&#xCDA9; &#xC2EC;&#xAC01;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xAC74; &#xC54C;&#xACA0;&#xB294;&#xB370; IOCTL&#xC740; &#xBB50;&#xACE0;&#x2026; <code>EPROCESS</code>? &#xD1A0;&#xD070;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xB36E;&#xC5B4; &#xC4F4;&#xB2E4;&#xB294; &#xAC74;&#xC9C0; &#xB610; &#xAD8C;&#xD55C;&#xC0C1;&#xC2B9;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xD55C;&#xB2E4;&#xB294; &#xAC74;&#xC9C0;.. &#xC815;&#xB9D0; &#xBAA8;&#xB974;&#xB294; &#xC6A9;&#xC5B4;, &#xAC1C;&#xB150; &#xD22C;&#xC131;&#xC774;&#xB124;&#xC694;. &#xACF5;&#xBD80;&#xD560;&#xAC8C; &#xB108;&#xBB34; &#xB9CE;&#xC9C0;&#xB9CC; &#x3160;&#x3160;&#x3160; &#xD558;&#xB098;&#xC529; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xBCF4;&#xBA74; &#xC5B8;&#xC820;&#xAC00;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744;&#xC218;&#xB3C4; &#xC788;&#xACA0;&#xC8E0;?</p>
<p>&#xC624;&#xB298;&#xC740; &#xC2DC;&#xB9AC;&#xC988; &#xCCAB; &#xAE00;&#xC774;&#xB2C8; &#xAC00;&#xBCCD;&#xAC8C; &#xB514;&#xBC84;&#xAE45; &#xD658;&#xACBD; &#xC138;&#xD305;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD574;&#xC11C; &#xC55E;&#xC73C;&#xB85C; &#xAC04;&#xB2E8;&#xD55C; exploit &#xC608;&#xC81C;&#xB97C; &#xB2E4;&#xB8E8;&#xACE0;, one-day &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB05D;&#xC73C;&#xB85C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xC2DC;&#xB9AC;&#xC988;&#xB3C4; &#xAE38;&#xC5B4;&#xC9C8; &#xAC83; &#xAC19;&#xC740; &#xC608;&#xAC10;&#xC774; &#xB4DC;&#xB294; &#xAC74;.. &#xAE30;&#xBD84; &#xD0D3;&#xC778;&#xAC00;..?</p>
<h1 id="&#xC900;&#xBE44;"><a href="#&#xC900;&#xBE44;" class="headerlink" title="&#xC900;&#xBE44;"></a>&#xC900;&#xBE44;</h1><p>&#xC6B0;&#xC120; &#xB514;&#xBC84;&#xAE45; &#xC138;&#xD305;&#xBD80;&#xD130; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xB2EC;&#xB9AC; &#xB85C;&#xCEEC;&#xC5D0;&#xC11C; &#xB514;&#xBC84;&#xAE45;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC644;&#xC804;&#xD788; &#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC81C;&#xC57D;&#xC0AC;&#xD56D;&#xC774; &#xB9CE;&#xC8E0;. &#xADF8;&#xB798;&#xC11C;! &#xBCF4;&#xD1B5;&#xC740; &#xC6D0;&#xACA9;&#xC9C0; PC&#xB97C; &#xD558;&#xB098; &#xAD6C;&#xC131;&#xD574; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xC138;&#xD305;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC804;&#xC5D0;&#xB294; named pipe&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xAC00;&#xC0C1; &#xC2DC;&#xB9AC;&#xC5BC; &#xD3EC;&#xD2B8;&#xB85C; &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD588;&#xC9C0;&#xB9CC; &#xC2DC;&#xB9AC;&#xC5BC; &#xD3EC;&#xD2B8; &#xC18D;&#xB3C4;&#xC758; &#xD55C;&#xACC4;&#xB85C; KDNET &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xD544;&#xC694;&#xD55C; &#xC900;&#xBE44;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>1. &#xD638;&#xC2A4;&#xD2B8; Windows&#xC640; VMware or Hyper-V&#xC758; &#xAC8C;&#xC2A4;&#xD2B8; Windows</strong></p>
<p>Windbg&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xCEE4;&#xB110;&#xC744; &#xBD84;&#xC11D;&#xD560; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBD84;&#xC11D;&#xB300;&#xC0C1;&#xC774; &#xB418;&#xB294; &#xB514;&#xBC84;&#xAE30; Windows&#xC640; &#xBD84;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD560; Windows&#xAC00; &#xAC01;&#xAC01; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xD638;&#xC2A4;&#xD2B8;&#xAC00; Windows &#xD658;&#xACBD;&#xC774;&#xBA74; &#xAC8C;&#xC2A4;&#xD2B8; Windows VM &#xD558;&#xB098;&#xB9CC; &#xC62C;&#xB9AC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2021/05/30/l0ch/windows-driver/tempsnip.png" srcset="/img/loading.gif" alt="windows-driver/tempsnip.png"></p>
<blockquote>
<p>?</p>
</blockquote>
<p>&#xB124; &#xC800;&#xB294; &#xB9E5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;&#x2026;..  Windows VM &#xB450;&#xAC1C;&#xB97C; &#xC62C;&#xB824;&#xC11C; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB124;? &#xC5B4;&#xB514;&#xC11C; &#xBB50;&#xAC00; &#xB3CC;&#xC544;&#xAC00;&#xB294; &#xC18C;&#xB9AC; &#xC548;&#xB098;&#xB0D0;&#xAD6C;&#xC694;?</p>
<p>.</p>
<p>.</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%204.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%204.png"></p>
<blockquote>
<p>&#xC774;&#xB959;&#xD55C;&#xB4DC;&#xC544;&#xC544;&#x314F;&#x314F; !!!</p>
</blockquote>
<p>&#xB9E5;&#xC774; &#xC798; &#xBC84;&#xD168;&#xC8FC;&#xACE0; &#xC788;&#xC73C;&#xB2C8; &#xB2E4;&#xD589;&#xC774;&#xB124;&#xC694; &#x314E;&#x314E; &#xC544;&#xB2D8;&#xB9D0;&#xACE0;<br>&#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xD3B8;&#xC758;&#xC0C1; &#xD638;&#xC2A4;&#xD2B8; OS&#xAC00; Windows&#xB77C;&#xACE0; &#xAC00;&#xC815;&#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD560; &#xB514;&#xBC84;&#xAE30; Windows&#xB97C; &#xAC8C;&#xC2A4;&#xD2B8;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<p><strong>2. &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0;&#xC744; &#xCE5C;&#xAD6C;&#xCC98;&#xB7FC; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xAC15;&#xC778;&#xD55C; &#xBA58;&#xD0C8;(?)</strong></p>
<p>&#xC0AC;&#xC2E4; &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0;&#xC740; &#xACE7; &#xD06C;&#xB798;&#xC2DC;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0;&#xC744; &#xBCF8;&#xB2E4;&#xBA74; &#xAC1C;&#xC774;&#xB4DD;&#xC774;&#xC8E0;&#x314B;&#x314B;  </p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%205.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%205.png"></p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%206.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%206.png"></p>
<blockquote>
<p>&#xD3B8;&#xC548;-</p>
</blockquote>
<p>&#xBA58;&#xD0C8;&#xAE4C;&#xC9C0; &#xC900;&#xBE44;&#xAC00; &#xBAA8;&#xB450; &#xB418;&#xC5C8;&#xB2E4;? &#xBC14;&#xB85C; &#xB514;&#xBC84;&#xAE45; &#xC138;&#xD305;&#xC73C;&#xB85C; &#xACE0;&#xACE0;&#xACE0;</p>
<h1 id="Setting-Up-Debugging"><a href="#Setting-Up-Debugging" class="headerlink" title="Setting Up Debugging"></a>Setting Up Debugging</h1><p>&#xBA3C;&#xC800; &#xAC8C;&#xC2A4;&#xD2B8;&#xC640; &#xD638;&#xC2A4;&#xD2B8; Windows&#xC5D0; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/ko-kr/windows-hardware/drivers/debugger/debugger-download-tools">Windbg</a>&#xB97C; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;. &#xD638;&#xC2A4;&#xD2B8; Windows&#xC5D0;&#xB294; Windbg Preview&#xB97C; &#xC124;&#xCE58;&#xD574; &#xC0AC;&#xC6A9;&#xD574;&#xB3C4; &#xB418;&#xC9C0;&#xB9CC; Windbg Preview&#xB294; kdnet&#xC774; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAC8C;&#xC2A4;&#xD2B8; Windows&#xC5D0;&#xB294; Windbg&#xB97C; SDK&#xB85C; &#xC124;&#xCE58;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2021/05/30/l0ch/windows-driver/tempsnip%201.png" srcset="/img/loading.gif" alt="windows-driver/tempsnip%201.png"></p>
<p>Windbg &#xC124;&#xCE58;&#xB97C; &#xB05D;&#xB0C8;&#xC73C;&#xBA74; &#xAC8C;&#xC2A4;&#xD2B8; VM &#xC124;&#xC815;&#x2192;Network Adapter&#xC5D0;&#xC11C; Network connection&#xC744; Bridged&#xB85C; &#xC124;&#xC815;&#xD574; &#xD638;&#xC2A4;&#xD2B8;&#xC640; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xC124;&#xC815;&#xD55C; &#xB4A4; &#xD1B5;&#xC2E0;&#xC774; &#xC798; &#xB418;&#xB294;&#xC9C0; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xBD05;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%207.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%207.png"></p>
<p>&#xD551; &#xD14C;&#xC2A4;&#xD2B8; &#xD560; &#xB54C;&#xB294; &#xD638;&#xC2A4;&#xD2B8;&#xC640; &#xAC8C;&#xC2A4;&#xD2B8; &#xBAA8;&#xB450; &#xBC29;&#xD654;&#xBCBD;&#xC5D0;&#xC11C; ICMP &#xC778;&#xBC14;&#xC6B4;&#xB4DC; &#xD5C8;&#xC6A9;&#xD558;&#xB294; &#xAC83; &#xC78A;&#xC9C0; &#xB9C8;&#xC138;&#xC694;!</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%208.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%208.png"></p>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xD1B5;&#xC2E0;&#xC774; &#xB418;&#xB294; &#xAC78; &#xD655;&#xC778;&#xD588;&#xC73C;&#xBA74; &#xD638;&#xC2A4;&#xD2B8;&#xC758; host name&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%209.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%209.png"></p>
<p>&#xAC8C;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; cmd&#xB97C; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD574; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; <code>kdnet.exe</code>&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD3EC;&#xD2B8;&#xB294; 50000 ~ 50039 &#xBC94;&#xC704; &#xC548;&#xC5D0;&#xC11C; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs angelscript">&gt; kdnet.exe &lt;host name&gt; <span class="hljs-number">50001</span></code></pre>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%2010.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%2010.png"></p>
<p>&#xD574;&#xB2F9; &#xBA38;&#xC2E0;&#xC744; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCEE4;&#xB9E8;&#xB4DC;&#xB97C; &#xD638;&#xC2A4;&#xD2B8; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB77C;&#xACE0; &#xD558;&#xB124;&#xC694;! &#xBE68;&#xAC04; &#xBC15;&#xC2A4;&#xC758; &#xCEE4;&#xB9E8;&#xB4DC;&#xB97C; &#xBCF5;&#xC0AC;&#xD574;&#xB193;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xD638;&#xC2A4;&#xD2B8;&#xC758; Windbg Preview&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0; Start debugging &#x2192; Attach to Kernel &#x2192; Net &#xC5D0;&#xC11C; &#xD3EC;&#xD2B8;&#xC640; &#xCEE4;&#xB9E8;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%2011.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%2011.png"></p>
<p>OK&#xB97C; &#xB20C;&#xB7EC; Windbg Preview&#xAC00; &#xB300;&#xAE30; &#xC0C1;&#xD0DC;&#xAC00; &#xB418;&#xBA74; &#xAC8C;&#xC2A4;&#xD2B8;&#xB97C; <code>shutdown -r -t 0</code> &#xC73C;&#xB85C; &#xC7AC;&#xBD80;&#xD305;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. </p>
<p>&#xC7AC;&#xBD80;&#xD305;&#xD558;&#xBA74;..!</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%2012.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%2012.png"></p>
<p>&#xC798; &#xBD99;&#xC740; &#xAC83; &#xAC19;&#xC8E0;? &#xB514;&#xBC84;&#xAE30; &#xBA38;&#xC2E0;&#xC778; &#xAC8C;&#xC2A4;&#xD2B8; Windows&#xB3C4; &#xD655;&#xC778;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/05/30/l0ch/windows-driver/Untitled%2013.png" srcset="/img/loading.gif" alt="windows-driver/Untitled%2013.png"></p>
<p>&#xB514;&#xBC84;&#xAC70;&#xAC00; &#xBD99;&#xC740; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xBD80;&#xD305;&#xB418;&#xBA74; &#xC6B0;&#xCE21; &#xD558;&#xB2E8;&#xC5D0; &#xD14C;&#xC2A4;&#xD2B8; &#xBAA8;&#xB4DC;&#xC640; &#xBE4C;&#xB4DC; &#xBC84;&#xC804; &#xC815;&#xBCF4;&#xAC00; &#xD45C;&#xC2DC;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xBD80;&#xD130;&#xB294; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; Windows&#xC758; third-party driver&#xC640; &#xCDE8;&#xC57D;&#xC810;, one-day &#xBD84;&#xC11D;&#xAE4C;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/windows-driver/">windows driver</a>
                  
                  <a class="hover-with-bg" href="/tags/third-party-driver-exploitation/">third-party driver exploitation</a>
                  
                  <a class="hover-with-bg" href="/tags/debugging/">debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/kernel-debugging/">kernel debugging</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/05/31/idioth/2021-05-31/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] COM 객체를 활용한 백도어</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/05/30/j0ker/2021-05-30/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-29628 : PlayStation5 SMAP Bypass</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/';
        this.page.identifier = '/2021/05/30/l0ch/windows-driver/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 공대오빠가 알려주는 Windows Driver Part 1 - Setting Up Kernel Debugging&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
