

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xACE0;&amp;#xD588;&amp;#xB358; &amp;#xB300;&amp;#xB85C;, &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &amp;#xC0BD;&amp;#xC9C8;&amp;#xB85C; &amp;#xB05D;&amp;#xB098;&amp;#xB294; &amp;#xAE00;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xBA58;&amp;#xD0C8; &amp;#xB098;&amp;#xAC10;&amp;#xC5D0; &amp;#xC720;&amp;#xC758;&amp;#xD558;&amp;#xC2DC;&amp;#xAE30; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xBB50; &amp;#xC5B4;&amp;#xCA0C;&amp;#xB4E0; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;! &amp;#xADF8;&amp;#xB7FC; Part 3 &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;From-Crash-to-Exploit&#34;&gt;&lt;a href=&#34;#From-Crash-to-Exploit&#34; class=&#34;headerlink&#34; title=&#34;From Crash to Exploit&#34;&gt;&lt;/a&gt;From Crash to Exploit&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC81C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xB358; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.(&amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9B0; &amp;#xAC74; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB3C4; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC11C; &amp;#xC37C;&amp;#xC5B4;&amp;#xC694; &amp;#x314E;&amp;#x314E;) &lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--016.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--016.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xAC70;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xD639; &amp;#xAC00;&amp;#xB2E4;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799; &amp;#xBB38;&amp;#xC81C;&amp;#xC5EC;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC798; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD798;&amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xB294; &amp;#xD655;&amp;#xB960;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xD655;&amp;#xB960;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB0AE;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; JIT &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC548; &amp;#xBD99;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB791; &amp;#xD799; &amp;#xBC30;&amp;#xC815; &amp;#xB4F1;&amp;#xC774; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2EC;&amp;#xB77C;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB358; &amp;#xAC8C; &amp;#xC548;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xB370;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windbg&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD0A8; CMD &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;windbg &amp;#x2013;I&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; JIT &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; msec &amp;#xD655;&amp;#xC7A5;&amp;#xC790; &amp;#xC804;&amp;#xC5D0; &lt;code&gt;e0&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. msec &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD; &amp;#xB54C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xB370;&amp;#xC694;. &lt;code&gt;e0&lt;/code&gt;&amp;#xC774; &amp;#xC544;&amp;#xB9C8; &amp;#xCC98;&amp;#xC74C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xB0AC;&amp;#xC744; &amp;#xB54C;&amp;#xC758; &amp;#xB85C;&amp;#xADF8; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xAC70; &amp;#xBD10;&amp;#xB3C4; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC800;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC774;&amp;#xAC70; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xBD10;&amp;#xC694;. &amp;#xC55E;&amp;#xC5D0; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC880; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB118;&amp;#xACE0; &amp;#xB4A4;&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B4; &amp;#xC88B;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;call&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD130;&amp;#xC84C;&amp;#xB124;&amp;#xC694;!!! &amp;#xBB50; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB2C8;&amp;#xAE4C; &amp;#x3160;&amp;#x3160; &amp;#xBCF4;&amp;#xD1B5; &amp;#xB2E4;&amp;#xB978; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;call&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;jmp&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xC8E0; &amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB611;&amp;#xAC19;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAC4D; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC758; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC11C; &amp;#xB123;&amp;#xC740; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB50;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB7FC; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADC0;&amp;#xCC28;&amp;#xB2C8;&amp;#xC998;&amp;#xC774; &amp;#xBC1C;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC0AC;&amp;#xC2E4; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xADC0;&amp;#xCC2E;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;)&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD2BC; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; hxd&amp;#xB85C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB41C; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C4;&amp;#xC9DC; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4; &lt;code&gt;ecx&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;ecx&lt;/code&gt;&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB4A4;&amp;#xC5D0; &amp;#xB098;&amp;#xC624;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; ASLR &amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xD070; &amp;#xC758;&amp;#xBBF8;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;) &amp;#xBCF4;&amp;#xD1B5; &amp;#xAC12;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBE7C;&amp;#xAC70;&amp;#xB098; &amp;#xB610; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB300;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xC548; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;. &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C;&amp;#xB294; &amp;#xB300;&amp;#xCDA9; &amp;#xC54C;&amp;#xC558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%201.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xBD88;&amp;#xB824;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xB798; &amp;#xB193;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC880; &amp;#xB2E4;&amp;#xB974;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB294; &amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xCC38;&amp;#xACE0;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; !exlploitable &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%202.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;BFF&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; !exploitable &amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; exploitable &amp;#xD55C; &amp;#xC9C0; &amp;#xC548; &amp;#xD55C; &amp;#xC9C0;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; exploitable&amp;#xB85C; &amp;#xB098;&amp;#xC628; &amp;#xAC70;&amp;#xB294; &amp;#xADF8;&amp;#xB7F4;&amp;#xC2F8;&amp;#xD558;&amp;#xAE34; &amp;#xD55C;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xAC70;&amp;#xB294; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; Unknown&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xC775;&amp;#xC2A4; &amp;#xC798;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC65C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB0AC;&amp;#xB294;&amp;#xC9C0;, exploitable &amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xAC00; &amp;#xBB54;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xC744; &amp;#xD588;&amp;#xACE0; &amp;#xC774;&amp;#xAC8C; &amp;#xC775;&amp;#xC2A4; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB418;&amp;#xC5C8;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB418;&amp;#xC5C8;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB300;&amp;#xCDA9;&amp;#xC740; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC65C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xCD94;&amp;#xCE21;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;Hxd&amp;#xB85C; &amp;#xC624;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB110; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; minimized &amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; ctrl+k &amp;#xB97C; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB450; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--018.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--018.jpg&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;BITMAPINFOHEADER.biSize : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x1f&lt;/span&gt;
BITMAPINFOHEADER.biCompression : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x0A&lt;/span&gt;
BITMAPINFOHEADER.biClrUsed : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x02&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &lt;code&gt;BiSize&lt;/code&gt; &amp;#xB294; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xB370; &amp;#xC704;&amp;#xC5D0; &amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xB9AC; &amp;#xBD10;&amp;#xB3C4; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xAE30;&amp;#xC874; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xACE0; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xCE21;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;biCompression&lt;/code&gt; &amp;#xACFC; &lt;code&gt;biClrUsed&lt;/code&gt; &amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC555;&amp;#xCD95; &amp;#xBC29;&amp;#xC2DD; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC0C9;&amp;#xC0C1;&amp;#xC218;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD574;&amp;#xBD10;&amp;#xC57C;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xAC74;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD639;&amp;#xC740; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xB294; &amp;#xCD94;&amp;#xCE21;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB300;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD655;&amp;#xC2E4;&amp;#xC774; &amp;#xADF8;&amp;#xB0E5; &amp;#xB9C9;&amp;#xBB34;&amp;#xAC00;&amp;#xB0B4;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB35C; &amp;#xC18C;&amp;#xBAA8;&amp;#xB418;&amp;#xACE0; &amp;#xD654;&amp;#xAC00; &amp;#xB35C; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC791;&amp;#xC131; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xB2E4; &amp;#xC77D;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xC368;&amp;#xC624;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xACE0; GUI &amp;#xAC00; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xB531; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &amp;#xC774;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB97C; &amp;#xC4F0;&amp;#xAE34; &amp;#xD588;&amp;#xB294; &amp;#xB370; &amp;#xC18D;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; windbg&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC815;&amp;#xB9D0; &amp;#xC18D; &amp;#xD130;&amp;#xC838;&amp;#xC11C;;;; &amp;#xC81C; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0AC;&amp;#xC591;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;&amp;#xC11C;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC608; &amp;#xBED7;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB354;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB2E8;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB97C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xCE58;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC; &amp;#xB531; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xD3B8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;&amp;#xACE0;&amp;#x2026; &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; CUI&amp;#xB77C;&amp;#xB294; &amp;#xAC8C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD558;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2F9;.  &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://windbg.info/doc/1-common-cmds.html&#34;&gt;http://windbg.info/doc/1-common-cmds.html&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;windbg &amp;#xC4F8; &amp;#xB54C; &amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC606;&amp;#xC5D0; &amp;#xB744;&amp;#xC6CC;&amp;#xB193;&amp;#xACE0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xC368;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB098;&amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xC548; &amp;#xBCF4;&amp;#xACE0;&amp;#xB3C4; &amp;#xC798; &amp;#xC4F0;&amp;#xB294; &amp;#xB098; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC544;&amp;#xAE4C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xC704; &amp;#xAC12;&amp;#xB4E4;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xACE0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;0x41&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xB2E4;&amp;#xC74C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--020.png&#34; alt=&#34;./bughunting-tutorials-part3/image--020.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB123;&amp;#xC740; &lt;code&gt;0x41414141&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774; &amp;#xAC12;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xC624;&amp;#xB294;&amp;#xC9C0; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--022.png&#34; alt=&#34;./bughunting-tutorials-part3/image--022.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &lt;code&gt;eip&lt;/code&gt; &amp;#xBC14;&amp;#xB85C; &amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;esp&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB124;&amp;#xC694;. &amp;#xC789; &amp;#xADFC;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC778;&amp;#xB370;???(&amp;#xC774;&amp;#xAC70; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC624;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC544;&amp;#xB2C8;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;;;;)&lt;br&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--024.png&#34; alt=&#34;./bughunting-tutorials-part3/image--024.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB54;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB9CE;&amp;#xC774; &amp;#xC788;&amp;#xB124;&amp;#xC694;;;; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xAC74; &lt;code&gt;0x0725f056&lt;/code&gt; ~ &lt;code&gt;0x0753b70d&lt;/code&gt; &amp;#xC815;&amp;#xB3C4;&amp;#xC778; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xC774; &amp;#xC911; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xAC78;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0;&amp;#xC694;. &amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xBB54; &amp;#xAC08; &amp;#xC54C; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC81C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--026.png&#34; alt=&#34;./bughunting-tutorials-part3/image--026.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC800; &lt;code&gt;WARNING&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xB72C; &amp;#xBD80;&amp;#xBD84;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBABB; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xB300;&amp;#xB85C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC54C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xD1B5; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xB370; &amp;#x201C;&amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4;&amp;#x201D; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#x201C;&amp;#xBC14;&amp;#xD140;&amp;#xC5C5;&amp;#x201C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC88C;&amp;#xC6B0;&amp;#xB85C; &amp;#xAC08; &amp;#xC21C; &amp;#xC5C6;&amp;#xC796;&amp;#xC544;&amp;#xC694;?)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--028.png&#34; alt=&#34;./bughunting-tutorials-part3/image--028.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB09C; &amp;#xADF8; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xC880; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370;&amp;#x2026; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xC131;&amp;#xD5A5; &amp;#xD639;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB2E8;&amp;#xCD95;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xD604;&amp;#xBA85;&amp;#xD55C; &amp;#xC120;&amp;#xD0DD;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xCC3E;&amp;#xC744; &amp;#xACB8; &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC2DC;&amp;#xAC04; &amp;#xC878;&amp;#xB77C; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;.) &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xD560;&amp;#xC9C0; &amp;#xC798; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. dib &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC6CC;&amp;#xB099; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC791;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB7C9;&amp;#xC774; &amp;#xBC29;&amp;#xB300;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xCC98;&amp;#xC74C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD5E4;&amp;#xB354; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; BM&amp;#xC774;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xBD84;&amp;#xBA85; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC544;&amp;#xC774;&amp;#xB2E4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;BM&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--030.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--030.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB294;&amp;#x2026; &amp;#xB9DD;.. &amp;#xC5C6;&amp;#xB124;&amp;#x2026;. &amp;#xB2E4;&amp;#xB978; &amp;#xAC74; &amp;#xB2E4; &amp;#xC788;&amp;#xB358;&amp;#xB370;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xB0B4; &amp;#xB9D8;&amp;#xB300;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xAD70;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xD3B8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xBCFC; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--032.png&#34; alt=&#34;./bughunting-tutorials-part3/image--032.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC70;&amp;#xB098; &amp;#xD55C; &amp;#xBC88; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--034.png&#34; alt=&#34;./bughunting-tutorials-part3/image--034.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB77C;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; &amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &lt;code&gt;call&lt;/code&gt;&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &lt;code&gt;ret&lt;/code&gt;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8;&amp;#xB0E5; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC744; &amp;#xBFD0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;dds&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xC778; &amp;#xAC83;&amp;#xB9CC;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD0DD; &amp;#xC880; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--036.png&#34; alt=&#34;./bughunting-tutorials-part3/image--036.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB294; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;! &amp;#xADF8;&amp;#xB7FC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--038.png&#34; alt=&#34;./bughunting-tutorials-part3/image--038.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB728;&amp;#xBA74;&amp;#xC11C; &amp;#xB85C;&amp;#xB529;&amp;#xC774; &amp;#xC880; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &lt;code&gt;sxe ld ImLoader.dll&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xCE58;&amp;#xBA74; &lt;code&gt;ImLoader.dll&lt;/code&gt; &amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB420; &amp;#xB54C; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC800;&amp;#xB807;&amp;#xAC8C; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB85C;&amp;#xB529;&amp;#xB418;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;. &amp;#xBAA8;&amp;#xB4C8;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xACE0; &amp;#xBE0C;&amp;#xD3EC;&amp;#xB97C; &amp;#xAC78;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC880; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--040.png&#34; alt=&#34;./bughunting-tutorials-part3/image--040.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--042.png&#34; alt=&#34;./bughunting-tutorials-part3/image--042.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--044.png&#34; alt=&#34;./bughunting-tutorials-part3/image--044.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC911; &amp;#xB450; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xD5E4;&amp;#xB354;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC788;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB290; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--046.png&#34; alt=&#34;./bughunting-tutorials-part3/image--046.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x2026;&amp;#xB294; Fail&amp;#x2026;. &amp;#xAD1C;&amp;#xCC2E;&amp;#xC544;&amp;#xC694;&amp;#x2026; &amp;#xC774;&amp;#xB7F4; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;&amp;#x2026;. &amp;#xAF3C;&amp;#xC218; &amp;#xC4F0;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xC2E0;&amp;#xC758; &amp;#xACC4;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB978; &amp;#xACF3;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xAC70;&amp;#xB098;&amp;#x2026; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC5EC;&amp;#xAE30;&amp;#xB3C4; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xAC70;&amp;#xB098;&amp;#x2026; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xBB50; &amp;#xB2E4;&amp;#xB978; &amp;#xB370; &amp;#xBE0C;&amp;#xD3EC; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC368;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xADF8; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; Part 4&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;Part-4-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#Part-4-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;Part 4 &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;Part 4 &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%203.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;EIP&amp;#xAC00; &amp;#xC548;&amp;#xC7A1;&amp;#xD788;&amp;#xC796;&amp;#xC544;!!!!&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 버그헌팅 튜토리얼 Part 3 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xACE0;&amp;#xD588;&amp;#xB358; &amp;#xB300;&amp;#xB85C;, &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &amp;#xC0BD;&amp;#xC9C8;&amp;#xB85C; &amp;#xB05D;&amp;#xB098;&amp;#xB294; &amp;#xAE00;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xBA58;&amp;#xD0C8; &amp;#xB098;&amp;#xAC10;&amp;#xC5D0; &amp;#xC720;&amp;#xC758;&amp;#xD558;&amp;#xC2DC;&amp;#xAE30; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xBB50; &amp;#xC5B4;&amp;#xCA0C;&amp;#xB4E0; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;! &amp;#xADF8;&amp;#xB7FC; Part 3 &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;From-Crash-to-Exploit&#34;&gt;&lt;a href=&#34;#From-Crash-to-Exploit&#34; class=&#34;headerlink&#34; title=&#34;From Crash to Exploit&#34;&gt;&lt;/a&gt;From Crash to Exploit&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC81C; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xB358; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.(&amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9B0; &amp;#xAC74; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB3C4; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xADF8;&amp;#xB0E5; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC11C; &amp;#xC37C;&amp;#xC5B4;&amp;#xC694; &amp;#x314E;&amp;#x314E;) &lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--016.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--016.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xAC70;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC04;&amp;#xD639; &amp;#xAC00;&amp;#xB2E4;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799; &amp;#xBB38;&amp;#xC81C;&amp;#xC5EC;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xC798; &amp;#xC548; &amp;#xB418;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD798;&amp;#xB4E4;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xB294; &amp;#xD655;&amp;#xB960;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xD655;&amp;#xB960;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB0AE;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; JIT &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC548; &amp;#xBD99;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB791; &amp;#xD799; &amp;#xBC30;&amp;#xC815; &amp;#xB4F1;&amp;#xC774; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2EC;&amp;#xB77C;&amp;#xC11C; &amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB358; &amp;#xAC8C; &amp;#xC548;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xB370;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windbg&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD0A8; CMD &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;windbg &amp;#x2013;I&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; JIT &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xD604;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; msec &amp;#xD655;&amp;#xC7A5;&amp;#xC790; &amp;#xC804;&amp;#xC5D0; &lt;code&gt;e0&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. msec &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD; &amp;#xB54C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xB370;&amp;#xC694;. &lt;code&gt;e0&lt;/code&gt;&amp;#xC774; &amp;#xC544;&amp;#xB9C8; &amp;#xCC98;&amp;#xC74C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xB0AC;&amp;#xC744; &amp;#xB54C;&amp;#xC758; &amp;#xB85C;&amp;#xADF8; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xAC70; &amp;#xBD10;&amp;#xB3C4; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC800;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC774;&amp;#xAC70; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xBD10;&amp;#xC694;. &amp;#xC55E;&amp;#xC5D0; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC880; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB118;&amp;#xACE0; &amp;#xB4A4;&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B4; &amp;#xC88B;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;call&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD130;&amp;#xC84C;&amp;#xB124;&amp;#xC694;!!! &amp;#xBB50; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB2C8;&amp;#xAE4C; &amp;#x3160;&amp;#x3160; &amp;#xBCF4;&amp;#xD1B5; &amp;#xB2E4;&amp;#xB978; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;call&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;jmp&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xC8E0; &amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB611;&amp;#xAC19;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; &amp;#xAC4D; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC758; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC11C; &amp;#xB123;&amp;#xC740; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB50;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB7FC; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADC0;&amp;#xCC28;&amp;#xB2C8;&amp;#xC998;&amp;#xC774; &amp;#xBC1C;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB864;&amp;#xB9C1;&amp;#xD574;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC0AC;&amp;#xC2E4; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xADC0;&amp;#xCC2E;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;)&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD2BC; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; hxd&amp;#xB85C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB41C; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xC73C;&amp;#xBA74; &amp;#xC9C4;&amp;#xC9DC; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;. &amp;#xC800;&amp;#xB3C4; &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4; &lt;code&gt;ecx&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;ecx&lt;/code&gt;&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB4A4;&amp;#xC5D0; &amp;#xB098;&amp;#xC624;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; ASLR &amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xD070; &amp;#xC758;&amp;#xBBF8;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;) &amp;#xBCF4;&amp;#xD1B5; &amp;#xAC12;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBE7C;&amp;#xAC70;&amp;#xB098; &amp;#xB610; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB300;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xC548; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;. &amp;#xD6C4;&amp;#xC6B0;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C;&amp;#xB294; &amp;#xB300;&amp;#xCDA9; &amp;#xC54C;&amp;#xC558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%201.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xBD88;&amp;#xB824;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xB798; &amp;#xB193;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC880; &amp;#xB2E4;&amp;#xB974;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB294; &amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xCC38;&amp;#xACE0;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; !exlploitable &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%202.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;BFF&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; !exploitable &amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; exploitable &amp;#xD55C; &amp;#xC9C0; &amp;#xC548; &amp;#xD55C; &amp;#xC9C0;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; exploitable&amp;#xB85C; &amp;#xB098;&amp;#xC628; &amp;#xAC70;&amp;#xB294; &amp;#xADF8;&amp;#xB7F4;&amp;#xC2F8;&amp;#xD558;&amp;#xAE34; &amp;#xD55C;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xAC70;&amp;#xB294; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; Unknown&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xC775;&amp;#xC2A4; &amp;#xC798;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC65C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB0AC;&amp;#xB294;&amp;#xC9C0;, exploitable &amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xAC00; &amp;#xBB54;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xC744; &amp;#xD588;&amp;#xACE0; &amp;#xC774;&amp;#xAC8C; &amp;#xC775;&amp;#xC2A4; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB418;&amp;#xC5C8;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB418;&amp;#xC5C8;&amp;#xB294; &amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB300;&amp;#xCDA9;&amp;#xC740; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC65C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xCD94;&amp;#xCE21;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;Hxd&amp;#xB85C; &amp;#xC624;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB110; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; minimized &amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; ctrl+k &amp;#xB97C; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB450; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--018.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--018.jpg&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;BITMAPINFOHEADER.biSize : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x1f&lt;/span&gt;
BITMAPINFOHEADER.biCompression : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x0A&lt;/span&gt;
BITMAPINFOHEADER.biClrUsed : &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt; -&amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0x02&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &lt;code&gt;BiSize&lt;/code&gt; &amp;#xB294; &lt;code&gt;BITMAPINFOHEADER&lt;/code&gt; &amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xB370; &amp;#xC704;&amp;#xC5D0; &amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xB9AC; &amp;#xBD10;&amp;#xB3C4; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xAE30;&amp;#xC874; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xB97C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xACE0; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xCE21;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;biCompression&lt;/code&gt; &amp;#xACFC; &lt;code&gt;biClrUsed&lt;/code&gt; &amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC555;&amp;#xCD95; &amp;#xBC29;&amp;#xC2DD; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC0C9;&amp;#xC0C1;&amp;#xC218;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD574;&amp;#xBD10;&amp;#xC57C;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xAC74;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD639;&amp;#xC740; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4;&amp;#xB294; &amp;#xCD94;&amp;#xCE21;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB300;&amp;#xB85C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD655;&amp;#xC2E4;&amp;#xC774; &amp;#xADF8;&amp;#xB0E5; &amp;#xB9C9;&amp;#xBB34;&amp;#xAC00;&amp;#xB0B4;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB35C; &amp;#xC18C;&amp;#xBAA8;&amp;#xB418;&amp;#xACE0; &amp;#xD654;&amp;#xAC00; &amp;#xB35C; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC791;&amp;#xC131; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xB2E4; &amp;#xC77D;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xC368;&amp;#xC624;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xACE0; GUI &amp;#xAC00; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xB531; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &amp;#xC774;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB97C; &amp;#xC4F0;&amp;#xAE34; &amp;#xD588;&amp;#xB294; &amp;#xB370; &amp;#xC18D;&amp;#xB3C4; &amp;#xBB38;&amp;#xC81C; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; windbg&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C; &amp;#xC2A4;&amp;#xD504;&amp;#xB808;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC815;&amp;#xB9D0; &amp;#xC18D; &amp;#xD130;&amp;#xC838;&amp;#xC11C;;;; &amp;#xC81C; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0AC;&amp;#xC591;&amp;#xC774; &amp;#xB0AE;&amp;#xC544;&amp;#xC11C;&amp;#xB3C4; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC608; &amp;#xBED7;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; windbg&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB354;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB2E8;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB97C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xCE58;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB9CC; &amp;#xB531; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xD3B8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;&amp;#xACE0;&amp;#x2026; &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; CUI&amp;#xB77C;&amp;#xB294; &amp;#xAC8C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD558;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xC4F0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2F9;.  &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://windbg.info/doc/1-common-cmds.html&#34;&gt;http://windbg.info/doc/1-common-cmds.html&lt;/a&gt; &lt;/p&gt;
&lt;p&gt;windbg &amp;#xC4F8; &amp;#xB54C; &amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC606;&amp;#xC5D0; &amp;#xB744;&amp;#xC6CC;&amp;#xB193;&amp;#xACE0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xC368;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xB098;&amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xC548; &amp;#xBCF4;&amp;#xACE0;&amp;#xB3C4; &amp;#xC798; &amp;#xC4F0;&amp;#xB294; &amp;#xB098; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC544;&amp;#xAE4C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xC704; &amp;#xAC12;&amp;#xB4E4;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xACE0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;0x41&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xB2E4;&amp;#xC74C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--020.png&#34; alt=&#34;./bughunting-tutorials-part3/image--020.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;eax&lt;/code&gt;&amp;#xAC00; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB123;&amp;#xC740; &lt;code&gt;0x41414141&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774; &amp;#xAC12;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xC624;&amp;#xB294;&amp;#xC9C0; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--022.png&#34; alt=&#34;./bughunting-tutorials-part3/image--022.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &lt;code&gt;eip&lt;/code&gt; &amp;#xBC14;&amp;#xB85C; &amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;esp&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;eax&lt;/code&gt;&amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB124;&amp;#xC694;. &amp;#xC789; &amp;#xADFC;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC778;&amp;#xB370;???(&amp;#xC774;&amp;#xAC70; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC624;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC544;&amp;#xB2C8;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;;;;)&lt;br&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--024.png&#34; alt=&#34;./bughunting-tutorials-part3/image--024.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB54;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB9CE;&amp;#xC774; &amp;#xC788;&amp;#xB124;&amp;#xC694;;;; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xAC74; &lt;code&gt;0x0725f056&lt;/code&gt; ~ &lt;code&gt;0x0753b70d&lt;/code&gt; &amp;#xC815;&amp;#xB3C4;&amp;#xC778; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xC774; &amp;#xC911; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xAC78;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0;&amp;#xC694;. &amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xBB54; &amp;#xAC08; &amp;#xC54C; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC81C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--026.png&#34; alt=&#34;./bughunting-tutorials-part3/image--026.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC800; &lt;code&gt;WARNING&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xB72C; &amp;#xBD80;&amp;#xBD84;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xBABB; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xB300;&amp;#xB85C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC54C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xD1B5; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xB370; &amp;#x201C;&amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4;&amp;#x201D; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#x201C;&amp;#xBC14;&amp;#xD140;&amp;#xC5C5;&amp;#x201C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC88C;&amp;#xC6B0;&amp;#xB85C; &amp;#xAC08; &amp;#xC21C; &amp;#xC5C6;&amp;#xC796;&amp;#xC544;&amp;#xC694;?)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--028.png&#34; alt=&#34;./bughunting-tutorials-part3/image--028.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB09C; &amp;#xADF8; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC704;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xC880; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCFC; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;&amp;#xAC00; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370;&amp;#x2026; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xC131;&amp;#xD5A5; &amp;#xD639;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB2E8;&amp;#xCD95;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xD604;&amp;#xBA85;&amp;#xD55C; &amp;#xC120;&amp;#xD0DD;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xCC3E;&amp;#xC744; &amp;#xACB8; &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC2DC;&amp;#xAC04; &amp;#xC878;&amp;#xB77C; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;.) &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xD0D1;&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xD560;&amp;#xC9C0; &amp;#xC798; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. dib &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC6CC;&amp;#xB099; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC791;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB7C9;&amp;#xC774; &amp;#xBC29;&amp;#xB300;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xCC98;&amp;#xC74C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD5E4;&amp;#xB354; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; BM&amp;#xC774;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xBD84;&amp;#xBA85; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC544;&amp;#xC774;&amp;#xB2E4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;BM&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--030.jpg&#34; alt=&#34;./bughunting-tutorials-part3/image--030.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB294;&amp;#x2026; &amp;#xB9DD;.. &amp;#xC5C6;&amp;#xB124;&amp;#x2026;. &amp;#xB2E4;&amp;#xB978; &amp;#xAC74; &amp;#xB2E4; &amp;#xC788;&amp;#xB358;&amp;#xB370;&amp;#x2026; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xB0B4; &amp;#xB9D8;&amp;#xB300;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xAD70;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xD3B8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xBCFC; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--032.png&#34; alt=&#34;./bughunting-tutorials-part3/image--032.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC911;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC70;&amp;#xB098; &amp;#xD55C; &amp;#xBC88; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--034.png&#34; alt=&#34;./bughunting-tutorials-part3/image--034.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB77C;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; &amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &lt;code&gt;call&lt;/code&gt;&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &lt;code&gt;ret&lt;/code&gt;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8;&amp;#xB0E5; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC744; &amp;#xBFD0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB807;&amp;#xAC8C; &lt;code&gt;dds&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xC778; &amp;#xAC83;&amp;#xB9CC;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD0DD; &amp;#xC880; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--036.png&#34; alt=&#34;./bughunting-tutorials-part3/image--036.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB9AC;&amp;#xD134; &amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB294; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;! &amp;#xADF8;&amp;#xB7FC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--038.png&#34; alt=&#34;./bughunting-tutorials-part3/image--038.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB728;&amp;#xBA74;&amp;#xC11C; &amp;#xB85C;&amp;#xB529;&amp;#xC774; &amp;#xC880; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &lt;code&gt;sxe ld ImLoader.dll&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xCE58;&amp;#xBA74; &lt;code&gt;ImLoader.dll&lt;/code&gt; &amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB420; &amp;#xB54C; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC800;&amp;#xB807;&amp;#xAC8C; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB85C;&amp;#xB529;&amp;#xB418;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;. &amp;#xBAA8;&amp;#xB4C8;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xACE0; &amp;#xBE0C;&amp;#xD3EC;&amp;#xB97C; &amp;#xAC78;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC880; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--040.png&#34; alt=&#34;./bughunting-tutorials-part3/image--040.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC798; &amp;#xAC78;&amp;#xB9AC;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--042.png&#34; alt=&#34;./bughunting-tutorials-part3/image--042.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--044.png&#34; alt=&#34;./bughunting-tutorials-part3/image--044.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC911; &amp;#xB450; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xD5E4;&amp;#xB354;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC788;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB290; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/image--046.png&#34; alt=&#34;./bughunting-tutorials-part3/image--046.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x2026;&amp;#xB294; Fail&amp;#x2026;. &amp;#xAD1C;&amp;#xCC2E;&amp;#xC544;&amp;#xC694;&amp;#x2026; &amp;#xC774;&amp;#xB7F4; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;&amp;#x2026;. &amp;#xAF3C;&amp;#xC218; &amp;#xC4F0;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xC2E0;&amp;#xC758; &amp;#xACC4;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB9C8; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB2E4;&amp;#xB978; &amp;#xACF3;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xAC70;&amp;#xB098;&amp;#x2026; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC5EC;&amp;#xAE30;&amp;#xB3C4; &amp;#xC81C;&amp;#xC77C; &amp;#xC704;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xAC70;&amp;#xB098;&amp;#x2026; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xBB50; &amp;#xB2E4;&amp;#xB978; &amp;#xB370; &amp;#xBE0C;&amp;#xD3EC; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC368;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#xADF8; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; Part 4&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;Part-4-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#Part-4-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;Part 4 &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;Part 4 &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%203.png&#34; alt=&#34;./bughunting-tutorials-part3/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;EIP&amp;#xAC00; &amp;#xC548;&amp;#xC7A1;&amp;#xD788;&amp;#xC796;&amp;#xC544;!!!!&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/03/24/l0ch/bughunting-tutorials-part3/image--028.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/">

  <title>[Research] 버그헌팅 튜토리얼 Part 3 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-24 18:00" pubdate>
      2021년 3월 24일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.5k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      70
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 버그헌팅 튜토리얼 Part 3</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><a href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 1</a> </p>
<p><a href="https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 2</a></p>
<p>&#xC800;&#xBC88; &#xAE00;&#xC5D0;&#xC11C; &#xC608;&#xACE0;&#xD588;&#xB358; &#xB300;&#xB85C;, &#xBCF8;&#xACA9;&#xC801;&#xC778; &#xBD84;&#xC11D;&#xC744; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xBC88; &#xAE00;&#xC740; &#xC0BD;&#xC9C8;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD574; &#xC0BD;&#xC9C8;&#xB85C; &#xB05D;&#xB098;&#xB294; &#xAE00;&#xC774;&#xBBC0;&#xB85C; &#xBA58;&#xD0C8; &#xB098;&#xAC10;&#xC5D0; &#xC720;&#xC758;&#xD558;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;&#x2026; &#xBB50; &#xC5B4;&#xCA0C;&#xB4E0; &#xC775;&#xC2A4; &#xD558;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB418;&#xB2C8;&#xAE4C;&#xC694;! &#xADF8;&#xB7FC; Part 3 &#xC2DC;&#xC791;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="From-Crash-to-Exploit"><a href="#From-Crash-to-Exploit" class="headerlink" title="From Crash to Exploit"></a>From Crash to Exploit</h1><p>&#xC774;&#xC81C; &#xC81C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xB098;&#xC654;&#xB358; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.(&#xC704;&#xC5D0; &#xC788;&#xB294; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xB85C; &#xB3CC;&#xB9B0; &#xAC74; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC800;&#xB3C4; &#xADC0;&#xCC2E;&#xC544;&#xC11C; &#xADF8;&#xB0E5; &#xD06C;&#xB864;&#xB9C1;&#xD574;&#xC11C; &#xC37C;&#xC5B4;&#xC694; &#x314E;&#x314E;) </p>
<p>&#xC77C;&#xB2E8; &#xD06C;&#xB798;&#xC2DC; &#xD3F4;&#xB354;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xBA74; &#xC774;&#xB807;&#xAC8C; &#xD30C;&#xC77C;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--016.jpg" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--016.jpg"></p>
<p>&#xB2E4;&#xB978; &#xAC70;&#xB97C; &#xBA3C;&#xC800; &#xBCF4;&#xAE30; &#xC804;&#xC5D0; &#xBA3C;&#xC800; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xC7AC;&#xD604;&#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xAC04;&#xD639; &#xAC00;&#xB2E4;&#xAC00; &#xC7AC;&#xD604;&#xC774; &#xC548; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD799; &#xBB38;&#xC81C;&#xC5EC;&#xC11C; &#xC7AC;&#xD604;&#xC774; &#xC548; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB300;&#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. &#xC7AC;&#xD604;&#xC774; &#xC798; &#xC548; &#xB418;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xC77C; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xAE30;&#xC5D0;&#xB3C4; &#xD798;&#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC7AC;&#xD604;&#xB418;&#xB294; &#xD655;&#xB960;&#xC744; &#xBCF4;&#xACE0; &#xD655;&#xB960;&#xC774; &#xB108;&#xBB34; &#xB0AE;&#xC73C;&#xBA74; &#xB2E4;&#xB978; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC2DC;&#xB294; &#xAC83;&#xC744; &#xCD94;&#xCC9C;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC7AC;&#xD604;&#xC774; &#xB418;&#xB294; &#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD560; &#xB54C;&#xC5D0;&#xB294; JIT &#xBAA8;&#xB4DC;&#xB85C; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xBD99;&#xC778; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xC548; &#xBD99;&#xC778; &#xC0C1;&#xD0DC;&#xB791; &#xD799; &#xBC30;&#xC815; &#xB4F1;&#xC774; &#xC870;&#xAE08;&#xC529; &#xB2EC;&#xB77C;&#xC11C; &#xC7AC;&#xD604;&#xC774; &#xB418;&#xB358; &#xAC8C; &#xC548;&#xB418;&#xAE30;&#xB3C4; &#xD558;&#xACE0; &#xC774;&#xC0C1;&#xD55C; &#xB370;&#xC11C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB098;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. Windbg&#xC758; &#xACBD;&#xC6B0; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xD0A8; CMD &#xCC3D;&#xC5D0;&#xC11C; <code>windbg &#x2013;I</code> &#xBA85;&#xB839;&#xC5B4;&#xB9CC; &#xC785;&#xB825;&#xD558;&#xBA74; &#xBC14;&#xB85C; JIT &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC7AC;&#xD604;&#xC774; &#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C; &#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xBCF4;&#xD1B5; msec &#xD655;&#xC7A5;&#xC790; &#xC804;&#xC5D0; <code>e0</code>&#xC73C;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xBD05;&#xB2C8;&#xB2E4;. msec &#xD30C;&#xC77C;&#xC740; &#xD06C;&#xB798;&#xC2DC; &#xBC1C;&#xC0DD; &#xB54C;&#xC758; &#xBAA8;&#xB4E0; &#xB85C;&#xADF8;&#xB97C; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xB370;&#xC694;. <code>e0</code>&#xC774; &#xC544;&#xB9C8; &#xCC98;&#xC74C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xB0AC;&#xC744; &#xB54C;&#xC758; &#xB85C;&#xADF8; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADFC;&#xB370; &#xB2E4;&#xB978; &#xAC70; &#xBD10;&#xB3C4; &#xB418;&#xAE34; &#xD558;&#xB294; &#xB370; &#xC800;&#xB294; &#xBCF4;&#xD1B5; &#xC774;&#xAC70; &#xD558;&#xB098;&#xB9CC; &#xBD10;&#xC694;. &#xC55E;&#xC5D0; &#xAC83;&#xB4E4;&#xC740; &#xC880; &#xB6F0;&#xC5B4;&#xB118;&#xACE0; &#xB4A4;&#xC5D0; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xC815;&#xBCF4;&#xB4E4;&#xBD80;&#xD130; &#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/Untitled.png"></p>
<p>&#xC6B4; &#xC88B;&#xAC8C; &#xBC14;&#xB85C; <code>call</code>&#xC5D0;&#xC11C; &#xD130;&#xC84C;&#xB124;&#xC694;!!! &#xBB50; &#xC774;&#xAC70;&#xB294; &#xC6B4;&#xC774; &#xC88B;&#xC740; &#xACBD;&#xC6B0;&#xB2C8;&#xAE4C; &#x3160;&#x3160; &#xBCF4;&#xD1B5; &#xB2E4;&#xB978; &#xD06C;&#xB798;&#xC2DC;&#xB4E4;&#xC740; <code>call</code>&#xC774;&#xB098; <code>jmp</code>&#xC5D0;&#xC11C; &#xB098;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xAC70;&#xC758; &#xC5C6;&#xC8E0; &#x3160;&#x3160;&#x3160; &#xADF8;&#xB798;&#xB3C4; &#xBD84;&#xC11D; &#xBC29;&#xBC95;&#xC740; &#xB611;&#xAC19;&#xC73C;&#xB2C8;&#xAE4C; &#xAC4D; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD06C;&#xB798;&#xC2DC;&#xC758; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC81C;&#xAC00; &#xC778;&#xD130;&#xB137;&#xC5D0;&#xC11C; &#xD06C;&#xB864;&#xB9C1;&#xD574;&#xC11C; &#xB123;&#xC740; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC774;&#xB77C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBB50;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB294;&#xC9C0; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xC704;&#xC5D0;&#xC11C; &#xCC98;&#xB7FC; &#xC9C1;&#xC811; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; &#xD558;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC9C0;&#xB9CC; &#xADC0;&#xCC28;&#xB2C8;&#xC998;&#xC774; &#xBC1C;&#xB3D9;&#xD558;&#xACE0; &#xC9C1;&#xC811; &#xB9CC;&#xB4E4;&#xAE30; &#xD798;&#xB4E0; &#xD30C;&#xC77C;&#xB4E4;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC778;&#xD130;&#xB137;&#xC5D0;&#xC11C; &#xD06C;&#xB864;&#xB9C1;&#xD574;&#xC624;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. (&#xC0AC;&#xC2E4; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xB294; &#xADC0;&#xCC2E;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;)</p>
<p>&#xC554;&#xD2BC; &#xC774;&#xB7F4; &#xB54C;&#xC5D0;&#xB294; &#xBA3C;&#xC800; hxd&#xB85C; &#xCEE8;&#xD2B8;&#xB864;&#xB41C; &#xAC12;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xB294; &#xAC8C; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B4;&#xC774; &#xC88B;&#xC73C;&#xBA74; &#xC9C4;&#xC9DC; &#xCEE8;&#xD2B8;&#xB864;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC12;&#xC774; &#xBC14;&#xB85C; &#xC788;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xAC70;&#xB4E0;&#xC694;. &#xC800;&#xB3C4; &#xC774; &#xD30C;&#xC77C;&#xC744; &#xBD84;&#xC11D;&#xD560; &#xB54C; &#xC6B4;&#xC774; &#xC88B;&#xAC8C;&#xB3C4; <code>ecx</code>&#xC758; &#xAC12;&#xC774; &#xBC14;&#xB85C; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xACE0; &#xBC14;&#xB85C; <code>ecx</code>&#xB97C; &#xCEE8;&#xD2B8;&#xB864;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xB4A4;&#xC5D0; &#xB098;&#xC624;&#xACA0;&#xC9C0;&#xB9CC; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; ASLR &#xC774; &#xAC78;&#xB824;&#xC788;&#xC5B4;&#xC11C; &#xD070; &#xC758;&#xBBF8;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;) &#xBCF4;&#xD1B5; &#xAC12;&#xC5D0;&#xC11C; &#xB354;&#xD558;&#xAC70;&#xB098; &#xBE7C;&#xAC70;&#xB098; &#xB610; &#xD3EC;&#xC778;&#xD130;&#xB85C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xB2E4;&#xB978; &#xAC12;&#xC744; &#xAC00;&#xC838;&#xC624;&#xAC70;&#xB098; &#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9CE;&#xC740; &#xAE30;&#xB300;&#xB97C; &#xD558;&#xBA74; &#xC548; &#xB429;&#xB2C8;&#xB2E4;&#x2026;. &#xD6C4;&#xC6B0;&#x2026; </p>
<p>&#xC774; &#xC815;&#xB3C4;&#xB85C;&#xB294; &#xB300;&#xCDA9; &#xC54C;&#xC558;&#xACE0; &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%201.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/Untitled%201.png"></p>
<p>&#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xC9C1;&#xC804; &#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xB4E4;&#xC774; &#xBD88;&#xB824;&#xC84C;&#xB294;&#xC9C0; &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC774;&#xB798; &#xB193;&#xACE0; &#xC2E4;&#xC81C;&#xB85C; &#xB514;&#xBC84;&#xAC70;&#xC5D0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xCF5C; &#xC2A4;&#xD0DD;&#xC774; &#xAE68;&#xC838;&#xC788;&#xAC70;&#xB098; &#xC880; &#xB2E4;&#xB974;&#xAC70;&#xB098; &#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xB294; &#xB370; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xADF8;&#xB0E5; &#xCC38;&#xACE0;&#xB9CC; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C;&#xB294; !exlploitable &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; &#xB098;&#xC628; &#xACB0;&#xACFC;&#xBB3C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%202.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/Untitled%202.png"></p>
<p>BFF&#xC5D0;&#xC11C;&#xB294; !exploitable &#xC758; &#xACB0;&#xACFC;&#xB85C; &#xD574;&#xB2F9; &#xD06C;&#xB798;&#xC2DC;&#xAC00; exploitable &#xD55C; &#xC9C0; &#xC548; &#xD55C; &#xC9C0;&#xB97C; &#xD310;&#xB2E8;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC2E4; exploitable&#xB85C; &#xB098;&#xC628; &#xAC70;&#xB294; &#xADF8;&#xB7F4;&#xC2F8;&#xD558;&#xAE34; &#xD55C;&#xB370; &#xB2E4;&#xB978; &#xAC70;&#xB294; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xB124;&#xC694;. &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C;&#xB294; Unknown&#xC5D0; &#xC788;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xB4E4;&#xC774; &#xB354; &#xC775;&#xC2A4; &#xC798;&#xB41C;&#xB2E4;&#xB294; &#xB9D0;&#xC774; &#xB9CE;&#xC544;&#xC11C; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xC65C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB0AC;&#xB294;&#xC9C0;, exploitable &#xD55C; &#xC774;&#xC720;&#xAC00; &#xBB54;&#xC9C0;&#xB9CC; &#xCC38;&#xACE0;&#xD558;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC5B4;&#xB5A4; &#xC720;&#xD615;&#xC758; &#xD06C;&#xB798;&#xC2DC;&#xC778;&#xC9C0; &#xD30C;&#xC545;&#xC744; &#xD588;&#xACE0; &#xC774;&#xAC8C; &#xC775;&#xC2A4; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xB418;&#xBA74; &#xC5B4;&#xB5A4; &#xBC14;&#xC774;&#xD2B8;&#xAC00; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xB418;&#xC5C8;&#xB294; &#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xD30C;&#xC77C;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xC54C;&#xC558;&#xC73C;&#xB2C8; &#xC5B4;&#xB5A4; &#xBC14;&#xC774;&#xD2B8;&#xAC00; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xB418;&#xC5C8;&#xB294; &#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD55C;&#xB2E4;&#xBA74; &#xADF8; &#xBC14;&#xC774;&#xD2B8;&#xAC00; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xB300;&#xCDA9;&#xC740; &#xC54C; &#xC218; &#xC788;&#xACE0; &#xC65C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB294;&#xC9C0; &#xCD94;&#xCE21;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACA0;&#xC8E0;.</p>
<p>Hxd&#xB85C; &#xC624;&#xB9AC;&#xC9C0;&#xB110; &#xD30C;&#xC77C;&#xACFC; minimized &#xB41C; &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xC5B4;&#xC11C; ctrl+k &#xB97C; &#xB204;&#xB974;&#xBA74; &#xB450; &#xD30C;&#xC77C;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--018.jpg" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--018.jpg"></p>
<pre><code class="hljs c">BITMAPINFOHEADER.biSize : <span class="hljs-number">0x00</span> -&gt; <span class="hljs-number">0x1f</span>
BITMAPINFOHEADER.biCompression : <span class="hljs-number">0x00</span> -&gt; <span class="hljs-number">0x0A</span>
BITMAPINFOHEADER.biClrUsed : <span class="hljs-number">0x00</span> -&gt; <span class="hljs-number">0x02</span></code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xBC14;&#xB00C;&#xC5C8;&#xB124;&#xC694;. <code>BiSize</code> &#xB294; <code>BITMAPINFOHEADER</code> &#xC758; &#xD06C;&#xAE30;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xB370; &#xC704;&#xC5D0; &#xBCF8; &#xAD6C;&#xC870;&#xB85C;&#xB294; &#xC544;&#xBB34;&#xB9AC; &#xBD10;&#xB3C4; &#xD06C;&#xAE30;&#xAC00; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC5C6;&#xB2E4;&#xB294; &#xAC78; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#x201C;&#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC640;&#xC11C; &#xBCF5;&#xC0AC;&#xB97C; &#xD558;&#xB294; &#xB370; &#xC774; &#xB370;&#xC774;&#xD130;&#xAC00; &#xAE30;&#xC874; &#xD06C;&#xAE30;&#xBCF4;&#xB2E4; &#xD06C;&#xAC8C; &#xB418;&#xBA74;&#xC11C; &#xBCF5;&#xC0AC;&#xB97C; &#xB354; &#xB9CE;&#xC774; &#xD558;&#xAC8C; &#xB41C;&#xACE0; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;&#x201D;&#xB77C;&#xACE0; &#xCD94;&#xCE21;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>biCompression</code> &#xACFC; <code>biClrUsed</code> &#xB294; &#xAC01;&#xAC01; &#xC555;&#xCD95; &#xBC29;&#xC2DD; &#xADF8;&#xB9AC;&#xACE0; &#xC0AC;&#xC6A9;&#xB41C; &#xC0C9;&#xC0C1;&#xC218;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xB294;&#xB370; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xD574;&#xBD10;&#xC57C;&#xC9C0; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD560; &#xAC74;&#xB370; &#xC0AC;&#xC2E4; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xD558;&#xAE30; &#xC804; &#xD639;&#xC740; &#xD558;&#xBA74;&#xC11C; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB290; &#xC815;&#xB3C4;&#xB294; &#xCD94;&#xCE21;&#xC744; &#xD558;&#xACE0; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB300;&#xB85C; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xD558;&#xBA74; &#xD655;&#xC2E4;&#xC774; &#xADF8;&#xB0E5; &#xB9C9;&#xBB34;&#xAC00;&#xB0B4;&#xB85C; &#xD558;&#xB294; &#xAC83;&#xBCF4;&#xB2E4;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xB35C; &#xC18C;&#xBAA8;&#xB418;&#xACE0; &#xD654;&#xAC00; &#xB35C; &#xB0A9;&#xB2C8;&#xB2E4; &#x314E;&#x314E; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xC77C;&#xBD80;&#xB85C; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xC791;&#xC131; &#xC548; &#xD558;&#xACE0; &#xC9C4;&#xD589;&#xD560; &#xAC83;&#xC774;&#xC9C0;&#xB9CC; &#xC774; &#xAE00;&#xC744; &#xB2E4; &#xC77D;&#xACE0; &#xC2E4;&#xC81C;&#xB85C; &#xC9C4;&#xD589;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xB300;&#xB7B5;&#xC801;&#xC778; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xB450;&#xACE0; &#xC9C4;&#xD589;&#xD558;&#xBA74; &#xC88B;&#xACA0;&#xC8E0;.</p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xB514;&#xBC84;&#xAC70;&#xC5D0; &#xBD99;&#xC5EC;&#xC11C; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xD574;&#xBCFC;&#xAC8C;&#xC694;. &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xBAA8;&#xB450; windbg&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCC98;&#xC74C; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC744; &#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC774;&#xC804;&#xBD80;&#xD130; &#xC368;&#xC624;&#xAE30;&#xB3C4; &#xD588;&#xACE0; GUI &#xAC00; &#xD55C;&#xB208;&#xC5D0; &#xB531; &#xB4E4;&#xC5B4;&#xC640;&#xC11C; &#xC774;&#xBBA4;&#xB2C8;&#xD2F0;&#xB97C; &#xC4F0;&#xAE34; &#xD588;&#xB294; &#xB370; &#xC18D;&#xB3C4; &#xBB38;&#xC81C; &#xB54C;&#xBB38;&#xC5D0; windbg&#xB85C; &#xB118;&#xC5B4;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xC775;&#xC2A4; &#xD560; &#xB54C; &#xC2A4;&#xD504;&#xB808;&#xC774;&#xB97C; &#xD574;&#xC57C; &#xD558;&#xB294; &#xB370; &#xC815;&#xB9D0; &#xC18D; &#xD130;&#xC838;&#xC11C;;;; &#xC81C; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xC0AC;&#xC591;&#xC774; &#xB0AE;&#xC544;&#xC11C;&#xB3C4; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xC544;&#xC608; &#xBED7;&#xC5B4;&#xBC84;&#xB9AC;&#xB354;&#xB77C;&#xAD6C;&#xC694;. &#xADF8;&#xB798;&#xC11C; windbg&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xB354;&#xB2C8; &#xC2DC;&#xAC04;&#xC774; &#xB9CE;&#xC774; &#xB2E8;&#xCD95;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC4F0;&#xB2E4; &#xBCF4;&#xB2C8;&#xAE4C; &#xC6D0;&#xD558;&#xB294; &#xAC70;&#xB97C; &#xBA85;&#xB839;&#xC5B4;&#xB9CC; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xCE58;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xAC83;&#xB9CC; &#xB531; &#xBCFC; &#xC218; &#xC788;&#xC5B4;&#xC11C; &#xD3B8;&#xD558;&#xAE30;&#xB3C4; &#xD574;&#xACE0;&#x2026; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC4F0;&#xACE0; &#xC788;&#xB124;&#xC694; &#x314B;&#x314B; &#xCC98;&#xC74C;&#xC5D0;&#xB294; CUI&#xB77C;&#xB294; &#xAC8C; &#xC880; &#xB9CE;&#xC774; &#xC5B4;&#xC0C9;&#xD558;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C; &#xACC4;&#xC18D; &#xC4F0;&#xB2E4; &#xBCF4;&#xBA74; &#xC775;&#xC219;&#xD574;&#xC9D1;&#xB2C8;&#xB2F9;.  </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://windbg.info/doc/1-common-cmds.html">http://windbg.info/doc/1-common-cmds.html</a> </p>
<p>windbg &#xC4F8; &#xB54C; &#xC704; &#xB9C1;&#xD06C;&#xB97C; &#xC606;&#xC5D0; &#xB744;&#xC6CC;&#xB193;&#xACE0; &#xC6D0;&#xD558;&#xB294; &#xAC70; &#xD558;&#xB098;&#xD558;&#xB098; &#xCC3E;&#xC544;&#xAC00;&#xBA74;&#xC11C; &#xC368;&#xBCF4;&#xC2DC;&#xBA74; &#xB3C4;&#xC6C0;&#xC774; &#xB9CE;&#xC774; &#xB420; &#xAC70; &#xAC19;&#xB124;&#xC694;. &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xBCF4;&#xBA74;&#xC11C; &#xD558;&#xB2E4;&#xAC00; &#xB098;&#xC911;&#xC5D0;&#xB294; &#xC548; &#xBCF4;&#xACE0;&#xB3C4; &#xC798; &#xC4F0;&#xB294; &#xB098; &#xC790;&#xC2E0;&#xC744; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xADF8;&#xB7FC; &#xC544;&#xAE4C; &#xC9C1;&#xC811; &#xC81C;&#xC791;&#xD55C; &#xD30C;&#xC77C;&#xC5D0; &#xB611;&#xAC19;&#xC774; &#xAC12;&#xB4E4;&#xC744; &#xC704; &#xAC12;&#xB4E4;&#xB85C; &#xBC14;&#xAFB8;&#xACE0; &#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; <code>0x41</code>&#xB85C; &#xBC14;&#xAFBC; &#xB2E4;&#xC74C; &#xB514;&#xBC84;&#xAC70;&#xB85C; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--020.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--020.png"></p>
<p><code>eax</code>&#xAC00; &#xC6B0;&#xB9AC;&#xAC00; &#xB123;&#xC740; <code>0x41414141</code>&#xB85C; &#xBC14;&#xB00C;&#xC5C8;&#xB124;&#xC694;. &#xADF8;&#xB7FC; &#xC774; &#xAC12;&#xC774; &#xC5B4;&#xB514;&#xC11C; &#xC624;&#xB294;&#xC9C0; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--022.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--022.png"></p>
<p>&#xD604;&#xC7AC; <code>eip</code> &#xBC14;&#xB85C; &#xC704; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xBCF4;&#xBA74; <code>esp</code>&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xC8FC;&#xC18C;&#xC5D0;&#xC11C; <code>eax</code>&#xAC12;&#xC744; &#xAC00;&#xC838;&#xC624;&#xB124;&#xC694;. &#xC789; &#xADFC;&#xB370; &#xC5EC;&#xAE30; &#xC2A4;&#xD0DD;&#xC778;&#xB370;???(&#xC774;&#xAC70; &#xC2A4;&#xD0DD; &#xC624;&#xBC84; &#xCDE8;&#xC57D;&#xC810; &#xC544;&#xB2C8;&#xC5C8;&#xB294;&#xB370;;;;)<br>&#xADF8;&#xB7FC; &#xC6B0;&#xB9AC;&#xAC00; &#xB9CC;&#xB4E0; &#xD30C;&#xC77C;&#xC774; &#xC5B4;&#xB514;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--024.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--024.png"></p>
<p>&#xBB54;&#xAC00; &#xB9E4;&#xC6B0; &#xB9CE;&#xC774; &#xC788;&#xB124;&#xC694;;;; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;&#xAC00; &#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC62C;&#xB77C;&#xC640; &#xC788;&#xB294; &#xAC74; <code>0x0725f056</code> ~ <code>0x0753b70d</code> &#xC815;&#xB3C4;&#xC778; &#xAC70; &#xAC19;&#xB124;&#xC694;. &#xADF8;&#xB9AC;&#xACE0; &#xC2A4;&#xD0DD;&#xC5D0; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xB294; &#xC774; &#xC911; &#xC5B4;&#xB518;&#xAC00;&#xC5D0;&#xC11C; &#xAC12;&#xC744; &#xAC00;&#xC838;&#xC628; &#xAC78;&#xB85C; &#xBCF4;&#xC774;&#xACE0;&#xC694;. &#xC544;&#xC9C1;&#xC740; &#xBB54; &#xAC08; &#xC54C; &#xC218;&#xB294; &#xC5C6;&#xB124;&#xC694;. &#xC774;&#xC81C; &#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xBCF4;&#xBA74;&#xC11C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD588;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--026.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--026.png"></p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xC800; <code>WARNING</code>&#xC774;&#xB77C;&#xACE0; &#xB72C; &#xBD80;&#xBD84;&#xC778;&#xB370;&#xC694;. &#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; &#xCF5C; &#xC2A4;&#xD0DD;&#xC744; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xCE74;&#xC6B4;&#xD130;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294;&#xB370; &#xC774;&#xAC8C; &#xC798;&#xBABB;&#xB418;&#xC5B4;&#xC11C; &#xC81C;&#xB300;&#xB85C; &#xBABB; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC800;&#xB300;&#xB85C; &#xB530;&#xB77C;&#xAC00;&#xB3C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xC54C; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xC5B4;&#xB5BB;&#xAC8C; &#xBD84;&#xC11D;&#xC744; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694; &#x3160;&#x3160;&#x3160;</p>
<p>&#xBCF4;&#xD1B5; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xB294; &#xB370; &#x201C;&#xD0D1;&#xB2E4;&#xC6B4;&#x201D; &#xBC29;&#xC2DD;&#xACFC; &#x201C;&#xBC14;&#xD140;&#xC5C5;&#x201C; &#xBC29;&#xC2DD;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xB2F9;&#xC5F0;&#xD788; &#xC704;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xB85C; &#xC544;&#xB798;&#xC5D0;&#xC11C; &#xC704;&#xB85C; &#xAC00;&#xC9C0; &#xC88C;&#xC6B0;&#xB85C; &#xAC08; &#xC21C; &#xC5C6;&#xC796;&#xC544;&#xC694;?)</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--028.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--028.png"></p>
<p>&#xBB50; &#xC554;&#xD2BC; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB09C; &#xADF8; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xC704;&#xB85C; &#xC62C;&#xB77C;&#xAC00;&#xBA74;&#xC11C; &#xBCFC; &#xAC83;&#xC774;&#xB0D0; &#xC544;&#xB2C8;&#xBA74; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB098;&#xB294; &#xBD80;&#xBD84; &#xC880; &#xC704;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;&#xB97C; &#xBCFC; &#xAC83;&#xC774;&#xB0D0;&#xAC00; &#xBB38;&#xC81C;&#xC778;&#xB370;&#x2026; &#xC774;&#xAC70;&#xB294; &#xAC01;&#xC790;&#xC758; &#xC131;&#xD5A5; &#xD639;&#xC740; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xACB0;&#xC815;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xCD5C;&#xB300;&#xD55C; &#xBD84;&#xC11D; &#xBC94;&#xC704;&#xB97C; &#xC904;&#xC5EC;&#xC11C; &#xB9AC;&#xBC84;&#xC2F1; &#xC2DC;&#xAC04;&#xC744; &#xB2E8;&#xCD95;&#xC2DC;&#xD0A4;&#xB294; &#xAC8C; &#xC81C;&#xC77C; &#xD604;&#xBA85;&#xD55C; &#xC120;&#xD0DD;&#xC774;&#xC9C0;&#xB9CC; &#xC800; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xB294; &#xB2E4;&#xB978; &#xCDE8;&#xC57D;&#xC810;&#xB3C4; &#xCC3E;&#xC744; &#xACB8; &#xD0D1;&#xB2E4;&#xC6B4; &#xBC29;&#xC2DD;&#xC744; &#xC120;&#xD638;&#xD558;&#xB294; &#xD3B8;&#xC785;&#xB2C8;&#xB2E4;.(&#xC2DC;&#xAC04; &#xC878;&#xB77C; &#xC624;&#xB798; &#xAC78;&#xB9AC;&#xC9C0;&#xB9CC;&#x2026;.) &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xD0D1;&#xB2E4;&#xC6B4; &#xBC29;&#xC2DD;&#xC744; &#xC9C4;&#xD589;&#xD560; &#xB54C; &#xC5B4;&#xB514;&#xC11C;&#xBD80;&#xD130; &#xD560;&#xC9C0; &#xC798; &#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. dib &#xD3EC;&#xB9F7;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC6CC;&#xB099; &#xAD6C;&#xC870;&#xAC00; &#xB2E8;&#xC21C;&#xD574;&#xC11C; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD560; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xAC00; &#xC791;&#xC9C0;&#xB9CC; &#xB2E4;&#xB978; &#xD3EC;&#xB9F7;&#xC758; &#xACBD;&#xC6B0; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD560; &#xCF54;&#xB4DC;&#xB7C9;&#xC774; &#xBC29;&#xB300;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBD84;&#xC11D;&#xD560; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xB41C; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xACE0; &#xC5B4;&#xB5A4; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xD30C;&#xC545;&#xD55C; &#xB2E4;&#xC74C;, &#xADF8; &#xBD80;&#xBD84;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xB0B4;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xCC98;&#xC74C; &#xD574;&#xC11D;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294;&#xB370; &#xD5E4;&#xB354; &#xBD80;&#xBD84;&#xC774; BM&#xC774;&#xC5C8;&#xC8E0;? &#xBD84;&#xBA85; &#xCF54;&#xB4DC;&#xC5D0; &#xD5E4;&#xB354;&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xACA0;&#xC8E0;. &#xADF8;&#xB798;&#xC11C; &#xC544;&#xC774;&#xB2E4;&#xC5D0;&#xC11C; <code>BM</code>&#xC774;&#xB77C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--030.jpg" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--030.jpg"></p>
<p>&#xB294;&#x2026; &#xB9DD;.. &#xC5C6;&#xB124;&#x2026;. &#xB2E4;&#xB978; &#xAC74; &#xB2E4; &#xC788;&#xB358;&#xB370;&#x2026; &#xC5ED;&#xC2DC; &#xC778;&#xC0DD;&#xC740; &#xB0B4; &#xB9D8;&#xB300;&#xB85C; &#xC548;&#xB418;&#xB294;&#xAD70;&#x2026; &#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xD3B8;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC5C6;&#xC73C;&#xB2C8; &#xC9C1;&#xC811; &#xCC3E;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4; &#x3160;&#x3160;</p>
<p>&#xCF5C; &#xC2A4;&#xD0DD;&#xC774; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xD558;&#xB098;&#xD558;&#xB098; &#xBCFC; &#xC218;&#xBC16;&#xC5D0; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--032.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--032.png"></p>
<p>&#xC774;&#xC911;&#xC5D0; &#xC544;&#xBB34;&#xAC70;&#xB098; &#xD55C; &#xBC88; &#xBCFC;&#xAC8C;&#xC694;. </p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--034.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--034.png"></p>
<p>&#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB77C;&#xBA74; &#xBC14;&#xB85C; &#xC704; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; <code>call</code>&#xC774;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370; <code>ret</code>&#xC774;&#xB124;&#xC694;. &#xC774; &#xC8FC;&#xC18C;&#xB294; &#xC6B0;&#xC5F0;&#xD788; &#xADF8;&#xB0E5; &#xADF8; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC744; &#xBFD0;&#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xB807;&#xAC8C; <code>dds</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC785;&#xB825;&#xD574;&#xC11C; &#xBCF4;&#xC774;&#xB294; &#xC8FC;&#xC18C;&#xB4E4;&#xC774; &#xBAA8;&#xB450; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xC778; &#xAC83;&#xB9CC;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD558;&#xB098;&#xD558;&#xB098; &#xD655;&#xC778;&#xC744; &#xD558;&#xACE0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD0DD; &#xC880; &#xC704;&#xC5D0;&#xC11C; &#xC720;&#xD6A8;&#xD55C; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xCC3E;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--036.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--036.png"></p>
<p>&#xC774; &#xB9AC;&#xD134; &#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB294; &#xAD1C;&#xCC2E;&#xC740; &#xAC70; &#xAC19;&#xB124;&#xC694;! &#xADF8;&#xB7FC; &#xC5EC;&#xAE30;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xACE0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--038.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--038.png"></p>
<p>&#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xC774;&#xB807;&#xAC8C; &#xB728;&#xBA74;&#xC11C; &#xB85C;&#xB529;&#xC774; &#xC880; &#xB290;&#xB9AC;&#xAC8C; &#xB418;&#xB294;&#xB370; <code>sxe ld ImLoader.dll</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xCE58;&#xBA74; <code>ImLoader.dll</code> &#xC774; &#xB85C;&#xB4DC;&#xB420; &#xB54C; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xC800;&#xB807;&#xAC8C; &#xB290;&#xB9AC;&#xAC8C; &#xB85C;&#xB529;&#xB418;&#xC9C0;&#xB294; &#xC54A;&#xACA0;&#xC8E0;. &#xBAA8;&#xB4C8;&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xACE0; &#xBE0C;&#xD3EC;&#xB97C; &#xAC78;&#xAC8C; &#xB418;&#xBA74; &#xC880; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--040.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--040.png"></p>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC6D0;&#xD558;&#xB294; &#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xC798; &#xAC78;&#xB9AC;&#xB124;&#xC694;. &#xADF8;&#xB7FC; &#xD30C;&#xC77C;&#xC774; &#xC5C5;&#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--042.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--042.png"></p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--044.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--044.png"></p>
<p>&#xC774; &#xC911; &#xB450; &#xBD80;&#xBD84;&#xB9CC; &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB124;&#xC694;. &#xADF8;&#xB7FC; &#xD5E4;&#xB354;&#xAE4C;&#xC9C0; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xD5E4;&#xB354; &#xBD80;&#xBD84;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xACE0; &#xC55E;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5B4;&#xB290; &#xBD80;&#xBD84;&#xC758; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/image--046.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/image--046.png"></p>
<p>&#x2026;&#xB294; Fail&#x2026;. &#xAD1C;&#xCC2E;&#xC544;&#xC694;&#x2026; &#xC774;&#xB7F4; &#xC218; &#xC788;&#xC8E0;&#x2026;. &#xAF3C;&#xC218; &#xC4F0;&#xC9C0; &#xB9D0;&#xACE0; &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xD558;&#xB77C;&#xB294; &#xC2E0;&#xC758; &#xACC4;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xB9C8; &#xD30C;&#xC77C; &#xC2A4;&#xD2B8;&#xB9BC;&#xC5D0;&#xC11C; &#xB2E4;&#xC2DC; &#xAC00;&#xC838;&#xC640; &#xBE44;&#xAD50;&#xB97C; &#xD558;&#xAC70;&#xB098; &#xB2E4;&#xC2DC; &#xB2E4;&#xB978; &#xACF3;&#xC5D0; &#xD560;&#xB2F9;&#xD558;&#xAC70;&#xB098;&#x2026; &#xC544;&#xB2C8;&#xBA74; &#xC5EC;&#xAE30;&#xB3C4; &#xC81C;&#xC77C; &#xC704;&#xAC00; &#xC544;&#xB2C8;&#xAC70;&#xB098;&#x2026; &#xC5EC;&#xB7EC; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xAC00; &#xC788;&#xC744; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. &#xBB50; &#xB2E4;&#xB978; &#xB370; &#xBE0C;&#xD3EC; &#xAC78;&#xC5B4;&#xC11C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xB3C4; &#xC368;&#xBCFC;&#xAC8C;&#xC694;. &#xADF8; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xC740; Part 4&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<h1 id="Part-4-&#xC608;&#xACE0;"><a href="#Part-4-&#xC608;&#xACE0;" class="headerlink" title="Part 4 &#xC608;&#xACE0;"></a>Part 4 &#xC608;&#xACE0;</h1><p><img src="/2021/03/24/l0ch/bughunting-tutorials-part3/Untitled%203.png" srcset="/img/loading.gif" alt="./bughunting-tutorials-part3/Untitled%203.png"></p>
<blockquote>
<p>EIP&#xAC00; &#xC548;&#xC7A1;&#xD788;&#xC796;&#xC544;!!!!</p>
</blockquote>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-hunting/">bug hunting</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/03/25/idioth/2021-03-25/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-27076: SharePoint Replay Style Deserialization 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/24/fabu1ous/2021-03-24/">
                    <span class="hidden-mobile">[하루한줄] Guix lpe via guix-daemon</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/';
        this.page.identifier = '/2021/03/24/l0ch/bughunting-tutorials-part3/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 버그헌팅 튜토리얼 Part 3&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
