

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(1) &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(2)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(3)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xD55C; &amp;#xB2EC; &amp;#xB9CC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C;&amp;#xBC88; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; third-party &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC6D0;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC; &amp;#xAC74;&amp;#xB370;&amp;#xC694;, &amp;#xC774;&amp;#xC81C; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xBB50;&amp;#xAC19;&amp;#xC774; &amp;#xC9D3;&amp;#xAE34; &amp;#xD588;&amp;#xB124;&amp;#xC694;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC65C; &amp;#xC800;&amp;#xB7AC;&amp;#xC744;&amp;#xAE4C;..? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled.png&#34; alt=&#34;windows-driver-part2/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB294; &amp;#xACF5;&amp;#xB300; &amp;#x201C;&amp;#xC544;&amp;#xC800;&amp;#xC528;&amp;#x201D;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;AMD-Ryzen-Master&#34;&gt;&lt;a href=&#34;#AMD-Ryzen-Master&#34; class=&#34;headerlink&#34; title=&#34;AMD Ryzen Master&#34;&gt;&lt;/a&gt;AMD Ryzen Master&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/AMD.png&#34; alt=&#34;windows-driver-part2/AMD.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; AMD Ryzen Master&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xC820; CPU&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4; &amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC800;&amp;#xB3C4; &amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xB77C;&amp;#xC774;&amp;#xC820; CPU&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC0AC;&amp;#xC11C; &amp;#xC778;&amp;#xC0DD; &amp;#xCCAB; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC744; &amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xBC14;&amp;#xC774;&amp;#xC624;&amp;#xC2A4; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB58; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC11C; &amp;#xC5BC;&amp;#xD0C0;&amp;#xB2E4;&amp;#xAC00; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4; &amp;#xD074;&amp;#xB9AD; &amp;#xBA87; &amp;#xBC88;&amp;#xC5D0; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC774; &amp;#xC9E0; &amp;#xD558;&amp;#xACE0; &amp;#xB41C;&amp;#xB2E4;&amp;#xAE38;&amp;#xB798; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC37C;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xBB3C;&amp;#xB860; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC124;&amp;#xC815; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xACB0;&amp;#xAD6D; &amp;#xBC14;&amp;#xC774;&amp;#xC624;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%201.png&#34; alt=&#34;windows-driver-part2/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xC54C;&amp;#xBABB;&amp;#x315C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC74; &amp;#xC5EC;&amp;#xB2F4;&amp;#xC778;&amp;#xB370;, &amp;#xC9C0;&amp;#xAE08; &amp;#xC4F0;&amp;#xB294; CPU&amp;#xAC00; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xC548;&amp;#xD55C; &amp;#xC21C;&amp;#xC815;&amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xB728;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xD558;&amp;#xBA74; &amp;#xBA40;&amp;#xCA61;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xC218;&amp;#xC728;&amp;#xC774; &amp;#xC88B;&amp;#xAE38;&amp;#xB798; &amp;#xADF8;&amp;#xB0E5; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;.. &amp;#xBB54;&amp;#xAC00; &amp;#xCC1D;&amp;#xCC1D;&amp;#xD55C; &amp;#xAC74; &amp;#xAE30;&amp;#xBD84; &amp;#xD0D3;&amp;#xC77C; &amp;#xAC70;&amp;#xC57C; &amp;#xC544;&amp;#xB9C8;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xC778;(&amp;#xC0C8;&amp;#xCEF4; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; &amp;#xC2E0;&amp;#xB0A8;) : &amp;#xB2D8;&amp;#xB4E4; &amp;#xC2DC;&amp;#xD4E8; &amp;#xC21C;&amp;#xC815;&amp;#xC740; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xB728;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xD558;&amp;#xBA74; &amp;#xC798; &amp;#xB3CC;&amp;#xC544;&amp;#xAC10; &amp;#x314B;&amp;#x314B; &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xC8E0;&lt;br&gt;??? : &amp;#xC6B0;&amp;#xB9B0; &amp;#xADF8;&amp;#xAC78; &amp;#xCD08;&amp;#xAE30; &amp;#xBD88;&amp;#xB7C9;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x2026;? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%202.png&#34; alt=&#34;windows-driver-part2/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; 1&amp;#xB144;&amp;#xC9F8; &amp;#xC798; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; AMD Ryzen Master&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2020-12928 &amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! OS&amp;#xD658;&amp;#xACBD;&amp;#xC740; Windows 10 &amp;#xBE4C;&amp;#xB4DC; 19043.1083&amp;#xC5D0;&amp;#xC11C;, &amp;#xD0C0;&amp;#xAC9F;&amp;#xC778; AMD Ryzen Master&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; AMDRyzenMasterDriverV15 &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;  2.1.1.1472 &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xD558;&amp;#xB8E8; &amp;#xC885;&amp;#xC77C; &amp;#xAC78;&amp;#xB824;&amp;#xBC84;&amp;#xB9BC; &amp;#x314E;&amp;#x314E;. .&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%203.png&#34; alt=&#34;windows-driver-part2/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544; &amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xAD6C;&amp;#xD558;&amp;#xAE30; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xC5B4;&amp;#xB824;&amp;#xC6E0;&amp;#xB2E4; &amp;#x3141;&amp;#x3134;&amp;#x3147;&amp;#x3139;&amp;#x3134;&amp;#x3147;&amp;#x3141;&amp;#x3139;&amp;#x3147;&amp;#x3141;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;.. &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xC124;&amp;#xCE58; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xAC00;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip.png&#34; alt=&#34;windows-driver-part2/tempsnip.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC8FC;&amp;#xC778;&amp;#xACF5; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC704; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kernel-Driver-Driver-Exploit&#34;&gt;&lt;a href=&#34;#Kernel-Driver-Driver-Exploit&#34; class=&#34;headerlink&#34; title=&#34;Kernel Driver / Driver Exploit&#34;&gt;&lt;/a&gt;Kernel Driver / Driver Exploit&lt;/h1&gt;&lt;p&gt;&amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xBD80;&amp;#xD130; &amp;#xC54C;&amp;#xC544;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows Kernel&amp;#xC740; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; Core Kernel(Microkernel)&amp;#xACFC; Device Driver &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Core &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xB294; Kernel&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; driver &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xAD6C;&amp;#xD604;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xC758; &amp;#xC7A5;&amp;#xC810;&amp;#xC740; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC720;&amp;#xC9C0;&amp;#xBCF4;&amp;#xC218;&amp;#xAC00; &amp;#xC6A9;&amp;#xC774;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%204.png&#34; alt=&#34;windows-driver-part2/Untitled%204.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows NT &amp;#xACC4;&amp;#xC5F4;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654; &amp;#xD55C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; Windows&amp;#xB294; User mode&amp;#xC640; Kernel mode&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. User mode&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC774;&amp;#xB54C; User mode &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; I/O Manager&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294;&amp;#xB370;, IOCTL(I/O Control) &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xB7F0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB354; &amp;#xD070; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xB07C;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(Privilege Escalation)&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; Microsoft&amp;#xAC00; &amp;#xBC14;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC880; &amp;#xB354; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD;&amp;#xC744; &amp;#xC368;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD588;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;? &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; MS&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC81C;&amp;#xC0BC;&amp;#xC790;(third-party)&amp;#xB3C4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xACE0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;third-party driver&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; &amp;#xCEE4;&amp;#xB110; &amp;#xB808;&amp;#xBCA8;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC31;&amp;#xC2E0;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;, &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1; &amp;#xB4F1;&amp;#xC758; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Microsoft&amp;#xAC00; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &amp;#xC790;&amp;#xAE30;&amp;#xB124; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC544;&amp;#xBB34;&amp;#xB9AC; &amp;#xC2EC;&amp;#xD608;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC; &amp;#xBC84;&amp;#xADF8; &amp;#xC5C6;&amp;#xC774; &amp;#xB0B4;&amp;#xB193;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F0; third-party driver&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD321;&amp;#xD321; &amp;#xD130;&amp;#xC9C8; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%205.png&#34; alt=&#34;windows-driver-part2/Untitled%205.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC998; &amp;#xD56B;&amp;#xD55C; PrintNightmare&amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB9B0;&amp;#xD130; &amp;#xC2A4;&amp;#xD480;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD130;&amp;#xC9C0;&amp;#xB294; &amp;#xAC70; &amp;#xBCF4;&amp;#xBA74; &amp;#xB9C8;&amp;#xC18C;&amp;#xB3C4; &amp;#xBB50;.. &amp;#xAC08; &amp;#xAE38;&amp;#xC774; &amp;#xBA3C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;&amp;#xC694; &amp;#x314E;&amp;#x314E;;;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xAE00;&amp;#xC744; &amp;#xBCF4;&amp;#xAE30; &amp;#xC804; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC544;&amp;#xB798; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/21/l0ch/exploiting-driver/&#34;&gt;[Translation] Exploiting System Mechanic Driver Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/28/l0ch/exploiting-driver-part2/&#34;&gt;[Translation] Exploiting System Mechanic Driver Part 2&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Vulnerability-Analysis&#34;&gt;&lt;a href=&#34;#Vulnerability-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability Analysis&#34;&gt;&lt;/a&gt;Vulnerability Analysis&lt;/h1&gt;&lt;h2 id=&#34;Overview&#34;&gt;&lt;a href=&#34;#Overview&#34; class=&#34;headerlink&#34; title=&#34;Overview&#34;&gt;&lt;/a&gt;Overview&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xBA3C;&amp;#xC800; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xC911;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/2.png&#34; alt=&#34;windows-driver-part2/2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;WinObj&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; AMDRyzenMasterDriverV15 &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC628; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;code&gt;AMDRyzenMasterDriverV15.sys&lt;/code&gt; &amp;#xB97C; IDA&amp;#xB85C; &amp;#xC5F4;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;DriverEntry&lt;/code&gt; &amp;#xBD80;&amp;#xD130; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%206.png&#34; alt=&#34;windows-driver-part2/Untitled%206.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;sub_140008A5C&lt;/code&gt;&amp;#xB85C; &amp;#xAC00;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip%201.png&#34; alt=&#34;windows-driver-part2/tempsnip%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;DriverEntry&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt; &amp;#xB97C; &amp;#xC92C;&amp;#xC73C;&amp;#xB2C8; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;a1&lt;/code&gt;&amp;#xC758; type&amp;#xC744; &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC120; dispatch routine&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;.  &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt;&amp;#xB97C; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB354; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;sub_1400046AC&lt;/code&gt;&amp;#xB97C; &amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip2.png&#34; alt=&#34;windows-driver-part2/tempsnip2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;DRIVER_OBJECT-&amp;gt;MajorFunction[14]&lt;/code&gt;&amp;#xC5D0; dispatch routine&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC7A5;&amp;#xCE58;&amp;#xBA85;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%207.png&#34; alt=&#34;windows-driver-part2/Untitled%207.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;dispatch routine&amp;#xC5D0;&amp;#xB294; IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC4; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MmMapIoSpace&#34;&gt;&lt;a href=&#34;#MmMapIoSpace&#34; class=&#34;headerlink&#34; title=&#34;MmMapIoSpace&#34;&gt;&lt;/a&gt;MmMapIoSpace&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD568;&amp;#xC218; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC; &amp;#xD150;&amp;#xB370;&amp;#xC694;, &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB85C; &amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xC6D0;&amp;#xD615;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;MmMapIoSpace&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  PHYSICAL_ADDRESS    PhysicalAddress,  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xC8FC;&amp;#xC18C;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  SIZE_T              NumberOfBytes,   &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC218;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  MEMORY_CACHING_TYPE CacheType       &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xCE90;&amp;#xC2DC; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; MEMORY_CACHING_TYPE &amp;#xAC12;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC660;&amp;#xC9C0; &amp;#xC774; &amp;#xD568;&amp;#xC218; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC544;&amp;#xC8FC; &amp;#xC88B;&amp;#xC740; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xAC00; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &lt;/p&gt;
&lt;p&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; MSI Dragon Center &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;(&lt;a href=&#34;https://hackyboiz.github.io/2021/06/22/l0ch/2021-06-22/&#34;&gt;CVE-2021-29337: MSI Dragon Center&amp;#xC758; &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/a&gt;) &amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C; &amp;#xC801;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%208.png&#34; alt=&#34;windows-driver-part2/Untitled%208.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xC624;&amp;#xB298; &amp;#xAE00; &amp;#xC608;&amp;#xACE0;&amp;#xB97C; &amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/33.png&#34; alt=&#34;windows-driver-part2/33.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;cross reference view&amp;#xB85C; &amp;#xBCF8; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;sub_140007278&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%209.png&#34; alt=&#34;windows-driver-part2/Untitled%209.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xB9AC;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;a1&lt;/code&gt;&amp;#xC640; &lt;code&gt;a2&lt;/code&gt;&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xAE38; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BaseAddress&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC778; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BaseAddress&lt;/code&gt;&amp;#xAC00; NULL&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &lt;code&gt;NumberOfBytes&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &lt;code&gt;a3&lt;/code&gt; &amp;#xBC84;&amp;#xD37C;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBCF5;&amp;#xC0AC;&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; dispatch routine&amp;#xC73C;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2010.png&#34; alt=&#34;windows-driver-part2/Untitled%2010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;0x81112F0C&lt;/code&gt;&amp;#xC77C;&amp;#xB54C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;sub_1400063D0&lt;/code&gt;&amp;#xC744; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2011.png&#34; alt=&#34;windows-driver-part2/Untitled%2011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xB2E4;&amp;#xB974;&amp;#xB124;&amp;#xC694;?  &lt;code&gt;sub_140007278&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2012.png&#34; alt=&#34;windows-driver-part2/Untitled%2012.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;IOCTL &lt;code&gt;0x81112F08&lt;/code&gt;&amp;#xC77C; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xD568;&amp;#xC218;&amp;#xC758; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC784;&amp;#xC758; &amp;#xC4F0;&amp;#xAE30; &amp;#xBC0F; &amp;#xC784;&amp;#xC758; &amp;#xC77D;&amp;#xAE30;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC801;&amp;#xC778; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;?! &amp;#xBC14;&amp;#xB85C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
    HANDLE dHandle;
    WCHAR DeviceLink[] = &lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\\\.\\AMDRyzenMasterDriverV15&amp;quot;&lt;/span&gt;;
    DWORD dwRet = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
    LPVOID output_buff = VirtualAlloc(&lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
        &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;,
        MEM_COMMIT | MEM_RESERVE,
        PAGE_EXECUTE_READWRITE);

    dHandle = CreateFileW(
        DeviceLink,
        GENERIC_READ | GENERIC_WRITE,
        &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,
        &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
        OPEN_EXISTING,
        FILE_ATTRIBUTE_NORMAL,
        &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;
    );

    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (dHandle == INVALID_HANDLE_VALUE)
    {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Get Device Handle Fail! : 0x%X \n&amp;quot;&lt;/span&gt;, GetLastError());
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }
    
    BYTE input_buff[&lt;span class=&#34;hljs-number&#34;&gt;0x100&lt;/span&gt;] = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, };
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!DeviceIoControl(dHandle, &lt;span class=&#34;hljs-number&#34;&gt;0x81112F0C&lt;/span&gt;, input_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x40&lt;/span&gt;, output_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;, &amp;amp;dwRet, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;))
    {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;DeviceIOControl Fail : 0x%X \n&amp;quot;&lt;/span&gt;, GetLastError());
        CloseHandle(dHandle);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }

    CloseHandle(dHandle);

    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-deviceiocontrol&#34;&gt;DeviceIoControl&lt;/a&gt; &amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;DeviceIoControl(dHandle, &lt;span class=&#34;hljs-number&#34;&gt;0x81112F0C&lt;/span&gt;, input_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x40&lt;/span&gt;, output_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;, &amp;amp;dwRet, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;IOCTL code &lt;code&gt;0x81112F0C&lt;/code&gt; &amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294;&amp;#xB370; input buffer&amp;#xC640; output buffer&amp;#xB97C; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; input buffer &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; NULL&amp;#xB85C; &amp;#xCC44;&amp;#xC6CC;&amp;#xC11C; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/BSOD.png&#34; alt=&#34;windows-driver-part2/BSOD.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xAC9F;!  : )&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB4A4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB098;&amp;#xC694; &amp;#xC548;&amp;#xB155;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 공대오빠가 알려주는 Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master 분석(1) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(1) &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(2)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/&#34;&gt;&amp;#xACF5;&amp;#xB300;&amp;#xC624;&amp;#xBE60;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &amp;#xBD84;&amp;#xC11D;(3)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xD55C; &amp;#xB2EC; &amp;#xB9CC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C;&amp;#xBC88; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xD305;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; third-party &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC6D0;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC; &amp;#xAC74;&amp;#xB370;&amp;#xC694;, &amp;#xC774;&amp;#xC81C; &amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xBB50;&amp;#xAC19;&amp;#xC774; &amp;#xC9D3;&amp;#xAE34; &amp;#xD588;&amp;#xB124;&amp;#xC694;. &amp;#xB0B4;&amp;#xAC00; &amp;#xC65C; &amp;#xC800;&amp;#xB7AC;&amp;#xC744;&amp;#xAE4C;..? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled.png&#34; alt=&#34;windows-driver-part2/Untitled.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB294; &amp;#xACF5;&amp;#xB300; &amp;#x201C;&amp;#xC544;&amp;#xC800;&amp;#xC528;&amp;#x201D;&amp;#xAC00; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;AMD-Ryzen-Master&#34;&gt;&lt;a href=&#34;#AMD-Ryzen-Master&#34; class=&#34;headerlink&#34; title=&#34;AMD Ryzen Master&#34;&gt;&lt;/a&gt;AMD Ryzen Master&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/AMD.png&#34; alt=&#34;windows-driver-part2/AMD.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; AMD Ryzen Master&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xC820; CPU&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4; &amp;#xC911; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC5D0; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC800;&amp;#xB3C4; &amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xB77C;&amp;#xC774;&amp;#xC820; CPU&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xC0AC;&amp;#xC11C; &amp;#xC778;&amp;#xC0DD; &amp;#xCCAB; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC744; &amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xBC14;&amp;#xC774;&amp;#xC624;&amp;#xC2A4; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB58; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC11C; &amp;#xC5BC;&amp;#xD0C0;&amp;#xB2E4;&amp;#xAC00; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4; &amp;#xD074;&amp;#xB9AD; &amp;#xBA87; &amp;#xBC88;&amp;#xC5D0; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xC774; &amp;#xC9E0; &amp;#xD558;&amp;#xACE0; &amp;#xB41C;&amp;#xB2E4;&amp;#xAE38;&amp;#xB798; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC37C;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xBB3C;&amp;#xB860; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC124;&amp;#xC815; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC918;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xACB0;&amp;#xAD6D; &amp;#xBC14;&amp;#xC774;&amp;#xC624;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%201.png&#34; alt=&#34;windows-driver-part2/Untitled%201.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xC54C;&amp;#xBABB;&amp;#x315C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC74; &amp;#xC5EC;&amp;#xB2F4;&amp;#xC778;&amp;#xB370;, &amp;#xC9C0;&amp;#xAE08; &amp;#xC4F0;&amp;#xB294; CPU&amp;#xAC00; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xC548;&amp;#xD55C; &amp;#xC21C;&amp;#xC815;&amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xB728;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xD558;&amp;#xBA74; &amp;#xBA40;&amp;#xCA61;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694;. &amp;#xC218;&amp;#xC728;&amp;#xC774; &amp;#xC88B;&amp;#xAE38;&amp;#xB798; &amp;#xADF8;&amp;#xB0E5; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;.. &amp;#xBB54;&amp;#xAC00; &amp;#xCC1D;&amp;#xCC1D;&amp;#xD55C; &amp;#xAC74; &amp;#xAE30;&amp;#xBD84; &amp;#xD0D3;&amp;#xC77C; &amp;#xAC70;&amp;#xC57C; &amp;#xC544;&amp;#xB9C8;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBCF8;&amp;#xC778;(&amp;#xC0C8;&amp;#xCEF4; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; &amp;#xC2E0;&amp;#xB0A8;) : &amp;#xB2D8;&amp;#xB4E4; &amp;#xC2DC;&amp;#xD4E8; &amp;#xC21C;&amp;#xC815;&amp;#xC740; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xB728;&amp;#xB294;&amp;#xB370; &amp;#xC624;&amp;#xBC84;&amp;#xD074;&amp;#xB7ED; &amp;#xD558;&amp;#xBA74; &amp;#xC798; &amp;#xB3CC;&amp;#xC544;&amp;#xAC10; &amp;#x314B;&amp;#x314B; &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xC8E0;&lt;br&gt;??? : &amp;#xC6B0;&amp;#xB9B0; &amp;#xADF8;&amp;#xAC78; &amp;#xCD08;&amp;#xAE30; &amp;#xBD88;&amp;#xB7C9;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB974;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#x2026;? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%202.png&#34; alt=&#34;windows-driver-part2/Untitled%202.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; 1&amp;#xB144;&amp;#xC9F8; &amp;#xC798; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC791;&amp;#xB144;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; AMD Ryzen Master&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2020-12928 &amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! OS&amp;#xD658;&amp;#xACBD;&amp;#xC740; Windows 10 &amp;#xBE4C;&amp;#xB4DC; 19043.1083&amp;#xC5D0;&amp;#xC11C;, &amp;#xD0C0;&amp;#xAC9F;&amp;#xC778; AMD Ryzen Master&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; AMDRyzenMasterDriverV15 &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;  2.1.1.1472 &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xD558;&amp;#xB8E8; &amp;#xC885;&amp;#xC77C; &amp;#xAC78;&amp;#xB824;&amp;#xBC84;&amp;#xB9BC; &amp;#x314E;&amp;#x314E;. .&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%203.png&#34; alt=&#34;windows-driver-part2/Untitled%203.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544; &amp;#xAD6C;&amp;#xBC84;&amp;#xC804; &amp;#xAD6C;&amp;#xD558;&amp;#xAE30; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xC5B4;&amp;#xB824;&amp;#xC6E0;&amp;#xB2E4; &amp;#x3141;&amp;#x3134;&amp;#x3147;&amp;#x3139;&amp;#x3134;&amp;#x3147;&amp;#x3141;&amp;#x3139;&amp;#x3147;&amp;#x3141;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;.. &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xC124;&amp;#xCE58; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xAC00;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip.png&#34; alt=&#34;windows-driver-part2/tempsnip.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC8FC;&amp;#xC778;&amp;#xACF5; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC704; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kernel-Driver-Driver-Exploit&#34;&gt;&lt;a href=&#34;#Kernel-Driver-Driver-Exploit&#34; class=&#34;headerlink&#34; title=&#34;Kernel Driver / Driver Exploit&#34;&gt;&lt;/a&gt;Kernel Driver / Driver Exploit&lt;/h1&gt;&lt;p&gt;&amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xBD80;&amp;#xD130; &amp;#xC54C;&amp;#xC544;&amp;#xBD10;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows Kernel&amp;#xC740; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; Core Kernel(Microkernel)&amp;#xACFC; Device Driver &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Core &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xB294; Kernel&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; driver &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xAD6C;&amp;#xD604;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xC758; &amp;#xC7A5;&amp;#xC810;&amp;#xC740; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC720;&amp;#xC9C0;&amp;#xBCF4;&amp;#xC218;&amp;#xAC00; &amp;#xC6A9;&amp;#xC774;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%204.png&#34; alt=&#34;windows-driver-part2/Untitled%204.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows NT &amp;#xACC4;&amp;#xC5F4;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4C8;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654; &amp;#xD55C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; Windows&amp;#xB294; User mode&amp;#xC640; Kernel mode&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. User mode&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC774;&amp;#xB54C; User mode &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC740; I/O Manager&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294;&amp;#xB370;, IOCTL(I/O Control) &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xB7F0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB354; &amp;#xD070; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xB07C;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(Privilege Escalation)&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; Microsoft&amp;#xAC00; &amp;#xBC14;&amp;#xBCF4;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC880; &amp;#xB354; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD;&amp;#xC744; &amp;#xC368;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD588;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;? &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; MS&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC81C;&amp;#xC0BC;&amp;#xC790;(third-party)&amp;#xB3C4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xACE0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;third-party driver&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; &amp;#xCEE4;&amp;#xB110; &amp;#xB808;&amp;#xBCA8;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC31;&amp;#xC2E0;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4;, &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1; &amp;#xB4F1;&amp;#xC758; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Microsoft&amp;#xAC00; Windows &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &amp;#xC790;&amp;#xAE30;&amp;#xB124; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC544;&amp;#xBB34;&amp;#xB9AC; &amp;#xC2EC;&amp;#xD608;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC; &amp;#xBC84;&amp;#xADF8; &amp;#xC5C6;&amp;#xC774; &amp;#xB0B4;&amp;#xB193;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F0; third-party driver&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD321;&amp;#xD321; &amp;#xD130;&amp;#xC9C8; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%205.png&#34; alt=&#34;windows-driver-part2/Untitled%205.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC998; &amp;#xD56B;&amp;#xD55C; PrintNightmare&amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB9B0;&amp;#xD130; &amp;#xC2A4;&amp;#xD480;&amp;#xB7EC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD130;&amp;#xC9C0;&amp;#xB294; &amp;#xAC70; &amp;#xBCF4;&amp;#xBA74; &amp;#xB9C8;&amp;#xC18C;&amp;#xB3C4; &amp;#xBB50;.. &amp;#xAC08; &amp;#xAE38;&amp;#xC774; &amp;#xBA3C; &amp;#xAC83; &amp;#xAC19;&amp;#xC9C0;&amp;#xB9CC;&amp;#xC694; &amp;#x314E;&amp;#x314E;;;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xAE00;&amp;#xC744; &amp;#xBCF4;&amp;#xAE30; &amp;#xC804; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC544;&amp;#xB798; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/21/l0ch/exploiting-driver/&#34;&gt;[Translation] Exploiting System Mechanic Driver Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/28/l0ch/exploiting-driver-part2/&#34;&gt;[Translation] Exploiting System Mechanic Driver Part 2&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Vulnerability-Analysis&#34;&gt;&lt;a href=&#34;#Vulnerability-Analysis&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability Analysis&#34;&gt;&lt;/a&gt;Vulnerability Analysis&lt;/h1&gt;&lt;h2 id=&#34;Overview&#34;&gt;&lt;a href=&#34;#Overview&#34; class=&#34;headerlink&#34; title=&#34;Overview&#34;&gt;&lt;/a&gt;Overview&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xBA3C;&amp;#xC800; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xC911;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/2.png&#34; alt=&#34;windows-driver-part2/2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;WinObj&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; AMDRyzenMasterDriverV15 &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC628; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;code&gt;AMDRyzenMasterDriverV15.sys&lt;/code&gt; &amp;#xB97C; IDA&amp;#xB85C; &amp;#xC5F4;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xBC14;&amp;#xB85C; &lt;code&gt;DriverEntry&lt;/code&gt; &amp;#xBD80;&amp;#xD130; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%206.png&#34; alt=&#34;windows-driver-part2/Untitled%206.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;sub_140008A5C&lt;/code&gt;&amp;#xB85C; &amp;#xAC00;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip%201.png&#34; alt=&#34;windows-driver-part2/tempsnip%201.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;DriverEntry&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt; &amp;#xB97C; &amp;#xC92C;&amp;#xC73C;&amp;#xB2C8; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;a1&lt;/code&gt;&amp;#xC758; type&amp;#xC744; &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC120; dispatch routine&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;.  &lt;code&gt;PDRIVER_OBJECT&lt;/code&gt;&amp;#xB97C; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB354; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;sub_1400046AC&lt;/code&gt;&amp;#xB97C; &amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/tempsnip2.png&#34; alt=&#34;windows-driver-part2/tempsnip2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;DRIVER_OBJECT-&amp;gt;MajorFunction[14]&lt;/code&gt;&amp;#xC5D0; dispatch routine&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC7A5;&amp;#xCE58;&amp;#xBA85;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%207.png&#34; alt=&#34;windows-driver-part2/Untitled%207.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;dispatch routine&amp;#xC5D0;&amp;#xB294; IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCC4; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;MmMapIoSpace&#34;&gt;&lt;a href=&#34;#MmMapIoSpace&#34; class=&#34;headerlink&#34; title=&#34;MmMapIoSpace&#34;&gt;&lt;/a&gt;MmMapIoSpace&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD568;&amp;#xC218; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC; &amp;#xD150;&amp;#xB370;&amp;#xC694;, &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB85C; &amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xC6D0;&amp;#xD615;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;MmMapIoSpace&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  PHYSICAL_ADDRESS    PhysicalAddress,  &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801; &amp;#xC8FC;&amp;#xC18C;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  SIZE_T              NumberOfBytes,   &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xB9E4;&amp;#xD551;&amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC218;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  MEMORY_CACHING_TYPE CacheType       &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xCE90;&amp;#xC2DC; &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; MEMORY_CACHING_TYPE &amp;#xAC12;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC660;&amp;#xC9C0; &amp;#xC774; &amp;#xD568;&amp;#xC218; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC544;&amp;#xC8FC; &amp;#xC88B;&amp;#xC740; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xAC00; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &lt;/p&gt;
&lt;p&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; MSI Dragon Center &amp;#xAD8C;&amp;#xD55C;&amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;(&lt;a href=&#34;https://hackyboiz.github.io/2021/06/22/l0ch/2021-06-22/&#34;&gt;CVE-2021-29337: MSI Dragon Center&amp;#xC758; &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/a&gt;) &amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C; &amp;#xC801;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%208.png&#34; alt=&#34;windows-driver-part2/Untitled%208.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xC624;&amp;#xB298; &amp;#xAE00; &amp;#xC608;&amp;#xACE0;&amp;#xB97C; &amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/33.png&#34; alt=&#34;windows-driver-part2/33.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;cross reference view&amp;#xB85C; &amp;#xBCF8; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;sub_140007278&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%209.png&#34; alt=&#34;windows-driver-part2/Untitled%209.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xB9AC;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218; &lt;code&gt;a1&lt;/code&gt;&amp;#xC640; &lt;code&gt;a2&lt;/code&gt;&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xAE38; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BaseAddress&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xC758; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC778; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xAC00;&amp;#xC0C1; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BaseAddress&lt;/code&gt;&amp;#xAC00; NULL&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &lt;code&gt;NumberOfBytes&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &lt;code&gt;a3&lt;/code&gt; &amp;#xBC84;&amp;#xD37C;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBCF5;&amp;#xC0AC;&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00;&amp;#xB97C; &amp;#xC4F0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; dispatch routine&amp;#xC73C;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00; &amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2010.png&#34; alt=&#34;windows-driver-part2/Untitled%2010.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;0x81112F0C&lt;/code&gt;&amp;#xC77C;&amp;#xB54C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;sub_1400063D0&lt;/code&gt;&amp;#xC744; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2011.png&#34; alt=&#34;windows-driver-part2/Untitled%2011.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xB2E4;&amp;#xB974;&amp;#xB124;&amp;#xC694;?  &lt;code&gt;sub_140007278&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/Untitled%2012.png&#34; alt=&#34;windows-driver-part2/Untitled%2012.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;IOCTL &lt;code&gt;0x81112F08&lt;/code&gt;&amp;#xC77C; &amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xD568;&amp;#xC218;&amp;#xC758; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC784;&amp;#xC758; &amp;#xC4F0;&amp;#xAE30; &amp;#xBC0F; &amp;#xC784;&amp;#xC758; &amp;#xC77D;&amp;#xAE30;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC801;&amp;#xC778; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC624;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;?! &amp;#xBC14;&amp;#xB85C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
    HANDLE dHandle;
    WCHAR DeviceLink[] = &lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\\\.\\AMDRyzenMasterDriverV15&amp;quot;&lt;/span&gt;;
    DWORD dwRet = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
    LPVOID output_buff = VirtualAlloc(&lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
        &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;,
        MEM_COMMIT | MEM_RESERVE,
        PAGE_EXECUTE_READWRITE);

    dHandle = CreateFileW(
        DeviceLink,
        GENERIC_READ | GENERIC_WRITE,
        &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,
        &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
        OPEN_EXISTING,
        FILE_ATTRIBUTE_NORMAL,
        &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;
    );

    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (dHandle == INVALID_HANDLE_VALUE)
    {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Get Device Handle Fail! : 0x%X \n&amp;quot;&lt;/span&gt;, GetLastError());
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }
    
    BYTE input_buff[&lt;span class=&#34;hljs-number&#34;&gt;0x100&lt;/span&gt;] = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, };
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!DeviceIoControl(dHandle, &lt;span class=&#34;hljs-number&#34;&gt;0x81112F0C&lt;/span&gt;, input_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x40&lt;/span&gt;, output_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;, &amp;amp;dwRet, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;))
    {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;DeviceIOControl Fail : 0x%X \n&amp;quot;&lt;/span&gt;, GetLastError());
        CloseHandle(dHandle);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }

    CloseHandle(dHandle);

    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &lt;a href=&#34;https://docs.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-deviceiocontrol&#34;&gt;DeviceIoControl&lt;/a&gt; &amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;DeviceIoControl(dHandle, &lt;span class=&#34;hljs-number&#34;&gt;0x81112F0C&lt;/span&gt;, input_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x40&lt;/span&gt;, output_buff, &lt;span class=&#34;hljs-number&#34;&gt;0x100c&lt;/span&gt;, &amp;amp;dwRet, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;IOCTL code &lt;code&gt;0x81112F0C&lt;/code&gt; &amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294;&amp;#xB370; input buffer&amp;#xC640; output buffer&amp;#xB97C; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; input buffer &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; NULL&amp;#xB85C; &amp;#xCC44;&amp;#xC6CC;&amp;#xC11C; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/14/l0ch/windows-driver-part2/BSOD.png&#34; alt=&#34;windows-driver-part2/BSOD.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0; &amp;#xAC9F;!  : )&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB4A4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB098;&amp;#xC694; &amp;#xC548;&amp;#xB155;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/07/14/l0ch/windows-driver-part2/Untitled.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/07/14/l0ch/windows-driver-part2/">

  <title>[Research] 공대오빠가 알려주는 Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master 분석(1) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-07-14 18:00" pubdate>
      2021년 7월 14일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.6k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      52
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 공대오빠가 알려주는 Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master 분석(1)</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;"><a href="#&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;" class="headerlink" title="&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;"></a>&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/05/30/l0ch/windows-driver/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 1 - Setting Up Kernel Debugging</a></p>
<p>&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(1) &#x2190; Now!</p>
<p><a href="http://hackyboiz.github.io/2021/07/28/l0ch/windows-driver-part3/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 3 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(2)</a></p>
<p><a href="http://hackyboiz.github.io/2021/08/11/l0ch/windows-driver-part4/">&#xACF5;&#xB300;&#xC624;&#xBE60;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; Windows Driver Part 4 - CVE-2020-12928: AMD Ryzen Master &#xBD84;&#xC11D;(3)</a></p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xD55C; &#xB2EC; &#xB9CC;&#xC5D0; &#xB3CC;&#xC544;&#xC628; &#xC708;&#xB3C4;&#xC6B0; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC2DC;&#xB9AC;&#xC988;&#xC785;&#xB2C8;&#xB2E4;. &#xC9C0;&#xB09C;&#xBC88; &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45; &#xC138;&#xD305;&#xC5D0; &#xC774;&#xC5B4; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xC708;&#xB3C4;&#xC6B0; third-party &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC6D0;&#xB370;&#xC774;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCFC; &#xAC74;&#xB370;&#xC694;, &#xC774;&#xC81C; &#xBCF4;&#xB2C8;&#xAE4C; &#xC2DC;&#xB9AC;&#xC988; &#xC81C;&#xBAA9;&#xC744; &#xBB50;&#xAC19;&#xC774; &#xC9D3;&#xAE34; &#xD588;&#xB124;&#xC694;. &#xB0B4;&#xAC00; &#xC65C; &#xC800;&#xB7AC;&#xC744;&#xAE4C;..? </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled.png"></p>
<blockquote>
<p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xB294; &#xACF5;&#xB300; &#x201C;&#xC544;&#xC800;&#xC528;&#x201D;&#xAC00; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
</blockquote>
<h1 id="AMD-Ryzen-Master"><a href="#AMD-Ryzen-Master" class="headerlink" title="AMD Ryzen Master"></a>AMD Ryzen Master</h1><p><img src="/2021/07/14/l0ch/windows-driver-part2/AMD.png" srcset="/img/loading.gif" alt="windows-driver-part2/AMD.png"></p>
<p>&#xC624;&#xB298; &#xBD84;&#xC11D;&#xD560; AMD Ryzen Master&#xB294; &#xB77C;&#xC774;&#xC820; CPU&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4; &#xC911; &#xC624;&#xBC84;&#xD074;&#xB7ED;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xB4E4;&#xC5B4;&#xBCF4;&#xC168;&#xC744; &#xC775;&#xC219;&#xD55C; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xC785;&#xB2C8;&#xB2E4;! &#xC800;&#xB3C4; &#xC791;&#xB144;&#xC5D0; &#xB77C;&#xC774;&#xC820; CPU&#xB97C; &#xCC98;&#xC74C; &#xC0AC;&#xC11C; &#xC778;&#xC0DD; &#xCCAB; &#xC624;&#xBC84;&#xD074;&#xB7ED;&#xC744; &#xD558;&#xB824;&#xACE0; &#xD588;&#xB294;&#xB370;, &#xBC14;&#xC774;&#xC624;&#xC2A4; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xBB58; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xC9C0; &#xBAB0;&#xB77C;&#xC11C; &#xC5BC;&#xD0C0;&#xB2E4;&#xAC00; &#xB9C8;&#xC6B0;&#xC2A4; &#xD074;&#xB9AD; &#xBA87; &#xBC88;&#xC5D0; &#xC624;&#xBC84;&#xD074;&#xB7ED;&#xC774; &#xC9E0; &#xD558;&#xACE0; &#xB41C;&#xB2E4;&#xAE38;&#xB798; &#xC720;&#xC6A9;&#xD558;&#xAC8C; &#xC37C;&#xC5C8;&#xC8E0;. &#xBB3C;&#xB860; &#xC7AC;&#xBD80;&#xD305;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC124;&#xC815; &#xC801;&#xC6A9;&#xD574;&#xC918;&#xC57C; &#xD558;&#xB294; &#xAC8C; &#xADC0;&#xCC2E;&#xC544;&#xC11C; &#xACB0;&#xAD6D; &#xBC14;&#xC774;&#xC624;&#xC2A4;&#xC5D0;&#xC11C; &#xC124;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;!</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%201.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%201.png"></p>
<blockquote>
<p>&#xC624;&#xBC84;&#xD074;&#xB7ED;&#xB3C4; &#xBABB;&#xD558;&#xB294; &#xCEF4;&#xC54C;&#xBABB;&#x315C;</p>
</blockquote>
<p>&#xC774;&#xAC74; &#xC5EC;&#xB2F4;&#xC778;&#xB370;, &#xC9C0;&#xAE08; &#xC4F0;&#xB294; CPU&#xAC00; &#xC624;&#xBC84;&#xD074;&#xB7ED; &#xC548;&#xD55C; &#xC21C;&#xC815;&#xC0C1;&#xD0DC;&#xC5D0;&#xC11C;&#xB294; &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0; &#xB728;&#xB294;&#xB370; &#xC624;&#xBC84;&#xD074;&#xB7ED; &#xD558;&#xBA74; &#xBA40;&#xCA61;&#xD558;&#xB354;&#xB77C;&#xAD6C;&#xC694;. &#xC218;&#xC728;&#xC774; &#xC88B;&#xAE38;&#xB798; &#xADF8;&#xB0E5; &#xC4F0;&#xACE0; &#xC788;&#xB294;&#xB370;.. &#xBB54;&#xAC00; &#xCC1D;&#xCC1D;&#xD55C; &#xAC74; &#xAE30;&#xBD84; &#xD0D3;&#xC77C; &#xAC70;&#xC57C; &#xC544;&#xB9C8;</p>
<blockquote>
<p>&#xBCF8;&#xC778;(&#xC0C8;&#xCEF4; &#xB9DE;&#xCDB0;&#xC11C; &#xC2E0;&#xB0A8;) : &#xB2D8;&#xB4E4; &#xC2DC;&#xD4E8; &#xC21C;&#xC815;&#xC740; &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0; &#xB728;&#xB294;&#xB370; &#xC624;&#xBC84;&#xD074;&#xB7ED; &#xD558;&#xBA74; &#xC798; &#xB3CC;&#xC544;&#xAC10; &#x314B;&#x314B; &#xC2E0;&#xAE30;&#xD558;&#xC8E0;<br>??? : &#xC6B0;&#xB9B0; &#xADF8;&#xAC78; &#xCD08;&#xAE30; &#xBD88;&#xB7C9;&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xAE30;&#xB85C; &#xD588;&#xC5B4;&#xC694;.</p>
</blockquote>
<p>&#x2026;? </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%202.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%202.png"></p>
<blockquote>
<p>&#xADF8;&#xB798;&#xB3C4; 1&#xB144;&#xC9F8; &#xC798; &#xC4F0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;..</p>
</blockquote>
<p>&#xC544;&#xBB34;&#xD2BC; &#xC624;&#xB298;&#xC740; &#xC791;&#xB144;&#xC5D0; &#xACF5;&#xAC1C;&#xB41C; AMD Ryzen Master&#xC758; &#xAD8C;&#xD55C;&#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810; CVE-2020-12928 &#xC744; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! OS&#xD658;&#xACBD;&#xC740; Windows 10 &#xBE4C;&#xB4DC; 19043.1083&#xC5D0;&#xC11C;, &#xD0C0;&#xAC9F;&#xC778; AMD Ryzen Master&#xB294; &#xCDE8;&#xC57D;&#xD55C; AMDRyzenMasterDriverV15 &#xBC84;&#xC804;&#xC758; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xD3EC;&#xD568;&#xB41C;  2.1.1.1472 &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xAD6C;&#xBC84;&#xC804; &#xCC3E;&#xB294;&#xB370; &#xD558;&#xB8E8; &#xC885;&#xC77C; &#xAC78;&#xB824;&#xBC84;&#xB9BC; &#x314E;&#x314E;. .</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%203.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%203.png"></p>
<blockquote>
<p>&#xC544; &#xAD6C;&#xBC84;&#xC804; &#xAD6C;&#xD558;&#xAE30; &#xC9C4;&#xC9DC; &#xB108;&#xBB34; &#xC5B4;&#xB824;&#xC6E0;&#xB2E4; &#x3141;&#x3134;&#x3147;&#x3139;&#x3134;&#x3147;&#x3141;&#x3139;&#x3147;&#x3141;</p>
</blockquote>
<p>&#xC774;&#xC81C;.. &#xC124;&#xCE58;&#xD558;&#xACE0; &#xC124;&#xCE58; &#xACBD;&#xB85C;&#xB97C; &#xCC3E;&#xC544;&#xAC00;&#xBCF4;&#xBA74;</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/tempsnip.png" srcset="/img/loading.gif" alt="windows-driver-part2/tempsnip.png"></p>
<p>&#xC624;&#xB298;&#xC758; &#xC8FC;&#xC778;&#xACF5; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC704; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Kernel-Driver-Driver-Exploit"><a href="#Kernel-Driver-Driver-Exploit" class="headerlink" title="Kernel Driver / Driver Exploit"></a>Kernel Driver / Driver Exploit</h1><p>&#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xC744; &#xD558;&#xAE30; &#xC804;&#xC5D0; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC5B4;&#xB5A4; &#xAC83;&#xC778;&#xC9C0;, &#xCDE8;&#xC57D;&#xC810;&#xC5D0;&#xB294; &#xC5B4;&#xB5A4; &#xAC83;&#xC774; &#xC788;&#xB294;&#xC9C0;&#xBD80;&#xD130; &#xC54C;&#xC544;&#xBD10;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Windows Kernel&#xC740; &#xBAA8;&#xB4C8;&#xD654;&#xAC00; &#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; Core Kernel(Microkernel)&#xACFC; Device Driver &#xB450; &#xAC00;&#xC9C0;&#xB85C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Core &#xBAA8;&#xB4C8;&#xC5D0;&#xB294; Kernel&#xC758; &#xD575;&#xC2EC;&#xC801;&#xC778; &#xAE30;&#xB2A5;&#xC774; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xACE0; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xCEE4;&#xB110; &#xAE30;&#xB2A5;&#xC740; driver &#xD615;&#xD0DC;&#xB85C; &#xBAA8;&#xB4C8;&#xD654; &#xB418;&#xC5B4; &#xAD6C;&#xD604;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBAA8;&#xB4C8;&#xD654;&#xC758; &#xC7A5;&#xC810;&#xC740; &#xD655;&#xC7A5;&#xC131;&#xACFC; &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xAC00; &#xC6A9;&#xC774;&#xD558;&#xB2E4;&#xB294; &#xC810;&#xC774; &#xC788;&#xACA0;&#xB124;&#xC694;!</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%204.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%204.png"></p>
<blockquote>
<p>Windows NT &#xACC4;&#xC5F4;&#xC758; &#xCEE4;&#xB110; &#xC544;&#xD0A4;&#xD14D;&#xCC98;</p>
</blockquote>
<p>Windows&#xC5D0;&#xC11C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xD2B9;&#xC815; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xB54C; &#xCEE4;&#xB110; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xBAA8;&#xB4C8;&#xB85C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC815;&#xB9AC;&#xD558;&#xBA74; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC791;&#xC5C5;&#xC774; &#xD544;&#xC694;&#xD560; &#xB54C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xBAA8;&#xB4C8;&#xD654; &#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p>&#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4EF;&#xC774; Windows&#xB294; User mode&#xC640; Kernel mode&#xB85C; &#xAD8C;&#xD55C;&#xC774; &#xB098;&#xB258;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. User mode&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xC694;&#xAD6C;&#xD560; &#xB54C; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC5D0; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xAC8C; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4; &#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC8E0;. &#xC774;&#xB54C; User mode &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC740; I/O Manager&#xB97C; &#xD1B5;&#xD574; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xAC8C; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xB294;&#xB370;, IOCTL(I/O Control) &#xCF54;&#xB4DC;&#xB85C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD560;&#xC9C0;&#xB97C; &#xACB0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74;, &#xC774;&#xB7F0; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC5B4;&#xB5A4; &#xAC83;&#xC774; &#xC788;&#xC744;&#xC9C0; &#xAC10;&#xC774; &#xC624;&#xC9C0; &#xC54A;&#xB098;&#xC694;?</p>
<p>&#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xCDE8;&#xC57D;&#xC810; &#xACF5;&#xACA9;&#xC5D0; &#xC131;&#xACF5;&#xD558;&#xBA74; &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC758; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC73C;&#xB85C;&#xB294; &#xD560; &#xC218; &#xC5C6;&#xB294; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC5D0;&#xC11C;&#xC758; &#xC784;&#xC758; &#xBA85;&#xB839;&#xC5B4; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; &#xD0C0;&#xAC9F;&#xC5D0;&#xAC8C; &#xB354; &#xD070; &#xD53C;&#xD574;&#xB97C; &#xB07C;&#xCE60; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;(Privilege Escalation)&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; Microsoft&#xAC00; &#xBC14;&#xBCF4;&#xB3C4; &#xC544;&#xB2C8;&#xACE0; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xAC00;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC880; &#xB354; &#xBCF4;&#xC548;&#xC5D0; &#xC2E0;&#xACBD;&#xC744; &#xC368;&#xC11C; &#xAC1C;&#xBC1C;&#xD588;&#xC744; &#xAC70; &#xAC19;&#xC9C0; &#xC54A;&#xB098;&#xC694;? &#xBB38;&#xC81C;&#xB294; &#xC774; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; MS&#xAC00; &#xC544;&#xB2CC; &#xC81C;&#xC0BC;&#xC790;(third-party)&#xB3C4; &#xAC1C;&#xBC1C;&#xD558;&#xACE0; &#xBC30;&#xD3EC;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>third-party driver&#xB294; &#xBCF4;&#xD1B5; &#xCEE4;&#xB110; &#xB808;&#xBCA8;&#xC758; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xBC31;&#xC2E0;&#xC774;&#xB098; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xB97C; &#xC9C1;&#xC811; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xB9C8;&#xC6B0;&#xC2A4;, &#xBAA8;&#xB2C8;&#xD130; &#xB4DC;&#xB77C;&#xC774;&#xBC84;, &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1; &#xB4F1;&#xC758; &#xC81C;&#xC870;&#xC0AC; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xC5D0;&#xC11C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. Microsoft&#xAC00; Windows &#xCEE4;&#xB110;&#xACFC; &#xC790;&#xAE30;&#xB124; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC544;&#xBB34;&#xB9AC; &#xC2EC;&#xD608;&#xC744; &#xAE30;&#xC6B8;&#xC5EC; &#xBC84;&#xADF8; &#xC5C6;&#xC774; &#xB0B4;&#xB193;&#xB294;&#xB2E4;&#xACE0; &#xD574;&#xB3C4; &#xC774;&#xB7F0; third-party driver&#xB4E4;&#xC774; &#xC788;&#xB294; &#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xD321;&#xD321; &#xD130;&#xC9C8; &#xAC83; &#xAC19;&#xB124;&#xC694;!</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%205.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%205.png"></p>
<blockquote>
<p>&#xC694;&#xC998; &#xD56B;&#xD55C; PrintNightmare&#xAC19;&#xC740; &#xD504;&#xB9B0;&#xD130; &#xC2A4;&#xD480;&#xB7EC; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xD130;&#xC9C0;&#xB294; &#xAC70; &#xBCF4;&#xBA74; &#xB9C8;&#xC18C;&#xB3C4; &#xBB50;.. &#xAC08; &#xAE38;&#xC774; &#xBA3C; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC;&#xC694; &#x314E;&#x314E;;;</p>
</blockquote>
<p>&#xC624;&#xB298; &#xAE00;&#xC744; &#xBCF4;&#xAE30; &#xC804; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xB300;&#xD55C; &#xC544;&#xB798; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xBA74; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p><a href="https://hackyboiz.github.io/2021/04/21/l0ch/exploiting-driver/">[Translation] Exploiting System Mechanic Driver Part 1</a></p>
<p><a href="https://hackyboiz.github.io/2021/04/28/l0ch/exploiting-driver-part2/">[Translation] Exploiting System Mechanic Driver Part 2</a></p>
<h1 id="Vulnerability-Analysis"><a href="#Vulnerability-Analysis" class="headerlink" title="Vulnerability Analysis"></a>Vulnerability Analysis</h1><h2 id="Overview"><a href="#Overview" class="headerlink" title="Overview"></a>Overview</h2><p>&#xC774;&#xC81C; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xBCFC; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;! &#xBA3C;&#xC800; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xB3D9;&#xC791;&#xC911;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xBD80;&#xD130; &#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/2.png" srcset="/img/loading.gif" alt="windows-driver-part2/2.png"></p>
<p>WinObj&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; AMDRyzenMasterDriverV15 &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xAC00; &#xC62C;&#xB77C;&#xC628; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB124;&#xC694;. </p>
<p><code>AMDRyzenMasterDriverV15.sys</code> &#xB97C; IDA&#xB85C; &#xC5F4;&#xC790;&#xB9C8;&#xC790; &#xBC14;&#xB85C; <code>DriverEntry</code> &#xBD80;&#xD130; &#xCC3E;&#xC544;&#xBCF4;&#xC8E0;</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%206.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%206.png"></p>
<p><code>sub_140008A5C</code>&#xB85C; &#xAC00;&#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/tempsnip%201.png" srcset="/img/loading.gif" alt="windows-driver-part2/tempsnip%201.png"></p>
<p><code>DriverEntry</code>&#xC5D0;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; <code>PDRIVER_OBJECT</code> &#xB97C; &#xC92C;&#xC73C;&#xB2C8; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; <code>a1</code>&#xC758; type&#xC744; <code>PDRIVER_OBJECT</code>&#xB85C; &#xBCC0;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC120; dispatch routine&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xB124;&#xC694;.  <code>PDRIVER_OBJECT</code>&#xB97C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD568;&#xC218;&#xB97C; &#xB354; &#xCC3E;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. <code>sub_1400046AC</code>&#xB97C; &#xBCFC;&#xAE4C;&#xC694;? </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/tempsnip2.png" srcset="/img/loading.gif" alt="windows-driver-part2/tempsnip2.png"></p>
<p>&#xC774;&#xBC88;&#xC5D0;&#xB294; <code>DRIVER_OBJECT-&gt;MajorFunction[14]</code>&#xC5D0; dispatch routine&#xC744; &#xD560;&#xB2F9;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC7A5;&#xCE58;&#xBA85;&#xB3C4; &#xBCF4;&#xC774;&#xB124;&#xC694;. </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%207.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%207.png"></p>
<p>dispatch routine&#xC5D0;&#xB294; IOCTL &#xCF54;&#xB4DC;&#xC640; &#xCF54;&#xB4DC; &#xBCC4; &#xB8E8;&#xD2F4;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="MmMapIoSpace"><a href="#MmMapIoSpace" class="headerlink" title="MmMapIoSpace"></a>MmMapIoSpace</h2><p>&#xC774;&#xC81C; &#xD568;&#xC218; &#xD558;&#xB098;&#xB97C; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xBCF4;&#xBA74;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC544;&#xBCFC; &#xD150;&#xB370;&#xC694;, &#xD0C0;&#xAC9F;&#xC740; <code>MmMapIoSpace</code>&#xB85C; &#xC815;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! <code>MmMapIoSpace</code>&#xB294; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; &#xAC00;&#xC0C1; &#xD398;&#xC774;&#xC9C0; &#xC8FC;&#xC18C;&#xC5D0; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xD568;&#xC218;&#xB85C;, &#xD568;&#xC218; &#xC6D0;&#xD615;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-function">PVOID <span class="hljs-title">MmMapIoSpace</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  PHYSICAL_ADDRESS    PhysicalAddress,  <span class="hljs-comment">// &#xB9E4;&#xD551;&#xD560; &#xBB3C;&#xB9AC;&#xC801; &#xC8FC;&#xC18C;</span></span></span>
<span class="hljs-function"><span class="hljs-params">  SIZE_T              NumberOfBytes,   <span class="hljs-comment">//&#xB9E4;&#xD551;&#xD560; &#xBC14;&#xC774;&#xD2B8; &#xC218;</span></span></span>
<span class="hljs-function"><span class="hljs-params">  MEMORY_CACHING_TYPE CacheType       <span class="hljs-comment">//&#xB9E4;&#xD551;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xD560; &#xCE90;&#xC2DC; &#xC18D;&#xC131;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; MEMORY_CACHING_TYPE &#xAC12;</span></span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xC660;&#xC9C0; &#xC774; &#xD568;&#xC218; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; &#xC544;&#xC8FC; &#xC88B;&#xC740; &#xACF5;&#xACA9; &#xBCA1;&#xD130;&#xAC00; &#xB420; &#xAC83; &#xAC19;&#xC8E0;? </p>
<p><code>MmMapIoSpace</code> &#xAD00;&#xB828; &#xCDE8;&#xC57D;&#xC810;&#xC740; MSI Dragon Center &#xAD8C;&#xD55C;&#xC0C1;&#xC2B9;&#xC744; &#xB2E4;&#xB8E8;&#xB294; &#xD558;&#xB8E8;&#xD55C;&#xC904;(<a href="https://hackyboiz.github.io/2021/06/22/l0ch/2021-06-22/">CVE-2021-29337: MSI Dragon Center&#xC758; &#xB85C;&#xCEEC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;</a>) &#xC5D0;&#xC11C;&#xB3C4; &#xC5B8;&#xAE09;&#xB41C; &#xC801;&#xC774; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%208.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%208.png"></p>
<blockquote>
<p>&#xC774;&#xB54C; &#xC624;&#xB298; &#xAE00; &#xC608;&#xACE0;&#xB97C; &#xD558;&#xAE30;&#xB3C4; &#xD588;&#xC5C8;&#xC8E0; &#x314E;&#x314E;</p>
</blockquote>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/33.png" srcset="/img/loading.gif" alt="windows-driver-part2/33.png"></p>
<p>cross reference view&#xB85C; &#xBCF8; <code>MmMapIoSpace</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xD568;&#xC218; &#xB9AC;&#xC2A4;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;. <code>sub_140007278</code> &#xD568;&#xC218;&#xB97C; &#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%209.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%209.png"></p>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xACE0; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xBA74; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC815;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>MmMapIoSpace</code> &#xD568;&#xC218;&#xC5D0; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; <code>a1</code>&#xC640; <code>a2</code>&#xB97C; &#xAC01;&#xAC01; &#xB9E4;&#xD551;&#xD558;&#xAE38; &#xC6D0;&#xD558;&#xB294; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C;&#xC640; &#xAE38;&#xC774;&#xB97C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>BaseAddress</code>&#xC5D0;&#xB294; <code>MmMapIoSpace</code>&#xC758; &#xBC18;&#xD658; &#xAC12;&#xC778; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xB9E4;&#xD551;&#xB41C; &#xAC00;&#xC0C1; &#xD398;&#xC774;&#xC9C0; &#xC8FC;&#xC18C;&#xAC00; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</li>
<li><code>BaseAddress</code>&#xAC00; NULL&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC544;&#xB2C8;&#xBA74; <code>NumberOfBytes</code>&#xB9CC;&#xD07C; <code>a3</code> &#xBC84;&#xD37C;&#xC758; &#xAC12;&#xC744; &#xBCF5;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xBCF5;&#xC0AC;&#xAC00; &#xC644;&#xB8CC;&#xB418;&#xBA74; &#xB9E4;&#xD551;&#xB41C; &#xC8FC;&#xC18C;&#xB97C; &#xB9E4;&#xD551; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xD574;&#xB2F9; &#xD568;&#xC218;&#xB294; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xBC14;&#xC774;&#xD2B8; &#xB2E8;&#xC704;&#xB85C; &#xBB34;&#xC5B8;&#xAC00;&#xB97C; &#xC4F0;&#xB294; &#xB8E8;&#xD2F4;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; dispatch routine&#xC73C;&#xB85C; &#xC62C;&#xB77C;&#xAC00; &#xBCFC;&#xAC8C;&#xC694;.</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%2010.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%2010.png"></p>
<p>IOCTL &#xCF54;&#xB4DC;&#xAC00; <code>0x81112F0C</code>&#xC77C;&#xB54C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB124;&#xC694;. </p>
<p><code>MmMapIoSpace</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xC778; <code>sub_1400063D0</code>&#xC744; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%2011.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%2011.png"></p>
<p>&#xC704; &#xD568;&#xC218;&#xB294; &#xBE44;&#xC2B7;&#xD574; &#xBCF4;&#xC774;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xD55C; &#xAC00;&#xC9C0;&#xAC00; &#xB2E4;&#xB974;&#xB124;&#xC694;?  <code>sub_140007278</code> &#xD568;&#xC218;&#xC640; &#xBC18;&#xB300;&#xB85C; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xBC14;&#xC774;&#xD2B8; &#xB2E8;&#xC704;&#xB85C; &#xC4F0;&#xB294; &#xB8E8;&#xD2F4;&#xC778; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/Untitled%2012.png" srcset="/img/loading.gif" alt="windows-driver-part2/Untitled%2012.png"></p>
<p>IOCTL <code>0x81112F08</code>&#xC77C; &#xB54C; &#xD574;&#xB2F9; &#xD568;&#xC218; &#xB8E8;&#xD2F4;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704; &#xB450; &#xD568;&#xC218;&#xC758; <code>MmMapIoSpace</code> &#xB85C; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xC640; &#xBCF5;&#xC0AC;&#xD560; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; &#xC784;&#xC758; &#xC4F0;&#xAE30; &#xBC0F; &#xC784;&#xC758; &#xC77D;&#xAE30;&#xAC00; &#xAC00;&#xB2A5;&#xD560; &#xAC83; &#xAC19;&#xB2E4;&#xB294; &#xB290;&#xB08C;&#xC801;&#xC778; &#xB290;&#xB08C;&#xC774; &#xC624;&#xC9C0; &#xC54A;&#xB098;&#xC694;?! &#xBC14;&#xB85C; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;Windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span></span>
<span class="hljs-function"></span>{
    HANDLE dHandle;
    WCHAR DeviceLink[] = <span class="hljs-string">L&quot;\\\\.\\AMDRyzenMasterDriverV15&quot;</span>;
    DWORD dwRet = <span class="hljs-number">0</span>;
    LPVOID output_buff = VirtualAlloc(<span class="hljs-literal">NULL</span>,
        <span class="hljs-number">0x100c</span>,
        MEM_COMMIT | MEM_RESERVE,
        PAGE_EXECUTE_READWRITE);

    dHandle = CreateFileW(
        DeviceLink,
        GENERIC_READ | GENERIC_WRITE,
        <span class="hljs-number">0</span>,
        <span class="hljs-literal">NULL</span>,
        OPEN_EXISTING,
        FILE_ATTRIBUTE_NORMAL,
        <span class="hljs-literal">NULL</span>
    );

    <span class="hljs-keyword">if</span> (dHandle == INVALID_HANDLE_VALUE)
    {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Get Device Handle Fail! : 0x%X \n&quot;</span>, GetLastError());
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }
    
    BYTE input_buff[<span class="hljs-number">0x100</span>] = { <span class="hljs-number">0</span>, };
    <span class="hljs-keyword">if</span> (!DeviceIoControl(dHandle, <span class="hljs-number">0x81112F0C</span>, input_buff, <span class="hljs-number">0x40</span>, output_buff, <span class="hljs-number">0x100c</span>, &amp;dwRet, <span class="hljs-number">0</span>))
    {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;DeviceIOControl Fail : 0x%X \n&quot;</span>, GetLastError());
        CloseHandle(dHandle);
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }

    CloseHandle(dHandle);

    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD558;&#xAE30;&#xB85C; &#xD558;&#xACE0;, &#xC9C0;&#xAE08;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-deviceiocontrol">DeviceIoControl</a> &#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xB9CC; &#xBCF4;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">DeviceIoControl(dHandle, <span class="hljs-number">0x81112F0C</span>, input_buff, <span class="hljs-number">0x40</span>, output_buff, <span class="hljs-number">0x100c</span>, &amp;dwRet, <span class="hljs-number">0</span>)</code></pre>
<p>IOCTL code <code>0x81112F0C</code> &#xB85C; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xB294;&#xB370; input buffer&#xC640; output buffer&#xB97C; &#xC0AC;&#xC774;&#xC988;&#xC640; &#xD568;&#xAED8; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; input buffer &#xB0B4;&#xC6A9;&#xC744; &#xBAA8;&#xB450; NULL&#xB85C; &#xCC44;&#xC6CC;&#xC11C; &#xC804;&#xB2EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<p><img src="/2021/07/14/l0ch/windows-driver-part2/BSOD.png" srcset="/img/loading.gif" alt="windows-driver-part2/BSOD.png"></p>
<blockquote>
<p>&#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0; &#xAC9F;!  : )</p>
</blockquote>
<p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xD2B8; 1&#xC758; &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45;&#xC73C;&#xB85C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xD55C; &#xB4A4; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xAE4C;&#xC9C0; &#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC5D0; &#xB9CC;&#xB098;&#xC694; &#xC548;&#xB155;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/lpe/">lpe</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/local-privilege-escalation/">local privilege escalation</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/windows-driver/">windows driver</a>
                  
                  <a class="hover-with-bg" href="/tags/third-party-driver-exploitation/">third-party driver exploitation</a>
                  
                  <a class="hover-with-bg" href="/tags/amd/">amd</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/07/15/idioth/2021-07-15/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-3492: Ubuntu Shiftfs driver double free vulnerability</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/07/13/l0ch/2021-07-13/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-21586/21587: Dell Wyse Management Suite Arbitrary File Read</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/07/14/l0ch/windows-driver-part2/';
        this.page.identifier = '/2021/07/14/l0ch/windows-driver-part2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 공대오빠가 알려주는 Windows Driver Part 2 - CVE-2020-12928: AMD Ryzen Master 분석(1)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
