

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F606;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC;&amp;#xB294; EmailGPT&amp;#xC758; Prompt Injection&amp;#xBD80;&amp;#xD130; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548;, BreachForums&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;&amp;#xB0A0;&amp;#xC774; &amp;#xC810;&amp;#xC810; &amp;#xB354;&amp;#xC6CC;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9; &amp;#xC5B4;&amp;#xB5A4;&amp;#xAC00;&amp;#xC694;~? &amp;#x1F423;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; EmailGPT, Prompt Injection &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.06 | HACKREAD | &lt;a href=&#34;https://hackread.com/emailgpt-flaw-user-data-at-risk-remove-extension/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;EmailGPT &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;? &amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/Coeeter/emailgpt&#34;&gt;&lt;strong&gt;EmailGPT&lt;/strong&gt;&lt;/a&gt;&amp;#xB294; OpenAI&amp;#xC758; GPT-3.5 &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Gmail &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;strong&gt;API &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC774;&amp;#xC790; &lt;strong&gt;Google Chrome &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;Prompt Injection&lt;/strong&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! (&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&#34;&gt;CVE-2024-5184&lt;/a&gt;) &amp;#x1F47E;&amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Prompt Injection&lt;/strong&gt; &amp;#xC740; &amp;#xD2B9;&amp;#xC815; Prompt(&amp;#xBA85;&amp;#xB839;)&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xB9D0;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xBC1C; &amp;#xCD08;&amp;#xAE30; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC790;&amp;#xBA74;, &amp;#x2018;&amp;#xB10C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&amp;#xD588;&amp;#xC5B4;?&amp;#x2019;, &amp;#x2018;&amp;#xB108;&amp;#xAC00; &amp;#xD559;&amp;#xC2B5;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xC918;.&amp;#x2019; &amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Prompt&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xC2A4;&amp;#xB7F0; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;EmailGPT&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCCE4;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F9D0;&lt;/p&gt;
&lt;p&gt;Prompt Injection&amp;#xC744; &amp;#xD1B5;&amp;#xD574; EmailGPT &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC7A5;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; Prompt&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC751;&amp;#xB2F5;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2; &amp;#xC774;&amp;#xB97C; &amp;#xC751;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBE7C;&amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2A4;&amp;#xD338; &amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xD53C;&amp;#xD574;&amp;#xAC00; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; EmailGPT &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC5F0;&amp;#xB77D;&amp;#xC774; &amp;#xB2FF;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;, &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC5B8;&amp;#xC81C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC694;&amp;#x2026;&amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;a href=&#34;https://github.com/Coeeter/EmailGPT&#34;&gt;Github&lt;/a&gt;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;, &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F631;*100&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC640; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xC544;&amp;#xC694;~ &amp;#x1F423;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#x1F1F8;&amp;#x1F1FB;, &amp;#xC804; &amp;#xAD6D;&amp;#xBBFC; &amp;#xC0DD;&amp;#xCCB4;&amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC0AC;&amp;#xAC74;&amp;#x2026; (&amp;#xD55C;&amp;#xAD6D; &amp;#xC544;&amp;#xB2D8; &amp;#xC8FC;&amp;#xC758;) &lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.06 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129652&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F1F8;&amp;#x1F1FB;&lt;/strong&gt; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC804;&amp;#xAD6D;&amp;#xBBFC; 80%&amp;#xC758; &amp;#xC0DD;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xAC1C;&amp;#xC778; &amp;#xC2DD;&amp;#xBCC4; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&lt;/strong&gt;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &amp;#x1F631;&amp;#x1FAE2;&amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CiberinteligenciaSV&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#xAD6D;&amp;#xBBFC; 500&amp;#xB9CC; &amp;#xBA85; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC57D; 1.4GB &amp;#xC720;&amp;#xCD9C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE0; &amp;#xC774;&amp;#xB294; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#xC804;&amp;#xCCB4; &amp;#xC778;&amp;#xAD6C;&amp;#xC758; 80%&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xCE58;&amp;#xC778;&amp;#xB370;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xCD9C;&amp;#xB41C; 1.4GB &amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xACE0;&amp;#xD654;&amp;#xC9C8; &amp;#xC0AC;&amp;#xC9C4;&amp;#xB9CC; 5,129,518&amp;#xC7A5;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xAC01; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#x2018;&lt;strong&gt;&amp;#xC8FC;&amp;#xBBFC; &amp;#xB4F1;&amp;#xB85D; &amp;#xBC88;&amp;#xD638;&lt;/strong&gt;&amp;#x2019;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; &amp;#x2018;&lt;strong&gt;&amp;#xC774;&amp;#xB984;, &amp;#xC0DD;&amp;#xB144;&amp;#xC6D4;&amp;#xC77C;, &amp;#xC804;&amp;#xD654;&amp;#xBC88;&amp;#xD638;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC8FC;&amp;#xC18C;, &amp;#xAC70;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&lt;/strong&gt;&amp;#x2019;&amp;#xB3C4; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xB354; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; &amp;#xAC74;, &amp;#x2018;&lt;strong&gt;&amp;#xC0DD;&amp;#xCCB4; &amp;#xC778;&amp;#xC99D; &amp;#xC815;&amp;#xBCF4;&lt;/strong&gt;&amp;#x2019;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC5BC;&amp;#xAD74; &amp;#xC778;&amp;#xC2DD;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC774; &amp;#xAC1C;&amp;#xC778;&amp;#xBCC4;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAC01; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC778;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54C;&amp;#xB9DE;&amp;#xAC8C; &amp;#xCCA8;&amp;#xBD80;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xB204;&amp;#xAD6C;&amp;#xB77C;&amp;#xB3C4; &amp;#xB9C8;&amp;#xC74C;&amp;#xB9CC; &amp;#xBA39;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xAC1C;&amp;#xC778;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB9CC;&amp;#xD07C; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xB840;&amp;#xC5D0;&amp;#xC694; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0; CiberinteligenciaSV&amp;#xAC00; &amp;#xB204;&amp;#xAD6C;&amp;#xC778;&amp;#xC9C0;, &amp;#xC5B4;&amp;#xB290; &amp;#xB098;&amp;#xB77C;&amp;#xC640; &amp;#xC5B4;&amp;#xB290; &amp;#xD300;&amp;#xC5D0; &amp;#xAC70;&amp;#xCC98;&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBC1D;&amp;#xD600;&amp;#xC9C4; &amp;#xAC83;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xD398;&amp;#xC778;&amp;#xC5B4;&amp;#xB85C; &amp;#x2018;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD65C;&amp;#xB3D9;&amp;#xAC00; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18D;&amp;#xD574; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70;, &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xC6CC;&amp;#xB529; &amp;#xD560; &amp;#xBFD0;&amp;#x2019;, &amp;#x2018;&amp;#xC774;&amp;#xBBF8; &amp;#xACFC;&amp;#xCE74;&amp;#xB9C8;&amp;#xC57C; &amp;#xADF8;&amp;#xB8F9;(Guacamaya Group)&amp;#xC774; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C0;&amp;#xAE08; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB2E4;&amp;#x2019;&amp;#xB77C;&amp;#xACE0; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD574; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBD80;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; CiberinteligenciaSV&amp;#xC758; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#x2018;&lt;a href=&#34;https://t.me/guacamayal&#34;&gt;https://t.me/guacamayal&amp;#x2019;&lt;/a&gt; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xCC38; &amp;#xC804;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC744; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7FD;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#x1F620;&amp;#x1F625;&lt;/p&gt;
&lt;p&gt;CiberinteligenciaSV&amp;#xB294; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xBB3C; &amp;#xD639;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACE0; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xB9E4;&amp;#xCE6D;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.biometricupdate.com/202405/el-salvador-data-breach-includes-selfies-and-id-numbers-for-80-of-countrys-population&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Guacamaya Group : &amp;#xB0A8;&amp;#xBBF8; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xD2F0;&amp;#xBE44;&amp;#xC2A4;&amp;#xD2B8; &amp;#xB2E8;&amp;#xCCB4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F680; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5; &amp;#xC8FC;&amp;#xB3C4; &amp;#x2018;New Space&amp;#x2019; &amp;#xC2DC;&amp;#xB300;, &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xC548;&amp;#xBCF4; &amp;#xC911;&amp;#xC694;&amp;#xC131; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC838;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;http://www.boannews.com/media/view.asp?idx=130024&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6D;&amp;#xAC00; &amp;#xC8FC;&amp;#xB3C4; &amp;#xCCB4;&amp;#xC81C; &amp;#xACBD;&amp;#xC7C1;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#x2018;Old Space&amp;#x2019; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xAC00;&amp;#xACE0;, &lt;strong&gt;&amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&lt;/strong&gt;&amp;#xC774; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB294; &amp;#x2018;&lt;strong&gt;New Space&lt;/strong&gt;&amp;#x2019; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F4AB; &amp;#xBBFC;&amp;#xAC04;&amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xD56D;&amp;#xACF5;&amp;#xC6B0;&amp;#xC8FC;(Aerospace) &amp;#xC0B0;&amp;#xC5C5;&amp;#xC744; &amp;#xC8FC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; New Space&amp;#xC778;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xACF3;&amp;#xACF3;&amp;#xC5D0; &amp;#xAD11;&amp;#xB300;&amp;#xC5ED; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xD0C0;&amp;#xB9C1;&amp;#xD06C;(Starlink) &amp;#xC778;&amp;#xACF5;&amp;#xC704;&amp;#xC131;&amp;#xC744; &amp;#xBC1C;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;X, &amp;#xD154;&amp;#xB808;&amp;#xC0DB;(Telesat)&amp;#xACFC; &amp;#xC544;&amp;#xB9C8;&amp;#xC874;, &amp;#xBC84;&amp;#xC9C4; &amp;#xAC24;&amp;#xB7ED;&amp;#xD2F1; &amp;#xB4F1; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC65C; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC84C;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F9D0; &lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80;&amp;#xAC00; &amp;#xBBFC;&amp;#xAC04; &amp;#xC6B0;&amp;#xC8FC;&amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0; &amp;#xBBF8;&amp;#xAD6D;&amp;#xD56D;&amp;#xACF5;&amp;#xC6B0;&amp;#xC8FC;&amp;#xAD6D;(National Aeronautics and Space Administration, NASA)&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xC774;&amp;#xC804;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBBFC;&amp;#xAC04; &amp;#xC704;&amp;#xC131; &amp;#xBC1C;&amp;#xC0AC;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xBA70; &amp;#xAD00;&amp;#xB828; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC774; &amp;#xC131;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB098;&amp;#xB77C; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F1F0;&amp;#x1F1F7;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;(&amp;#xC774;&amp;#xD558; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;)&amp;#xC758; &amp;#x2018;&lt;strong&gt;&lt;em&gt;2023 &amp;#xC6B0;&amp;#xC8FC;&amp;#xC0B0;&amp;#xC5C5; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC870;&amp;#xC0AC;&lt;/em&gt;&lt;/strong&gt;&amp;#x2019;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4; &amp;#xAE30;&amp;#xC5C5;&amp;#xB7;&amp;#xAE30;&amp;#xAD00; &amp;#xC218;&amp;#xB294; 2014&amp;#xB144; 248&amp;#xAC1C;&amp;#xC5D0;&amp;#xC11C; 2022&amp;#xB144; 442&amp;#xAC1C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F319;&amp;#x1F320; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAE30;&amp;#xC5C5;&amp;#xB7;&amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xC810;&amp;#xCC28; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C0;&amp;#xBA70; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xB3C4; &amp;#xCEE4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image6.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; 3&amp;#xC6D4;, &amp;#xBD81;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &lt;a href=&#34;https://biz.chosun.com/science-chosun/science/2024/03/26/QH6X2YD5A5FLDJLDYJXJPMJA5M/&#34;&gt;&amp;#xAD6D;&amp;#xAC00;&amp;#xC704;&amp;#xC131;&amp;#xC6B4;&amp;#xC601;&amp;#xC13C;&amp;#xD130;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC744; &amp;#xB2F9;&amp;#xD588;&amp;#xB358; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC54C;&amp;#xACE0;&amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xC815;&amp;#xC6D0;&amp;#xACFC; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xAC00; &amp;#xD611;&amp;#xB825;&amp;#xD574; &amp;#xC870;&amp;#xC0AC;&amp;#xC5D0; &amp;#xCC29;&amp;#xC218;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xB274; &amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC2DC;&amp;#xB300;&amp;#xB85C;&amp;#xC758; &amp;#xC804;&amp;#xD658;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC6B0;&amp;#xC8FC;&amp;#xC0B0;&amp;#xC5C5; &amp;#xAD00;&amp;#xB828; &amp;#xBD84;&amp;#xC57C;&amp;#xB97C; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xB3C4; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xBA74;&amp;#xC11C; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; &amp;#xC8FC;&amp;#xC694;&amp;#xAD6D;&amp;#xB4E4;&amp;#xC740; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xCC45;&amp;#xC801; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F603; &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F1FA;&amp;#x1F1F8; &amp;#xBBF8;&amp;#xAD6D;&lt;/strong&gt;&amp;#xC740; &amp;#x2018;&amp;#xAD6D;&amp;#xAC00;&amp;#xC548;&amp;#xBCF4;&amp;#xC804;&amp;#xB7B5;&amp;#x2019;, &amp;#x2018;&amp;#xC6B0;&amp;#xC8FC; &amp;#xC815;&amp;#xCC45; &amp;#xC9C0;&amp;#xCE68;&amp;#x2019;, &amp;#x2018;&amp;#xAD6D;&amp;#xAC00;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xC548;&amp;#xBCF4;&amp;#xC804;&amp;#xB7B5;&amp;#x2019;, &lt;strong&gt;&amp;#x1F1EA;&amp;#x1F1FA; &amp;#xC720;&amp;#xB7FD;&lt;/strong&gt; &amp;#xC5F0;&amp;#xD569;(EU)&amp;#xC740; &amp;#x2018;&amp;#xB354; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xD0C4;&amp;#xB825;&amp;#xC801;&amp;#xC778; &amp;#xC720;&amp;#xB7FD;&amp;#xC5F0;&amp;#xD569; &amp;#xBCF4;&amp;#xC7A5;&amp;#xACFC; &amp;#xC548;&amp;#xBCF4;&amp;#xB7;&amp;#xBC29;&amp;#xC704;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; EU &amp;#xC6B0;&amp;#xC8FC; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &lt;strong&gt;&amp;#x1F1E9;&amp;#x1F1EA; &amp;#xB3C5;&amp;#xC77C;&lt;/strong&gt;&amp;#xC740; &amp;#x2018;&amp;#xAD6D;&amp;#xAC00; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image7.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB098;&amp;#xB77C;&amp;#xB3C4; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC804;, &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156563&#34;&gt;&lt;strong&gt;&amp;#xC704;&amp;#xC131; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654; &amp;#xC704;&amp;#xD55C; &amp;#xAD00;&amp;#xACC4;&amp;#xAE30;&amp;#xAD00; &amp;#xD611;&amp;#xC758;&amp;#xCCB4;&amp;#xB97C; &amp;#xCD9C;&amp;#xBC94;&lt;/strong&gt;&lt;/a&gt;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xB418;&amp;#xC0B4;&amp;#xC544;&amp;#xB09C; &amp;#x2018;BreachForums&amp;#x2019;..?,  Ticketmaster 5&amp;#xC5B5; 6&amp;#xCC9C;&amp;#xB9CC;&amp;#xBA85; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC720;&amp;#xCD9C;?!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.30 | bankinfosecurity | &lt;a href=&#34;https://www.bankinfosecurity.com/stolen-ticketmaster-data-advertised-on-rebooted-breachforums-a-25363&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xB41C; BreachForums! &amp;#xB2E4;&amp;#xB4E4; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;~? &amp;#x1F609;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB41C;&amp;#xC9C0; 2&amp;#xC8FC;&amp;#xAC00; &amp;#xCC44; &amp;#xC9C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xBD80;&amp;#xD65C;&amp;#xD558;&amp;#xC5EC; &amp;#xAC01;&amp;#xC885; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xACE0; &amp;#xD314;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;..&amp;#x1F61E;&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370;.. &amp;#xC815;&amp;#xB9D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD55C; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;..? &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image8.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;BreachForums&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &lt;strong&gt;ShinyHunters&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &lt;strong&gt;Ticketmaster&lt;/strong&gt;&amp;#xC758; &amp;#xACE0;&amp;#xAC1D; &amp;#xC815;&amp;#xBCF4; 5&amp;#xC5B5; &amp;#xAC74;&amp;#xC744; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC744; &amp;#xC62C;&amp;#xB838;&amp;#xC5B4;&amp;#xC694; &amp;#x1F928; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD310;&amp;#xB9E4;&amp;#xAE00;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &lt;strong&gt;SpidermanData&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xAC00; &amp;#xD0C0; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD588;&amp;#xB358; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xAC19;&amp;#xC558;&amp;#xACE0;, &amp;#xB610; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; BreachForums&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB4F1;&amp;#xB85D; &amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xCF58;&amp;#xD150;&amp;#xCE20; &amp;#xC5F4;&amp;#xB78C;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xC810;&amp;#xB4E4;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC815;&amp;#xB9D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC758;&amp;#xC2EC;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC694; &amp;#x1F914; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC758;&amp;#xACAC;&amp;#xC774; &amp;#xBAA8;&amp;#xC544;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.malwarebytes.com/&#34;&gt;Malwarebytes&lt;/a&gt;(&amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC5C5;)&amp;#xB294; FBI&amp;#xAC00; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD558;&amp;#xB294; &amp;#xD5C8;&amp;#xC704; &amp;#xAD11;&amp;#xACE0;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xB04C;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5EC; &amp;#xC7A1;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &amp;#x2018;&amp;#xD568;&amp;#xC815; &amp;#xC218;&amp;#xC0AC; &amp;#xBC29;&amp;#xC2DD;&amp;#x2018;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC74;&amp;#xC9C0;, &amp;#xC9C4;&amp;#xC9DC; &amp;#xB418;&amp;#xC0B4;&amp;#xC544;&amp;#xB09C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xACB0;&amp;#xAD6D;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;ShinyHunters&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xB04C;&amp;#xB824;&amp;#xACE0; &amp;#xC62C;&amp;#xB9B0; &amp;#xAC83;&amp;#xC774;&lt;/strong&gt;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xACB0;&amp;#xB860;&amp;#xC744; &amp;#xB0B4;&amp;#xB838;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;(&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;, 2018&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xD568;&amp;#xC815; &amp;#xC218;&amp;#xC0AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Hansa Market &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC744; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F60E;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image9.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; BreachForums&amp;#xC758; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBD80;&amp;#xD65C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC5D0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Malwarebytes&amp;#xC640; &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, Flashpoint(&amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC5C5;)&amp;#xB294; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xB07C;&amp;#xB9AC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xD654;&amp;#xB97C; &amp;#xCB49; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xAC01;&amp;#xC885; &amp;#xB8E8;&amp;#xBA38;&amp;#xB97C; &amp;#xC811;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, BreachForums&amp;#xC758; &amp;#xC0C1;&amp;#xD669;&amp;#xB3C4; &amp;#xAF64;&amp;#xB098; &amp;#xC790;&amp;#xC8FC; &amp;#xAC70;&amp;#xB860;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC6B4;&amp;#xC601;&amp;#xC9C4;&amp;#xC774; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xB2E4;&amp;#xB290;&amp;#xB2C8;, &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xBBF8;&amp;#xAD6D; &amp;#xC0AC;&amp;#xBC95;&amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC5D0; &amp;#xBCF5;&amp;#xC218;&amp;#xB97C; &amp;#xACC4;&amp;#xD68D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB290;&amp;#xB2C8; &amp;#xD558;&amp;#xB294; &amp;#xB9D0;&amp;#xB4E4;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, BreachForums&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xD0C4;&amp;#xC0DD;&amp;#xD560; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;em&gt;breachnation.io,&lt;/em&gt; &lt;em&gt;databreached.io&lt;/em&gt; &amp;#xB4F1; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xB420; &amp;#xC815;&amp;#xB3C4;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &lt;em&gt;&lt;del&gt;&amp;#xD5C9;&lt;/del&gt;&lt;/em&gt; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;ShinyHunters&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; Ticketrmaster&amp;#xC758; 5&amp;#xC5B5; 6&amp;#xCC9C;&amp;#xAC74; &amp;#xAC00;&amp;#xB7C9;&amp;#xC744; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB3C4;&amp;#xCD9C;&amp;#xD574;&amp;#xB0C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC544;&amp;#xC9C1; BreachForums&amp;#xC774; &amp;#xBD80;&amp;#xD65C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD655;&amp;#xC5B8;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?!&amp;#x1F9D0;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://socradar.io/dark-web-profile-shinyhunters/&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;Prompt Injection&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; Prompt(&amp;#xBA85;&amp;#xB839;)&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC704;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CVE-2024-5184&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Google Chrome &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xAE00; &amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130288&#34;&gt;MS &amp;#xC624;&amp;#xD53C;&amp;#xC2A4; &amp;#xD06C;&amp;#xB799; &amp;#xBC84;&amp;#xC804; &amp;#xC124;&amp;#xCE58; &amp;#xC2DC;, &amp;#xCF54;&amp;#xC778;&amp;#xB9C8;&amp;#xC774;&amp;#xB108;&amp;#xB7;&amp;#xC6D0;&amp;#xACA9;&amp;#xC81C;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130274&#34;&gt;&amp;#xBE0C;&amp;#xB9AC;&amp;#xCE58;&amp;#xD3EC;&amp;#xB7FC;&amp;#xC988;, &amp;#xC0AC;&amp;#xBC95;&amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB41C; &amp;#xC9C0; 2&amp;#xC8FC;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD588;&amp;#xB098;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130403&#34;&gt;&amp;#xD55C;-&amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC815;&amp;#xC0C1;&amp;#xD68C;&amp;#xC758; &amp;#xACC4;&amp;#xAE30;, &amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xD611;&amp;#xB825;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130289&#34;&gt;&amp;#x65E5; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xAC70;&amp;#xB798;&amp;#xC18C; DMM, 4,200&amp;#xC5B5; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xD138;&amp;#xB824;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130294&#34;&gt;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&amp;#xD53C;&amp;#xC2F1; &amp;#xBC94;&amp;#xC8C4;&amp;#xC5D0; &amp;#xCE7C; &amp;#xBE7C;&amp;#xB4E0; &amp;#xC815;&amp;#xBD80;, AI&amp;#xB7;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD65C;&amp;#xC6A9; &amp;#xC704;&amp;#xD574; &amp;#xB300;&amp;#xB300;&amp;#xC801; &amp;#xD611;&amp;#xB825;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156598&#34;&gt;&amp;#xC778;&amp;#xD130;&amp;#xBDF0; &amp;#xC758;&amp;#xB8B0; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD55C; &amp;#xBD81;&amp;#xD55C; &amp;#xAE40;&amp;#xC218;&amp;#xD0A4; &amp;#xD574;&amp;#xD0B9;&amp;#xC870;&amp;#xC9C1; &amp;#xACF5;&amp;#xACA9; &amp;#xD3EC;&amp;#xCC29;&amp;#xB3FC;&amp;#x2026;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true&#34;&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; &lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;&lt;/a&gt;| &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | 2024.06.20&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://research.samsung.com/scpc&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~24.08.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/1014&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;amp;bbsNo=11489&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8; 2&amp;#xAE30;&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.06.17 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] EmailGPT, Prompt Injection?! - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F606;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC;&amp;#xB294; EmailGPT&amp;#xC758; Prompt Injection&amp;#xBD80;&amp;#xD130; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548;, BreachForums&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F47D;&lt;/p&gt;
&lt;p&gt;&amp;#xB0A0;&amp;#xC774; &amp;#xC810;&amp;#xC810; &amp;#xB354;&amp;#xC6CC;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9; &amp;#xC5B4;&amp;#xB5A4;&amp;#xAC00;&amp;#xC694;~? &amp;#x1F423;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; EmailGPT, Prompt Injection &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.06 | HACKREAD | &lt;a href=&#34;https://hackread.com/emailgpt-flaw-user-data-at-risk-remove-extension/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;EmailGPT &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;? &amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/Coeeter/emailgpt&#34;&gt;&lt;strong&gt;EmailGPT&lt;/strong&gt;&lt;/a&gt;&amp;#xB294; OpenAI&amp;#xC758; GPT-3.5 &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Gmail &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;strong&gt;API &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC774;&amp;#xC790; &lt;strong&gt;Google Chrome &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;Prompt Injection&lt;/strong&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! (&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&#34;&gt;CVE-2024-5184&lt;/a&gt;) &amp;#x1F47E;&amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Prompt Injection&lt;/strong&gt; &amp;#xC740; &amp;#xD2B9;&amp;#xC815; Prompt(&amp;#xBA85;&amp;#xB839;)&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xB9D0;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xBC1C; &amp;#xCD08;&amp;#xAE30; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC790;&amp;#xBA74;, &amp;#x2018;&amp;#xB10C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&amp;#xD588;&amp;#xC5B4;?&amp;#x2019;, &amp;#x2018;&amp;#xB108;&amp;#xAC00; &amp;#xD559;&amp;#xC2B5;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xC918;.&amp;#x2019; &amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Prompt&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xC2A4;&amp;#xB7F0; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;EmailGPT&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCCE4;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F9D0;&lt;/p&gt;
&lt;p&gt;Prompt Injection&amp;#xC744; &amp;#xD1B5;&amp;#xD574; EmailGPT &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC7A5;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; Prompt&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC751;&amp;#xB2F5;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2; &amp;#xC774;&amp;#xB97C; &amp;#xC751;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBE7C;&amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC2A4;&amp;#xD338; &amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xD53C;&amp;#xD574;&amp;#xAC00; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; EmailGPT &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC5F0;&amp;#xB77D;&amp;#xC774; &amp;#xB2FF;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;, &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC5B8;&amp;#xC81C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC694;&amp;#x2026;&amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;a href=&#34;https://github.com/Coeeter/EmailGPT&#34;&gt;Github&lt;/a&gt;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;, &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F631;*100&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC640; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xC544;&amp;#xC694;~ &amp;#x1F423;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#x1F1F8;&amp;#x1F1FB;, &amp;#xC804; &amp;#xAD6D;&amp;#xBBFC; &amp;#xC0DD;&amp;#xCCB4;&amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC0AC;&amp;#xAC74;&amp;#x2026; (&amp;#xD55C;&amp;#xAD6D; &amp;#xC544;&amp;#xB2D8; &amp;#xC8FC;&amp;#xC758;) &lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.06 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129652&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F1F8;&amp;#x1F1FB;&lt;/strong&gt; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC804;&amp;#xAD6D;&amp;#xBBFC; 80%&amp;#xC758; &amp;#xC0DD;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xAC1C;&amp;#xC778; &amp;#xC2DD;&amp;#xBCC4; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&lt;/strong&gt;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &amp;#x1F631;&amp;#x1FAE2;&amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CiberinteligenciaSV&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#xAD6D;&amp;#xBBFC; 500&amp;#xB9CC; &amp;#xBA85; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC57D; 1.4GB &amp;#xC720;&amp;#xCD9C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE0; &amp;#xC774;&amp;#xB294; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#xC804;&amp;#xCCB4; &amp;#xC778;&amp;#xAD6C;&amp;#xC758; 80%&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xCE58;&amp;#xC778;&amp;#xB370;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xCD9C;&amp;#xB41C; 1.4GB &amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#xACE0;&amp;#xD654;&amp;#xC9C8; &amp;#xC0AC;&amp;#xC9C4;&amp;#xB9CC; 5,129,518&amp;#xC7A5;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xAC01; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC5D8;&amp;#xC0B4;&amp;#xBC14;&amp;#xB3C4;&amp;#xB974; &amp;#x2018;&lt;strong&gt;&amp;#xC8FC;&amp;#xBBFC; &amp;#xB4F1;&amp;#xB85D; &amp;#xBC88;&amp;#xD638;&lt;/strong&gt;&amp;#x2019;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; &amp;#x2018;&lt;strong&gt;&amp;#xC774;&amp;#xB984;, &amp;#xC0DD;&amp;#xB144;&amp;#xC6D4;&amp;#xC77C;, &amp;#xC804;&amp;#xD654;&amp;#xBC88;&amp;#xD638;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC8FC;&amp;#xC18C;, &amp;#xAC70;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC18C;&lt;/strong&gt;&amp;#x2019;&amp;#xB3C4; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xB354; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; &amp;#xAC74;, &amp;#x2018;&lt;strong&gt;&amp;#xC0DD;&amp;#xCCB4; &amp;#xC778;&amp;#xC99D; &amp;#xC815;&amp;#xBCF4;&lt;/strong&gt;&amp;#x2019;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC5BC;&amp;#xAD74; &amp;#xC778;&amp;#xC2DD;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC774; &amp;#xAC1C;&amp;#xC778;&amp;#xBCC4;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAC01; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC5D0; &amp;#xAC1C;&amp;#xC778;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54C;&amp;#xB9DE;&amp;#xAC8C; &amp;#xCCA8;&amp;#xBD80;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xB204;&amp;#xAD6C;&amp;#xB77C;&amp;#xB3C4; &amp;#xB9C8;&amp;#xC74C;&amp;#xB9CC; &amp;#xBA39;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xAC1C;&amp;#xC778;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB9CC;&amp;#xD07C; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xB840;&amp;#xC5D0;&amp;#xC694; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0; CiberinteligenciaSV&amp;#xAC00; &amp;#xB204;&amp;#xAD6C;&amp;#xC778;&amp;#xC9C0;, &amp;#xC5B4;&amp;#xB290; &amp;#xB098;&amp;#xB77C;&amp;#xC640; &amp;#xC5B4;&amp;#xB290; &amp;#xD300;&amp;#xC5D0; &amp;#xAC70;&amp;#xCC98;&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBC1D;&amp;#xD600;&amp;#xC9C4; &amp;#xAC83;&amp;#xC774; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xD398;&amp;#xC778;&amp;#xC5B4;&amp;#xB85C; &amp;#x2018;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD65C;&amp;#xB3D9;&amp;#xAC00; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18D;&amp;#xD574; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70;, &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xC6CC;&amp;#xB529; &amp;#xD560; &amp;#xBFD0;&amp;#x2019;, &amp;#x2018;&amp;#xC774;&amp;#xBBF8; &amp;#xACFC;&amp;#xCE74;&amp;#xB9C8;&amp;#xC57C; &amp;#xADF8;&amp;#xB8F9;(Guacamaya Group)&amp;#xC774; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C0;&amp;#xAE08; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB2E4;&amp;#x2019;&amp;#xB77C;&amp;#xACE0; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD574; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBD80;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; CiberinteligenciaSV&amp;#xC758; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#x2018;&lt;a href=&#34;https://t.me/guacamayal&#34;&gt;https://t.me/guacamayal&amp;#x2019;&lt;/a&gt; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xCC38; &amp;#xC804;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC744; &amp;#xD63C;&amp;#xB780;&amp;#xC2A4;&amp;#xB7FD;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#x1F620;&amp;#x1F625;&lt;/p&gt;
&lt;p&gt;CiberinteligenciaSV&amp;#xB294; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xBB3C; &amp;#xD639;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACE0; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xB9E4;&amp;#xCE6D;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.biometricupdate.com/202405/el-salvador-data-breach-includes-selfies-and-id-numbers-for-80-of-countrys-population&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Guacamaya Group : &amp;#xB0A8;&amp;#xBBF8; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xD2F0;&amp;#xBE44;&amp;#xC2A4;&amp;#xD2B8; &amp;#xB2E8;&amp;#xCCB4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F680; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5; &amp;#xC8FC;&amp;#xB3C4; &amp;#x2018;New Space&amp;#x2019; &amp;#xC2DC;&amp;#xB300;, &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xC548;&amp;#xBCF4; &amp;#xC911;&amp;#xC694;&amp;#xC131; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC838;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;http://www.boannews.com/media/view.asp?idx=130024&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6D;&amp;#xAC00; &amp;#xC8FC;&amp;#xB3C4; &amp;#xCCB4;&amp;#xC81C; &amp;#xACBD;&amp;#xC7C1;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &amp;#x2018;Old Space&amp;#x2019; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xAC00;&amp;#xACE0;, &lt;strong&gt;&amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&lt;/strong&gt;&amp;#xC774; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB294; &amp;#x2018;&lt;strong&gt;New Space&lt;/strong&gt;&amp;#x2019; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F4AB; &amp;#xBBFC;&amp;#xAC04;&amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xD56D;&amp;#xACF5;&amp;#xC6B0;&amp;#xC8FC;(Aerospace) &amp;#xC0B0;&amp;#xC5C5;&amp;#xC744; &amp;#xC8FC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xB300;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; New Space&amp;#xC778;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xACF3;&amp;#xACF3;&amp;#xC5D0; &amp;#xAD11;&amp;#xB300;&amp;#xC5ED; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xD0C0;&amp;#xB9C1;&amp;#xD06C;(Starlink) &amp;#xC778;&amp;#xACF5;&amp;#xC704;&amp;#xC131;&amp;#xC744; &amp;#xBC1C;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;X, &amp;#xD154;&amp;#xB808;&amp;#xC0DB;(Telesat)&amp;#xACFC; &amp;#xC544;&amp;#xB9C8;&amp;#xC874;, &amp;#xBC84;&amp;#xC9C4; &amp;#xAC24;&amp;#xB7ED;&amp;#xD2F1; &amp;#xB4F1; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC65C; &amp;#xBBFC;&amp;#xAC04; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xD65C;&amp;#xB3D9;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xCEE4;&amp;#xC84C;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F9D0; &lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80;&amp;#xAC00; &amp;#xBBFC;&amp;#xAC04; &amp;#xC6B0;&amp;#xC8FC;&amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0; &amp;#xBBF8;&amp;#xAD6D;&amp;#xD56D;&amp;#xACF5;&amp;#xC6B0;&amp;#xC8FC;&amp;#xAD6D;(National Aeronautics and Space Administration, NASA)&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xC774;&amp;#xC804;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBBFC;&amp;#xAC04; &amp;#xC704;&amp;#xC131; &amp;#xBC1C;&amp;#xC0AC;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xBA70; &amp;#xAD00;&amp;#xB828; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC774; &amp;#xC131;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB098;&amp;#xB77C; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F1F0;&amp;#x1F1F7;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;(&amp;#xC774;&amp;#xD558; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;)&amp;#xC758; &amp;#x2018;&lt;strong&gt;&lt;em&gt;2023 &amp;#xC6B0;&amp;#xC8FC;&amp;#xC0B0;&amp;#xC5C5; &amp;#xC2E4;&amp;#xD0DC;&amp;#xC870;&amp;#xC0AC;&lt;/em&gt;&lt;/strong&gt;&amp;#x2019;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4; &amp;#xAE30;&amp;#xC5C5;&amp;#xB7;&amp;#xAE30;&amp;#xAD00; &amp;#xC218;&amp;#xB294; 2014&amp;#xB144; 248&amp;#xAC1C;&amp;#xC5D0;&amp;#xC11C; 2022&amp;#xB144; 442&amp;#xAC1C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F319;&amp;#x1F320; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAE30;&amp;#xC5C5;&amp;#xB7;&amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xC810;&amp;#xCC28; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C0;&amp;#xBA70; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xC911;&amp;#xC694;&amp;#xC131;&amp;#xB3C4; &amp;#xCEE4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image6.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; 3&amp;#xC6D4;, &amp;#xBD81;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &lt;a href=&#34;https://biz.chosun.com/science-chosun/science/2024/03/26/QH6X2YD5A5FLDJLDYJXJPMJA5M/&#34;&gt;&amp;#xAD6D;&amp;#xAC00;&amp;#xC704;&amp;#xC131;&amp;#xC6B4;&amp;#xC601;&amp;#xC13C;&amp;#xD130;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC744; &amp;#xB2F9;&amp;#xD588;&amp;#xB358; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC54C;&amp;#xACE0;&amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xC815;&amp;#xC6D0;&amp;#xACFC; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xAC00; &amp;#xD611;&amp;#xB825;&amp;#xD574; &amp;#xC870;&amp;#xC0AC;&amp;#xC5D0; &amp;#xCC29;&amp;#xC218;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xB274; &amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC2DC;&amp;#xB300;&amp;#xB85C;&amp;#xC758; &amp;#xC804;&amp;#xD658;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC6B0;&amp;#xC8FC;&amp;#xC0B0;&amp;#xC5C5; &amp;#xAD00;&amp;#xB828; &amp;#xBD84;&amp;#xC57C;&amp;#xB97C; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xB3C4; &amp;#xB298;&amp;#xC5B4;&amp;#xB098;&amp;#xBA74;&amp;#xC11C; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; &amp;#xC8FC;&amp;#xC694;&amp;#xAD6D;&amp;#xB4E4;&amp;#xC740; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xCC45;&amp;#xC801; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F603; &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F1FA;&amp;#x1F1F8; &amp;#xBBF8;&amp;#xAD6D;&lt;/strong&gt;&amp;#xC740; &amp;#x2018;&amp;#xAD6D;&amp;#xAC00;&amp;#xC548;&amp;#xBCF4;&amp;#xC804;&amp;#xB7B5;&amp;#x2019;, &amp;#x2018;&amp;#xC6B0;&amp;#xC8FC; &amp;#xC815;&amp;#xCC45; &amp;#xC9C0;&amp;#xCE68;&amp;#x2019;, &amp;#x2018;&amp;#xAD6D;&amp;#xAC00;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xC548;&amp;#xBCF4;&amp;#xC804;&amp;#xB7B5;&amp;#x2019;, &lt;strong&gt;&amp;#x1F1EA;&amp;#x1F1FA; &amp;#xC720;&amp;#xB7FD;&lt;/strong&gt; &amp;#xC5F0;&amp;#xD569;(EU)&amp;#xC740; &amp;#x2018;&amp;#xB354; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xD0C4;&amp;#xB825;&amp;#xC801;&amp;#xC778; &amp;#xC720;&amp;#xB7FD;&amp;#xC5F0;&amp;#xD569; &amp;#xBCF4;&amp;#xC7A5;&amp;#xACFC; &amp;#xC548;&amp;#xBCF4;&amp;#xB7;&amp;#xBC29;&amp;#xC704;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; EU &amp;#xC6B0;&amp;#xC8FC; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &lt;strong&gt;&amp;#x1F1E9;&amp;#x1F1EA; &amp;#xB3C5;&amp;#xC77C;&lt;/strong&gt;&amp;#xC740; &amp;#x2018;&amp;#xAD6D;&amp;#xAC00; &amp;#xC6B0;&amp;#xC8FC; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image7.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB098;&amp;#xB77C;&amp;#xB3C4; &amp;#xC5BC;&amp;#xB9C8; &amp;#xC804;, &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156563&#34;&gt;&lt;strong&gt;&amp;#xC704;&amp;#xC131; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654; &amp;#xC704;&amp;#xD55C; &amp;#xAD00;&amp;#xACC4;&amp;#xAE30;&amp;#xAD00; &amp;#xD611;&amp;#xC758;&amp;#xCCB4;&amp;#xB97C; &amp;#xCD9C;&amp;#xBC94;&lt;/strong&gt;&lt;/a&gt;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xB418;&amp;#xC0B4;&amp;#xC544;&amp;#xB09C; &amp;#x2018;BreachForums&amp;#x2019;..?,  Ticketmaster 5&amp;#xC5B5; 6&amp;#xCC9C;&amp;#xB9CC;&amp;#xBA85; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC720;&amp;#xCD9C;?!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.30 | bankinfosecurity | &lt;a href=&#34;https://www.bankinfosecurity.com/stolen-ticketmaster-data-advertised-on-rebooted-breachforums-a-25363&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/&#34;&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB274;&amp;#xC2A4;&amp;#xB808;&amp;#xD130;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xB41C; BreachForums! &amp;#xB2E4;&amp;#xB4E4; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;~? &amp;#x1F609;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB41C;&amp;#xC9C0; 2&amp;#xC8FC;&amp;#xAC00; &amp;#xCC44; &amp;#xC9C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xBD80;&amp;#xD65C;&amp;#xD558;&amp;#xC5EC; &amp;#xAC01;&amp;#xC885; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xACE0; &amp;#xD314;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;..&amp;#x1F61E;&lt;/p&gt;
&lt;p&gt;&amp;#xADFC;&amp;#xB370;.. &amp;#xC815;&amp;#xB9D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD55C; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;..? &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image8.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;BreachForums&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &lt;strong&gt;ShinyHunters&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &lt;strong&gt;Ticketmaster&lt;/strong&gt;&amp;#xC758; &amp;#xACE0;&amp;#xAC1D; &amp;#xC815;&amp;#xBCF4; 5&amp;#xC5B5; &amp;#xAC74;&amp;#xC744; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC744; &amp;#xC62C;&amp;#xB838;&amp;#xC5B4;&amp;#xC694; &amp;#x1F928; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD310;&amp;#xB9E4;&amp;#xAE00;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &lt;strong&gt;SpidermanData&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xAC00; &amp;#xD0C0; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD588;&amp;#xB358; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xAC19;&amp;#xC558;&amp;#xACE0;, &amp;#xB610; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; BreachForums&amp;#xB294; &amp;#xC774;&amp;#xC804;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB4F1;&amp;#xB85D; &amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xCF58;&amp;#xD150;&amp;#xCE20; &amp;#xC5F4;&amp;#xB78C;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xC810;&amp;#xB4E4;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC815;&amp;#xB9D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC758;&amp;#xC2EC;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC694; &amp;#x1F914; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xB450;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC758;&amp;#xACAC;&amp;#xC774; &amp;#xBAA8;&amp;#xC544;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.malwarebytes.com/&#34;&gt;Malwarebytes&lt;/a&gt;(&amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC5C5;)&amp;#xB294; FBI&amp;#xAC00; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD558;&amp;#xB294; &amp;#xD5C8;&amp;#xC704; &amp;#xAD11;&amp;#xACE0;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xB04C;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5EC; &amp;#xC7A1;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &amp;#x2018;&amp;#xD568;&amp;#xC815; &amp;#xC218;&amp;#xC0AC; &amp;#xBC29;&amp;#xC2DD;&amp;#x2018;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC74;&amp;#xC9C0;, &amp;#xC9C4;&amp;#xC9DC; &amp;#xB418;&amp;#xC0B4;&amp;#xC544;&amp;#xB09C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xACB0;&amp;#xAD6D;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;ShinyHunters&amp;#xAC00; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xAD00;&amp;#xC2EC;&amp;#xC744; &amp;#xB04C;&amp;#xB824;&amp;#xACE0; &amp;#xC62C;&amp;#xB9B0; &amp;#xAC83;&amp;#xC774;&lt;/strong&gt;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xACB0;&amp;#xB860;&amp;#xC744; &amp;#xB0B4;&amp;#xB838;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;(&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;, 2018&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xD568;&amp;#xC815; &amp;#xC218;&amp;#xC0AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Hansa Market &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC744; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F60E;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/10/clalxk/newsletter0610/image9.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; BreachForums&amp;#xC758; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBD80;&amp;#xD65C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC5D0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Malwarebytes&amp;#xC640; &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, Flashpoint(&amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC5C5;)&amp;#xB294; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xB07C;&amp;#xB9AC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xD654;&amp;#xB97C; &amp;#xCB49; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xAC01;&amp;#xC885; &amp;#xB8E8;&amp;#xBA38;&amp;#xB97C; &amp;#xC811;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, BreachForums&amp;#xC758; &amp;#xC0C1;&amp;#xD669;&amp;#xB3C4; &amp;#xAF64;&amp;#xB098; &amp;#xC790;&amp;#xC8FC; &amp;#xAC70;&amp;#xB860;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC6B4;&amp;#xC601;&amp;#xC9C4;&amp;#xC774; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xB2E4;&amp;#xB290;&amp;#xB2C8;, &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xBBF8;&amp;#xAD6D; &amp;#xC0AC;&amp;#xBC95;&amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC5D0; &amp;#xBCF5;&amp;#xC218;&amp;#xB97C; &amp;#xACC4;&amp;#xD68D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB290;&amp;#xB2C8; &amp;#xD558;&amp;#xB294; &amp;#xB9D0;&amp;#xB4E4;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, BreachForums&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xD0C4;&amp;#xC0DD;&amp;#xD560; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;em&gt;breachnation.io,&lt;/em&gt; &lt;em&gt;databreached.io&lt;/em&gt; &amp;#xB4F1; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xB420; &amp;#xC815;&amp;#xB3C4;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &lt;em&gt;&lt;del&gt;&amp;#xD5C9;&lt;/del&gt;&lt;/em&gt; &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;ShinyHunters&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; Ticketrmaster&amp;#xC758; 5&amp;#xC5B5; 6&amp;#xCC9C;&amp;#xAC74; &amp;#xAC00;&amp;#xB7C9;&amp;#xC744; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB3C4;&amp;#xCD9C;&amp;#xD574;&amp;#xB0C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC544;&amp;#xC9C1; BreachForums&amp;#xC774; &amp;#xBD80;&amp;#xD65C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD655;&amp;#xC5B8;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?!&amp;#x1F9D0;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://socradar.io/dark-web-profile-shinyhunters/&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;Prompt Injection&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; Prompt(&amp;#xBA85;&amp;#xB839;)&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xCD9C;&amp;#xB825;&amp;#xC744; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD589;&amp;#xC704;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CVE-2024-5184&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2024-5184&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Google Chrome &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xAE00; &amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130288&#34;&gt;MS &amp;#xC624;&amp;#xD53C;&amp;#xC2A4; &amp;#xD06C;&amp;#xB799; &amp;#xBC84;&amp;#xC804; &amp;#xC124;&amp;#xCE58; &amp;#xC2DC;, &amp;#xCF54;&amp;#xC778;&amp;#xB9C8;&amp;#xC774;&amp;#xB108;&amp;#xB7;&amp;#xC6D0;&amp;#xACA9;&amp;#xC81C;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130274&#34;&gt;&amp;#xBE0C;&amp;#xB9AC;&amp;#xCE58;&amp;#xD3EC;&amp;#xB7FC;&amp;#xC988;, &amp;#xC0AC;&amp;#xBC95;&amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB41C; &amp;#xC9C0; 2&amp;#xC8FC;&amp;#xB9CC;&amp;#xC5D0; &amp;#xBD80;&amp;#xD65C;&amp;#xD588;&amp;#xB098;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130403&#34;&gt;&amp;#xD55C;-&amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC815;&amp;#xC0C1;&amp;#xD68C;&amp;#xC758; &amp;#xACC4;&amp;#xAE30;, &amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xD611;&amp;#xB825;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130289&#34;&gt;&amp;#x65E5; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xAC70;&amp;#xB798;&amp;#xC18C; DMM, 4,200&amp;#xC5B5; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xD138;&amp;#xB824;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130294&#34;&gt;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&amp;#xD53C;&amp;#xC2F1; &amp;#xBC94;&amp;#xC8C4;&amp;#xC5D0; &amp;#xCE7C; &amp;#xBE7C;&amp;#xB4E0; &amp;#xC815;&amp;#xBD80;, AI&amp;#xB7;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD65C;&amp;#xC6A9; &amp;#xC704;&amp;#xD574; &amp;#xB300;&amp;#xB300;&amp;#xC801; &amp;#xD611;&amp;#xB825;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156598&#34;&gt;&amp;#xC778;&amp;#xD130;&amp;#xBDF0; &amp;#xC758;&amp;#xB8B0; &amp;#xC0AC;&amp;#xCE6D;&amp;#xD55C; &amp;#xBD81;&amp;#xD55C; &amp;#xAE40;&amp;#xC218;&amp;#xD0A4; &amp;#xD574;&amp;#xD0B9;&amp;#xC870;&amp;#xC9C1; &amp;#xACF5;&amp;#xACA9; &amp;#xD3EC;&amp;#xCC29;&amp;#xB3FC;&amp;#x2026;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#6&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;6&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true&#34;&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; &lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;&lt;/a&gt;| &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | 2024.06.20&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/&#34;&gt;AI &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB7A9;&lt;/a&gt; | &amp;#xCF54;&amp;#xB4DC;&amp;#xAC8C;&amp;#xC774;&amp;#xD2B8; | ~ 2024.06.30 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://research.samsung.com/scpc&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~24.08.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/1014&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;amp;bbsNo=11489&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8; 2&amp;#xAE30;&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~ 24.06.17 &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/Newsletter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/06/10/clalxk/newsletter0610/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] EmailGPT, Prompt Injection?! - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-06-10 17:00" pubdate>
      2024ë…„ 6ì›” 10ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.8k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      56
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] EmailGPT, Prompt Injection?!</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, clalxk &#xC785;&#xB2C8;&#xB2E4; &#x1F606;</p>
<p>&#xC774;&#xBC88; &#xC8FC;&#xB294; EmailGPT&#xC758; Prompt Injection&#xBD80;&#xD130; &#xC6B0;&#xC8FC; &#xC0B0;&#xC5C5; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548;, BreachForums&#xAE4C;&#xC9C0; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xC900;&#xBE44;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;! &#x1F47D;</p>
<p>&#xB0A0;&#xC774; &#xC810;&#xC810; &#xB354;&#xC6CC;&#xC9C0;&#xB294;&#xB370; &#xC2DC;&#xC6D0;&#xD55C; &#xACF3;&#xC5D0;&#xC11C; &#xD574;&#xD0B9;&#xC9F9;&#xC9F9; &#xC5B4;&#xB5A4;&#xAC00;&#xC694;~? &#x1F423;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x26A0;&#xFE0F; EmailGPT, Prompt Injection &#xCDE8;&#xC57D;&#xC810; &#xBC1C;&#xACAC;</p>
</blockquote>
<p>2024.06.06 | HACKREAD | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://hackread.com/emailgpt-flaw-user-data-at-risk-remove-extension/">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>EmailGPT &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC2E0; &#xBD84; &#xACC4;&#xC2E0;&#xAC00;&#xC694;? &#x1F440;</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Coeeter/emailgpt"><strong>EmailGPT</strong></a>&#xB294; OpenAI&#xC758; GPT-3.5 &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; Gmail &#xB0B4;&#xC5D0;&#xC11C; &#xC774;&#xBA54;&#xC77C;&#xC744; &#xC791;&#xC131;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD558;&#xB294; <strong>API &#xC11C;&#xBE44;&#xC2A4;</strong>&#xC774;&#xC790; <strong>Google Chrome &#xD655;&#xC7A5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</strong>&#xC774;&#xC5D0;&#xC694;! </p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; <strong>Prompt Injection</strong> &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC5B4;&#xC694;! (<a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2024-5184">CVE-2024-5184</a>) &#x1F47E;&#x1FAE2;</p>
<p><strong>Prompt Injection</strong> &#xC740; &#xD2B9;&#xC815; Prompt(&#xBA85;&#xB839;)&#xB97C; &#xC8FC;&#xC785;&#xD558;&#xC5EC; &#xBAA8;&#xB378;&#xC758; &#xCD9C;&#xB825;&#xC744; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xC870;&#xC791;&#xD558;&#xB294; &#xD589;&#xC704;&#xB97C; &#xB9D0;&#xD558;&#xB294;&#xB370;&#xC694;.</p>
<p>&#xAC1C;&#xBC1C; &#xCD08;&#xAE30; &#xBAA8;&#xB378;&#xB85C; &#xC27D;&#xAC8C; &#xC608;&#xB97C; &#xB4E4;&#xC790;&#xBA74;, &#x2018;&#xB10C; &#xC5B4;&#xB5A4; &#xB370;&#xC774;&#xD130;&#xB85C; &#xD559;&#xC2B5;&#xD588;&#xC5B4;?&#x2019;, &#x2018;&#xB108;&#xAC00; &#xD559;&#xC2B5;&#xD55C; &#xBC29;&#xC2DD;&#xC744; &#xC124;&#xBA85;&#xD574;&#xC918;.&#x2019; &#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; Prompt&#xB97C; &#xC785;&#xB825;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB378;&#xC758; &#xBE44;&#xBC00;&#xC2A4;&#xB7F0; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xC54C;&#xC544;&#xB0BC; &#xC218; &#xC788;&#xC5B4;&#xC694;. </p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>EmailGPT&#xC5D0;&#xC11C;&#xB294; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC5B4;&#xB5A4; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCCE4;&#xC744;&#xAE4C;&#xC694;? &#x1F9D0;</p>
<p>Prompt Injection&#xC744; &#xD1B5;&#xD574; EmailGPT &#xC11C;&#xBE44;&#xC2A4; &#xC804;&#xCCB4; &#xB85C;&#xC9C1;&#xC744; &#xC7A5;&#xC545;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xC545;&#xC758;&#xC801;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xC694;&#xCCAD;&#xD558;&#xB294; Prompt&#xB97C; &#xC785;&#xB825;&#xD558;&#xBA74; &#xC694;&#xCCAD;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC751;&#xB2F5;&#xC73C;&#xB85C; &#xC81C;&#xACF5;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1FAE2; &#xC774;&#xB97C; &#xC751;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBE7C;&#xB3CC;&#xB9AC;&#xACE0; &#xC2A4;&#xD338; &#xBA54;&#xC77C;&#xC744; &#xC804;&#xC1A1;&#xD558;&#xB294; &#xB4F1; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xD53C;&#xD574;&#xAC00; &#xC774;&#xC5B4;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1F631; </p>
<p>&#xD604;&#xC7AC; EmailGPT &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xACFC; &#xC5F0;&#xB77D;&#xC774; &#xB2FF;&#xC9C0; &#xC54A;&#xC544;, &#xD328;&#xCE58;&#xAC00; &#xC5B8;&#xC81C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C8; &#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC5B4;&#xC694;&#x2026;&#x1F631;</p>
<p>&#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Coeeter/EmailGPT">Github</a>&#xC5D0; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC11C;, &#xC811;&#xADFC;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xC778;&#xD130;&#xB137; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F631;*100</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC6B0;&#xB9AC; &#xC9F9;&#xC9F9;&#xC774;&#xC640; &#xC5EC;&#xB7EC;&#xBD84;&#xC740; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xB9D0;&#xC544;&#xC694;~ &#x1F423;</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; &#x1F1F8;&#x1F1FB;, &#xC804; &#xAD6D;&#xBBFC; &#xC0DD;&#xCCB4;&#xC815;&#xBCF4; &#xD0C8;&#xCDE8; &#xC0AC;&#xAC74;&#x2026; (&#xD55C;&#xAD6D; &#xC544;&#xB2D8; &#xC8FC;&#xC758;) </p>
</blockquote>
<p>2024.06.06 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=129652">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><strong>&#x1F1F8;&#x1F1FB;</strong> &#xC5D8;&#xC0B4;&#xBC14;&#xB3C4;&#xB974;&#xC5D0;&#xC11C; <strong>&#xC804;&#xAD6D;&#xBBFC; 80%&#xC758; &#xC0DD;&#xCCB4; &#xC815;&#xBCF4;&#xC640; &#xAC1C;&#xC778; &#xC2DD;&#xBCC4; &#xC815;&#xBCF4;&#xAC00; &#xC720;&#xCD9C;</strong>&#xB418;&#xC5C8;&#xC5B4;&#xC694;! &#x1F631;&#x1FAE2;&#x1F440;</p>
<p><strong>CiberinteligenciaSV</strong>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xD65C;&#xB3D9;&#xD558;&#xB294; &#xC790;&#xAC00; &#xB2E4;&#xD06C;&#xC6F9;&#xC744; &#xD1B5;&#xD574; &#xC5D8;&#xC0B4;&#xBC14;&#xB3C4;&#xB974; &#xAD6D;&#xBBFC; 500&#xB9CC; &#xBA85; &#xC774;&#xC0C1;&#xC758; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xC57D; 1.4GB &#xC720;&#xCD9C;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1FAE0; &#xC774;&#xB294; &#xC5D8;&#xC0B4;&#xBC14;&#xB3C4;&#xB974; &#xC804;&#xCCB4; &#xC778;&#xAD6C;&#xC758; 80%&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xC218;&#xCE58;&#xC778;&#xB370;&#xC694;..</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC720;&#xCD9C;&#xB41C; 1.4GB &#xC911;&#xC5D0;&#xB294; &#xACE0;&#xD654;&#xC9C8; &#xC0AC;&#xC9C4;&#xB9CC; 5,129,518&#xC7A5;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xAC01; &#xC0AC;&#xC9C4;&#xC5D0;&#xB294; &#xC5D8;&#xC0B4;&#xBC14;&#xB3C4;&#xB974; &#x2018;<strong>&#xC8FC;&#xBBFC; &#xB4F1;&#xB85D; &#xBC88;&#xD638;</strong>&#x2019;&#xB97C; &#xBE44;&#xB86F;&#xD55C; &#x2018;<strong>&#xC774;&#xB984;, &#xC0DD;&#xB144;&#xC6D4;&#xC77C;, &#xC804;&#xD654;&#xBC88;&#xD638;, &#xC774;&#xBA54;&#xC77C; &#xC8FC;&#xC18C;, &#xAC70;&#xC8FC;&#xC9C0; &#xC8FC;&#xC18C;</strong>&#x2019;&#xB3C4; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xC5B4;&#xC694;. &#xB354; &#xCE58;&#xBA85;&#xC801;&#xC778; &#xAC74;, &#x2018;<strong>&#xC0DD;&#xCCB4; &#xC778;&#xC99D; &#xC815;&#xBCF4;</strong>&#x2019;&#xB3C4; &#xAC19;&#xC774; &#xB4E4;&#xC5B4;&#xC788;&#xC5C8;&#xB2E4;&#xB294; &#xAC83;&#xC778;&#xB370;&#xC694;.</p>
<p><strong>&#xC5BC;&#xAD74; &#xC778;&#xC2DD;&#xC744; &#xC704;&#xD55C; &#xC790;&#xB8CC;&#xB4E4;&#xC774; &#xAC1C;&#xC778;&#xBCC4;&#xB85C; &#xC815;&#xB9AC;</strong>&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xACE0;, &#xAC01; &#xC790;&#xB8CC;&#xB4E4;&#xC5D0; &#xAC1C;&#xC778;&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xAE30;&#xC5D0; &#xCDA9;&#xBD84;&#xD55C; &#xC815;&#xBCF4;&#xAE4C;&#xC9C0;&#xB3C4; &#xC54C;&#xB9DE;&#xAC8C; &#xCCA8;&#xBD80;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xB204;&#xAD6C;&#xB77C;&#xB3C4; &#xB9C8;&#xC74C;&#xB9CC; &#xBA39;&#xC73C;&#xBA74; &#xC774; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xAC1C;&#xC778;&#xC744; &#xD2B9;&#xC815;&#xD574; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC744;&#xB9CC;&#xD07C; &#xC2EC;&#xAC01;&#xD55C; &#xC720;&#xCD9C; &#xC0AC;&#xB840;&#xC5D0;&#xC694; &#x1F631;</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC544;&#xC9C1;&#xAE4C;&#xC9C0; CiberinteligenciaSV&#xAC00; &#xB204;&#xAD6C;&#xC778;&#xC9C0;, &#xC5B4;&#xB290; &#xB098;&#xB77C;&#xC640; &#xC5B4;&#xB290; &#xD300;&#xC5D0; &#xAC70;&#xCC98;&#xB97C; &#xB450;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xB4F1; &#xC815;&#xD655;&#xD788; &#xBC1D;&#xD600;&#xC9C4; &#xAC83;&#xC774; &#xC5C6;&#xC9C0;&#xB9CC;, &#xC2A4;&#xD398;&#xC778;&#xC5B4;&#xB85C; &#x2018;&#xC6B0;&#xB9AC;&#xB294; &#xC5B4;&#xB5A0;&#xD55C; &#xD65C;&#xB3D9;&#xAC00; &#xADF8;&#xB8F9;&#xC5D0;&#xB3C4; &#xC18D;&#xD574; &#xC788;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xACF5;&#xAC1C;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xD3EC;&#xC6CC;&#xB529; &#xD560; &#xBFD0;&#x2019;, &#x2018;&#xC774;&#xBBF8; &#xACFC;&#xCE74;&#xB9C8;&#xC57C; &#xADF8;&#xB8F9;(Guacamaya Group)&#xC774; &#xC774;&#xC804;&#xC5D0; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xACF5;&#xAC1C;&#xD55C; &#xC815;&#xBCF4;&#xC774;&#xBBC0;&#xB85C; &#xC6B0;&#xB9AC;&#xAC00; &#xC9C0;&#xAE08; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xC815;&#xBCF4;&#xB294; &#xACF5;&#xAC1C;&#xB41C; &#xC815;&#xBCF4;&#xB2E4;&#x2019;&#xB77C;&#xACE0; &#xD154;&#xB808;&#xADF8;&#xB7A8;&#xC744; &#xD1B5;&#xD574; &#xC8FC;&#xC7A5;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xC774;&#xB807;&#xAC8C; &#xADF8;&#xB8F9;&#xC5D0; &#xC18D;&#xD574; &#xC788;&#xC74C;&#xC744; &#xBD80;&#xC778;&#xD558;&#xACE0; &#xC788;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; CiberinteligenciaSV&#xC758; &#xD154;&#xB808;&#xADF8;&#xB7A8; &#xCC44;&#xB110;&#xC740; &#x2018;<a target="_blank" rel="external nofollow noopener noreferrer" href="https://t.me/guacamayal">https://t.me/guacamayal&#x2019;</a> &#xB9C1;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xCC38; &#xC804;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xD63C;&#xB780;&#xC2A4;&#xB7FD;&#xAC8C; &#xD558;&#xACE0; &#xC788;&#xB124;&#xC694;. &#x1F620;&#x1F625;</p>
<p>CiberinteligenciaSV&#xB294; &#xC0AC;&#xC9C4;&#xC744; &#xD2B9;&#xC815; &#xC778;&#xBB3C; &#xD639;&#xC740; &#xD2B9;&#xC815; &#xB370;&#xC774;&#xD130;&#xC14B;&#xACFC; &#xC5F0;&#xACB0;&#xC2DC;&#xCF1C;&#xC8FC;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C;, &#xC5EC;&#xB7EC; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xBCF4;&#xB2E4; &#xC27D;&#xAC8C; &#xCC3E;&#xACE0; &#xAC80;&#xC0C9;&#xD558;&#xACE0; &#xB9E4;&#xCE6D;&#xC2DC;&#xD0A4;&#xB294; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB3C4; &#xD568;&#xAED8; &#xACF5;&#xAC1C;&#xD588;&#xC5B4;&#xC694;. </p>
<p>&#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.biometricupdate.com/202405/el-salvador-data-breach-includes-selfies-and-id-numbers-for-80-of-countrys-population">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xC138;&#xC694;!</p>
<ul>
<li>Guacamaya Group : &#xB0A8;&#xBBF8; &#xC9C0;&#xC5ED;&#xC5D0;&#xC11C; &#xD65C;&#xB3D9;&#xD558;&#xB294; &#xD575;&#xD2F0;&#xBE44;&#xC2A4;&#xD2B8; &#xB2E8;&#xCCB4; &#xC911; &#xD558;&#xB098;</li>
</ul>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F680; &#xBBFC;&#xAC04; &#xAE30;&#xC5C5; &#xC8FC;&#xB3C4; &#x2018;New Space&#x2019; &#xC2DC;&#xB300;, &#xC6B0;&#xC8FC; &#xC0AC;&#xC774;&#xBC84;&#xC548;&#xBCF4; &#xC911;&#xC694;&#xC131; &#xB354;&#xC6B1; &#xCEE4;&#xC838;</p>
</blockquote>
<p>2024.05.28 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.boannews.com/media/view.asp?idx=130024&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image5.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC6B0;&#xC8FC; &#xC0B0;&#xC5C5;&#xC5D0;&#xC11C; &#xAD6D;&#xAC00; &#xC8FC;&#xB3C4; &#xCCB4;&#xC81C; &#xACBD;&#xC7C1;&#xC774;&#xC5C8;&#xB358; &#x2018;Old Space&#x2019; &#xC2DC;&#xB300;&#xAC00; &#xAC00;&#xACE0;, <strong>&#xBBFC;&#xAC04; &#xAE30;&#xC5C5;</strong>&#xC774; &#xB6F0;&#xC5B4;&#xB4DC;&#xB294; &#x2018;<strong>New Space</strong>&#x2019; &#xC2DC;&#xB300;&#xAC00; &#xC624;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F4AB; &#xBBFC;&#xAC04;&#xAE30;&#xC5C5;&#xC774; &#xD56D;&#xACF5;&#xC6B0;&#xC8FC;(Aerospace) &#xC0B0;&#xC5C5;&#xC744; &#xC8FC;&#xB3C4;&#xD558;&#xB294; &#xC2DC;&#xB300;&#xAC00; &#xBC14;&#xB85C; New Space&#xC778;&#xB370;&#xC694;. </p>
<p>&#xC804; &#xC138;&#xACC4; &#xACF3;&#xACF3;&#xC5D0; &#xAD11;&#xB300;&#xC5ED; &#xC778;&#xD130;&#xB137; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC2A4;&#xD0C0;&#xB9C1;&#xD06C;(Starlink) &#xC778;&#xACF5;&#xC704;&#xC131;&#xC744; &#xBC1C;&#xC0AC;&#xD558;&#xB294; &#xC2A4;&#xD398;&#xC774;&#xC2A4;X, &#xD154;&#xB808;&#xC0DB;(Telesat)&#xACFC; &#xC544;&#xB9C8;&#xC874;, &#xBC84;&#xC9C4; &#xAC24;&#xB7ED;&#xD2F1; &#xB4F1; &#xBBFC;&#xAC04; &#xAE30;&#xC5C5;&#xC758; &#xD65C;&#xB3D9;&#xC774; &#xB354;&#xC6B1; &#xCEE4;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;. </p>
<p>&#xC65C; &#xBBFC;&#xAC04; &#xAE30;&#xC5C5;&#xC758; &#xD65C;&#xB3D9;&#xC774; &#xB354;&#xC6B1; &#xCEE4;&#xC84C;&#xC744;&#xAE4C;&#xC694;? &#x1F9D0; </p>
<p>&#xBBF8;&#xAD6D; &#xC815;&#xBD80;&#xAC00; &#xBBFC;&#xAC04; &#xC6B0;&#xC8FC;&#xAE30;&#xC5C5;&#xC5D0; &#xBBF8;&#xAD6D;&#xD56D;&#xACF5;&#xC6B0;&#xC8FC;&#xAD6D;(National Aeronautics and Space Administration, NASA)&#xC758; &#xAE30;&#xC220; &#xC774;&#xC804;&#xC744; &#xD5C8;&#xC6A9;&#xD55C; &#xAC83;&#xC774; &#xBBFC;&#xAC04; &#xC704;&#xC131; &#xBC1C;&#xC0AC;&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xBA70; &#xAD00;&#xB828; &#xC0B0;&#xC5C5;&#xC774; &#xC131;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC5B4;&#xC694;!</p>
<p>&#xADF8;&#xB7FC; &#xC6B0;&#xB9AC;&#xB098;&#xB77C; &#xC6B0;&#xC8FC; &#xC0B0;&#xC5C5;&#xC740; &#xC5B4;&#xB5A8;&#xAE4C;&#xC694;? &#x1F1F0;&#x1F1F7;</p>
<p>&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC815;&#xBCF4;&#xD1B5;&#xC2E0;&#xBD80;(&#xC774;&#xD558; &#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;)&#xC758; &#x2018;<strong><em>2023 &#xC6B0;&#xC8FC;&#xC0B0;&#xC5C5; &#xC2E4;&#xD0DC;&#xC870;&#xC0AC;</em></strong>&#x2019;&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xC6B0;&#xC8FC; &#xC0B0;&#xC5C5;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAD6D;&#xB0B4; &#xAE30;&#xC5C5;&#xB7;&#xAE30;&#xAD00; &#xC218;&#xB294; 2014&#xB144; 248&#xAC1C;&#xC5D0;&#xC11C; 2022&#xB144; 442&#xAC1C;&#xB85C; &#xC99D;&#xAC00;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F319;&#x1F320; </p>
<p>&#xC774;&#xB807;&#xAC8C; &#xAE30;&#xC5C5;&#xB7;&#xAE30;&#xAD00;&#xC774; &#xC810;&#xCC28; &#xB9CE;&#xC544;&#xC9C0;&#xBA70; &#xC6B0;&#xC8FC; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548;&#xC758; &#xC911;&#xC694;&#xC131;&#xB3C4; &#xCEE4;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC694;. </p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image6.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC9C0;&#xB09C; 3&#xC6D4;, &#xBD81;&#xD55C;&#xC73C;&#xB85C;&#xBD80;&#xD130; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://biz.chosun.com/science-chosun/science/2024/03/26/QH6X2YD5A5FLDJLDYJXJPMJA5M/">&#xAD6D;&#xAC00;&#xC704;&#xC131;&#xC6B4;&#xC601;&#xC13C;&#xD130;&#xAC00; &#xACF5;&#xACA9;</a>&#xC744; &#xB2F9;&#xD588;&#xB358; &#xC0AC;&#xC2E4; &#xC54C;&#xACE0;&#xACC4;&#xC2E0;&#xAC00;&#xC694;?</p>
<p>&#xAD6D;&#xC815;&#xC6D0;&#xACFC; &#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;&#xAC00; &#xD611;&#xB825;&#xD574; &#xC870;&#xC0AC;&#xC5D0; &#xCC29;&#xC218;&#xD588;&#xC9C0;&#xB9CC;, &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xACF5;&#xAC1C;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC5B4;&#xC694;. </p>
<p>&#xB274; &#xC2A4;&#xD398;&#xC774;&#xC2A4; &#xC2DC;&#xB300;&#xB85C;&#xC758; &#xC804;&#xD658;&#xACFC; &#xD568;&#xAED8; &#xC6B0;&#xC8FC;&#xC0B0;&#xC5C5; &#xAD00;&#xB828; &#xBD84;&#xC57C;&#xB97C; &#xB178;&#xB9AC;&#xB294; &#xC0AC;&#xC774;&#xBC84; &#xACF5;&#xACA9;&#xB3C4; &#xB298;&#xC5B4;&#xB098;&#xBA74;&#xC11C; &#xAE00;&#xB85C;&#xBC8C; &#xC8FC;&#xC694;&#xAD6D;&#xB4E4;&#xC740; &#xC6B0;&#xC8FC; &#xC0AC;&#xC774;&#xBC84; &#xACF5;&#xACA9;&#xC5D0; &#xB300;&#xC751;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xC815;&#xCC45;&#xC801; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC774;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F603; </p>
<p><strong>&#x1F1FA;&#x1F1F8; &#xBBF8;&#xAD6D;</strong>&#xC740; &#x2018;&#xAD6D;&#xAC00;&#xC548;&#xBCF4;&#xC804;&#xB7B5;&#x2019;, &#x2018;&#xC6B0;&#xC8FC; &#xC815;&#xCC45; &#xC9C0;&#xCE68;&#x2019;, &#x2018;&#xAD6D;&#xAC00;&#xC0AC;&#xC774;&#xBC84;&#xC548;&#xBCF4;&#xC804;&#xB7B5;&#x2019;, <strong>&#x1F1EA;&#x1F1FA; &#xC720;&#xB7FD;</strong> &#xC5F0;&#xD569;(EU)&#xC740; &#x2018;&#xB354; &#xAC15;&#xB825;&#xD558;&#xACE0; &#xD0C4;&#xB825;&#xC801;&#xC778; &#xC720;&#xB7FD;&#xC5F0;&#xD569; &#xBCF4;&#xC7A5;&#xACFC; &#xC548;&#xBCF4;&#xB7;&#xBC29;&#xC704;&#xB97C; &#xC704;&#xD55C; EU &#xC6B0;&#xC8FC; &#xC804;&#xB7B5;&#x2019;&#xC744; &#xBC1C;&#xD45C;&#xD588;&#xC73C;&#xBA70;, <strong>&#x1F1E9;&#x1F1EA; &#xB3C5;&#xC77C;</strong>&#xC740; &#x2018;&#xAD6D;&#xAC00; &#xC6B0;&#xC8FC; &#xC804;&#xB7B5;&#x2019;&#xC744; &#xBC1C;&#xD45C;&#xD588;&#xC5B4;&#xC694;!</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image7.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC6B0;&#xB9AC;&#xB098;&#xB77C;&#xB3C4; &#xC5BC;&#xB9C8; &#xC804;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156563"><strong>&#xC704;&#xC131; &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548; &#xAC15;&#xD654; &#xC704;&#xD55C; &#xAD00;&#xACC4;&#xAE30;&#xAD00; &#xD611;&#xC758;&#xCCB4;&#xB97C; &#xCD9C;&#xBC94;</strong></a>&#xD588;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;!</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; &#xB418;&#xC0B4;&#xC544;&#xB09C; &#x2018;BreachForums&#x2019;..?,  Ticketmaster 5&#xC5B5; 6&#xCC9C;&#xB9CC;&#xBA85; &#xB370;&#xC774;&#xD130; &#xC720;&#xCD9C;?!</p>
</blockquote>
<p>2024.05.30 | bankinfosecurity | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bankinfosecurity.com/stolen-ticketmaster-data-advertised-on-rebooted-breachforums-a-25363">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><a href="https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/">&#xC9C0;&#xB09C; &#xB274;&#xC2A4;&#xB808;&#xD130;</a>&#xC5D0;&#xC11C; &#xC18C;&#xAC1C;&#xB41C; BreachForums! &#xB2E4;&#xB4E4; &#xAE30;&#xC5B5;&#xD558;&#xACE0; &#xACC4;&#xC2E0;&#xAC00;&#xC694;~? &#x1F609;</p>
<p>&#xAD6D;&#xC81C; &#xACF5;&#xC870;&#xB85C; &#xD3D0;&#xC1C4;&#xB41C;&#xC9C0; 2&#xC8FC;&#xAC00; &#xCC44; &#xC9C0;&#xB098;&#xC9C0; &#xC54A;&#xC544;, &#xB2E4;&#xC2DC; &#xBD80;&#xD65C;&#xD558;&#xC5EC; &#xAC01;&#xC885; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xC0AC;&#xACE0; &#xD314;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;..&#x1F61E;</p>
<p>&#xADFC;&#xB370;.. &#xC815;&#xB9D0; &#xBD80;&#xD65C;&#xD55C; &#xAC78;&#xAE4C;&#xC694;..? &#x1F92F;</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image8.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>BreachForums&#xC758; &#xAD00;&#xB9AC;&#xC790;&#xB85C; &#xC54C;&#xB824;&#xC9C4; <strong>ShinyHunters</strong>&#xB77C;&#xB294; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4; &#xADF8;&#xB8F9;&#xC774; <strong>Ticketmaster</strong>&#xC758; &#xACE0;&#xAC1D; &#xC815;&#xBCF4; 5&#xC5B5; &#xAC74;&#xC744; &#xD310;&#xB9E4;&#xD558;&#xB294; &#xAE00;&#xC744; &#xC62C;&#xB838;&#xC5B4;&#xC694; &#x1F928; &#xD558;&#xC9C0;&#xB9CC; &#xD310;&#xB9E4;&#xAE00;&#xC5D0; &#xC5C5;&#xB85C;&#xB4DC; &#xB41C; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC740; &#xC774;&#xBBF8; <strong>SpidermanData</strong>&#xB77C;&#xB294; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xC790;&#xAC00; &#xD0C0; &#xB2E4;&#xD06C;&#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xC5C5;&#xB85C;&#xB4DC; &#xD588;&#xB358; &#xB370;&#xC774;&#xD130;&#xC640; &#xAC19;&#xC558;&#xACE0;, &#xB610; &#xBCF5;&#xAD6C;&#xB41C; BreachForums&#xB294; &#xC774;&#xC804;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790; &#xB4F1;&#xB85D; &#xC804;&#xC5D0;&#xB294; &#xCF58;&#xD150;&#xCE20; &#xC5F4;&#xB78C;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB3C4;&#xB85D; &#xBCC0;&#xACBD;&#xB418;&#xC5C8;&#xC5B4;&#xC694;. &#xC774;&#xB7F0; &#xC810;&#xB4E4;&#xB85C; &#xC778;&#xD574; &#xC815;&#xB9D0; &#xBD80;&#xD65C;&#xD55C; &#xAC83;&#xC778;&#xC9C0; &#xC758;&#xC2EC;&#xC774; &#xB4E4;&#xC5B4;&#xC694; &#x1F914; </p>
<p>&#xC774;&#xB97C; &#xB450;&#xACE0; &#xC5EC;&#xB7EC; &#xC758;&#xACAC;&#xC774; &#xBAA8;&#xC544;&#xC84C;&#xC5B4;&#xC694;. </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.malwarebytes.com/">Malwarebytes</a>(&#xBCF4;&#xC548; &#xAE30;&#xC5C5;)&#xB294; FBI&#xAC00; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xC790;&#xB97C; &#xC0AC;&#xCE6D;&#xD558;&#xB294; &#xD5C8;&#xC704; &#xAD11;&#xACE0;&#xB97C; &#xD1B5;&#xD574; &#xBC94;&#xC8C4;&#xC790;&#xB4E4;&#xC744; &#xB04C;&#xC5B4;&#xB4E4;&#xC5EC; &#xC7A1;&#xB294; &#xC77C;&#xC885;&#xC758; &#x2018;&#xD568;&#xC815; &#xC218;&#xC0AC; &#xBC29;&#xC2DD;&#x2018;&#xC744; &#xC0AC;&#xC6A9;&#xD55C; &#xAC74;&#xC9C0;, &#xC9C4;&#xC9DC; &#xB418;&#xC0B4;&#xC544;&#xB09C; &#xAC83;&#xC778;&#xC9C0; &#xD655;&#xC2E0;&#xD560; &#xC218; &#xC5C6;&#xC5B4;&#xC11C; &#xACB0;&#xAD6D;&#xC5D0;&#xB294; <strong>ShinyHunters&#xAC00; &#xB2E8;&#xC21C;&#xD788; &#xAD00;&#xC2EC;&#xC744; &#xB04C;&#xB824;&#xACE0; &#xC62C;&#xB9B0; &#xAC83;&#xC774;</strong>&#xB2E4;&#xB77C;&#xB294; &#xACB0;&#xB860;&#xC744; &#xB0B4;&#xB838;&#xB2E4;&#xACE0; &#xD574;&#xC694;.</p>
<p>(&#xC2E4;&#xC81C;&#xB85C;, 2018&#xB144;&#xC5D0;&#xB294; &#xD568;&#xC815; &#xC218;&#xC0AC; &#xBC29;&#xC2DD;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; Hansa Market &#xC774;&#xB77C;&#xB294; &#xB2E4;&#xD06C;&#xC6F9;&#xC744; &#xD3D0;&#xC1C4;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694; &#x1F60E;)</p>
<p><img src="/2024/06/10/clalxk/newsletter0610/image9.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xADF8;&#xB798;&#xB3C4; BreachForums&#xC758; &#xC9C4;&#xC9DC; &#xBD80;&#xD65C; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC5C6;&#xB294; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xC5D0;&#xC694;.</p>
<p>Malwarebytes&#xC640; &#xBC18;&#xB300;&#xB85C;, Flashpoint(&#xBCF4;&#xC548; &#xAE30;&#xC5C5;)&#xB294; &#xB2E4;&#xD06C;&#xC6F9;&#xC5D0;&#xC11C; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xC790;&#xB4E4;&#xB07C;&#xB9AC; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xB300;&#xD654;&#xB97C; &#xCB49; &#xB530;&#xB77C;&#xAC00;&#xB2E4;&#xBCF4;&#xBA74; &#xAC01;&#xC885; &#xB8E8;&#xBA38;&#xB97C; &#xC811;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, BreachForums&#xC758; &#xC0C1;&#xD669;&#xB3C4; &#xAF64;&#xB098; &#xC790;&#xC8FC; &#xAC70;&#xB860;&#xB418;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xC6B4;&#xC601;&#xC9C4;&#xC774; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xBC14;&#xAFE8;&#xB2E4;&#xB290;&#xB2C8;, &#xC624;&#xD788;&#xB824; &#xBBF8;&#xAD6D; &#xC0AC;&#xBC95;&#xAE30;&#xAD00;&#xB4E4;&#xC5D0; &#xBCF5;&#xC218;&#xB97C; &#xACC4;&#xD68D;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB290;&#xB2C8; &#xD558;&#xB294; &#xB9D0;&#xB4E4;&#xC774; &#xB098;&#xC624;&#xACE0; &#xC788;&#xC73C;&#xBA70;, BreachForums&#xAC00; &#xC0C8;&#xB85C;&#xC6B4; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xC7AC;&#xD0C4;&#xC0DD;&#xD560; &#xAC70;&#xB77C;&#xB294; &#xB9D0;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <em>breachnation.io,</em> <em>databreached.io</em> &#xB4F1; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;&#xB3C4; &#xC5B8;&#xAE09;&#xB420; &#xC815;&#xB3C4;&#xB77C;&#xACE0; &#xD558;&#xB124;&#xC694; <em><del>&#xD5C9;</del></em> &#x1F631;</p>
<p>ShinyHunters&#xAC00; &#xACF5;&#xAC1C;&#xD55C; Ticketrmaster&#xC758; 5&#xC5B5; 6&#xCC9C;&#xAC74; &#xAC00;&#xB7C9;&#xC744; &#xD310;&#xB9E4;&#xD558;&#xB294; &#xAE00;&#xB85C; &#xC778;&#xD574; &#xBCF4;&#xC548; &#xC5C5;&#xACC4;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xB97C; &#xB3C4;&#xCD9C;&#xD574;&#xB0C8;&#xC9C0;&#xB9CC;, &#xC544;&#xC9C1; BreachForums&#xC774; &#xBD80;&#xD65C;&#xD588;&#xB2E4;&#xACE0; &#xD655;&#xC5B8;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1F92F;</p>
<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xB098;&#xC694;?!&#x1F9D0;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://socradar.io/dark-web-profile-shinyhunters/">&#xCC38;&#xACE0;</a></p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>Prompt Injection</strong> </p>
<p>&#xD2B9;&#xC815; Prompt(&#xBA85;&#xB839;)&#xB97C; &#xC8FC;&#xC785;&#xD558;&#xC5EC; &#xBAA8;&#xB378;&#xC758; &#xCD9C;&#xB825;&#xC744; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xC870;&#xC791;&#xD558;&#xB294; &#xD589;&#xC704;</p>
<p><strong>CVE-2024-5184</strong></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2024-5184">https://nvd.nist.gov/vuln/detail/CVE-2024-5184</a></p>
<p><strong>Google Chrome &#xD655;&#xC7A5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</strong></p>
<p>&#xAD6C;&#xAE00; &#xD06C;&#xB86C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD655;&#xC7A5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130288">MS &#xC624;&#xD53C;&#xC2A4; &#xD06C;&#xB799; &#xBC84;&#xC804; &#xC124;&#xCE58; &#xC2DC;, &#xCF54;&#xC778;&#xB9C8;&#xC774;&#xB108;&#xB7;&#xC6D0;&#xACA9;&#xC81C;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC10;&#xC5FC;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130274">&#xBE0C;&#xB9AC;&#xCE58;&#xD3EC;&#xB7FC;&#xC988;, &#xC0AC;&#xBC95;&#xAE30;&#xAD00;&#xC758; &#xACF5;&#xC870;&#xB85C; &#xD3D0;&#xC1C4;&#xB41C; &#xC9C0; 2&#xC8FC;&#xB9CC;&#xC5D0; &#xBD80;&#xD65C;&#xD588;&#xB098;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130403">&#xD55C;-&#xC544;&#xD504;&#xB9AC;&#xCE74; &#xC815;&#xC0C1;&#xD68C;&#xC758; &#xACC4;&#xAE30;, &#xC544;&#xD504;&#xB9AC;&#xCE74; &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548; &#xD611;&#xB825;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130289">&#x65E5; &#xC554;&#xD638;&#xD654;&#xD3D0; &#xAC70;&#xB798;&#xC18C; DMM, 4,200&#xC5B5; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xD138;&#xB824;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130294">&#xBCF4;&#xC774;&#xC2A4;&#xD53C;&#xC2F1; &#xBC94;&#xC8C4;&#xC5D0; &#xCE7C; &#xBE7C;&#xB4E0; &#xC815;&#xBD80;, AI&#xB7;&#xB370;&#xC774;&#xD130; &#xD65C;&#xC6A9; &#xC704;&#xD574; &#xB300;&#xB300;&#xC801; &#xD611;&#xB825;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156598">&#xC778;&#xD130;&#xBDF0; &#xC758;&#xB8B0; &#xC0AC;&#xCE6D;&#xD55C; &#xBD81;&#xD55C; &#xAE40;&#xC218;&#xD0A4; &#xD574;&#xD0B9;&#xC870;&#xC9C1; &#xACF5;&#xACA9; &#xD3EC;&#xCC29;&#xB3FC;&#x2026;</a></p>
<h2 id="6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;"><a href="#6&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;" class="headerlink" title="6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C; &#x1F425;"></a><strong>6&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C;</strong> &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://e.chosunbiz.com/tc-events/2024-%ec%82%ac%ec%9d%b4%eb%b2%84%eb%b3%b4%ec%95%88%ec%bd%98%ed%8d%bc%eb%9f%b0%ec%8a%a4/?preview=true">&#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548;&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;per_page=15&amp;st=subject&amp;q=#"></a>| &#xC870;&#xC120;&#xBE44;&#xC988; | 2024.06.20</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.xn--ai-h41ir8ydiaw0lto5awzac9ida382tyjj.com/">AI &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB7A9;</a> | &#xCF54;&#xB4DC;&#xAC8C;&#xC774;&#xD2B8; | ~ 2024.06.30 &#xC811;&#xC218;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://research.samsung.com/scpc">&#xC81C;10&#xD68C; &#xB300;&#xD559;&#xC0DD; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xC0BC;&#xC131;&#xC804;&#xC790; | ~ 24.07.04</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cryptocontest.kr/challenge/">&#xC554;&#xD638;&#xBD84;&#xC11D;&#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xD55C;&#xAD6D;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xD559;&#xD68C; | ~24.08.31 </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.fsec.or.kr/bbs/1014">&#xAE08;&#xC735;&#xAD8C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xC2E0;&#xACE0;&#xD3EC;&#xC0C1;&#xC81C; (&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;)</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~24.08.31</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.fsec.or.kr/bbs/detail?menuNo=66&amp;bbsNo=11489">&#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC544;&#xCE74;&#xB370;&#xBBF8; 2&#xAE30;</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~ 24.06.17 &#xC811;&#xC218;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/clalxk/">clalxk</a>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_clalxk.jpg" srcset="/img/loading.gif" alt="clalxk">
                  </div>

                  <div class="link-text">
                    <div class="link-title">clalxk</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/clalxk">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/06/12/ogu123/cve-2024-4577/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-4577: PHP-CGIì˜ Windows Best Fit Mappingìœ¼ë¡œ ì¸í•œ Argument Injection ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/06/10/l0ch/2024-06-10/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-5171: libaomì˜ integer overflow ì·¨ì•½ì </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/06/10/clalxk/newsletter0610/';
        this.page.identifier = '/2024/06/10/clalxk/newsletter0610/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] EmailGPT, Prompt Injection?!&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
