

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xC758;&amp;#xD574;&amp;#xD0B9; &amp;#xC9C4;&amp;#xB2E8; &amp;#xC5C5;&amp;#xBB34;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC911; &amp;#xB9DD;&amp;#xC5D0;&amp;#xC11C; NTLM hash &amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xCE21;&amp;#xBA74; &amp;#xC774;&amp;#xC6A9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xCE68;&amp;#xD22C;&amp;#xAC00; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC885;&amp;#xC885; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE68;&amp;#xD22C; &amp;#xC5C5;&amp;#xBB34; &amp;#xC9C4;&amp;#xD589;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC778;&amp;#xC99D; &amp;#xAD00;&amp;#xB828; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC880; &amp;#xC18C;&amp;#xD640;&amp;#xD788; &amp;#xD55C; &amp;#xAC10;&amp;#xC774; &amp;#xC5C6;&amp;#xC796;&amp;#xC544; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; Windows &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC778; NTLM &amp;#xACFC; Kerberos &amp;#xC758; &amp;#xAC1C;&amp;#xB150;, &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xCC28;&amp;#xADFC;&amp;#xCC28;&amp;#xADFC; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB85C; &amp;#xC5F0;&amp;#xC7AC;&amp;#xB97C; &amp;#xD574;&amp;#xB098;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Microsoft &amp;#xB294; &amp;#xC62C;&amp;#xD574; 6&amp;#xC6D4; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xB144; 10&amp;#xC6D4;&amp;#xC5D0; Windows 11 &amp;#xBD80;&amp;#xD130;&amp;#xB294; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB454;&amp;#xD130;&amp;#xB77C; &amp;#xADF8;&amp;#xB9AC; &amp;#xB180;&amp;#xB77C;&amp;#xC6B4; &amp;#xC77C;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. Microsoft &amp;#xAC00; NTLM &amp;#xB300;&amp;#xC2E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xAD8C;&amp;#xACE0;&amp;#xD55C; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Kerberos &amp;#xC778;&amp;#xC99D;&amp;#xC73C;&amp;#xB85C; &amp;#xD2F0;&amp;#xCF13; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB098; Relay &amp;#xACF5;&amp;#xACA9; &amp;#xB4F1;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C; &amp;#xCE68;&amp;#xD574;&amp;#xC0AC;&amp;#xACE0;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC591;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xB098;&amp;#xC544;&amp;#xAC00; NTLM &amp;#xC778;&amp;#xC99D; &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Microsoft &amp;#xB294; &amp;#xC704; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC720;&amp;#xB85C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; NTLM &amp;#xC778;&amp;#xC99D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xC120;&amp;#xC5B8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC628;&amp;#xACE0;&amp;#xC9C0;&amp;#xC2E0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC774; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xC61B;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC9C0;&amp;#xD61C;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2C8;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;?&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC778;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xC774;&amp;#xB780;&#34;&gt;&lt;/a&gt;NTLM &amp;#xC774;&amp;#xB780;&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC778;&amp;#xC99D;, &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBC0F; &amp;#xAE30;&amp;#xBC00;&amp;#xC131;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; MS &amp;#xBCF4;&amp;#xC548; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC61B;&amp;#xB0A0;&amp;#xC61B;&amp;#xC801; Microsoft LAN Manager (LM) &amp;#xB77C;&amp;#xB294; &amp;#xC81C;&amp;#xD488;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xD6C4;&amp;#xC18D; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; 2&amp;#xAC1C;&amp;#xC758; hash &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBCC4;&amp;#xB3C4; salting &amp;#xB4F1;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD6A8;&amp;#xACFC;&amp;#xB97C; &amp;#xC9C0;&amp;#xB2CC;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM hash &amp;#xB294; NT hash &amp;#xC640; LM hash &amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LM hash &amp;#xB294; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xCCAB; 14&amp;#xAE00;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; DES &amp;#xAE30;&amp;#xBC18; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C; hash &amp;#xC774;&amp;#xAD6C;&amp;#xC694;.&lt;ul&gt;
&lt;li&gt;DES &amp;#xD0A4;&amp;#xAC00; KGS!@#$% &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;..&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;NT hash &amp;#xB294; password &amp;#xB97C; utf-16 &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; MD4 &amp;#xD55C; hash &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;DB &amp;#xACA9;&amp;#xC778; NTDS.dit &amp;#xB610;&amp;#xB294; SAM &amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB450; hash &amp;#xBAA8;&amp;#xB450; 128bit (16byte) &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; : &amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; [LM hash]:[NT hash] &amp;#xCC98;&amp;#xB7FC; &amp;#xBC30;&amp;#xCE58;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LM hash &amp;#xB294; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xD754;&amp;#xD788; &amp;#x201C;aad3b435b51404eeaad3b435b51404ee&amp;#x201D; &amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;NTLM &amp;#xC740; challenge-response &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xAC00; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xBC1B;&amp;#xB294; &amp;#xAC1C;&amp;#xCCB4;&amp;#xAC00; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xC758; Challenge &amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; response &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB294; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD558;&amp;#xBA70; NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; Resposne &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xC778;&amp;#xC99D;-&amp;#xACFC;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xC778;&amp;#xC99D;-&amp;#xACFC;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&#34;&gt;&lt;/a&gt;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; NTLM_NEGOTIATE &amp;#xC694;&amp;#xCCAD;&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; NTLM_CHALLENGE &amp;#xC804;&amp;#xB2EC; (challenge &amp;#xAC12; &amp;#xC81C;&amp;#xACF5;)&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; response &amp;#xC5F0;&amp;#xC0B0; &amp;#xD6C4; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; NTLM_AUTHENTICATE &amp;#xC804;&amp;#xB2EC;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image1.png&#34; alt=&#34;ttt&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC758; &amp;#xACFC;&amp;#xC815; (NEGOTIATE, CHALLENGE, AUTHENTICATE) &amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB77C;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA70; &amp;#xAC01;&amp;#xAC01; NEGOTIATE_MESSAGE, CHALLENGE_MESSAGE, AUTHENTICATE_MESSAGE &amp;#xB77C;&amp;#xACE0; &amp;#xCE6D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34;&gt;&lt;/a&gt;NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC758; &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;NEGOTIATE-MESSAGE&#34;&gt;&lt;a href=&#34;#NEGOTIATE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;NEGOTIATE_MESSAGE&#34;&gt;&lt;/a&gt;NEGOTIATE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NEGOTIATE_MESSAGE &amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000001&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Domain Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984; (Optional)&lt;/li&gt;
&lt;li&gt;Workstation Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984; (Optional)&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;CHALLENGE-MESSAGE&#34;&gt;&lt;a href=&#34;#CHALLENGE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;CHALLENGE_MESSAGE&#34;&gt;&lt;/a&gt;CHALLENGE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): CHALLENGE_MESSAGE &amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000002&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Target Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984; &amp;#xB610;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/li&gt;
&lt;li&gt;Server Challenge (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; Challenge &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;Target Info (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;(&amp;#xC608;: &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984; &amp;#xB4F1;) (Optional)&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;AUTHENTICATE-MESSAGE&#34;&gt;&lt;a href=&#34;#AUTHENTICATE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;AUTHENTICATE_MESSAGE&#34;&gt;&lt;/a&gt;AUTHENTICATE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): AUTHENTICATE_MESSAGE&amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000003&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;LM/NT Challenge Response (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; LM &amp;#xB610;&amp;#xB294; NT Response&lt;/li&gt;
&lt;li&gt;Domain Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;User Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Workstation Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC778;&amp;#xC99D; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Session Key (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC138;&amp;#xC158; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4; (Optional)&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;MIC (16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;, &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;NTLM-Response&#34;&gt;&lt;a href=&#34;#NTLM-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLM Response&#34;&gt;&lt;/a&gt;NTLM Response&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xAC70;&amp;#xB4ED;&amp;#xD574;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC900; Challenge &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; Response &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB0B4;&amp;#xCE5C;&amp;#xAE40;&amp;#xC5D0; NTLM &amp;#xBC84;&amp;#xC804;&amp;#xBCC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; Response &amp;#xACC4;&amp;#xC0B0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;NTLMv1-Response&#34;&gt;&lt;a href=&#34;#NTLMv1-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLMv1 Response&#34;&gt;&lt;/a&gt;NTLMv1 Response&lt;/h2&gt;&lt;p&gt;v1&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Response &amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xCC98;&amp;#xB7FC; &amp;#xACC4;&amp;#xC0B0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; Unicode&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; MD4 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash=MD4(Unicode(Password))&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; NT &amp;#xD574;&amp;#xC2DC;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; 0x00*5&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; 21&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xD328;&amp;#xB529;&amp;#xD55C; &amp;#xD6C4; 7&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC529; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash_Padded=NT_Hash || 0x0000000000&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K1=NT_Hash_Padded[0:7]&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K2=NT_Hash_Padded[7:14]&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K3=NT_Hash_Padded[14:21]&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;K1, K2, K3 &amp;#xC744; &amp;#xAC01;&amp;#xAC01; DES &amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;ul&gt;
&lt;li&gt;&amp;#xAC01; &amp;#xD0A4;&amp;#xB294; 7&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778;&amp;#xB370; &amp;#xD328;&amp;#xB9AC;&amp;#xD2F0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9DE;&amp;#xCDA5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC01; DES Key &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; concat &amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; NTLMv1 Response &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Response1 = DES(K1, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Response2 = DES(K2, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Response3 = DES(K3, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NTLMv1 Response = Response1 || Response2 || Response3&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;NTLMv2-Response&#34;&gt;&lt;a href=&#34;#NTLMv2-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLMv2 Response&#34;&gt;&lt;/a&gt;NTLMv2 Response&lt;/h2&gt;&lt;p&gt;NTLMv1 &amp;#xC740; &amp;#xB098;&amp;#xB984; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. v2 &amp;#xBD80;&amp;#xD130; &amp;#xBA38;&amp;#xB9AC;&amp;#xAC00; &amp;#xC880; &amp;#xC544;&amp;#xD30C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. NTLMv2&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; HMAC-MD5 &amp;#xC0AC;&amp;#xC6A9; &amp;#xBC0F; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC18; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; nonce &amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xD06C;&amp;#xB799;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;NT &amp;#xD574;&amp;#xC2DC; NTLMv2 &amp;#xD574;&amp;#xC2DC; &amp;#xC0DD;&amp;#xC131; &lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash=MD4(Unicode(Password))&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NTLMv2_Hash=HMAC-MD5(NT_Hash, Unicode(Uppercase(Username)||Domain))&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;temp &amp;#xBCC0;&amp;#xC218; &amp;#xAD6C;&amp;#xC131;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Responser version:&lt;/strong&gt;  &lt;strong&gt;&lt;code&gt;0x01&lt;/code&gt;&lt;/strong&gt; (1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Hi Responserversion:&lt;/strong&gt;  &lt;strong&gt;&lt;code&gt;0x01&lt;/code&gt;&lt;/strong&gt; (1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(6):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*6 6&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Time:&lt;/strong&gt; Timestamp: 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ClientChallenge:&lt;/strong&gt; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB79C;&amp;#xB364; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(4):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*4&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ServerName:&lt;/strong&gt; &amp;#xC11C;&amp;#xBC84; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(4):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*4&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;NtChallengeResponse &amp;#xC640; LmChallengeResponse &amp;#xACC4;&amp;#xC0B0;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NtChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp) + temp&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp)&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; NtProofStr &amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xCE6D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;LmChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + ClientChallenge) + ClientChallenge&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;LmChallengeResponse &amp;#xC640; NtChallengeResponse &amp;#xB97C; &amp;#xBD99;&amp;#xC778; &amp;#xAC12;&amp;#xC774; NTLMv2 &amp;#xC758; Response &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NTLMv2 Response = LmChallengeResponse || LmChallengeResponse&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; RPC &amp;#xD328;&amp;#xD0B7;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEA1;&amp;#xCC98;&amp;#xB41C; NTLMv2 Response &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8EC; &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. wireshark &amp;#xC5D0;&amp;#xC11C; &amp;#xC798; &amp;#xD30C;&amp;#xC2F1;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBCC4; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image2.png&#34; alt&gt;&lt;br&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;NTLM&amp;#xACFC;-&amp;#xD0C0;-&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#NTLM&amp;#xACFC;-&amp;#xD0C0;-&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;NTLM&amp;#xACFC; &amp;#xD0C0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;/a&gt;NTLM&amp;#xACFC; &amp;#xD0C0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&lt;/h1&gt;&lt;p&gt;NTLM&amp;#xC740; SMB, HTTP &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xACC4;&amp;#xCE35; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xC8E0;? &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; Windows &amp;#xB0B4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;GSSAPI (Generic Security Service API) &amp;#xB77C;&amp;#xB294; &amp;#xC778;&amp;#xC99D;, &amp;#xBCF4;&amp;#xC548; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; GSSAPI&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; SSPI (Security Support Provider Interface) &amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; SSPI &amp;#xC5D0; NTLM Security Support Provider &amp;#xAC00; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC88;&amp;#xC678;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; Security Support Provider &amp;#xB3C4; &amp;#xBCA1;&amp;#xD130; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#x1F642;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;NTLM-over-SMB&#34;&gt;&lt;a href=&#34;#NTLM-over-SMB&#34; class=&#34;headerlink&#34; title=&#34;NTLM over SMB&#34;&gt;&lt;/a&gt;NTLM over SMB&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC81C;&amp;#xC77C; &amp;#xD754;&amp;#xD55C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; SMB&amp;#xAC00; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC2F6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. SMB&amp;#xB294; &amp;#xC798; &amp;#xC544;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC778;&amp;#xC99D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBD99;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SMB NEGOTIATE &amp;#xAC00; &amp;#xBA3C;&amp;#xC800; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; SMB_COM_SESSION_SETUP_ANDX &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; NTLM NEGOTIATE, CHALLENGE, AUTHENTICATE &amp;#xAC00; &amp;#xC774;&amp;#xB904;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788;, Windows &amp;#xB294; UNC PATH (&lt;code&gt;\\[IP]\path\to\file&lt;/code&gt;) &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB098; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; SMB &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAE30;&amp;#xBCF8; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; NTLM &amp;#xC774;&amp;#xACE0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB108;&amp;#xBA38;&amp;#xB85C; UNC PATH&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;&amp;#xBA74; NTLMv2 Response &amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C8;&amp;#xCDE8;&amp;#xB41C; NTLMv2 Response &amp;#xB294; &amp;#xC8FC;&amp;#xB85C; Relay &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-over-HTTP&#34;&gt;&lt;a href=&#34;#NTLM-over-HTTP&#34; class=&#34;headerlink&#34; title=&#34;NTLM over HTTP&#34;&gt;&lt;/a&gt;NTLM over HTTP&lt;/h1&gt;&lt;p&gt;HTTP &amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560;&amp;#xB54C;&amp;#xB294; Request &amp;#xC640; Response &amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; HTTP &amp;#xC5D0;&amp;#xC11C; NTLM Negotiate &amp;#xB97C; &amp;#xD558;&amp;#xB294; Request &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; Authorization &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs http&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;GET&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;/&lt;/span&gt; HTTP/1.1
&lt;span class=&#34;hljs-attribute&#34;&gt;Host&lt;/span&gt;: 192.168.0.41:8080
&lt;span class=&#34;hljs-attribute&#34;&gt;Authorization&lt;/span&gt;: NTLM TlRMTVNTUAABAAAAMYCI4AAAAAAoAAAAAAAAACgAAAAAAAAAAAAAAA==&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Response &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WWW-Authenticate &amp;#xB77C;&amp;#xB294; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; NTLM Challenge &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; &amp;#xBC18;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs apache&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;HTTP&lt;/span&gt;/&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;.&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;401&lt;/span&gt; Unauthorized
&lt;span class=&#34;hljs-attribute&#34;&gt;Date&lt;/span&gt;: Sat, &lt;span class=&#34;hljs-number&#34;&gt;04&lt;/span&gt; Jun &lt;span class=&#34;hljs-number&#34;&gt;2022&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;19&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; GMT
&lt;span class=&#34;hljs-attribute&#34;&gt;Server&lt;/span&gt;: Apache
&lt;span class=&#34;hljs-attribute&#34;&gt;WWW&lt;/span&gt;-Authenticate: NTLM TlRMTVNTUAACAAAADAAMADgAAAA&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;gonilM&lt;span class=&#34;hljs-number&#34;&gt;550&lt;/span&gt;+&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;I+dYAAAAAAAAAAJIAkgBEAAAACgA&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;OAAAAA&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;EAE&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;ATQBBAEkATgACAAwARABPAE&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;AQQBJAE&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;AAQAMAEEAUABQAFMAMQA&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;AAQAGABkAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AbQBhAGkAbgAuAGwAbwBjAGEAbAADACYAQQBQAFAAUwAxADUALgBkAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AbQBhAGkAbgAuAGwAbwBjAGEAbAAFABgAZABvAG&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;AYQBpAG&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;ALgBsAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AYwBhAGwABwAIAKFXn&lt;span class=&#34;hljs-number&#34;&gt;425&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;gBAAAAAA==
&lt;span class=&#34;hljs-attribute&#34;&gt;Content&lt;/span&gt;-Length: &lt;span class=&#34;hljs-number&#34;&gt;381&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;Content&lt;/span&gt;-Type: text/html; charset=iso-&lt;span class=&#34;hljs-number&#34;&gt;8859&lt;/span&gt;-&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;

&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;!DOCTYPE HTML PUBLIC &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-//IETF//DTD HTML 2.0//EN&amp;quot;&lt;/span&gt;&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;html&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;head&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;title&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;401&lt;/span&gt; Unauthorized&amp;lt;/title&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/head&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;body&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;h1&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;Unauthorized&lt;/span&gt;&amp;lt;/h&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;p&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;This&lt;/span&gt; server could not verify that you
&lt;span class=&#34;hljs-attribute&#34;&gt;are&lt;/span&gt; authorized to access the document
&lt;span class=&#34;hljs-attribute&#34;&gt;requested&lt;/span&gt;.  Either you supplied the wrong
&lt;span class=&#34;hljs-attribute&#34;&gt;credentials&lt;/span&gt; (e.g., bad password), or your
&lt;span class=&#34;hljs-attribute&#34;&gt;browser&lt;/span&gt; doesn&amp;apos;t understand how to supply
&lt;span class=&#34;hljs-attribute&#34;&gt;the&lt;/span&gt; credentials required.&amp;lt;/p&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/body&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/html&amp;gt;&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; HTTP &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC678;&amp;#xBD80;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC815;&amp;#xBCF4; &amp;#xD68D;&amp;#xB4DD; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB294; NTLM CHALLENGE &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;, &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC774;&amp;#xB984;, &amp;#xBC84;&amp;#xC804; &amp;#xB4F1;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294;&amp;#xAC70; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCD08;&amp;#xAE30; &amp;#xC9C4;&amp;#xC785; &amp;#xC2DC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-over-RPC&#34;&gt;&lt;a href=&#34;#NTLM-over-RPC&#34; class=&#34;headerlink&#34; title=&#34;NTLM over RPC&#34;&gt;&lt;/a&gt;NTLM over RPC&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; SSPI&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5B8;&amp;#xAE09;&amp;#xD560; &amp;#xB54C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;. RPC &amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RPC UUID &amp;#xB9E4;&amp;#xD551; &amp;#xC774;&amp;#xD6C4; Bind request, Bind response &amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC5EC; NEGOTIATE, CHALLENGE, AUTHENTICATE &amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RPC &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC778;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xAD8C;&amp;#xD55C;&amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC784;&amp;#xC758;&amp;#xB85C; RPC&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; RPC &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; UNC Path &amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; NTLM AUTH &amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C;&amp;#xB054; &amp;#xD558;&amp;#xB294; &amp;#xAC15;&amp;#xC81C; &amp;#xC778;&amp;#xC99D; &amp;#xACF5;&amp;#xACA9;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-Relay&#34;&gt;&lt;a href=&#34;#NTLM-Relay&#34; class=&#34;headerlink&#34; title=&#34;NTLM Relay&#34;&gt;&lt;/a&gt;NTLM Relay&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC774; &amp;#xAE00; &amp;#xD55C; &amp;#xD3B8;&amp;#xC5D0; &amp;#xB2E4; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC744; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. HotPotato, Printerbug, Petitpotam, DFSCoerce, ShadowCoerce, CVE-2024-8260, CVE-2024-38200 &amp;#xB4F1;&amp;#xB4F1; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xD1B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xB85C; NTLM Relay &amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC911;&amp;#xAC04;&amp;#xC790; &amp;#xACF5;&amp;#xACA9;&amp;#xC774;&amp;#xB791; &amp;#xAC70;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; PTH (pass-the-hash) &amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xB9C8;&amp;#xCE58; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB4EF;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC; NTLMv2 hash (a.k.a Net-NTLM hash) &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; PTH&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; Relay &amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB610;&amp;#xB294; &amp;#xD06C;&amp;#xB799;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;NTLM Relay &amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; Responder, impacket &amp;#xC758; ntlmrelayx &amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Responder &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; fake &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xAD6C;&amp;#xC694;. responder &amp;#xB85C; &amp;#xBC1B;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; relay &amp;#xD560; &amp;#xB54C;&amp;#xB294; ntlmrelayx &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;Windows &amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4;&amp;#xC654;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xACFC; Windows &amp;#xC758; UNC Path &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xC5EE;&amp;#xC5EC;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC600;&amp;#xB358; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB918;&amp;#xB358; &amp;#xAC1C;&amp;#xB150; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; NTLM &amp;#xAD00;&amp;#xB828; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xC885; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h1 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm&#34;&gt;https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://davenport.sourceforge.net/ntlm.html&#34;&gt;https://davenport.sourceforge.net/ntlm.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html&#34;&gt;https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication&#34;&gt;https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/&#34;&gt;https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://foxglovesecurity.com/2016/01/16/hot-potato/&#34;&gt;https://foxglovesecurity.com/2016/01/16/hot-potato/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx&#34;&gt;https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/&#34;&gt;https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/NTLM&#34;&gt;https://en.wikipedia.org/wiki/NTLM&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html&#34;&gt;https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.xn--hy1b43d247a.com/general-concepts/windows-authentication/ntlm&#34;&gt;https://www.&amp;#xB808;&amp;#xB4DC;&amp;#xD300;.com/general-concepts/windows-authentication/ntlm&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html&#34;&gt;https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface&#34;&gt;https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&#34;&gt;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.xn--hy1b43d247a.com/credential-access/authentication-coercion&#34;&gt;https://www.&amp;#xB808;&amp;#xB4DC;&amp;#xD300;.com/credential-access/authentication-coercion&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/p0dalirius/windows-coerced-authentication-methods&#34;&gt;https://github.com/p0dalirius/windows-coerced-authentication-methods&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py&#34;&gt;https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/lgandx/Responder&#34;&gt;https://github.com/lgandx/Responder&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&#34;&gt;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Windows Authentication Series (Part1. NTLM) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xC758;&amp;#xD574;&amp;#xD0B9; &amp;#xC9C4;&amp;#xB2E8; &amp;#xC5C5;&amp;#xBB34;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC911; &amp;#xB9DD;&amp;#xC5D0;&amp;#xC11C; NTLM hash &amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xCE21;&amp;#xBA74; &amp;#xC774;&amp;#xC6A9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xCE68;&amp;#xD22C;&amp;#xAC00; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC885;&amp;#xC885; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCE68;&amp;#xD22C; &amp;#xC5C5;&amp;#xBB34; &amp;#xC9C4;&amp;#xD589;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC778;&amp;#xC99D; &amp;#xAD00;&amp;#xB828; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC880; &amp;#xC18C;&amp;#xD640;&amp;#xD788; &amp;#xD55C; &amp;#xAC10;&amp;#xC774; &amp;#xC5C6;&amp;#xC796;&amp;#xC544; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; Windows &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC778; NTLM &amp;#xACFC; Kerberos &amp;#xC758; &amp;#xAC1C;&amp;#xB150;, &amp;#xD788;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xCC28;&amp;#xADFC;&amp;#xCC28;&amp;#xADFC; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB85C; &amp;#xC5F0;&amp;#xC7AC;&amp;#xB97C; &amp;#xD574;&amp;#xB098;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Microsoft &amp;#xB294; &amp;#xC62C;&amp;#xD574; 6&amp;#xC6D4; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xB144; 10&amp;#xC6D4;&amp;#xC5D0; Windows 11 &amp;#xBD80;&amp;#xD130;&amp;#xB294; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB454;&amp;#xD130;&amp;#xB77C; &amp;#xADF8;&amp;#xB9AC; &amp;#xB180;&amp;#xB77C;&amp;#xC6B4; &amp;#xC77C;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. Microsoft &amp;#xAC00; NTLM &amp;#xB300;&amp;#xC2E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xAD8C;&amp;#xACE0;&amp;#xD55C; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; Kerberos &amp;#xC778;&amp;#xC99D;&amp;#xC73C;&amp;#xB85C; &amp;#xD2F0;&amp;#xCF13; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB098; Relay &amp;#xACF5;&amp;#xACA9; &amp;#xB4F1;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xACE0; &amp;#xC2E4;&amp;#xC81C; &amp;#xCE68;&amp;#xD574;&amp;#xC0AC;&amp;#xACE0;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC591;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xB098;&amp;#xC544;&amp;#xAC00; NTLM &amp;#xC778;&amp;#xC99D; &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Microsoft &amp;#xB294; &amp;#xC704; &amp;#xC774;&amp;#xC720;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC720;&amp;#xB85C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; NTLM &amp;#xC778;&amp;#xC99D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xC120;&amp;#xC5B8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC628;&amp;#xACE0;&amp;#xC9C0;&amp;#xC2E0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xC774; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xC61B;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC9C0;&amp;#xD61C;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83; &amp;#xC544;&amp;#xB2C8;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;?&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xD6D1;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC778;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xC774;&amp;#xB780;&#34;&gt;&lt;/a&gt;NTLM &amp;#xC774;&amp;#xB780;&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC778;&amp;#xC99D;, &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBC0F; &amp;#xAE30;&amp;#xBC00;&amp;#xC131;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; MS &amp;#xBCF4;&amp;#xC548; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC61B;&amp;#xB0A0;&amp;#xC61B;&amp;#xC801; Microsoft LAN Manager (LM) &amp;#xB77C;&amp;#xB294; &amp;#xC81C;&amp;#xD488;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xD6C4;&amp;#xC18D; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; 2&amp;#xAC1C;&amp;#xC758; hash &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBCC4;&amp;#xB3C4; salting &amp;#xB4F1;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD6A8;&amp;#xACFC;&amp;#xB97C; &amp;#xC9C0;&amp;#xB2CC;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM hash &amp;#xB294; NT hash &amp;#xC640; LM hash &amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LM hash &amp;#xB294; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xCCAB; 14&amp;#xAE00;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; DES &amp;#xAE30;&amp;#xBC18; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C; hash &amp;#xC774;&amp;#xAD6C;&amp;#xC694;.&lt;ul&gt;
&lt;li&gt;DES &amp;#xD0A4;&amp;#xAC00; KGS!@#$% &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;..&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;NT hash &amp;#xB294; password &amp;#xB97C; utf-16 &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; MD4 &amp;#xD55C; hash &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;DB &amp;#xACA9;&amp;#xC778; NTDS.dit &amp;#xB610;&amp;#xB294; SAM &amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB450; hash &amp;#xBAA8;&amp;#xB450; 128bit (16byte) &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; : &amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; [LM hash]:[NT hash] &amp;#xCC98;&amp;#xB7FC; &amp;#xBC30;&amp;#xCE58;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LM hash &amp;#xB294; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xD754;&amp;#xD788; &amp;#x201C;aad3b435b51404eeaad3b435b51404ee&amp;#x201D; &amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;NTLM &amp;#xC740; challenge-response &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xAC00; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xBC1B;&amp;#xB294; &amp;#xAC1C;&amp;#xCCB4;&amp;#xAC00; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xC758; Challenge &amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; response &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB294; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD558;&amp;#xBA70; NTLM &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; Resposne &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xC778;&amp;#xC99D;-&amp;#xACFC;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xC778;&amp;#xC99D;-&amp;#xACFC;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&#34;&gt;&lt;/a&gt;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; NTLM_NEGOTIATE &amp;#xC694;&amp;#xCCAD;&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; NTLM_CHALLENGE &amp;#xC804;&amp;#xB2EC; (challenge &amp;#xAC12; &amp;#xC81C;&amp;#xACF5;)&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; response &amp;#xC5F0;&amp;#xC0B0; &amp;#xD6C4; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; NTLM_AUTHENTICATE &amp;#xC804;&amp;#xB2EC;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image1.png&#34; alt=&#34;ttt&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC758; &amp;#xACFC;&amp;#xC815; (NEGOTIATE, CHALLENGE, AUTHENTICATE) &amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB77C;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xC73C;&amp;#xBA70; &amp;#xAC01;&amp;#xAC01; NEGOTIATE_MESSAGE, CHALLENGE_MESSAGE, AUTHENTICATE_MESSAGE &amp;#xB77C;&amp;#xACE0; &amp;#xCE6D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34;&gt;&lt;a href=&#34;#NTLM-&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34; class=&#34;headerlink&#34; title=&#34;NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&#34;&gt;&lt;/a&gt;NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&lt;/h1&gt;&lt;p&gt;&amp;#xAC01; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB4E4;&amp;#xC758; &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;NEGOTIATE-MESSAGE&#34;&gt;&lt;a href=&#34;#NEGOTIATE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;NEGOTIATE_MESSAGE&#34;&gt;&lt;/a&gt;NEGOTIATE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NEGOTIATE_MESSAGE &amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000001&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Domain Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984; (Optional)&lt;/li&gt;
&lt;li&gt;Workstation Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984; (Optional)&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;CHALLENGE-MESSAGE&#34;&gt;&lt;a href=&#34;#CHALLENGE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;CHALLENGE_MESSAGE&#34;&gt;&lt;/a&gt;CHALLENGE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): CHALLENGE_MESSAGE &amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000002&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Target Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984; &amp;#xB610;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/li&gt;
&lt;li&gt;Server Challenge (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; Challenge &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;Target Info (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;(&amp;#xC608;: &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984; &amp;#xB4F1;) (Optional)&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;AUTHENTICATE-MESSAGE&#34;&gt;&lt;a href=&#34;#AUTHENTICATE-MESSAGE&#34; class=&#34;headerlink&#34; title=&#34;AUTHENTICATE_MESSAGE&#34;&gt;&lt;/a&gt;AUTHENTICATE_MESSAGE&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Signature (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &lt;code&gt;&amp;apos;N&amp;apos;, &amp;apos;T&amp;apos;, &amp;apos;L&amp;apos;, &amp;apos;M&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;S&amp;apos;, &amp;apos;P&amp;apos;, &amp;apos;\0&amp;apos;&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;Message Type (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): AUTHENTICATE_MESSAGE&amp;#xC784;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C4; &lt;code&gt;0x00000003&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;LM/NT Challenge Response (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; LM &amp;#xB610;&amp;#xB294; NT Response&lt;/li&gt;
&lt;li&gt;Domain Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;User Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Workstation Name (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC778;&amp;#xC99D; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;Session Key (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xC138;&amp;#xC158; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4; (Optional)&lt;/li&gt;
&lt;li&gt;Negotiate Flags (4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/li&gt;
&lt;li&gt;Version (8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): NTLM &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;MIC (16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;): &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; (Optional)&lt;/li&gt;
&lt;li&gt;Payload (&amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;): &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC774;&amp;#xB984;, &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;NTLM-Response&#34;&gt;&lt;a href=&#34;#NTLM-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLM Response&#34;&gt;&lt;/a&gt;NTLM Response&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xAC70;&amp;#xB4ED;&amp;#xD574;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xB0B4;&amp;#xB824;&amp;#xC900; Challenge &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; Response &amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB0B4;&amp;#xCE5C;&amp;#xAE40;&amp;#xC5D0; NTLM &amp;#xBC84;&amp;#xC804;&amp;#xBCC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; Response &amp;#xACC4;&amp;#xC0B0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;NTLMv1-Response&#34;&gt;&lt;a href=&#34;#NTLMv1-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLMv1 Response&#34;&gt;&lt;/a&gt;NTLMv1 Response&lt;/h2&gt;&lt;p&gt;v1&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Response &amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xCC98;&amp;#xB7FC; &amp;#xACC4;&amp;#xC0B0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; Unicode&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; MD4 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash=MD4(Unicode(Password))&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; NT &amp;#xD574;&amp;#xC2DC;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; 0x00*5&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; 21&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xD328;&amp;#xB529;&amp;#xD55C; &amp;#xD6C4; 7&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC529; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xD0A4;&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash_Padded=NT_Hash || 0x0000000000&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K1=NT_Hash_Padded[0:7]&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K2=NT_Hash_Padded[7:14]&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;K3=NT_Hash_Padded[14:21]&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;K1, K2, K3 &amp;#xC744; &amp;#xAC01;&amp;#xAC01; DES &amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;ul&gt;
&lt;li&gt;&amp;#xAC01; &amp;#xD0A4;&amp;#xB294; 7&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC778;&amp;#xB370; &amp;#xD328;&amp;#xB9AC;&amp;#xD2F0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9DE;&amp;#xCDA5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC01; DES Key &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; concat &amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; NTLMv1 Response &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Response1 = DES(K1, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Response2 = DES(K2, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Response3 = DES(K3, ServerChallenge)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NTLMv1 Response = Response1 || Response2 || Response3&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;NTLMv2-Response&#34;&gt;&lt;a href=&#34;#NTLMv2-Response&#34; class=&#34;headerlink&#34; title=&#34;NTLMv2 Response&#34;&gt;&lt;/a&gt;NTLMv2 Response&lt;/h2&gt;&lt;p&gt;NTLMv1 &amp;#xC740; &amp;#xB098;&amp;#xB984; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. v2 &amp;#xBD80;&amp;#xD130; &amp;#xBA38;&amp;#xB9AC;&amp;#xAC00; &amp;#xC880; &amp;#xC544;&amp;#xD30C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. NTLMv2&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; HMAC-MD5 &amp;#xC0AC;&amp;#xC6A9; &amp;#xBC0F; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCC4C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC18; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; nonce &amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xD06C;&amp;#xB799;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;NT &amp;#xD574;&amp;#xC2DC; NTLMv2 &amp;#xD574;&amp;#xC2DC; &amp;#xC0DD;&amp;#xC131; &lt;ul&gt;
&lt;li&gt;&lt;code&gt;NT_Hash=MD4(Unicode(Password))&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NTLMv2_Hash=HMAC-MD5(NT_Hash, Unicode(Uppercase(Username)||Domain))&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;temp &amp;#xBCC0;&amp;#xC218; &amp;#xAD6C;&amp;#xC131;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Responser version:&lt;/strong&gt;  &lt;strong&gt;&lt;code&gt;0x01&lt;/code&gt;&lt;/strong&gt; (1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Hi Responserversion:&lt;/strong&gt;  &lt;strong&gt;&lt;code&gt;0x01&lt;/code&gt;&lt;/strong&gt; (1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;).&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(6):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*6 6&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Time:&lt;/strong&gt; Timestamp: 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ClientChallenge:&lt;/strong&gt; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB79C;&amp;#xB364; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(4):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*4&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ServerName:&lt;/strong&gt; &amp;#xC11C;&amp;#xBC84; &amp;#xC774;&amp;#xB984;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Z(4):&lt;/strong&gt; &amp;#x2019;\x00&amp;#x2019;*4&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;NtChallengeResponse &amp;#xC640; LmChallengeResponse &amp;#xACC4;&amp;#xC0B0;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NtChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp) + temp&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp)&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; NtProofStr &amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xCE6D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;LmChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + ClientChallenge) + ClientChallenge&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;LmChallengeResponse &amp;#xC640; NtChallengeResponse &amp;#xB97C; &amp;#xBD99;&amp;#xC778; &amp;#xAC12;&amp;#xC774; NTLMv2 &amp;#xC758; Response &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NTLMv2 Response = LmChallengeResponse || LmChallengeResponse&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; RPC &amp;#xD328;&amp;#xD0B7;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEA1;&amp;#xCC98;&amp;#xB41C; NTLMv2 Response &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8EC; &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. wireshark &amp;#xC5D0;&amp;#xC11C; &amp;#xC798; &amp;#xD30C;&amp;#xC2F1;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBCC4; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image2.png&#34; alt&gt;&lt;br&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;NTLM&amp;#xACFC;-&amp;#xD0C0;-&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#NTLM&amp;#xACFC;-&amp;#xD0C0;-&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;NTLM&amp;#xACFC; &amp;#xD0C0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;/a&gt;NTLM&amp;#xACFC; &amp;#xD0C0; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xACFC;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&lt;/h1&gt;&lt;p&gt;NTLM&amp;#xC740; SMB, HTTP &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC5B4;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xACC4;&amp;#xCE35; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xC8E0;? &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; Windows &amp;#xB0B4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;GSSAPI (Generic Security Service API) &amp;#xB77C;&amp;#xB294; &amp;#xC778;&amp;#xC99D;, &amp;#xBCF4;&amp;#xC548; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; GSSAPI&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; SSPI (Security Support Provider Interface) &amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; SSPI &amp;#xC5D0; NTLM Security Support Provider &amp;#xAC00; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC88;&amp;#xC678;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; Security Support Provider &amp;#xB3C4; &amp;#xBCA1;&amp;#xD130; &amp;#xC911;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#x1F642;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;NTLM-over-SMB&#34;&gt;&lt;a href=&#34;#NTLM-over-SMB&#34; class=&#34;headerlink&#34; title=&#34;NTLM over SMB&#34;&gt;&lt;/a&gt;NTLM over SMB&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC81C;&amp;#xC77C; &amp;#xD754;&amp;#xD55C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; SMB&amp;#xAC00; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC2F6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. SMB&amp;#xB294; &amp;#xC798; &amp;#xC544;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC778;&amp;#xC99D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBD99;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SMB NEGOTIATE &amp;#xAC00; &amp;#xBA3C;&amp;#xC800; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; SMB_COM_SESSION_SETUP_ANDX &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; NTLM NEGOTIATE, CHALLENGE, AUTHENTICATE &amp;#xAC00; &amp;#xC774;&amp;#xB904;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788;, Windows &amp;#xB294; UNC PATH (&lt;code&gt;\\[IP]\path\to\file&lt;/code&gt;) &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB098; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; SMB &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAE30;&amp;#xBCF8; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; NTLM &amp;#xC774;&amp;#xACE0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB108;&amp;#xBA38;&amp;#xB85C; UNC PATH&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;&amp;#xBA74; NTLMv2 Response &amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C8;&amp;#xCDE8;&amp;#xB41C; NTLMv2 Response &amp;#xB294; &amp;#xC8FC;&amp;#xB85C; Relay &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-over-HTTP&#34;&gt;&lt;a href=&#34;#NTLM-over-HTTP&#34; class=&#34;headerlink&#34; title=&#34;NTLM over HTTP&#34;&gt;&lt;/a&gt;NTLM over HTTP&lt;/h1&gt;&lt;p&gt;HTTP &amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560;&amp;#xB54C;&amp;#xB294; Request &amp;#xC640; Response &amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; HTTP &amp;#xC5D0;&amp;#xC11C; NTLM Negotiate &amp;#xB97C; &amp;#xD558;&amp;#xB294; Request &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; Authorization &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xBD99;&amp;#xC5EC;&amp;#xC838;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs http&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;GET&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;/&lt;/span&gt; HTTP/1.1
&lt;span class=&#34;hljs-attribute&#34;&gt;Host&lt;/span&gt;: 192.168.0.41:8080
&lt;span class=&#34;hljs-attribute&#34;&gt;Authorization&lt;/span&gt;: NTLM TlRMTVNTUAABAAAAMYCI4AAAAAAoAAAAAAAAACgAAAAAAAAAAAAAAA==&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Response &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WWW-Authenticate &amp;#xB77C;&amp;#xB294; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; NTLM Challenge &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; &amp;#xBC18;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs apache&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;HTTP&lt;/span&gt;/&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;.&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;401&lt;/span&gt; Unauthorized
&lt;span class=&#34;hljs-attribute&#34;&gt;Date&lt;/span&gt;: Sat, &lt;span class=&#34;hljs-number&#34;&gt;04&lt;/span&gt; Jun &lt;span class=&#34;hljs-number&#34;&gt;2022&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;19&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; GMT
&lt;span class=&#34;hljs-attribute&#34;&gt;Server&lt;/span&gt;: Apache
&lt;span class=&#34;hljs-attribute&#34;&gt;WWW&lt;/span&gt;-Authenticate: NTLM TlRMTVNTUAACAAAADAAMADgAAAA&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;gonilM&lt;span class=&#34;hljs-number&#34;&gt;550&lt;/span&gt;+&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;I+dYAAAAAAAAAAJIAkgBEAAAACgA&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;OAAAAA&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;EAE&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;ATQBBAEkATgACAAwARABPAE&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;AQQBJAE&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;AAQAMAEEAUABQAFMAMQA&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;AAQAGABkAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AbQBhAGkAbgAuAGwAbwBjAGEAbAADACYAQQBQAFAAUwAxADUALgBkAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AbQBhAGkAbgAuAGwAbwBjAGEAbAAFABgAZABvAG&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;AYQBpAG&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;ALgBsAG&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;AYwBhAGwABwAIAKFXn&lt;span class=&#34;hljs-number&#34;&gt;425&lt;/span&gt;d&lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;gBAAAAAA==
&lt;span class=&#34;hljs-attribute&#34;&gt;Content&lt;/span&gt;-Length: &lt;span class=&#34;hljs-number&#34;&gt;381&lt;/span&gt;
&lt;span class=&#34;hljs-attribute&#34;&gt;Content&lt;/span&gt;-Type: text/html; charset=iso-&lt;span class=&#34;hljs-number&#34;&gt;8859&lt;/span&gt;-&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;

&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;!DOCTYPE HTML PUBLIC &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-//IETF//DTD HTML 2.0//EN&amp;quot;&lt;/span&gt;&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;html&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;head&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;title&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;401&lt;/span&gt; Unauthorized&amp;lt;/title&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/head&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;body&amp;gt;&lt;/span&gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;h1&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;Unauthorized&lt;/span&gt;&amp;lt;/h&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;p&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;This&lt;/span&gt; server could not verify that you
&lt;span class=&#34;hljs-attribute&#34;&gt;are&lt;/span&gt; authorized to access the document
&lt;span class=&#34;hljs-attribute&#34;&gt;requested&lt;/span&gt;.  Either you supplied the wrong
&lt;span class=&#34;hljs-attribute&#34;&gt;credentials&lt;/span&gt; (e.g., bad password), or your
&lt;span class=&#34;hljs-attribute&#34;&gt;browser&lt;/span&gt; doesn&amp;apos;t understand how to supply
&lt;span class=&#34;hljs-attribute&#34;&gt;the&lt;/span&gt; credentials required.&amp;lt;/p&amp;gt;
&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/body&amp;gt;&lt;/span&gt;&lt;span class=&#34;hljs-section&#34;&gt;&amp;lt;/html&amp;gt;&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xC758; HTTP &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC678;&amp;#xBD80;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC815;&amp;#xBCF4; &amp;#xD68D;&amp;#xB4DD; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB294; NTLM CHALLENGE &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;, &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC774;&amp;#xB984;, &amp;#xBC84;&amp;#xC804; &amp;#xB4F1;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294;&amp;#xAC70; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCD08;&amp;#xAE30; &amp;#xC9C4;&amp;#xC785; &amp;#xC2DC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-over-RPC&#34;&gt;&lt;a href=&#34;#NTLM-over-RPC&#34; class=&#34;headerlink&#34; title=&#34;NTLM over RPC&#34;&gt;&lt;/a&gt;NTLM over RPC&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; SSPI&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5B8;&amp;#xAE09;&amp;#xD560; &amp;#xB54C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;. RPC &amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RPC UUID &amp;#xB9E4;&amp;#xD551; &amp;#xC774;&amp;#xD6C4; Bind request, Bind response &amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC5EC; NEGOTIATE, CHALLENGE, AUTHENTICATE &amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RPC &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC778;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xAD8C;&amp;#xD55C;&amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC784;&amp;#xC758;&amp;#xB85C; RPC&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; RPC &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; UNC Path &amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; NTLM AUTH &amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C;&amp;#xB054; &amp;#xD558;&amp;#xB294; &amp;#xAC15;&amp;#xC81C; &amp;#xC778;&amp;#xC99D; &amp;#xACF5;&amp;#xACA9;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;NTLM-Relay&#34;&gt;&lt;a href=&#34;#NTLM-Relay&#34; class=&#34;headerlink&#34; title=&#34;NTLM Relay&#34;&gt;&lt;/a&gt;NTLM Relay&lt;/h1&gt;&lt;p&gt;NTLM &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC774; &amp;#xAE00; &amp;#xD55C; &amp;#xD3B8;&amp;#xC5D0; &amp;#xB2E4; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC744; &amp;#xC815;&amp;#xB3C4;&amp;#xB85C; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. HotPotato, Printerbug, Petitpotam, DFSCoerce, ShadowCoerce, CVE-2024-8260, CVE-2024-38200 &amp;#xB4F1;&amp;#xB4F1; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xD1B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC14;&amp;#xB85C; NTLM Relay &amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC911;&amp;#xAC04;&amp;#xC790; &amp;#xACF5;&amp;#xACA9;&amp;#xC774;&amp;#xB791; &amp;#xAC70;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;NTLM &amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; PTH (pass-the-hash) &amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xB9C8;&amp;#xCE58; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB4EF;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC; NTLMv2 hash (a.k.a Net-NTLM hash) &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; PTH&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; Relay &amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB610;&amp;#xB294; &amp;#xD06C;&amp;#xB799;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/01/mungsul/NTLM_Part1/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;NTLM Relay &amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; Responder, impacket &amp;#xC758; ntlmrelayx &amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Responder &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; fake &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xAD6C;&amp;#xC694;. responder &amp;#xB85C; &amp;#xBC1B;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; relay &amp;#xD560; &amp;#xB54C;&amp;#xB294; ntlmrelayx &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;Windows &amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294; NTLM &amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB7AB;&amp;#xB3D9;&amp;#xC548; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4;&amp;#xC654;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xACFC; Windows &amp;#xC758; UNC Path &amp;#xAE30;&amp;#xB2A5;&amp;#xACFC; &amp;#xC5EE;&amp;#xC5EC;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC600;&amp;#xB358; &amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB918;&amp;#xB358; &amp;#xAC1C;&amp;#xB150; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; NTLM &amp;#xAD00;&amp;#xB828; 1-day &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xC885; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h1 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm&#34;&gt;https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://davenport.sourceforge.net/ntlm.html&#34;&gt;https://davenport.sourceforge.net/ntlm.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html&#34;&gt;https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication&#34;&gt;https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/&#34;&gt;https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://foxglovesecurity.com/2016/01/16/hot-potato/&#34;&gt;https://foxglovesecurity.com/2016/01/16/hot-potato/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx&#34;&gt;https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/&#34;&gt;https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/NTLM&#34;&gt;https://en.wikipedia.org/wiki/NTLM&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html&#34;&gt;https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.xn--hy1b43d247a.com/general-concepts/windows-authentication/ntlm&#34;&gt;https://www.&amp;#xB808;&amp;#xB4DC;&amp;#xD300;.com/general-concepts/windows-authentication/ntlm&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html&#34;&gt;https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface&#34;&gt;https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&#34;&gt;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.xn--hy1b43d247a.com/credential-access/authentication-coercion&#34;&gt;https://www.&amp;#xB808;&amp;#xB4DC;&amp;#xD300;.com/credential-access/authentication-coercion&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/p0dalirius/windows-coerced-authentication-methods&#34;&gt;https://github.com/p0dalirius/windows-coerced-authentication-methods&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py&#34;&gt;https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/lgandx/Responder&#34;&gt;https://github.com/lgandx/Responder&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&#34;&gt;https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&#34;&gt;https://www.akamai.com/blog/security-research/winreg-relay-vulnerability&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2024/12/01/mungsul/NTLM_Part1/1.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/12/01/mungsul/ntlm_part1/">

  <title>[Research] Windows Authentication Series (Part1. NTLM) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-12-01 17:00" pubdate>
      2024 12 1 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      76
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Windows Authentication Series (Part1. NTLM)</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xBAA8;&#xC758;&#xD574;&#xD0B9; &#xC9C4;&#xB2E8; &#xC5C5;&#xBB34;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; Windows &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xCE68;&#xD22C; &#xD14C;&#xC2A4;&#xD2B8; &#xC911; &#xB9DD;&#xC5D0;&#xC11C; NTLM hash &#xB97C; &#xD68D;&#xB4DD;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xCE21;&#xBA74; &#xC774;&#xC6A9;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD750;&#xB984;&#xC73C;&#xB85C; &#xCE68;&#xD22C;&#xAC00; &#xC774;&#xB904;&#xC9C0;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC885;&#xC885; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCE68;&#xD22C; &#xC5C5;&#xBB34; &#xC9C4;&#xD589;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xC774;&#xB7F0; &#xC778;&#xC99D; &#xAD00;&#xB828; &#xAC1C;&#xB150;&#xC744; &#xC880; &#xC18C;&#xD640;&#xD788; &#xD55C; &#xAC10;&#xC774; &#xC5C6;&#xC796;&#xC544; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;.</p>
<p>&#xC774;&#xBC88; &#xAE30;&#xD68C;&#xC5D0; Windows &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC778; NTLM &#xACFC; Kerberos &#xC758; &#xAC1C;&#xB150;, &#xD788;&#xC2A4;&#xD1A0;&#xB9AC;, &#xCDE8;&#xC57D;&#xC810; &#xB4F1;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xCC28;&#xADFC;&#xCC28;&#xADFC; &#xC815;&#xB9AC;&#xD558;&#xBA70; &#xC2DC;&#xB9AC;&#xC988;&#xB85C; &#xC5F0;&#xC7AC;&#xB97C; &#xD574;&#xB098;&#xAC00;&#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Microsoft &#xB294; &#xC62C;&#xD574; 6&#xC6D4; NTLM &#xC778;&#xC99D;&#xC744; &#xB354;&#xC774;&#xC0C1; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xBC1C;&#xD45C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC791;&#xB144; 10&#xC6D4;&#xC5D0; Windows 11 &#xBD80;&#xD130;&#xB294; NTLM &#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xACA0;&#xB2E4;&#xACE0; &#xD574;&#xB454;&#xD130;&#xB77C; &#xADF8;&#xB9AC; &#xB180;&#xB77C;&#xC6B4; &#xC77C;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. Microsoft &#xAC00; NTLM &#xB300;&#xC2E0; &#xC0AC;&#xC6A9;&#xC744; &#xAD8C;&#xACE0;&#xD55C; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC740; Kerberos &#xC778;&#xC99D;&#xC73C;&#xB85C; &#xD2F0;&#xCF13; &#xBC29;&#xC2DD;&#xC758; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>NTLM &#xC778;&#xC99D;&#xC740; &#xBE0C;&#xB8E8;&#xD2B8;&#xD3EC;&#xC2A4;&#xB098; Relay &#xACF5;&#xACA9; &#xB4F1;&#xC5D0; &#xAD6C;&#xC870;&#xC801;&#xC73C;&#xB85C; &#xCDE8;&#xC57D;&#xD558;&#xB2E4;&#xACE0; &#xC54C;&#xB824;&#xC838; &#xC788;&#xACE0; &#xC2E4;&#xC81C; &#xCE68;&#xD574;&#xC0AC;&#xACE0;&#xB4E4;&#xC5D0;&#xC11C;&#xB3C4; &#xACF5;&#xACA9;&#xC790;&#xB4E4; &#xD589;&#xC704;&#xAC00; &#xBE44;&#xC2B7;&#xD55C; &#xC591;&#xC0C1;&#xC744; &#xBCF4;&#xC774;&#xACE0; &#xB098;&#xC544;&#xAC00; NTLM &#xC778;&#xC99D; &#xAD00;&#xB828; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xC9C0;&#xC694;.</p>
<p>Microsoft &#xB294; &#xC704; &#xC774;&#xC720;&#xB97C; &#xD3EC;&#xD568;&#xD574;&#xC11C; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xC0AC;&#xC720;&#xB85C; &#xB354;&#xC774;&#xC0C1; NTLM &#xC778;&#xC99D; &#xC9C0;&#xC6D0;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xC120;&#xC5B8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB124;&#xC694;. &#xD558;&#xC9C0;&#xB9CC; &#xC628;&#xACE0;&#xC9C0;&#xC2E0;&#xC774;&#xB77C;&#xB294; &#xB9D0;&#xC774; &#xC788;&#xB4EF;&#xC774; &#xC61B;&#xAC83;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xC0C8;&#xB85C;&#xC6B4; &#xC9C0;&#xD61C;&#xB97C; &#xC5BB;&#xB294; &#xAC83; &#xC544;&#xB2C8;&#xACA0;&#xC2B5;&#xB2C8;&#xAE4C;?</p>
<p>NTLM &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xBC1C;&#xC0DD;&#xD588;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xB3C4; &#xD6D1;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; &#xC778;&#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xC5BB;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xAC00;&#xC838;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="NTLM-&#xC774;&#xB780;"><a href="#NTLM-&#xC774;&#xB780;" class="headerlink" title="NTLM &#xC774;&#xB780;"></a>NTLM &#xC774;&#xB780;</h1><p>NTLM &#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC778;&#xC99D;, &#xBB34;&#xACB0;&#xC131; &#xBC0F; &#xAE30;&#xBC00;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB41C; MS &#xBCF4;&#xC548; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;. &#xC61B;&#xB0A0;&#xC61B;&#xC801; Microsoft LAN Manager (LM) &#xB77C;&#xB294; &#xC81C;&#xD488;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB358; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xD6C4;&#xC18D; &#xBC84;&#xC804;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>NTLM &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; 2&#xAC1C;&#xC758; hash &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;&#xC694;. &#xBCC4;&#xB3C4; salting &#xB4F1;&#xC774; &#xB418;&#xC5B4;&#xC788;&#xC9C0; &#xC54A;&#xC544; &#xD655;&#xBCF4;&#xD55C;&#xB2E4;&#xBA74; &#xADF8;&#xB300;&#xB85C; &#xC778;&#xC99D;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, NTLM hash &#xB97C; &#xC5BB;&#xC5C8;&#xB2E4;&#xB77C;&#xB294; &#xAC83;&#xC740; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC5BB;&#xC5C8;&#xB2E4;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC740; &#xD6A8;&#xACFC;&#xB97C; &#xC9C0;&#xB2CC;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p>NTLM hash &#xB294; NT hash &#xC640; LM hash &#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>LM hash &#xB294; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC; &#xCCAB; 14&#xAE00;&#xC790;&#xC5D0; &#xB300;&#xD574; DES &#xAE30;&#xBC18; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC801;&#xC6A9;&#xD55C; hash &#xC774;&#xAD6C;&#xC694;.<ul>
<li>DES &#xD0A4;&#xAC00; KGS!@#$% &#xB77C;&#xACE0; &#xD558;&#xB124;&#xC694;..</li>
</ul>
</li>
<li>NT hash &#xB294; password &#xB97C; utf-16 &#xC778;&#xCF54;&#xB529;&#xD55C; &#xAC83;&#xC744; MD4 &#xD55C; hash &#xC785;&#xB2C8;&#xB2E4;.<ul>
<li>DB &#xACA9;&#xC778; NTDS.dit &#xB610;&#xB294; SAM &#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#xB450; hash &#xBAA8;&#xB450; 128bit (16byte) &#xAE38;&#xC774;&#xB97C; &#xAC16;&#xACE0; &#xC788;&#xACE0; : &#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; [LM hash]:[NT hash] &#xCC98;&#xB7FC; &#xBC30;&#xCE58;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>LM hash &#xB294; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC544;&#xC11C; &#xD754;&#xD788; &#x201C;aad3b435b51404eeaad3b435b51404ee&#x201D; &#xB85C; &#xACE0;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>NTLM &#xC740; challenge-response &#xBC29;&#xC2DD;&#xC758; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB85C; &#xC778;&#xC99D;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xC8FC;&#xCCB4;&#xAC00; &#xC9C8;&#xBB38;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC778;&#xC99D;&#xC744; &#xBC1B;&#xB294; &#xAC1C;&#xCCB4;&#xAC00; &#xC9C8;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xB2F5;&#xC744; &#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB34;&#xC791;&#xC704;&#xC758; Challenge &#xB97C; &#xC81C;&#xACF5;&#xD558;&#xBA74; &#xD2B9;&#xC815;&#xD55C; &#xBC29;&#xBC95;&#xC73C;&#xB85C; response &#xB97C; &#xACC4;&#xC0B0;&#xD574;&#xC11C; &#xB118;&#xAE30;&#xB294; &#xC2DD;&#xC73C;&#xB85C; &#xC778;&#xC99D;&#xC744; &#xD558;&#xBA70; NTLM &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBC84;&#xC804;&#xC5D0; &#xB530;&#xB77C; Resposne &#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</p>
<h1 id="NTLM-&#xC778;&#xC99D;-&#xACFC;&#xC815;"><a href="#NTLM-&#xC778;&#xC99D;-&#xACFC;&#xC815;" class="headerlink" title="NTLM &#xC778;&#xC99D; &#xACFC;&#xC815;"></a>NTLM &#xC778;&#xC99D; &#xACFC;&#xC815;</h1><p>NTLM &#xC778;&#xC99D; &#xACFC;&#xC815;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC11C;&#xBC84;&#xC5D0; NTLM_NEGOTIATE &#xC694;&#xCCAD;</li>
<li>&#xC11C;&#xBC84;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; NTLM_CHALLENGE &#xC804;&#xB2EC; (challenge &#xAC12; &#xC81C;&#xACF5;)</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; response &#xC5F0;&#xC0B0; &#xD6C4; &#xC11C;&#xBC84;&#xB85C; NTLM_AUTHENTICATE &#xC804;&#xB2EC;</li>
</ol>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image1.png" srcset="/img/loading.gif" alt="ttt"></p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC758; &#xACFC;&#xC815; (NEGOTIATE, CHALLENGE, AUTHENTICATE) &#xC744; &#xC218;&#xD589;&#xD560; &#xB54C; &#xBA54;&#xC2DC;&#xC9C0;&#xB77C;&#xB294; &#xD615;&#xD0DC;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0; &#xBC1B;&#xC73C;&#xBA70; &#xAC01;&#xAC01; NEGOTIATE_MESSAGE, CHALLENGE_MESSAGE, AUTHENTICATE_MESSAGE &#xB77C;&#xACE0; &#xCE6D;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="NTLM-&#xBA54;&#xC2DC;&#xC9C0;"><a href="#NTLM-&#xBA54;&#xC2DC;&#xC9C0;" class="headerlink" title="NTLM &#xBA54;&#xC2DC;&#xC9C0;"></a>NTLM &#xBA54;&#xC2DC;&#xC9C0;</h1><p>&#xAC01; &#xBA54;&#xC2DC;&#xC9C0;&#xB4E4;&#xC758; &#xD544;&#xB4DC;&#xB4E4;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC790;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="NEGOTIATE-MESSAGE"><a href="#NEGOTIATE-MESSAGE" class="headerlink" title="NEGOTIATE_MESSAGE"></a>NEGOTIATE_MESSAGE</h2><ul>
<li>Signature (8&#xBC14;&#xC774;&#xD2B8;): <code>&apos;N&apos;, &apos;T&apos;, &apos;L&apos;, &apos;M&apos;, &apos;S&apos;, &apos;S&apos;, &apos;P&apos;, &apos;\0&apos;</code></li>
<li>Message Type (4&#xBC14;&#xC774;&#xD2B8;): NEGOTIATE_MESSAGE &#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4; <code>0x00000001</code></li>
<li>Negotiate Flags (4&#xBC14;&#xC774;&#xD2B8;): &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD50C;&#xB798;&#xADF8;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>Domain Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984; (Optional)</li>
<li>Workstation Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC6CC;&#xD06C;&#xC2A4;&#xD14C;&#xC774;&#xC158; &#xC774;&#xB984; (Optional)</li>
<li>Version (8&#xBC14;&#xC774;&#xD2B8;): NTLM &#xBC84;&#xC804;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC; (Optional)</li>
<li>Payload (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;&#xACFC; &#xC6CC;&#xD06C;&#xC2A4;&#xD14C;&#xC774;&#xC158; &#xC774;&#xB984;</li>
</ul>
<h2 id="CHALLENGE-MESSAGE"><a href="#CHALLENGE-MESSAGE" class="headerlink" title="CHALLENGE_MESSAGE"></a>CHALLENGE_MESSAGE</h2><ul>
<li>Signature (8&#xBC14;&#xC774;&#xD2B8;): <code>&apos;N&apos;, &apos;T&apos;, &apos;L&apos;, &apos;M&apos;, &apos;S&apos;, &apos;S&apos;, &apos;P&apos;, &apos;\0&apos;</code></li>
<li>Message Type (4&#xBC14;&#xC774;&#xD2B8;): CHALLENGE_MESSAGE &#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4; <code>0x00000002</code></li>
<li>Target Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xC11C;&#xBC84;&#xC758; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984; &#xB610;&#xB294; &#xCEF4;&#xD4E8;&#xD130; &#xC774;&#xB984;</li>
<li>Negotiate Flags (4&#xBC14;&#xC774;&#xD2B8;): &#xC11C;&#xBC84;&#xAC00; &#xC120;&#xD0DD;&#xD55C; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD50C;&#xB798;&#xADF8;</li>
<li>Server Challenge (8&#xBC14;&#xC774;&#xD2B8;): &#xC11C;&#xBC84;&#xAC00; &#xC0DD;&#xC131;&#xD55C; Challenge &#xAC12;</li>
<li>Target Info (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xCD94;&#xAC00; &#xC815;&#xBCF4;(&#xC608;: &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;, &#xCEF4;&#xD4E8;&#xD130; &#xC774;&#xB984; &#xB4F1;) (Optional)</li>
<li>Version (8&#xBC14;&#xC774;&#xD2B8;): NTLM &#xBC84;&#xC804;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC; (Optional)</li>
<li>Payload (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;&#xACFC; &#xC6CC;&#xD06C;&#xC2A4;&#xD14C;&#xC774;&#xC158; &#xC774;&#xB984;</li>
</ul>
<h2 id="AUTHENTICATE-MESSAGE"><a href="#AUTHENTICATE-MESSAGE" class="headerlink" title="AUTHENTICATE_MESSAGE"></a>AUTHENTICATE_MESSAGE</h2><ul>
<li>Signature (8&#xBC14;&#xC774;&#xD2B8;): <code>&apos;N&apos;, &apos;T&apos;, &apos;L&apos;, &apos;M&apos;, &apos;S&apos;, &apos;S&apos;, &apos;P&apos;, &apos;\0&apos;</code></li>
<li>Message Type (4&#xBC14;&#xC774;&#xD2B8;): AUTHENTICATE_MESSAGE&#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4; <code>0x00000003</code></li>
<li>LM/NT Challenge Response (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC0DD;&#xC131;&#xD55C; LM &#xB610;&#xB294; NT Response</li>
<li>Domain Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;</li>
<li>User Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xC778;&#xC99D;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC774;&#xB984;</li>
<li>Workstation Name (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xC778;&#xC99D; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC6CC;&#xD06C;&#xC2A4;&#xD14C;&#xC774;&#xC158; &#xC774;&#xB984;</li>
<li>Session Key (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xC138;&#xC158; &#xBCF4;&#xC548;&#xC744; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD0A4; (Optional)</li>
<li>Negotiate Flags (4&#xBC14;&#xC774;&#xD2B8;): &#xC0AC;&#xC6A9;&#xB41C; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD50C;&#xB798;&#xADF8;</li>
<li>Version (8&#xBC14;&#xC774;&#xD2B8;): NTLM &#xBC84;&#xC804;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC; (Optional)</li>
<li>MIC (16&#xBC14;&#xC774;&#xD2B8;): &#xBA54;&#xC2DC;&#xC9C0; &#xBB34;&#xACB0;&#xC131; &#xCF54;&#xB4DC; (Optional)</li>
<li>Payload (&#xAC00;&#xBCC0; &#xAE38;&#xC774;): &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;&#xACFC; &#xC6CC;&#xD06C;&#xC2A4;&#xD14C;&#xC774;&#xC158; &#xC774;&#xB984;, &#xC138;&#xC158;&#xD0A4;</li>
</ul>
<h1 id="NTLM-Response"><a href="#NTLM-Response" class="headerlink" title="NTLM Response"></a>NTLM Response</h1><p>&#xC704;&#xC5D0;&#xC11C; NTLM &#xBA54;&#xC2DC;&#xC9C0; &#xC885;&#xB958;&#xC640; &#xD544;&#xB4DC;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xBD24;&#xB294;&#xB370;&#xC694;. &#xAC70;&#xB4ED;&#xD574;&#xC11C; NTLM &#xC778;&#xC99D;&#xC740; &#xC11C;&#xBC84;&#xAC00; &#xB0B4;&#xB824;&#xC900; Challenge &#xAC12;&#xC5D0; &#xB300;&#xD55C; Response &#xB97C; &#xACC4;&#xC0B0;&#xD574;&#xC11C; &#xB118;&#xAE30;&#xB294; &#xBC29;&#xC2DD;&#xC774;&#xB77C;&#xACE0; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB0B4;&#xCE5C;&#xAE40;&#xC5D0; NTLM &#xBC84;&#xC804;&#xBCC4;&#xB85C; &#xB2E4;&#xB978; Response &#xACC4;&#xC0B0; &#xBC29;&#xC2DD;&#xC744; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h2 id="NTLMv1-Response"><a href="#NTLMv1-Response" class="headerlink" title="NTLMv1 Response"></a>NTLMv1 Response</h2><p>v1&#xC758; &#xACBD;&#xC6B0; Response &#xB294; &#xB2E4;&#xC74C;&#xCC98;&#xB7FC; &#xACC4;&#xC0B0;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xC0AC;&#xC6A9;&#xC790; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; Unicode&#xB85C; &#xC778;&#xCF54;&#xB529;&#xD558;&#xACE0; MD4 &#xD574;&#xC2DC;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.<ul>
<li><code>NT_Hash=MD4(Unicode(Password))</code></li>
</ul>
</li>
<li>&#xC0DD;&#xC131;&#xB41C; NT &#xD574;&#xC2DC;&#xB294; 16&#xBC14;&#xC774;&#xD2B8;&#xC778;&#xB370;&#xC694;. &#xC5EC;&#xAE30;&#xC5D0; 0x00*5&#xB97C; &#xBD99;&#xC5EC;&#xC11C; 21&#xBC14;&#xC774;&#xD2B8;&#xB85C; &#xD328;&#xB529;&#xD55C; &#xD6C4; 7&#xBC14;&#xC774;&#xD2B8;&#xC529; &#xC138; &#xAC1C;&#xC758; &#xD0A4;&#xB85C; &#xBD84;&#xD560;&#xD569;&#xB2C8;&#xB2E4;.<ul>
<li><code>NT_Hash_Padded=NT_Hash || 0x0000000000</code></li>
<li><code>K1=NT_Hash_Padded[0:7]</code></li>
<li><code>K2=NT_Hash_Padded[7:14]</code></li>
<li><code>K3=NT_Hash_Padded[14:21]</code></li>
</ul>
</li>
<li>K1, K2, K3 &#xC744; &#xAC01;&#xAC01; DES &#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. <ul>
<li>&#xAC01; &#xD0A4;&#xB294; 7&#xBC14;&#xC774;&#xD2B8;&#xC778;&#xB370; &#xD328;&#xB9AC;&#xD2F0; &#xBE44;&#xD2B8;&#xB97C; &#xCD94;&#xAC00;&#xD574;&#xC11C; 8&#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xB9DE;&#xCDA5;&#xB2C8;&#xB2E4;.)</li>
</ul>
</li>
<li>&#xC11C;&#xBC84; &#xCC4C;&#xB9B0;&#xC9C0;&#xB97C; &#xAC01; DES Key &#xB85C; &#xC554;&#xD638;&#xD654;&#xD558;&#xACE0; concat &#xD55C; &#xACB0;&#xACFC;&#xAC00; NTLMv1 Response &#xC785;&#xB2C8;&#xB2E4;.<ul>
<li><code>Response1 = DES(K1, ServerChallenge)</code></li>
<li><code>Response2 = DES(K2, ServerChallenge)</code></li>
<li><code>Response3 = DES(K3, ServerChallenge)</code></li>
<li><code>NTLMv1 Response = Response1 || Response2 || Response3</code></li>
</ul>
</li>
</ol>
<h2 id="NTLMv2-Response"><a href="#NTLMv2-Response" class="headerlink" title="NTLMv2 Response"></a>NTLMv2 Response</h2><p>NTLMv1 &#xC740; &#xB098;&#xB984; &#xAD6C;&#xC870;&#xAC00; &#xAC04;&#xB2E8;&#xD55C;&#xB370;&#xC694;. v2 &#xBD80;&#xD130; &#xBA38;&#xB9AC;&#xAC00; &#xC880; &#xC544;&#xD30C;&#xC9D1;&#xB2C8;&#xB2E4;. NTLMv2&#xC758; &#xACBD;&#xC6B0; HMAC-MD5 &#xC0AC;&#xC6A9; &#xBC0F; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCC4C;&#xB9B0;&#xC9C0; &#xAE30;&#xBC18; &#xAC12;&#xC73C;&#xB85C; nonce &#xB97C; &#xC9C0;&#xC815;&#xD574;&#xC11C; &#xC880; &#xB354; &#xD06C;&#xB799;&#xC5D0; &#xB300;&#xD55C; &#xB0B4;&#xC131;&#xC744; &#xD655;&#xBCF4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>NT &#xD574;&#xC2DC; NTLMv2 &#xD574;&#xC2DC; &#xC0DD;&#xC131; <ul>
<li><code>NT_Hash=MD4(Unicode(Password))</code></li>
<li><code>NTLMv2_Hash=HMAC-MD5(NT_Hash, Unicode(Uppercase(Username)||Domain))</code></li>
</ul>
</li>
<li>temp &#xBCC0;&#xC218; &#xAD6C;&#xC131;<ul>
<li><strong>Responser version:</strong>  <strong><code>0x01</code></strong> (1&#xBC14;&#xC774;&#xD2B8;).</li>
<li><strong>Hi Responserversion:</strong>  <strong><code>0x01</code></strong> (1&#xBC14;&#xC774;&#xD2B8;).</li>
<li><strong>Z(6):</strong> &#x2019;\x00&#x2019;*6 6&#xBC14;&#xC774;&#xD2B8;</li>
<li><strong>Time:</strong> Timestamp: 8&#xBC14;&#xC774;&#xD2B8;</li>
<li><strong>ClientChallenge:</strong> &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; 8&#xBC14;&#xC774;&#xD2B8; &#xB79C;&#xB364; &#xBC14;&#xC774;&#xD2B8;</li>
<li><strong>Z(4):</strong> &#x2019;\x00&#x2019;*4</li>
<li><strong>ServerName:</strong> &#xC11C;&#xBC84; &#xC774;&#xB984;</li>
<li><strong>Z(4):</strong> &#x2019;\x00&#x2019;*4</li>
</ul>
</li>
<li>NtChallengeResponse &#xC640; LmChallengeResponse &#xACC4;&#xC0B0;<ul>
<li><code>NtChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp) + temp</code><ul>
<li>&#xC5EC;&#xAE30;&#xC11C; <code>HMAC_MD5(NTLMv2_Hash, ServerChallenge + temp)</code> &#xBD80;&#xBD84;&#xC744; NtProofStr &#xB77C;&#xACE0;&#xB3C4; &#xCE6D;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><code>LmChallengeResponse = HMAC_MD5(NTLMv2_Hash, ServerChallenge + ClientChallenge) + ClientChallenge</code></li>
</ul>
</li>
<li>LmChallengeResponse &#xC640; NtChallengeResponse &#xB97C; &#xBD99;&#xC778; &#xAC12;&#xC774; NTLMv2 &#xC758; Response &#xC785;&#xB2C8;&#xB2E4;.<ul>
<li><code>NTLMv2 Response = LmChallengeResponse || LmChallengeResponse</code></li>
</ul>
</li>
</ol>
<p>&#xC608;&#xC2DC;&#xB97C; &#xB4E4;&#xC5B4;&#xBD05;&#xC2DC;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; RPC &#xD328;&#xD0B7;&#xC5D0;&#xC11C; &#xCEA1;&#xCC98;&#xB41C; NTLMv2 Response &#xAC12;&#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xAC00; &#xC704;&#xC5D0;&#xC11C; &#xB2E4;&#xB8EC; &#xD544;&#xB4DC;&#xB4E4;&#xC774; &#xBCF4;&#xC774;&#xACE0; &#xC788;&#xB294;&#xB370;&#xC694;. wireshark &#xC5D0;&#xC11C; &#xC798; &#xD30C;&#xC2F1;&#xD574;&#xC11C; &#xBCF4;&#xC5EC;&#xC8FC;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAC1C;&#xBCC4; &#xC124;&#xBA85;&#xC740; &#xC0DD;&#xB7B5;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image2.png" srcset="/img/loading.gif" alt><br><img src="/2024/12/01/mungsul/NTLM_Part1/image3.png" srcset="/img/loading.gif" alt></p>
<h1 id="NTLM&#xACFC;-&#xD0C0;-&#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC;&#xC758;-&#xAD00;&#xACC4;"><a href="#NTLM&#xACFC;-&#xD0C0;-&#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC;&#xC758;-&#xAD00;&#xACC4;" class="headerlink" title="NTLM&#xACFC; &#xD0C0; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC;&#xC758; &#xAD00;&#xACC4;"></a>NTLM&#xACFC; &#xD0C0; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC;&#xC758; &#xAD00;&#xACC4;</h1><p>NTLM&#xC740; SMB, HTTP &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xACC4;&#xCE35; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xBD99;&#xC5EC;&#xC838;&#xC11C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E0;&#xAE30;&#xD558;&#xC8E0;? &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; Windows &#xB0B4; &#xC5EC;&#xB7EC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xB4E4;&#xC774; NTLM &#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC8C; &#xC5B4;&#xB5BB;&#xAC8C; &#xAC00;&#xB2A5;&#xD560;&#xAE4C;&#xC694;?</p>
<p>GSSAPI (Generic Security Service API) &#xB77C;&#xB294; &#xC778;&#xC99D;, &#xBCF4;&#xC548; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Windows &#xC5D0;&#xC11C;&#xB294; GSSAPI&#xB97C; &#xAD6C;&#xD604;&#xD55C; SSPI (Security Support Provider Interface) &#xB77C;&#xB294;&#xAC8C; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774; SSPI &#xC5D0; NTLM Security Support Provider &#xAC00; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xB4E4;&#xC774; &#xACB0;&#xD569;&#xB418;&#xC5B4;&#xC11C; NTLM &#xC778;&#xC99D;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image4.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC88;&#xC678;&#xC774;&#xC9C0;&#xB9CC; &#xC774; Security Support Provider &#xB3C4; &#xBCA1;&#xD130; &#xC911;&#xC5D0; &#xD558;&#xB098;&#xB85C; &#xC4F0;&#xC77C; &#xC218; &#xC788;&#xC5B4;&#xBCF4;&#xC774;&#xB124;&#xC694;. &#x1F642;</p>
<ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-24454</a></li>
</ul>
<h1 id="NTLM-over-SMB"><a href="#NTLM-over-SMB" class="headerlink" title="NTLM over SMB"></a>NTLM over SMB</h1><p>NTLM &#xC778;&#xC99D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC81C;&#xC77C; &#xD754;&#xD55C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; SMB&#xAC00; &#xC544;&#xB2D0;&#xAE4C; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. SMB&#xB294; &#xC798; &#xC544;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; &#xD30C;&#xC77C;&#xC744; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC778;&#xB370;&#xC694;. &#xC774; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xC778;&#xC99D; &#xAE30;&#xB2A5;&#xC744; &#xBD99;&#xC774;&#xAE30; &#xC704;&#xD574; NTLM &#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798; &#xADF8;&#xB9BC; &#xC0C1;&#xC5D0;&#xC11C;&#xB294; SMB NEGOTIATE &#xAC00; &#xBA3C;&#xC800; &#xC774;&#xB904;&#xC9C0;&#xACE0; &#xADF8; &#xB4A4;&#xC5D0; SMB_COM_SESSION_SETUP_ANDX &#xB97C; &#xD1B5;&#xD574; NTLM NEGOTIATE, CHALLENGE, AUTHENTICATE &#xAC00; &#xC774;&#xB904;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xD2B9;&#xD788;, Windows &#xB294; UNC PATH (<code>\\[IP]\path\to\file</code>) &#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xACF5;&#xC720;&#xB41C; &#xD30C;&#xC77C;&#xC774;&#xB098; &#xD3F4;&#xB354;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; SMB &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xB294;&#xB370;&#xC694;. &#xB9CC;&#xC57D; &#xAE30;&#xBCF8; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC774; NTLM &#xC774;&#xACE0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB108;&#xBA38;&#xB85C; UNC PATH&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xC5EC; &#xAC15;&#xC81C;&#xB85C; &#xACF5;&#xACA9;&#xC790;&#xC758; &#xC11C;&#xBC84;&#xB85C; &#xC694;&#xCCAD;&#xD558;&#xAC8C; &#xB9CC;&#xB4E0;&#xB2E4;&#xBA74; NTLMv2 Response &#xB97C; &#xD0C8;&#xCDE8;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD0C8;&#xCDE8;&#xB41C; NTLMv2 Response &#xB294; &#xC8FC;&#xB85C; Relay &#xACF5;&#xACA9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="NTLM-over-HTTP"><a href="#NTLM-over-HTTP" class="headerlink" title="NTLM over HTTP"></a>NTLM over HTTP</h1><p>HTTP &#xC5D0;&#xC11C; NTLM &#xC744; &#xC0AC;&#xC6A9;&#xD560;&#xB54C;&#xB294; Request &#xC640; Response &#xC5D0; &#xD5E4;&#xB354;&#xC5D0; &#xBD99;&#xC5EC;&#xC838;&#xC11C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; HTTP &#xC5D0;&#xC11C; NTLM Negotiate &#xB97C; &#xD558;&#xB294; Request &#xC785;&#xB2C8;&#xB2E4;. &#xBCF4;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; Authorization &#xD5E4;&#xB354;&#xC5D0; &#xBD99;&#xC5EC;&#xC838;&#xC11C; &#xC694;&#xCCAD;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs http"><span class="hljs-keyword">GET</span> <span class="hljs-string">/</span> HTTP/1.1
<span class="hljs-attribute">Host</span>: 192.168.0.41:8080
<span class="hljs-attribute">Authorization</span>: NTLM TlRMTVNTUAABAAAAMYCI4AAAAAAoAAAAAAAAACgAAAAAAAAAAAAAAA==</code></pre>
<p>Response &#xC5D0;&#xC11C;&#xB294; WWW-Authenticate &#xB77C;&#xB294; &#xD5E4;&#xB354;&#xC5D0; NTLM Challenge &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xCD94;&#xAC00;&#xB418;&#xC5B4; &#xBC18;&#xD658;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs apache"><span class="hljs-attribute">HTTP</span>/<span class="hljs-number">1</span>.<span class="hljs-number">1</span> <span class="hljs-number">401</span> Unauthorized
<span class="hljs-attribute">Date</span>: Sat, <span class="hljs-number">04</span> Jun <span class="hljs-number">2022</span> <span class="hljs-number">02</span>:<span class="hljs-number">19</span>:<span class="hljs-number">43</span> GMT
<span class="hljs-attribute">Server</span>: Apache
<span class="hljs-attribute">WWW</span>-Authenticate: NTLM TlRMTVNTUAACAAAADAAMADgAAAA<span class="hljs-number">1</span>gonilM<span class="hljs-number">550</span>+<span class="hljs-number">1</span>I+dYAAAAAAAAAAJIAkgBEAAAACgA<span class="hljs-number">5</span>OAAAAA<span class="hljs-number">9</span>EAE<span class="hljs-number">8</span>ATQBBAEkATgACAAwARABPAE<span class="hljs-number">0</span>AQQBJAE<span class="hljs-number">4</span>AAQAMAEEAUABQAFMAMQA<span class="hljs-number">1</span>AAQAGABkAG<span class="hljs-number">8</span>AbQBhAGkAbgAuAGwAbwBjAGEAbAADACYAQQBQAFAAUwAxADUALgBkAG<span class="hljs-number">8</span>AbQBhAGkAbgAuAGwAbwBjAGEAbAAFABgAZABvAG<span class="hljs-number">0</span>AYQBpAG<span class="hljs-number">4</span>ALgBsAG<span class="hljs-number">8</span>AYwBhAGwABwAIAKFXn<span class="hljs-number">425</span>d<span class="hljs-number">9</span>gBAAAAAA==
<span class="hljs-attribute">Content</span>-Length: <span class="hljs-number">381</span>
<span class="hljs-attribute">Content</span>-Type: text/html; charset=iso-<span class="hljs-number">8859</span>-<span class="hljs-number">1</span>

<span class="hljs-section">&lt;!DOCTYPE HTML PUBLIC <span class="hljs-string">&quot;-//IETF//DTD HTML 2.0//EN&quot;</span>&gt;</span>
<span class="hljs-section">&lt;html&gt;</span><span class="hljs-section">&lt;head&gt;</span>
<span class="hljs-section">&lt;title&gt;</span><span class="hljs-attribute">401</span> Unauthorized&lt;/title&gt;
<span class="hljs-section">&lt;/head&gt;</span><span class="hljs-section">&lt;body&gt;</span>
<span class="hljs-section">&lt;h1&gt;</span><span class="hljs-attribute">Unauthorized</span>&lt;/h<span class="hljs-number">1</span>&gt;
<span class="hljs-section">&lt;p&gt;</span><span class="hljs-attribute">This</span> server could not verify that you
<span class="hljs-attribute">are</span> authorized to access the document
<span class="hljs-attribute">requested</span>.  Either you supplied the wrong
<span class="hljs-attribute">credentials</span> (e.g., bad password), or your
<span class="hljs-attribute">browser</span> doesn&apos;t understand how to supply
<span class="hljs-attribute">the</span> credentials required.&lt;/p&gt;
<span class="hljs-section">&lt;/body&gt;</span><span class="hljs-section">&lt;/html&gt;</span>
</code></pre>
<p>&#xB9CC;&#xC57D; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; NTLM &#xC778;&#xC99D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xC5C5;&#xC758; HTTP &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC678;&#xBD80;&#xB85C; &#xB178;&#xCD9C;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC815;&#xBCF4; &#xD68D;&#xB4DD; &#xBCA1;&#xD130;&#xB85C;&#xB3C4; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xC8FC;&#xB294; NTLM CHALLENGE &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0; &#xB3C4;&#xBA54;&#xC778;, &#xD638;&#xC2A4;&#xD2B8; &#xC774;&#xB984;, &#xBC84;&#xC804; &#xB4F1;&#xC774; &#xD3EC;&#xD568;&#xB41C;&#xB2E4;&#xB294;&#xAC70; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xB098;&#xC694;? &#xC774; &#xC810;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xCD08;&#xAE30; &#xC9C4;&#xC785; &#xC2DC; &#xC720;&#xC6A9;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC744; &#xAC00;&#xB2A5;&#xC131;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="NTLM-over-RPC"><a href="#NTLM-over-RPC" class="headerlink" title="NTLM over RPC"></a>NTLM over RPC</h1><p>&#xC704;&#xC5D0;&#xC11C; &#xC7A0;&#xC2DC; SSPI&#xC5D0; &#xB300;&#xD574; &#xC5B8;&#xAE09;&#xD560; &#xB54C; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xBCF4;&#xC168;&#xC744; &#xAC83; &#xAC19;&#xC740;&#xB370;&#xC694;. RPC &#xC5D0;&#xC11C;&#xB3C4; NTLM &#xC778;&#xC99D;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. RPC UUID &#xB9E4;&#xD551; &#xC774;&#xD6C4; Bind request, Bind response &#xB97C; &#xD1B5;&#xD558;&#xC5EC; NEGOTIATE, CHALLENGE, AUTHENTICATE &#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image6.png" srcset="/img/loading.gif" alt></p>
<p>RPC &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xC801;&#xC808;&#xD558;&#xAC8C; &#xC778;&#xC99D;&#xC774;&#xB098; &#xAD8C;&#xD55C;&#xC81C;&#xC5B4;&#xAC00; &#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74; &#xAD1C;&#xCC2E;&#xACA0;&#xC9C0;&#xB9CC;, &#xC784;&#xC758;&#xB85C; RPC&#xAC00; &#xC0AC;&#xC6A9;&#xAC00;&#xB2A5;&#xD558;&#xBA74;&#xC11C;&#xB3C4; RPC &#xD568;&#xC218;&#xC5D0; &#xACBD;&#xB85C;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00;&#xB294; &#xACBD;&#xC6B0; UNC Path &#xB97C; &#xC804;&#xB2EC;&#xD574;&#xC11C; &#xC11C;&#xBC84;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCABD;&#xC73C;&#xB85C; NTLM AUTH &#xB97C; &#xC2DC;&#xB3C4;&#xD558;&#xAC8C;&#xB054; &#xD558;&#xB294; &#xAC15;&#xC81C; &#xC778;&#xC99D; &#xACF5;&#xACA9;&#xB3C4; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="NTLM-Relay"><a href="#NTLM-Relay" class="headerlink" title="NTLM Relay"></a>NTLM Relay</h1><p>NTLM &#xAD00;&#xB828; &#xACF5;&#xACA9;&#xACFC; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC774; &#xAE00; &#xD55C; &#xD3B8;&#xC5D0; &#xB2E4; &#xC815;&#xB9AC;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xC744; &#xC815;&#xB3C4;&#xB85C; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. HotPotato, Printerbug, Petitpotam, DFSCoerce, ShadowCoerce, CVE-2024-8260, CVE-2024-38200 &#xB4F1;&#xB4F1; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xACF5;&#xACA9;&#xB4E4;&#xC5D0;&#xC11C; &#xACF5;&#xD1B5;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAE30;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC14;&#xB85C; NTLM Relay &#xC778;&#xB370;&#xC694;. &#xC911;&#xAC04;&#xC790; &#xACF5;&#xACA9;&#xC774;&#xB791; &#xAC70;&#xC758; &#xC720;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>NTLM &#xB97C; &#xD68D;&#xB4DD;&#xD55C; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; PTH (pass-the-hash) &#xB97C; &#xC368;&#xC11C; &#xB9C8;&#xCE58; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xB4EF;&#xC774; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC; NTLMv2 hash (a.k.a Net-NTLM hash) &#xB97C; &#xC5BB;&#xC5B4;&#xB0B8; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; PTH&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xACE0; Relay &#xB97C; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. (&#xB610;&#xB294; &#xD06C;&#xB799;&#xC744; &#xC2DC;&#xB3C4; &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xAE34; &#xD569;&#xB2C8;&#xB2E4;.)</p>
<p><img src="/2024/12/01/mungsul/NTLM_Part1/image7.png" srcset="/img/loading.gif" alt></p>
<p>NTLM Relay &#xB97C; &#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB3C4;&#xAD6C;&#xB294; Responder, impacket &#xC758; ntlmrelayx &#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Responder &#xB3C4;&#xAD6C;&#xB97C; &#xC368;&#xC11C; &#xC778;&#xC99D;&#xC744; &#xC704;&#xD55C; fake &#xC11C;&#xBC84;&#xB97C; &#xAD6C;&#xC131;&#xD558;&#xAD6C;&#xC694;. responder &#xB85C; &#xBC1B;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xD0C0;&#xAC9F; &#xC11C;&#xBC84;&#xC5D0; relay &#xD560; &#xB54C;&#xB294; ntlmrelayx &#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>Windows &#xAC00; &#xC9C0;&#xC6D0;&#xC744; &#xB354;&#xC774;&#xC0C1; &#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xB824;&#xACE0; &#xD558;&#xB294; NTLM &#xC778;&#xC99D;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xC0AC;&#xC6A9;&#xB418;&#xC5B4;&#xC654;&#xAE30;&#xB3C4; &#xD558;&#xACE0; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xACB0;&#xD569;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xACFC; Windows &#xC758; UNC Path &#xAE30;&#xB2A5;&#xACFC; &#xC5EE;&#xC5EC;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xACF5;&#xACA9; &#xBCA1;&#xD130;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC600;&#xB358; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xBC88;&#xC5D0; &#xB2E4;&#xB918;&#xB358; &#xAC1C;&#xB150; &#xB0B4;&#xC6A9;&#xC744; &#xD1A0;&#xB300;&#xB85C; NTLM &#xAD00;&#xB828; 1-day &#xCDE8;&#xC57D;&#xC810; &#xBA87; &#xC885; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xAC00;&#xC838;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4; &#x1F642;</p>
<h1 id="References"><a href="#References" class="headerlink" title="References"></a>References</h1><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm">https://learn.microsoft.com/en-us/windows/whats-new/deprecated-features-resources#ntlm</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/b38c36ed-2804-4868-a9ff-8dd3182128e4</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://davenport.sourceforge.net/ntlm.html">https://davenport.sourceforge.net/ntlm.html</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html">https://web.archive.org/web/20030706050349/http://www.xfocus.net/articles/200305/smbrelay.html</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication">https://learn.microsoft.com/ko-kr/troubleshoot/windows-server/windows-security/ntlm-user-authentication</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/">https://www.silverfort.com/ko/blog/understanding-the-security-risks-of-ntlm/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://foxglovesecurity.com/2016/01/16/hot-potato/">https://foxglovesecurity.com/2016/01/16/hot-potato/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx">https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/">https://www.bleepingcomputer.com/news/microsoft/microsoft-deprecates-windows-ntlm-authentication-protocol/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/NTLM">https://en.wikipedia.org/wiki/NTLM</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html">https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/b4af186e-b2ff-43f9-b18e-eedb366abf13</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.xn--hy1b43d247a.com/general-concepts/windows-authentication/ntlm">https://www.&#xB808;&#xB4DC;&#xD300;.com/general-concepts/windows-authentication/ntlm</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html">https://0xdf.gitlab.io/2019/01/13/getting-net-ntlm-hases-from-windows.html</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture">https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface">https://en.wikipedia.org/wiki/Generic_Security_Services_Application_Program_Interface</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP">https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture#BKMK_NTLMSSP</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-38043</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/">https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.akamai.com/blog/security-research/winreg-relay-vulnerability">https://www.akamai.com/blog/security-research/winreg-relay-vulnerability</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.xn--hy1b43d247a.com/credential-access/authentication-coercion">https://www.&#xB808;&#xB4DC;&#xD300;.com/credential-access/authentication-coercion</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/p0dalirius/windows-coerced-authentication-methods">https://github.com/p0dalirius/windows-coerced-authentication-methods</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py">https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/lgandx/Responder">https://github.com/lgandx/Responder</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture">https://learn.microsoft.com/ko-kr/windows-server/security/windows-authentication/security-support-provider-interface-architecture</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-nlmp/c083583f-1a8f-4afe-a742-6ee08ffeb8cf</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/">https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/">https://blog.leakix.net/2022/03/bypassing-ntlm-auth-over-http/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.akamai.com/blog/security-research/winreg-relay-vulnerability">https://www.akamai.com/blog/security-research/winreg-relay-vulnerability</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/mungsul/">mungsul</a>
                  
                  <a class="hover-with-bg" href="/tags/NTLM/">NTLM</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/Authentication/">Authentication</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_mungsul.jpg" srcset="/img/loading.gif" alt="mungsul">
                  </div>

                  <div class="link-text">
                    <div class="link-title">mungsul</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/mungsul">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/11/30/empty/CVE-2024-0012/">
                    <span class="hidden-mobile">[] CVE-2024-0012/CVE-2024-9474:  (PAN OS)      </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/12/01/mungsul/NTLM_Part1/';
        this.page.identifier = '/2024/12/01/mungsul/NTLM_Part1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Windows Authentication Series (Part1. NTLM)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
