

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F642;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0;&amp;#xB294; &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC881;&amp;#xD600;&amp;#xAC00;&amp;#xBA70; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;(&amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC9C1; &amp;#xBABB;&amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#x1F447; &amp;#x314E;&amp;#x314E;).&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/&#34;&gt;[Research] Anti-Debugging Part1(KR)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;Static&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;Dynamic&lt;/strong&gt; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Static&lt;/strong&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Dynamic&lt;/strong&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC758; &amp;#xD589;&amp;#xB3D9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;h3 id=&#34;Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;a href=&#34;#Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34; class=&#34;headerlink&#34; title=&#34;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;/a&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&lt;/h3&gt;&lt;p&gt;Static &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;API Hooking&lt;/strong&gt;: &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; API&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0;, &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; &amp;#xD56D;&amp;#xC0C1; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;PEB &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;: PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;a href=&#34;#Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34; class=&#34;headerlink&#34; title=&#34;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;/a&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&lt;/h3&gt;&lt;p&gt;Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xD654;&amp;#xB098; &amp;#xB3D9;&amp;#xC801; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC6B0;&amp;#xD68C;&lt;/strong&gt;: &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xCE21;&amp;#xC815; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;: Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC608;&amp;#xC678; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;&amp;#xC2E4;&amp;#xC2B5;&lt;/h1&gt;&lt;p&gt;&amp;#xC790;! &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC2B5; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;: Windows 11&lt;/li&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;: 32&amp;#xBE44;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB3C4;&amp;#xAD6C;: IDA Freeware 8.4&lt;/li&gt;
&lt;li&gt;IDE: Visual Studio 2022&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; IDA Freeware&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;h3 id=&#34;1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;a href=&#34;#1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;/a&gt;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/h3&gt;&lt;p&gt;&amp;#x201C;Part 1&amp;#x201D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBD24;&amp;#xB4EF;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Visual Studio 2022&amp;#xC5D0;&amp;#xC11C; &amp;#xBE48; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xACE0; main.cpp&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4; x86&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }

    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; exe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD3F4;&amp;#xB354;(./Debug)&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &lt;code&gt;No debugger found.&lt;/code&gt; &amp;#xAC00; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA Freeware&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xC5D0; &amp;#xBD88;&amp;#xB7EC;&amp;#xC640; F9&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;..!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xBB38;&amp;#xC7A5;&amp;#xC774; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB9CC;&amp;#xC57D; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?! &amp;#xC774;&amp;#xC81C; &amp;#x201C;API Hooking&amp;#x201D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-API-Hooking-&amp;#xC2E4;&amp;#xC2B5;-Bypass-Static-Anti-Debugging&#34;&gt;&lt;a href=&#34;#2-API-Hooking-&amp;#xC2E4;&amp;#xC2B5;-Bypass-Static-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;2. API Hooking &amp;#xC2E4;&amp;#xC2B5; (Bypass Static Anti-Debugging)&#34;&gt;&lt;/a&gt;&lt;strong&gt;2. API Hooking &amp;#xC2E4;&amp;#xC2B5; (Bypass Static Anti-Debugging)&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;API Hooking &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; Microsoft Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; API &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/microsoft/detours&#34;&gt;https://github.com/microsoft/detours&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xBC1B;&amp;#xC740; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xB123;&amp;#xC740; &amp;#xD6C4; &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Visual Studio 2022&amp;#xC5D0;&amp;#xC11C; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC744; &amp;#xCF2D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;nmake&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; bin, include, lib &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Visual Studio&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;gt;&amp;#xC18D;&amp;#xC131;&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#x201C;&amp;#xBAA8;&amp;#xB4E0; &amp;#xAD6C;&amp;#xC131;&amp;#x201D;, &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC740; &amp;#x201C;Win32&amp;#x201D;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; Visual Studio&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;C/C++ &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC18D;&amp;#xC131; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;C/C++&amp;#x201D; &amp;#xD0ED;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;&amp;#xC77C;&amp;#xBC18;&amp;#x201D; &amp;#xD558;&amp;#xC704; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD56D;&amp;#xBAA9;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Detours&amp;#xC758; include &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt; &lt;code&gt;C:\Users\OUYA77\Desktop\Detours-main\include&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xD655;&amp;#xC778;&amp;#x201D; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB9C1;&amp;#xCEE4; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC18D;&amp;#xC131; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xB9C1;&amp;#xCEE4;&amp;#x201D; &amp;#xD0ED;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;&amp;#xC77C;&amp;#xBC18;&amp;#x201D; &amp;#xD558;&amp;#xC704; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD56D;&amp;#xBAA9;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Detours&amp;#xC758; lib &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt; &lt;code&gt;C:\Users\OUYA77\Desktop\Detours-main\lib&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xD655;&amp;#xC778;&amp;#x201D; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; dllmain.cpp&amp;#xB97C; &amp;#xC120;&amp;#xC5B8;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// dllmain.cpp&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;pragma&lt;/span&gt; comment(lib, &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;detours.lib&amp;quot;&lt;/span&gt;)&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C; Detours&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &lt;strong&gt;&lt;code&gt;IsDebuggerPresent()&lt;/code&gt;&lt;/strong&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; Static Anti-Debugging &amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;detours.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// IsDebuggerPresent() &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;BOOL WINAPI &lt;span class=&#34;hljs-title&#34;&gt;HookedIsDebuggerPresent&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FALSE; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD56D;&amp;#xC0C1; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xB2F5;&lt;/span&gt;
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-comment&#34;&gt;// IsDebuggerPresent() &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&lt;/span&gt;
    HMODULE hKernel32 = GetModuleHandleA(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernel32.dll&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (hKernel32) {
        FARPROC pIsDebuggerPresent = GetProcAddress(hKernel32, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;IsDebuggerPresent&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pIsDebuggerPresent) {
            &lt;span class=&#34;hljs-comment&#34;&gt;// Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Hooking&lt;/span&gt;
            DetourTransactionBegin();
            DetourUpdateThread(GetCurrentThread());
            DetourAttach(&amp;amp;(PVOID&amp;amp;)pIsDebuggerPresent, HookedIsDebuggerPresent);
            DetourTransactionCommit();
        }
    }
    &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }
    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC804;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &lt;code&gt;No debugger found.&lt;/code&gt; &amp;#xAC00; &amp;#xCD9C;&amp;#xB825;&amp;#xB418;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xC6B0;&amp;#xC57C;&amp;#x2026; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBABB;&amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;1b18ed6b-05c4-4b20-a412-522bd1c12bb3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; API &amp;#xD6C4;&amp;#xD0B9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NtQueryInformationProcess()&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;strong&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD6C4;&amp;#xD0B9;&lt;/strong&gt;&amp;#xD558;&amp;#xAC70;&amp;#xB098;&lt;/li&gt;
&lt;li&gt;PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xB4F1; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB418;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&lt;/strong&gt; &lt;strong&gt;&amp;#xC218;&amp;#xC815;&lt;/strong&gt;&amp;#xD574;&amp;#xC11C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC12;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5ED;&amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &lt;strong&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/strong&gt;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD55C; &amp;#xBC88; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xB9E4;&amp;#xBC88; &amp;#xC6B0;&amp;#xD68C;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xBCF4;&amp;#xB2E4; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xC751;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA70; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB290;&amp;#xAEF4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;! &lt;/p&gt;
&lt;h2 id=&#34;Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;h3 id=&#34;1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;-1&#34;&gt;&lt;a href=&#34;#1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;-1&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;/a&gt;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/h3&gt;&lt;p&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2E4;&amp;#xC2B5;&amp;#xB3C4; &amp;#x201C;Part 1&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB358; Timing &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; x86&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;string.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdint.h&amp;gt; &lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;decryptKey&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* key)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-built_in&#34;&gt;strlen&lt;/span&gt;(key); i++) {
        key[i] = key[i]&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Ceaser &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/span&gt;
    }
}

&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;processImportantData&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* key)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Processing important data with key: %s\n&amp;quot;&lt;/span&gt;, key);
    &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/span&gt;
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Important data processed successfully!\n&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; key[] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;nztfdsfulfz&amp;quot;&lt;/span&gt;;

    &lt;span class=&#34;hljs-comment&#34;&gt;// [1] &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE34; &amp;#xC2DC;&amp;#xAC04; &amp;#xC18C;&amp;#xC694; &amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; start_time = GetTickCount64();
    decryptKey(key);
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; end_time = GetTickCount64();

    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; elapsed_time = end_time - start_time;

    &lt;span class=&#34;hljs-comment&#34;&gt;// [2] 1&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (elapsed_time &amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;1000&lt;/span&gt;) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xCF54;&amp;#xB4DC; &amp;#xC885;&amp;#xB8CC;&lt;/span&gt;
    }

    &lt;span class=&#34;hljs-comment&#34;&gt;// [3] &amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1; &amp;#xC2E4;&amp;#xD589;: &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xC0C1; &amp;#xB3D9;&amp;#xC791; &amp;#xC5EC;&amp;#xBD80; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-built_in&#34;&gt;strcmp&lt;/span&gt;(key, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;mysecretkey&amp;quot;&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        processImportantData(key);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Invalid key!\n&amp;quot;&lt;/span&gt;);
    }

    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;, &amp;#xC989; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;([1]).  &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;, &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC5EC; ([2]) &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; ([3]) &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC798;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &lt;code&gt;Important data processed successfully!&lt;/code&gt; &amp;#xAC00; &amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xD6C4; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C;&amp;#xAC74; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB2C8; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; Break Point(&amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;: F2)&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(F9)&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. Step Into(F7)&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF8; &amp;#xD6C4; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545; &amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xB728;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;2f9db531-4021-4c69-9805-b40c8cb60ee0.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB85D; &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC77C;&amp;#xC9C0;&amp;#xB77C;&amp;#xB3C4;, &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC12;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC12;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xAC15;&amp;#xC81C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5B4; &amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAE30;&amp;#xC220; &amp;#xC219;&amp;#xB828;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCF4;&amp;#xD638; &amp;#xC218;&amp;#xC900;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xBBC0;&amp;#xB85C;, &amp;#xACE0;&amp;#xB3C4;&amp;#xC758; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB354;&amp;#xC6B1; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xD328;&amp;#xCE58;-Bypass-Dynamic-Anti-Debugging&#34;&gt;&lt;a href=&#34;#2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xD328;&amp;#xCE58;-Bypass-Dynamic-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;2. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD328;&amp;#xCE58; (Bypass Dynamic Anti-Debugging)&#34;&gt;&lt;/a&gt;2. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD328;&amp;#xCE58; (Bypass Dynamic Anti-Debugging)&lt;/h3&gt;&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; 2&amp;#xAC1C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2460; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;GetTickCount64()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xD328;&amp;#xCE58;&lt;ol&gt;
&lt;li&gt;NOP&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xD328;&amp;#xCE58; &amp;#xB4F1;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;if (elapsed_time &amp;gt; 1000)&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &lt;code&gt;if (elapsed_time &amp;lt; 0)&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &lt;strong&gt;&amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC870;&amp;#xAC74;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&lt;ul&gt;
&lt;li&gt;&amp;#xB610;&amp;#xB294; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2461; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC885;&amp;#xB8CC; &amp;#xBC29;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;printf(&amp;quot;Debugger detected!\n&amp;quot;); return 1;&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &lt;code&gt;return 1;&lt;/code&gt;&amp;#xC744; &lt;strong&gt;NOP(0x90)&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C;&amp;#xC640; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD55C;&amp;#xBC88; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; 16&amp;#xBC88;&amp;#xC9F8; &amp;#xC904;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; 0x00271E8E&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; CF&amp;#xC640; ZF&amp;#xAC00; 0&amp;#xC774;&amp;#xBA74;, &amp;#xC989; &lt;code&gt;elapsed_time&lt;/code&gt;&amp;#xC774; 1&amp;#xCD08;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC9E7;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC800;&amp;#xB294; jbe&amp;#xB97C; ja&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xC11C; 1&amp;#xCD08;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE38;&amp;#xB54C;&amp;#xB9CC; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 16&amp;#xBC88;&amp;#xC9F8; &amp;#xC904;&amp;#xC744; &amp;#xB204;&amp;#xB978; &amp;#xD6C4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; 2&amp;#xAC1C;&amp;#xC758; jump &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; NOP&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; ja&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC544;&amp;#xAE4C;&amp;#xCC98;&amp;#xB7FC; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; Break Point&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; 1&amp;#xCD08;&amp;#xB97C; &amp;#xB118;&amp;#xAE34; &amp;#xD6C4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;F9&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xB358; Break Point&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &lt;code&gt;decryptKey&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB05D;&amp;#xB0B8; &amp;#xD6C4; &amp;#xACC4;&amp;#xC18D; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; 2&amp;#xBC88;&amp;#xC9F8; BP&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2015.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;2&amp;#xBC88;&amp;#xC9F8; BP&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x201C;Edit&amp;gt;Patch Program&amp;gt;Assemble&amp;#x201C; &amp;#xC744; &amp;#xD1B5;&amp;#xD574; jbe&amp;#xB97C; ja&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC8FC;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD568;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2016.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774;&amp;#xBC88; &amp;#xC2E4;&amp;#xC2B5;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CF&lt;/code&gt;, &lt;code&gt;ZF&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; GetTickCount() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD6C4;&amp;#xD0B9;&amp;#xD574;&amp;#xC11C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xB9CC;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xAC80;&amp;#xC0AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;Debug_part2.jpg&#34; alt=&#34;Debug_part2.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6B0;&amp;#xD68C;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#x201C;&amp;#xD568;&amp;#xC815;&amp;#xCE74;&amp;#xB4DC;&amp;#x201D;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC548; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB9C9;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Debugger&amp;#xB97C; &amp;#xB9C9;&amp;#xB294; Anti-Debugging &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294;&amp;#xAC78; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Debugging &lt;del&gt;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Anti-Debugging &amp;#xC744; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Anti-Anti tititi &amp;#xD504;&amp;#xB808;&amp;#xC9C8;&amp;#xD504;&amp;#xB808;&amp;#xC9C8;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;Anti-Fragile.gif&#34; alt=&#34;~~&amp;#xC548;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;~~&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBB34;&amp;#xB2E8; &amp;#xBCF5;&amp;#xC81C;, &amp;#xD06C;&amp;#xB799;, &amp;#xC545;&amp;#xC6A9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD2B9;&amp;#xD788; &amp;#xAE08;&amp;#xC735;&amp;#xB7;&amp;#xAC8C;&amp;#xC784;&amp;#xB7;&amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488; &amp;#xB4F1; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. (CTF&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC885;&amp;#xC885; &amp;#xCD9C;&amp;#xC81C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!) &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xC131;&amp;#xACFC; &amp;#xD568;&amp;#xAED8;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xB300;&amp;#xC751;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB192;&amp;#xC740; &amp;#xC2E4;&amp;#xD6A8;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC624;&amp;#xB298; &amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xB4EF;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xD328;&amp;#xCE58;&amp;#xB098; API &amp;#xD6C4;&amp;#xD0B9; &amp;#xB4F1;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC54C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xAC74;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2017.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;???: &amp;#xADF8;&amp;#xB7FC; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB0D0;! / 000: &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;9o6emu.gif&#34; alt=&#34;9o6emu.gif&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C;&amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xD68C;&amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xD798;&amp;#xB4E0;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; Anti-Reversing &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xBC95;&amp;#xC778; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC640; &amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xBC95;&amp;#xC778; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC4F0;&amp;#xC774;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC644;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!)&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;a href=&#34;#&amp;#xC758;&amp;#xC758;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;/a&gt;&amp;#xC758;&amp;#xC758;&lt;/h2&gt;&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC740; &amp;#xB9C8;&amp;#xCE58; &amp;#xCC3D;&amp;#xACFC; &amp;#xBC29;&amp;#xD328;&amp;#xC758; &amp;#xC2F8;&amp;#xC6C0;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xB294; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xC744; &amp;#xC228;&amp;#xAE30;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC120;&amp;#xB7C9;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC740; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC9C0;&amp;#xC801; &amp;#xC7AC;&amp;#xC0B0;&amp;#xAD8C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xACE0; &amp;#xBD88;&amp;#xBC95; &amp;#xBCF5;&amp;#xC81C;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA70;, &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xACB0;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC601;&amp;#xD654;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xB294; &amp;#xC601;&amp;#xC6C5;&amp;#xACFC; &amp;#xC545;&amp;#xB2F9;&amp;#xC758; &amp;#xC2F8;&amp;#xC6C0;&amp;#xCC98;&amp;#xB7FC; &amp;#xB290;&amp;#xAEF4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC640; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC640; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC2F8;&amp;#xC6C0;&amp;#xC774;&amp;#xC8E0;. &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xAE30;&amp;#xC220; &amp;#xC790;&amp;#xCCB4;&amp;#xC758; &amp;#xC120;&amp;#xC545;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xC724;&amp;#xB9AC;&amp;#xC801; &amp;#xCC45;&amp;#xC784;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC138;&amp;#xC0C1;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xACFC;&amp;#xC81C;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2018.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xB354; &amp;#xC88B;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/p&gt;
&lt;p&gt;Detoures - &lt;a href=&#34;https://secmem.tistory.com/480&#34;&gt;https://secmem.tistory.com/480&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software&#34;&gt;https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis&#34;&gt;https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Anti-Debugging Part 2(KR) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F642;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0;&amp;#xB294; &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC881;&amp;#xD600;&amp;#xAC00;&amp;#xBA70; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;(&amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC9C1; &amp;#xBABB;&amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#x1F447; &amp;#x314E;&amp;#x314E;).&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/&#34;&gt;[Research] Anti-Debugging Part1(KR)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;Static&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;Dynamic&lt;/strong&gt; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Static&lt;/strong&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Dynamic&lt;/strong&gt; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC758; &amp;#xD589;&amp;#xB3D9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xBA70;, &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;h3 id=&#34;Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;a href=&#34;#Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34; class=&#34;headerlink&#34; title=&#34;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;/a&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&lt;/h3&gt;&lt;p&gt;Static &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;API Hooking&lt;/strong&gt;: &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; API&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; API &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0;, &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; &amp;#xD56D;&amp;#xC0C1; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;PEB &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;: PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;a href=&#34;#Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;&#34; class=&#34;headerlink&#34; title=&#34;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&#34;&gt;&lt;/a&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C;&lt;/h3&gt;&lt;p&gt;Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xD654;&amp;#xB098; &amp;#xB3D9;&amp;#xC801; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC6B0;&amp;#xD68C;&lt;/strong&gt;: &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xCE21;&amp;#xC815; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;: Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC608;&amp;#xC678; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC608;&amp;#xC678; &amp;#xCC98;&amp;#xB9AC; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;&amp;#xC2E4;&amp;#xC2B5;&lt;/h1&gt;&lt;p&gt;&amp;#xC790;! &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC2B5; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;: Windows 11&lt;/li&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;: 32&amp;#xBE44;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB3C4;&amp;#xAD6C;: IDA Freeware 8.4&lt;/li&gt;
&lt;li&gt;IDE: Visual Studio 2022&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; 32&amp;#xBE44;&amp;#xD2B8; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; IDA Freeware&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#Static-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;h3 id=&#34;1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;a href=&#34;#1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;/a&gt;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/h3&gt;&lt;p&gt;&amp;#x201C;Part 1&amp;#x201D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBD24;&amp;#xB4EF;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Visual Studio 2022&amp;#xC5D0;&amp;#xC11C; &amp;#xBE48; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xACE0; main.cpp&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4; x86&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }

    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; exe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD3F4;&amp;#xB354;(./Debug)&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &lt;code&gt;No debugger found.&lt;/code&gt; &amp;#xAC00; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA Freeware&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xC5D0; &amp;#xBD88;&amp;#xB7EC;&amp;#xC640; F9&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;..!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xBB38;&amp;#xC7A5;&amp;#xC774; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB9CC;&amp;#xC57D; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?! &amp;#xC774;&amp;#xC81C; &amp;#x201C;API Hooking&amp;#x201D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-API-Hooking-&amp;#xC2E4;&amp;#xC2B5;-Bypass-Static-Anti-Debugging&#34;&gt;&lt;a href=&#34;#2-API-Hooking-&amp;#xC2E4;&amp;#xC2B5;-Bypass-Static-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;2. API Hooking &amp;#xC2E4;&amp;#xC2B5; (Bypass Static Anti-Debugging)&#34;&gt;&lt;/a&gt;&lt;strong&gt;2. API Hooking &amp;#xC2E4;&amp;#xC2B5; (Bypass Static Anti-Debugging)&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;API Hooking &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; Microsoft Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; API &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xC228;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/microsoft/detours&#34;&gt;https://github.com/microsoft/detours&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xBC1B;&amp;#xC740; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xB123;&amp;#xC740; &amp;#xD6C4; &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Visual Studio 2022&amp;#xC5D0;&amp;#xC11C; &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC744; &amp;#xCF2D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;code&gt;nmake&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; bin, include, lib &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Visual Studio&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;gt;&amp;#xC18D;&amp;#xC131;&lt;/code&gt; &amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#x201C;&amp;#xBAA8;&amp;#xB4E0; &amp;#xAD6C;&amp;#xC131;&amp;#x201D;, &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC740; &amp;#x201C;Win32&amp;#x201D;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; Visual Studio&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;C/C++ &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC18D;&amp;#xC131; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;C/C++&amp;#x201D; &amp;#xD0ED;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;&amp;#xC77C;&amp;#xBC18;&amp;#x201D; &amp;#xD558;&amp;#xC704; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD56D;&amp;#xBAA9;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Detours&amp;#xC758; include &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt; &lt;code&gt;C:\Users\OUYA77\Desktop\Detours-main\include&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xD655;&amp;#xC778;&amp;#x201D; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB9C1;&amp;#xCEE4; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC18D;&amp;#xC131; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xB9C1;&amp;#xCEE4;&amp;#x201D; &amp;#xD0ED;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;&amp;#xC77C;&amp;#xBC18;&amp;#x201D; &amp;#xD558;&amp;#xC704; &amp;#xBA54;&amp;#xB274;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD56D;&amp;#xBAA9;&amp;#xC744; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xCD94;&amp;#xAC00; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#x201D; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Detours&amp;#xC758; lib &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt; &lt;code&gt;C:\Users\OUYA77\Desktop\Detours-main\lib&lt;/code&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#x201C;&amp;#xD655;&amp;#xC778;&amp;#x201D; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; dllmain.cpp&amp;#xB97C; &amp;#xC120;&amp;#xC5B8;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// dllmain.cpp&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;pragma&lt;/span&gt; comment(lib, &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;detours.lib&amp;quot;&lt;/span&gt;)&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C; Detours&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &lt;strong&gt;&lt;code&gt;IsDebuggerPresent()&lt;/code&gt;&lt;/strong&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xC5EC; Static Anti-Debugging &amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;detours.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// IsDebuggerPresent() &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;BOOL WINAPI &lt;span class=&#34;hljs-title&#34;&gt;HookedIsDebuggerPresent&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FALSE; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD56D;&amp;#xC0C1; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xB2F5;&lt;/span&gt;
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-comment&#34;&gt;// IsDebuggerPresent() &amp;#xD568;&amp;#xC218;&amp;#xB97C; Hooking&lt;/span&gt;
    HMODULE hKernel32 = GetModuleHandleA(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernel32.dll&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (hKernel32) {
        FARPROC pIsDebuggerPresent = GetProcAddress(hKernel32, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;IsDebuggerPresent&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pIsDebuggerPresent) {
            &lt;span class=&#34;hljs-comment&#34;&gt;// Detours &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Hooking&lt;/span&gt;
            DetourTransactionBegin();
            DetourUpdateThread(GetCurrentThread());
            DetourAttach(&amp;amp;(PVOID&amp;amp;)pIsDebuggerPresent, HookedIsDebuggerPresent);
            DetourTransactionCommit();
        }
    }
    &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }
    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD6C4; &amp;#xC804;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &lt;code&gt;No debugger found.&lt;/code&gt; &amp;#xAC00; &amp;#xCD9C;&amp;#xB825;&amp;#xB418;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xC6B0;&amp;#xC57C;&amp;#x2026; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBABB;&amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;1b18ed6b-05c4-4b20-a412-522bd1c12bb3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; API &amp;#xD6C4;&amp;#xD0B9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;NtQueryInformationProcess()&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;strong&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD6C4;&amp;#xD0B9;&lt;/strong&gt;&amp;#xD558;&amp;#xAC70;&amp;#xB098;&lt;/li&gt;
&lt;li&gt;PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xB4F1; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB418;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&lt;/strong&gt; &lt;strong&gt;&amp;#xC218;&amp;#xC815;&lt;/strong&gt;&amp;#xD574;&amp;#xC11C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xCE5C;&amp;#xAD6C;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC12;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5ED;&amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &lt;strong&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/strong&gt;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? Static &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD55C; &amp;#xBC88; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;, Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xB9E4;&amp;#xBC88; &amp;#xC6B0;&amp;#xD68C;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xBCF4;&amp;#xB2E4; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xC751;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA70; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB290;&amp;#xAEF4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xC8E0;! &lt;/p&gt;
&lt;h2 id=&#34;Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#Dynamic-&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-&amp;#xAE30;&amp;#xBC95;-&amp;#xC6B0;&amp;#xD68C;-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC6B0;&amp;#xD68C; &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;h3 id=&#34;1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;-1&#34;&gt;&lt;a href=&#34;#1-&amp;#xC77C;&amp;#xBC18;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;-1&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&#34;&gt;&lt;/a&gt;1. &amp;#xC77C;&amp;#xBC18; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/h3&gt;&lt;p&gt;Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2E4;&amp;#xC2B5;&amp;#xB3C4; &amp;#x201C;Part 1&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xB358; Timing &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; x86&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// main.cpp&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;string.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdint.h&amp;gt; &lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;decryptKey&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* key)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-built_in&#34;&gt;strlen&lt;/span&gt;(key); i++) {
        key[i] = key[i]&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Ceaser &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/span&gt;
    }
}

&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;processImportantData&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* key)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Processing important data with key: %s\n&amp;quot;&lt;/span&gt;, key);
    &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/span&gt;
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Important data processed successfully!\n&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; key[] = &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;nztfdsfulfz&amp;quot;&lt;/span&gt;;

    &lt;span class=&#34;hljs-comment&#34;&gt;// [1] &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;: &amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE34; &amp;#xC2DC;&amp;#xAC04; &amp;#xC18C;&amp;#xC694; &amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; start_time = GetTickCount64();
    decryptKey(key);
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; end_time = GetTickCount64();

    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; elapsed_time = end_time - start_time;

    &lt;span class=&#34;hljs-comment&#34;&gt;// [2] 1&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (elapsed_time &amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;1000&lt;/span&gt;) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xCF54;&amp;#xB4DC; &amp;#xC885;&amp;#xB8CC;&lt;/span&gt;
    }

    &lt;span class=&#34;hljs-comment&#34;&gt;// [3] &amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1; &amp;#xC2E4;&amp;#xD589;: &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xC0C1; &amp;#xB3D9;&amp;#xC791; &amp;#xC5EC;&amp;#xBD80; &amp;#xD310;&amp;#xB2E8;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-built_in&#34;&gt;strcmp&lt;/span&gt;(key, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;mysecretkey&amp;quot;&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        processImportantData(key);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Invalid key!\n&amp;quot;&lt;/span&gt;);
    }

    system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;pause&amp;quot;&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;, &amp;#xC989; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;([1]).  &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;, &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC5EC; ([2]) &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; ([3]) &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC798;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &lt;code&gt;Important data processed successfully!&lt;/code&gt; &amp;#xAC00; &amp;#xCD9C;&amp;#xB825;&amp;#xC774; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xD6C4; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C;&amp;#xAC74; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB2C8; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; Break Point(&amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;: F2)&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(F9)&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. Step Into(F7)&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF8; &amp;#xD6C4; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545; &amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xBCF4;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xB728;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;2f9db531-4021-4c69-9805-b40c8cb60ee0.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xB85D; &amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC77C;&amp;#xC9C0;&amp;#xB77C;&amp;#xB3C4;, &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC12;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC12;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xAC15;&amp;#xC81C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5B4; &amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAE30;&amp;#xC220; &amp;#xC219;&amp;#xB828;&amp;#xB3C4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCF4;&amp;#xD638; &amp;#xC218;&amp;#xC900;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xBBC0;&amp;#xB85C;, &amp;#xACE0;&amp;#xB3C4;&amp;#xC758; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB354;&amp;#xC6B1; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xD328;&amp;#xCE58;-Bypass-Dynamic-Anti-Debugging&#34;&gt;&lt;a href=&#34;#2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xD328;&amp;#xCE58;-Bypass-Dynamic-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;2. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD328;&amp;#xCE58; (Bypass Dynamic Anti-Debugging)&#34;&gt;&lt;/a&gt;2. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD328;&amp;#xCE58; (Bypass Dynamic Anti-Debugging)&lt;/h3&gt;&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; 2&amp;#xAC1C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2460; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;GetTickCount64()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xD328;&amp;#xCE58;&lt;ol&gt;
&lt;li&gt;NOP&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xD328;&amp;#xCE58; &amp;#xB4F1;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;if (elapsed_time &amp;gt; 1000)&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &lt;code&gt;if (elapsed_time &amp;lt; 0)&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &lt;strong&gt;&amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC870;&amp;#xAC74;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&lt;ul&gt;
&lt;li&gt;&amp;#xB610;&amp;#xB294; &lt;code&gt;jmp&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2461; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC885;&amp;#xB8CC; &amp;#xBC29;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;printf(&amp;quot;Debugger detected!\n&amp;quot;); return 1;&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &lt;code&gt;return 1;&lt;/code&gt;&amp;#xC744; &lt;strong&gt;NOP(0x90)&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C;&amp;#xC640; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&amp;#xAE4C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC0C1; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD55C;&amp;#xBC88; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; 16&amp;#xBC88;&amp;#xC9F8; &amp;#xC904;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; 0x00271E8E&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; CF&amp;#xC640; ZF&amp;#xAC00; 0&amp;#xC774;&amp;#xBA74;, &amp;#xC989; &lt;code&gt;elapsed_time&lt;/code&gt;&amp;#xC774; 1&amp;#xCD08;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC9E7;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC800;&amp;#xB294; jbe&amp;#xB97C; ja&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xC11C; 1&amp;#xCD08;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE38;&amp;#xB54C;&amp;#xB9CC; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 16&amp;#xBC88;&amp;#xC9F8; &amp;#xC904;&amp;#xC744; &amp;#xB204;&amp;#xB978; &amp;#xD6C4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; 2&amp;#xAC1C;&amp;#xC758; jump &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; NOP&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; ja&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC544;&amp;#xAE4C;&amp;#xCC98;&amp;#xB7FC; &amp;#xD0A4; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; Break Point&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; 1&amp;#xCD08;&amp;#xB97C; &amp;#xB118;&amp;#xAE34; &amp;#xD6C4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;F9&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xB358; Break Point&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &lt;code&gt;decryptKey&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB05D;&amp;#xB0B8; &amp;#xD6C4; &amp;#xACC4;&amp;#xC18D; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; 2&amp;#xBC88;&amp;#xC9F8; BP&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2015.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;2&amp;#xBC88;&amp;#xC9F8; BP&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x201C;Edit&amp;gt;Patch Program&amp;gt;Assemble&amp;#x201C; &amp;#xC744; &amp;#xD1B5;&amp;#xD574; jbe&amp;#xB97C; ja&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC8FC;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD568;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2016.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774;&amp;#xBC88; &amp;#xC2E4;&amp;#xC2B5;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CF&lt;/code&gt;, &lt;code&gt;ZF&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098; GetTickCount() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD6C4;&amp;#xD0B9;&amp;#xD574;&amp;#xC11C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xB9CC;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xB514;&amp;#xBC84;&amp;#xAC70; &amp;#xAC80;&amp;#xC0AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;Debug_part2.jpg&#34; alt=&#34;Debug_part2.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xC2E4;&amp;#xC2B5;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6B0;&amp;#xD68C;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB4E4;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#x201C;&amp;#xD568;&amp;#xC815;&amp;#xCE74;&amp;#xB4DC;&amp;#x201D;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC548; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB9C9;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Debugger&amp;#xB97C; &amp;#xB9C9;&amp;#xB294; Anti-Debugging &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294;&amp;#xAC78; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Debugging &lt;del&gt;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Anti-Debugging &amp;#xC744; &amp;#xB9C9;&amp;#xB294; Anti-Anti-Anti-Anti tititi &amp;#xD504;&amp;#xB808;&amp;#xC9C8;&amp;#xD504;&amp;#xB808;&amp;#xC9C8;&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;Anti-Fragile.gif&#34; alt=&#34;~~&amp;#xC548;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;~~&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD2F0;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&amp;#xD504;&amp;#xB798;&amp;#xC9C8;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBB34;&amp;#xB2E8; &amp;#xBCF5;&amp;#xC81C;, &amp;#xD06C;&amp;#xB799;, &amp;#xC545;&amp;#xC6A9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD2B9;&amp;#xD788; &amp;#xAE08;&amp;#xC735;&amp;#xB7;&amp;#xAC8C;&amp;#xC784;&amp;#xB7;&amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488; &amp;#xB4F1; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. (CTF&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC885;&amp;#xC885; &amp;#xCD9C;&amp;#xC81C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!) &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xC131;&amp;#xACFC; &amp;#xD568;&amp;#xAED8;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xB300;&amp;#xC751;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB192;&amp;#xC740; &amp;#xC2E4;&amp;#xD6A8;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC624;&amp;#xB298; &amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xB4EF;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xD328;&amp;#xCE58;&amp;#xB098; API &amp;#xD6C4;&amp;#xD0B9; &amp;#xB4F1;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC54C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xAC74;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2017.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;???: &amp;#xADF8;&amp;#xB7FC; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB0D0;! / 000: &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;9o6emu.gif&#34; alt=&#34;9o6emu.gif&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C;&amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xD68C;&amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xD798;&amp;#xB4E0;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; Anti-Reversing &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xBC95;&amp;#xC778; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC640; &amp;#xB3D9;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xBC95;&amp;#xC778; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xC4F0;&amp;#xC774;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC5B4;&amp;#xB835;&amp;#xACE0; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC644;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!)&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;a href=&#34;#&amp;#xC758;&amp;#xC758;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;/a&gt;&amp;#xC758;&amp;#xC758;&lt;/h2&gt;&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC740; &amp;#xB9C8;&amp;#xCE58; &amp;#xCC3D;&amp;#xACFC; &amp;#xBC29;&amp;#xD328;&amp;#xC758; &amp;#xC2F8;&amp;#xC6C0;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xB294; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xC744; &amp;#xC228;&amp;#xAE30;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC120;&amp;#xB7C9;&amp;#xD55C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC740; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC9C0;&amp;#xC801; &amp;#xC7AC;&amp;#xC0B0;&amp;#xAD8C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xACE0; &amp;#xBD88;&amp;#xBC95; &amp;#xBCF5;&amp;#xC81C;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA70;, &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xACB0;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC601;&amp;#xD654;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xB294; &amp;#xC601;&amp;#xC6C5;&amp;#xACFC; &amp;#xC545;&amp;#xB2F9;&amp;#xC758; &amp;#xC2F8;&amp;#xC6C0;&amp;#xCC98;&amp;#xB7FC; &amp;#xB290;&amp;#xAEF4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC640; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC640; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC2F8;&amp;#xC6C0;&amp;#xC774;&amp;#xC8E0;. &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xAE30;&amp;#xC220; &amp;#xC790;&amp;#xCCB4;&amp;#xC758; &amp;#xC120;&amp;#xC545;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xC724;&amp;#xB9AC;&amp;#xC801; &amp;#xCC45;&amp;#xC784;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC138;&amp;#xC0C1;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xACFC;&amp;#xC81C;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2018.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xB354; &amp;#xC88B;&amp;#xC740; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/p&gt;
&lt;p&gt;Detoures - &lt;a href=&#34;https://secmem.tistory.com/480&#34;&gt;https://secmem.tistory.com/480&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software&#34;&gt;https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis&#34;&gt;https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/03/24/OUYA77/Anti_part2/kr/Debug_part2.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/03/24/ouya77/anti_part2/kr/">

  <title>[Research] Anti-Debugging Part 2(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-03-24 00:45" pubdate>
      2025 3 24 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      92
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Anti-Debugging Part 2(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; OUYA77 &#xC785;&#xB2C8;&#xB2E4;. &#x1F642;</p>
<p>&#xC9C0;&#xB09C; &#xC2DC;&#xAC04;&#xC5D0;&#xB294; </p>
<ul>
<li>&#xB514;&#xBC84;&#xAE45;: &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xB294; &#xACF3;&#xC744; &#xCC3E;&#xC544;&#xC11C; &#xBC94;&#xC704;&#xB97C; &#xC881;&#xD600;&#xAC00;&#xBA70; &#xC6D0;&#xC778;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xACFC;&#xC815;</li>
<li>&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;: &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xAC70;&#xB098; &#xADF8; &#xB3D9;&#xC791;&#xC744; &#xBC29;&#xD574;&#xD558;&#xC5EC;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC5ED;&#xACF5;&#xD559; &#xBC0F; &#xBD84;&#xC11D;&#xC5D0; &#xCDE8;&#xC57D;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xAE30;&#xBC95;</li>
</ul>
<p>&#xC744; &#xACF5;&#xBD80;&#xD588;&#xC5C8;&#xC8E0;(&#xD639;&#xC2DC; &#xC544;&#xC9C1; &#xBABB;&#xBCF4;&#xC168;&#xB2E4;&#xBA74; &#x1F447; &#x314E;&#x314E;).</p>
<p><em>&#xC9C0;&#xB09C; &#xD30C;&#xD2B8; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</em></p>
<p><a href="https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/">[Research] Anti-Debugging Part1(KR)</a></p>
<p>&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC5D0;&#xC11C;&#xB294; <strong>Static</strong>&#xACFC; <strong>Dynamic</strong> &#xB450; &#xAC00;&#xC9C0; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. <strong>Static</strong> &#xAE30;&#xBC95;&#xC740; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC5F0;&#xACB0;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4;&#xB098; API&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, Windows&#xC5D0;&#xC11C;&#xB294; <code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <strong>Dynamic</strong> &#xAE30;&#xBC95;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xC911;&#xC758; &#xD589;&#xB3D9; &#xD328;&#xD134;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xBA70;, &#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xACFC; &#xAC19;&#xC740; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xBC29;&#xBC95;"><a href="#&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xBC29;&#xBC95;" class="headerlink" title="&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xBC29;&#xBC95;"></a>&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xBC29;&#xBC95;</h2><h3 id="Static-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;"><a href="#Static-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;" class="headerlink" title="Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C;"></a>Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C;</h3><p>Static &#xAE30;&#xBC95;&#xC740; &#xAD6C;&#xD604;&#xC774; &#xAC04;&#xB2E8;&#xD558;&#xC9C0;&#xB9CC;, &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xC27D;&#xAC8C; &#xC6B0;&#xD68C;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>API Hooking</strong>: &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xB294; API&#xB97C; Hooking&#xD558;&#xC5EC; API &#xD638;&#xCD9C;&#xC744; &#xAC00;&#xB85C;&#xCC44;&#xACE0;, &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xC228;&#xAE38; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, Windows&#xC5D0;&#xC11C; <code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xB97C; Hooking&#xD558;&#xC5EC; &#xD56D;&#xC0C1; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xC5C6;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC751;&#xB2F5;&#xD558;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>PEB &#xAD6C;&#xC870;&#xCCB4; &#xC870;&#xC791;</strong>: PEB&#xC758; <code>BeingDebugged</code> &#xD544;&#xB4DC;&#xB97C; &#xC9C1;&#xC811; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xC228;&#xAE38; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<h3 id="Dynamic-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;"><a href="#Dynamic-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;" class="headerlink" title="Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C;"></a>Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C;</h3><p>Dynamic &#xAE30;&#xBC95;&#xC740; &#xC2E4;&#xD589; &#xC911;&#xC5D0; &#xD658;&#xACBD; &#xBCC0;&#xD654;&#xB098; &#xB3D9;&#xC801; &#xC870;&#xAC74;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB3D9;&#xC791;&#xD558;&#xBBC0;&#xB85C;, &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB7F0;&#xD0C0;&#xC784; &#xC0C1;&#xD669;&#xC744; &#xCDA9;&#xBD84;&#xD788; &#xC774;&#xD574;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xD68C; &#xBC29;&#xBC95;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC6B0;&#xD68C;</strong>: &#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xCE21;&#xC815;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574;, IDA&#xC640; &#xAC19;&#xC740; &#xB514;&#xBC84;&#xAE45; &#xD234;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xCF54;&#xB4DC;&#xB97C; &#xD328;&#xCE58;&#xD558;&#xC5EC; &#xD0C0;&#xC774;&#xBC0D; &#xCE21;&#xC815; &#xCF54;&#xB4DC;&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC608;&#xC678; &#xCC98;&#xB9AC; &#xC870;&#xC791;</strong>: Dynamic &#xAE30;&#xBC95;&#xC740; &#xC608;&#xC678; &#xBC1C;&#xC0DD; &#xC2DC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xD0D0;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574;, &#xC608;&#xC678; &#xCC98;&#xB9AC; &#xB8E8;&#xD2F4;&#xC744; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xC228;&#xAE38; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<h1 id="&#xC2E4;&#xC2B5;"><a href="#&#xC2E4;&#xC2B5;" class="headerlink" title="&#xC2E4;&#xC2B5;"></a>&#xC2E4;&#xC2B5;</h1><p>&#xC790;! &#xADF8;&#xB7EC;&#xBA74; &#xC774;&#xC81C; &#xC2E4;&#xC2B5;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xC2E4;&#xC2B5; &#xD658;&#xACBD;</strong></p>
<ul>
<li>&#xC6B4;&#xC601;&#xCCB4;&#xC81C;: Windows 11</li>
<li>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC544;&#xD0A4;&#xD14D;&#xCC98;: 32&#xBE44;&#xD2B8;</li>
<li>&#xB514;&#xBC84;&#xAE45; &#xB3C4;&#xAD6C;: IDA Freeware 8.4</li>
<li>IDE: Visual Studio 2022</li>
</ul>
<p>&#xC774; &#xD658;&#xACBD;&#xC5D0;&#xC11C; 32&#xBE44;&#xD2B8; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBE4C;&#xB4DC;&#xD558;&#xACE0; IDA Freeware&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC774; &#xC801;&#xC6A9;&#xB41C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xB300;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC2E4;&#xC2B5;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="Static-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xC2E4;&#xC2B5;"><a href="#Static-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xC2E4;&#xC2B5;" class="headerlink" title="Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xC2E4;&#xC2B5;"></a>Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xC2E4;&#xC2B5;</h2><h3 id="1-&#xC77C;&#xBC18;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;"><a href="#1-&#xC77C;&#xBC18;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;" class="headerlink" title="1. &#xC77C;&#xBC18; &#xD504;&#xB85C;&#xADF8;&#xB7A8;"></a>1. &#xC77C;&#xBC18; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</h3><p>&#x201C;Part 1&#x201D;&#xC5D0;&#xC11C;&#xB3C4; &#xBD24;&#xB4EF;&#xC774; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC774; &#xC801;&#xC6A9;&#xB41C; &#xC77C;&#xBC18; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Visual Studio 2022&#xC5D0;&#xC11C; &#xBE48; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC8FC;&#xC2DC;&#xACE0; main.cpp&#xB97C; &#xB9CC;&#xB4E0; &#xD6C4; x86&#xC73C;&#xB85C; &#xBE4C;&#xB4DC;&#xD574;&#xC8FC;&#xC138;&#xC694;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<pre><code class="hljs c"><span class="hljs-comment">// main.cpp</span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span> </span>{
    <span class="hljs-keyword">if</span> (IsDebuggerPresent()) {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger detected!\n&quot;</span>);
    }
    <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;No debugger found.\n&quot;</span>);
    }

    system(<span class="hljs-string">&quot;pause&quot;</span>);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p>&#xBE4C;&#xB4DC; &#xD6C4; exe&#xAC00; &#xC0DD;&#xC131;&#xB41C; &#xD3F4;&#xB354;(./Debug)&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; &#xBE4C;&#xB4DC;&#xB41C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; <code>No debugger found.</code> &#xAC00; &#xB739;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774;&#xC81C; IDA Freeware&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB514;&#xBC84;&#xAE45;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. IDA&#xC5D0; &#xBD88;&#xB7EC;&#xC640; F9&#xB97C; &#xB20C;&#xB7EC; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xBA74;..!!</p>
<p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC704;&#xC640; &#xAC19;&#xC774; <code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xC5D0; &#xC758;&#xD574; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xAC10;&#xC9C0;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xBB38;&#xC7A5;&#xC774; &#xB098;&#xC635;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB294; <code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD0D0;&#xC9C0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xB9CC;&#xC57D; &#xC774; &#xD568;&#xC218;&#xAC00; &#xC81C; &#xAE30;&#xB2A5;&#xC744; &#xBABB;&#xD55C;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;?! &#xC774;&#xC81C; &#x201C;API Hooking&#x201D;&#xC744; &#xD1B5;&#xD574; Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xC2E4;&#xC2B5;&#xC744; &#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-API-Hooking-&#xC2E4;&#xC2B5;-Bypass-Static-Anti-Debugging"><a href="#2-API-Hooking-&#xC2E4;&#xC2B5;-Bypass-Static-Anti-Debugging" class="headerlink" title="2. API Hooking &#xC2E4;&#xC2B5; (Bypass Static Anti-Debugging)"></a><strong>2. API Hooking &#xC2E4;&#xC2B5; (Bypass Static Anti-Debugging)</strong></h3><p>API Hooking &#xC2E4;&#xC2B5;&#xC740; Microsoft Detours &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xC9C4;&#xD589;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; Windows&#xC5D0;&#xC11C; API &#xD568;&#xC218;&#xB97C; Hooking&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xC228;&#xAE38; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC90D;&#xB2C8;&#xB2E4;. </p>
<p>&#xBA3C;&#xC800; Detours &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC124;&#xCE58;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<ol>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/microsoft/detours">https://github.com/microsoft/detours</a> &#xC5D0;&#xC11C; &#xC555;&#xCD95;&#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4;&#xBC1B;&#xC740; &#xD6C4;&#xC5D0; &#xC6D0;&#xD558;&#xB294; &#xD3F4;&#xB354;&#xC5D0; &#xB123;&#xC740; &#xD6C4; &#xD574;&#xC81C;&#xD574; &#xC8FC;&#xC138;&#xC694;.</p>
<p> <img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
<li><p>Visual Studio 2022&#xC5D0;&#xC11C; &#xD130;&#xBBF8;&#xB110;&#xC744; &#xCF2D;&#xB2C8;&#xB2E4;.</p>
<p> <img src="image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
<li><p><code>nmake</code> &#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xBE4C;&#xB4DC;&#xD558;&#xBA74; bin, include, lib &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xAC00; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p> <img src="image%205.png" srcset="/img/loading.gif" alt="image.png"></p>
<p> <img src="image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
</ol>
<ol>
<li><p>Visual Studio&#xC5D0;&#xC11C; <code>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&gt;&#xC18D;&#xC131;</code> &#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00; &#xAD6C;&#xC131;&#xC740; &#x201C;&#xBAA8;&#xB4E0; &#xAD6C;&#xC131;&#x201D;, &#xD50C;&#xB7AB;&#xD3FC;&#xC740; &#x201C;Win32&#x201D;&#xB85C; &#xBCC0;&#xACBD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p> <img src="image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
<li><p>Detours &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; Visual Studio&#xC5D0; &#xCD94;&#xAC00;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><strong>C/C++ &#xC18D;&#xC131;&#xC5D0;&#xC11C; &#xCD94;&#xAC00; &#xD3EC;&#xD568; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC124;&#xC815;</strong></p>
<ol>
<li>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC18D;&#xC131; &#xCC3D;&#xC5D0;&#xC11C; &#x201C;C/C++&#x201D; &#xD0ED;&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#x201C;&#xC77C;&#xBC18;&#x201D; &#xD558;&#xC704; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#x201C;&#xCD94;&#xAC00; &#xD3EC;&#xD568; &#xB514;&#xB809;&#xD130;&#xB9AC;&#x201D; &#xD56D;&#xBAA9;&#xC744; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><p>&#x201C;&#xCD94;&#xAC00; &#xD3EC;&#xD568; &#xB514;&#xB809;&#xD130;&#xB9AC;&#x201D; &#xD544;&#xB4DC;&#xC5D0;&#xC11C; Detours&#xC758; include &#xACBD;&#xB85C;&#xB97C; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;:</p>
<p> <code>C:\Users\OUYA77\Desktop\Detours-main\include</code></p>
</li>
<li><p>&#x201C;&#xD655;&#xC778;&#x201D; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xC5EC; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
</li>
<li><p><strong>&#xB9C1;&#xCEE4; &#xC18D;&#xC131;&#xC5D0;&#xC11C; &#xCD94;&#xAC00; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC124;&#xC815;</strong></p>
<ol>
<li>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC18D;&#xC131; &#xCC3D;&#xC5D0;&#xC11C; &#x201C;&#xB9C1;&#xCEE4;&#x201D; &#xD0ED;&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#x201C;&#xC77C;&#xBC18;&#x201D; &#xD558;&#xC704; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#x201C;&#xCD94;&#xAC00; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#x201D; &#xD56D;&#xBAA9;&#xC744; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><p>&#x201C;&#xCD94;&#xAC00; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#x201D; &#xD544;&#xB4DC;&#xC5D0;&#xC11C; Detours&#xC758; lib &#xACBD;&#xB85C;&#xB97C; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;:</p>
<p> <code>C:\Users\OUYA77\Desktop\Detours-main\lib</code></p>
</li>
<li><p>&#x201C;&#xD655;&#xC778;&#x201D; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xC5EC; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
</li>
</ul>
</li>
</ol>
<p>&#xB124; &#xC774;&#xC81C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC900;&#xBE44;&#xAC00; &#xB418;&#xC5C8;&#xC73C;&#xBA74; dllmain.cpp&#xB97C; &#xC120;&#xC5B8;&#xD574;&#xC8FC;&#xC138;&#xC694;.</p>
<pre><code class="hljs c"><span class="hljs-comment">// dllmain.cpp</span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">pragma</span> comment(lib, <span class="hljs-meta-string">&quot;detours.lib&quot;</span>)</span></code></pre>
<p>&#xC774;&#xC81C; &#xC9C4;&#xC9DC;&#xB85C; Detours&#xB97C; &#xC0AC;&#xC6A9;&#xD574; <strong><code>IsDebuggerPresent()</code></strong> &#xD568;&#xC218;&#xB97C; Hooking&#xD558;&#xC5EC; Static Anti-Debugging &#xC744; &#xC6B0;&#xD68C;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-comment">// main.cpp</span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;detours.h&gt;</span></span>

<span class="hljs-comment">// IsDebuggerPresent() &#xD568;&#xC218;&#xB97C; Hooking&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD568;&#xC218;</span>
<span class="hljs-function">BOOL WINAPI <span class="hljs-title">HookedIsDebuggerPresent</span><span class="hljs-params">()</span> </span>{
    <span class="hljs-keyword">return</span> FALSE; <span class="hljs-comment">// &#xD56D;&#xC0C1; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xC5C6;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC751;&#xB2F5;</span>
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span> </span>{
    <span class="hljs-comment">// IsDebuggerPresent() &#xD568;&#xC218;&#xB97C; Hooking</span>
    HMODULE hKernel32 = GetModuleHandleA(<span class="hljs-string">&quot;kernel32.dll&quot;</span>);
    <span class="hljs-keyword">if</span> (hKernel32) {
        FARPROC pIsDebuggerPresent = GetProcAddress(hKernel32, <span class="hljs-string">&quot;IsDebuggerPresent&quot;</span>);
        <span class="hljs-keyword">if</span> (pIsDebuggerPresent) {
            <span class="hljs-comment">// Detours &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; Hooking</span>
            DetourTransactionBegin();
            DetourUpdateThread(GetCurrentThread());
            DetourAttach(&amp;(PVOID&amp;)pIsDebuggerPresent, HookedIsDebuggerPresent);
            DetourTransactionCommit();
        }
    }
    <span class="hljs-comment">// &#xD14C;&#xC2A4;&#xD2B8;</span>
    <span class="hljs-keyword">if</span> (IsDebuggerPresent()) {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger detected!\n&quot;</span>);
    }
    <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;No debugger found.\n&quot;</span>);
    }
    system(<span class="hljs-string">&quot;pause&quot;</span>);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p>&#xC704; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xBE4C;&#xB4DC; &#xD6C4; &#xC804;&#xACFC; &#xAC19;&#xC774; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%208.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xB2F9;&#xC5F0;&#xD788; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xBD99;&#xC774;&#xC9C0; &#xC54A;&#xC740; &#xB85C;&#xCEEC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xBA74; <code>No debugger found.</code> &#xAC00; &#xCD9C;&#xB825;&#xB418;&#xC5B4;&#xC694;. &#xADF8;&#xB7FC; &#xC774;&#xC81C; IDA&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xBD99;&#xC774;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;!!</p>
<p><img src="image%209.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC624;&#xC6B0;&#xC57C;&#x2026; IDA&#xB97C; &#xD1B5;&#xD574; &#xB514;&#xBC84;&#xAE45; &#xC911;&#xC784;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xBABB;&#xCC3E;&#xC558;&#xB2E4;&#xACE0; &#xC2E4;&#xD589;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="1b18ed6b-05c4-4b20-a412-522bd1c12bb3.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774;&#xB807;&#xAC8C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; API &#xD6C4;&#xD0B9;&#xC744; &#xD1B5;&#xD574; Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC744; &#xBB34;&#xB825;&#xD654;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAD6C;&#xD604;&#xB41C; &#xAE30;&#xBC95;&#xC774;&#xAE30;&#xC5D0; </p>
<ul>
<li><code>NtQueryInformationProcess()</code> &#xC640; &#xAC19;&#xC774; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; <strong>&#xD568;&#xC218;&#xB97C; &#xD6C4;&#xD0B9;</strong>&#xD558;&#xAC70;&#xB098;</li>
<li>PEB&#xC758; <code>BeingDebugged</code> &#xD50C;&#xB798;&#xADF8; &#xB4F1; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xACFC; &#xAD00;&#xB828;&#xB418;&#xB294; &#xC815;&#xBCF4;&#xB97C; <strong>&#xBA54;&#xBAA8;&#xB9AC; &#xC0C1;&#xC5D0;&#xC11C; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C;</strong> <strong>&#xC218;&#xC815;</strong>&#xD574;&#xC11C; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<ul>
<li>&#xC774; &#xCE5C;&#xAD6C;&#xB4E4;&#xC740; &#xBCF4;&#xD1B5; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xAC12;&#xC774; &#xBCC0;&#xC870;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#xADF8;&#xB7EC;&#xBA74; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC6D0;&#xB9AC;&#xB97C; &#xC5ED;&#xC774;&#xC6A9;&#xD558;&#xB294; <strong>Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;</strong>&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? Static &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xD55C; &#xBC88; &#xD574;&#xC81C;&#xD558;&#xBA74; &#xC774;&#xD6C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB514;&#xBC84;&#xAE45;&#xC5D0; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xC9C0;&#xB9CC;, Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xC2E4;&#xD589; &#xC911; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC801;&#xC6A9;&#xB418;&#xBBC0;&#xB85C; &#xB9E4;&#xBC88; &#xC6B0;&#xD68C;&#xD574;&#xC57C; &#xD558;&#xAC70;&#xB098;, &#xBCF4;&#xB2E4; &#xADFC;&#xBCF8;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xB300;&#xC751;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xBA70; &#xCC28;&#xC774;&#xB97C; &#xB290;&#xAEF4;&#xBCF4;&#xC2DC;&#xC8E0;! </p>
<h2 id="Dynamic-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xC2E4;&#xC2B5;"><a href="#Dynamic-&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;-&#xAE30;&#xBC95;-&#xC6B0;&#xD68C;-&#xC2E4;&#xC2B5;" class="headerlink" title="Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xC2E4;&#xC2B5;"></a>Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC6B0;&#xD68C; &#xC2E4;&#xC2B5;</h2><h3 id="1-&#xC77C;&#xBC18;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;-1"><a href="#1-&#xC77C;&#xBC18;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;-1" class="headerlink" title="1. &#xC77C;&#xBC18; &#xD504;&#xB85C;&#xADF8;&#xB7A8;"></a>1. &#xC77C;&#xBC18; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</h3><p>Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xC2E4;&#xC2B5;&#xB3C4; &#x201C;Part 1&#x201D;&#xC5D0;&#xC11C; &#xC54C;&#xC544;&#xBD24;&#xB358; Timing &#xAE30;&#xBC18; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC758; &#xCF54;&#xB4DC;&#xB97C; x86&#xC73C;&#xB85C; &#xBE4C;&#xB4DC;&#xD574;&#xC8FC;&#xC138;&#xC694;.</p>
<pre><code class="hljs c"><span class="hljs-comment">// main.cpp</span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;string.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdint.h&gt; </span></span>

<span class="hljs-comment">// &#xD0A4; &#xBCF5;&#xD638;&#xD654; &#xD568;&#xC218;</span>
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">decryptKey</span><span class="hljs-params">(<span class="hljs-keyword">char</span>* key)</span> </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-built_in">strlen</span>(key); i++) {
        key[i] = key[i]<span class="hljs-number">-1</span>; <span class="hljs-comment">// &#xAC04;&#xB2E8;&#xD55C; Ceaser &#xC554;&#xD638;&#xD654;</span>
    }
}

<span class="hljs-comment">// &#xC911;&#xC694;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xD568;&#xC218;</span>
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">processImportantData</span><span class="hljs-params">(<span class="hljs-keyword">char</span>* key)</span> </span>{
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Processing important data with key: %s\n&quot;</span>, key);
    <span class="hljs-comment">// &#xAC04;&#xB2E8;&#xD55C; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</span>
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Important data processed successfully!\n&quot;</span>);
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span> </span>{
    <span class="hljs-keyword">char</span> key[] = <span class="hljs-string">&quot;nztfdsfulfz&quot;</span>;

    <span class="hljs-comment">// [1] &#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;: &#xD568;&#xC218; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC744; &#xCE21;&#xC815;&#xD558;&#xC5EC; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xAE34; &#xC2DC;&#xAC04; &#xC18C;&#xC694; &#xC2DC; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xBD99;&#xC5C8;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;</span>
    <span class="hljs-keyword">uint64_t</span> start_time = GetTickCount64();
    decryptKey(key);
    <span class="hljs-keyword">uint64_t</span> end_time = GetTickCount64();

    <span class="hljs-keyword">uint64_t</span> elapsed_time = end_time - start_time;

    <span class="hljs-comment">// [2] 1&#xCD08; &#xC774;&#xC0C1; &#xAC78;&#xB9AC;&#xBA74; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xBD99;&#xC5C8;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;</span>
    <span class="hljs-keyword">if</span> (elapsed_time &gt; <span class="hljs-number">1000</span>) {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger detected!\n&quot;</span>);
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>; <span class="hljs-comment">// &#xCF54;&#xB4DC; &#xC885;&#xB8CC;</span>
    }

    <span class="hljs-comment">// [3] &#xD0A4;&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xC911;&#xC694;&#xD55C; &#xB85C;&#xC9C1; &#xC2E4;&#xD589;: &#xBCF5;&#xD638;&#xD654;&#xB41C; &#xD0A4;&#xC640; &#xBE44;&#xAD50;&#xD558;&#xC5EC; &#xC815;&#xC0C1; &#xB3D9;&#xC791; &#xC5EC;&#xBD80; &#xD310;&#xB2E8;</span>
    <span class="hljs-keyword">if</span> (<span class="hljs-built_in">strcmp</span>(key, <span class="hljs-string">&quot;mysecretkey&quot;</span>) == <span class="hljs-number">0</span>) {
        processImportantData(key);
    }
    <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Invalid key!\n&quot;</span>);
    }

    system(<span class="hljs-string">&quot;pause&quot;</span>);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p>&#xC774; &#xCF54;&#xB4DC;&#xB294; &#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC911;&#xC694;&#xD55C; &#xB85C;&#xC9C1;, &#xC989; &#xD0A4; &#xBCF5;&#xD638;&#xD654; &#xB85C;&#xC9C1;&#xC744; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;([1]).  &#xB9CC;&#xC57D; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD0A4; &#xBCF5;&#xD638;&#xD654; &#xB85C;&#xC9C1;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD558;&#xBA74;, &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC758; &#xCC28;&#xC774;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC5EC; ([2]) &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;. &#xBC18;&#xB300;&#xB85C;, &#xC815;&#xC0C1;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; ([3]) &#xB85C;&#xC9C1;&#xC774; &#xBB38;&#xC81C;&#xC5C6;&#xC774; &#xC218;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xBE4C;&#xB4DC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<p><img src="image%2010.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xC774; &#xC798;&#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; <code>Important data processed successfully!</code> &#xAC00; &#xCD9C;&#xB825;&#xC774; &#xB418;&#xC9C0;&#xB9CC; &#xC774;&#xD6C4; &#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xC911;&#xC694;&#xD55C; &#xB85C;&#xC9C1;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB418;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB124; &#xC774;&#xC81C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD588;&#xC73C;&#xB2C8;&#xAE4C; IDA&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB300;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC2DC;&#xB3C4;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="image%2011.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC544;&#xBB34;&#xB798;&#xB3C4; &#xC800;&#xD76C;&#xAC00; &#xAD81;&#xAE08;&#xD55C;&#xAC74; &#xD0A4; &#xBCF5;&#xD638;&#xD654; &#xB85C;&#xC9C1;&#xC774;&#xB2C8; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xB294; &#xD568;&#xC218;&#xC5D0; Break Point(&#xB2E8;&#xCD95;&#xD0A4;: F2)&#xB97C; &#xAC78;&#xC5B4;&#xC11C; &#xB514;&#xBC84;&#xAE45;(F9)&#xC744; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;. Step Into(F7)&#xB85C; &#xD574;&#xB2F9; &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; &#xB85C;&#xC9C1;&#xC744; &#xBCF8; &#xD6C4; &#xC5B4;&#xB5BB;&#xAC8C; &#xBCF5;&#xD638;&#xD654;&#xB418;&#xB294;&#xC9C0; &#xD30C;&#xC545; &#xD6C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xACC4;&#xC18D; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C;&#xBCF4;&#xBA74;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xD0D0;&#xC9C0;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xB728;&#xBA74;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="2f9db531-4021-4c69-9805-b40c8cb60ee0.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xBE44;&#xB85D; &#xC9C0;&#xAE08;&#xC740; &#xB2E8;&#xC21C;&#xD55C; &#xC608;&#xC81C;&#xC77C;&#xC9C0;&#xB77C;&#xB3C4;, &#xC2E4;&#xD589;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xAC12;&#xC774; &#xBCC0;&#xACBD;&#xB41C;&#xB2E4;&#xBA74; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD1B5;&#xD574; &#xAC12;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xAC15;&#xC81C; &#xC885;&#xB8CC;&#xB418;&#xC5B4; &#xADF8; &#xAC12;&#xC744; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC0AC;&#xC6A9;&#xC790; &#xAE30;&#xC220; &#xC219;&#xB828;&#xB3C4;&#xC5D0; &#xB530;&#xB77C; &#xBCF4;&#xD638; &#xC218;&#xC900;&#xC774; &#xD06C;&#xAC8C; &#xB2EC;&#xB77C;&#xC9C0;&#xBBC0;&#xB85C;, &#xACE0;&#xB3C4;&#xC758; &#xAE30;&#xC220;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xBA74; &#xBD84;&#xC11D;&#xC744; &#xB354;&#xC6B1; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xD328;&#xCE58;-Bypass-Dynamic-Anti-Debugging"><a href="#2-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xD328;&#xCE58;-Bypass-Dynamic-Anti-Debugging" class="headerlink" title="2. &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD328;&#xCE58; (Bypass Dynamic Anti-Debugging)"></a>2. &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD328;&#xCE58; (Bypass Dynamic Anti-Debugging)</h3><p>&#xC704; &#xCF54;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC0C1; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC744; &#xD328;&#xCE58;&#xD558;&#xBA74; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? </p>
<p>&#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; 2&#xAC1C;&#xC758; &#xACBD;&#xC6B0;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xACA0;&#xC8E0;?</p>
<blockquote>
<p><strong>&#x2460; &#xD0C0;&#xC774;&#xBC0D; &#xCCB4;&#xD06C;&#xB97C; &#xBB34;&#xB825;&#xD654;</strong></p>
<ol>
<li><code>GetTickCount64()</code> &#xD568;&#xC218; &#xD638;&#xCD9C; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xC11C; &#xD328;&#xCE58;<ol>
<li>NOP&#xC73C;&#xB85C; &#xD574;&#xB2F9; &#xBA85;&#xB839;&#xC744; &#xBB34;&#xB825;&#xD654;&#xD558;&#xAC70;&#xB098; &#xD2B9;&#xC815;&#xD55C; &#xC0C1;&#xC218;&#xAC12;&#xC744; &#xBC18;&#xD658;&#xD558;&#xB294; &#xD568;&#xC218;&#xB85C; &#xD328;&#xCE58; &#xB4F1;</li>
</ol>
</li>
<li><code>if (elapsed_time &gt; 1000)</code> &#xBD80;&#xBD84;&#xC744; <code>if (elapsed_time &lt; 0)</code> &#xAC19;&#xC740; <strong>&#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xC870;&#xAC74;</strong>&#xC73C;&#xB85C; &#xBCC0;&#xACBD;<ul>
<li>&#xB610;&#xB294; <code>jmp</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD56D;&#xC0C1; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xC218;&#xC815;</li>
</ul>
</li>
</ol>
<p><strong>&#x2461; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC885;&#xB8CC; &#xBC29;&#xC9C0;</strong></p>
<p><code>printf(&quot;Debugger detected!\n&quot;); return 1;</code> &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xC11C; <code>return 1;</code>&#xC744; <strong>NOP(0x90)&#xB85C; &#xD328;&#xCE58;</strong></p>
</blockquote>
<p>&#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC5D0; &#xB530;&#xB77C; &#xBD84;&#xAE30;&#xBB38;&#xC774; &#xC2E4;&#xC81C;&#xC640; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC788;&#xC73C;&#xB2C8;&#xAE4C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC0C1; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xB294;&#xC9C0; IDA&#xB97C; &#xD1B5;&#xD574; &#xD55C;&#xBC88; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="image%2012.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC800;&#xB294; &#xC5EC;&#xAE30;&#xC11C; 16&#xBC88;&#xC9F8; &#xC904;&#xC744; &#xD328;&#xCE58;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#xC0C1;&#xC73C;&#xB85C;&#xB294; 0x00271E8E&#xC5D0; &#xC788;&#xB294; &#xCF54;&#xB4DC;&#xC778;&#xB370;&#xC694;. &#xC5EC;&#xAE30;&#xC11C; CF&#xC640; ZF&#xAC00; 0&#xC774;&#xBA74;, &#xC989; <code>elapsed_time</code>&#xC774; 1&#xCD08;&#xBCF4;&#xB2E4; &#xC9E7;&#xC544;&#xC57C; &#xD558;&#xB294;&#xB370; &#xC800;&#xB294; jbe&#xB97C; ja&#xB85C; &#xD328;&#xCE58;&#xD574;&#xC11C; 1&#xCD08;&#xBCF4;&#xB2E4; &#xAE38;&#xB54C;&#xB9CC; &#xD0A4;&#xB97C; &#xBCF4;&#xB294; &#xB85C;&#xC9C1;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. 16&#xBC88;&#xC9F8; &#xC904;&#xC744; &#xB204;&#xB978; &#xD6C4; &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; 2&#xAC1C;&#xC758; jump &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCCAB;&#xBC88;&#xC9F8; &#xBA85;&#xB839;&#xC5B4;&#xB294; NOP&#xC73C;&#xB85C; &#xD328;&#xCE58;&#xD558;&#xACE0; &#xB450;&#xBC88;&#xC9F8; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; ja&#xB85C; &#xD328;&#xCE58;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2013.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xB124; &#xADF8;&#xB7EC;&#xBA74; &#xC774;&#xC81C; &#xC544;&#xAE4C;&#xCC98;&#xB7FC; &#xD0A4; &#xBCF5;&#xD638;&#xD654; &#xD568;&#xC218;&#xC5D0; Break Point&#xB97C; &#xAC78;&#xC5B4;&#xC11C; &#xB514;&#xBC84;&#xAE45; &#xC2DC;&#xAC04;&#xC744; 1&#xCD08;&#xB97C; &#xB118;&#xAE34; &#xD6C4; &#xD14C;&#xC2A4;&#xD2B8;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>F9&#xB97C; &#xB20C;&#xB7EC; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xBA74;</p>
<p><img src="image%2014.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xCC98;&#xC74C;&#xC5D0; &#xC124;&#xC815;&#xD588;&#xB358; Break Point&#xB97C; &#xD1B5;&#xD574;&#xC11C; <code>decryptKey</code> &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xD568;&#xC218; &#xBD84;&#xC11D;&#xC744; &#xB05D;&#xB0B8; &#xD6C4; &#xACC4;&#xC18D; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC774;&#xC5B4;&#xAC00;&#xBA74; 2&#xBC88;&#xC9F8; BP&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2015.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>2&#xBC88;&#xC9F8; BP&#xB97C; &#xB9CC;&#xB098;&#xBA74; &#x201C;Edit&gt;Patch Program&gt;Assemble&#x201C; &#xC744; &#xD1B5;&#xD574; jbe&#xB97C; ja&#xB85C; &#xBC14;&#xAFD4;&#xC8FC;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC6B0;&#xD68C;&#xD568;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<p><img src="image%2016.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774;&#xC678;&#xC5D0;&#xB3C4; &#xC774;&#xBC88; &#xC2E4;&#xC2B5;&#xACFC; &#xAC19;&#xC740; &#xC0C1;&#xD669;&#xC5D0;&#xC11C;&#xB294; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0;&#xC11C; <code>CF</code>, <code>ZF</code> &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC218;&#xC815;&#xD55C;&#xB2E4;&#xAC70;&#xB098; GetTickCount() &#xD568;&#xC218;&#xB97C; &#xD6C4;&#xD0B9;&#xD574;&#xC11C; &#xC0C1;&#xC218;&#xAC12;&#xB9CC;&#xC744; &#xBC18;&#xD658;&#xD558;&#xAC8C; &#xD55C;&#xB2E4;&#xB294; &#xB4F1;&#xC73C;&#xB85C;&#xB3C4; &#xCDA9;&#xBD84;&#xD788; &#xB514;&#xBC84;&#xAC70; &#xAC80;&#xC0AC; &#xB85C;&#xC9C1;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xBB34;&#xB9AC;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;"></a>&#xB9C8;&#xBB34;&#xB9AC;</h1><p><img src="Debug_part2.jpg" srcset="/img/loading.gif" alt="Debug_part2.jpg"></p>
<p>&#xC624;&#xB298; &#xC2E4;&#xC2B5;&#xD55C; &#xAE30;&#xBC95;&#xC740; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xC6B0;&#xD68C;&#xB97C; &#xC704;&#xD55C; &#xB300;&#xD45C;&#xC801;&#xC778; &#xC608;&#xC2DC;&#xB4E4;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAE30;&#xBC95;&#xC740; &#x201C;&#xD568;&#xC815;&#xCE74;&#xB4DC;&#x201D;&#xCC98;&#xB7FC; &#xBCF4;&#xC548; &#xC194;&#xB8E8;&#xC158;&#xC774; &#xD2B9;&#xC815; &#xB3D9;&#xC791;&#xC744; &#xB9C9;&#xC73C;&#xB824; &#xD560; &#xB54C; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>Debugger&#xB97C; &#xB9C9;&#xB294; Anti-Debugging &#xAE30;&#xBC95;&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xB294;&#xAC78; &#xB9C9;&#xB294; Anti-Anti-Debugging <del>&#xAE30;&#xBC95;&#xC744; &#xB9C9;&#xB294; Anti-Anti-Anti-Debugging &#xC744; &#xB9C9;&#xB294; Anti-Anti-Anti-Anti tititi &#xD504;&#xB808;&#xC9C8;&#xD504;&#xB808;&#xC9C8;</del></p>
<p><img src="Anti-Fragile.gif" srcset="/img/loading.gif" alt="~~&#xC548;&#xD2F0;&#xD2F0;&#xD2F0;&#xD2F0;&#xD2F0;&#xD504;&#xB798;&#xC9C8;&#xD504;&#xB798;&#xC9C8;~~"></p>
<p><del>&#xC548;&#xD2F0;&#xD2F0;&#xD2F0;&#xD2F0;&#xD2F0;&#xD504;&#xB798;&#xC9C8;&#xD504;&#xB798;&#xC9C8;</del></p>
</blockquote>
<h2 id="&#xC548;&#xD2F0;-&#xB514;&#xBC84;&#xAE45;&#xC758;-&#xD55C;&#xACC4;"><a href="#&#xC548;&#xD2F0;-&#xB514;&#xBC84;&#xAE45;&#xC758;-&#xD55C;&#xACC4;" class="headerlink" title="&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC758; &#xD55C;&#xACC4;"></a>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC758; &#xD55C;&#xACC4;</h2><p>&#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC744; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC5ED;&#xACF5;&#xD559;&#xACFC; &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;&#xC744; &#xBC29;&#xD574;&#xD558;&#xB294; &#xD575;&#xC2EC; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xBB34;&#xB2E8; &#xBCF5;&#xC81C;, &#xD06C;&#xB799;, &#xC545;&#xC6A9;&#xC744; &#xBC29;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xD2B9;&#xD788; &#xAE08;&#xC735;&#xB7;&#xAC8C;&#xC784;&#xB7;&#xBCF4;&#xC548; &#xC81C;&#xD488; &#xB4F1; &#xBBFC;&#xAC10;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xD544;&#xC218;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. (CTF&#xC5D0;&#xC11C;&#xB3C4; &#xC885;&#xC885; &#xCD9C;&#xC81C;&#xB429;&#xB2C8;&#xB2E4;!) &#xB2E4;&#xC591;&#xD55C; &#xD658;&#xACBD;&#xC5D0; &#xB9DE;&#xCDB0; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC720;&#xC5F0;&#xC131;&#xACFC; &#xD568;&#xAED8;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC2DC;&#xB3C4;&#xD560; &#xB54C; &#xC774;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xACE0; &#xB300;&#xC751;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xB192;&#xC740; &#xC2E4;&#xD6A8;&#xC131;&#xC744; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC800;&#xD76C;&#xAC00; &#xC624;&#xB298; &#xD55C; &#xC2E4;&#xC2B5;&#xC5D0;&#xC11C; &#xBCF4;&#xC168;&#xB4EF;&#xC774; &#xCF54;&#xB4DC;&#xD328;&#xCE58;&#xB098; API &#xD6C4;&#xD0B9; &#xB4F1;&#xC5D0; &#xCDE8;&#xC57D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xC54C;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD328;&#xCE58;&#xAC00; &#xAC00;&#xB2A5;&#xD55C;&#xAC74;&#xB370;&#xC694;. </p>
<p><img src="image%2017.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>???: &#xADF8;&#xB7FC; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB974;&#xAC8C; &#xD558;&#xBA74; &#xB418;&#xC9C0; &#xC54A;&#xB0D0;! / 000: &#xC5B4;&#xB5BB;&#xAC8C;!!</p>
</blockquote>
<p><img src="9o6emu.gif" srcset="/img/loading.gif" alt="9o6emu.gif"></p>
<p>&#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xD1B5;&#xD574; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xB85C;&#xC9C1;&#xC744; &#xC54C; &#xC218; &#xC5C6;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xB85C;&#xC9C1;&#xC744; &#xC54C; &#xC218; &#xC5C6;&#xC73C;&#xBA74; &#xC5B4;&#xB5A4; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC774; &#xC801;&#xC6A9;&#xB41C;&#xC9C0; &#xBAB0;&#xB77C;&#xC11C; &#xC6B0;&#xD68C;&#xBC29;&#xBC95;&#xC744; &#xC54C;&#xAE30;&#xAC00; &#xB354;&#xB354;&#xC6B1; &#xD798;&#xB4E0;&#xB370;&#xC694;. &#xC774;&#xB7EC;&#xD55C; Anti-Reversing &#xAE30;&#xC220;&#xC740; &#xC815;&#xC801;&#xC778; &#xAE30;&#xBC95;&#xC778; &#xB09C;&#xB3C5;&#xD654;&#xC640; &#xB3D9;&#xC801;&#xC778; &#xAE30;&#xBC95;&#xC778; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC774; &#xACB0;&#xD569;&#xB418;&#xC5B4;&#xC11C; &#xC4F0;&#xC774;&#xBA74; &#xBD84;&#xC11D;&#xAC00;&#xAC00; &#xBD84;&#xC11D;&#xD558;&#xAE30;&#xC5D0; &#xC0C1;&#xB2F9;&#xD788; &#xC5B4;&#xB835;&#xACE0; &#xBCF5;&#xC7A1;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC644;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. (&#xB098;&#xC911;&#xC5D0; &#xAE30;&#xD68C;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; &#xBE14;&#xB85C;&#xADF8;&#xC5D0;&#xC11C; &#xB09C;&#xB3C5;&#xD654;&#xB3C4; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!)</p>
<h2 id="&#xC758;&#xC758;"><a href="#&#xC758;&#xC758;" class="headerlink" title="&#xC758;&#xC758;"></a>&#xC758;&#xC758;</h2><p>&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xB9AC;&#xBC84;&#xC2F1;&#xACFC; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1;&#xC740; &#xB9C8;&#xCE58; &#xCC3D;&#xACFC; &#xBC29;&#xD328;&#xC758; &#xC2F8;&#xC6C0;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xAC00;&#xB294; &#xB9AC;&#xBC84;&#xC2F1; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC758; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC744; &#xD30C;&#xC545;&#xD558;&#xACE0;, &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xBD84;&#xC11D;&#xC744; &#xBC29;&#xD574;&#xD558;&#xC5EC; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC758; &#xBE44;&#xBC00;&#xC744; &#xC228;&#xAE30;&#xB824; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC120;&#xB7C9;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790; &#xAD00;&#xC810;&#xC5D0;&#xC11C;&#xB3C4; &#xB9AC;&#xBC84;&#xC2F1;&#xACFC; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1;&#xC740; &#xC911;&#xC694;&#xD55C; &#xC758;&#xBBF8;&#xB97C; &#xAC16;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9AC;&#xBC84;&#xC2F1; &#xAE30;&#xC220;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC544; &#xBCF4;&#xC548;&#xC744; &#xAC15;&#xD654;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1; &#xAE30;&#xC220;&#xC740; &#xC9C0;&#xC801; &#xC7AC;&#xC0B0;&#xAD8C;&#xC744; &#xBCF4;&#xD638;&#xD558;&#xACE0; &#xBD88;&#xBC95; &#xBCF5;&#xC81C;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xB294; &#xB370; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xACB0;&#xAD6D; &#xB9AC;&#xBC84;&#xC2F1;&#xACFC; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1;, &#xB514;&#xBC84;&#xAE45;&#xACFC; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC11C;&#xB85C;&#xC758; &#xAE30;&#xC220;&#xC744; &#xBC1C;&#xC804;&#xC2DC;&#xD0A4;&#xBA70;, &#xC9C0;&#xC18D;&#xC801;&#xC778; &#xB300;&#xACB0;&#xC744; &#xC774;&#xC5B4;&#xAC00;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC601;&#xD654;&#xC5D0;&#xC11C; &#xB098;&#xC624;&#xB294; &#xB04A;&#xC784;&#xC5C6;&#xB294; &#xC601;&#xC6C5;&#xACFC; &#xC545;&#xB2F9;&#xC758; &#xC2F8;&#xC6C0;&#xCC98;&#xB7FC; &#xB290;&#xAEF4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xC640; &#xBD84;&#xC11D;&#xAC00;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC640; &#xACF5;&#xACA9;&#xC790; &#xC0AC;&#xC774;&#xC758; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xB294; &#xC2F8;&#xC6C0;&#xC774;&#xC8E0;. &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740; &#xAE30;&#xC220; &#xC790;&#xCCB4;&#xC758; &#xC120;&#xC545;&#xC774; &#xC544;&#xB2C8;&#xB77C;, &#xAE30;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xC758; &#xC724;&#xB9AC;&#xC801; &#xCC45;&#xC784;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xBC84;&#xC2F1;&#xACFC; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1; &#xAE30;&#xC220;&#xC744; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC548;&#xC804;&#xD558;&#xACE0; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xB514;&#xC9C0;&#xD138; &#xC138;&#xC0C1;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xAC00;&#xB294; &#xAC83;&#xC774; &#xC6B0;&#xB9AC;&#xC758; &#xACFC;&#xC81C;&#xC774;&#xC9C0; &#xC54A;&#xC744;&#xAE4C;&#xC694;?!</p>
<p><img src="image%2018.jpg" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xB4DC;&#xB9AC;&#xACE0; &#xC800;&#xB294; &#xB354; &#xC88B;&#xC740; &#xC5F0;&#xAD6C;&#xAE00;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x1F642;</p>
<h3 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h3><p>&#xB9AC;&#xBC84;&#xC2F1; &#xD575;&#xC2EC; &#xC6D0;&#xB9AC;: &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xAC00;&#xC758; &#xB9AC;&#xBC84;&#xC2F1; &#xC774;&#xC57C;&#xAE30;(&#xC800;&#xC790; &#xC774;&#xC2B9;&#xC6D0;)</p>
<p>Detoures - <a target="_blank" rel="external nofollow noopener noreferrer" href="https://secmem.tistory.com/480">https://secmem.tistory.com/480</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software">https://www.apriorit.com/dev-blog/367-anti-reverse-engineering-protection-techniques-to-use-before-releasing-software</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis">https://www.bitdefender.com/en-us/blog/businessinsights/the-differences-between-static-malware-analysis-and-dynamic-malware-analysis</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Debugging/">Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/Anti-Debugging/">Anti-Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/Malware/">Malware</a>
                  
                  <a class="hover-with-bg" href="/tags/Reverse-Engineering/">Reverse Engineering</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/03/24/OUYA77/Anti_part2/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Anti-Debugging Part 2(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/03/22/empty/CVE-2025-24813/">
                    <span class="hidden-mobile">[] CVE-2025-24813 Apache Tomcat      RCE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/03/24/OUYA77/Anti_part2/kr/';
        this.page.identifier = '/2025/03/24/OUYA77/Anti_part2/kr/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Anti-Debugging Part 2(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
