

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F642;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xB2E4; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9C8;&amp;#xCE68; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C;(?) &amp;#xC774;&amp;#xB807;&amp;#xAC8C; Part 3&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Part 1&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xACE0; Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#x201C;&amp;#xD568;&amp;#xC815;&amp;#xCE74;&amp;#xB4DC;&amp;#x201D;&amp;#xCC98;&amp;#xB7FC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB9C9;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC778; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(&amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC9C1; &amp;#xBABB;&amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#x1F447; &amp;#x314E;&amp;#x314E;).&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/em&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/&#34;&gt;[Research] Anti-Debugging Part1(KR)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/03/24/OUYA77/Anti_part2/kr/&#34;&gt;[Research] Anti-Debugging Part2(KR)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xD638;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xC804;&amp;#xAC1C;&amp;#xB41C; &amp;#xB9CC;&amp;#xD07C; &amp;#xAE4C;&amp;#xBA39;&amp;#xC73C;&amp;#xC168;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744;&amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4DC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC; &amp;#xADF8;&amp;#xB7EC;&amp;#xC168;&amp;#xC744;&amp;#xAE4C;&amp;#xBD10; &amp;#xC81C;&amp;#xAC00; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xCE74;&amp;#xD230;(?)&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;&amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC2EC;&amp;#xC740; &amp;#xC808;&amp;#xB300; &amp;#xC11E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &amp;#xB9CC;&amp;#xB4E4;&amp;#xB2E4;&amp;#xAC00; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC744; &amp;#xC9DC;&amp;#xB294;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC11C; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB2D8;&amp;#xC758; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xBC1B;&amp;#xC740; &amp;#xAC83;&amp;#xB3C4; &amp;#xBE44;&amp;#xBC00;&amp;#xC774;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;Anti-Dubbugging-Part-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#Anti-Dubbugging-Part-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;Anti-Dubbugging Part &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;Anti-Dubbugging Part &amp;#xC694;&amp;#xC57D;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCE74;&amp;#xD230;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xACE0; &amp;#xADF8;&amp;#xAC78; &amp;#xB610; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; Part 1, 2&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB294; &lt;strong&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xC57C; &amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&lt;/strong&gt;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&lt;/strong&gt;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC11C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B0;&amp;#xD68C;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xACE0;&amp;#xB4E0; &amp;#xB7A8;&amp;#xC9C0; &amp;#xC120;&amp;#xC0DD;&amp;#xB2D8;&amp;#xC774; &amp;#x201C;&amp;#xC774; &amp;#xC7AC;&amp;#xB8CC;(&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;)&amp;#xAC00; &amp;#xBB54;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xC228;&amp;#xACA8;&amp;#xC57C; &amp;#xD574;!&amp;#x201D; &amp;#xB77C;&amp;#xACE0; &amp;#xBD88;&amp;#xC465; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC154;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xC2E0; &amp;#xAC70;&amp;#xC8E0;! &amp;#x1F525;&amp;#x1F468;&amp;#x200D;&amp;#x1F373;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;In Part 2&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;???: &amp;#xADF8;&amp;#xB7FC; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB0D0;! / 000: &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC78;&amp;#xB9B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xACE0; &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xC6B1; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB140;&amp;#xC11D;&amp;#xC744; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xD5E4;&amp;#xCCD0; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Obfuscation&#34;&gt;&lt;a href=&#34;#1-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&#34;&gt;&lt;/a&gt;1. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&lt;/h2&gt;&lt;h3 id=&#34;1-1-&amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xC18C;&amp;#xAC1C;&#34; class=&#34;headerlink&#34; title=&#34;1.1 &amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;/a&gt;1.1 &amp;#xC18C;&amp;#xAC1C;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&lt;/strong&gt;&amp;#xB780; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Wikipedia&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB780;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB610;&amp;#xB294; &amp;#xBA38;&amp;#xC2E0;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xB78C; &amp;#xB610;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xC77C;&amp;#xC774;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC00;&amp;#xB3C5;&amp;#xC131; &amp;#xC800;&amp;#xD558;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4;&amp;#xC11C;, &lt;strong&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&lt;/strong&gt;&amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xC801; &amp;#xC7AC;&amp;#xC0B0; &amp;#xBCF4;&amp;#xD638;, &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;, &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xD68C;&amp;#xD53C; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-&amp;#xBAA9;&amp;#xC801;&#34;&gt;&lt;a href=&#34;#1-2-&amp;#xBAA9;&amp;#xC801;&#34; class=&#34;headerlink&#34; title=&#34;1.2 &amp;#xBAA9;&amp;#xC801;&#34;&gt;&lt;/a&gt;1.2 &amp;#xBAA9;&amp;#xC801;&lt;/h3&gt;&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBD84;&amp;#xC11D; &amp;#xBC29;&amp;#xC9C0; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xB3C5;&amp;#xC131; &amp;#xC800;&amp;#xD558;:&lt;/strong&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB17C;&amp;#xB9AC; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xC228;&amp;#xACA8; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xBC29;&amp;#xD574;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131; &amp;#xC99D;&amp;#xAC00;:&lt;/strong&gt; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xBE44;&amp;#xC120;&amp;#xD615;&amp;#xC801; &amp;#xD750;&amp;#xB984;, &amp;#xB09C;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xC870;&amp;#xAC74; &amp;#xB4F1; &amp;#xC0BD;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD328;&amp;#xD134; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C;:&lt;/strong&gt; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98; &amp;#xAE30;&amp;#xBC18; &amp;#xD0D0;&amp;#xC9C0; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xC624;&amp;#xD0D0; &amp;#xB610;&amp;#xB294; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C; &amp;#xC720;&amp;#xB3C4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#x201C;&amp;#xC544;~ &amp;#xACE4;&amp;#xB780;&amp;#xD558;&amp;#xB124; ;;&amp;#x201D; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC5B4;&amp;#xB290;&amp;#xC815;&amp;#xB3C4; &amp;#xC774;&amp;#xB918;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD10;&amp;#xB3C4; &amp;#xBB34;&amp;#xBC29;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-3-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xBD84;&amp;#xB958;&#34;&gt;&lt;a href=&#34;#1-3-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xBD84;&amp;#xB958;&#34; class=&#34;headerlink&#34; title=&#34;1.3 &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBD84;&amp;#xB958;&#34;&gt;&lt;/a&gt;1.3 &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBD84;&amp;#xB958;&lt;/h3&gt;&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC94;&amp;#xC8FC;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Source Code Obfuscation)&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;: &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xACE0;&amp;#xC218;&amp;#xC900; &amp;#xC5B8;&amp;#xC5B4; (Java, JavaScript, Python &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xC2DC;&amp;#xC810;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xC804;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA9;&amp;#xC801;&lt;/strong&gt;: &amp;#xB0B4;&amp;#xBD80; &amp;#xBCF4;&amp;#xC548; &amp;#xD655;&amp;#xBCF4;, &amp;#xC678;&amp;#xC8FC;/&amp;#xACE0;&amp;#xAC1D;&amp;#xC6A9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC77C;&amp;#xBD80; &amp;#xACF5;&amp;#xAC1C; &amp;#xC2DC; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xBCF4;&amp;#xD638;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC885;&amp;#xC885; &amp;#xB0B4;&amp;#xBD80; &amp;#xB610;&amp;#xB294; &amp;#xACE0;&amp;#xAC1D;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC18C;&amp;#xC2A4; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB098; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC740; &amp;#xC77C;&amp;#xBD80; &amp;#xC218;&amp;#xC815;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC804;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870;&amp;#xB098; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#x201C;&amp;#xC2DD;&amp;#xBCC4;&amp;#xC790; &amp;#xC774;&amp;#xB984; &amp;#xBCC0;&amp;#xACBD;&amp;#x201D;, &amp;#x201C;&amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC7AC;&amp;#xBC30;&amp;#xC5F4;&amp;#x201D;, &amp;#x201C;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#x201D;, &amp;#x201C;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#x201D;&amp;#xC744; &amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Binary Obfuscation)&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589;&amp;#xD30C;&amp;#xC77C; (C, C++, Go &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xC2DC;&amp;#xC810;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC; &amp;#xD639;&amp;#xC740; &amp;#xC774;&amp;#xD6C4; &amp;#xBCC0;&amp;#xD615;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA9;&amp;#xC801;&lt;/strong&gt;: &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;, &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC720;&amp;#xCD9C; &amp;#xBC29;&amp;#xC9C0;, &amp;#xD06C;&amp;#xB799;/&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xBC29;&amp;#xC9C0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xB294; &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xBA70;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xB77C;&amp;#xC774;&amp;#xC120;&amp;#xC2A4; &amp;#xB85C;&amp;#xC9C1;, &amp;#xC778;&amp;#xC99D; &amp;#xCCB4;&amp;#xACC4; &amp;#xB4F1;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB098; &amp;#xACE0;&amp;#xAC1D;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD06C;&amp;#xB799;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#x201C;&amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC81C;&amp;#xD488;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC81C;&amp;#xD488;&amp;#xC774;&amp;#xAE34; &amp;#xD558;&amp;#xC8E0;.. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;(IDA, Ghidra &amp;#xB4F1;)&amp;#xC758; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAD50;&amp;#xB780;&amp;#xD558;&amp;#xBA70;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0;&amp;#xB9CC; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD574;&amp;#xB3C5;&amp;#xB418;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#x201C;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xBCC0;&amp;#xD615;&amp;#x201D;, &amp;#x201C;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#x201D;, &amp;#x201C;&amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0BD;&amp;#xC785;&amp;#x201D;, &amp;#x201C;&amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1;&amp;#x201D;, &amp;#x201C;&amp;#xAC04;&amp;#xC811; &amp;#xC810;&amp;#xD504; &amp;#xBC0F; &amp;#xD638;&amp;#xCD9C;&amp;#x201D; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-4-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#1-4-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;1.4 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;/a&gt;1.4 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD788; &lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC65C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xAC00;? &amp;#xBB3C;&amp;#xC73C;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC4F0;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xACB0;&amp;#xAD6D; &lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&lt;/strong&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC0AC;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xB178;&amp;#xD558;&amp;#xC6B0;, &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xB77C;&amp;#xC774;&amp;#xC120;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4; &amp;#xB4F1;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xD0B9;, &amp;#xBD88;&amp;#xBC95; &amp;#xC7AC;&amp;#xBC30;&amp;#xD3EC;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC545;&amp;#xC6A9;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xC5B4;&amp;#xC838; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB118;&amp;#xC5B4; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC57C;&amp;#xAE30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xAC8C; Anti-Reversing &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; Part 1&amp;#xBD80;&amp;#xD130; &amp;#xACC4;&amp;#xC18D; &amp;#xBD10;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xC989; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB824;&amp;#xB294; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB97C; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xBC29;&amp;#xD574;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &lt;strong&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&lt;/strong&gt;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCDA5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB458;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB420; &amp;#xACBD;&amp;#xC6B0;, &amp;#xBD84;&amp;#xC11D;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xC57C;&amp;#xB9D0;&amp;#xB85C; &amp;#xBB34;&amp;#xC801;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC5B4; &amp;#xCCB4;&amp;#xACC4;&amp;#xB97C; &amp;#xB9C8;&amp;#xC8FC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xC148;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC808;&amp;#xB300; &amp;#xB6AB;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC29;&amp;#xD328;&amp;#xB3C4; &amp;#xB6AB;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xC788;&amp;#xAE34; &amp;#xD558;&amp;#xC8E0;&amp;#x2026;)&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xC138;-&amp;#xAC00;&amp;#xC9C0;-&amp;#xCD95;&#34;&gt;&lt;a href=&#34;#2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xC138;-&amp;#xAC00;&amp;#xC9C0;-&amp;#xCD95;&#34; class=&#34;headerlink&#34; title=&#34;2.&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCD95;&#34;&gt;&lt;/a&gt;2.&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCD95;&lt;/h2&gt;&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;(&amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;h3 id=&#34;2-1-&amp;#xAD6C;&amp;#xC870;&amp;#xC801;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Structural-Obfuscation&#34;&gt;&lt;a href=&#34;#2-1-&amp;#xAD6C;&amp;#xC870;&amp;#xC801;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Structural-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Structural Obfuscation)&#34;&gt;&lt;/a&gt;2.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Structural Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xAD6C;&amp;#xC870; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xB4A4;&amp;#xD2C0;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC94;&amp;#xC8FC;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &lt;strong&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xD568;&amp;#xC218;&amp;#xB098; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&lt;/strong&gt;, &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xD3C9;&amp;#xD0C4;&amp;#xD654; (Control Flow Flattening)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%205.png&#34; alt=&#34;ref. https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;&lt;/p&gt;
&lt;p&gt;  ref. &lt;a href=&#34;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xB798;&amp;#xB294; &lt;code&gt;if&lt;/code&gt;, &lt;code&gt;while&lt;/code&gt;, &lt;code&gt;switch&lt;/code&gt; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xB358; &amp;#xB17C;&amp;#xB9AC; &amp;#xD750;&amp;#xB984;&amp;#xC744;, &amp;#xBAA8;&amp;#xB450; &amp;#xD558;&amp;#xB098;&amp;#xC758; &lt;code&gt;dispatcher&lt;/code&gt; &amp;#xB8E8;&amp;#xD504; &amp;#xC548;&amp;#xC5D0; &amp;#xB123;&amp;#xACE0;, &lt;strong&gt;&amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218;&lt;/strong&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC9;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB8E8;&amp;#xD504; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xC804;&amp;#xC774;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xD2B8;&amp;#xB9AC; &amp;#xBD84;&amp;#xD574;&amp;#xAC00; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xBE44;&amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5B4;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; Obfuscator-LLVM(OLLVM) &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0BD;&amp;#xC785; (Junk / Dead Code Insertion)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xC601;&amp;#xD5A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;(Junk Code)&amp;#xB098;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;(Dead Code)&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xB85C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;ul&gt;
&lt;li&gt;&amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xC5F0;&amp;#xC0B0; (&lt;code&gt;x = x;&lt;/code&gt;, &lt;code&gt;add eax, 0;&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBD84;&amp;#xAE30; (&lt;code&gt;if (false) { ... }&lt;/code&gt;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC04;&amp;#xC811; &amp;#xBD84;&amp;#xAE30; / &amp;#xD638;&amp;#xCD9C; (Indirect Branching)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;jmp eax&lt;/code&gt;, &lt;code&gt;call [ecx+0x10]&lt;/code&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xC8FC;&amp;#xC18C; &amp;#xACC4;&amp;#xC0B0; &amp;#xD6C4; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xCF54;&amp;#xB4DC; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;(API &amp;#xCD94;&amp;#xB860; &amp;#xBD88;&amp;#xAC00;).&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Opaque Predicate&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC870;&amp;#xAC74;&amp;#xC2DD;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; true/false&amp;#xC778; &amp;#xBD84;&amp;#xAE30; &amp;#xC0BD;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC608;: &lt;code&gt;if ((x*x) &amp;gt;= 0)&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBB34;&amp;#xD574;&amp;#xD558;&amp;#xB098; &amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD750;&amp;#xB984; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC8FC;&amp;#xC758;&amp;#xD560; &amp;#xC810;:&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC635;&amp;#xC158;(&lt;code&gt;O2&lt;/code&gt;, &lt;code&gt;O3&lt;/code&gt;)&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xC81C;&amp;#xAC70;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &lt;strong&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC81C;&amp;#xAC70;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xD6A8;&amp;#xACFC;:&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504;&amp;#xB098; &amp;#xBD84;&amp;#xAE30; &amp;#xC18D;&amp;#xC5D0; &amp;#xC228;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xC2EC;&amp;#xB9AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xCE58;&amp;#xACE0; &amp;#xD5C8;&amp;#xD0C8;&amp;#xD568;&amp;#xC744; &amp;#xB290;&amp;#xB07C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC67C;&amp;#xCABD; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0DD;&amp;#xAE34; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB978;&amp;#xCABD; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB354;&amp;#xBBF8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xBA87; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xB123;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574;&amp;#xC9D0;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; CFG &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xD750;&amp;#xB984; &amp;#xD30C;&amp;#xC545;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-2-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Data-Obfuscation&#34;&gt;&lt;a href=&#34;#2-2-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Data-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.2 &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Data Obfuscation)&#34;&gt;&lt;/a&gt;2.2 &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Data Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xC228;&amp;#xAE30;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xC5EC; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC94;&amp;#xC8FC;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;, &amp;#xC0C1;&amp;#xC218;, API &amp;#xBA85; &amp;#xB4F1; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC2DC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&lt;/strong&gt;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC228;&amp;#xAE30;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC554;&amp;#xD638;&amp;#xD654; (String Encryption)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC; &lt;code&gt;&amp;quot;CreateProcess&amp;quot;&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0C1;&amp;#xC218; &amp;#xC778;&amp;#xCF54;&amp;#xB529; (Constant Encoding)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC22B;&amp;#xC790; &amp;#xC0C1;&amp;#xC218;&amp;#xB098; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xAC04;&amp;#xC811; &amp;#xACC4;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC608;: &lt;code&gt;1337&lt;/code&gt; &amp;#x2192; &lt;code&gt;1000 + 337&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC218;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0B0;&amp;#xC220;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xB098; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB300;&amp;#xD3ED; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;API &amp;#xD638;&amp;#xCD9C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; / Import Hiding&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;API &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD574;&amp;#xC2DC;&amp;#xB098; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xC228;&amp;#xAE30;&amp;#xACE0;, &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xB85C;&amp;#xB529;(&lt;code&gt;LoadLibrary&lt;/code&gt;, &lt;code&gt;GetProcAddress&lt;/code&gt;)&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IAT(Import Address Table)&amp;#xAC00; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC790;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D; &amp;#xBD88;&amp;#xAC00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB098; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;(&amp;#xC2DD;&amp;#xBCC4;&amp;#xC790;, &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;, API &amp;#xB4F1;)&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-3-&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Algorithm-Obfuscation&#34;&gt;&lt;a href=&#34;#2-3-&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Algorithm-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.3 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Algorithm Obfuscation)&#34;&gt;&lt;/a&gt;2.3 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Algorithm Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774;&amp;#xB098; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xD589;&amp;#xC704; &amp;#xC790;&amp;#xCCB4;&lt;/strong&gt;&amp;#xB97C; &amp;#xB09C;&amp;#xD574;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xC5EC;, &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB72F;&amp;#xC5B4;&amp;#xBD10;&amp;#xB3C4; &amp;#x201C;&amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#x201D;&amp;#xB97C; &amp;#xC54C;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1; (Name Mangling) &amp;#xBC0F; &amp;#xC2EC;&amp;#xBCFC; &amp;#xC81C;&amp;#xAC70;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xD568;&amp;#xC218;/&amp;#xBCC0;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5; &amp;#xB9E5;&amp;#xB77D;&amp;#xC744; &amp;#xC77D;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; Hack The Drone 2024(Final) &amp;#xC5D0; &amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xD589;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xB3D9; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC218;&amp;#xB3C4; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; LFSR Galois &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB791; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xAC00; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC27D;&amp;#xAC8C; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xACFC; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xBCC0;&amp;#xC218;&amp;#xBA85;&amp;#xC774; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xB418;&amp;#xC5B4; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC18C;&amp;#xC694;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC694;&amp;#xC998;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; GPT &amp;#xAC19;&amp;#xC740; LLM&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xC798; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC8FC;&amp;#xAE34; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694; &amp;#x314E;.&amp;#x314E;&amp;#x2026;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Self-Modifying Code&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0; &amp;#xAE30;&amp;#xBC18; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Virtualization Obfuscation)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC790;&amp;#xCCB4; &amp;#xAC00;&amp;#xC0C1; ISA&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0; &amp;#xD574;&amp;#xC11D; &amp;#xB8E8;&amp;#xD2F4; &amp;#xC5C6;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;strong&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#xC870;&amp;#xCC28;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-Obfuscator-LLVM-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#3-Obfuscator-LLVM-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;3. Obfuscator-LLVM &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;3. Obfuscator-LLVM &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;OLLVM(Obfuscator-LLVM)&lt;/strong&gt; &amp;#xC740;, &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC778; &lt;strong&gt;LLVM&lt;/strong&gt;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5; &amp;#xD655;&amp;#xC7A5;&amp;#xD310;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xB798; LLVM&amp;#xC740; &amp;#x201C;&amp;#xD074;&amp;#xB9B0;&amp;#xD55C;&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCD98; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC9C4;&amp;#xB4E4;&amp;#xC774; LLVM&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC6CC;&amp;#xB099; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0; &amp;#xCC29;&amp;#xC548;&amp;#xD574;&amp;#xC11C;, &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE61;&amp;#xC138;&amp;#xAC8C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xADF8;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; OLLVM&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;OLLVM&amp;#xC740; C/C++ &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD560; &amp;#xB54C; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD328;&amp;#xC2A4;(pass)&lt;/strong&gt; &amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xD615;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774;, &amp;#xADF8;&amp;#xB0E5; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD574;&amp;#xB3C4; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-OLLVM&amp;#xC6A9;-Clang-&amp;#xBE4C;&amp;#xB4DC;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-1-OLLVM&amp;#xC6A9;-Clang-&amp;#xBE4C;&amp;#xB4DC;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3.1 OLLVM&amp;#xC6A9; Clang &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3.1 OLLVM&amp;#xC6A9; Clang &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Installation&#34;&gt;https://github.com/obfuscator-llvm/obfuscator/wiki/Installation&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; -b llvm-4.0 https://github.com/obfuscator-llvm/obfuscator.git
$ mkdir build &amp;amp;&amp;amp; &lt;span class=&#34;hljs-built_in&#34;&gt;cd&lt;/span&gt; build
$ cmake -DCMAKE_BUILD_TYPE=Release ../obfuscator/
$ make -j7&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xC880; &amp;#xB098;&amp;#xC11C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC92C;&amp;#xC5B4;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xB098;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xB85C;&amp;#xADF8; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xACE0; &amp;#xD2B8;&amp;#xB7EC;&amp;#xBE14;&amp;#xC288;&amp;#xD305;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;obfuscator/tools/clang/lib/CodeGen/CGOpenMPRuntime.cpp:6275, 6321, 6400&lt;/p&gt;
&lt;p&gt;&lt;code&gt;error:lambda parameter &amp;#x2018;CGF&amp;#x2019; previously declared as a capture&lt;/code&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &lt;code&gt;&amp;amp;CGF&lt;/code&gt; &amp;#xC81C;&amp;#xAC70;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;auto&lt;/span&gt; &amp;amp;&amp;amp;BeginThenGen = [&amp;amp;D, &amp;amp;CGF, Device, &amp;amp;Info, &amp;amp;CodeGen, &amp;amp;NoPrivAction](...)
&amp;#x2193;
&lt;span class=&#34;hljs-keyword&#34;&gt;auto&lt;/span&gt; &amp;amp;&amp;amp;BeginThenGen = [&amp;amp;D, Device, &amp;amp;Info, &amp;amp;CodeGen, &amp;amp;NoPrivAction](...)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;obfuscator/include/llvm/ExecutionEngine/Orc/OrcRemoteTargetClient.h:696&lt;/p&gt;
&lt;p&gt;&lt;code&gt;error: cannot convert&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;char&lt;/code&gt; &amp;#x2192; &lt;code&gt;uint8_t&lt;/code&gt; &amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Expected&amp;lt;&lt;span class=&#34;hljs-built_in&#34;&gt;std&lt;/span&gt;::&lt;span class=&#34;hljs-built_in&#34;&gt;vector&lt;/span&gt;&amp;lt;&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;&amp;gt;&amp;gt; &lt;span class=&#34;hljs-title&#34;&gt;readMem&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(...)&lt;/span&gt; &lt;/span&gt;{ ... }
&amp;#x2193;
&lt;span class=&#34;hljs-function&#34;&gt;Expected&amp;lt;&lt;span class=&#34;hljs-built_in&#34;&gt;std&lt;/span&gt;::&lt;span class=&#34;hljs-built_in&#34;&gt;vector&lt;/span&gt;&amp;lt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint8_t&lt;/span&gt;&amp;gt;&amp;gt; &lt;span class=&#34;hljs-title&#34;&gt;readMem&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(...)&lt;/span&gt; &lt;/span&gt;{ ... }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC798;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; OLLVM &amp;#xC6A9; clang&amp;#xC774; &amp;#xC798; &amp;#xB098;&amp;#xD0C0;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;3-2-OLLVM-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-2-OLLVM-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3.2 OLLVM &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3.2 OLLVM &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;Obfuscator-LLVM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740;, Clang&amp;#xC744; &amp;#xD1B5;&amp;#xD574; LLVM &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;(-mllvm)&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Features&#34;&gt;https://github.com/obfuscator-llvm/obfuscator/wiki/Features&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;fla&lt;/code&gt;: &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xD3C9;&amp;#xD0C4;&amp;#xD654;(Control Flow Flattening)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;sub&lt;/code&gt;: &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xCE58;&amp;#xD658;(Instruction Substitution)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;bcf&lt;/code&gt;: &amp;#xAC00;&amp;#xC9DC; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984;(Bogus Control Flow)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB610;, &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xB9CC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Functions-annotations&#34;&gt;&amp;#xD568;&amp;#xC218; &amp;#xC5B4;&amp;#xB178;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&lt;/a&gt; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xCC38;&amp;#xACE0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-3-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#3-3-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;3.3 &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;3.3 &amp;#xC2E4;&amp;#xC2B5;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// flatten_example.c&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;secret_function&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (x &amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x * &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;;
    } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x - &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;;
    }
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; value = &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; result = secret_function(value);
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Result: %d\n&amp;quot;&lt;/span&gt;, result);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ clang flatten_example.c -o flatten_example_norm
$ path_to_the/build/bin/clang -mllvm -fla flatten_example.c -o flatten_example_obf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC67C;&amp;#xCABD;&amp;#xC774; &lt;code&gt;flatten_example_norm&lt;/code&gt; &amp;#xC774;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC774; &lt;code&gt;flatten_example_obf&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB41C; &lt;code&gt;secret_function&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;secret_function&lt;/code&gt; &amp;#xC758; CFG&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC8FC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC778;&amp;#xB370; &amp;#xBC8C;&amp;#xC368;&amp;#xBD80;&amp;#xD130; &amp;#xADF9;&amp;#xBA85;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB108;&amp;#xBB34;&amp;#xB098; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;4-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#4-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;4. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;4. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;h3 id=&#34;&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;&amp;#xD55C;&amp;#xACC4;&lt;/h3&gt;&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xD55C;&amp;#xACC4;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;:&lt;/strong&gt; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB098; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD84;&amp;#xAE30;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC800;&amp;#xD558;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB3C4;&amp;#xAD6C; &amp;#xBC1C;&amp;#xC804;&amp;#xC758; &amp;#xC5ED;&amp;#xC2B5;:&lt;/strong&gt; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xAE30;, &amp;#xB514;&amp;#xC635;&amp;#xD4E8;&amp;#xC2A4;&amp;#xCF00;&amp;#xC774;&amp;#xD130;(Deobfuscator) &amp;#xB4F1; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC77C;&amp;#xBD80; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xAC8C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBC95;&amp;#xC801;&amp;#xB7;&amp;#xC724;&amp;#xB9AC;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;:&lt;/strong&gt; &amp;#xC0C1;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xB97C; &amp;#xC800;&amp;#xD558;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB54C;&amp;#xB85C;&amp;#xB294; &amp;#xBC95;&amp;#xC801; &amp;#xBD84;&amp;#xC7C1;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;a href=&#34;#&amp;#xC758;&amp;#xC758;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;/a&gt;&amp;#xC758;&amp;#xC758;&lt;/h3&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xADF8; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD06C;&amp;#xAC8C; &lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801;(Structural)&lt;/strong&gt;, &lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130;(Data)&lt;/strong&gt;, &lt;strong&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;(Algorithm)&lt;/strong&gt; &amp;#xCE21;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xB958;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4;, &amp;#xC774; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xBCF5;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xB354;&amp;#xC6B1;&amp;#xC774;, &amp;#xAE30;&amp;#xC874; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC758; &amp;#xBCC0;&amp;#xD615;&amp;#xC740; &amp;#xBB3C;&amp;#xB860;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBCC0;&amp;#xC885; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA70; &amp;#xBD84;&amp;#xC11D;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xC744; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xBE61;&amp;#xC138;&amp;#xAC8C; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC18C;&amp;#xBB38;&amp;#xB09C; &amp;#xC0C1;&amp;#xC6A9; &amp;#xB4DC;&amp;#xB860; DJI &amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: 8&amp;#xAC1C;&amp;#xC758; DEX &amp;#xD30C;&amp;#xC77C;&amp;#xC744; 128KB &amp;#xCCAD;&amp;#xD06C; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01;&amp;#xAC01;&amp;#xC744; &lt;strong&gt;AES-256&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: &lt;code&gt;com.dji.industry.pilot&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xACFC; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xC218;&amp;#xB97C; &amp;#xC870;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;XOR &amp;#xAE30;&amp;#xBC18; &amp;#xD0A4;&lt;/strong&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: JNI &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;strong&gt;3&amp;#xB2E8;&amp;#xACC4; &amp;#xD2B8;&amp;#xB7A8;&amp;#xD384;&amp;#xB9B0; &amp;#xD568;&amp;#xC218;&lt;/strong&gt;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xC2E4;&amp;#xC81C; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xD604;&amp;#xB300;&amp;#xC758; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB2E4;&amp;#xCE35;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xB41C; &amp;#xBCF4;&amp;#xD638; &amp;#xCCB4;&amp;#xACC4;&amp;#xB97C; &amp;#xAC16;&amp;#xCD94;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;,  &amp;#xB9E4;&amp;#xB144; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xD615; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB354;&amp;#xC6B1; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC544;&amp;#xAC00;, &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xD134; &amp;#xC0DD;&amp;#xC131;&amp;#xC774;&amp;#xB098; &amp;#xC591;&amp;#xC790; &amp;#xC554;&amp;#xD638; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xD0A4; &amp;#xAD50;&amp;#xD658; &amp;#xB4F1; &amp;#xCC28;&amp;#xC138;&amp;#xB300; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2DC;&amp;#xD5D8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA70; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xB3C4; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xBC1C;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 1,2,3&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA70; &amp;#xACC4;&amp;#xC18D;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC;, &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBCF4;&amp;#xD638; &amp;#xACC4;&amp;#xCE35;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC77C; &amp;#xBFD0;, &amp;#xAD81;&amp;#xADF9;&amp;#xC801;&amp;#xC778; &amp;#xC548;&amp;#xC804;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD568;&amp;#x201D;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Quarkslab &amp;#xB9AC;&amp;#xC11C;&amp;#xCE58; &amp;#xD300;&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC640; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xACB0;&amp;#xAD6D; &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C0;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2F8;&amp;#xC6C0;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xC640; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xB300;&amp;#xACB0; &amp;#xAD6C;&amp;#xB3C4; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xC9C4;&amp;#xD654;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC220; &amp;#xC804;&amp;#xBC18;&amp;#xC758; &amp;#xBC1C;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBCF4;&amp;#xD638;&amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C;&amp;#xC640; &amp;#xBD84;&amp;#xC11D; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xBC29;&amp;#xC5B4; &amp;#xC591;&amp;#xCABD; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&lt;/strong&gt;&amp;#xB85C; &amp;#xC790;&amp;#xB9AC; &amp;#xC7A1;&amp;#xC740; &amp;#xC148;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xBC29;&amp;#xC5B4;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xC218;&amp;#xB2E8;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xBC29;&amp;#xD328;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB294; &amp;#xB048;&amp;#xC9C8;&amp;#xAE30;&amp;#xAC8C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xBA70;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; &amp;#xBC29;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xC774; &amp;#xC2F8;&amp;#xC6C0;&amp;#xC740; &amp;#xB05D;&amp;#xB0A0; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C;, &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xBC29;&amp;#xC5B4;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xC9C4;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC7A5;&amp;#xBCBD;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;strong&gt;&amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC9C4;&amp;#xD654;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&lt;/strong&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB77C;&amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC3D;&amp;#xACFC; &amp;#xBC29;&amp;#xD328;&amp;#xC758; &amp;#xB300;&amp;#xACB0; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xBCC0;&amp;#xD568;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xACC4;&amp;#xC18D;&amp;#xB41C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;, &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xC720;&amp;#xB85C;, &amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC8C;&amp;#xC784;&amp;#xC5D0; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4E0;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://m.blog.naver.com/choijo2/60196192627&#34;&gt;https://m.blog.naver.com/choijo2/60196192627&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://en.wikipedia.org/wiki/Obfuscation_(software&#34;&gt;http://en.wikipedia.org/wiki/Obfuscation_(software)&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.quarkslab.com/dji-the-art-of-obfuscation.html&#34;&gt;https://blog.quarkslab.com/dji-the-art-of-obfuscation.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator&#34;&gt;https://github.com/obfuscator-llvm/obfuscator&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Anti-Debugging Part 3(KR) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F642;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xB2E4; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9C8;&amp;#xCE68; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C;(?) &amp;#xC774;&amp;#xB807;&amp;#xAC8C; Part 3&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Part 1&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xACE0; Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#x201C;&amp;#xD568;&amp;#xC815;&amp;#xCE74;&amp;#xB4DC;&amp;#x201D;&amp;#xCC98;&amp;#xB7FC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xB9C9;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC778; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;(&amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC9C1; &amp;#xBABB;&amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#x1F447; &amp;#x314E;&amp;#x314E;).&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/em&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/&#34;&gt;[Research] Anti-Debugging Part1(KR)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/03/24/OUYA77/Anti_part2/kr/&#34;&gt;[Research] Anti-Debugging Part2(KR)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xD638;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xC804;&amp;#xAC1C;&amp;#xB41C; &amp;#xB9CC;&amp;#xD07C; &amp;#xAE4C;&amp;#xBA39;&amp;#xC73C;&amp;#xC168;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744;&amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4DC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC; &amp;#xADF8;&amp;#xB7EC;&amp;#xC168;&amp;#xC744;&amp;#xAE4C;&amp;#xBD10; &amp;#xC81C;&amp;#xAC00; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xCE74;&amp;#xD230;(?)&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;del&gt;&amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC2EC;&amp;#xC740; &amp;#xC808;&amp;#xB300; &amp;#xC11E;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &amp;#xB9CC;&amp;#xB4E4;&amp;#xB2E4;&amp;#xAC00; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC744; &amp;#xC9DC;&amp;#xB294;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC11C; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB2D8;&amp;#xC758; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xBC1B;&amp;#xC740; &amp;#xAC83;&amp;#xB3C4; &amp;#xBE44;&amp;#xBC00;&amp;#xC774;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;Anti-Dubbugging-Part-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#Anti-Dubbugging-Part-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;Anti-Dubbugging Part &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;Anti-Dubbugging Part &amp;#xC694;&amp;#xC57D;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCE74;&amp;#xD230;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xACE0; &amp;#xADF8;&amp;#xAC78; &amp;#xB610; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; Part 1, 2&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB294; &lt;strong&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xC57C; &amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&lt;/strong&gt;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;&lt;/strong&gt;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC11C; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B0;&amp;#xD68C;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xACE0;&amp;#xB4E0; &amp;#xB7A8;&amp;#xC9C0; &amp;#xC120;&amp;#xC0DD;&amp;#xB2D8;&amp;#xC774; &amp;#x201C;&amp;#xC774; &amp;#xC7AC;&amp;#xB8CC;(&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;)&amp;#xAC00; &amp;#xBB54;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xC228;&amp;#xACA8;&amp;#xC57C; &amp;#xD574;!&amp;#x201D; &amp;#xB77C;&amp;#xACE0; &amp;#xBD88;&amp;#xC465; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC154;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xC2E0; &amp;#xAC70;&amp;#xC8E0;! &amp;#x1F525;&amp;#x1F468;&amp;#x200D;&amp;#x1F373;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;In Part 2&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;???: &amp;#xADF8;&amp;#xB7FC; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB0D0;! / 000: &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC78;&amp;#xB9B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB85C;&amp;#xC9C1;&amp;#xC778;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xACE0; &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB354;&amp;#xC6B1; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB140;&amp;#xC11D;&amp;#xC744; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xD5E4;&amp;#xCCD0; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Obfuscation&#34;&gt;&lt;a href=&#34;#1-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;1. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&#34;&gt;&lt;/a&gt;1. &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&lt;/h2&gt;&lt;h3 id=&#34;1-1-&amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xC18C;&amp;#xAC1C;&#34; class=&#34;headerlink&#34; title=&#34;1.1 &amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;/a&gt;1.1 &amp;#xC18C;&amp;#xAC1C;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;(Obfuscation)&lt;/strong&gt;&amp;#xB780; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Wikipedia&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB780;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB610;&amp;#xB294; &amp;#xBA38;&amp;#xC2E0;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xB78C; &amp;#xB610;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xC77C;&amp;#xC774;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC00;&amp;#xB3C5;&amp;#xC131; &amp;#xC800;&amp;#xD558;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4;&amp;#xC11C;, &lt;strong&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&lt;/strong&gt;&amp;#xD558;&amp;#xACE0;, &amp;#xC9C0;&amp;#xC801; &amp;#xC7AC;&amp;#xC0B0; &amp;#xBCF4;&amp;#xD638;, &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;, &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xD68C;&amp;#xD53C; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-&amp;#xBAA9;&amp;#xC801;&#34;&gt;&lt;a href=&#34;#1-2-&amp;#xBAA9;&amp;#xC801;&#34; class=&#34;headerlink&#34; title=&#34;1.2 &amp;#xBAA9;&amp;#xC801;&#34;&gt;&lt;/a&gt;1.2 &amp;#xBAA9;&amp;#xC801;&lt;/h3&gt;&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBD84;&amp;#xC11D; &amp;#xBC29;&amp;#xC9C0; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xB3C5;&amp;#xC131; &amp;#xC800;&amp;#xD558;:&lt;/strong&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB17C;&amp;#xB9AC; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xC228;&amp;#xACA8; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xBC29;&amp;#xD574;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131; &amp;#xC99D;&amp;#xAC00;:&lt;/strong&gt; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xBE44;&amp;#xC120;&amp;#xD615;&amp;#xC801; &amp;#xD750;&amp;#xB984;, &amp;#xB09C;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xC870;&amp;#xAC74; &amp;#xB4F1; &amp;#xC0BD;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xD328;&amp;#xD134; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C;:&lt;/strong&gt; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98; &amp;#xAE30;&amp;#xBC18; &amp;#xD0D0;&amp;#xC9C0; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xC624;&amp;#xD0D0; &amp;#xB610;&amp;#xB294; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C; &amp;#xC720;&amp;#xB3C4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xAC00; &amp;#x201C;&amp;#xC544;~ &amp;#xACE4;&amp;#xB780;&amp;#xD558;&amp;#xB124; ;;&amp;#x201D; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC5B4;&amp;#xB290;&amp;#xC815;&amp;#xB3C4; &amp;#xC774;&amp;#xB918;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD10;&amp;#xB3C4; &amp;#xBB34;&amp;#xBC29;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h3 id=&#34;1-3-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xBD84;&amp;#xB958;&#34;&gt;&lt;a href=&#34;#1-3-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xBD84;&amp;#xB958;&#34; class=&#34;headerlink&#34; title=&#34;1.3 &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBD84;&amp;#xB958;&#34;&gt;&lt;/a&gt;1.3 &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xBD84;&amp;#xB958;&lt;/h3&gt;&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC94;&amp;#xC8FC;&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Source Code Obfuscation)&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;: &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xACE0;&amp;#xC218;&amp;#xC900; &amp;#xC5B8;&amp;#xC5B4; (Java, JavaScript, Python &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xC2DC;&amp;#xC810;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xC804;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA9;&amp;#xC801;&lt;/strong&gt;: &amp;#xB0B4;&amp;#xBD80; &amp;#xBCF4;&amp;#xC548; &amp;#xD655;&amp;#xBCF4;, &amp;#xC678;&amp;#xC8FC;/&amp;#xACE0;&amp;#xAC1D;&amp;#xC6A9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC77C;&amp;#xBD80; &amp;#xACF5;&amp;#xAC1C; &amp;#xC2DC; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xBCF4;&amp;#xD638;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC885;&amp;#xC885; &amp;#xB0B4;&amp;#xBD80; &amp;#xB610;&amp;#xB294; &amp;#xACE0;&amp;#xAC1D;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC18C;&amp;#xC2A4; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC804;&amp;#xCCB4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB098; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC720;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC740; &amp;#xC77C;&amp;#xBD80; &amp;#xC218;&amp;#xC815;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC804;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870;&amp;#xB098; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#x201C;&amp;#xC2DD;&amp;#xBCC4;&amp;#xC790; &amp;#xC774;&amp;#xB984; &amp;#xBCC0;&amp;#xACBD;&amp;#x201D;, &amp;#x201C;&amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC7AC;&amp;#xBC30;&amp;#xC5F4;&amp;#x201D;, &amp;#x201C;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#x201D;, &amp;#x201C;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#x201D;&amp;#xC744; &amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Binary Obfuscation)&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589;&amp;#xD30C;&amp;#xC77C; (C, C++, Go &amp;#xB4F1;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC801;&amp;#xC6A9; &amp;#xC2DC;&amp;#xC810;&lt;/strong&gt;: &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC; &amp;#xD639;&amp;#xC740; &amp;#xC774;&amp;#xD6C4; &amp;#xBCC0;&amp;#xD615;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA9;&amp;#xC801;&lt;/strong&gt;: &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;, &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC720;&amp;#xCD9C; &amp;#xBC29;&amp;#xC9C0;, &amp;#xD06C;&amp;#xB799;/&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xBC29;&amp;#xC9C0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xB294; &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xBA70;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xB77C;&amp;#xC774;&amp;#xC120;&amp;#xC2A4; &amp;#xB85C;&amp;#xC9C1;, &amp;#xC778;&amp;#xC99D; &amp;#xCCB4;&amp;#xACC4; &amp;#xB4F1;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB098; &amp;#xACE0;&amp;#xAC1D;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD06C;&amp;#xB799;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#x201C;&amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xD638;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC81C;&amp;#xD488;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC81C;&amp;#xD488;&amp;#xC774;&amp;#xAE34; &amp;#xD558;&amp;#xC8E0;.. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;(IDA, Ghidra &amp;#xB4F1;)&amp;#xC758; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xAD50;&amp;#xB780;&amp;#xD558;&amp;#xBA70;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC5D0;&amp;#xB9CC; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD574;&amp;#xB3C5;&amp;#xB418;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#x201C;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xBCC0;&amp;#xD615;&amp;#x201D;, &amp;#x201C;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#x201D;, &amp;#x201C;&amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0BD;&amp;#xC785;&amp;#x201D;, &amp;#x201C;&amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1;&amp;#x201D;, &amp;#x201C;&amp;#xAC04;&amp;#xC811; &amp;#xC810;&amp;#xD504; &amp;#xBC0F; &amp;#xD638;&amp;#xCD9C;&amp;#x201D; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-4-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#1-4-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;1.4 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&#34;&gt;&lt;/a&gt;1.4 &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD788; &lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD558;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC65C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xAC00;? &amp;#xBB3C;&amp;#xC73C;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC4F0;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xACB0;&amp;#xAD6D; &lt;strong&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&lt;/strong&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC0AC;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xB178;&amp;#xD558;&amp;#xC6B0;, &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xB77C;&amp;#xC774;&amp;#xC120;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4; &amp;#xB4F1;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xD0B9;, &amp;#xBD88;&amp;#xBC95; &amp;#xC7AC;&amp;#xBC30;&amp;#xD3EC;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC545;&amp;#xC6A9;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xC5B4;&amp;#xC838; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB118;&amp;#xC5B4; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC57C;&amp;#xAE30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C;&amp;#xAC8C; Anti-Reversing &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; Part 1&amp;#xBD80;&amp;#xD130; &amp;#xACC4;&amp;#xC18D; &amp;#xBD10;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xC989; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB824;&amp;#xB294; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB97C; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xBC29;&amp;#xD574;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &lt;strong&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&lt;/strong&gt;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCDA5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB458;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB420; &amp;#xACBD;&amp;#xC6B0;, &amp;#xBD84;&amp;#xC11D;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xC57C;&amp;#xB9D0;&amp;#xB85C; &amp;#xBB34;&amp;#xC801;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC5B4; &amp;#xCCB4;&amp;#xACC4;&amp;#xB97C; &amp;#xB9C8;&amp;#xC8FC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xC148;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xC808;&amp;#xB300; &amp;#xB6AB;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC29;&amp;#xD328;&amp;#xB3C4; &amp;#xB6AB;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xC788;&amp;#xAE34; &amp;#xD558;&amp;#xC8E0;&amp;#x2026;)&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xC138;-&amp;#xAC00;&amp;#xC9C0;-&amp;#xCD95;&#34;&gt;&lt;a href=&#34;#2-&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758;-&amp;#xC138;-&amp;#xAC00;&amp;#xC9C0;-&amp;#xCD95;&#34; class=&#34;headerlink&#34; title=&#34;2.&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCD95;&#34;&gt;&lt;/a&gt;2.&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCD95;&lt;/h2&gt;&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;(&amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;h3 id=&#34;2-1-&amp;#xAD6C;&amp;#xC870;&amp;#xC801;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Structural-Obfuscation&#34;&gt;&lt;a href=&#34;#2-1-&amp;#xAD6C;&amp;#xC870;&amp;#xC801;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Structural-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Structural Obfuscation)&#34;&gt;&lt;/a&gt;2.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Structural Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xAD6C;&amp;#xC870; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xB4A4;&amp;#xD2C0;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC94;&amp;#xC8FC;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &lt;strong&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xD568;&amp;#xC218;&amp;#xB098; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&lt;/strong&gt;, &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xD3C9;&amp;#xD0C4;&amp;#xD654; (Control Flow Flattening)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%205.png&#34; alt=&#34;ref. https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;&lt;/p&gt;
&lt;p&gt;  ref. &lt;a href=&#34;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC6D0;&amp;#xB798;&amp;#xB294; &lt;code&gt;if&lt;/code&gt;, &lt;code&gt;while&lt;/code&gt;, &lt;code&gt;switch&lt;/code&gt; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xB358; &amp;#xB17C;&amp;#xB9AC; &amp;#xD750;&amp;#xB984;&amp;#xC744;, &amp;#xBAA8;&amp;#xB450; &amp;#xD558;&amp;#xB098;&amp;#xC758; &lt;code&gt;dispatcher&lt;/code&gt; &amp;#xB8E8;&amp;#xD504; &amp;#xC548;&amp;#xC5D0; &amp;#xB123;&amp;#xACE0;, &lt;strong&gt;&amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218;&lt;/strong&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC9;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB8E8;&amp;#xD504; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xC804;&amp;#xC774;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xD2B8;&amp;#xB9AC; &amp;#xBD84;&amp;#xD574;&amp;#xAC00; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xBE44;&amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5B4;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; Obfuscator-LLVM(OLLVM) &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0BD;&amp;#xC785; (Junk / Dead Code Insertion)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xB3D9;&amp;#xC791;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xC601;&amp;#xD5A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;(Junk Code)&amp;#xB098;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;(Dead Code)&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xB85C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;ul&gt;
&lt;li&gt;&amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xC5F0;&amp;#xC0B0; (&lt;code&gt;x = x;&lt;/code&gt;, &lt;code&gt;add eax, 0;&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBD84;&amp;#xAE30; (&lt;code&gt;if (false) { ... }&lt;/code&gt;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC04;&amp;#xC811; &amp;#xBD84;&amp;#xAE30; / &amp;#xD638;&amp;#xCD9C; (Indirect Branching)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;jmp eax&lt;/code&gt;, &lt;code&gt;call [ecx+0x10]&lt;/code&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xC8FC;&amp;#xC18C; &amp;#xACC4;&amp;#xC0B0; &amp;#xD6C4; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xCF54;&amp;#xB4DC; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;(API &amp;#xCD94;&amp;#xB860; &amp;#xBD88;&amp;#xAC00;).&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Opaque Predicate&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC870;&amp;#xAC74;&amp;#xC2DD;&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; true/false&amp;#xC778; &amp;#xBD84;&amp;#xAE30; &amp;#xC0BD;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC608;: &lt;code&gt;if ((x*x) &amp;gt;= 0)&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBB34;&amp;#xD574;&amp;#xD558;&amp;#xB098; &amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD750;&amp;#xB984; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC8FC;&amp;#xC758;&amp;#xD560; &amp;#xC810;:&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC635;&amp;#xC158;(&lt;code&gt;O2&lt;/code&gt;, &lt;code&gt;O3&lt;/code&gt;)&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC758;&amp;#xBBF8; &amp;#xC5C6;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xC81C;&amp;#xAC70;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &lt;strong&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC81C;&amp;#xAC70;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xD6A8;&amp;#xACFC;:&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504;&amp;#xB098; &amp;#xBD84;&amp;#xAE30; &amp;#xC18D;&amp;#xC5D0; &amp;#xC228;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xC2EC;&amp;#xB9AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xCE58;&amp;#xACE0; &amp;#xD5C8;&amp;#xD0C8;&amp;#xD568;&amp;#xC744; &amp;#xB290;&amp;#xB07C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC67C;&amp;#xCABD; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0DD;&amp;#xAE34; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB978;&amp;#xCABD; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB354;&amp;#xBBF8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xBA87; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xB123;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574;&amp;#xC9D0;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;  &lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; CFG &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xD750;&amp;#xB984; &amp;#xD30C;&amp;#xC545;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-2-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Data-Obfuscation&#34;&gt;&lt;a href=&#34;#2-2-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Data-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.2 &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Data Obfuscation)&#34;&gt;&lt;/a&gt;2.2 &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Data Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xC228;&amp;#xAE30;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xC5EC; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC94;&amp;#xC8FC;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;, &amp;#xC0C1;&amp;#xC218;, API &amp;#xBA85; &amp;#xB4F1; &lt;strong&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC2DC; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&lt;/strong&gt;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC228;&amp;#xAE30;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC554;&amp;#xD638;&amp;#xD654; (String Encryption)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC; &lt;code&gt;&amp;quot;CreateProcess&amp;quot;&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0C1;&amp;#xC218; &amp;#xC778;&amp;#xCF54;&amp;#xB529; (Constant Encoding)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC22B;&amp;#xC790; &amp;#xC0C1;&amp;#xC218;&amp;#xB098; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xAC04;&amp;#xC811; &amp;#xACC4;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC608;: &lt;code&gt;1337&lt;/code&gt; &amp;#x2192; &lt;code&gt;1000 + 337&lt;/code&gt;)&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC218;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC0B0;&amp;#xC220;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xB098; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xAC78;&amp;#xB9AC;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB300;&amp;#xD3ED; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;API &amp;#xD638;&amp;#xCD9C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; / Import Hiding&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;API &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD574;&amp;#xC2DC;&amp;#xB098; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xC228;&amp;#xAE30;&amp;#xACE0;, &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xB85C;&amp;#xB529;(&lt;code&gt;LoadLibrary&lt;/code&gt;, &lt;code&gt;GetProcAddress&lt;/code&gt;)&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IAT(Import Address Table)&amp;#xAC00; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC790;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D; &amp;#xBD88;&amp;#xAC00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB098; &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;(&amp;#xC2DD;&amp;#xBCC4;&amp;#xC790;, &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;, API &amp;#xB4F1;)&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-3-&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Algorithm-Obfuscation&#34;&gt;&lt;a href=&#34;#2-3-&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;-&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;-Algorithm-Obfuscation&#34; class=&#34;headerlink&#34; title=&#34;2.3 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Algorithm Obfuscation)&#34;&gt;&lt;/a&gt;2.3 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Algorithm Obfuscation)&lt;/h3&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774;&amp;#xB098; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xD589;&amp;#xC704; &amp;#xC790;&amp;#xCCB4;&lt;/strong&gt;&amp;#xB97C; &amp;#xB09C;&amp;#xD574;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xC5EC;, &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB72F;&amp;#xC5B4;&amp;#xBD10;&amp;#xB3C4; &amp;#x201C;&amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#x201D;&amp;#xB97C; &amp;#xC54C;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1; (Name Mangling) &amp;#xBC0F; &amp;#xC2EC;&amp;#xBCFC; &amp;#xC81C;&amp;#xAC70;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xD568;&amp;#xC218;/&amp;#xBCC0;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB85C;&amp;#xC368; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5; &amp;#xB9E5;&amp;#xB77D;&amp;#xC744; &amp;#xC77D;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; Hack The Drone 2024(Final) &amp;#xC5D0; &amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xD589;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xB3D9; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC218;&amp;#xB3C4; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; LFSR Galois &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB791; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xAC00; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC27D;&amp;#xAC8C; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB124;&amp;#xC784; &amp;#xB9F9;&amp;#xAE00;&amp;#xB9C1;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xACFC; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xBCC0;&amp;#xC218;&amp;#xBA85;&amp;#xC774; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xB418;&amp;#xC5B4; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC18C;&amp;#xC694;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC694;&amp;#xC998;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; GPT &amp;#xAC19;&amp;#xC740; LLM&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xC798; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC8FC;&amp;#xAE34; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xAD6C;&amp;#xC694; &amp;#x314E;.&amp;#x314E;&amp;#x2026;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Self-Modifying Code&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAC00;&amp;#xC0C1; &amp;#xBA38;&amp;#xC2E0; &amp;#xAE30;&amp;#xBC18; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; (Virtualization Obfuscation)&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC790;&amp;#xCCB4; &amp;#xAC00;&amp;#xC0C1; ISA&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0; &amp;#xD574;&amp;#xC11D; &amp;#xB8E8;&amp;#xD2F4; &amp;#xC5C6;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x1F50D; &lt;em&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;strong&gt;&amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#xC870;&amp;#xCC28;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-Obfuscator-LLVM-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#3-Obfuscator-LLVM-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;3. Obfuscator-LLVM &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;3. Obfuscator-LLVM &amp;#xC2E4;&amp;#xC2B5;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;OLLVM(Obfuscator-LLVM)&lt;/strong&gt; &amp;#xC740;, &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC778; &lt;strong&gt;LLVM&lt;/strong&gt;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &lt;strong&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5; &amp;#xD655;&amp;#xC7A5;&amp;#xD310;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6D0;&amp;#xB798; LLVM&amp;#xC740; &amp;#x201C;&amp;#xD074;&amp;#xB9B0;&amp;#xD55C;&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCD98; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC9C4;&amp;#xB4E4;&amp;#xC774; LLVM&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC6CC;&amp;#xB099; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0; &amp;#xCC29;&amp;#xC548;&amp;#xD574;&amp;#xC11C;, &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE61;&amp;#xC138;&amp;#xAC8C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xADF8;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; OLLVM&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;OLLVM&amp;#xC740; C/C++ &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD560; &amp;#xB54C; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xD328;&amp;#xC2A4;(pass)&lt;/strong&gt; &amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xD615;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774;, &amp;#xADF8;&amp;#xB0E5; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xD574;&amp;#xB3C4; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-1-OLLVM&amp;#xC6A9;-Clang-&amp;#xBE4C;&amp;#xB4DC;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-1-OLLVM&amp;#xC6A9;-Clang-&amp;#xBE4C;&amp;#xB4DC;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3.1 OLLVM&amp;#xC6A9; Clang &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3.1 OLLVM&amp;#xC6A9; Clang &amp;#xBE4C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Installation&#34;&gt;https://github.com/obfuscator-llvm/obfuscator/wiki/Installation&lt;/a&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; -b llvm-4.0 https://github.com/obfuscator-llvm/obfuscator.git
$ mkdir build &amp;amp;&amp;amp; &lt;span class=&#34;hljs-built_in&#34;&gt;cd&lt;/span&gt; build
$ cmake -DCMAKE_BUILD_TYPE=Release ../obfuscator/
$ make -j7&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xC880; &amp;#xB098;&amp;#xC11C; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC92C;&amp;#xC5B4;&amp;#xC694;. &amp;#xD639;&amp;#xC2DC; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xB098;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xB85C;&amp;#xADF8; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xACE0; &amp;#xD2B8;&amp;#xB7EC;&amp;#xBE14;&amp;#xC288;&amp;#xD305;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;obfuscator/tools/clang/lib/CodeGen/CGOpenMPRuntime.cpp:6275, 6321, 6400&lt;/p&gt;
&lt;p&gt;&lt;code&gt;error:lambda parameter &amp;#x2018;CGF&amp;#x2019; previously declared as a capture&lt;/code&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &lt;code&gt;&amp;amp;CGF&lt;/code&gt; &amp;#xC81C;&amp;#xAC70;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;auto&lt;/span&gt; &amp;amp;&amp;amp;BeginThenGen = [&amp;amp;D, &amp;amp;CGF, Device, &amp;amp;Info, &amp;amp;CodeGen, &amp;amp;NoPrivAction](...)
&amp;#x2193;
&lt;span class=&#34;hljs-keyword&#34;&gt;auto&lt;/span&gt; &amp;amp;&amp;amp;BeginThenGen = [&amp;amp;D, Device, &amp;amp;Info, &amp;amp;CodeGen, &amp;amp;NoPrivAction](...)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;obfuscator/include/llvm/ExecutionEngine/Orc/OrcRemoteTargetClient.h:696&lt;/p&gt;
&lt;p&gt;&lt;code&gt;error: cannot convert&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;char&lt;/code&gt; &amp;#x2192; &lt;code&gt;uint8_t&lt;/code&gt; &amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Expected&amp;lt;&lt;span class=&#34;hljs-built_in&#34;&gt;std&lt;/span&gt;::&lt;span class=&#34;hljs-built_in&#34;&gt;vector&lt;/span&gt;&amp;lt;&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;&amp;gt;&amp;gt; &lt;span class=&#34;hljs-title&#34;&gt;readMem&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(...)&lt;/span&gt; &lt;/span&gt;{ ... }
&amp;#x2193;
&lt;span class=&#34;hljs-function&#34;&gt;Expected&amp;lt;&lt;span class=&#34;hljs-built_in&#34;&gt;std&lt;/span&gt;::&lt;span class=&#34;hljs-built_in&#34;&gt;vector&lt;/span&gt;&amp;lt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint8_t&lt;/span&gt;&amp;gt;&amp;gt; &lt;span class=&#34;hljs-title&#34;&gt;readMem&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(...)&lt;/span&gt; &lt;/span&gt;{ ... }
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC798;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; OLLVM &amp;#xC6A9; clang&amp;#xC774; &amp;#xC798; &amp;#xB098;&amp;#xD0C0;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;3-2-OLLVM-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#3-2-OLLVM-&amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;3.2 OLLVM &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&#34;&gt;&lt;/a&gt;3.2 OLLVM &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;Obfuscator-LLVM&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740;, Clang&amp;#xC744; &amp;#xD1B5;&amp;#xD574; LLVM &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;(-mllvm)&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Features&#34;&gt;https://github.com/obfuscator-llvm/obfuscator/wiki/Features&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;fla&lt;/code&gt;: &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984; &amp;#xD3C9;&amp;#xD0C4;&amp;#xD654;(Control Flow Flattening)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;sub&lt;/code&gt;: &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xCE58;&amp;#xD658;(Instruction Substitution)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;bcf&lt;/code&gt;: &amp;#xAC00;&amp;#xC9DC; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984;(Bogus Control Flow)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB610;, &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xB9CC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator/wiki/Functions-annotations&#34;&gt;&amp;#xD568;&amp;#xC218; &amp;#xC5B4;&amp;#xB178;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&lt;/a&gt; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xCC38;&amp;#xACE0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;3-3-&amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;a href=&#34;#3-3-&amp;#xC2E4;&amp;#xC2B5;&#34; class=&#34;headerlink&#34; title=&#34;3.3 &amp;#xC2E4;&amp;#xC2B5;&#34;&gt;&lt;/a&gt;3.3 &amp;#xC2E4;&amp;#xC2B5;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// flatten_example.c&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;secret_function&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (x &amp;gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x * &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;;
    } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; x - &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;;
    }
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; value = &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; result = secret_function(value);
    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Result: %d\n&amp;quot;&lt;/span&gt;, result);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ clang flatten_example.c -o flatten_example_norm
$ path_to_the/build/bin/clang -mllvm -fla flatten_example.c -o flatten_example_obf&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB124; &amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC67C;&amp;#xCABD;&amp;#xC774; &lt;code&gt;flatten_example_norm&lt;/code&gt; &amp;#xC774;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC774; &lt;code&gt;flatten_example_obf&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB41C; &lt;code&gt;secret_function&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;secret_function&lt;/code&gt; &amp;#xC758; CFG&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC8FC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC778;&amp;#xB370; &amp;#xBC8C;&amp;#xC368;&amp;#xBD80;&amp;#xD130; &amp;#xADF9;&amp;#xBA85;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB108;&amp;#xBB34;&amp;#xB098; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;4-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#4-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;4. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;4. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;h3 id=&#34;&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;&amp;#xD55C;&amp;#xACC4;&lt;/h3&gt;&lt;p&gt;&amp;#xBB3C;&amp;#xB860; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xD55C;&amp;#xACC4;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;:&lt;/strong&gt; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xB294; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774;&amp;#xB098; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD84;&amp;#xAE30;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC800;&amp;#xD558;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB3C4;&amp;#xAD6C; &amp;#xBC1C;&amp;#xC804;&amp;#xC758; &amp;#xC5ED;&amp;#xC2B5;:&lt;/strong&gt; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xAE30;, &amp;#xB514;&amp;#xC635;&amp;#xD4E8;&amp;#xC2A4;&amp;#xCF00;&amp;#xC774;&amp;#xD130;(Deobfuscator) &amp;#xB4F1; &amp;#xBD84;&amp;#xC11D; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC77C;&amp;#xBD80; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xAC8C; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBC95;&amp;#xC801;&amp;#xB7;&amp;#xC724;&amp;#xB9AC;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;:&lt;/strong&gt; &amp;#xC0C1;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xB97C; &amp;#xC800;&amp;#xD558;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB54C;&amp;#xB85C;&amp;#xB294; &amp;#xBC95;&amp;#xC801; &amp;#xBD84;&amp;#xC7C1;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;a href=&#34;#&amp;#xC758;&amp;#xC758;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC758;&amp;#xC758;&#34;&gt;&lt;/a&gt;&amp;#xC758;&amp;#xC758;&lt;/h3&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC;, &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xADF8; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD06C;&amp;#xAC8C; &lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801;(Structural)&lt;/strong&gt;, &lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130;(Data)&lt;/strong&gt;, &lt;strong&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;(Algorithm)&lt;/strong&gt; &amp;#xCE21;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC81C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xB958;&amp;#xB97C; &amp;#xB118;&amp;#xC5B4;, &amp;#xC774; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xBCF5;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xB354;&amp;#xC6B1;&amp;#xC774;, &amp;#xAE30;&amp;#xC874; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC758; &amp;#xBCC0;&amp;#xD615;&amp;#xC740; &amp;#xBB3C;&amp;#xB860;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBCC0;&amp;#xC885; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xAFB8;&amp;#xC900;&amp;#xD788; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA70; &amp;#xBD84;&amp;#xC11D;&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xC744; &amp;#xB354;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xBE61;&amp;#xC138;&amp;#xAC8C; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC18C;&amp;#xBB38;&amp;#xB09C; &amp;#xC0C1;&amp;#xC6A9; &amp;#xB4DC;&amp;#xB860; DJI &amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: 8&amp;#xAC1C;&amp;#xC758; DEX &amp;#xD30C;&amp;#xC77C;&amp;#xC744; 128KB &amp;#xCCAD;&amp;#xD06C; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01;&amp;#xAC01;&amp;#xC744; &lt;strong&gt;AES-256&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: &lt;code&gt;com.dji.industry.pilot&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xACFC; &amp;#xD558;&amp;#xB4DC;&amp;#xCF54;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xC218;&amp;#xB97C; &amp;#xC870;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;XOR &amp;#xAE30;&amp;#xBC18; &amp;#xD0A4;&lt;/strong&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&lt;/strong&gt;: JNI &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;strong&gt;3&amp;#xB2E8;&amp;#xACC4; &amp;#xD2B8;&amp;#xB7A8;&amp;#xD384;&amp;#xB9B0; &amp;#xD568;&amp;#xC218;&lt;/strong&gt;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0; &amp;#xC2E4;&amp;#xC81C; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xD604;&amp;#xB300;&amp;#xC758; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB2E4;&amp;#xCE35;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xD654;&amp;#xB41C; &amp;#xBCF4;&amp;#xD638; &amp;#xCCB4;&amp;#xACC4;&amp;#xB97C; &amp;#xAC16;&amp;#xCD94;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;,  &amp;#xB9E4;&amp;#xB144; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xD615; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB354;&amp;#xC6B1; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC544;&amp;#xAC00;, &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xAC00;&amp;#xC9DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xD134; &amp;#xC0DD;&amp;#xC131;&amp;#xC774;&amp;#xB098; &amp;#xC591;&amp;#xC790; &amp;#xC554;&amp;#xD638; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xD0A4; &amp;#xAD50;&amp;#xD658; &amp;#xB4F1; &amp;#xCC28;&amp;#xC138;&amp;#xB300; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2DC;&amp;#xD5D8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xBA70; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xB3C4; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xBC1C;&amp;#xC804;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 1,2,3&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA70; &amp;#xACC4;&amp;#xC18D;&amp;#xD55C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xC9C0;&amp;#xB9CC;, &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBCF4;&amp;#xD638; &amp;#xACC4;&amp;#xCE35;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC77C; &amp;#xBFD0;, &amp;#xAD81;&amp;#xADF9;&amp;#xC801;&amp;#xC778; &amp;#xC548;&amp;#xC804;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD568;&amp;#x201D;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Quarkslab &amp;#xB9AC;&amp;#xC11C;&amp;#xCE58; &amp;#xD300;&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC640; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xACB0;&amp;#xAD6D; &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C0;&amp;#xD0A4;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2F8;&amp;#xC6C0;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xC640; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xB300;&amp;#xACB0; &amp;#xAD6C;&amp;#xB3C4; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xC9C4;&amp;#xD654;&amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC220; &amp;#xC804;&amp;#xBC18;&amp;#xC758; &amp;#xBC1C;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBCF4;&amp;#xD638;&amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD0D0;&amp;#xC9C0; &amp;#xD68C;&amp;#xD53C;&amp;#xC640; &amp;#xBD84;&amp;#xC11D; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xBC29;&amp;#xC5B4; &amp;#xC591;&amp;#xCABD; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&lt;/strong&gt;&amp;#xB85C; &amp;#xC790;&amp;#xB9AC; &amp;#xC7A1;&amp;#xC740; &amp;#xC148;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xBC29;&amp;#xC5B4;&amp;#xC758; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xBC8C;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xC218;&amp;#xB2E8;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xBC29;&amp;#xD328;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xB294; &amp;#xB048;&amp;#xC9C8;&amp;#xAE30;&amp;#xAC8C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xBA70;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; &amp;#xBC29;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xC774; &amp;#xC2F8;&amp;#xC6C0;&amp;#xC740; &amp;#xB05D;&amp;#xB0A0; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xB294; &amp;#xB9CC;&amp;#xD07C;, &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xBC29;&amp;#xC5B4;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xB04A;&amp;#xC784;&amp;#xC5C6;&amp;#xC774; &amp;#xC9C4;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC7A5;&amp;#xBCBD;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;strong&gt;&amp;#xB354; &amp;#xB098;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC9C4;&amp;#xD654;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&lt;/strong&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB77C;&amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC3D;&amp;#xACFC; &amp;#xBC29;&amp;#xD328;&amp;#xC758; &amp;#xB300;&amp;#xACB0; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xBCC0;&amp;#xD568;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xACC4;&amp;#xC18D;&amp;#xB41C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;, &amp;#xAC01;&amp;#xC790;&amp;#xC758; &amp;#xC774;&amp;#xC720;&amp;#xB85C;, &amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC8C;&amp;#xC784;&amp;#xC5D0; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4E0;&amp;#xB2E4;.&amp;#x201D;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://m.blog.naver.com/choijo2/60196192627&#34;&gt;https://m.blog.naver.com/choijo2/60196192627&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://en.wikipedia.org/wiki/Obfuscation_(software&#34;&gt;http://en.wikipedia.org/wiki/Obfuscation_(software)&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.quarkslab.com/dji-the-art-of-obfuscation.html&#34;&gt;https://blog.quarkslab.com/dji-the-art-of-obfuscation.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&#34;&gt;https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/obfuscator-llvm/obfuscator&#34;&gt;https://github.com/obfuscator-llvm/obfuscator&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/04/28/OUYA77/Anti_part3/kr/image.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/04/28/ouya77/anti_part3/kr/">

  <title>[Research] Anti-Debugging Part 3(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-04-28 22:15" pubdate>
      2025 4 28 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      5.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      108
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Anti-Debugging Part 3(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; OUYA77 &#xC785;&#xB2C8;&#xB2E4;. &#x1F642;</p>
<p>&#xB098;&#xC911;&#xC5D0; &#xAE30;&#xD68C;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; &#xBE14;&#xB85C;&#xADF8;&#xC5D0;&#xC11C; &#xB09C;&#xB3C5;&#xD654;&#xB3C4; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xB2E4; &#xD588;&#xB294;&#xB370; &#xB9C8;&#xCE68; &#xAE30;&#xD68C;&#xAC00; &#xB418;&#xC5B4;&#xC11C;(?) &#xC774;&#xB807;&#xAC8C; Part 3&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Part 1&#xC5D0;&#xC11C;&#xB294; &#xB514;&#xBC84;&#xAE45;&#xACFC; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xACE0; Part 2&#xC5D0;&#xC11C;&#xB294; &#x201C;&#xD568;&#xC815;&#xCE74;&#xB4DC;&#x201D;&#xCC98;&#xB7FC; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xD2B9;&#xC815; &#xB3D9;&#xC791;&#xC744; &#xB9C9;&#xC73C;&#xB824; &#xD560; &#xB54C; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC778; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xC6B0;&#xD68C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>(&#xD639;&#xC2DC; &#xC544;&#xC9C1; &#xBABB;&#xBCF4;&#xC168;&#xB2E4;&#xBA74; &#x1F447; &#x314E;&#x314E;).</p>
<blockquote>
<p><em>&#xC9C0;&#xB09C; &#xD30C;&#xD2B8; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</em><br><a href="https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/">[Research] Anti-Debugging Part1(KR)</a><br><a href="https://hackyboiz.github.io/2025/03/24/OUYA77/Anti_part2/kr/">[Research] Anti-Debugging Part2(KR)</a></p>
</blockquote>
<p>&#xAE34; &#xD638;&#xD761;&#xC73C;&#xB85C; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xC804;&#xAC1C;&#xB41C; &#xB9CC;&#xD07C; &#xAE4C;&#xBA39;&#xC73C;&#xC168;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC744;&#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xC774; &#xB4DC;&#xB294;&#xB370;&#xC694;. &#xD639;&#xC2DC; &#xADF8;&#xB7EC;&#xC168;&#xC744;&#xAE4C;&#xBD10; &#xC81C;&#xAC00; &#xAC04;&#xB2E8;&#xD55C; &#xCE74;&#xD230;(?)&#xC744; &#xC900;&#xBE44;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. <del>&#xB9CC;&#xB4DC;&#xB294;&#xB370; &#xC0AC;&#xC2EC;&#xC740; &#xC808;&#xB300; &#xC11E;&#xC9C0; &#xC54A;&#xC558;&#xC5B4;&#xC694;. &#xB9CC;&#xB4E4;&#xB2E4;&#xAC00; &#xD504;&#xB808;&#xC784;&#xC744; &#xC9DC;&#xB294;&#xAC8C; &#xC5B4;&#xB824;&#xC6CC;&#xC11C; &#xC804;&#xBB38;&#xAC00;&#xB2D8;&#xC758; &#xB3C4;&#xC6C0;&#xC744; &#xBC1B;&#xC740; &#xAC83;&#xB3C4; &#xBE44;&#xBC00;&#xC774;&#xB78D;&#xB2C8;&#xB2E4;.</del></p>
<h2 id="Anti-Dubbugging-Part-&#xC694;&#xC57D;"><a href="#Anti-Dubbugging-Part-&#xC694;&#xC57D;" class="headerlink" title="Anti-Dubbugging Part &#xC694;&#xC57D;"></a>Anti-Dubbugging Part &#xC694;&#xC57D;</h2><p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC704; &#xCE74;&#xD230;&#xC5D0;&#xC11C;&#xB3C4; &#xBCF4;&#xC168;&#xB2E4;&#xC2DC;&#xD53C; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xB9C9;&#xAE30; &#xC704;&#xD574; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xB098;&#xC654;&#xACE0; &#xADF8;&#xAC78; &#xB610; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; Part 1, 2&#xC5D0; &#xAC78;&#xCCD0;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC758; &#xD55C;&#xACC4;&#xB294; <strong>&#xACB0;&#xAD6D; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC62C;&#xB77C;&#xAC00;&#xC57C; &#xD558;&#xB2E4; &#xBCF4;&#xB2C8;</strong>, &#xADF8;&#xB9AC;&#xACE0; <strong>&#xBD84;&#xC11D;&#xC758; &#xB300;&#xC0C1;&#xC774; &#xB418;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC790;&#xCCB4;&#xAC00; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC8FC;&#xC5B4;&#xC9C0;&#xB2E4; &#xBCF4;&#xB2C8;</strong>, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC758; &#xB85C;&#xC9C1;&#xC744; &#xD30C;&#xC545;&#xD574;&#xC11C; &#xD328;&#xCE58;&#xD558;&#xB294; &#xB4F1;&#xC73C;&#xB85C; &#xC6B0;&#xD68C;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xACE0;&#xB4E0; &#xB7A8;&#xC9C0; &#xC120;&#xC0DD;&#xB2D8;&#xC774; &#x201C;&#xC774; &#xC7AC;&#xB8CC;(&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xB85C;&#xC9C1;)&#xAC00; &#xBB54;&#xC9C0; &#xBAA8;&#xB974;&#xAC8C; &#xC228;&#xACA8;&#xC57C; &#xD574;!&#x201D; &#xB77C;&#xACE0; &#xBD88;&#xC465; &#xB098;&#xD0C0;&#xB098;&#xC154;&#xC11C; &#xB09C;&#xB3C5;&#xD654;&#xD558;&#xB77C;&#xACE0; &#xD558;&#xC2E0; &#xAC70;&#xC8E0;! &#x1F525;&#x1F468;&#x200D;&#x1F373;</p>
<blockquote>
<p>In Part 2&#x2026;</p>
<p><img src="image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>???: &#xADF8;&#xB7FC; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB974;&#xAC8C; &#xD558;&#xBA74; &#xB418;&#xC9C0; &#xC54A;&#xB0D0;! / 000: &#xC5B4;&#xB5BB;&#xAC8C;!!</p>
</blockquote>
</blockquote>
<p>&#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xC801;&#xC6A9;&#xB41C; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC774; &#xAC78;&#xB9B0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC774; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45; &#xB85C;&#xC9C1;&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xACE0; &#xADF8;&#xB807;&#xAE30;&#xC5D0; &#xBD84;&#xC11D;&#xD558;&#xAE30;&#xAC00; &#xB354;&#xC6B1; &#xAE4C;&#xB2E4;&#xB86D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC774;&#xBC88; Part 3&#xC5D0;&#xC11C;&#xB294; &#xC774; <strong>&#xB09C;&#xB3C5;&#xD654;</strong>&#xB77C;&#xB294; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xB140;&#xC11D;&#xC744; &#xC9D1;&#xC911;&#xC801;&#xC73C;&#xB85C; &#xD30C;&#xD5E4;&#xCCD0; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h2 id="1-&#xB09C;&#xB3C5;&#xD654;-Obfuscation"><a href="#1-&#xB09C;&#xB3C5;&#xD654;-Obfuscation" class="headerlink" title="1. &#xB09C;&#xB3C5;&#xD654;(Obfuscation)"></a>1. &#xB09C;&#xB3C5;&#xD654;(Obfuscation)</h2><h3 id="1-1-&#xC18C;&#xAC1C;"><a href="#1-1-&#xC18C;&#xAC1C;" class="headerlink" title="1.1 &#xC18C;&#xAC1C;"></a>1.1 &#xC18C;&#xAC1C;</h3><ul>
<li><strong>&#xB09C;&#xB3C5;&#xD654;(Obfuscation)</strong>&#xB780; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. Wikipedia&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;:</li>
</ul>
<blockquote>
<p>&#x201C;&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xB09C;&#xB3C5;&#xD654;&#xB780;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xB610;&#xB294; &#xBA38;&#xC2E0;&#xCF54;&#xB4DC;&#xB97C; &#xB09C;&#xB3C5;&#xD654;&#xD558;&#xC5EC; &#xC0AC;&#xB78C; &#xB610;&#xB294; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;&#xAC00; &#xC774;&#xD574;&#xD558;&#xAC70;&#xB098; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xD798;&#xB4E4;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xC77C;&#xC774;&#xB2E4;.&#x201D;</p>
</blockquote>
<p>&#xC774;&#xB294; &#xB2E8;&#xC21C;&#xD55C; &#xCF54;&#xB4DC; &#xAC00;&#xB3C5;&#xC131; &#xC800;&#xD558;&#xB97C; &#xB118;&#xC5B4;&#xC11C;, <strong>&#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1;, &#xB514;&#xBC84;&#xAE45;, &#xC815;&#xC801; &#xBD84;&#xC11D; &#xB4F1;&#xC744; &#xBC29;&#xD574;</strong>&#xD558;&#xACE0;, &#xC9C0;&#xC801; &#xC7AC;&#xC0B0; &#xBCF4;&#xD638;, &#xBCF4;&#xC548; &#xAC15;&#xD654;, &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xBD84;&#xC11D; &#xD68C;&#xD53C; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xBAA9;&#xC801;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-2-&#xBAA9;&#xC801;"><a href="#1-2-&#xBAA9;&#xC801;" class="headerlink" title="1.2 &#xBAA9;&#xC801;"></a>1.2 &#xBAA9;&#xC801;</h3><p>&#xB09C;&#xB3C5;&#xD654;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74;&#xC11C;&#xB3C4;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xBD84;&#xC11D; &#xBC29;&#xC9C0; &#xBAA9;&#xC801;&#xC744; &#xB2EC;&#xC131;&#xD569;&#xB2C8;&#xB2E4;:</p>
<ul>
<li><strong>&#xAC00;&#xB3C5;&#xC131; &#xC800;&#xD558;:</strong> &#xCF54;&#xB4DC;&#xC758; &#xB17C;&#xB9AC; &#xAD6C;&#xC870;&#xC640; &#xC758;&#xBBF8;&#xB97C; &#xC228;&#xACA8; &#xBD84;&#xC11D;&#xC790;&#xC758; &#xC774;&#xD574;&#xB97C; &#xBC29;&#xD574;</li>
<li><strong>&#xAD6C;&#xC870;&#xC801; &#xBCF5;&#xC7A1;&#xC131; &#xC99D;&#xAC00;:</strong> &#xBD88;&#xD544;&#xC694;&#xD55C; &#xC5F0;&#xC0B0;, &#xBE44;&#xC120;&#xD615;&#xC801; &#xD750;&#xB984;, &#xB09C;&#xC218; &#xAE30;&#xBC18; &#xC870;&#xAC74; &#xB4F1; &#xC0BD;&#xC785;</li>
<li><strong>&#xD328;&#xD134; &#xD0D0;&#xC9C0; &#xD68C;&#xD53C;:</strong> &#xC2DC;&#xADF8;&#xB2C8;&#xCC98; &#xAE30;&#xBC18; &#xD0D0;&#xC9C0; &#xB3C4;&#xAD6C;&#xC758; &#xC624;&#xD0D0; &#xB610;&#xB294; &#xD0D0;&#xC9C0; &#xD68C;&#xD53C; &#xC720;&#xB3C4;</li>
</ul>
<p>&#xADF8;&#xB798;&#xC11C; &#xBD84;&#xC11D;&#xAC00;&#xAC00; &#x201C;&#xC544;~ &#xACE4;&#xB780;&#xD558;&#xB124; ;;&#x201D; &#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xB2E4;&#xBA74; &#xB09C;&#xB3C5;&#xD654;&#xC758; &#xBAA9;&#xC801;&#xC744; &#xC5B4;&#xB290;&#xC815;&#xB3C4; &#xC774;&#xB918;&#xB2E4;&#xACE0; &#xBD10;&#xB3C4; &#xBB34;&#xBC29;&#xD569;&#xB2C8;&#xB2E4;. </p>
<h3 id="1-3-&#xB09C;&#xB3C5;&#xD654;&#xC758;-&#xBD84;&#xB958;"><a href="#1-3-&#xB09C;&#xB3C5;&#xD654;&#xC758;-&#xBD84;&#xB958;" class="headerlink" title="1.3 &#xB09C;&#xB3C5;&#xD654;&#xC758; &#xBD84;&#xB958;"></a>1.3 &#xB09C;&#xB3C5;&#xD654;&#xC758; &#xBD84;&#xB958;</h3><p>&#xB09C;&#xB3C5;&#xD654;&#xB294; &#xD06C;&#xAC8C; &#xB450; &#xAC00;&#xC9C0; &#xBC94;&#xC8FC;&#xB85C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xB09C;&#xB3C5;&#xD654; (Source Code Obfuscation)</strong></li>
</ol>
<ul>
<li><strong>&#xC801;&#xC6A9; &#xB300;&#xC0C1;</strong>: &#xC0AC;&#xB78C;&#xC774; &#xC791;&#xC131;&#xD55C; &#xACE0;&#xC218;&#xC900; &#xC5B8;&#xC5B4; (Java, JavaScript, Python &#xB4F1;)</li>
<li><strong>&#xC801;&#xC6A9; &#xC2DC;&#xC810;</strong>: &#xCEF4;&#xD30C;&#xC77C; &#xC774;&#xC804;</li>
<li><strong>&#xBAA9;&#xC801;</strong>: &#xB0B4;&#xBD80; &#xBCF4;&#xC548; &#xD655;&#xBCF4;, &#xC678;&#xC8FC;/&#xACE0;&#xAC1D;&#xC6A9; &#xCF54;&#xB4DC; &#xC77C;&#xBD80; &#xACF5;&#xAC1C; &#xC2DC; &#xD50C;&#xB85C;&#xC6B0; &#xBCF4;&#xD638;</li>
</ul>
<p>&#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xC885;&#xC885; &#xB0B4;&#xBD80; &#xB610;&#xB294; &#xACE0;&#xAC1D;&#xC5D0;&#xAC8C; &#xC18C;&#xC2A4; &#xC77C;&#xBD80;&#xB97C; &#xACF5;&#xAC1C;&#xD574;&#xC57C; &#xD560; &#xACBD;&#xC6B0;, &#xC804;&#xCCB4; &#xB85C;&#xC9C1;&#xC774;&#xB098; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC720;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xB294; &#xC0AC;&#xB78C;&#xC740; &#xC77C;&#xBD80; &#xC218;&#xC815;&#xC740; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC;, &#xC804;&#xCCB4; &#xAD6C;&#xC870;&#xB098; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC; &#xAE30;&#xBC95;&#xC73C;&#xB85C;&#xB294; &#x201C;&#xC2DD;&#xBCC4;&#xC790; &#xC774;&#xB984; &#xBCC0;&#xACBD;&#x201D;, &#x201C;&#xCF54;&#xB4DC; &#xBE14;&#xB85D; &#xC7AC;&#xBC30;&#xC5F4;&#x201D;, &#x201C;&#xC81C;&#xC5B4; &#xD750;&#xB984; &#xB09C;&#xB3C5;&#xD654;&#x201D;, &#x201C;&#xBB38;&#xC790;&#xC5F4; &#xC778;&#xCF54;&#xB529;&#x201D;&#xC744; &#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654; (Binary Obfuscation)</strong></li>
</ol>
<ul>
<li><strong>&#xC801;&#xC6A9; &#xB300;&#xC0C1;</strong>: &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xC2E4;&#xD589;&#xD30C;&#xC77C; (C, C++, Go &#xB4F1;)</li>
<li><strong>&#xC801;&#xC6A9; &#xC2DC;&#xC810;</strong>: &#xCEF4;&#xD30C;&#xC77C; &#xC2DC; &#xD639;&#xC740; &#xC774;&#xD6C4; &#xBCC0;&#xD615;</li>
<li><strong>&#xBAA9;&#xC801;</strong>: &#xC81C;&#xD488; &#xBCF4;&#xD638;, &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xC720;&#xCD9C; &#xBC29;&#xC9C0;, &#xD06C;&#xB799;/&#xB9AC;&#xBC84;&#xC2F1; &#xBC29;&#xC9C0;</li>
</ul>
<p>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xB294; <strong>&#xC2E4;&#xC81C; &#xBC30;&#xD3EC;&#xB418;&#xB294; &#xC81C;&#xD488; &#xBCF4;&#xD638;&#xC758; &#xD575;&#xC2EC;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC0C1;&#xC6A9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xB300;&#xBD80;&#xBD84; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD615;&#xD0DC;&#xB85C; &#xBC30;&#xD3EC;&#xB418;&#xBA70;, &#xC774; &#xC548;&#xC5D0;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC54C;&#xACE0;&#xB9AC;&#xC998;, &#xB77C;&#xC774;&#xC120;&#xC2A4; &#xB85C;&#xC9C1;, &#xC778;&#xC99D; &#xCCB4;&#xACC4; &#xB4F1;&#xC774; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74;, &#xACF5;&#xACA9;&#xC790;&#xB098; &#xACE0;&#xAC1D;&#xC774; &#xC774;&#xB97C; &#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1;&#xC744; &#xD558;&#xAC70;&#xB098; &#xD06C;&#xB799;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xC5EC;&#xAE30;&#xC11C;&#xB294; &#x201C;&#xC81C;&#xD488; &#xBCF4;&#xD638;&#x201D;&#xB77C;&#xACE0; &#xD588;&#xB294;&#xB370; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB3C4; &#xC81C;&#xD488;&#xC774;&#xB77C;&#xBA74; &#xC81C;&#xD488;&#xC774;&#xAE34; &#xD558;&#xC8E0;.. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC5D0;&#xB3C4; &#xC774; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;(IDA, Ghidra &#xB4F1;)&#xC758; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xBC29;&#xD574;&#xD558;&#xACE0; &#xB514;&#xBC84;&#xAE45; &#xD750;&#xB984;&#xC744; &#xAD50;&#xB780;&#xD558;&#xBA70;, &#xC2EC;&#xC9C0;&#xC5B4;&#xB294; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC5D0;&#xB9CC; &#xCF54;&#xB4DC;&#xAC00; &#xD574;&#xB3C5;&#xB418;&#xB294; &#xD615;&#xD0DC;&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC; &#xAE30;&#xBC95;&#xC73C;&#xB85C;&#xB294; &#x201C;&#xC81C;&#xC5B4; &#xD750;&#xB984; &#xBCC0;&#xD615;&#x201D;, &#x201C;&#xBB38;&#xC790;&#xC5F4; &#xC554;&#xD638;&#xD654;&#x201D;, &#x201C;&#xAC00;&#xC9DC; &#xCF54;&#xB4DC; &#xC0BD;&#xC785;&#x201D;, &#x201C;&#xB124;&#xC784; &#xB9F9;&#xAE00;&#xB9C1;&#x201D;, &#x201C;&#xAC04;&#xC811; &#xC810;&#xD504; &#xBC0F; &#xD638;&#xCD9C;&#x201D; &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-4-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xB09C;&#xB3C5;&#xD654;"><a href="#1-4-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xB09C;&#xB3C5;&#xD654;" class="headerlink" title="1.4 &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;"></a>1.4 &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;</h3><p>&#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xD2B9;&#xBCC4;&#xD788; <strong>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;</strong>&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB824; &#xD569;&#xB2C8;&#xB2E4;. &#xC65C; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xC911;&#xC694;&#xD55C;&#xAC00;? &#xBB3C;&#xC73C;&#xC2E0;&#xB2E4;&#xBA74;, &#xC774;&#xC720;&#xB294; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.  &#xC6B0;&#xB9AC;&#xAC00; &#xC4F0;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB300;&#xBD80;&#xBD84;&#xC740; &#xACB0;&#xAD6D; <strong>&#xBC14;&#xC774;&#xB108;&#xB9AC;</strong> &#xD615;&#xD0DC;&#xB85C; &#xC81C;&#xACF5;&#xB418;&#xB294;&#xB370;, &#xC5EC;&#xAE30;&#xC5D4; &#xAC1C;&#xBC1C;&#xC0AC;&#xC758; &#xD575;&#xC2EC; &#xB178;&#xD558;&#xC6B0;, &#xC54C;&#xACE0;&#xB9AC;&#xC998;, &#xB77C;&#xC774;&#xC120;&#xC2A4; &#xC815;&#xBCF4; &#xB4F1;&#xC774; &#xB2F4;&#xACA8;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xD06C;&#xB798;&#xD0B9;, &#xBD88;&#xBC95; &#xC7AC;&#xBC30;&#xD3EC;, &#xC2EC;&#xC9C0;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC545;&#xC6A9;&#xAE4C;&#xC9C0; &#xC774;&#xC5B4;&#xC838; &#xB2E8;&#xC21C;&#xD55C; &#xAE30;&#xC220;&#xC801; &#xACF5;&#xACA9;&#xC744; &#xB118;&#xC5B4; &#xC2EC;&#xAC01;&#xD55C; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xD53C;&#xD574;&#xB97C; &#xC57C;&#xAE30;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD544;&#xC694;&#xD55C;&#xAC8C; Anti-Reversing &#xAE30;&#xBC95;&#xC774;&#xACE0; &#xC6B0;&#xB9AC;&#xB294; &#xADF8;&#xC5D0; &#xB300;&#xD574;&#xC11C; Part 1&#xBD80;&#xD130; &#xACC4;&#xC18D; &#xBD10;&#xC624;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xB3D9;&#xC801; &#xBD84;&#xC11D;, &#xC989; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB0B4;&#xBD80;&#xB97C; &#xB4E4;&#xC5EC;&#xB2E4;&#xBCF4;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xB97C; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xAC10;&#xC9C0;&#xD558;&#xACE0; &#xBC29;&#xD574;&#xD55C;&#xB2E4;&#xBA74;, &#xB09C;&#xB3C5;&#xD654;&#xB294; <strong>&#xC815;&#xC801; &#xBD84;&#xC11D;</strong>&#xC744; &#xBC29;&#xD574;&#xD558;&#xB294; &#xB370; &#xCD08;&#xC810;&#xC744; &#xB9DE;&#xCDA5;&#xB2C8;&#xB2E4;. &#xC774; &#xB458;&#xC774; &#xACB0;&#xD569;&#xB420; &#xACBD;&#xC6B0;, &#xBD84;&#xC11D;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xADF8;&#xC57C;&#xB9D0;&#xB85C; &#xBB34;&#xC801;&#xACFC; &#xAC19;&#xC740; &#xBC29;&#xC5B4; &#xCCB4;&#xACC4;&#xB97C; &#xB9C8;&#xC8FC;&#xD558;&#xAC8C; &#xB418;&#xB294; &#xC148;&#xC774;&#xC8E0;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p><del>(&#xC808;&#xB300; &#xB6AB;&#xB9AC;&#xC9C0; &#xC54A;&#xB294; &#xBC29;&#xD328;&#xB3C4; &#xB6AB;&#xB294; &#xCC3D;&#xC774; &#xC788;&#xAE34; &#xD558;&#xC8E0;&#x2026;)</del></p>
</blockquote>
<h2 id="2-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xB09C;&#xB3C5;&#xD654;&#xC758;-&#xC138;-&#xAC00;&#xC9C0;-&#xCD95;"><a href="#2-&#xBC14;&#xC774;&#xB108;&#xB9AC;-&#xB09C;&#xB3C5;&#xD654;&#xC758;-&#xC138;-&#xAC00;&#xC9C0;-&#xCD95;" class="headerlink" title="2.&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xC758; &#xC138; &#xAC00;&#xC9C0; &#xCD95;"></a>2.&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xC758; &#xC138; &#xAC00;&#xC9C0; &#xCD95;</h2><p>&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xC74C; &#xC138; &#xAC00;&#xC9C0; &#xCE74;&#xD14C;&#xACE0;&#xB9AC;&#xB85C; &#xBD84;&#xB958;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>(&#xC77C;&#xBD80;&#xBD84;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC9DA;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<h3 id="2-1-&#xAD6C;&#xC870;&#xC801;-&#xB09C;&#xB3C5;&#xD654;-Structural-Obfuscation"><a href="#2-1-&#xAD6C;&#xC870;&#xC801;-&#xB09C;&#xB3C5;&#xD654;-Structural-Obfuscation" class="headerlink" title="2.1 &#xAD6C;&#xC870;&#xC801; &#xB09C;&#xB3C5;&#xD654; (Structural Obfuscation)"></a>2.1 &#xAD6C;&#xC870;&#xC801; &#xB09C;&#xB3C5;&#xD654; (Structural Obfuscation)</h3><blockquote>
<p>&#xCF54;&#xB4DC;&#xC758; &#xC81C;&#xC5B4; &#xD750;&#xB984; &#xAD6C;&#xC870; &#xC790;&#xCCB4;&#xB97C; &#xB4A4;&#xD2C0;&#xC5B4; &#xBD84;&#xC11D;&#xC774; &#xC5B4;&#xB824;&#xC6CC;&#xC9C0;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xB09C;&#xB3C5;&#xD654;</p>
</blockquote>
<p>&#xC774; &#xBC94;&#xC8FC;&#xB294; &#xC8FC;&#xB85C; <strong>&#xC815;&#xC801; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;&#xAC00; &#xD568;&#xC218;&#xB098; &#xBE14;&#xB85D; &#xB2E8;&#xC704;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBD84;&#xC11D;&#xD560; &#xB54C;</strong>, &#xAD6C;&#xC870;&#xB97C; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB3C4;&#xB85D; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><strong>&#xC81C;&#xC5B4; &#xD750;&#xB984; &#xD3C9;&#xD0C4;&#xD654; (Control Flow Flattening)</strong></p>
<p>  <img src="image%205.png" srcset="/img/loading.gif" alt="ref. https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/"></p>
<p>  ref. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/">https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/</a></p>
<ul>
<li>&#xC6D0;&#xB798;&#xB294; <code>if</code>, <code>while</code>, <code>switch</code> &#xB4F1;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xB418;&#xB358; &#xB17C;&#xB9AC; &#xD750;&#xB984;&#xC744;, &#xBAA8;&#xB450; &#xD558;&#xB098;&#xC758; <code>dispatcher</code> &#xB8E8;&#xD504; &#xC548;&#xC5D0; &#xB123;&#xACE0;, <strong>&#xC0C1;&#xD0DC; &#xBCC0;&#xC218;</strong>&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB2E4;&#xC74C; &#xC2E4;&#xD589;&#xD560; &#xBE14;&#xB85D;&#xC744; &#xACB0;&#xC815;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBC14;&#xAFC9;&#xB2C8;&#xB2E4;.<ul>
<li>&#xBAA8;&#xB4E0; &#xD750;&#xB984;&#xC774; &#xB8E8;&#xD504; &#xB0B4;&#xBD80;&#xC758; &#xC0C1;&#xD0DC; &#xC804;&#xC774;&#xB85C; &#xD45C;&#xD604;&#xB418;&#xC5B4; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;&#xC758; &#xD750;&#xB984; &#xD2B8;&#xB9AC; &#xBD84;&#xD574;&#xAC00; &#xBB34;&#xB825;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xB530;&#xB77C;&#xC11C; &#xD750;&#xB984;&#xC774; &#xBE44;&#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xBCC0;&#xACBD;&#xB418;&#xC5B4;, &#xC2E4;&#xC81C; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xCD94;&#xC801;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6CC;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xC774; &#xBD80;&#xBD84;&#xC740; &#xB4A4;&#xC5D0;&#xC11C; Obfuscator-LLVM(OLLVM) &#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</li>
</ul>
</li>
<li><strong>&#xAC00;&#xC9DC; &#xCF54;&#xB4DC; &#xC0BD;&#xC785; (Junk / Dead Code Insertion)</strong><ul>
<li>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xC81C; &#xB3D9;&#xC791;&#xC5D0;&#xB294; &#xC544;&#xBB34;&#xB7F0; &#xC601;&#xD5A5;&#xC774; &#xC5C6;&#xB294; &#xC758;&#xBBF8; &#xC5C6;&#xB294; &#xCF54;&#xB4DC;(Junk Code)&#xB098;, &#xC2E4;&#xC81C;&#xB85C;&#xB294; &#xC808;&#xB300; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xCF54;&#xB4DC;(Dead Code)&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xB300;&#xD45C;&#xC801;&#xC778; &#xC608;&#xB85C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:<ul>
<li>&#xC758;&#xBBF8; &#xC5C6;&#xB294; &#xC5F0;&#xC0B0; (<code>x = x;</code>, <code>add eax, 0;</code>)</li>
<li>&#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xBD84;&#xAE30; (<code>if (false) { ... }</code>)</li>
</ul>
</li>
</ul>
</li>
<li><strong>&#xAC04;&#xC811; &#xBD84;&#xAE30; / &#xD638;&#xCD9C; (Indirect Branching)</strong><ul>
<li><code>jmp eax</code>, <code>call [ecx+0x10]</code>&#xCC98;&#xB7FC; &#xC8FC;&#xC18C; &#xACC4;&#xC0B0; &#xD6C4; &#xC810;&#xD504;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xB85C;&#xC368; &#xCF54;&#xB4DC; &#xD750;&#xB984;&#xC744; &#xCD94;&#xC801;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;(API &#xCD94;&#xB860; &#xBD88;&#xAC00;).</li>
</ul>
</li>
<li><strong>Opaque Predicate</strong><ul>
<li>&#xC870;&#xAC74;&#xC2DD;&#xC774; &#xD56D;&#xC0C1; true/false&#xC778; &#xBD84;&#xAE30; &#xC0BD;&#xC785;&#xD569;&#xB2C8;&#xB2E4;. (&#xC608;: <code>if ((x*x) &gt;= 0)</code>)</li>
<li>&#xC774; &#xCF54;&#xB4DC;&#xB294; &#xB3D9;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xBB34;&#xD574;&#xD558;&#xB098; &#xC815;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xD750;&#xB984; &#xBD84;&#xC11D;&#xC744; &#xBC29;&#xD574;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>&#xC8FC;&#xC758;&#xD560; &#xC810;:</strong><ul>
<li>&#xCEF4;&#xD30C;&#xC77C; &#xC2DC; &#xCD5C;&#xC801;&#xD654; &#xC635;&#xC158;(<code>O2</code>, <code>O3</code>)&#xC744; &#xC8FC;&#xBA74; &#xAD6C;&#xC870;&#xAC00; &#xCD5C;&#xC801;&#xD654; &#xB418;&#xBA74;&#xC11C; &#xC758;&#xBBF8; &#xC5C6;&#xB294; &#xCF54;&#xB4DC;&#xB4E4;&#xC774; &#xC81C;&#xAC70;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xB530;&#xB77C;&#xC11C; &#xB09C;&#xB3C5;&#xD654; &#xC2DC;&#xC5D0;&#xB294; <strong>&#xCD5C;&#xC801;&#xD654; &#xC635;&#xC158;&#xC744; &#xBE44;&#xD65C;&#xC131;&#xD654;</strong>&#xD558;&#xAC70;&#xB098;, <strong>&#xB7F0;&#xD0C0;&#xC784; &#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC81C;&#xAC70;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xB294; &#xAE30;&#xBC95;</strong>&#xC744; &#xD568;&#xAED8; &#xC801;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><p><strong>&#xD6A8;&#xACFC;:</strong></p>
<ul>
<li><p>&#xBD84;&#xC11D;&#xC790;&#xB294; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xB8E8;&#xD504;&#xB098; &#xBD84;&#xAE30; &#xC18D;&#xC5D0; &#xC228;&#xC5B4; &#xC788;&#xB294; &#xC2E4;&#xC81C; &#xCF54;&#xB4DC;&#xB97C; &#xCC3E;&#xC544;&#xC57C; &#xD574;&#xC11C; &#xC2EC;&#xB9AC;&#xC801;&#xC73C;&#xB85C; &#xC9C0;&#xCE58;&#xACE0; &#xD5C8;&#xD0C8;&#xD568;&#xC744; &#xB290;&#xB07C;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC67C;&#xCABD; &#xC0AC;&#xC9C4;&#xCC98;&#xB7FC; &#xC0DD;&#xAE34; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC5D0;&#xC11C; &#xC624;&#xB978;&#xCABD; &#xC544;&#xB798;&#xC758; &#xB354;&#xBBF8;&#xCF54;&#xB4DC;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xBA87; &#xBD80;&#xBD84;&#xB9CC; &#xB123;&#xC5B4;&#xB3C4; &#xC624;&#xB978;&#xCABD;&#xACFC; &#xAC19;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC774; &#xB354; &#xBCF5;&#xC7A1;&#xD574;&#xC9D0;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>  <img src="image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
</ul>
</li>
</ul>
<p>&#x1F50D; <em>&#xAD6C;&#xC870;&#xC801; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xC8FC;&#xB85C; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;&#xC758; CFG &#xBD84;&#xC11D;&#xACFC; &#xD750;&#xB984; &#xD30C;&#xC545;&#xC744; &#xBB34;&#xB825;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.</em></p>
<h3 id="2-2-&#xB370;&#xC774;&#xD130;-&#xB09C;&#xB3C5;&#xD654;-Data-Obfuscation"><a href="#2-2-&#xB370;&#xC774;&#xD130;-&#xB09C;&#xB3C5;&#xD654;-Data-Obfuscation" class="headerlink" title="2.2 &#xB370;&#xC774;&#xD130; &#xB09C;&#xB3C5;&#xD654; (Data Obfuscation)"></a>2.2 &#xB370;&#xC774;&#xD130; &#xB09C;&#xB3C5;&#xD654; (Data Obfuscation)</h3><blockquote>
<p>&#xB370;&#xC774;&#xD130; &#xC790;&#xCCB4;&#xB97C; &#xC228;&#xAE30;&#xAC70;&#xB098; &#xB2E4;&#xB974;&#xAC8C; &#xD45C;&#xD604;&#xD558;&#xC5EC; &#xC758;&#xBBF8;&#xB97C; &#xC720;&#xCD94;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xB09C;&#xB3C5;&#xD654;</p>
</blockquote>
<p>&#xC774; &#xBC94;&#xC8FC;&#xB294; &#xC8FC;&#xB85C; &#xBB38;&#xC790;&#xC5F4;, &#xC0C1;&#xC218;, API &#xBA85; &#xB4F1; <strong>&#xBD84;&#xC11D; &#xC2DC; &#xC720;&#xC6A9;&#xD55C; &#xB2E8;&#xC11C;</strong>&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xAC70;&#xB098; &#xC228;&#xAE30;&#xAE30; &#xC704;&#xD55C; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>&#xBB38;&#xC790;&#xC5F4; &#xC554;&#xD638;&#xD654; (String Encryption)</strong><ul>
<li>&#xC911;&#xC694;&#xD55C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xB7F0;&#xD0C0;&#xC784; &#xBCF5;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC804;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC815;&#xC801; &#xBD84;&#xC11D; &#xC2DC; <code>&quot;CreateProcess&quot;</code> &#xAC19;&#xC740; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xBCF4;&#xC774;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>&#xC0C1;&#xC218; &#xC778;&#xCF54;&#xB529; (Constant Encoding)</strong><ul>
<li>&#xC22B;&#xC790; &#xC0C1;&#xC218;&#xB098; &#xD50C;&#xB798;&#xADF8; &#xAC12;&#xC744; &#xAC04;&#xC811; &#xACC4;&#xC0B0;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xD569;&#xB2C8;&#xB2E4;. (&#xC608;: <code>1337</code> &#x2192; <code>1000 + 337</code>)</li>
<li>&#xC774;&#xB85C;&#xC368; &#xC989;&#xAC01;&#xC801;&#xC73C;&#xB85C; &#xC0C1;&#xC218;&#xC758; &#xC758;&#xBBF8;&#xB97C; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB418;&#xACE0;, &#xD2B9;&#xD788; &#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xCF54;&#xB4DC;&#xAC00; &#xC0B0;&#xC220;&#xC2DD;&#xC73C;&#xB85C; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xD45C;&#xD604;&#xB418;&#xBA74;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xBAA9;&#xC801;&#xC774;&#xB098; &#xC0C1;&#xD0DC;&#xB97C; &#xC720;&#xCD94;&#xD558;&#xB294; &#xB370; &#xAC78;&#xB9AC;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xB300;&#xD3ED; &#xC99D;&#xAC00;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>API &#xD638;&#xCD9C; &#xB09C;&#xB3C5;&#xD654; / Import Hiding</strong><ul>
<li>API &#xC774;&#xB984;&#xC744; &#xD574;&#xC2DC;&#xB098; &#xC554;&#xD638;&#xD654;&#xB85C; &#xC228;&#xAE30;&#xACE0;, &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; &#xB3D9;&#xC801; &#xB85C;&#xB529;(<code>LoadLibrary</code>, <code>GetProcAddress</code>)&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>IAT(Import Address Table)&#xAC00; &#xBB34;&#xB825;&#xD654;&#xB418;&#xC5B4; &#xC790;&#xB3D9; &#xBD84;&#xC11D; &#xBD88;&#xAC00;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#x1F50D; <em>&#xB370;&#xC774;&#xD130; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xBD84;&#xC11D;&#xC790;&#xB098; &#xB3C4;&#xAD6C;&#xAC00; &#xC758;&#xBBF8; &#xC788;&#xB294; &#xC815;&#xBCF4;(&#xC2DD;&#xBCC4;&#xC790;, &#xBB38;&#xC790;&#xC5F4;, API &#xB4F1;)&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC29;&#xD574;&#xD569;&#xB2C8;&#xB2E4;.</em></p>
<h3 id="2-3-&#xC54C;&#xACE0;&#xB9AC;&#xC998;-&#xB09C;&#xB3C5;&#xD654;-Algorithm-Obfuscation"><a href="#2-3-&#xC54C;&#xACE0;&#xB9AC;&#xC998;-&#xB09C;&#xB3C5;&#xD654;-Algorithm-Obfuscation" class="headerlink" title="2.3 &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xB09C;&#xB3C5;&#xD654; (Algorithm Obfuscation)"></a>2.3 &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xB09C;&#xB3C5;&#xD654; (Algorithm Obfuscation)</h3><blockquote>
<p>&#xC2E4;&#xC81C; &#xAE30;&#xB2A5;&#xC774;&#xB098; &#xB85C;&#xC9C1;&#xC744; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xAE30;&#xB2A5;&#xC744; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xB09C;&#xB3C5;&#xD654;</p>
</blockquote>
<p>&#xC774;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC218;&#xD589;&#xD558;&#xB294; <strong>&#xD589;&#xC704; &#xC790;&#xCCB4;</strong>&#xB97C; &#xB09C;&#xD574;&#xD558;&#xAC8C; &#xD558;&#xC5EC;, &#xCF54;&#xB4DC;&#xB97C; &#xB72F;&#xC5B4;&#xBD10;&#xB3C4; &#x201C;&#xBB34;&#xC5C7;&#xC744; &#xD558;&#xB294;&#xC9C0;&#x201D;&#xB97C; &#xC54C;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><strong>&#xB124;&#xC784; &#xB9F9;&#xAE00;&#xB9C1; (Name Mangling) &#xBC0F; &#xC2EC;&#xBCFC; &#xC81C;&#xAC70;</strong></p>
<ul>
<li>&#xB514;&#xBC84;&#xAE45; &#xC2EC;&#xBCFC;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xAC70;&#xB098;, &#xD568;&#xC218;/&#xBCC0;&#xC218; &#xC774;&#xB984;&#xC744; &#xBB34;&#xC791;&#xC704; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xB300;&#xCCB4;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xB85C;&#xC368; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xAE30;&#xB2A5; &#xB9E5;&#xB77D;&#xC744; &#xC77D;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li><p>&#xB2E4;&#xC74C;&#xC740; Hack The Drone 2024(Final) &#xC5D0; &#xB098;&#xC628; &#xBB38;&#xC81C; &#xC911; &#xD328;&#xD0B7;&#xC744; &#xC778;&#xCF54;&#xB529;&#xD574;&#xC11C; &#xBE44;&#xD589;&#xC744; &#xC704;&#xD55C; &#xC2DC;&#xB3D9; &#xD328;&#xD0B7;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xBB38;&#xC81C;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xC218;&#xB3C4; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; LFSR Galois &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD588;&#xB294;&#xB370;&#xC694;.</p>
<p><img src="image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
<li><p>&#xC704; &#xC0AC;&#xC9C4;&#xC744; &#xBCF4;&#xC2DC;&#xBA74; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB5A4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC801;&#xC6A9;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#xB791; &#xAC01;&#xAC01;&#xC758; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB4E4;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xAC00; &#xB418;&#xB294;&#xC9C0; &#xC27D;&#xAC8C; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%208.png" srcset="/img/loading.gif" alt="image.png"></p>
</li>
<li><p>&#xADF8;&#xB7EC;&#xB098; &#xB124;&#xC784; &#xB9F9;&#xAE00;&#xB9C1;&#xC774; &#xC801;&#xC6A9;&#xB418;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC774; &#xD568;&#xC218;&#xBA85;&#xACFC; &#xD30C;&#xB77C;&#xBBF8;&#xD130; &#xBCC0;&#xC218;&#xBA85;&#xC774; &#xBB34;&#xC791;&#xC704; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xB300;&#xCCB4;&#xB418;&#xC5B4; &#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC778;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xB294;&#xB370; &#xC2DC;&#xAC04;&#xC774; &#xBCF4;&#xB2E4; &#xC18C;&#xC694;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC694;&#xC998;&#xC5D0;&#xB294; &#xADF8;&#xB7F0;&#xB370; GPT &#xAC19;&#xC740; LLM&#xC5D0; &#xB123;&#xC5B4;&#xC8FC;&#xBA74; &#xB108;&#xBB34; &#xC798; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD30C;&#xC545;&#xD574;&#xC8FC;&#xAE34; &#xD558;&#xB354;&#xB77C;&#xAD6C;&#xC694; &#x314E;.&#x314E;&#x2026;</li>
</ul>
</li>
</ul>
</li>
<li><strong>Self-Modifying Code</strong><ul>
<li>&#xC2E4;&#xD589; &#xC911; &#xC790;&#xC2E0;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xC218;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB530;&#xB77C;&#xC11C; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC73C;&#xB85C;&#xB294; &#xC644;&#xC804;&#xD55C; &#xCF54;&#xB4DC; &#xAD6C;&#xC870;&#xB97C; &#xBCFC; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>&#xAC00;&#xC0C1; &#xBA38;&#xC2E0; &#xAE30;&#xBC18; &#xB09C;&#xB3C5;&#xD654; (Virtualization Obfuscation)</strong><ul>
<li>&#xC790;&#xCCB4; &#xAC00;&#xC0C1; ISA&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC6D0;&#xB798; &#xCF54;&#xB4DC;&#xB97C; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xADF8;&#xB807;&#xAE30;&#xC5D0; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0; &#xD574;&#xC11D; &#xB8E8;&#xD2F4; &#xC5C6;&#xC774; &#xC2E4;&#xC81C; &#xB85C;&#xC9C1;&#xC744; &#xC774;&#xD574;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#x1F50D; <em>&#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; <strong>&#xBB34;&#xC5C7;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294;&#xC9C0;</strong>&#xC870;&#xCC28;&#xB3C4; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</em></p>
<h2 id="3-Obfuscator-LLVM-&#xC2E4;&#xC2B5;"><a href="#3-Obfuscator-LLVM-&#xC2E4;&#xC2B5;" class="headerlink" title="3. Obfuscator-LLVM &#xC2E4;&#xC2B5;"></a>3. Obfuscator-LLVM &#xC2E4;&#xC2B5;</h2><p><strong>OLLVM(Obfuscator-LLVM)</strong> &#xC740;, &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC778; <strong>LLVM</strong>&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; <strong>&#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xB2A5; &#xD655;&#xC7A5;&#xD310;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC6D0;&#xB798; LLVM&#xC740; &#x201C;&#xD074;&#xB9B0;&#xD55C;&#x201D; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xB370; &#xCD08;&#xC810;&#xC744; &#xB9DE;&#xCD98; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xC5F0;&#xAD6C;&#xC9C4;&#xB4E4;&#xC774; LLVM&#xC758; &#xAD6C;&#xC870;&#xAC00; &#xC6CC;&#xB099; &#xC720;&#xC5F0;&#xD558;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xCC29;&#xC548;&#xD574;&#xC11C;, <strong>&#xCF54;&#xB4DC;&#xB97C; &#xBE61;&#xC138;&#xAC8C; &#xB09C;&#xB3C5;&#xD654;&#xD558;&#xB294; &#xAE30;&#xB2A5;</strong>&#xC744; &#xCD94;&#xAC00;&#xD55C; &#xBC84;&#xC804;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xC8E0;. &#xADF8;&#xAC8C; &#xBC14;&#xB85C; OLLVM&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>OLLVM&#xC740; C/C++ &#xCF54;&#xB4DC;&#xB97C; &#xCEF4;&#xD30C;&#xC77C;&#xD560; &#xB54C; <strong>&#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xB09C;&#xB3C5;&#xD654; &#xD328;&#xC2A4;(pass)</strong> &#xB97C; &#xAC70;&#xCE58;&#xBA74;&#xC11C; &#xCF54;&#xB4DC;&#xB97C; &#xBCC0;&#xD615;&#xD569;&#xB2C8;&#xB2E4;. &#xB355;&#xBD84;&#xC5D0; &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xB530;&#xB85C; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xC218;&#xC815;&#xD560; &#xD544;&#xC694; &#xC5C6;&#xC774;, &#xADF8;&#xB0E5; &#xCEF4;&#xD30C;&#xC77C;&#xB9CC; &#xB2E4;&#xB974;&#xAC8C; &#xD574;&#xB3C4; &#xAC15;&#xB825;&#xD55C; &#xB09C;&#xB3C5;&#xD654; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-1-OLLVM&#xC6A9;-Clang-&#xBE4C;&#xB4DC;-&#xBC29;&#xBC95;"><a href="#3-1-OLLVM&#xC6A9;-Clang-&#xBE4C;&#xB4DC;-&#xBC29;&#xBC95;" class="headerlink" title="3.1 OLLVM&#xC6A9; Clang &#xBE4C;&#xB4DC; &#xBC29;&#xBC95;"></a>3.1 OLLVM&#xC6A9; Clang &#xBE4C;&#xB4DC; &#xBC29;&#xBC95;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/obfuscator-llvm/obfuscator/wiki/Installation">https://github.com/obfuscator-llvm/obfuscator/wiki/Installation</a></p>
<pre><code class="hljs bash">$ git <span class="hljs-built_in">clone</span> -b llvm-4.0 https://github.com/obfuscator-llvm/obfuscator.git
$ mkdir build &amp;&amp; <span class="hljs-built_in">cd</span> build
$ cmake -DCMAKE_BUILD_TYPE=Release ../obfuscator/
$ make -j7</code></pre>
<p>&#xC800; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC5D0;&#xB7EC;&#xAC00; &#xC880; &#xB098;&#xC11C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xC815;&#xD574;&#xC92C;&#xC5B4;&#xC694;. &#xD639;&#xC2DC; &#xC5D0;&#xB7EC;&#xAC00; &#xB098;&#xC2E0;&#xB2E4;&#xBA74; &#xB85C;&#xADF8; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xACE0; &#xD2B8;&#xB7EC;&#xBE14;&#xC288;&#xD305;&#xD574;&#xBCF4;&#xC138;&#xC694;.</p>
<p>obfuscator/tools/clang/lib/CodeGen/CGOpenMPRuntime.cpp:6275, 6321, 6400</p>
<p><code>error:lambda parameter &#x2018;CGF&#x2019; previously declared as a capture</code> </p>
<p>&#xC55E;&#xC5D0; &#xC788;&#xB294; <code>&amp;CGF</code> &#xC81C;&#xAC70;</p>
<pre><code class="hljs c"><span class="hljs-keyword">auto</span> &amp;&amp;BeginThenGen = [&amp;D, &amp;CGF, Device, &amp;Info, &amp;CodeGen, &amp;NoPrivAction](...)
&#x2193;
<span class="hljs-keyword">auto</span> &amp;&amp;BeginThenGen = [&amp;D, Device, &amp;Info, &amp;CodeGen, &amp;NoPrivAction](...)</code></pre>
<p>obfuscator/include/llvm/ExecutionEngine/Orc/OrcRemoteTargetClient.h:696</p>
<p><code>error: cannot convert</code></p>
<p><code>char</code> &#x2192; <code>uint8_t</code> &#xB85C; &#xBCC0;&#xD658;</p>
<pre><code class="hljs c"><span class="hljs-function">Expected&lt;<span class="hljs-built_in">std</span>::<span class="hljs-built_in">vector</span>&lt;<span class="hljs-keyword">char</span>&gt;&gt; <span class="hljs-title">readMem</span><span class="hljs-params">(...)</span> </span>{ ... }
&#x2193;
<span class="hljs-function">Expected&lt;<span class="hljs-built_in">std</span>::<span class="hljs-built_in">vector</span>&lt;<span class="hljs-keyword">uint8_t</span>&gt;&gt; <span class="hljs-title">readMem</span><span class="hljs-params">(...)</span> </span>{ ... }
</code></pre>
<p><img src="image%209.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xBE4C;&#xB4DC;&#xB97C; &#xC798;&#xD588;&#xC73C;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC774; OLLVM &#xC6A9; clang&#xC774; &#xC798; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;!</p>
<h3 id="3-2-OLLVM-&#xC0AC;&#xC6A9;&#xBC95;"><a href="#3-2-OLLVM-&#xC0AC;&#xC6A9;&#xBC95;" class="headerlink" title="3.2 OLLVM &#xC0AC;&#xC6A9;&#xBC95;"></a>3.2 OLLVM &#xC0AC;&#xC6A9;&#xBC95;</h3><p>Obfuscator-LLVM&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xBC95;&#xC740;, Clang&#xC744; &#xD1B5;&#xD574; LLVM &#xBC31;&#xC5D4;&#xB4DC;(-mllvm)&#xC5D0; &#xD2B9;&#xC815; &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD604;&#xC7AC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC8FC;&#xC694; &#xD50C;&#xB798;&#xADF8;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/obfuscator-llvm/obfuscator/wiki/Features">https://github.com/obfuscator-llvm/obfuscator/wiki/Features</a></p>
<ul>
<li><code>fla</code>: &#xC81C;&#xC5B4; &#xD750;&#xB984; &#xD3C9;&#xD0C4;&#xD654;(Control Flow Flattening)</li>
<li><code>sub</code>: &#xBA85;&#xB839;&#xC5B4; &#xCE58;&#xD658;(Instruction Substitution)</li>
<li><code>bcf</code>: &#xAC00;&#xC9DC; &#xC81C;&#xC5B4; &#xD750;&#xB984;(Bogus Control Flow)</li>
</ul>
<p>&#xB610;, &#xD2B9;&#xC815; &#xD568;&#xC218;&#xC5D0;&#xB9CC; &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/obfuscator-llvm/obfuscator/wiki/Functions-annotations">&#xD568;&#xC218; &#xC5B4;&#xB178;&#xD14C;&#xC774;&#xC158;</a> &#xBC29;&#xBC95;&#xB3C4; &#xCC38;&#xACE0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="3-3-&#xC2E4;&#xC2B5;"><a href="#3-3-&#xC2E4;&#xC2B5;" class="headerlink" title="3.3 &#xC2E4;&#xC2B5;"></a>3.3 &#xC2E4;&#xC2B5;</h3><ul>
<li>&#xC608;&#xC81C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</li>
</ul>
<pre><code class="hljs c"><span class="hljs-comment">// flatten_example.c</span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">secret_function</span><span class="hljs-params">(<span class="hljs-keyword">int</span> x)</span> </span>{
    <span class="hljs-keyword">if</span> (x &gt; <span class="hljs-number">0</span>) {
        <span class="hljs-keyword">return</span> x * <span class="hljs-number">2</span>;
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> x - <span class="hljs-number">2</span>;
    }
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
    <span class="hljs-keyword">int</span> value = <span class="hljs-number">5</span>;
    <span class="hljs-keyword">int</span> result = secret_function(value);
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Result: %d\n&quot;</span>, result);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB97C; &#xC800;&#xC7A5;&#xD574; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xBE4C;&#xB4DC;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">$ clang flatten_example.c -o flatten_example_norm
$ path_to_the/build/bin/clang -mllvm -fla flatten_example.c -o flatten_example_obf</code></pre>
<p>&#xB124; &#xC774;&#xC81C; IDA&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xBE4C;&#xB4DC;&#xB41C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xC67C;&#xCABD;&#xC774; <code>flatten_example_norm</code> &#xC774;&#xACE0; &#xC624;&#xB978;&#xCABD;&#xC774; <code>flatten_example_obf</code> &#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2010.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xB514;&#xC2A4;&#xC5B4;&#xC148;&#xBE14;&#xB41C; <code>secret_function</code> &#xCF54;&#xB4DC;</p>
<p><img src="image%2011.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>secret_function</code> &#xC758; CFG</p>
<p>&#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC778;&#xB370; &#xBC8C;&#xC368;&#xBD80;&#xD130; &#xADF9;&#xBA85;&#xD55C; &#xCC28;&#xC774;&#xAC00; &#xBCF4;&#xC774;&#xC8E0;?</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xB108;&#xBB34;&#xB098; &#xB2F9;&#xC5F0;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xC9C0;&#xB9CC; &#xC2E4;&#xD589;&#xACB0;&#xACFC;&#xB294; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2012.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="4-&#xB9C8;&#xBB34;&#xB9AC;"><a href="#4-&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="4. &#xB9C8;&#xBB34;&#xB9AC;"></a>4. &#xB9C8;&#xBB34;&#xB9AC;</h2><h3 id="&#xD55C;&#xACC4;"><a href="#&#xD55C;&#xACC4;" class="headerlink" title="&#xD55C;&#xACC4;"></a>&#xD55C;&#xACC4;</h3><p>&#xBB3C;&#xB860; &#xB09C;&#xB3C5;&#xD654;&#xC5D0;&#xB3C4; &#xBA85;&#xD655;&#xD55C; &#xD55C;&#xACC4;&#xB294; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>&#xC131;&#xB2A5; &#xC800;&#xD558;:</strong> &#xB09C;&#xB3C5;&#xD654; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0BD;&#xC785;&#xB418;&#xB294; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xB85C;&#xC9C1;&#xC774;&#xB098; &#xBCF5;&#xC7A1;&#xD55C; &#xBD84;&#xAE30;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC131;&#xB2A5;&#xC744; &#xC800;&#xD558;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB3C4;&#xAD6C; &#xBC1C;&#xC804;&#xC758; &#xC5ED;&#xC2B5;:</strong> &#xC815;&#xC801; &#xBD84;&#xC11D;&#xAE30;, &#xB514;&#xC635;&#xD4E8;&#xC2A4;&#xCF00;&#xC774;&#xD130;(Deobfuscator) &#xB4F1; &#xBD84;&#xC11D; &#xB3C4;&#xAD6C;&#xB4E4;&#xB3C4; &#xB04A;&#xC784;&#xC5C6;&#xC774; &#xBC1C;&#xC804;&#xD558;&#xBA74;&#xC11C;, &#xC77C;&#xBD80; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xBE44;&#xAD50;&#xC801; &#xC27D;&#xAC8C; &#xBB34;&#xB825;&#xD654;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBC95;&#xC801;&#xB7;&#xC724;&#xB9AC;&#xC801; &#xBB38;&#xC81C;:</strong> &#xC0C1;&#xC6A9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xACFC;&#xB3C4;&#xD55C; &#xB09C;&#xB3C5;&#xD654;&#xB97C; &#xC801;&#xC6A9;&#xD560; &#xACBD;&#xC6B0;, &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2E0;&#xB8B0;&#xB97C; &#xC800;&#xD558;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xB54C;&#xB85C;&#xB294; &#xBC95;&#xC801; &#xBD84;&#xC7C1;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB420; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<h3 id="&#xC758;&#xC758;"><a href="#&#xC758;&#xC758;" class="headerlink" title="&#xC758;&#xC758;"></a>&#xC758;&#xC758;</h3><p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF8; &#xAC83;&#xCC98;&#xB7FC;, &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xBC95;&#xC740; &#xADF8; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC5D0; &#xB530;&#xB77C; &#xD06C;&#xAC8C; <strong>&#xAD6C;&#xC870;&#xC801;(Structural)</strong>, <strong>&#xB370;&#xC774;&#xD130;(Data)</strong>, <strong>&#xC54C;&#xACE0;&#xB9AC;&#xC998;(Algorithm)</strong> &#xCE21;&#xBA74;&#xC73C;&#xB85C; &#xAD6C;&#xBD84;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC;, &#xC2E4;&#xC81C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBD84;&#xC11D; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xBD84;&#xB958;&#xB97C; &#xB118;&#xC5B4;, &#xC774; &#xC138; &#xAC00;&#xC9C0; &#xC694;&#xC18C;&#xAC00; &#xBCF5;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xC801;&#xC6A9;&#xB418;&#xAE30;&#xB3C4; &#xD558;&#xACE0; &#xB354;&#xC6B1;&#xC774;, &#xAE30;&#xC874; &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xBC95;&#xC758; &#xBCC0;&#xD615;&#xC740; &#xBB3C;&#xB860;, &#xC0C8;&#xB85C;&#xC6B4; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xBCC0;&#xC885; &#xAE30;&#xBC95;&#xB4E4;&#xC774; &#xAFB8;&#xC900;&#xD788; &#xB4F1;&#xC7A5;&#xD558;&#xBA70; &#xBD84;&#xC11D;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xB354;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xBE61;&#xC138;&#xAC8C; &#xAC78;&#xB824;&#xC788;&#xB2E4;&#xACE0; &#xC18C;&#xBB38;&#xB09C; &#xC0C1;&#xC6A9; &#xB4DC;&#xB860; DJI &#xC5D0;&#xC11C;&#xC758; &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xBC95;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC77C;&#xBD80;&#xBD84;&#xB9CC; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li><strong>&#xAD6C;&#xC870;&#xC801; &#xB09C;&#xB3C5;&#xD654;</strong>: 8&#xAC1C;&#xC758; DEX &#xD30C;&#xC77C;&#xC744; 128KB &#xCCAD;&#xD06C; &#xB2E8;&#xC704;&#xB85C; &#xBD84;&#xD560;&#xD558;&#xACE0;, &#xAC01;&#xAC01;&#xC744; <strong>AES-256</strong>&#xC73C;&#xB85C; &#xC554;&#xD638;&#xD654;</li>
<li><strong>&#xB370;&#xC774;&#xD130; &#xB09C;&#xB3C5;&#xD654;</strong>: <code>com.dji.industry.pilot</code> &#xBB38;&#xC790;&#xC5F4;&#xACFC; &#xD558;&#xB4DC;&#xCF54;&#xB4DC;&#xB41C; &#xC0C1;&#xC218;&#xB97C; &#xC870;&#xD569;&#xD558;&#xC5EC; <strong>XOR &#xAE30;&#xBC18; &#xD0A4;</strong>&#xB97C; &#xC0DD;&#xC131;</li>
<li><strong>&#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xB09C;&#xB3C5;&#xD654;</strong>: JNI &#xD638;&#xCD9C; &#xC2DC; <strong>3&#xB2E8;&#xACC4; &#xD2B8;&#xB7A8;&#xD384;&#xB9B0; &#xD568;&#xC218;</strong>&#xB97C; &#xAC70;&#xCCD0; &#xC2E4;&#xC81C; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xD568;&#xC218; &#xC8FC;&#xC18C;&#xB85C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;</li>
</ul>
<p>&#xC774;&#xCC98;&#xB7FC; &#xD604;&#xB300;&#xC758; &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xC220;&#xC740; &#xB2E8;&#xC77C; &#xAE30;&#xBC95;&#xC5D0; &#xBA38;&#xBB34;&#xB974;&#xC9C0; &#xC54A;&#xACE0; &#xB2E4;&#xCE35;&#xC801;&#xC774;&#xACE0; &#xBAA8;&#xB4C8;&#xD654;&#xB41C; &#xBCF4;&#xD638; &#xCCB4;&#xACC4;&#xB97C; &#xAC16;&#xCD94;&#xACE0; &#xC788;&#xC73C;&#xBA70;,  &#xB9E4;&#xB144; &#xC0C8;&#xB85C;&#xC6B4; &#xBCC0;&#xD615; &#xAE30;&#xBC95;&#xC744; &#xB3C4;&#xC785;&#xD558;&#xC5EC; &#xBD84;&#xC11D; &#xD658;&#xACBD;&#xC744; &#xB354;&#xC6B1; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB098;&#xC544;&#xAC00;, &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAE30;&#xBC18;&#xC758; &#xAC00;&#xC9DC; &#xCF54;&#xB4DC; &#xD328;&#xD134; &#xC0DD;&#xC131;&#xC774;&#xB098; &#xC591;&#xC790; &#xC554;&#xD638; &#xAE30;&#xC220;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xD0A4; &#xAD50;&#xD658; &#xB4F1; &#xCC28;&#xC138;&#xB300; &#xAE30;&#xC220;&#xC744; &#xC2DC;&#xD5D8;&#xC801;&#xC73C;&#xB85C; &#xB3C4;&#xC785;&#xD558;&#xB294; &#xC0AC;&#xB840;&#xB3C4; &#xB4F1;&#xC7A5;&#xD558;&#xBA70; &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xC220;&#xB3C4; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xAE30;&#xC220;&#xC758; &#xBC1C;&#xC804;&#xC5D0; &#xB530;&#xB77C; &#xBC1C;&#xC804;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Part 1,2,3&#xC744; &#xC9C4;&#xD589;&#xD558;&#xBA70; &#xACC4;&#xC18D;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xC9C0;&#xB9CC;, </p>
<blockquote>
<p>&#x201C;&#xBAA8;&#xB4E0; &#xBCF4;&#xD638; &#xACC4;&#xCE35;&#xC740; &#xC2DC;&#xAC04;&#xC744; &#xBC8C;&#xC5B4;&#xC8FC;&#xB294; &#xC7A5;&#xCE58;&#xC77C; &#xBFD0;, &#xAD81;&#xADF9;&#xC801;&#xC778; &#xC548;&#xC804;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xC9C0; &#xBABB;&#xD568;&#x201D;</p>
<ul>
<li>Quarkslab &#xB9AC;&#xC11C;&#xCE58; &#xD300;</li>
</ul>
</blockquote>
<p>&#xB09C;&#xB3C5;&#xD654;&#xC640; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xC220;&#xC740; &#xACB0;&#xAD6D; <strong>&#xCF54;&#xB4DC;&#xB97C; &#xC9C0;&#xD0A4;&#xAE30; &#xC704;&#xD55C; &#xC2F8;&#xC6C0;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xBC84;&#xC11C;&#xC640; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xB300;&#xACB0; &#xAD6C;&#xB3C4; &#xC18D;&#xC5D0;&#xC11C; &#xAE30;&#xC220;&#xC740; &#xB04A;&#xC784;&#xC5C6;&#xC774; &#xC9C4;&#xD654;&#xD558;&#xACE0;, &#xC774; &#xACFC;&#xC815;&#xC740; &#xBCF4;&#xC548; &#xAE30;&#xC220; &#xC804;&#xBC18;&#xC758; &#xBC1C;&#xC804;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xB09C;&#xB3C5;&#xD654;&#xB294; &#xD569;&#xBC95;&#xC801;&#xC778; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBCF4;&#xD638;&#xBFD0; &#xC544;&#xB2C8;&#xB77C;, &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC758; &#xD0D0;&#xC9C0; &#xD68C;&#xD53C;&#xC640; &#xBD84;&#xC11D; &#xC9C0;&#xC5F0;&#xC5D0;&#xB3C4; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <strong>&#xACF5;&#xACA9;&#xACFC; &#xBC29;&#xC5B4; &#xC591;&#xCABD; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xD544;&#xC218;&#xC801;&#xC778; &#xAE30;&#xC220;</strong>&#xB85C; &#xC790;&#xB9AC; &#xC7A1;&#xC740; &#xC148;&#xC774;&#xC8E0;.</p>
<p>&#xB09C;&#xB3C5;&#xD654;&#xB294; &#xACF5;&#xACA9;&#xC744; &#xC9C0;&#xC5F0;&#xC2DC;&#xD0A4;&#xACE0; &#xBC29;&#xC5B4;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xBC8C;&#xC5B4;&#xC8FC;&#xB294; &#xC218;&#xB2E8;&#xC774;&#xC9C0;&#xB9CC;, &#xC644;&#xBCBD;&#xD55C; &#xBC29;&#xD328;&#xB294; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD84;&#xC11D;&#xC790;&#xB294; &#xB048;&#xC9C8;&#xAE30;&#xAC8C; &#xD750;&#xB984;&#xC744; &#xCD94;&#xC801;&#xD558;&#xACE0; &#xB3C4;&#xAD6C;&#xB97C; &#xAC1C;&#xC120;&#xD558;&#xBA70;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC774;&#xC5D0; &#xB300;&#xC751;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xB09C;&#xB3C5;&#xD654; &#xAE30;&#xBC95;&#xC744; &#xCC3E;&#xC544;&#xB0B4; &#xBC29;&#xC5B4;&#xB97C; &#xAC15;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xACB0;&#xAD6D; &#xC774; &#xC2F8;&#xC6C0;&#xC740; &#xB05D;&#xB0A0; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></p>
<p>&#xAE30;&#xC220;&#xC774; &#xBC1C;&#xC804;&#xD558;&#xB294; &#xB9CC;&#xD07C;, &#xACF5;&#xACA9;&#xACFC; &#xBC29;&#xC5B4;&#xC758; &#xBC29;&#xBC95;&#xB3C4; &#xB04A;&#xC784;&#xC5C6;&#xC774; &#xC9C4;&#xD654;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6B0;&#xB9AC;&#xB294; &#xC774; &#xAE30;&#xC220;&#xC744; &#xB2E8;&#xC21C;&#xD55C; &#xC7A5;&#xBCBD;&#xC774; &#xC544;&#xB2C8;&#xB77C;, <strong>&#xB354; &#xB098;&#xC740; &#xBCF4;&#xC548; &#xD658;&#xACBD;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xAC00;&#xAE30; &#xC704;&#xD55C; &#xC9C4;&#xD654;&#xC758; &#xC77C;&#xBD80;</strong>&#xB85C; &#xBC14;&#xB77C;&#xBD10;&#xC57C; &#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xCC3D;&#xACFC; &#xBC29;&#xD328;&#xC758; &#xB300;&#xACB0; &#xC18D;&#xC5D0;&#xC11C;&#xB3C4;, &#xC6B0;&#xB9AC;&#xC758; &#xBAA9;&#xD45C;&#xB294; &#xBCC0;&#xD568;&#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2013.png" srcset="/img/loading.gif" alt="image.png"></p>
<blockquote>
<p>&#x201C;&#xAC8C;&#xC784;&#xC740; &#xACC4;&#xC18D;&#xB41C;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC6B0;&#xB9AC;&#xB294;, &#xAC01;&#xC790;&#xC758; &#xC774;&#xC720;&#xB85C;, &#xC774; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xB294; &#xAC8C;&#xC784;&#xC5D0; &#xB6F0;&#xC5B4;&#xB4E0;&#xB2E4;.&#x201D;</p>
</blockquote>
<h3 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h3><p>&#xB9AC;&#xBC84;&#xC2F1; &#xD575;&#xC2EC; &#xC6D0;&#xB9AC;: &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xAC00;&#xC758; &#xB9AC;&#xBC84;&#xC2F1; &#xC774;&#xC57C;&#xAE30;(&#xC800;&#xC790; &#xC774;&#xC2B9;&#xC6D0;)</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.blog.naver.com/choijo2/60196192627">https://m.blog.naver.com/choijo2/60196192627</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://en.wikipedia.org/wiki/Obfuscation_(software">http://en.wikipedia.org/wiki/Obfuscation_(software)</a>)</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.quarkslab.com/dji-the-art-of-obfuscation.html">https://blog.quarkslab.com/dji-the-art-of-obfuscation.html</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/">https://gosecure.github.io/presentations/2020-05-15-advanced-binary-analysis/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/obfuscator-llvm/obfuscator">https://github.com/obfuscator-llvm/obfuscator</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/Anti-Debugging/">Anti-Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/Debugging/">Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/Malware/">Malware</a>
                  
                  <a class="hover-with-bg" href="/tags/OLLVM/">OLLVM</a>
                  
                  <a class="hover-with-bg" href="/tags/Obfuscation/">Obfuscation</a>
                  
                  <a class="hover-with-bg" href="/tags/Reverse-Engineering/">Reverse Engineering</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/04/28/OUYA77/Anti_part3/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Anti-Debugging Part 3(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/04/23/ogu123/cve-2025-27158/">
                    <span class="hidden-mobile">[] CVE-2025-27158: Adobe Acrobat Reader Uninitialized Pointer  RCE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/04/28/OUYA77/Anti_part3/kr/';
        this.page.identifier = '/2025/04/28/OUYA77/Anti_part3/kr/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Anti-Debugging Part 3(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
