

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xBC88;&amp;#xC5D4; Winnie&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. WinAFL&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD37C;&amp;#xC800;&amp;#xB85C; code coverage&amp;#xB97C; &amp;#xB298;&amp;#xB9AC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; &amp;#xAE30;&amp;#xC874; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778; Intel PT&amp;#xB098; DynamoRIO &amp;#xB300;&amp;#xC2E0; basic-block breakpoint&amp;#xC640; fork&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; WinAFL&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C4; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC804; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; Winnie&amp;#xB97C; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC804;&amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; Winnie&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Winnie&#34;&gt;&lt;a href=&#34;#Winnie&#34; class=&#34;headerlink&#34; title=&#34;Winnie&#34;&gt;&lt;/a&gt;Winnie&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/sslab-gatech/winnie&#34;&gt;sslab-gatech/winnie&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; Winnie &amp;#xACF5;&amp;#xC2DD; github&amp;#xC5D0; &amp;#xAC00;&amp;#xC154;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/2.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Build&#34;&gt;&lt;a href=&#34;#Build&#34; class=&#34;headerlink&#34; title=&#34;Build&#34;&gt;&lt;/a&gt;Build&lt;/h1&gt;&lt;p&gt;forklib&amp;#xB294; unix &amp;#xACC4;&amp;#xC5F4; OS&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; fork()&amp;#xB97C; windows&amp;#xC5D0; &amp;#xD3EC;&amp;#xD305;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB85C;&lt;/p&gt;
&lt;p&gt;csrss.dll&amp;#xACFC; ntdll.dll&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD574; &amp;#xC5BB;&amp;#xC740; offset&amp;#xB4E4;&amp;#xC774; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD30C;&amp;#xC2F1; &amp;#xD574;&amp;#xC624;&amp;#xB294; python &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC19;&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB9CC; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;gen_csrss_offsets.py&lt;/code&gt; &amp;#xC774;&amp;#xB188;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. python 3&amp;#xB294; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; python 2&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; python2.7.13&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xC758;&amp;#xD558;&amp;#xC2E4; &amp;#xC810;&amp;#xC740; python2-x64&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 32-bit&amp;#xC6A9; pyhton &amp;#xB610;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;python2&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC28;&amp;#xB798;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;python -m pip install --upgrade pip
python -m pip install construct pefile
python ./gen_csrss_offsets.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;csrss_offset.h&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xAD6C;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC131;&amp;#xACF5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;csrss_offsets.h&lt;/code&gt; &amp;#xD574;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; offset&amp;#xB4E4;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xC774;&amp;#xC81C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. FullSpeed.sln &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; VisualStudio2017 &amp;#xD639;&amp;#xC740; VisualStudio2019&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4; Realease x64 configuration&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; VisualStudio2019&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9C8;&amp;#xCE58;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; winnie-master&amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; x64&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Ready-to-Fuzz&#34;&gt;&lt;a href=&#34;#Ready-to-Fuzz&#34; class=&#34;headerlink&#34; title=&#34;Ready to Fuzz&#34;&gt;&lt;/a&gt;Ready to Fuzz&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Winnie&amp;#xC758; &amp;#xAE43;&amp;#xD5D9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; Toy example&amp;#xC744; &amp;#xD1B5;&amp;#xD574; winnie&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &lt;code&gt;winnie-master/samples/toy_example&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &lt;code&gt;toy_example.sln&lt;/code&gt; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Release x64&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9C8;&amp;#xCE58;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; Toy example &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; x64&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; afl-fuzz.exe&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD3F4;&amp;#xB354;&amp;#xB85C; &amp;#xC62E;&amp;#xAE30;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC608;&amp;#xC2DC; input &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xD55C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574; &amp;#xC8FC;&amp;#xB2C8; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;example_library.dll : target module&amp;#xC774; &amp;#xB420; dll&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;harness.dll : winnie&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; harness&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;toy_example.exe : target program&amp;#xC774; &amp;#xB420; &amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;winnie-master/x64/Release&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;(&amp;#xC774;&amp;#xD558; working directory)&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xC608;&amp;#xC81C; input&amp;#xC758; &amp;#xBCF5;&amp;#xC0AC;&amp;#xBCF8;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; Part&amp;#xC5D0;&amp;#xC11C; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; winnie&amp;#xC758; full-speed instrumentation&amp;#xC740; basic block&amp;#xB2E8;&amp;#xC704;&amp;#xB85C; break point&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4; coverage&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; target module&amp;#xC758; basic block&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; basic-block-file(bb-file)&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. winnie&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; bb.py&amp;#xB77C;&amp;#xB294; IDA&amp;#xC6A9; python script&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; bb-file&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; IDA Pro&amp;#xB85C; &amp;#xC5F4;&amp;#xACE0; [&amp;#xC0C1;&amp;#xB2E8;&amp;#xBA54;&amp;#xB274; &amp;gt; File &amp;gt; Script file&amp;#x2026;]&amp;#xC744; &amp;#xD1B5;&amp;#xD574; bb.py&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; working directory&amp;#xC5D0; basicblocks.bb&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; toy_example.exe&amp;#xC640; example_library.dll, &amp;#xCD1D; 2&amp;#xAC1C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; bb &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; basicblocks.bb&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xC0DD;&amp;#xC131; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xAE30;&amp;#xC874; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; bb &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; bb-file&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; bb-file&amp;#xC5D0; toy_example.exe&amp;#xC640; example_library.dll&amp;#xC758; bb &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xB294; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing&#34;&gt;&lt;a href=&#34;#Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing&#34;&gt;&lt;/a&gt;Fuzzing&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz [AFL &amp;#xC635;&amp;#xC158;] -- [fullspeed &amp;#xC635;&amp;#xC158;] -- [fork server &amp;#xC635;&amp;#xC158;] -- [target argv]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Winnie&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC704;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01; &amp;#xC635;&amp;#xC158;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;AFL &amp;#xC635;&amp;#xC158; : input &amp;#xBC0F; output &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;, &amp;#xD0C0;&amp;#xC784; &amp;#xC544;&amp;#xC6C3; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;fullspeed &amp;#xC635;&amp;#xC158; : fullspeed intrumentation&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;(&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; bb-file)&lt;/li&gt;
&lt;li&gt;fork server &amp;#xC635;&amp;#xC158; : harness&amp;#xC758; &amp;#xACBD;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;, fork server&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;target argv : target program &amp;#xACBD;&amp;#xB85C; &amp;#xBC0F; &amp;#xC544;&amp;#xADDC;&amp;#xBA3C;&amp;#xD2B8; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz -i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; -o out -t 1000 -I 1000 -- -bbfile basicblocks.bb -- -harness harness.dll -no_minidumps -- toy_example @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xBC88; Winnie Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Winnie&amp;#xB294; 2&amp;#xAC1C;&amp;#xC758; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCC28;&amp;#xBCC4;&amp;#xC810;&amp;#xC774;&amp;#xC790; Winnie&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Semi-automated Harness Generater&lt;/p&gt;
&lt;p&gt;Winnie &amp;#xB610;&amp;#xD55C; WinAFL&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC0DD;&amp;#xB41C; fuzzer&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; Harness &amp;#xC791;&amp;#xC131;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Winnie&amp;#xB97C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xC778; &amp;#xC790;&amp;#xB3D9; Harness &amp;#xC0DD;&amp;#xC131;&amp;#xAE30;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Full Speed instrumentation Fuzzing&lt;/p&gt;
&lt;p&gt;Winnie&amp;#xB294; fork&amp;#xC640; basic-block &amp;#xB2E8;&amp;#xC704; breakpoint&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; full speed instrumentation fuzzing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; fork&amp;#xC758; windows &amp;#xD3EC;&amp;#xD305;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Harness 짜기 싫어 쓰는 Winnie 연구글 Part2 - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xBC88;&amp;#xC5D4; Winnie&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. WinAFL&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD37C;&amp;#xC800;&amp;#xB85C; code coverage&amp;#xB97C; &amp;#xB298;&amp;#xB9AC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; &amp;#xAE30;&amp;#xC874; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778; Intel PT&amp;#xB098; DynamoRIO &amp;#xB300;&amp;#xC2E0; basic-block breakpoint&amp;#xC640; fork&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; WinAFL&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C4; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC804; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xC870;&amp;#xAE08; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; Winnie&amp;#xB97C; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC804;&amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; Winnie&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Winnie&#34;&gt;&lt;a href=&#34;#Winnie&#34; class=&#34;headerlink&#34; title=&#34;Winnie&#34;&gt;&lt;/a&gt;Winnie&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/sslab-gatech/winnie&#34;&gt;sslab-gatech/winnie&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; Winnie &amp;#xACF5;&amp;#xC2DD; github&amp;#xC5D0; &amp;#xAC00;&amp;#xC154;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/2.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Build&#34;&gt;&lt;a href=&#34;#Build&#34; class=&#34;headerlink&#34; title=&#34;Build&#34;&gt;&lt;/a&gt;Build&lt;/h1&gt;&lt;p&gt;forklib&amp;#xB294; unix &amp;#xACC4;&amp;#xC5F4; OS&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; fork()&amp;#xB97C; windows&amp;#xC5D0; &amp;#xD3EC;&amp;#xD305;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB85C;&lt;/p&gt;
&lt;p&gt;csrss.dll&amp;#xACFC; ntdll.dll&amp;#xC744; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD574; &amp;#xC5BB;&amp;#xC740; offset&amp;#xB4E4;&amp;#xC774; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD30C;&amp;#xC2F1; &amp;#xD574;&amp;#xC624;&amp;#xB294; python &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC19;&amp;#xC774; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC2E4;&amp;#xD589;&amp;#xB9CC; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;gen_csrss_offsets.py&lt;/code&gt; &amp;#xC774;&amp;#xB188;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. python 3&amp;#xB294; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; python 2&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; python2.7.13&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xC758;&amp;#xD558;&amp;#xC2E4; &amp;#xC810;&amp;#xC740; python2-x64&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 32-bit&amp;#xC6A9; pyhton &amp;#xB610;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;python2&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC28;&amp;#xB798;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;python -m pip install --upgrade pip
python -m pip install construct pefile
python ./gen_csrss_offsets.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;csrss_offset.h&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xAD6C;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC131;&amp;#xACF5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;csrss_offsets.h&lt;/code&gt; &amp;#xD574;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; offset&amp;#xB4E4;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC790;, &amp;#xC774;&amp;#xC81C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. FullSpeed.sln &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; VisualStudio2017 &amp;#xD639;&amp;#xC740; VisualStudio2019&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xC5B4; Realease x64 configuration&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; VisualStudio2019&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB9C8;&amp;#xCE58;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; winnie-master&amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; x64&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Ready-to-Fuzz&#34;&gt;&lt;a href=&#34;#Ready-to-Fuzz&#34; class=&#34;headerlink&#34; title=&#34;Ready to Fuzz&#34;&gt;&lt;/a&gt;Ready to Fuzz&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Winnie&amp;#xC758; &amp;#xAE43;&amp;#xD5D9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; Toy example&amp;#xC744; &amp;#xD1B5;&amp;#xD574; winnie&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &lt;code&gt;winnie-master/samples/toy_example&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &lt;code&gt;toy_example.sln&lt;/code&gt; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Release x64&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9C8;&amp;#xCE58;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; Toy example &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; x64&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; afl-fuzz.exe&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD3F4;&amp;#xB354;&amp;#xB85C; &amp;#xC62E;&amp;#xAE30;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC608;&amp;#xC2DC; input &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xD55C; &amp;#xC81C;&amp;#xACF5;&amp;#xD574; &amp;#xC8FC;&amp;#xB2C8; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;example_library.dll : target module&amp;#xC774; &amp;#xB420; dll&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;harness.dll : winnie&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; harness&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;toy_example.exe : target program&amp;#xC774; &amp;#xB420; &amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;winnie-master/x64/Release&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;(&amp;#xC774;&amp;#xD558; working directory)&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xC608;&amp;#xC81C; input&amp;#xC758; &amp;#xBCF5;&amp;#xC0AC;&amp;#xBCF8;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; Part&amp;#xC5D0;&amp;#xC11C; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; winnie&amp;#xC758; full-speed instrumentation&amp;#xC740; basic block&amp;#xB2E8;&amp;#xC704;&amp;#xB85C; break point&amp;#xB97C; &amp;#xAC78;&amp;#xC5B4; coverage&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; target module&amp;#xC758; basic block&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; basic-block-file(bb-file)&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. winnie&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; bb.py&amp;#xB77C;&amp;#xB294; IDA&amp;#xC6A9; python script&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; bb-file&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; IDA Pro&amp;#xB85C; &amp;#xC5F4;&amp;#xACE0; [&amp;#xC0C1;&amp;#xB2E8;&amp;#xBA54;&amp;#xB274; &amp;gt; File &amp;gt; Script file&amp;#x2026;]&amp;#xC744; &amp;#xD1B5;&amp;#xD574; bb.py&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xCF1C; working directory&amp;#xC5D0; basicblocks.bb&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; toy_example.exe&amp;#xC640; example_library.dll, &amp;#xCD1D; 2&amp;#xAC1C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; bb &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; basicblocks.bb&amp;#xB77C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xC0DD;&amp;#xC131; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xAE30;&amp;#xC874; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; bb &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/22/fabu1ous/winnie-2/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; bb-file&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; bb-file&amp;#xC5D0; toy_example.exe&amp;#xC640; example_library.dll&amp;#xC758; bb &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xBAA8;&amp;#xB450; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xB294; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing&#34;&gt;&lt;a href=&#34;#Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing&#34;&gt;&lt;/a&gt;Fuzzing&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz [AFL &amp;#xC635;&amp;#xC158;] -- [fullspeed &amp;#xC635;&amp;#xC158;] -- [fork server &amp;#xC635;&amp;#xC158;] -- [target argv]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Winnie&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC704;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01; &amp;#xC635;&amp;#xC158;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;AFL &amp;#xC635;&amp;#xC158; : input &amp;#xBC0F; output &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;, &amp;#xD0C0;&amp;#xC784; &amp;#xC544;&amp;#xC6C3; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;fullspeed &amp;#xC635;&amp;#xC158; : fullspeed intrumentation&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;(&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; bb-file)&lt;/li&gt;
&lt;li&gt;fork server &amp;#xC635;&amp;#xC158; : harness&amp;#xC758; &amp;#xACBD;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;, fork server&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;target argv : target program &amp;#xACBD;&amp;#xB85C; &amp;#xBC0F; &amp;#xC544;&amp;#xADDC;&amp;#xBA3C;&amp;#xD2B8; &amp;#xC124;&amp;#xC815;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz -i &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; -o out -t 1000 -I 1000 -- -bbfile basicblocks.bb -- -harness harness.dll -no_minidumps -- toy_example @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xC74C;-&amp;#xD30C;&amp;#xD2B8;-&amp;#xC608;&amp;#xACE0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8; &amp;#xC608;&amp;#xACE0;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xBC88; Winnie Part 1&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Winnie&amp;#xB294; 2&amp;#xAC1C;&amp;#xC758; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xC874; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCC28;&amp;#xBCC4;&amp;#xC810;&amp;#xC774;&amp;#xC790; Winnie&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Semi-automated Harness Generater&lt;/p&gt;
&lt;p&gt;Winnie &amp;#xB610;&amp;#xD55C; WinAFL&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC0DD;&amp;#xB41C; fuzzer&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; Harness &amp;#xC791;&amp;#xC131;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Winnie&amp;#xB97C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xC778; &amp;#xC790;&amp;#xB3D9; Harness &amp;#xC0DD;&amp;#xC131;&amp;#xAE30;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Full Speed instrumentation Fuzzing&lt;/p&gt;
&lt;p&gt;Winnie&amp;#xB294; fork&amp;#xC640; basic-block &amp;#xB2E8;&amp;#xC704; breakpoint&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; full speed instrumentation fuzzing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; fork&amp;#xC758; windows &amp;#xD3EC;&amp;#xD305;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/08/22/fabu1ous/winnie-2/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/08/22/fabu1ous/winnie-2/">

  <title>[Research] Harness 짜기 싫어 쓰는 Winnie 연구글 Part2 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-08-22 14:00" pubdate>
      2021년 8월 22일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.4k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      27
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Harness 짜기 싫어 쓰는 Winnie 연구글 Part2</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p><img src="/2021/08/22/fabu1ous/winnie-2/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. Fabu1ous &#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xBC88;&#xC5D4; Winnie&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xC744; &#xD588;&#xC73C;&#xB2C8; &#xC774;&#xBC88;&#xC5D4; &#xC2E4;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. WinAFL&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xD37C;&#xC800;&#xB85C; code coverage&#xB97C; &#xB298;&#xB9AC;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB358; &#xAE30;&#xC874; &#xBC29;&#xC2DD;&#xC778; Intel PT&#xB098; DynamoRIO &#xB300;&#xC2E0; basic-block breakpoint&#xC640; fork&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; WinAFL&#xACFC; &#xC0AC;&#xC6A9;&#xBC95;&#xC774; &#xD06C;&#xAC8C; &#xB2E4;&#xB974;&#xC9C4; &#xC54A;&#xC9C0;&#xB9CC; &#xC0AC;&#xC804; &#xC791;&#xC5C5;&#xC774; &#xC870;&#xAE08; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xC624;&#xB298;&#xC740; Winnie&#xB97C; &#xC4F0;&#xAE30; &#xC704;&#xD574; &#xD574;&#xC57C; &#xD558;&#xB294; &#xC0AC;&#xC804;&#xC791;&#xC5C5;&#xB4E4;&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xACE0; Winnie&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="Winnie"><a href="#Winnie" class="headerlink" title="Winnie"></a>Winnie</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/sslab-gatech/winnie">sslab-gatech/winnie</a></p>
<p>&#xC6B0;&#xC120; Winnie &#xACF5;&#xC2DD; github&#xC5D0; &#xAC00;&#xC154;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD569;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/2.png" srcset="/img/loading.gif" alt></p>
<h1 id="Build"><a href="#Build" class="headerlink" title="Build"></a>Build</h1><p>forklib&#xB294; unix &#xACC4;&#xC5F4; OS&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; fork()&#xB97C; windows&#xC5D0; &#xD3EC;&#xD305;&#xD55C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB85C;</p>
<p>csrss.dll&#xACFC; ntdll.dll&#xC744; &#xB9AC;&#xBC84;&#xC2F1; &#xD574; &#xC5BB;&#xC740; offset&#xB4E4;&#xC774; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB9DE;&#xAC8C; &#xCEF4;&#xD30C;&#xC77C;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xD544;&#xC694;&#xD55C; &#xC624;&#xD504;&#xC14B;&#xB4E4;&#xC744; &#xC54C;&#xC544;&#xC11C; &#xD30C;&#xC2F1; &#xD574;&#xC624;&#xB294; python &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xAC19;&#xC774; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC11C; &#xC800;&#xD76C;&#xB294; &#xC2E4;&#xD589;&#xB9CC; &#xD574;&#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/3.png" srcset="/img/loading.gif" alt></p>
<p><code>gen_csrss_offsets.py</code> &#xC774;&#xB188;&#xB9CC; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. python 3&#xB294; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xD558;&#xB2C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; python 2&#xB97C; &#xC124;&#xCE58;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC800;&#xC758; &#xACBD;&#xC6B0; python2.7.13&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC8FC;&#xC758;&#xD558;&#xC2E4; &#xC810;&#xC740; python2-x64&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC154;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. 32-bit&#xC6A9; pyhton &#xB610;&#xD55C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>python2&#xB97C; &#xC124;&#xCE58;&#xD558;&#xC168;&#xB2E4;&#xBA74; &#xC544;&#xB798; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xCC28;&#xB798;&#xB300;&#xB85C; &#xC2E4;&#xD589;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">python -m pip install --upgrade pip
python -m pip install construct pefile
python ./gen_csrss_offsets.py</code></pre>
<p><img src="/2021/08/22/fabu1ous/winnie-2/5.png" srcset="/img/loading.gif" alt></p>
<p><code>csrss_offset.h</code>&#xB97C; &#xC0DD;&#xC131;&#xD588;&#xB2E4;&#xB294; &#xBB38;&#xAD6C;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC168;&#xB2E4;&#xBA74; &#xC131;&#xACF5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC0DD;&#xC131;&#xB41C; <code>csrss_offsets.h</code> &#xD574;&#xB354; &#xD30C;&#xC77C;&#xC5D0;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB9DE;&#xB294; offset&#xB4E4;&#xC774; &#xB2F4;&#xACA8;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC790;, &#xC774;&#xC81C; &#xC2E4;&#xC81C;&#xB85C; &#xBE4C;&#xB4DC;&#xB97C; &#xD560; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;. FullSpeed.sln &#xC194;&#xB8E8;&#xC158;&#xC744; VisualStudio2017 &#xD639;&#xC740; VisualStudio2019&#xC73C;&#xB85C; &#xC5F4;&#xC5B4; Realease x64 configuration&#xC73C;&#xB85C; &#xBE4C;&#xB4DC;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; VisualStudio2019&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xBE4C;&#xB4DC;&#xB97C; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xB9C8;&#xCE58;&#xC168;&#xB2E4;&#xBA74; winnie-master&#xD3F4;&#xB354; &#xB0B4;&#xBD80;&#xC5D0; x64&#xB77C;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD3F4;&#xB354;&#xAC00; &#xC0DD;&#xC131;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Ready-to-Fuzz"><a href="#Ready-to-Fuzz" class="headerlink" title="Ready to Fuzz"></a>Ready to Fuzz</h1><p><img src="/2021/08/22/fabu1ous/winnie-2/9.png" srcset="/img/loading.gif" alt></p>
<p>Winnie&#xC758; &#xAE43;&#xD5D9;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; Toy example&#xC744; &#xD1B5;&#xD574; winnie&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;. &#xC6B0;&#xC120; <code>winnie-master/samples/toy_example</code> &#xACBD;&#xB85C;&#xB85C; &#xC774;&#xB3D9;&#xD574; <code>toy_example.sln</code> &#xC194;&#xB8E8;&#xC158;&#xC744; &#xBE4C;&#xB4DC;&#xD574;&#xC90D;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/10.png" srcset="/img/loading.gif" alt></p>
<p>Release x64&#xB85C; &#xBE4C;&#xB4DC;&#xB97C; &#xB9C8;&#xCE58;&#xC168;&#xB2E4;&#xBA74; Toy example &#xD3F4;&#xB354;&#xC5D0; x64&#xB77C;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD3F4;&#xB354;&#xAC00; &#xC0DD;&#xC131;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xC800;&#xD76C;&#xAC00; &#xC0AC;&#xC6A9;&#xD560; 3&#xAC00;&#xC9C0; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xC0AC;&#xD574; afl-fuzz.exe&#xC640; &#xAC19;&#xC740; &#xD3F4;&#xB354;&#xB85C; &#xC62E;&#xAE30;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC608;&#xC2DC; input &#xD30C;&#xC77C; &#xB610;&#xD55C; &#xC81C;&#xACF5;&#xD574; &#xC8FC;&#xB2C8; &#xC774;&#xAC83;&#xB3C4; &#xBCF5;&#xC0AC;&#xD574;&#xC90D;&#xC2DC;&#xB2E4;.</p>
<ul>
<li>example_library.dll : target module&#xC774; &#xB420; dll&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>harness.dll : winnie&#xC5D0; &#xC0AC;&#xC6A9;&#xB420; harness&#xC758; &#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>toy_example.exe : target program&#xC774; &#xB420; &#xBA54;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="/2021/08/22/fabu1ous/winnie-2/11.png" srcset="/img/loading.gif" alt></p>
<p><code>winnie-master/x64/Release</code> &#xACBD;&#xB85C;(&#xC774;&#xD558; working directory)&#xB85C; &#xC774;&#xB3D9;&#xD574; &#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xC138; &#xAC1C;&#xC758; &#xD30C;&#xC77C;&#xACFC; &#xC608;&#xC81C; input&#xC758; &#xBCF5;&#xC0AC;&#xBCF8;&#xC744; &#xC0DD;&#xC131;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xC800;&#xBC88; Part&#xC5D0;&#xC11C; &#xAC04;&#xB7B5;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD588;&#xB4EF;&#xC774; winnie&#xC758; full-speed instrumentation&#xC740; basic block&#xB2E8;&#xC704;&#xB85C; break point&#xB97C; &#xAC78;&#xC5B4; coverage&#xB97C; &#xAE30;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; target module&#xC758; basic block&#xC5D0; &#xB300;&#xD55C; &#xC8FC;&#xC18C;&#xB4E4;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xB294;&#xB370; &#xC774;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xC744; basic-block-file(bb-file)&#xC774;&#xB77C; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. winnie&#xC5D0; &#xD3EC;&#xD568;&#xB41C; bb.py&#xB77C;&#xB294; IDA&#xC6A9; python script&#xB97C; &#xC0AC;&#xC6A9;&#xD574; bb-file&#xC744; &#xC0DD;&#xC131;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/13.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC01; &#xBAA8;&#xB4C8;&#xC744; IDA Pro&#xB85C; &#xC5F4;&#xACE0; [&#xC0C1;&#xB2E8;&#xBA54;&#xB274; &gt; File &gt; Script file&#x2026;]&#xC744; &#xD1B5;&#xD574; bb.py&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C; working directory&#xC5D0; basicblocks.bb&#xB77C;&#xB294; &#xD30C;&#xC77C;&#xC774; &#xC0DD;&#xC131;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; toy_example.exe&#xC640; example_library.dll, &#xCD1D; 2&#xAC1C;&#xC758; &#xBAA8;&#xB4C8;&#xC5D0; &#xB300;&#xD55C; bb &#xC815;&#xBCF4;&#xB97C; &#xD68D;&#xB4DD;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; basicblocks.bb&#xB77C;&#xB294; &#xD30C;&#xC77C;&#xC774; &#xC774;&#xBBF8; &#xC0DD;&#xC131; &#xACBD;&#xB85C;&#xC5D0; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xBA74; &#xB36E;&#xC5B4;&#xC4F0;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xAE30;&#xC874; &#xB0B4;&#xC6A9;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; bb &#xC815;&#xBCF4;&#xAC00; &#xCD94;&#xAC00;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/08/22/fabu1ous/winnie-2/14.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xC0AC;&#xC9C4;&#xC740; &#xC0DD;&#xC131;&#xB41C; bb-file&#xC758; &#xC77C;&#xBD80; &#xBAA8;&#xC2B5;&#xC785;&#xB2C8;&#xB2E4;. &#xC0DD;&#xC131;&#xB41C; bb-file&#xC5D0; toy_example.exe&#xC640; example_library.dll&#xC758; bb &#xC815;&#xBCF4;&#xAC00; &#xBAA8;&#xB450; &#xB4E4;&#xC5B4;&#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xC168;&#xB2E4;&#xBA74; &#xD37C;&#xC9D5; &#xD560; &#xC900;&#xBE44;&#xB294; &#xB05D;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Fuzzing"><a href="#Fuzzing" class="headerlink" title="Fuzzing"></a>Fuzzing</h1><pre><code class="hljs bash">afl-fuzz [AFL &#xC635;&#xC158;] -- [fullspeed &#xC635;&#xC158;] -- [fork server &#xC635;&#xC158;] -- [target argv]</code></pre>
<p>Winnie&#xB85C; &#xD37C;&#xC9D5;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xC704;&#xACFC; &#xAC19;&#xC740; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01; &#xC635;&#xC158;&#xB4E4;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>AFL &#xC635;&#xC158; : input &#xBC0F; output &#xD30C;&#xC77C; &#xACBD;&#xB85C;, &#xD0C0;&#xC784; &#xC544;&#xC6C3; &#xC124;&#xC815;</li>
<li>fullspeed &#xC635;&#xC158; : fullspeed intrumentation&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB4E4;(&#xC608;&#xB97C; &#xB4E4;&#xBA74; bb-file)</li>
<li>fork server &#xC635;&#xC158; : harness&#xC758; &#xACBD;&#xB85C; &#xC9C0;&#xC815;, fork server&#xC758; &#xB3D9;&#xC791; &#xC124;&#xC815;</li>
<li>target argv : target program &#xACBD;&#xB85C; &#xBC0F; &#xC544;&#xADDC;&#xBA3C;&#xD2B8; &#xC124;&#xC815;</li>
</ul>
<pre><code class="hljs bash">afl-fuzz -i <span class="hljs-keyword">in</span> -o out -t 1000 -I 1000 -- -bbfile basicblocks.bb -- -harness harness.dll -no_minidumps -- toy_example @@</code></pre>
<h1 id="&#xB2E4;&#xC74C;-&#xD30C;&#xD2B8;-&#xC608;&#xACE0;"><a href="#&#xB2E4;&#xC74C;-&#xD30C;&#xD2B8;-&#xC608;&#xACE0;" class="headerlink" title="&#xB2E4;&#xC74C; &#xD30C;&#xD2B8; &#xC608;&#xACE0;"></a>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8; &#xC608;&#xACE0;</h1><p>&#xC800;&#xBC88; Winnie Part 1&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xB300;&#xB85C; Winnie&#xB294; 2&#xAC1C;&#xC758; &#xB2E8;&#xACC4;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAE30;&#xC874; &#xD37C;&#xC800;&#xB4E4;&#xACFC; &#xB2E4;&#xB978; &#xCC28;&#xBCC4;&#xC810;&#xC774;&#xC790; Winnie&#xC5D0;&#xC11C; &#xC8FC;&#xBAA9;&#xD574;&#xC57C; &#xD560; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><p>Semi-automated Harness Generater</p>
<p>Winnie &#xB610;&#xD55C; WinAFL&#xC5D0;&#xC11C; &#xD30C;&#xC0DD;&#xB41C; fuzzer&#xC774;&#xBBC0;&#xB85C; Harness &#xC791;&#xC131;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. Winnie&#xB97C; &#xC8FC;&#xC81C;&#xB85C; &#xAE00;&#xC744; &#xC4F0;&#xAE30; &#xC2DC;&#xC791;&#xD55C; &#xC774;&#xC720;&#xC778; &#xC790;&#xB3D9; Harness &#xC0DD;&#xC131;&#xAE30;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xACE0; &#xADF8; &#xB3D9;&#xC791;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
</li>
<li><p>Full Speed instrumentation Fuzzing</p>
<p>Winnie&#xB294; fork&#xC640; basic-block &#xB2E8;&#xC704; breakpoint&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; full speed instrumentation fuzzing&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xBA74; fork&#xC758; windows &#xD3EC;&#xD305;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD6C;&#xC131;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
</li>
</ol>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/harness/">harness</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-bounty/">bug bounty</a>
                  
                  <a class="hover-with-bg" href="/tags/winnie/">winnie</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/08/23/fabu1ous/2021-08-23/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021–20082: Integer Overflow to RCE — ManageEngine Asset Explorer Agent</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/08/20/j0ker/2021-08-20/">
                    <span class="hidden-mobile">[하루한줄]  CVE-2021-22123 : Fortinet FortiWeb OS Command Injection</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/08/22/fabu1ous/winnie-2/';
        this.page.identifier = '/2021/08/22/fabu1ous/winnie-2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Harness 짜기 싫어 쓰는 Winnie 연구글 Part2&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
