

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xB9C1;&amp;#xD06C; : &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&#34;&gt;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804; &amp;#xAE00; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30; :  &lt;a href=&#34;https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/&#34;&gt;[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;Technical-Details-The-Challenges-and-How-to-Overcome-Them-2&#34;&gt;&lt;a href=&#34;#Technical-Details-The-Challenges-and-How-to-Overcome-Them-2&#34; class=&#34;headerlink&#34; title=&#34;[Technical Details: The Challenges and How to Overcome Them - 2]&#34;&gt;&lt;/a&gt;[Technical Details: The Challenges and How to Overcome Them - 2]&lt;/h1&gt;&lt;h2 id=&#34;Statefulness&#34;&gt;&lt;a href=&#34;#Statefulness&#34; class=&#34;headerlink&#34; title=&#34;Statefulness&#34;&gt;&lt;/a&gt;Statefulness&lt;/h2&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xB450; &amp;#xAC1C;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &lt;strong&gt;protocol grammer&lt;/strong&gt; &amp;#xC2DC;&amp;#xD589;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; &amp;#xC778;&amp;#xD48B; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xD06C;&amp;#xAE30; &amp;#xC81C;&amp;#xD55C;&lt;ul&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xB300;&amp;#xAC12; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC18C;&amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(&amp;#xC608;: &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; 4byte &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774; &amp;#xBC30;&amp;#xC5F4;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; 4&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD568;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xAC12; &amp;#xC81C;&amp;#xD55C;&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xAC12;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xC18C;&amp;#xAC12;&amp;#xACFC; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12;&lt;/li&gt;
&lt;li&gt;PDU &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xAC12;&amp;#xC740; &amp;#xAC01; PDU&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2EC;&amp;#xB77C;&amp;#xC57C; &amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpbcgr/5073f4ed-1e93-45e1-b039-6e30c385867c&#34;&gt;MS&amp;#xC758; RDP &amp;#xBC0F; &amp;#xD655;&amp;#xC7A5; &amp;#xBB38;&amp;#xC11C;&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; RDP &amp;#xBB38;&amp;#xBC95; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB828; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1; &amp;#xD55C; &amp;#xB4A4; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xD574; &amp;#xCD94;&amp;#xCD9C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xD574;&amp;#xB2F9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &lt;code&gt;msgType&lt;/code&gt; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4; PDU &amp;#xD06C;&amp;#xAE30;&amp;#xC640; &amp;#xACE0;&amp;#xC720; &amp;#xC2DD;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC640;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xCD1D; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; 22~122, &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; 2 modulo 4&amp;#xB97C; &amp;#xB0A8;&amp;#xAE30;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xB85C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; mutation engine&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xBA74; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; mutation&amp;#xC744; &amp;#xB193;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC790;&amp;#xC8FC; &amp;#xB2EB;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xC801;&amp;#xC740; &amp;#xD69F;&amp;#xC218;&amp;#xB85C; &amp;#xC2DC;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xB54C; &amp;#xC704; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC720;&amp;#xC77C;&amp;#xD55C; &amp;#xC120;&amp;#xD0DD;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xCC44;&amp;#xB110;(GFX)&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD574; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xB2EB;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xBA70; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xB458; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xC804; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC6D0;&amp;#xB798; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; mutation engine&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xC0AC;&amp;#xC774; &amp;#xADE0;&amp;#xD615;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Multi-input-Fuzzing&#34;&gt;&lt;a href=&#34;#Multi-input-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Multi-input Fuzzing&#34;&gt;&lt;/a&gt;Multi-input Fuzzing&lt;/h2&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB294; &amp;#xB2E8;&amp;#xC77C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xBC1C;&amp;#xACAC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xACFC; &amp;#xADF8; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294; fuzzer dictionary&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; dictionary word&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; PDU&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD558;&amp;#xACE0; &amp;#xCC28;&amp;#xB840;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;___cmd07 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;st PDU data&amp;gt;
___cmd02 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;nd PDU data&amp;gt;
___cmd03 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;rd PDU data&amp;gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; &lt;code&gt;msgType&lt;/code&gt;&amp;#xC774; 7, 2, 3&amp;#xC778; 3&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC640; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xACFC; &amp;#xC774;&amp;#xB4E4;&amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC94;&amp;#xC704;&amp;#xC758; &amp;#xC77C;&amp;#xB300;&amp;#xC77C; &amp;#xB300;&amp;#xC751;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC774; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xBA74; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC8FC;&amp;#xAE30;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD55C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC74C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC774; &amp;#xACB0;&amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xB8F0; &amp;#xB0C8;&amp;#xACE0;, &amp;#xB610;&amp;#xD55C; &amp;#xAC01; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PDU&amp;#xC758; &amp;#xC218;&amp;#xB97C; &amp;#xC81C;&amp;#xD55C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; 100&amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xBA74; &amp;#xD55C; &amp;#xBC88; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reproduction-Issues&#34;&gt;&lt;a href=&#34;#Reproduction-Issues&#34; class=&#34;headerlink&#34; title=&#34;Reproduction Issues&#34;&gt;&lt;/a&gt;Reproduction Issues&lt;/h2&gt;&lt;p&gt;&amp;#xC57D; 1&amp;#xC8FC;&amp;#xC77C;&amp;#xAC04;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xD6C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xAF64; &amp;#xC790;&amp;#xC8FC; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xC800;&amp;#xC7A5; &amp;#xD2B9;&amp;#xC131; &amp;#xB54C;&amp;#xBB38;&amp;#xC778; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xCE21;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9D0;&amp;#xD574;, &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xD6C4;&amp;#xC18D; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xB54C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC900;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB300;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; WinAFL&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Crash-Analysis-Automation&#34;&gt;&lt;a href=&#34;#Crash-Analysis-Automation&#34; class=&#34;headerlink&#34; title=&#34;Crash Analysis Automation&#34;&gt;&lt;/a&gt;Crash Analysis Automation&lt;/h2&gt;&lt;p&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xD55C;&amp;#xBC88; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xBA74; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; WinAFL&amp;#xC740; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#x201C;&amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC54C;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC911; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCC98;&amp;#xB9AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB2E4;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; WinAFL&amp;#xC740; &amp;#xB9E4;&amp;#xBC88; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xCDA9;&amp;#xB3CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xAC01; &amp;#xCDA9;&amp;#xB3CC;&amp;#xC744; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xBA70; &amp;#xB458;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB85C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC44;&amp;#xC6CC;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; WinDBG &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xB9CC; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; PowerShell &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Long-Startup-Time&#34;&gt;&lt;a href=&#34;#Long-Startup-Time&#34; class=&#34;headerlink&#34; title=&#34;Long Startup Time&#34;&gt;&lt;/a&gt;Long Startup Time&lt;/h2&gt;&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC124;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD0C0;&amp;#xAC9F;(&lt;code&gt;mstsc.exe&lt;/code&gt;)&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC21C;&amp;#xAC04;&amp;#xBD80;&amp;#xD130; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC21C;&amp;#xAC04;&amp;#xAE4C;&amp;#xC9C0; 10&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB824; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL-Fuzz&amp;#xC758; &lt;code&gt;-fuzz_iterations&lt;/code&gt; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Multi-channel-Fuzzing&#34;&gt;&lt;a href=&#34;#Multi-channel-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Multi-channel Fuzzing&#34;&gt;&lt;/a&gt;Multi-channel Fuzzing&lt;/h2&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC77C;&amp;#xBD80; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242&#34;&gt;&amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xB41C; &amp;#xB300;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242&#34;&gt;MS-RDPECAM&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xCD5C;&amp;#xC18C; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC73C;&amp;#xBA70; fuzzer dictionary&amp;#xAC00; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC804;&amp;#xC1A1;&amp;#xB420; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Locating-relevant-code&#34;&gt;&lt;a href=&#34;#Locating-relevant-code&#34; class=&#34;headerlink&#34; title=&#34;Locating relevant code&#34;&gt;&lt;/a&gt;Locating relevant code&lt;/h2&gt;&lt;p&gt;RDP&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC870;&amp;#xCC28; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;PS C:\&amp;gt; gci -Include *.exe, *.dll, *.sys -Recurse C:\Windows\ -ErrorAction SilentlyContinue | ?{[System.Diagnostics.FileVersionInfo]::GetVersionInfo($_).FileDescription -match &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;RDP|Remote Desktop&amp;quot;&lt;/span&gt;} | Measure-Object | select count

Count
-----
  &lt;span class=&#34;hljs-number&#34;&gt;191&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xBC84;&amp;#xC804;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; PDB&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB364;&amp;#xD504;(exe/sys/dll&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC5F0;&amp;#xACB0;)&amp;#xD558;&amp;#xC5EC; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xD604;&amp;#xC7AC; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCC44;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; dynamic channel &amp;#xC218;&amp;#xC2E0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &lt;code&gt;C&amp;lt;class-name&amp;gt;::OnDataReceived&lt;/code&gt; &amp;#xD328;&amp;#xD134;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD568;&amp;#xC218; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xCC44;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Bug-Case-Studies&#34;&gt;&lt;a href=&#34;#Bug-Case-Studies&#34; class=&#34;headerlink&#34; title=&#34;Bug Case Studies&#34;&gt;&lt;/a&gt;&lt;strong&gt;Bug Case Studies&lt;/strong&gt;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC84;&amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC801;&amp;#xC778; &amp;#xC138;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AUDIO-PLAYBACK-Channel-Server-&amp;#x2192;-Client&#34;&gt;&lt;a href=&#34;#AUDIO-PLAYBACK-Channel-Server-&amp;#x2192;-Client&#34; class=&#34;headerlink&#34; title=&#34;AUDIO_PLAYBACK Channel (Server &amp;#x2192; Client)&#34;&gt;&lt;/a&gt;AUDIO_PLAYBACK Channel (Server &amp;#x2192; Client)&lt;/h2&gt;&lt;p&gt;&lt;code&gt;AUDIO_PLAYBACK_DVC&lt;/code&gt; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC;&amp;#xB97C; &amp;#xC7AC;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1;&amp;#xC758; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Initialization Sequence&lt;/strong&gt; - &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xBC84;&amp;#xC804; &amp;#xBC0F; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://www.notion.so/16b2c1acde034f6cac0caf42b6ca6e97&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Data Transfer Sequence&lt;/strong&gt; - &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xC0DD;&amp;#xD560; &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Wave &amp;#xBC0F; WaveInfo PDU&amp;#xC5D0;&amp;#xB294; &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD50;&amp;#xD658;&amp;#xB418;&amp;#xB294; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD3EC;&amp;#xB9F7; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74;(&amp;#xC989;, Wave &amp;#xB610;&amp;#xB294; WaveInfo PDU&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC640; &amp;#xB2E4;&amp;#xB974;&amp;#xBA74;) &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC0C8; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in mstscax!CRdpAudioController::OnNewFormat&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)new_format_index &amp;gt;= &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;formatArray_size )&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD3EC;&amp;#xB9F7; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xB418;&amp;#xBA74; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;OnNewFormat()&lt;/code&gt;  &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xC778;&amp;#xC99D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xAD00;&amp;#xB828; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC758;&amp;#xC0AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in mstscax!CRdpAudioController::OnWaveData&lt;/span&gt;
last_format_index = &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;last_format_index;
format_index_from_pdu = *((_WORD *)pdu + &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;); &lt;span class=&#34;hljs-comment&#34;&gt;//pdu is controlled by the server&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( last_format_index != format_index_from_pdu )
{
    CRdpAudioController::OnNewFormat(&lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;, (__int64 *)format_index_from_pdu); &lt;span class=&#34;hljs-comment&#34;&gt;// this is where the bound check is being made&lt;/span&gt;
                                                                              &lt;span class=&#34;hljs-comment&#34;&gt;// but only if the format index is different than the last index&lt;/span&gt;
    last_format_index = *((&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)pdu + &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;last_format_index = last_format_index;
}
formats_array = (AUDIO_FORMAT **)&lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;formatArray;
current_format = formats_array[last_format_index]-&amp;gt;wFormatTag; &lt;span class=&#34;hljs-comment&#34;&gt;// crashes here&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &lt;code&gt;0x1A&lt;/code&gt; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7; &lt;code&gt;0x5&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Wave2 PDU&amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0B8; &amp;#xAC83;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB514;&amp;#xCF54;&amp;#xB354;(formats &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7; &amp;#xD56D;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5ED;&amp;#xCC38;&amp;#xC870;)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xBA74;&amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C8; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x2&lt;/code&gt; &amp;#xD3EC;&amp;#xB9F7;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774;&amp;#xC804; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xC0C8; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD3EC;&amp;#xB9F7; &lt;code&gt;0x5&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; Wave2 PDU&amp;#xB97C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; 2-format array &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xC12F; &amp;#xBC88;&amp;#xC9F8; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294; out-of-bound read&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xCD94;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xC7AC;&amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xB4A4; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098; &amp;#xC77D;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB294; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AUDIO-INPUT-Channel-Client-&amp;#x2192;-Server&#34;&gt;&lt;a href=&#34;#AUDIO-INPUT-Channel-Client-&amp;#x2192;-Server&#34; class=&#34;headerlink&#34; title=&#34;AUDIO_INPUT Channel (Client &amp;#x2192; Server)&#34;&gt;&lt;/a&gt;AUDIO_INPUT Channel (Client &amp;#x2192; Server)&lt;/h2&gt;&lt;p&gt;&lt;code&gt;AUDIO_INPUT&lt;/code&gt; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xC785;&amp;#xB825; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;audiodg.exe&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;AUDIO_PLAYBACK_DVC&lt;/code&gt; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xAD50;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/&#34;&gt;MS-RDPEAI&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB294; command, &amp;#xD3EC;&amp;#xB9F7; &amp;#xC218; &amp;#xBC0F; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; 9 byte &amp;#xD5E4;&amp;#xB354;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xAC01;&amp;#xAC01; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;(&amp;#xCD94;&amp;#xAC00; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD544;&amp;#xB4DC; &amp;#xD3EC;&amp;#xD568;) &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xBC30;&amp;#xC5F4;&amp;#xC774; &amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/&#34;&gt;MS-RDPEAI&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;code&gt;rdpendp.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 9 bytes &amp;#xC774;&amp;#xC0C1;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in rdpendp!CAudioInputHandler::OnFormatsReceived&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( size &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt; )
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  }
  &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  size_from_msg = *(_DWORD *)(data + &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( size_from_msg &amp;gt; size )
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xC778; 9&amp;#xB97C; &amp;#xBE7C;&amp;#xACE0; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xC218;&amp;#xB97C; &amp;#xC77D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; interger underflow&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC704; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xC5B8;&amp;#xB354;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD328;&amp;#xD0B7; &amp;#xB05D; &amp;#xC774;&amp;#xD6C4;&amp;#xBD80;&amp;#xD130; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in rdpendp!CAudioInputHandler::OnFormatsReceived&lt;/span&gt;
underflowed_size = size_from_pdu - &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;;
format_definition_offset = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)(pdu + &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;);
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( num_formats )
{
    &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; ( underflowed_size &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;0x12&lt;/span&gt; )
    {
        format_definition_size = format_definition_offset[&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;];
        total_format_size = format_definition_size + &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( underflowed_size &amp;lt; (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64)(format_definition_size + &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;) )
            &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;
        (*class_fomats_array)[format_index] = (struct SNDFORMATITEM *)&lt;span class=&#34;hljs-keyword&#34;&gt;operator&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt;[](total_format_size);
        local_format = (*class_fomats_array)[format_index];
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !local_format )
        {
            status = E_OUTOFMEMORY;
            &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; CLEAN_AND_RETURN;
        }
        memcpy_0(local_format, format_definition_offset, total_format_size);
        format_definition_offset = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)((&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)format_definition_offset + total_format_size);
        underflowed_size -= total_format_size;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( ++format_index &amp;gt;= num_formats )
            &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; LABEL_50;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; INVALID_ARG_EXIT;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;audiodg&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; DynamoRIO &amp;#xC5F0;&amp;#xACB0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Summary&#34;&gt;&lt;a href=&#34;#Summary&#34; class=&#34;headerlink&#34; title=&#34;Summary&#34;&gt;&lt;/a&gt;Summary&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC778; Windows&amp;#xC758; RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB;&amp;#xC9F8;, &amp;#xC6D0;&amp;#xB798; &amp;#xBAA9;&amp;#xD45C;(&amp;#xC608;: RCE)&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xC989; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC600;&amp;#xB358; &amp;#xAC83;&amp;#xACFC; &amp;#xAC1C;&amp;#xC120;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xC810;&amp;#xC744; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xAC00; &amp;#xACFC;&amp;#xAC70; &amp;#xACBD;&amp;#xD5D8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC30;&amp;#xC6B0;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB458;&amp;#xC9F8;, &amp;#xD37C;&amp;#xC9D5; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xAD6C;&amp;#xD560; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xAE30;&amp;#xAC00; &amp;#xB192;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xACFC; &amp;#xACB0;&amp;#xD569;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC88B;&amp;#xC740; &amp;#xD45C;&amp;#xC801;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB85C;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC;&amp;#xC57C; &amp;#xD568;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%208.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC5F0;&amp;#xACB0; RDP &amp;#xC11C;&amp;#xBC84;. &amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://www.shodan.io/search?query=port%3A%223389%22&#34;&gt;shodan.io&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Microsoft&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; &amp;#xBA87; &amp;#xB144; &amp;#xB3D9;&amp;#xC548; &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; RDP &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC9C0;&amp;#xC2DD;&amp;#xACFC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD5A5;&amp;#xD6C4; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xCD94;&amp;#xC9C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAD6C;&amp;#xD560; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xC608;&amp;#xB85C;&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xC131;&amp;#xB2A5; &amp;#xAC1C;&amp;#xC120;, &amp;#xD37C;&amp;#xC9D5; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;, &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130; &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800; &amp;#xC0AC;&amp;#xC6A9; &amp;#xB610;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC218;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; RPC &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C; &amp;#xAE30;&amp;#xB300;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Fuzzing RDP: Holding the Stick at Both Ends (2) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xB9C1;&amp;#xD06C; : &lt;a href=&#34;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&#34;&gt;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804; &amp;#xAE00; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30; :  &lt;a href=&#34;https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/&#34;&gt;[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;Technical-Details-The-Challenges-and-How-to-Overcome-Them-2&#34;&gt;&lt;a href=&#34;#Technical-Details-The-Challenges-and-How-to-Overcome-Them-2&#34; class=&#34;headerlink&#34; title=&#34;[Technical Details: The Challenges and How to Overcome Them - 2]&#34;&gt;&lt;/a&gt;[Technical Details: The Challenges and How to Overcome Them - 2]&lt;/h1&gt;&lt;h2 id=&#34;Statefulness&#34;&gt;&lt;a href=&#34;#Statefulness&#34; class=&#34;headerlink&#34; title=&#34;Statefulness&#34;&gt;&lt;/a&gt;Statefulness&lt;/h2&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xB450; &amp;#xAC1C;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC790;&amp;#xB9C8;&amp;#xC790; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &lt;strong&gt;protocol grammer&lt;/strong&gt; &amp;#xC2DC;&amp;#xD589;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; &amp;#xC778;&amp;#xD48B; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xD06C;&amp;#xAE30; &amp;#xC81C;&amp;#xD55C;&lt;ul&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xB300;&amp;#xAC12; &amp;#xBC0F; &amp;#xCD5C;&amp;#xC18C;&amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(&amp;#xC608;: &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; 4byte &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774; &amp;#xBC30;&amp;#xC5F4;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; 4&amp;#xB85C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD568;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xAC12; &amp;#xC81C;&amp;#xD55C;&lt;ul&gt;
&lt;li&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xAC12;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xC18C;&amp;#xAC12;&amp;#xACFC; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12;&lt;/li&gt;
&lt;li&gt;PDU &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xAC12;&amp;#xC740; &amp;#xAC01; PDU&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2EC;&amp;#xB77C;&amp;#xC57C; &amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpbcgr/5073f4ed-1e93-45e1-b039-6e30c385867c&#34;&gt;MS&amp;#xC758; RDP &amp;#xBC0F; &amp;#xD655;&amp;#xC7A5; &amp;#xBB38;&amp;#xC11C;&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; RDP &amp;#xBB38;&amp;#xBC95; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB828; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1; &amp;#xD55C; &amp;#xB4A4; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; &amp;#xC2E4;&amp;#xD328;&amp;#xD55C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1;&amp;#xD574; &amp;#xCD94;&amp;#xCD9C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xD574;&amp;#xB2F9; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &lt;code&gt;msgType&lt;/code&gt; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4; PDU &amp;#xD06C;&amp;#xAE30;&amp;#xC640; &amp;#xACE0;&amp;#xC720; &amp;#xC2DD;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC640;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xCD1D; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; 22~122, &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; 2 modulo 4&amp;#xB97C; &amp;#xB0A8;&amp;#xAE30;&amp;#xB294; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xB85C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; mutation engine&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xBA74; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; mutation&amp;#xC744; &amp;#xB193;&amp;#xCE60; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC790;&amp;#xC8FC; &amp;#xB2EB;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xC801;&amp;#xC740; &amp;#xD69F;&amp;#xC218;&amp;#xB85C; &amp;#xC2DC;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xB54C; &amp;#xC704; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC720;&amp;#xC77C;&amp;#xD55C; &amp;#xC120;&amp;#xD0DD;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xCC44;&amp;#xB110;(GFX)&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD574; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xB2EB;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xBA70; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xB458; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xC804; &amp;#xC6D0;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC6D0;&amp;#xB798; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCDA9;&amp;#xBD84;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; mutation engine&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xC0AC;&amp;#xC774; &amp;#xADE0;&amp;#xD615;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Multi-input-Fuzzing&#34;&gt;&lt;a href=&#34;#Multi-input-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Multi-input Fuzzing&#34;&gt;&lt;/a&gt;Multi-input Fuzzing&lt;/h2&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB294; &amp;#xB2E8;&amp;#xC77C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xBC1C;&amp;#xACAC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xACFC; &amp;#xADF8; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294; fuzzer dictionary&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; dictionary word&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; PDU&amp;#xB85C; &amp;#xBD84;&amp;#xD560;&amp;#xD558;&amp;#xACE0; &amp;#xCC28;&amp;#xB840;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;___cmd07 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;st PDU data&amp;gt;
___cmd02 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;nd PDU data&amp;gt;
___cmd03 &amp;lt;&lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;rd PDU data&amp;gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xC774;&amp;#xC804;&amp;#xD2B8;&amp;#xB294; &lt;code&gt;msgType&lt;/code&gt;&amp;#xC774; 7, 2, 3&amp;#xC778; 3&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC640; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xACFC; &amp;#xC774;&amp;#xB4E4;&amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xBC94;&amp;#xC704;&amp;#xC758; &amp;#xC77C;&amp;#xB300;&amp;#xC77C; &amp;#xB300;&amp;#xC751;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC774; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB9C8;&amp;#xCEE4;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xBA74; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC8FC;&amp;#xAE30;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD55C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC74C; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC774; &amp;#xACB0;&amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xACB0;&amp;#xACFC;&amp;#xB8F0; &amp;#xB0C8;&amp;#xACE0;, &amp;#xB610;&amp;#xD55C; &amp;#xAC01; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PDU&amp;#xC758; &amp;#xC218;&amp;#xB97C; &amp;#xC81C;&amp;#xD55C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; 100&amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xBA74; &amp;#xD55C; &amp;#xBC88; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reproduction-Issues&#34;&gt;&lt;a href=&#34;#Reproduction-Issues&#34; class=&#34;headerlink&#34; title=&#34;Reproduction Issues&#34;&gt;&lt;/a&gt;Reproduction Issues&lt;/h2&gt;&lt;p&gt;&amp;#xC57D; 1&amp;#xC8FC;&amp;#xC77C;&amp;#xAC04;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5; &amp;#xD6C4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xC7AC;&amp;#xD604;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xAF64; &amp;#xC790;&amp;#xC8FC; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xC800;&amp;#xC7A5; &amp;#xD2B9;&amp;#xC131; &amp;#xB54C;&amp;#xBB38;&amp;#xC778; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xCE21;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9D0;&amp;#xD574;, &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xD6C4;&amp;#xC18D; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xB54C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC900;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7AC;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB300;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; WinAFL&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Crash-Analysis-Automation&#34;&gt;&lt;a href=&#34;#Crash-Analysis-Automation&#34; class=&#34;headerlink&#34; title=&#34;Crash Analysis Automation&#34;&gt;&lt;/a&gt;Crash Analysis Automation&lt;/h2&gt;&lt;p&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xD55C;&amp;#xBC88; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xBA74; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; WinAFL&amp;#xC740; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#x201C;&amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC54C;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC911; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC138;&amp;#xD2B8;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCC98;&amp;#xB9AC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB2E4;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xCEE4;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; WinAFL&amp;#xC740; &amp;#xB9E4;&amp;#xBC88; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xCDA9;&amp;#xB3CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD574;&amp;#xC57C;&amp;#xB9CC; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xCCAB;&amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xAC01; &amp;#xCDA9;&amp;#xB3CC;&amp;#xC744; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xC5C5;&amp;#xC774;&amp;#xBA70; &amp;#xB458;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB85C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC44;&amp;#xC6CC;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; WinDBG &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xB9CC; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; PowerShell &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Long-Startup-Time&#34;&gt;&lt;a href=&#34;#Long-Startup-Time&#34; class=&#34;headerlink&#34; title=&#34;Long Startup Time&#34;&gt;&lt;/a&gt;Long Startup Time&lt;/h2&gt;&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xC124;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD0C0;&amp;#xAC9F;(&lt;code&gt;mstsc.exe&lt;/code&gt;)&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC21C;&amp;#xAC04;&amp;#xBD80;&amp;#xD130; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC21C;&amp;#xAC04;&amp;#xAE4C;&amp;#xC9C0; 10&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB824; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD55C; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL-Fuzz&amp;#xC758; &lt;code&gt;-fuzz_iterations&lt;/code&gt; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Multi-channel-Fuzzing&#34;&gt;&lt;a href=&#34;#Multi-channel-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;Multi-channel Fuzzing&#34;&gt;&lt;/a&gt;Multi-channel Fuzzing&lt;/h2&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC77C;&amp;#xBD80; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242&#34;&gt;&amp;#xBB38;&amp;#xC11C;&lt;/a&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xB41C; &amp;#xB300;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242&#34;&gt;MS-RDPECAM&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xCD5C;&amp;#xC18C; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC73C;&amp;#xBA70; fuzzer dictionary&amp;#xAC00; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xC804;&amp;#xC1A1;&amp;#xB420; &amp;#xCC44;&amp;#xB110;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Locating-relevant-code&#34;&gt;&lt;a href=&#34;#Locating-relevant-code&#34; class=&#34;headerlink&#34; title=&#34;Locating relevant code&#34;&gt;&lt;/a&gt;Locating relevant code&lt;/h2&gt;&lt;p&gt;RDP&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC870;&amp;#xCC28; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;PS C:\&amp;gt; gci -Include *.exe, *.dll, *.sys -Recurse C:\Windows\ -ErrorAction SilentlyContinue | ?{[System.Diagnostics.FileVersionInfo]::GetVersionInfo($_).FileDescription -match &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;RDP|Remote Desktop&amp;quot;&lt;/span&gt;} | Measure-Object | select count

Count
-----
  &lt;span class=&#34;hljs-number&#34;&gt;191&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xBC84;&amp;#xC804;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; PDB&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB364;&amp;#xD504;(exe/sys/dll&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC5F0;&amp;#xACB0;)&amp;#xD558;&amp;#xC5EC; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xD604;&amp;#xC7AC; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCC44;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC70;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; dynamic channel &amp;#xC218;&amp;#xC2E0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &lt;code&gt;C&amp;lt;class-name&amp;gt;::OnDataReceived&lt;/code&gt; &amp;#xD328;&amp;#xD134;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD568;&amp;#xC218; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xCC44;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Bug-Case-Studies&#34;&gt;&lt;a href=&#34;#Bug-Case-Studies&#34; class=&#34;headerlink&#34; title=&#34;Bug Case Studies&#34;&gt;&lt;/a&gt;&lt;strong&gt;Bug Case Studies&lt;/strong&gt;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC84;&amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC801;&amp;#xC778; &amp;#xC138;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AUDIO-PLAYBACK-Channel-Server-&amp;#x2192;-Client&#34;&gt;&lt;a href=&#34;#AUDIO-PLAYBACK-Channel-Server-&amp;#x2192;-Client&#34; class=&#34;headerlink&#34; title=&#34;AUDIO_PLAYBACK Channel (Server &amp;#x2192; Client)&#34;&gt;&lt;/a&gt;AUDIO_PLAYBACK Channel (Server &amp;#x2192; Client)&lt;/h2&gt;&lt;p&gt;&lt;code&gt;AUDIO_PLAYBACK_DVC&lt;/code&gt; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC;&amp;#xB97C; &amp;#xC7AC;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1;&amp;#xC758; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Initialization Sequence&lt;/strong&gt; - &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xBC84;&amp;#xC804; &amp;#xBC0F; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://www.notion.so/16b2c1acde034f6cac0caf42b6ca6e97&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Data Transfer Sequence&lt;/strong&gt; - &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7AC;&amp;#xC0DD;&amp;#xD560; &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Wave &amp;#xBC0F; WaveInfo PDU&amp;#xC5D0;&amp;#xB294; &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD50;&amp;#xD658;&amp;#xB418;&amp;#xB294; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b&#34;&gt;MS-RDPEA&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD3EC;&amp;#xB9F7; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74;(&amp;#xC989;, Wave &amp;#xB610;&amp;#xB294; WaveInfo PDU&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC640; &amp;#xB2E4;&amp;#xB974;&amp;#xBA74;) &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC0C8; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in mstscax!CRdpAudioController::OnNewFormat&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)new_format_index &amp;gt;= &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;formatArray_size )&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD3EC;&amp;#xB9F7; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xB418;&amp;#xBA74; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;OnNewFormat()&lt;/code&gt;  &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70; &amp;#xC778;&amp;#xC99D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xAD00;&amp;#xB828; &amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xC758;&amp;#xC0AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in mstscax!CRdpAudioController::OnWaveData&lt;/span&gt;
last_format_index = &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;last_format_index;
format_index_from_pdu = *((_WORD *)pdu + &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;); &lt;span class=&#34;hljs-comment&#34;&gt;//pdu is controlled by the server&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( last_format_index != format_index_from_pdu )
{
    CRdpAudioController::OnNewFormat(&lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;, (__int64 *)format_index_from_pdu); &lt;span class=&#34;hljs-comment&#34;&gt;// this is where the bound check is being made&lt;/span&gt;
                                                                              &lt;span class=&#34;hljs-comment&#34;&gt;// but only if the format index is different than the last index&lt;/span&gt;
    last_format_index = *((&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)pdu + &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;last_format_index = last_format_index;
}
formats_array = (AUDIO_FORMAT **)&lt;span class=&#34;hljs-keyword&#34;&gt;this&lt;/span&gt;-&amp;gt;formatArray;
current_format = formats_array[last_format_index]-&amp;gt;wFormatTag; &lt;span class=&#34;hljs-comment&#34;&gt;// crashes here&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &lt;code&gt;0x1A&lt;/code&gt; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC758; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7; &lt;code&gt;0x5&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; Wave2 PDU&amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0B8; &amp;#xAC83;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB514;&amp;#xCF54;&amp;#xB354;(formats &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7; &amp;#xD56D;&amp;#xBAA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5ED;&amp;#xCC38;&amp;#xC870;)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xBA74;&amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C8; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xD568;&amp;#xC218; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;0x2&lt;/code&gt; &amp;#xD3EC;&amp;#xB9F7;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774;&amp;#xC804; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xC0C8; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xD3EC;&amp;#xB9F7; &lt;code&gt;0x5&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; Wave2 PDU&amp;#xB97C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; 2-format array &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xC12F; &amp;#xBC88;&amp;#xC9F8; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC77D;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294; out-of-bound read&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xCD94;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xC7AC;&amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xB4A4; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098; &amp;#xC77D;&amp;#xAC8C; &amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB294; &amp;#xB2E4;&amp;#xC911; &amp;#xC778;&amp;#xD48B; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AUDIO-INPUT-Channel-Client-&amp;#x2192;-Server&#34;&gt;&lt;a href=&#34;#AUDIO-INPUT-Channel-Client-&amp;#x2192;-Server&#34; class=&#34;headerlink&#34; title=&#34;AUDIO_INPUT Channel (Client &amp;#x2192; Server)&#34;&gt;&lt;/a&gt;AUDIO_INPUT Channel (Client &amp;#x2192; Server)&lt;/h2&gt;&lt;p&gt;&lt;code&gt;AUDIO_INPUT&lt;/code&gt; &amp;#xAC00;&amp;#xC0C1; &amp;#xCC44;&amp;#xB110;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xB514;&amp;#xC624; &amp;#xC785;&amp;#xB825; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;audiodg.exe&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;AUDIO_PLAYBACK_DVC&lt;/code&gt; &amp;#xCC44;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; &amp;#xBC30;&amp;#xC5F4;&amp;#xC744; &amp;#xAD50;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/&#34;&gt;MS-RDPEAI&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB294; command, &amp;#xD3EC;&amp;#xB9F7; &amp;#xC218; &amp;#xBC0F; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; 9 byte &amp;#xD5E4;&amp;#xB354;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xAC01;&amp;#xAC01; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;(&amp;#xCD94;&amp;#xAC00; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD544;&amp;#xB4DC; &amp;#xD3EC;&amp;#xD568;) &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xBC30;&amp;#xC5F4;&amp;#xC774; &amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xCD9C;&amp;#xCC98;: [&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/&#34;&gt;MS-RDPEAI&lt;/a&gt;]&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6B4;&amp;#xB4DC; &amp;#xD3EC;&amp;#xB9F7; PDU&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;code&gt;rdpendp.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 9 bytes &amp;#xC774;&amp;#xC0C1;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xD328;&amp;#xD0B7; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in rdpendp!CAudioInputHandler::OnFormatsReceived&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( size &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt; )
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  }
  &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  size_from_msg = *(_DWORD *)(data + &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;);
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( size_from_msg &amp;gt; size )
  {
    &lt;span class=&#34;hljs-comment&#34;&gt;// ...&lt;/span&gt;
  }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xC778; 9&amp;#xB97C; &amp;#xBE7C;&amp;#xACE0; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xD3EC;&amp;#xB9F7; &amp;#xC218;&amp;#xB97C; &amp;#xC77D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; interger underflow&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC704; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xC5B8;&amp;#xB354;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD328;&amp;#xD0B7; &amp;#xB05D; &amp;#xC774;&amp;#xD6C4;&amp;#xBD80;&amp;#xD130; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// in rdpendp!CAudioInputHandler::OnFormatsReceived&lt;/span&gt;
underflowed_size = size_from_pdu - &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;;
format_definition_offset = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)(pdu + &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;);
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( num_formats )
{
    &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; ( underflowed_size &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;0x12&lt;/span&gt; )
    {
        format_definition_size = format_definition_offset[&lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;];
        total_format_size = format_definition_size + &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( underflowed_size &amp;lt; (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64)(format_definition_size + &lt;span class=&#34;hljs-number&#34;&gt;18&lt;/span&gt;) )
            &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;
        (*class_fomats_array)[format_index] = (struct SNDFORMATITEM *)&lt;span class=&#34;hljs-keyword&#34;&gt;operator&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt;[](total_format_size);
        local_format = (*class_fomats_array)[format_index];
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !local_format )
        {
            status = E_OUTOFMEMORY;
            &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; CLEAN_AND_RETURN;
        }
        memcpy_0(local_format, format_definition_offset, total_format_size);
        format_definition_offset = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int16 *)((&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)format_definition_offset + total_format_size);
        underflowed_size -= total_format_size;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( ++format_index &amp;gt;= num_formats )
            &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; LABEL_50;
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; INVALID_ARG_EXIT;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;audiodg&lt;/code&gt; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; DynamoRIO &amp;#xC5F0;&amp;#xACB0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC774; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Summary&#34;&gt;&lt;a href=&#34;#Summary&#34; class=&#34;headerlink&#34; title=&#34;Summary&#34;&gt;&lt;/a&gt;Summary&lt;/h2&gt;&lt;p&gt;&amp;#xC774; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC778; Windows&amp;#xC758; RDP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD37C;&amp;#xC9D5; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB;&amp;#xC9F8;, &amp;#xC6D0;&amp;#xB798; &amp;#xBAA9;&amp;#xD45C;(&amp;#xC608;: RCE)&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xC989; &amp;#xC798; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC600;&amp;#xB358; &amp;#xAC83;&amp;#xACFC; &amp;#xAC1C;&amp;#xC120;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xC810;&amp;#xC744; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xAC00; &amp;#xACFC;&amp;#xAC70; &amp;#xACBD;&amp;#xD5D8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC30;&amp;#xC6B0;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB458;&amp;#xC9F8;, &amp;#xD37C;&amp;#xC9D5; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xAD6C;&amp;#xD560; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xBAA9;&amp;#xD45C;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RDP&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xAE30;&amp;#xAC00; &amp;#xB192;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xACFC; &amp;#xACB0;&amp;#xD569;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC88B;&amp;#xC740; &amp;#xD45C;&amp;#xC801;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0;&amp;#xB85C;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB9CE;&amp;#xC740; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC;&amp;#xC57C; &amp;#xD568;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2022/02/13/l0ch/rdp_fuzzing2/Untitled%208.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;&amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xC5F0;&amp;#xACB0; RDP &amp;#xC11C;&amp;#xBC84;. &amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://www.shodan.io/search?query=port%3A%223389%22&#34;&gt;shodan.io&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Microsoft&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; &amp;#xBA87; &amp;#xB144; &amp;#xB3D9;&amp;#xC548; &amp;#xC81C;&amp;#xD488; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; RDP &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC9C0;&amp;#xC2DD;&amp;#xACFC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD5A5;&amp;#xD6C4; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB97C; &amp;#xCD94;&amp;#xC9C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAD6C;&amp;#xD560; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC758; &amp;#xC608;&amp;#xB85C;&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xC131;&amp;#xB2A5; &amp;#xAC1C;&amp;#xC120;, &amp;#xD37C;&amp;#xC9D5; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xB2E4;&amp;#xB978; &amp;#xCC44;&amp;#xB110;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;, &amp;#xC5D0;&amp;#xBBAC;&amp;#xB808;&amp;#xC774;&amp;#xD130; &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800; &amp;#xC0AC;&amp;#xC6A9; &amp;#xB610;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC218;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5EC;&amp;#xB7EC; RPC &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xD37C;&amp;#xC9D5; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C; &amp;#xAE30;&amp;#xB300;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2022/02/13/l0ch/rdp_fuzzing2/Untitled%205.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2022/02/13/l0ch/rdp_fuzzing2/">

  <title>[Translation] Fuzzing RDP: Holding the Stick at Both Ends (2) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2022-02-13 18:00" pubdate>
      2022 2 13 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      82
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Fuzzing RDP: Holding the Stick at Both Ends (2)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC6D0;&#xBB38; &#xB9C1;&#xD06C; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends">https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends</a></p>
<p>&#xC774;&#xC804; &#xAE00; &#xBC14;&#xB85C;&#xAC00;&#xAE30; :  <a href="https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/">[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)</a></p>
<hr>
<h1 id="Technical-Details-The-Challenges-and-How-to-Overcome-Them-2"><a href="#Technical-Details-The-Challenges-and-How-to-Overcome-Them-2" class="headerlink" title="[Technical Details: The Challenges and How to Overcome Them - 2]"></a>[Technical Details: The Challenges and How to Overcome Them - 2]</h1><h2 id="Statefulness"><a href="#Statefulness" class="headerlink" title="Statefulness"></a>Statefulness</h2><p>&#xCCAB; &#xBC88;&#xC9F8; &#xCC44;&#xB110;&#xC744; &#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21;&#xC5D0;&#xC11C; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0; &#xB450; &#xAC1C;&#xAC00; &#xAC10;&#xC9C0;&#xB418;&#xC790;&#xB9C8;&#xC790; &#xC5F0;&#xACB0;&#xC774; &#xBC14;&#xB85C; &#xC885;&#xB8CC;&#xB418;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5D0;&#xC774;&#xC804;&#xD2B8; &#xB85C;&#xC9C1;&#xC5D0; &#xBA87; &#xAC00;&#xC9C0; <strong>protocol grammer</strong> &#xC2DC;&#xD589;&#xC744; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xD5C8;&#xC6A9;&#xB41C; &#xC778;&#xD48B; &#xACF5;&#xAC04;&#xC744; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xAD6C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBA54;&#xC2DC;&#xC9C0; &#xD06C;&#xAE30; &#xC81C;&#xD55C;<ul>
<li>&#xCD5C;&#xB300;&#xAC12; &#xBC0F; &#xCD5C;&#xC18C;&#xAC12;</li>
<li>&#xB098;&#xB20C; &#xC218; &#xC788;&#xC74C;(&#xC608;: &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0; 4byte &#xC694;&#xC18C;&#xC758; &#xAC00;&#xBCC0; &#xAE38;&#xC774; &#xBC30;&#xC5F4;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xACBD;&#xC6B0; 4&#xB85C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC5B4;&#xC57C; &#xD568;)</li>
</ul>
</li>
<li>&#xAC12; &#xC81C;&#xD55C;<ul>
<li>&#xD2B9;&#xC815; &#xAC12;&#xB9CC; &#xD5C8;&#xC6A9;</li>
<li>&#xCD5C;&#xC18C;&#xAC12;&#xACFC; &#xCD5C;&#xB300;&#xAC12;</li>
<li>PDU &#xC0AC;&#xC774;&#xC988;&#xC640; &#xAC19;&#xC740; &#xAC12;</li>
<li>&#xAC12;&#xC740; &#xAC01; PDU&#xB9C8;&#xB2E4; &#xB2EC;&#xB77C;&#xC57C; &#xD568;</li>
</ul>
</li>
</ul>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpbcgr/5073f4ed-1e93-45e1-b039-6e30c385867c">MS&#xC758; RDP &#xBC0F; &#xD655;&#xC7A5; &#xBB38;&#xC11C;</a> &#xC5D0;&#xC11C; RDP &#xBB38;&#xBC95; &#xC77C;&#xBD80;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xACE0; &#xAD00;&#xB828; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1; &#xD55C; &#xB4A4; &#xB098;&#xBA38;&#xC9C0;&#xB294; &#xC2E4;&#xD328;&#xD55C; &#xD0C0;&#xAC9F; &#xC2E4;&#xD589;&#xC744; &#xD2B8;&#xB808;&#xC774;&#xC2F1;&#xD574; &#xCD94;&#xCD9C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xD574;&#xB2F9; &#xB85C;&#xC9C1;&#xC740; &#xC9C0;&#xC6D0;&#xB418;&#xB294; <code>msgType</code> &#xC911; &#xD558;&#xB098;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xB9CC; &#xD5C8;&#xC6A9;&#xD558;&#xACE0; &#xADF8; &#xB4A4; PDU &#xD06C;&#xAE30;&#xC640; &#xACE0;&#xC720; &#xC2DD;&#xBCC4;&#xC790;&#xAC00; &#xC640;&#xC57C; &#xD558;&#xBA70; &#xCD1D; &#xD06C;&#xAE30;&#xB294; 22~122, &#xB098;&#xBA38;&#xC9C0;&#xB294; 2 modulo 4&#xB97C; &#xB0A8;&#xAE30;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xB9CC; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC6D0;&#xD558;&#xB294; &#xB300;&#xB85C; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xB294; mutation engine&#xC758; &#xC131;&#xB2A5;&#xC744; &#xC81C;&#xD55C;&#xD558;&#xBA74; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; mutation&#xC744; &#xB193;&#xCE60; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC5D0; &#xC5F0;&#xACB0;&#xC774; &#xB108;&#xBB34; &#xC790;&#xC8FC; &#xB2EB;&#xD788;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD558;&#xBA74;&#xC11C; &#xAC00;&#xB2A5;&#xD55C; &#xD55C; &#xC801;&#xC740; &#xD69F;&#xC218;&#xB85C; &#xC2DC;&#xD589;&#xD558;&#xB824;&#xACE0; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610; &#xB2E4;&#xB978; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD560; &#xB54C; &#xC704; &#xBC29;&#xBC95;&#xC774; &#xC720;&#xC77C;&#xD55C; &#xC120;&#xD0DD;&#xC9C0;&#xB294; &#xC544;&#xB2C8;&#xB77C;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD2B9;&#xC815; &#xCC44;&#xB110;(GFX)&#xC758; &#xACBD;&#xC6B0;, &#xD37C;&#xC9D5;&#xD558;&#xB294; &#xD0C0;&#xAC9F;&#xC744; &#xD328;&#xCE58;&#xD574; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0; &#xC138;&#xD2B8;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB3C4; &#xC5F0;&#xACB0;&#xC744; &#xB2EB;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC640; &#xAC19;&#xC774; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xACC4;&#xC18D; &#xD37C;&#xC9D5;&#xD558;&#xBA70; &#xC5F0;&#xACB0;&#xC744; &#xC5F4;&#xC5B4;&#xB458; &#xC218; &#xC788;&#xC5C8;&#xC73C;&#xB098; &#xD328;&#xCE58; &#xC774;&#xC804; &#xC6D0;&#xB798; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC7AC;&#xD604;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xACAC;&#xD560; &#xBB38;&#xC81C;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC6D0;&#xB798; &#xAE30;&#xB2A5;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xBA74;&#xC11C; &#xCDA9;&#xBD84;&#xD55C; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xD655;&#xBCF4;&#xD558;&#xB294; &#xAC83;&#xACFC; mutation engine&#xC758; &#xC131;&#xB2A5; &#xC0AC;&#xC774; &#xADE0;&#xD615;&#xC758; &#xD544;&#xC694;&#xC131;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Multi-input-Fuzzing"><a href="#Multi-input-Fuzzing" class="headerlink" title="Multi-input Fuzzing"></a>Multi-input Fuzzing</h2><p>&#xC6B0;&#xB9AC;&#xAC00; &#xBC1C;&#xACAC;&#xD55C; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBC84;&#xADF8;&#xAC00; &#xC801;&#xC5B4;&#xB3C4; &#xB450; &#xAC1C;&#xC758; &#xBA54;&#xC2DC;&#xC9C0;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xAC83;&#xCC98;&#xB7FC; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xB85C;&#xC9C1;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB418;&#xB294; &#xBC84;&#xADF8;&#xB294; &#xB2E8;&#xC77C; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xC544;&#xB2CC; &#xBA54;&#xC2DC;&#xC9C0; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0; &#xC758;&#xD574; &#xBC1C;&#xACAC;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xC911; &#xC778;&#xD48B; &#xD37C;&#xC9D5;&#xC744; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0C8; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; &#xC2DC;&#xC791;&#xACFC; &#xADF8; &#xC720;&#xD615;&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xB294; fuzzer dictionary&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC73C;&#xBA70; &#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xB294; &#xD574;&#xB2F9; dictionary word&#xC5D0; &#xB530;&#xB77C; &#xC778;&#xD48B;&#xC744; &#xC5EC;&#xB7EC; PDU&#xB85C; &#xBD84;&#xD560;&#xD558;&#xACE0; &#xCC28;&#xB840;&#xB85C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xB2E4;&#xC911; &#xC778;&#xD48B;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB098;&#xD0C0;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">___cmd07 &lt;<span class="hljs-number">1</span>st PDU data&gt;
___cmd02 &lt;<span class="hljs-number">2</span>nd PDU data&gt;
___cmd03 &lt;<span class="hljs-number">3</span>rd PDU data&gt;</code></pre>
<p>&#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xB294; <code>msgType</code>&#xC774; 7, 2, 3&#xC778; 3&#xAC1C;&#xC758; &#xBA54;&#xC2DC;&#xC9C0;&#xC640; &#xAC01;&#xAC01;&#xC758; &#xB0B4;&#xC6A9;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD37C;&#xC800;&#xAC00; &#xC0DD;&#xC131;&#xD55C; &#xC778;&#xD48B;&#xACFC; &#xC774;&#xB4E4;&#xC774; &#xD2B8;&#xB9AC;&#xAC70;&#xD55C; &#xCF54;&#xB4DC; &#xBC94;&#xC704;&#xC758; &#xC77C;&#xB300;&#xC77C; &#xB300;&#xC751;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC2DC;&#xD000;&#xC2A4;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC2DD;&#xBCC4;&#xD558;&#xB294; &#xB450; &#xBC88;&#xC9F8; &#xB9C8;&#xCEE4;&#xB97C; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. WinAFL&#xC774; &#xC2DC;&#xD000;&#xC2A4;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xB9C8;&#xCEE4;&#xB97C; &#xC2DD;&#xBCC4;&#xD558;&#xBA74; &#xD638;&#xCD9C;&#xC774; &#xC885;&#xB8CC;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xC54C;&#xACE0; &#xC8FC;&#xAE30;&#xB97C; &#xB9C8;&#xBB34;&#xB9AC;&#xD55C; &#xB4A4; &#xB2E4;&#xC74C; &#xC778;&#xD48B;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><em>&#xB2E4;&#xC911; &#xC778;&#xD48B; &#xD37C;&#xC9D5;&#xC774; &#xACB0;&#xC815;&#xC801;&#xC778; &#xACB0;&#xACFC;&#xB8F0; &#xB0C8;&#xACE0;, &#xB610;&#xD55C; &#xAC01; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; PDU&#xC758; &#xC218;&#xB97C; &#xC81C;&#xD55C;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC74C;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD37C;&#xC800;&#xAC00; &#xB2E4;&#xB978; &#xCF54;&#xB4DC; &#xC2DC;&#xD000;&#xC2A4;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xC785;&#xB825;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xB3D9;&#xC77C;&#xD55C; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; 100&#xBC88; &#xBC18;&#xBCF5;&#xD558;&#xBA74; &#xD55C; &#xBC88; &#xBCF4;&#xB0B4;&#xB294; &#xAC83;&#xACFC; &#xB2E4;&#xB978; &#xCF54;&#xB4DC; &#xC2DC;&#xD000;&#xC2A4;&#xAC00; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</em></p>
<h2 id="Reproduction-Issues"><a href="#Reproduction-Issues" class="headerlink" title="Reproduction Issues"></a>Reproduction Issues</h2><p>&#xC57D; 1&#xC8FC;&#xC77C;&#xAC04;&#xC758; &#xD37C;&#xC9D5; &#xD6C4; &#xCCAB; &#xBC88;&#xC9F8; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xB098;&#xD0C0;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xB3D9;&#xC77C;&#xD55C; &#xC785;&#xB825;&#xC744; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C;&#xC5D0;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xC7AC;&#xD604;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xB294; &#xAF64; &#xC790;&#xC8FC; &#xBC1C;&#xC0DD;&#xD588;&#xC73C;&#xBA70; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xC0C1;&#xD0DC; &#xC800;&#xC7A5; &#xD2B9;&#xC131; &#xB54C;&#xBB38;&#xC778; &#xAC83;&#xC73C;&#xB85C; &#xC608;&#xCE21;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xB9D0;&#xD574;, &#xD558;&#xB098;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD2B9;&#xC815; &#xC0C1;&#xD0DC;&#xB85C; &#xB9CC;&#xB4E4;&#xBA74; &#xD6C4;&#xC18D; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0AC; &#xB54C; &#xC601;&#xD5A5;&#xC744; &#xC900;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC7AC;&#xD604;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xAC10;&#xC9C0;&#xB420; &#xB54C;&#xB9C8;&#xB2E4; &#xB300;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xB364;&#xD504;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB3C4;&#xB85D; WinAFL&#xC744; &#xC218;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Crash-Analysis-Automation"><a href="#Crash-Analysis-Automation" class="headerlink" title="Crash Analysis Automation"></a>Crash Analysis Automation</h2><p>&#xD06C;&#xB798;&#xC2DC; &#xBC1C;&#xC0DD; &#xC2DC; &#xB364;&#xD504;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD588;&#xC9C0;&#xB9CC; &#xB610; &#xB2E4;&#xB978; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xD55C;&#xBC88; &#xBC1C;&#xACAC;&#xB418;&#xBA74; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB9E4;&#xC6B0; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; WinAFL&#xC740; &#xB3D9;&#xC77C;&#xD55C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xAC10;&#xC9C0;&#xD558;&#xACE0; &#x201C;&#xACE0;&#xC720;&#xD55C; &#xD06C;&#xB798;&#xC2DC;&#x201D;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC54C;&#xB9AC;&#xC9C0;&#xB9CC; &#xB2E4;&#xC911; &#xBA54;&#xC2DC;&#xC9C0; &#xD37C;&#xC9D5;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC774;&#xB97C; &#xAC10;&#xC9C0;&#xD558;&#xAE30;&#xAC00; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xB098;&#xC758; &#xBA54;&#xC2DC;&#xC9C0;&#xB85C; &#xC778;&#xD574; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xD37C;&#xC800;&#xB294; &#xC774;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xBAA8;&#xB4E0; &#xBA54;&#xC2DC;&#xC9C0; &#xC138;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01; &#xBA54;&#xC2DC;&#xC9C0; &#xC138;&#xD2B8;&#xB294; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xACE0; &#xBA54;&#xC2DC;&#xC9C0;&#xB9C8;&#xB2E4; &#xCC98;&#xB9AC; &#xBC29;&#xC2DD;&#xC774; &#xB2E4;&#xB974;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB2E4;&#xB978; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xC758; &#xBE44;&#xD2B8;&#xB9F5;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; WinAFL&#xC740; &#xB9E4;&#xBC88; &#xACE0;&#xC720;&#xD55C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBCF4;&#xACE0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB450; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; &#xCDA9;&#xB3CC; &#xBD84;&#xC11D;&#xC744; &#xC790;&#xB3D9;&#xD654;&#xD574;&#xC57C;&#xB9CC; &#xD588;&#xB294;&#xB370; &#xCCAB;&#xBC88;&#xC9F8;&#xB294; &#xAC01; &#xCDA9;&#xB3CC;&#xC744; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xD6A8;&#xC728;&#xC801;&#xC778; &#xC791;&#xC5C5;&#xC774;&#xBA70; &#xB458;&#xC9F8;&#xB85C;&#xB294; &#xB514;&#xC2A4;&#xD06C;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC; &#xB364;&#xD504;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xCC44;&#xC6CC;&#xC9C4;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC2A4;&#xD0DD;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xB294; WinDBG &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#xC8FC;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xC2A4;&#xD0DD;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xC2A4;&#xD0DD;&#xB9CC; &#xC720;&#xC9C0;&#xD558;&#xB294; PowerShell &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Long-Startup-Time"><a href="#Long-Startup-Time" class="headerlink" title="Long Startup Time"></a>Long Startup Time</h2><p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5; &#xC124;&#xC815;&#xC5D0;&#xC11C;&#xB294; &#xD37C;&#xC800;&#xC5D0; &#xC758;&#xD574; &#xD0C0;&#xAC9F;(<code>mstsc.exe</code>)&#xC774; &#xC0DD;&#xC131;&#xB41C; &#xC21C;&#xAC04;&#xBD80;&#xD130; &#xC5F0;&#xACB0;&#xC774; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xCCAB; &#xBC88;&#xC9F8; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xB294; &#xC21C;&#xAC04;&#xAE4C;&#xC9C0; 10&#xCD08; &#xC774;&#xC0C1; &#xAC78;&#xB824; &#xD0C0;&#xAC9F;&#xC744; &#xB2E4;&#xC2DC; &#xC2DC;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xAC00;&#xB2A5;&#xD55C; &#xD55C; &#xB9CE;&#xC740; iteration&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. AFL-Fuzz&#xC758; <code>-fuzz_iterations</code> &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xB9CE;&#xC740; iteration&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD574;&#xACB0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Multi-channel-Fuzzing"><a href="#Multi-channel-Fuzzing" class="headerlink" title="Multi-channel Fuzzing"></a>Multi-channel Fuzzing</h2><p>&#xB2E4;&#xC911; &#xC778;&#xD48B; &#xD37C;&#xC9D5;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC77C;&#xBD80; &#xB85C;&#xC9C1;&#xC5D0;&#xB294; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xCC44;&#xB110;&#xC5D0;&#xC11C;&#xC758; &#xBA54;&#xC2DC;&#xC9C0; &#xC2DC;&#xD000;&#xC2A4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242">&#xBB38;&#xC11C;</a>&#xC5D0; &#xC124;&#xBA85;&#xB41C; &#xB300;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xCE74;&#xBA54;&#xB77C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xB0B4;&#xB294; &#xAC83;&#xC740; &#xC5EC;&#xB7EC; &#xCC44;&#xB110;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpecam/92af6790-b79c-4813-9c07-7c545bed0242">MS-RDPECAM</a>]</em></p>
</blockquote>
<p>&#xB530;&#xB77C;&#xC11C; &#xCE74;&#xBA54;&#xB77C; &#xC785;&#xB825;&#xC744; &#xC804;&#xC1A1;&#xD558;&#xC5EC; &#xC11C;&#xBC84;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xB824;&#xBA74; &#xCD5C;&#xC18C; &#xB450; &#xAC1C;&#xC758; &#xB2E4;&#xB978; &#xCC44;&#xB110;&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xD574;&#xC57C; &#xD588;&#xC73C;&#xBA70; fuzzer dictionary&#xAC00; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xC804;&#xC1A1;&#xB420; &#xCC44;&#xB110;&#xC744; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Locating-relevant-code"><a href="#Locating-relevant-code" class="headerlink" title="Locating relevant code"></a>Locating relevant code</h2><p>RDP&#xB294; &#xBCF5;&#xC7A1;&#xD558;&#xACE0; &#xB2E4;&#xC591;&#xD55C; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD37C;&#xC9D5;&#xD574;&#xC57C; &#xD558;&#xB294; &#xD0C0;&#xAC9F; &#xD568;&#xC218;&#xB97C; &#xCC3E;&#xB294; &#xAC83;&#xC870;&#xCC28; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">PS C:\&gt; gci -Include *.exe, *.dll, *.sys -Recurse C:\Windows\ -ErrorAction SilentlyContinue | ?{[System.Diagnostics.FileVersionInfo]::GetVersionInfo($_).FileDescription -match <span class="hljs-string">&quot;RDP|Remote Desktop&quot;</span>} | Measure-Object | select count

Count
-----
  <span class="hljs-number">191</span></code></pre>
<p>&#xC774;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; &#xC2EC;&#xBCFC;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xB97C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Windows &#xBC84;&#xC804;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; PDB&#xB97C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xCD94;&#xCD9C;&#xD55C; &#xB2E4;&#xC74C; &#xD30C;&#xC77C;&#xC5D0; &#xB364;&#xD504;(exe/sys/dll&#xC5D0; &#xB2E4;&#xC2DC; &#xC5F0;&#xACB0;)&#xD558;&#xC5EC; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xAC80;&#xC0C9;&#xD558;&#xACE0; &#xD604;&#xC7AC; &#xD0C0;&#xAC9F; &#xCC44;&#xB110;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xD568;&#xC218;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC70;&#xC758; &#xBAA8;&#xB4E0; dynamic channel &#xC218;&#xC2E0; &#xAE30;&#xB2A5;&#xC774; <code>C&lt;class-name&gt;::OnDataReceived</code> &#xD328;&#xD134;&#xACFC; &#xC77C;&#xCE58;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7EC;&#xD55C; &#xD568;&#xC218; &#xBAA9;&#xB85D;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0; &#xC6B0;&#xB9AC;&#xAC00; &#xBAA9;&#xD45C;&#xB85C; &#xD558;&#xB294; &#xCC44;&#xB110;&#xACFC; &#xAD00;&#xB828;&#xC774; &#xC788;&#xB294; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Bug-Case-Studies"><a href="#Bug-Case-Studies" class="headerlink" title="Bug Case Studies"></a><strong>Bug Case Studies</strong></h1><p>&#xC774; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xD55C; &#xB450; &#xAC00;&#xC9C0; &#xBC84;&#xADF8;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xC220;&#xC801;&#xC778; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xB97C; &#xACF5;&#xC720;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="AUDIO-PLAYBACK-Channel-Server-&#x2192;-Client"><a href="#AUDIO-PLAYBACK-Channel-Server-&#x2192;-Client" class="headerlink" title="AUDIO_PLAYBACK Channel (Server &#x2192; Client)"></a>AUDIO_PLAYBACK Channel (Server &#x2192; Client)</h2><p><code>AUDIO_PLAYBACK_DVC</code> &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xB098;&#xC624;&#xB294; &#xC0AC;&#xC6B4;&#xB4DC;&#xB97C; &#xC7AC;&#xC0DD;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC815;&#xC0C1;&#xC801;&#xC778; &#xD750;&#xB984;&#xC740; &#xCD08;&#xAE30;&#xD654;&#xC640; &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1;&#xC758; &#xB450; &#xAC00;&#xC9C0; &#xC2DC;&#xD000;&#xC2A4;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xCD08;&#xAE30;&#xD654; &#xC2DC;&#xD000;&#xC2A4;&#xB294; &#xCC98;&#xC74C;&#xC5D0; &#xD55C; &#xBC88; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xADF8; &#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xC5EC;&#xB7EC; &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1; &#xC2DC;&#xD000;&#xC2A4;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>Initialization Sequence</strong> - &#xB370;&#xC774;&#xD130; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xBC84;&#xC804; &#xBC0F; &#xD3EC;&#xB9F7;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%201.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.notion.so/16b2c1acde034f6cac0caf42b6ca6e97">MS-RDPEA</a>]</em></p>
</blockquote>
<ul>
<li><strong>Data Transfer Sequence</strong> - &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC7AC;&#xC0DD;&#xD560; &#xC11C;&#xBC84;&#xC758; &#xC0AC;&#xC6B4;&#xB4DC; &#xB370;&#xC774;&#xD130;</li>
</ul>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%202.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b">MS-RDPEA</a>]</em></p>
</blockquote>
<p>Wave &#xBC0F; WaveInfo PDU&#xC5D0;&#xB294; &#xC804;&#xC1A1;&#xB41C; &#xB370;&#xC774;&#xD130;&#xC758; &#xD3EC;&#xB9F7;&#xC744; &#xACB0;&#xC815;&#xD558;&#xB294; &#xCD08;&#xAE30;&#xD654; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0;&#xC11C; &#xAD50;&#xD658;&#xB418;&#xB294; &#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xB371;&#xC2A4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%203.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%204.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b">MS-RDPEA</a>]</em></p>
</blockquote>
<p>&#xD3EC;&#xB9F7; &#xBCC0;&#xACBD;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74;(&#xC989;, Wave &#xB610;&#xB294; WaveInfo PDU&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xC778;&#xB371;&#xC2A4;&#xAC00; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD55C; &#xC778;&#xB371;&#xC2A4;&#xC640; &#xB2E4;&#xB974;&#xBA74;) &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC0C8; &#xC778;&#xB371;&#xC2A4;&#xAC00; &#xC720;&#xD6A8;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-comment">// in mstscax!CRdpAudioController::OnNewFormat</span>
<span class="hljs-keyword">if</span> ( (<span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">int</span>)new_format_index &gt;= <span class="hljs-keyword">this</span>-&gt;formatArray_size )</code></pre>
<p>&#xADF8;&#xB7EC;&#xB098; &#xD3EC;&#xB9F7; &#xC778;&#xB371;&#xC2A4;&#xAC00; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xC720;&#xC9C0;&#xB418;&#xBA74; &#xC774; &#xACFC;&#xC815;&#xC744; &#xAC74;&#xB108;&#xB6F0;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; <code>OnNewFormat()</code>  &#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; &#xC778;&#xC99D; &#xCF54;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; &#xAD00;&#xB828; &#xBD80;&#xBD84;&#xC758; &#xC758;&#xC0AC; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-comment">// in mstscax!CRdpAudioController::OnWaveData</span>
last_format_index = <span class="hljs-keyword">this</span>-&gt;last_format_index;
format_index_from_pdu = *((_WORD *)pdu + <span class="hljs-number">3</span>); <span class="hljs-comment">//pdu is controlled by the server</span>
<span class="hljs-keyword">if</span> ( last_format_index != format_index_from_pdu )
{
    CRdpAudioController::OnNewFormat(<span class="hljs-keyword">this</span>, (__int64 *)format_index_from_pdu); <span class="hljs-comment">// this is where the bound check is being made</span>
                                                                              <span class="hljs-comment">// but only if the format index is different than the last index</span>
    last_format_index = *((<span class="hljs-keyword">unsigned</span> __int16 *)pdu + <span class="hljs-number">3</span>);
    <span class="hljs-keyword">this</span>-&gt;last_format_index = last_format_index;
}
formats_array = (AUDIO_FORMAT **)<span class="hljs-keyword">this</span>-&gt;formatArray;
current_format = formats_array[last_format_index]-&gt;wFormatTag; <span class="hljs-comment">// crashes here</span></code></pre>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC774; &#xBC84;&#xADF8;&#xB97C; &#xC720;&#xBC1C;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xD55C; &#xD750;&#xB984;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%205.png" srcset="/img/loading.gif" alt="Untitled"></p>
<ul>
<li>&#xC11C;&#xBC84;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0; <code>0x1A</code> &#xD3EC;&#xB9F7;&#xC758; &#xC11C;&#xBC84; &#xC624;&#xB514;&#xC624; &#xD3EC;&#xB9F7; PDU&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xC5EC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC774; &#xD06C;&#xAE30;&#xC758; &#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC744; &#xD560;&#xB2F9;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC11C;&#xBC84;&#xB294; &#xC0AC;&#xC6B4;&#xB4DC; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xB294; &#xBC30;&#xC5F4;&#xC5D0;&#xC11C; &#xD3EC;&#xB9F7; <code>0x5</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Wave2 PDU&#xB97C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.<ul>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC774; &#xD3EC;&#xB9F7;&#xC774; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xBCF4;&#xB0B8; &#xAC83;&#xACFC; &#xB3D9;&#xC77C;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB3D9;&#xC77C;&#xD558;&#xBA74; &#xB9C8;&#xC9C0;&#xB9C9; &#xB514;&#xCF54;&#xB354;(formats &#xBC30;&#xC5F4;&#xC758; &#xD3EC;&#xB9F7; &#xD56D;&#xBAA9;&#xC5D0;&#xC11C; &#xC5ED;&#xCC38;&#xC870;)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xB3D9;&#xC77C;&#xD558;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74;&#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC5D0;&#xC11C; &#xC0C8; &#xB514;&#xCF54;&#xB354; &#xD568;&#xC218; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xC11C;&#xBC84;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC11C;&#xBC84; &#xC624;&#xB514;&#xC624; &#xD3EC;&#xB9F7; PDU&#xB97C; &#xB2E4;&#xC2DC; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88;&#xC5D0;&#xB294; <code>0x2</code> &#xD3EC;&#xB9F7;&#xB9CC; &#xC0AC;&#xC6A9;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC774;&#xC804; &#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC744; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xC0C8; &#xD06C;&#xAE30;&#xB85C; &#xC0C8; &#xBC30;&#xC5F4;&#xC744; &#xD560;&#xB2F9;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC11C;&#xBC84;&#xB294; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB41C; &#xD3EC;&#xB9F7; <code>0x5</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xB2E4;&#xB978; Wave2 PDU&#xB97C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.<ul>
<li>&#xD3EC;&#xB9F7;&#xC774; &#xBCC0;&#xACBD;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBBC0;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; 2-format array &#xBC30;&#xC5F4;&#xC5D0;&#xC11C; &#xC5EC;&#xC12F; &#xBC88;&#xC9F8; &#xD3EC;&#xB9F7;&#xC744; &#xC77D;&#xC73C;&#xB824;&#xACE0; &#xD558;&#xB294; out-of-bound read&#xB97C; &#xC218;&#xD589;&#xD558;&#xACE0; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#xC774;&#xB97C; &#xD1B5;&#xD574; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xCD94;&#xAC00; &#xC11C;&#xBC84; &#xC624;&#xB514;&#xC624; &#xD3EC;&#xB9F7; PDU&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBC30;&#xC5F4;&#xC744; &#xC7AC;&#xD560;&#xB2F9;&#xD55C; &#xB4A4; &#xC774;&#xC804;&#xC5D0; &#xC0AC;&#xC6A9;&#xD588;&#xB358; &#xC798;&#xBABB;&#xB41C; &#xC778;&#xB371;&#xC2A4;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xC5EC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC758; &#xBC94;&#xC704;&#xB97C; &#xBC97;&#xC5B4;&#xB098; &#xC77D;&#xAC8C; &#xD558;&#xACE0; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBC84;&#xADF8;&#xB294; &#xB2E4;&#xC911; &#xC778;&#xD48B; &#xD37C;&#xC9D5;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="AUDIO-INPUT-Channel-Client-&#x2192;-Server"><a href="#AUDIO-INPUT-Channel-Client-&#x2192;-Server" class="headerlink" title="AUDIO_INPUT Channel (Client &#x2192; Server)"></a>AUDIO_INPUT Channel (Client &#x2192; Server)</h2><p><code>AUDIO_INPUT</code> &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xC0AC;&#xC6B4;&#xB4DC; &#xC785;&#xB825;&#xC744; &#xBCF4;&#xB0B4;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xC624;&#xB514;&#xC624; &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB294; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC758; <code>audiodg.exe</code> &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><code>AUDIO_PLAYBACK_DVC</code> &#xCC44;&#xB110;&#xC5D0;&#xC11C;&#xC640; &#xAC19;&#xC774; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84;&#xB294; &#xBA3C;&#xC800; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xC0AC;&#xC6B4;&#xB4DC; &#xD3EC;&#xB9F7; &#xBC30;&#xC5F4;&#xC744; &#xAD50;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%206.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/">MS-RDPEAI</a>]</em></p>
</blockquote>
<p>&#xC0AC;&#xC6B4;&#xB4DC; &#xD3EC;&#xB9F7; PDU&#xB294; command, &#xD3EC;&#xB9F7; &#xC218; &#xBC0F; &#xD328;&#xD0B7; &#xD06C;&#xAE30;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; 9 byte &#xD5E4;&#xB354;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xADF8; &#xB4A4;&#xC5D0; &#xAC01;&#xAC01; &#xAC00;&#xBCC0; &#xAE38;&#xC774;(&#xCD94;&#xAC00; &#xB370;&#xC774;&#xD130;&#xC758; &#xC120;&#xD0DD;&#xC801; &#xD544;&#xB4DC; &#xD3EC;&#xD568;) &#xD615;&#xC2DD;&#xC758; &#xBC30;&#xC5F4;&#xC774; &#xC635;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%207.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xCD9C;&#xCC98;: [<a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpeai/">MS-RDPEAI</a>]</em></p>
</blockquote>
<p>&#xC0AC;&#xC6B4;&#xB4DC; &#xD3EC;&#xB9F7; PDU&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB294; <code>rdpendp.dll</code>&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; &#xD328;&#xD0B7; &#xD06C;&#xAE30;&#xAC00; 9 bytes &#xC774;&#xC0C1;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD55C; &#xB2E4;&#xC74C; &#xD5E4;&#xB354;&#xB97C; &#xC77D;&#xACE0; &#xD5E4;&#xB354;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xD328;&#xD0B7; &#xD06C;&#xAE30;&#xBCF4;&#xB2E4; &#xD06C;&#xC9C0; &#xC54A;&#xC740;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-comment">// in rdpendp!CAudioInputHandler::OnFormatsReceived</span>
  <span class="hljs-keyword">if</span> ( size &lt; <span class="hljs-number">9</span> )
  {
    <span class="hljs-comment">// ...</span>
  }
  <span class="hljs-comment">// ...</span>
  size_from_msg = *(_DWORD *)(data + <span class="hljs-number">5</span>);
  <span class="hljs-keyword">if</span> ( size_from_msg &gt; size )
  {
    <span class="hljs-comment">// ...</span>
  }</code></pre>
<p>&#xB3D9;&#xC77C;&#xD55C; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xD5E4;&#xB354;&#xC5D0;&#xC11C; &#xC77D;&#xC740; &#xD06C;&#xAE30;&#xC778; 9&#xB97C; &#xBE7C;&#xACE0; &#xD5E4;&#xB354;&#xC5D0; &#xC9C0;&#xC815;&#xB41C; &#xD3EC;&#xB9F7; &#xC218;&#xB97C; &#xC77D;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD5E4;&#xB354;&#xC758; &#xD06C;&#xAE30;&#xB294; interger underflow&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xC704; &#xC5F0;&#xC0B0;&#xC758; &#xACB0;&#xACFC;&#xB85C; &#xC5B8;&#xB354;&#xD50C;&#xB85C;&#xC6B0;&#xB418;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD328;&#xD0B7; &#xB05D; &#xC774;&#xD6C4;&#xBD80;&#xD130; &#xD3EC;&#xB9F7;&#xC744; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-comment">// in rdpendp!CAudioInputHandler::OnFormatsReceived</span>
underflowed_size = size_from_pdu - <span class="hljs-number">9</span>;
format_definition_offset = (<span class="hljs-keyword">unsigned</span> __int16 *)(pdu + <span class="hljs-number">9</span>);
<span class="hljs-keyword">if</span> ( num_formats )
{
    <span class="hljs-keyword">while</span> ( underflowed_size &gt;= <span class="hljs-number">0x12</span> )
    {
        format_definition_size = format_definition_offset[<span class="hljs-number">8</span>];
        total_format_size = format_definition_size + <span class="hljs-number">18</span>;
        <span class="hljs-keyword">if</span> ( underflowed_size &lt; (<span class="hljs-keyword">unsigned</span> __int64)(format_definition_size + <span class="hljs-number">18</span>) )
            <span class="hljs-keyword">break</span>;
        (*class_fomats_array)[format_index] = (struct SNDFORMATITEM *)<span class="hljs-keyword">operator</span> <span class="hljs-keyword">new</span>[](total_format_size);
        local_format = (*class_fomats_array)[format_index];
        <span class="hljs-keyword">if</span> ( !local_format )
        {
            status = E_OUTOFMEMORY;
            <span class="hljs-keyword">goto</span> CLEAN_AND_RETURN;
        }
        memcpy_0(local_format, format_definition_offset, total_format_size);
        format_definition_offset = (<span class="hljs-keyword">unsigned</span> __int16 *)((<span class="hljs-keyword">char</span> *)format_definition_offset + total_format_size);
        underflowed_size -= total_format_size;
        <span class="hljs-keyword">if</span> ( ++format_index &gt;= num_formats )
            <span class="hljs-keyword">goto</span> LABEL_50;
    }
    <span class="hljs-keyword">goto</span> INVALID_ARG_EXIT;
}</code></pre>
<p>&#xC6B0;&#xB9AC;&#xB294; <code>audiodg</code> &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; DynamoRIO &#xC5F0;&#xACB0; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC774; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Summary"><a href="#Summary" class="headerlink" title="Summary"></a>Summary</h2><p>&#xC774; &#xBE14;&#xB85C;&#xADF8; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xD37C;&#xC9D5; &#xD0C0;&#xAC9F;&#xC778; Windows&#xC758; RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC704;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC18C;&#xAC1C;&#xD558;&#xACE0; &#xACFC;&#xC815;&#xC744; &#xACF5;&#xC720;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB;&#xC9F8;, &#xC6D0;&#xB798; &#xBAA9;&#xD45C;(&#xC608;: RCE)&#xC5D0; &#xB3C4;&#xB2EC;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xACBD;&#xC6B0;&#xC5D0;&#xB3C4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC790;&#xC2E0;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;, &#xC989; &#xC798; &#xC791;&#xB3D9;&#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xBCF4;&#xC600;&#xB358; &#xAC83;&#xACFC; &#xAC1C;&#xC120;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xC810;&#xC744; &#xBC18;&#xC601;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBCF4;&#xC548; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xAC00; &#xACFC;&#xAC70; &#xACBD;&#xD5D8;&#xC5D0;&#xC11C; &#xBC30;&#xC6B0;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB458;&#xC9F8;, &#xD37C;&#xC9D5; &#xD658;&#xACBD;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBCF5;&#xC7A1;&#xD55C; &#xACFC;&#xC815;&#xC77C; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xCD94;&#xAD6C;&#xD560; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB294; &#xBAA9;&#xD45C;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. RDP&#xB294; &#xB9CE;&#xC740; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC640; &#xB2E4;&#xC591;&#xD55C; &#xCF54;&#xB4DC; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB41C; &#xB9E4;&#xC6B0; &#xBCF5;&#xC7A1;&#xD55C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;. &#xC778;&#xAE30;&#xAC00; &#xB192;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xACFC; &#xACB0;&#xD569;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xC5D0;&#xAC8C; &#xC88B;&#xC740; &#xD45C;&#xC801;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBCF4;&#xC548; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xC11C; &#xBCF4;&#xC548;&#xC744; &#xAC15;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB9CE;&#xC740; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC5EC;&#xC57C; &#xD568;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2022/02/13/l0ch/rdp_fuzzing2/Untitled%208.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p><em>&#xC778;&#xD130;&#xB137; &#xC5F0;&#xACB0; RDP &#xC11C;&#xBC84;. &#xCD9C;&#xCC98; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.shodan.io/search?query=port%3A%223389%22">shodan.io</a></em></p>
</blockquote>
<p>Microsoft&#xB294; &#xCD5C;&#xADFC; &#xBA87; &#xB144; &#xB3D9;&#xC548; &#xC81C;&#xD488; &#xBCF4;&#xC548;&#xC5D0; &#xC0C1;&#xB2F9;&#xD55C; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC600;&#xC9C0;&#xB9CC; RDP &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC5D0; &#xB354; &#xB9CE;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5BB;&#xC740; &#xC9C0;&#xC2DD;&#xACFC; &#xC5EC;&#xAE30;&#xC5D0; &#xACF5;&#xC720;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xD5A5;&#xD6C4; &#xC5F0;&#xAD6C;&#xB97C; &#xCD94;&#xC9C4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xAD6C;&#xD560; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC608;&#xB85C;&#xB294; &#xD37C;&#xC9D5; &#xC131;&#xB2A5; &#xAC1C;&#xC120;, &#xD37C;&#xC9D5; &#xAE30;&#xD68C;&#xAC00; &#xC5C6;&#xC5C8;&#xB358; &#xB2E4;&#xB978; &#xCC44;&#xB110;&#xB85C; &#xD655;&#xC7A5;, &#xC5D0;&#xBBAC;&#xB808;&#xC774;&#xD130; &#xAE30;&#xBC18; &#xD37C;&#xC800; &#xC0AC;&#xC6A9; &#xB610;&#xB294; &#xCF54;&#xB4DC;&#xC5D0; &#xB300;&#xD55C; &#xC218;&#xB3D9; &#xBD84;&#xC11D; &#xC218;&#xD589; &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xC194;&#xB8E8;&#xC158;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xBCF4;&#xC5EC;&#xC8FC;&#xAE30; &#xC704;&#xD574; &#xC5EC;&#xB7EC; RPC &#xC11C;&#xBC84;&#xC5D0; &#xD37C;&#xC9D5; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xC801;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; &#xB354; &#xB9CE;&#xC740; &#xACB0;&#xACFC;&#xB97C; &#xBCFC; &#xC218; &#xC788;&#xC744; &#xAC83;&#xC774;&#xB77C; &#xAE30;&#xB300;&#xD569;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/network/">network</a>
                  
                  <a class="hover-with-bg" href="/tags/rdp/">rdp</a>
                  
                  <a class="hover-with-bg" href="/tags/winafl/">winafl</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/instrumentation/">instrumentation</a>
                  
                  <a class="hover-with-bg" href="/tags/dynamorio/">dynamorio</a>
                  
                  <a class="hover-with-bg" href="/tags/client/">client</a>
                  
                  <a class="hover-with-bg" href="/tags/server/">server</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2022/02/15/fabu1ous/2022-02-15/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2021-43893: Dropping Files on a Domain Controller</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2022/02/12/idioth/2022-02-12/">
                    <span class="hidden-mobile">[] CVE-2022-21999: Windows Print Spooler   </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2022/02/13/l0ch/rdp_fuzzing2/';
        this.page.identifier = '/2022/02/13/l0ch/rdp_fuzzing2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Fuzzing RDP: Holding the Stick at Both Ends (2)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
