

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298; &amp;#xB4E4;&amp;#xACE0;&amp;#xC628; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xC5C6;&amp;#xC774; Process Monitor&amp;#xB85C;&amp;#xB9CC; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; Windows&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xC26C;&amp;#xC6B4; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB2F4;&amp;#xC5C6;&amp;#xC774; &amp;#xC77D;&amp;#xAE30; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC2AC;&amp;#xCA4D; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; : &lt;a href=&#34;https://vuls.cert.org/confluence/display/Wiki/2021/06/21/Finding+Privilege+Escalation+Vulnerabilities+in+Windows+using+Process+Monitor#FindingPrivilegeEscalationVulnerabilitiesinWindowsusingProcessMonitor-Useofalibrarythatloadsfromanunexpectedpath&#34;&gt;Finding Privilege Escalation Vulnerabilities in Windows using Process Monitor&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC740; &amp;#xCC3E;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB4DC;&amp;#xBB38; Windows&amp;#xC758; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD80;&amp;#xBD84;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC644;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB0B4;&amp;#xAC00; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://vuls.cert.org/confluence/display/tools/CERT+BFF+-+Basic+Fuzzing+Framework&#34;&gt;CERT BFF&lt;/a&gt;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xCD9C;&amp;#xC2DC;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150; &amp;#xC99D;&amp;#xBA85; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; instruction pointer&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD37C;&amp;#xC9D5;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://insights.sei.cmu.edu/blog/visualizing-cert-bff-string-minimization/&#34;&gt;BFF string minimization&lt;/a&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;a href=&#34;https://en.wikipedia.org/wiki/Return-oriented_programming&#34;&gt;ROP&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;CERT BFF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; PoC&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD588;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xC218;&amp;#xB144;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC77C; &amp;#xB54C;&amp;#xBB38;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xC874;&amp;#xC7AC; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; BFF &amp;#xCD08;&amp;#xAE30;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xB098;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC791;&amp;#xC5C5;&amp;#xD588;&amp;#xB2E4;. &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC26C;&amp;#xC6B4;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB290;&amp;#xAF08;&amp;#xC73C;&amp;#xBA70; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC0AC;&amp;#xC18C;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC5D0; &amp;#xB180;&amp;#xB790;&amp;#xB2E4;. BFF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC810;&amp;#xC810; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C4; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;a href=&#34;https://docs.microsoft.com/en-us/sysinternals/downloads/procmon&#34;&gt;Sysinternals Process Monitor&lt;/a&gt; (Procmon)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xB150;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xB150;&lt;/h1&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; Windows &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC628;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xAD00;&amp;#xACC4;&amp;#xC5C6;&amp;#xC774; &amp;#xC77C;&amp;#xBD80; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xD615;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC57D;&amp;#xB41C; &amp;#xC791;&amp;#xC5C5;(Task)&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xC640; &amp;#xAD8C;&amp;#xD55C;&amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9C4;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C;-&amp;#xD558;&amp;#xB294;-&amp;#xAC83;&#34;&gt;&lt;a href=&#34;#&amp;#xCC3E;&amp;#xC544;&amp;#xC57C;-&amp;#xD558;&amp;#xB294;-&amp;#xAC83;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&#34;&gt;&lt;/a&gt;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/h1&gt;&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xC26C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&lt;/li&gt;
&lt;li&gt;&amp;#xC0C1;&amp;#xC2B9;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&lt;/li&gt;
&lt;li&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;1&amp;#xACFC; 2&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB098; &amp;#xAC80;&amp;#xC0AC; 3&amp;#xC740; &amp;#xC880; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xC77C;&amp;#xBD80; &amp;#xC624;&amp;#xD0D0;&amp;#xC9C0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xC88B;&amp;#xC740; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://github.com/certcc/privesc&#34;&gt;&amp;#xD544;&amp;#xD130;&lt;/a&gt;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4; .&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD544;&amp;#xD130;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xD544;&amp;#xD130;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD544;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xD544;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&lt;/h1&gt;&lt;p&gt;Privesc.PMF &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654;(&amp;#xC635;&amp;#xC158; &amp;#x2192; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654;)&lt;/li&gt;
&lt;li&gt;&amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xBC0F; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xBA74; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Privesc &amp;#xD544;&amp;#xD130; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;(&amp;#xD544;&amp;#xD130; &amp;#x2192; &amp;#xD544;&amp;#xD130; &amp;#xAD6C;&amp;#xC131; &amp;#x2192; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;&amp;#x2026;)&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;Privesc &amp;#xD544;&amp;#xD130; &amp;#xC801;&amp;#xC6A9;(Filter &amp;#x2192; Load Filter &amp;#x2192; Privesc)&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xC870;&amp;#xC0AC;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xC870;&amp;#xC0AC;-&amp;#xACB0;&amp;#xACFC;&#34;&gt;&lt;a href=&#34;#&amp;#xC870;&amp;#xC0AC;-&amp;#xACB0;&amp;#xACFC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&#34;&gt;&lt;/a&gt;&amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&lt;/h1&gt;&lt;p&gt;VMware Tools&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; 64&amp;#xBE44;&amp;#xD2B8; Windows 10 2004 &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xBD80;&amp;#xD2B8; &amp;#xB85C;&amp;#xADF8;&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;VM&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xC758;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;C:\Program%&lt;span class=&#34;hljs-number&#34;&gt;20F&lt;/span&gt;iles\&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Windows &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC704; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &lt;code&gt;%20&lt;/code&gt;&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC790;&amp;#xB294; &amp;#xC544;&amp;#xB2CC; &amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;. &amp;#xC65C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758;-&amp;#xC2E4;&amp;#xC218;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758;-&amp;#xC2E4;&amp;#xC218;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2E4;&amp;#xC218;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2E4;&amp;#xC218;&lt;/h1&gt;&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xB9CE;&amp;#xC740; &amp;#xC2E4;&amp;#xC218;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;. Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB2E8;&amp;#xC21C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xD558;&amp;#xC5EC; &amp;#xB0B4;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xC2E4;&amp;#xC218;&amp;#xB294; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xBC94;&amp;#xC8FC;&amp;#xB85C; &amp;#xB098;&amp;#xB25C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; ACL(&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4; &amp;#xBAA9;&amp;#xB85D;)&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&lt;/h2&gt;&lt;p&gt;&amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC989;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC544;&amp;#xB9C8; &amp;#xB180;&amp;#xB784; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;URL-&amp;#xC778;&amp;#xCF54;&amp;#xB529;-&amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#URL-&amp;#xC778;&amp;#xCF54;&amp;#xB529;-&amp;#xACBD;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;URL &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;/a&gt;URL &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xACBD;&amp;#xB85C;&lt;/h3&gt;&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; VMware Tools &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &lt;code&gt;VGAuthService.exe&lt;/code&gt;&amp;#xB294; &lt;code&gt;C:\Program%20Files\VMware\VMware%20Tools\VMware%20VGAuth\schemas\xmldsig-core-schema.xsd&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;. &amp;#xACF5;&amp;#xBC31;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xBC31;&amp;#xC774; &lt;code&gt;%20&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; ACL&amp;#xC774; &amp;#xC788;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xBCF4;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xBA85;&amp;#xB839; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xC790;:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &lt;code&gt;C:\&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;C:\&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;Program%20Files&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB3C4; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; Ctrl-K&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC634;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; Process Explorer&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xAE4A;&amp;#xC774; &amp;#xD30C;&amp;#xACE0;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;VGAuthService.exe + 0x110d9&lt;/code&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xACE0; &amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;xmlLoadExternalEntity()&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xAC00; URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;  &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; XXE(XML External Entity) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xBFD0;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC9C0; &amp;#xC6CC;&amp;#xBC0D;&amp;#xC5C5;&amp;#xC5D0; &amp;#xBD88;&amp;#xACFC;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;POSIX-&amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#POSIX-&amp;#xACBD;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;POSIX &amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;/a&gt;POSIX &amp;#xACBD;&amp;#xB85C;&lt;/h3&gt;&lt;p&gt;&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; POSIX &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; Windows &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC815;&amp;#xADDC;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;/usr/local/&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &lt;code&gt;C:\usr\local\&lt;/code&gt;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xB418;&amp;#xBA70; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAC83;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB85C;&amp;#xADF8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;openssl.cnf&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xACF5;&amp;#xAC1C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; code execution&amp;#xC744; &amp;#xC2DC;&amp;#xC5F0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;-&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;-&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; Windows &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &lt;code&gt;C:\CMU\bin\sasl2&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB85C;&amp;#xADF8;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;libsasl.dll&lt;/code&gt; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;libsasl.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;strong&gt;[C:\CMU\bin\sasl2&lt;/strong&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xCC38;&amp;#xC870;&amp;#xB97C;](&lt;a href=&#34;https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117&#34;&gt;https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117&lt;/a&gt;)  &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC30;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%208.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC;-&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC;-&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCC38;&amp;#xC870;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xB204;&amp;#xAD70;&amp;#xAC00;&amp;#xAC00; &amp;#xCC3E;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xC774; &amp;#xC18D;&amp;#xC131;&amp;#xC740; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC774; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &lt;code&gt;C:\Qt\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;plugins&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%209.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F8; &amp;#xAC83;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC30;&amp;#xCE58;&amp;#xD574; code execution&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2010.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Qt &amp;#xAC1C;&amp;#xBC1C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 5&amp;#xB144; &amp;#xC804;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; CVE&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xD574;&amp;#xB2F9; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xB3C4;&amp;#xC785;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC758; Qt &amp;#xBC84;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xAC70;&amp;#xB098; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &lt;code&gt;Qt5core.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &lt;code&gt;qt_prfxpath&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;windeployqt&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC911;&amp;#xC778;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;-&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-ACL&amp;#xC774;-&amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC911;&amp;#xC778;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;-&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-ACL&amp;#xC774;-&amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; ACL&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; ACL&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&lt;/h2&gt;&lt;p&gt;&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xACF3;&amp;#xC5D0; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. ACL&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC870;&amp;#xC0AC;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; ACL &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;br&gt;&lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;C:\Program Files (x86)\&lt;/code&gt;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC0C1;&amp;#xC18D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC548; ACL&amp;#xC744; &amp;#xAC16;&amp;#xB294;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &lt;code&gt;C:\Program Files\WD\&lt;/code&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC5C6;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;WD&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0C1;&amp;#xC704; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;WD&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;ACL&amp;#xC744;-&amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;-&amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xACE0;-C-ProgramData-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#ACL&amp;#xC744;-&amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;-&amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xACE0;-C-ProgramData-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; C:\ProgramData\ &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; C:\ProgramData\ &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&lt;code&gt;ProgramData&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;ProgramData&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;ProgramData&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; ACL&amp;#xC774; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &lt;code&gt;C:\ProgramData\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70; &amp;#xC608;&amp;#xC57D;&amp;#xB41C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2011.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB290;&amp;#xC2A8;&amp;#xD55C; ACL&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; DLL hijacking&amp;#xC758; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xB840;&amp;#xC774;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2012.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;code&gt;msi.dll&lt;/code&gt;&amp;#xC744; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;calc.exe&lt;/code&gt; &amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB9CC;&amp;#xC5F0;&amp;#xD558;&amp;#xBA70; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DLL hijacking&amp;#xC774; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC720;&amp;#xC77C;&amp;#xD55C; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC740; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD560; &amp;#xB9CC; &amp;#xD558;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC4F0;&amp;#xAE30; &amp;#xAC00;&amp;#xB2A5; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xB3D9; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC9C0;&amp;#xC2DC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2013.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC758;-&amp;#xD558;&amp;#xC704;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC758;-&amp;#xD558;&amp;#xC704;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD55C; ACL&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; Python 2.7&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;C:\python27\&lt;/code&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2014.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; ACL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xC774;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C; DLL hijacking &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2015.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB85C; &lt;code&gt;C:\python27\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2016.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;ACL-&amp;#xC124;&amp;#xC815;-&amp;#xC5C6;&amp;#xC774;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xC9C0;&amp;#xC815;-&amp;#xC124;&amp;#xCE58;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xD5C8;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#ACL-&amp;#xC124;&amp;#xC815;-&amp;#xC5C6;&amp;#xC774;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xC9C0;&amp;#xC815;-&amp;#xC124;&amp;#xCE58;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xD5C8;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;ACL &amp;#xC124;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD5C8;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;ACL &amp;#xC124;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD5C8;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; ACL &amp;#xC0C1;&amp;#xC18D;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xB300;&amp;#xC0C1; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB4DC;&amp;#xBB3C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; Microsoft SQL Server 2019 &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2017.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xACE0;&amp;#xAE09;&amp;#x201D; &amp;#xB610;&amp;#xB294; &amp;#x201C;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815;&amp;#x201D; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xC124;&amp;#xCE58; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; ACL&amp;#xC744; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2018.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;SQL Express 2019&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2019.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Microsoft SQL Server 2019&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xD560; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAD8C;&amp;#xD55C;-&amp;#xC0C1;&amp;#xC2B9;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xBC29;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;-&amp;#xC0C1;&amp;#xC2B9;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xBC29;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC29;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC29;&amp;#xC5B4;&lt;/h1&gt;&lt;h2 id=&#34;&amp;#xAD8C;&amp;#xD55C;-&amp;#xC5C6;&amp;#xB294;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;-&amp;#x201C;&amp;#xD3F4;&amp;#xB354;-&amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D;-&amp;#xAD8C;&amp;#xD55C;-&amp;#xC81C;&amp;#xAC70;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;-&amp;#xC5C6;&amp;#xB294;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;-&amp;#x201C;&amp;#xD3F4;&amp;#xB354;-&amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D;-&amp;#xAD8C;&amp;#xD55C;-&amp;#xC81C;&amp;#xAC70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xD3F4;&amp;#xB354; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xAC70;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xD3F4;&amp;#xB354; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xAC70;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xC5B4;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2020.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;C-Program-Files-&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#C-Program-Files-&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;C:\Program Files\ &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&#34;&gt;&lt;/a&gt;C:\Program Files\ &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;C:\Program Files (x86)\&lt;/code&gt; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;  ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD53C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;-&amp;#xBC0F;-&amp;#xAC15;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;-&amp;#xBC0F;-&amp;#xAC15;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBC0F; &amp;#xAC15;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBC0F; &amp;#xAC15;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130; &amp;#xBC0F; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xCCB4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC7A0;&amp;#xAE00; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xB77D;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;. &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC640;&amp;#xC758; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; CERT/CC&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC81C;&amp;#xACF5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Process Monitor Windows     - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298; &amp;#xB4E4;&amp;#xACE0;&amp;#xC628; &amp;#xBC88;&amp;#xC5ED;&amp;#xAE00;&amp;#xC740; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xC5C6;&amp;#xC774; Process Monitor&amp;#xB85C;&amp;#xB9CC; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; Windows&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xC26C;&amp;#xC6B4; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xB77C; &amp;#xBD80;&amp;#xB2F4;&amp;#xC5C6;&amp;#xC774; &amp;#xC77D;&amp;#xAE30; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544; &amp;#xC2AC;&amp;#xCA4D; &amp;#xBC88;&amp;#xC5ED;&amp;#xD574;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; : &lt;a href=&#34;https://vuls.cert.org/confluence/display/Wiki/2021/06/21/Finding+Privilege+Escalation+Vulnerabilities+in+Windows+using+Process+Monitor#FindingPrivilegeEscalationVulnerabilitiesinWindowsusingProcessMonitor-Useofalibrarythatloadsfromanunexpectedpath&#34;&gt;Finding Privilege Escalation Vulnerabilities in Windows using Process Monitor&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xC694;&lt;/h1&gt;&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC740; &amp;#xCC3E;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB4DC;&amp;#xBB38; Windows&amp;#xC758; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD80;&amp;#xBD84;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC644;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xB0B4;&amp;#xAC00; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://vuls.cert.org/confluence/display/tools/CERT+BFF+-+Basic+Fuzzing+Framework&#34;&gt;CERT BFF&lt;/a&gt;&amp;#xB97C; &amp;#xCC98;&amp;#xC74C; &amp;#xCD9C;&amp;#xC2DC;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150; &amp;#xC99D;&amp;#xBA85; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC758; instruction pointer&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD37C;&amp;#xC9D5;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://insights.sei.cmu.edu/blog/visualizing-cert-bff-string-minimization/&#34;&gt;BFF string minimization&lt;/a&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;a href=&#34;https://en.wikipedia.org/wiki/Return-oriented_programming&#34;&gt;ROP&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;CERT BFF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; PoC&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD588;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC84C;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xC218;&amp;#xB144;&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC77C; &amp;#xB54C;&amp;#xBB38;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC; &amp;#xBAA8;&amp;#xB450;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xC874;&amp;#xC7AC; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; BFF &amp;#xCD08;&amp;#xAE30;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xB098;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC; &amp;#xAE30;&amp;#xC220;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC791;&amp;#xC5C5;&amp;#xD588;&amp;#xB2E4;. &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC26C;&amp;#xC6B4;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB290;&amp;#xAF08;&amp;#xC73C;&amp;#xBA70; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xC0AC;&amp;#xC18C;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC5D0; &amp;#xB180;&amp;#xB790;&amp;#xB2E4;. BFF&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xAE4C;&amp;#xC9C0;&amp;#xC758; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC9C0;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC810;&amp;#xC810; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC9C4; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;a href=&#34;https://docs.microsoft.com/en-us/sysinternals/downloads/procmon&#34;&gt;Sysinternals Process Monitor&lt;/a&gt; (Procmon)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xB150;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xB150;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xB150;&lt;/h1&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; Windows &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC628;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xAD00;&amp;#xACC4;&amp;#xC5C6;&amp;#xC774; &amp;#xC77C;&amp;#xBD80; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC5D0;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xD615;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC57D;&amp;#xB41C; &amp;#xC791;&amp;#xC5C5;(Task)&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xC640; &amp;#xAD8C;&amp;#xD55C;&amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9C4;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C;-&amp;#xD558;&amp;#xB294;-&amp;#xAC83;&#34;&gt;&lt;a href=&#34;#&amp;#xCC3E;&amp;#xC544;&amp;#xC57C;-&amp;#xD558;&amp;#xB294;-&amp;#xAC83;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&#34;&gt;&lt;/a&gt;&amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/h1&gt;&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xC26C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xB610;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&lt;/li&gt;
&lt;li&gt;&amp;#xC0C1;&amp;#xC2B9;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&lt;/li&gt;
&lt;li&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;1&amp;#xACFC; 2&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB098; &amp;#xAC80;&amp;#xC0AC; 3&amp;#xC740; &amp;#xC880; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xC77C;&amp;#xBD80; &amp;#xC624;&amp;#xD0D0;&amp;#xC9C0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xB370; &amp;#xC88B;&amp;#xC740; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://github.com/certcc/privesc&#34;&gt;&amp;#xD544;&amp;#xD130;&lt;/a&gt;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4; .&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD544;&amp;#xD130;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xD544;&amp;#xD130;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD544;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xD544;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&lt;/h1&gt;&lt;p&gt;Privesc.PMF &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654;(&amp;#xC635;&amp;#xC158; &amp;#x2192; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654;)&lt;/li&gt;
&lt;li&gt;&amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xBC0F; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xC2E4;&amp;#xD589;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xBA74; &amp;#xBD80;&amp;#xD305; &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt; &lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Privesc &amp;#xD544;&amp;#xD130; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;(&amp;#xD544;&amp;#xD130; &amp;#x2192; &amp;#xD544;&amp;#xD130; &amp;#xAD6C;&amp;#xC131; &amp;#x2192; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;&amp;#x2026;)&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;Privesc &amp;#xD544;&amp;#xD130; &amp;#xC801;&amp;#xC6A9;(Filter &amp;#x2192; Load Filter &amp;#x2192; Privesc)&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xC870;&amp;#xC0AC;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xC870;&amp;#xC0AC;-&amp;#xACB0;&amp;#xACFC;&#34;&gt;&lt;a href=&#34;#&amp;#xC870;&amp;#xC0AC;-&amp;#xACB0;&amp;#xACFC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&#34;&gt;&lt;/a&gt;&amp;#xC870;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&lt;/h1&gt;&lt;p&gt;VMware Tools&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; 64&amp;#xBE44;&amp;#xD2B8; Windows 10 2004 &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xBD80;&amp;#xD2B8; &amp;#xB85C;&amp;#xADF8;&amp;#xBD80;&amp;#xD130; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;VM&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xAC70;&amp;#xC758; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xC758;&amp;#xC2EC;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;C:\Program%&lt;span class=&#34;hljs-number&#34;&gt;20F&lt;/span&gt;iles\&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Windows &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC704; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &lt;code&gt;%20&lt;/code&gt;&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC790;&amp;#xB294; &amp;#xC544;&amp;#xB2CC; &amp;#xAC83; &amp;#xAC19;&amp;#xB2E4;. &amp;#xC65C; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xC139;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758;-&amp;#xC2E4;&amp;#xC218;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758;-&amp;#xC2E4;&amp;#xC218;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2E4;&amp;#xC218;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2E4;&amp;#xC218;&lt;/h1&gt;&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xB9CE;&amp;#xC740; &amp;#xC2E4;&amp;#xC218;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;. Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB2E8;&amp;#xC21C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xD558;&amp;#xC5EC; &amp;#xB0B4;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xC2E4;&amp;#xC218;&amp;#xB294; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xBC94;&amp;#xC8FC;&amp;#xB85C; &amp;#xB098;&amp;#xB25C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; ACL(&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4; &amp;#xBAA9;&amp;#xB85D;)&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&lt;/h2&gt;&lt;p&gt;&amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC989;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xC544;&amp;#xB9C8; &amp;#xB180;&amp;#xB784; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;URL-&amp;#xC778;&amp;#xCF54;&amp;#xB529;-&amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#URL-&amp;#xC778;&amp;#xCF54;&amp;#xB529;-&amp;#xACBD;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;URL &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;/a&gt;URL &amp;#xC778;&amp;#xCF54;&amp;#xB529; &amp;#xACBD;&amp;#xB85C;&lt;/h3&gt;&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; VMware Tools &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &lt;code&gt;VGAuthService.exe&lt;/code&gt;&amp;#xB294; &lt;code&gt;C:\Program%20Files\VMware\VMware%20Tools\VMware%20VGAuth\schemas\xmldsig-core-schema.xsd&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;. &amp;#xACF5;&amp;#xBC31;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xBC31;&amp;#xC774; &lt;code&gt;%20&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; ACL&amp;#xC774; &amp;#xC788;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xBCF4;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC790;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xBA85;&amp;#xB839; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xBCF4;&amp;#xC790;:&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &lt;code&gt;C:\&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;C:\&lt;/code&gt; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;Program%20Files&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB3C4; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xACE0; Ctrl-K&amp;#xB97C; &amp;#xB20C;&amp;#xB7EC; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC634;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; Process Explorer&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xAE4A;&amp;#xC774; &amp;#xD30C;&amp;#xACE0;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;VGAuthService.exe + 0x110d9&lt;/code&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xACE0; &amp;#xADF8; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;xmlLoadExternalEntity()&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xAC00; URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;  &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; XXE(XML External Entity) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xBFD0;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC9C0; &amp;#xC6CC;&amp;#xBC0D;&amp;#xC5C5;&amp;#xC5D0; &amp;#xBD88;&amp;#xACFC;&amp;#xD558;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;POSIX-&amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;a href=&#34;#POSIX-&amp;#xACBD;&amp;#xB85C;&#34; class=&#34;headerlink&#34; title=&#34;POSIX &amp;#xACBD;&amp;#xB85C;&#34;&gt;&lt;/a&gt;POSIX &amp;#xACBD;&amp;#xB85C;&lt;/h3&gt;&lt;p&gt;&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; POSIX &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; Windows &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC815;&amp;#xADDC;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;/usr/local/&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &lt;code&gt;C:\usr\local\&lt;/code&gt;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xB418;&amp;#xBA70; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAC83;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xD488;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB85C;&amp;#xADF8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;openssl.cnf&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xACF5;&amp;#xAC1C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; code execution&amp;#xC744; &amp;#xC2DC;&amp;#xC5F0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;-&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;-&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; Windows &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &lt;code&gt;C:\CMU\bin\sasl2&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xB85C;&amp;#xADF8;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%206.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC774; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;libsasl.dll&lt;/code&gt; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%207.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;libsasl.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;strong&gt;[C:\CMU\bin\sasl2&lt;/strong&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD558;&amp;#xB4DC; &amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xCC38;&amp;#xC870;&amp;#xB97C;](&lt;a href=&#34;https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117&#34;&gt;https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117&lt;/a&gt;)  &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC30;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%208.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC;-&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC;-&amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;-&amp;#xACBD;&amp;#xB85C;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;&amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCC38;&amp;#xC870;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xB204;&amp;#xAD70;&amp;#xAC00;&amp;#xAC00; &amp;#xCC3E;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xC774; &amp;#xC18D;&amp;#xC131;&amp;#xC740; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC774; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &lt;code&gt;C:\Qt\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC5D0;&amp;#xC11C; &lt;code&gt;plugins&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%209.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC74;&amp;#xB108;&amp;#xB6F8; &amp;#xAC83;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC30;&amp;#xCE58;&amp;#xD574; code execution&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2010.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Qt &amp;#xAC1C;&amp;#xBC1C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 5&amp;#xB144; &amp;#xC804;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC; CVE&amp;#xB97C; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC73C;&amp;#xBA70; &amp;#xD574;&amp;#xB2F9; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xB3C4;&amp;#xC785;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC758; Qt &amp;#xBC84;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xCD95;&amp;#xB418;&amp;#xC5C8;&amp;#xAC70;&amp;#xB098; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &lt;code&gt;Qt5core.dll&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &lt;code&gt;qt_prfxpath&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;windeployqt&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC911;&amp;#xC778;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;-&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-ACL&amp;#xC774;-&amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC911;&amp;#xC778;-&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;-&amp;#xC608;&amp;#xAE30;&amp;#xCE58;-&amp;#xC54A;&amp;#xC740;-ACL&amp;#xC774;-&amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; ACL&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC778; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; ACL&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB428;&lt;/h2&gt;&lt;p&gt;&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xAE30;&amp;#xCE58; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xACF3;&amp;#xC5D0; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. ACL&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC870;&amp;#xC0AC;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; ACL &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;.&lt;br&gt;&lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;C:\Program Files (x86)\&lt;/code&gt;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC0C1;&amp;#xC18D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC548; ACL&amp;#xC744; &amp;#xAC16;&amp;#xB294;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &lt;code&gt;C:\Program Files\WD\&lt;/code&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC5C6;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;WD&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0C1;&amp;#xC704; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;WD&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;ACL&amp;#xC744;-&amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;-&amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xACE0;-C-ProgramData-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#ACL&amp;#xC744;-&amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;-&amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xACE0;-C-ProgramData-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xC0AC;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; C:\ProgramData\ &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; C:\ProgramData\ &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&lt;code&gt;ProgramData&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xC774; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;ProgramData&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;ProgramData&lt;/code&gt; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; ACL&amp;#xC774; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &lt;code&gt;C:\ProgramData\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70; &amp;#xC608;&amp;#xC57D;&amp;#xB41C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2011.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC83;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB290;&amp;#xC2A8;&amp;#xD55C; ACL&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; DLL hijacking&amp;#xC758; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xB840;&amp;#xC774;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2012.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;code&gt;msi.dll&lt;/code&gt;&amp;#xC744; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;calc.exe&lt;/code&gt; &amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB9CC;&amp;#xC5F0;&amp;#xD558;&amp;#xBA70; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;DLL hijacking&amp;#xC774; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC720;&amp;#xC77C;&amp;#xD55C; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC740; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD560; &amp;#xB9CC; &amp;#xD558;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC4F0;&amp;#xAE30; &amp;#xAC00;&amp;#xB2A5; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xB3D9; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC9C0;&amp;#xC2DC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;calc.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2013.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC758;-&amp;#xD558;&amp;#xC704;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC758;-&amp;#xD558;&amp;#xC704;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD55C; ACL&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; Python 2.7&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;C:\python27\&lt;/code&gt;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2014.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; ACL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xC774;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C; DLL hijacking &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2015.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB85C; &lt;code&gt;C:\python27\&lt;/code&gt; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2016.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;ACL-&amp;#xC124;&amp;#xC815;-&amp;#xC5C6;&amp;#xC774;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xC9C0;&amp;#xC815;-&amp;#xC124;&amp;#xCE58;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xD5C8;&amp;#xC6A9;&#34;&gt;&lt;a href=&#34;#ACL-&amp;#xC124;&amp;#xC815;-&amp;#xC5C6;&amp;#xC774;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xC9C0;&amp;#xC815;-&amp;#xC124;&amp;#xCE58;-&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;-&amp;#xD5C8;&amp;#xC6A9;&#34; class=&#34;headerlink&#34; title=&#34;ACL &amp;#xC124;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD5C8;&amp;#xC6A9;&#34;&gt;&lt;/a&gt;ACL &amp;#xC124;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD5C8;&amp;#xC6A9;&lt;/h3&gt;&lt;p&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &lt;code&gt;C:\Program Files\&lt;/code&gt;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; ACL &amp;#xC0C1;&amp;#xC18D;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC124;&amp;#xCE58; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xB300;&amp;#xC0C1; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB4DC;&amp;#xBB3C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; Microsoft SQL Server 2019 &amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2017.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;&amp;#xACE0;&amp;#xAE09;&amp;#x201D; &amp;#xB610;&amp;#xB294; &amp;#x201C;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC9C0;&amp;#xC815;&amp;#x201D; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xC124;&amp;#xCE58; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; ACL&amp;#xC744; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2018.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;SQL Express 2019&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2019.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;Microsoft SQL Server 2019&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC124;&amp;#xCE58;&amp;#xD560; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAD8C;&amp;#xD55C;-&amp;#xC0C1;&amp;#xC2B9;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xBC29;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;-&amp;#xC0C1;&amp;#xC2B9;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xBC29;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC29;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC29;&amp;#xC5B4;&lt;/h1&gt;&lt;h2 id=&#34;&amp;#xAD8C;&amp;#xD55C;-&amp;#xC5C6;&amp;#xB294;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;-&amp;#x201C;&amp;#xD3F4;&amp;#xB354;-&amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D;-&amp;#xAD8C;&amp;#xD55C;-&amp;#xC81C;&amp;#xAC70;&#34;&gt;&lt;a href=&#34;#&amp;#xAD8C;&amp;#xD55C;-&amp;#xC5C6;&amp;#xB294;-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;-&amp;#x201C;&amp;#xD3F4;&amp;#xB354;-&amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D;-&amp;#xAD8C;&amp;#xD55C;-&amp;#xC81C;&amp;#xAC70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xD3F4;&amp;#xB354; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xAC70;&#34;&gt;&lt;/a&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;&amp;#xD3F4;&amp;#xB354; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30;&amp;#x201D; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xAC70;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0; &amp;#xC124;&amp;#xBA85;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xC5B4;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/08/18/l0ch/procmon-lpe/Untitled%2020.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;C-Program-Files-&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#C-Program-Files-&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;C:\Program Files\ &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&#34;&gt;&lt;/a&gt;C:\Program Files\ &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &lt;code&gt;C:\Program Files\&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;C:\Program Files (x86)\&lt;/code&gt; &amp;#xC774;&amp;#xC678;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC124;&amp;#xCE58;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;  ACL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;. &amp;#xAD8C;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD53C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;-&amp;#xBC0F;-&amp;#xAC15;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;-&amp;#xBC0F;-&amp;#xAC15;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBC0F; &amp;#xAC15;&amp;#xD654;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBC0F; &amp;#xAC15;&amp;#xD654;&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xD544;&amp;#xD130; &amp;#xBC0F; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xCCB4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC704;&amp;#xCE58;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xB2F9; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC7A0;&amp;#xAE00; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xB77D;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;. &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC640;&amp;#xC758; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; CERT/CC&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC81C;&amp;#xACF5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/08/18/l0ch/procmon-lpe/Untitled%208.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/08/18/l0ch/procmon-lpe/">

  <title>[Translation] Process Monitor Windows     - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-08-18 18:00" pubdate>
      2021 8 18 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      85
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Process Monitor Windows    </h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; L0ch&#xC785;&#xB2C8;&#xB2E4;! &#xC624;&#xB298; &#xB4E4;&#xACE0;&#xC628; &#xBC88;&#xC5ED;&#xAE00;&#xC740; &#xBCF5;&#xC7A1;&#xD55C; &#xBD84;&#xC11D; &#xC5C6;&#xC774; Process Monitor&#xB85C;&#xB9CC; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294; Windows&#xC758; &#xAC04;&#xB2E8;&#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xB370;&#xC694;, &#xC26C;&#xC6B4; &#xB0B4;&#xC6A9;&#xC774;&#xB77C; &#xBD80;&#xB2F4;&#xC5C6;&#xC774; &#xC77D;&#xAE30; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC544; &#xC2AC;&#xCA4D; &#xBC88;&#xC5ED;&#xD574;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<blockquote>
<p>&#xC6D0;&#xBB38; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://vuls.cert.org/confluence/display/Wiki/2021/06/21/Finding+Privilege+Escalation+Vulnerabilities+in+Windows+using+Process+Monitor#FindingPrivilegeEscalationVulnerabilitiesinWindowsusingProcessMonitor-Useofalibrarythatloadsfromanunexpectedpath">Finding Privilege Escalation Vulnerabilities in Windows using Process Monitor</a></p>
</blockquote>
<hr>
<h1 id="&#xAC1C;&#xC694;"><a href="#&#xAC1C;&#xC694;" class="headerlink" title="&#xAC1C;&#xC694;"></a>&#xAC1C;&#xC694;</h1><p>&#xC774; &#xAC8C;&#xC2DC;&#xBB3C;&#xC740; &#xCC3E;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xB4DC;&#xBB38; Windows&#xC758; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD55C;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD80;&#xBD84;&#xC801;&#xC73C;&#xB85C; &#xC644;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC744; &#xC18C;&#xAC1C;&#xD55C;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xB0B4;&#xAC00; &#xBCF4;&#xACE0;&#xC2F6;&#xC5B4;&#xD558;&#xB294; &#xBCC0;&#xD654;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xC774;&#xB7EC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC778;&#xC9C0;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://vuls.cert.org/confluence/display/tools/CERT+BFF+-+Basic+Fuzzing+Framework">CERT BFF</a>&#xB97C; &#xCC98;&#xC74C; &#xCD9C;&#xC2DC;&#xD588;&#xC744; &#xB54C; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xAC1C;&#xB150; &#xC99D;&#xBA85; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<ol>
<li>&#xD0C0;&#xAC9F;&#xC758; instruction pointer&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC744;&#xB54C;&#xAE4C;&#xC9C0; &#xD37C;&#xC9D5;&#xD55C;&#xB2E4;.</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://insights.sei.cmu.edu/blog/visualizing-cert-bff-string-minimization/">BFF string minimization</a>&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xACF5;&#xAC04;&#xC744; &#xCC3E;&#xB294;&#xB2E4;.</li>
<li>&#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Return-oriented_programming">ROP</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD750;&#xB984;&#xC744; &#xC218;&#xC815;&#xD55C;&#xB2E4;.</li>
</ol>
<p>CERT BFF&#xB97C; &#xC0AC;&#xC6A9;&#xD574; PoC&#xAE4C;&#xC9C0; &#xB3C4;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xAD50;&#xC801; &#xAC04;&#xB2E8;&#xD588;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xC900;&#xC774; &#xB192;&#xC544;&#xC84C;&#xB294;&#xB370;, &#xC774;&#xAC83;&#xC740; &#xC218;&#xB144;&#xC5D0; &#xAC78;&#xCCD0; &#xC77C;&#xC5B4;&#xB09C; &#xB450; &#xAC00;&#xC9C0; &#xC77C; &#xB54C;&#xBB38;&#xC77C; &#xC218; &#xC788;&#xB2E4;.</p>
<ol>
<li>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xACF5;&#xAE09; &#xC5C5;&#xCCB4;&#xC758; &#xD37C;&#xC9D5;&#xD14C;&#xC2A4;&#xD2B8; &#xC99D;&#xAC00;</li>
<li>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBC0F; &#xD50C;&#xB7AB;&#xD3FC; &#xBAA8;&#xB450;&#xC5D0;&#xC11C;&#xC758; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158; &#xC874;&#xC7AC; &#xC99D;&#xAC00;</li>
</ol>
<p>&#xCD5C;&#xADFC; BFF &#xCD08;&#xAE30;&#xB97C; &#xC0DD;&#xAC01;&#xB098;&#xAC8C; &#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810; &#xBC1C;&#xACAC; &#xAE30;&#xC220;&#xC5D0; &#xB300;&#xD574; &#xC791;&#xC5C5;&#xD588;&#xB2E4;. &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xAC83;&#xACFC; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC26C;&#xC6B4;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xB290;&#xAF08;&#xC73C;&#xBA70; &#xAC1C;&#xB150;&#xC774; &#xB108;&#xBB34; &#xC0AC;&#xC18C;&#xD574;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xB370; &#xC131;&#xACF5;&#xD588;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC5D0; &#xB180;&#xB790;&#xB2E4;. BFF&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xD37C;&#xC9D5;&#xC5D0;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xAE4C;&#xC9C0;&#xC758; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xAC00; &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xC810;&#xC810; &#xC5B4;&#xB824;&#xC6CC;&#xC9C4; &#xAC83;&#xCC98;&#xB7FC; &#xC774; &#xAE30;&#xC220;&#xB85C; &#xC27D;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xD6E8;&#xC52C; &#xC904;&#xC5B4;&#xB4E4;&#xC5C8;&#xC73C;&#xBA74; &#xD55C;&#xB2E4;.</p>
<p>&#xC774; &#xAC8C;&#xC2DC;&#xBB3C;&#xC5D0;&#xC11C;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/sysinternals/downloads/procmon">Sysinternals Process Monitor</a> (Procmon)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBC1C;&#xACAC;&#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810; &#xC911; &#xC77C;&#xBD80;&#xB97C; &#xACF5;&#xC720;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<h1 id="&#xAC1C;&#xB150;"><a href="#&#xAC1C;&#xB150;" class="headerlink" title="&#xAC1C;&#xB150;"></a>&#xAC1C;&#xB150;</h1><p>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; Windows &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xC124;&#xCE58;&#xB418;&#xBA74; &#xD604;&#xC7AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB85C;&#xADF8;&#xC628;&#xD55C; &#xC0AC;&#xC6A9;&#xC790; &#xAD8C;&#xD55C;&#xC5D0; &#xAD00;&#xACC4;&#xC5C6;&#xC774; &#xC77C;&#xBD80; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xAC00; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAD8C;&#xD55C; &#xC788;&#xB294; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC5D0;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB450; &#xAC00;&#xC9C0; &#xD615;&#xC2DD;&#xC774; &#xC788;&#xB2E4;.</p>
<ol>
<li>&#xC124;&#xCE58;&#xB41C; &#xC11C;&#xBE44;&#xC2A4;</li>
<li>&#xC608;&#xC57D;&#xB41C; &#xC791;&#xC5C5;(Task)</li>
</ol>
<p>&#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xB294; &#xB9AC;&#xC18C;&#xC2A4;&#xC640; &#xAD8C;&#xD55C;&#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC131;&#xC758; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC544;&#xC9C4;&#xB2E4;.</p>
<h1 id="&#xCC3E;&#xC544;&#xC57C;-&#xD558;&#xB294;-&#xAC83;"><a href="#&#xCC3E;&#xC544;&#xC57C;-&#xD558;&#xB294;-&#xAC83;" class="headerlink" title="&#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294; &#xAC83;"></a>&#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294; &#xAC83;</h1><p>&#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xC26C;&#xC6B4; &#xBC29;&#xBC95;&#xC740; &#xB2E4;&#xC74C; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xD544;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<ol>
<li>&#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD30C;&#xC77C; &#xB610;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC;</li>
<li>&#xC0C1;&#xC2B9;&#xB41C; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;</li>
<li>&#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC4F8; &#xC218; &#xC788;&#xB294; &#xC704;&#xCE58;</li>
</ol>
<p>1&#xACFC; 2&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130;&#xC5D0;&#xC11C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC73C;&#xB098; &#xAC80;&#xC0AC; 3&#xC740; &#xC880; &#xB354; &#xBCF5;&#xC7A1;&#xD558;&#xBA70; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xD544;&#xD130;&#xB85C; &#xC218;&#xD589;&#xD560; &#xB54C; &#xC77C;&#xBD80; &#xC624;&#xD0D0;&#xC9C0;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xB370; &#xC88B;&#xC740; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/certcc/privesc">&#xD544;&#xD130;</a>&#xB97C; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4; .</p>
<h1 id="&#xD544;&#xD130;-&#xC0AC;&#xC6A9;"><a href="#&#xD544;&#xD130;-&#xC0AC;&#xC6A9;" class="headerlink" title="&#xD544;&#xD130; &#xC0AC;&#xC6A9;"></a>&#xD544;&#xD130; &#xC0AC;&#xC6A9;</h1><p>Privesc.PMF &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xD544;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xAD50;&#xC801; &#xAC04;&#xB2E8;&#xD558;&#xB2E4;.</p>
<ol>
<li>&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xBD80;&#xD305; &#xB85C;&#xAE45; &#xD65C;&#xC131;&#xD654;(&#xC635;&#xC158; &#x2192; &#xBD80;&#xD305; &#xB85C;&#xAE45; &#xD65C;&#xC131;&#xD654;)</li>
<li>&#xC7AC;&#xBD80;&#xD305; &#xBC0F; &#xB85C;&#xADF8;&#xC778;</li>
<li>&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xC2E4;&#xD589;</li>
<li><p>&#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xD45C;&#xC2DC;&#xB418;&#xBA74; &#xBD80;&#xD305; &#xB85C;&#xADF8;&#xB97C; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;.</p>
<p> <img src="/2021/08/18/l0ch/procmon-lpe/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
</li>
<li><p>Privesc &#xD544;&#xD130; &#xAC00;&#xC838;&#xC624;&#xAE30;(&#xD544;&#xD130; &#x2192; &#xD544;&#xD130; &#xAD6C;&#xC131; &#x2192; &#xAC00;&#xC838;&#xC624;&#xAE30;&#x2026;)</p>
</li>
<li>Privesc &#xD544;&#xD130; &#xC801;&#xC6A9;(Filter &#x2192; Load Filter &#x2192; Privesc)</li>
<li>&#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xD30C;&#xC77C; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xCC3E;&#xC544; &#xC870;&#xC0AC;</li>
</ol>
<h1 id="&#xC870;&#xC0AC;-&#xACB0;&#xACFC;"><a href="#&#xC870;&#xC0AC;-&#xACB0;&#xACFC;" class="headerlink" title="&#xC870;&#xC0AC; &#xACB0;&#xACFC;"></a>&#xC870;&#xC0AC; &#xACB0;&#xACFC;</h1><p>VMware Tools&#xAC00; &#xC124;&#xCE58;&#xB41C; 64&#xBE44;&#xD2B8; Windows 10 2004 &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C;&#xC758; &#xBD80;&#xD2B8; &#xB85C;&#xADF8;&#xBD80;&#xD130; &#xC0B4;&#xD3B4;&#xBCF8;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%201.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>VM&#xC5D0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xAC70;&#xC758; &#xC124;&#xCE58;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xC774;&#xBBF8; &#xC758;&#xC2EC;&#xC2A4;&#xB7EC;&#xC6B4; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
<pre><code class="hljs c">C:\Program%<span class="hljs-number">20F</span>iles\</code></pre>
<p>Windows &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>C:\Program Files\</code> &#xACBD;&#xB85C;&#xC5D0; &#xC775;&#xC219;&#xD558;&#xC9C0;&#xB9CC; &#xC704; &#xACB0;&#xACFC;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; <code>%20</code>&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xBB38;&#xC790;&#xB294; &#xC544;&#xB2CC; &#xAC83; &#xAC19;&#xB2E4;. &#xC65C; &#xC774;&#xB7EC;&#xD55C; &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xD0C0;&#xB098;&#xB294;&#xC9C0;&#xB294; &#xC544;&#xB798; &#xC139;&#xC158;&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</p>
<h1 id="&#xAC1C;&#xBC1C;&#xC790;&#xC758;-&#xC2E4;&#xC218;"><a href="#&#xAC1C;&#xBC1C;&#xC790;&#xC758;-&#xC2E4;&#xC218;" class="headerlink" title="&#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC2E4;&#xC218;"></a>&#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC2E4;&#xC218;</h1><p>&#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xB9CE;&#xC740; &#xC2E4;&#xC218;&#xAC00; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;. Windows &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB2E8;&#xC21C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xAD00;&#xB828;&#xD558;&#xC5EC; &#xB0B4;&#xAC00; &#xBC1C;&#xACAC;&#xD55C; &#xC2E4;&#xC218;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xBC94;&#xC8FC;&#xB85C; &#xB098;&#xB25C;&#xB2E4;.</p>
<ol>
<li>&#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD568;</li>
<li>&#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xACBD;&#xB85C;&#xC5D0; &#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD55C; ACL(&#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4; &#xBAA9;&#xB85D;)&#xC774; &#xC801;&#xC6A9;&#xB428;</li>
</ol>
<h2 id="&#xC608;&#xAE30;&#xCE58;-&#xC54A;&#xC740;-&#xACBD;&#xB85C;-&#xC561;&#xC138;&#xC2A4;"><a href="#&#xC608;&#xAE30;&#xCE58;-&#xC54A;&#xC740;-&#xACBD;&#xB85C;-&#xC561;&#xC138;&#xC2A4;" class="headerlink" title="&#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C; &#xC561;&#xC138;&#xC2A4;"></a>&#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C; &#xC561;&#xC138;&#xC2A4;</h2><p>&#xACBD;&#xC6B0;&#xC5D0; &#xB530;&#xB77C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xC911;&#xC5D0; &#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD55C;&#xB2E4;. &#xC989;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xAC8C; &#xB418;&#xBA74; &#xC544;&#xB9C8; &#xB180;&#xB784; &#xAC83;&#xC774;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C; &#xC561;&#xC138;&#xC2A4;&#xB294; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h3 id="URL-&#xC778;&#xCF54;&#xB529;-&#xACBD;&#xB85C;"><a href="#URL-&#xC778;&#xCF54;&#xB529;-&#xACBD;&#xB85C;" class="headerlink" title="URL &#xC778;&#xCF54;&#xB529; &#xACBD;&#xB85C;"></a>URL &#xC778;&#xCF54;&#xB529; &#xACBD;&#xB85C;</h3><p>&#xC704;&#xC758; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7;&#xC5D0;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774; VMware Tools &#xD504;&#xB85C;&#xC138;&#xC2A4; <code>VGAuthService.exe</code>&#xB294; <code>C:\Program%20Files\VMware\VMware%20Tools\VMware%20VGAuth\schemas\xmldsig-core-schema.xsd</code> &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC2DC;&#xB3C4;&#xD55C;&#xB2E4;. &#xACF5;&#xBC31;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xACBD;&#xB85C;&#xAC00; URL&#xB85C; &#xC778;&#xCF54;&#xB529;&#xB41C; &#xACBD;&#xC6B0; &#xD574;&#xB2F9; &#xACF5;&#xBC31;&#xC774; <code>%20</code>&#xC73C;&#xB85C; &#xB300;&#xCCB4;&#xB41C; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xACB0;&#xACFC;&#xB294; &#xC694;&#xCCAD;&#xB41C; &#xACBD;&#xB85C;&#xAC00; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC801;&#xC808;&#xD55C; ACL&#xC774; &#xC788;&#xB294; <code>C:\Program Files\</code>&#xC758; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xBCF4;&#xAE30; &#xC2DC;&#xC791;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. Windows &#xC2DC;&#xC2A4;&#xD15C;&#xC740; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB3C4; &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;&#xC11C; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xC774;&#xAC83;&#xC740; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#xB098;&#xC624;&#xB294; &#xC8FC;&#xC694; &#xAC1C;&#xB150;&#xC774; &#xB420; &#xAC83;&#xC774;&#xBBC0;&#xB85C; &#xC774;&#xAC83;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC790;.</p>
<p>&#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xBA85;&#xB839; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xC5D0;&#xC11C; &#xBB34;&#xC5C7;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xBCF4;&#xC790;:</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%202.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC; <code>C:\</code> &#xC5D0;&#xC11C; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>C:\</code> &#xC5D0;&#xC11C; <code>Program%20Files</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB3C4; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>
<p>&#xD30C;&#xC77C; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xACE0; Ctrl-K&#xB97C; &#xB20C;&#xB7EC; &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xAC00;&#xC838;&#xC634;&#xC73C;&#xB85C;&#xC368; Process Explorer&#xC5D0;&#xC11C; &#xC870;&#xAE08; &#xB354; &#xAE4A;&#xC774; &#xD30C;&#xACE0;&#xB4E4; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%203.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xD30C;&#xC77C; &#xC561;&#xC138;&#xC2A4;&#xAC00; <code>VGAuthService.exe + 0x110d9</code>&#xC5D0; &#xC758;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xB418;&#xACE0; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; <code>xmlLoadExternalEntity()</code>&#xC5D0; &#xB300;&#xD55C; &#xD638;&#xCD9C;&#xC774; &#xC788;&#xC74C;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xACBD;&#xB85C;&#xAC00; URL&#xB85C; &#xC778;&#xCF54;&#xB529;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;  &#xAD8C;&#xD55C; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xB85C;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;. &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774; &#xACBD;&#xB85C;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB41C;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; &#xACB0;&#xACFC;&#xB294; XXE(XML External Entity) &#xCDE8;&#xC57D;&#xC810;&#xBFD0;&#xC774;&#xC9C0;&#xB9CC; &#xC774;&#xB294; &#xB2E8;&#xC9C0; &#xC6CC;&#xBC0D;&#xC5C5;&#xC5D0; &#xBD88;&#xACFC;&#xD558;&#xB2E4;.</p>
<h3 id="POSIX-&#xACBD;&#xB85C;"><a href="#POSIX-&#xACBD;&#xB85C;" class="headerlink" title="POSIX &#xACBD;&#xB85C;"></a>POSIX &#xACBD;&#xB85C;</h3><p>&#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; Windows &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; POSIX &#xC2A4;&#xD0C0;&#xC77C; &#xACBD;&#xB85C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xC774; &#xACBD;&#xB85C;&#xB294; Windows &#xC2A4;&#xD0C0;&#xC77C; &#xACBD;&#xB85C;&#xB85C; &#xC815;&#xADDC;&#xD654;&#xB41C;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, Windows &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; <code>/usr/local/</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xB824;&#xACE0; &#xD558;&#xBA74; &#xACBD;&#xB85C;&#xB294; <code>C:\usr\local\</code>&#xB85C; &#xD574;&#xC11D;&#xB418;&#xBA70; &#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xAC83;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; Windows&#xC5D0;&#xC11C; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB294; &#xACBD;&#xB85C;&#xC774;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; &#xD328;&#xCE58;&#xB41C; &#xBCF4;&#xC548; &#xC81C;&#xD488;&#xC774; &#xC124;&#xCE58;&#xB41C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xB85C;&#xADF8;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%204.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>openssl.cnf</code>&#xB97C; &#xD1B5;&#xD574; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xACF5;&#xAC1C;&#xC801;&#xC73C;&#xB85C; &#xC54C;&#xB824;&#xC9C4; &#xAE30;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC81C;&#xD55C;&#xB41C; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC5D0;&#xC11C; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; <code>calc.exe</code>&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; code execution&#xC744; &#xC2DC;&#xC5F0;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%205.png" srcset="/img/loading.gif" alt="Untitled"></p>
<h3 id="&#xC608;&#xC0C1;&#xCE58;-&#xBABB;&#xD55C;-&#xACBD;&#xB85C;&#xC5D0;&#xC11C;-&#xB85C;&#xB4DC;&#xB418;&#xB294;-&#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;-&#xC0AC;&#xC6A9;"><a href="#&#xC608;&#xC0C1;&#xCE58;-&#xBABB;&#xD55C;-&#xACBD;&#xB85C;&#xC5D0;&#xC11C;-&#xB85C;&#xB4DC;&#xB418;&#xB294;-&#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;-&#xC0AC;&#xC6A9;" class="headerlink" title="&#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD55C; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC0AC;&#xC6A9;"></a>&#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD55C; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC0AC;&#xC6A9;</h3><p>&#xACBD;&#xC6B0;&#xC5D0; &#xB530;&#xB77C; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; Windows &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xC704;&#xCE58;&#xC5D0;&#xC11C; &#xB85C;&#xB4DC;&#xB41C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xB3C4; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xB2E4;&#xC74C;&#xC740; <code>C:\CMU\bin\sasl2</code> &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC2DC;&#xB3C4;&#xD558;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xB85C;&#xADF8;&#xC774;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%206.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF4;&#xBA74; &#xC774; &#xC561;&#xC138;&#xC2A4;&#xAC00; <code>libsasl.dll</code> &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xC758;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xB418;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%207.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p><code>libsasl.dll</code>&#xC5D0; &#xB300;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74; <strong>[C:\CMU\bin\sasl2</strong> &#xACBD;&#xB85C;&#xC5D0; &#xB300;&#xD55C; &#xD558;&#xB4DC; &#xCF54;&#xB529;&#xB41C; &#xCC38;&#xC870;&#xB97C;](<a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117">https://github.com/cyrusimap/cyrus-sasl/blob/eeb935a9198172aede242c77b0e0dafe9312db10/win32/include/config.h#L117</a>)  &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xAC70;&#xAE30;&#xC5D0; &#xC6D0;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xBC30;&#xCE58;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xBAA8;&#xB4E0; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC5D0;&#xC11C; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; <code>calc.exe</code>&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%208.png" srcset="/img/loading.gif" alt="Untitled"></p>
<h3 id="&#xAC1C;&#xBC1C;&#xC790;-&#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xB9CC;-&#xC874;&#xC7AC;&#xD558;&#xB294;-&#xACBD;&#xB85C;-&#xC0AC;&#xC6A9;"><a href="#&#xAC1C;&#xBC1C;&#xC790;-&#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xB9CC;-&#xC874;&#xC7AC;&#xD558;&#xB294;-&#xACBD;&#xB85C;-&#xC0AC;&#xC6A9;" class="headerlink" title="&#xAC1C;&#xBC1C;&#xC790; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xB9CC; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACBD;&#xB85C; &#xC0AC;&#xC6A9;"></a>&#xAC1C;&#xBC1C;&#xC790; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xB9CC; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACBD;&#xB85C; &#xC0AC;&#xC6A9;</h3><p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xB9CC; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACBD;&#xB85C;&#xC5D0; &#xB300;&#xD55C; &#xCC38;&#xC870;&#xB97C; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD574;&#xB2F9; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xAC00; &#xC5C6;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC81C;&#xB300;&#xB85C; &#xC791;&#xB3D9;&#xD558;&#xACE0; &#xB204;&#xAD70;&#xAC00;&#xAC00; &#xCC3E;&#xC9C0; &#xC54A;&#xB294; &#xD55C; &#xC774; &#xC18D;&#xC131;&#xC740; &#xBC1C;&#xACAC;&#xB418;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC774; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; <code>C:\Qt\</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC5D0;&#xC11C; <code>plugins</code> &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xCC3E;&#xB294;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%209.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xBA87; &#xAC00;&#xC9C0; &#xB2E8;&#xACC4;&#xB97C; &#xAC74;&#xB108;&#xB6F8; &#xAC83;&#xC774;&#xC9C0;&#xB9CC; &#xC801;&#xC808;&#xD55C; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xBC30;&#xCE58;&#xD574; code execution&#xC744; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2010.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>Qt &#xAC1C;&#xBC1C; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xC790;&#xC138;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC774;&#xB7EC;&#xD55C; &#xC720;&#xD615;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC798; &#xC54C;&#xB824;&#xC9C4; &#xBB38;&#xC81C;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; 5&#xB144; &#xC804;&#xC5D0; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC; CVE&#xB97C; &#xBC1B;&#xC9C0; &#xBABB;&#xD588;&#xC73C;&#xBA70; &#xD574;&#xB2F9; &#xD328;&#xCE58;&#xAC00; &#xB3C4;&#xC785;&#xB418;&#xAE30; &#xC774;&#xC804;&#xC758; Qt &#xBC84;&#xC804;&#xC73C;&#xB85C; &#xAD6C;&#xCD95;&#xB418;&#xC5C8;&#xAC70;&#xB098; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; <code>Qt5core.dll</code>&#xC5D0; &#xC800;&#xC7A5;&#xB41C; <code>qt_prfxpath</code> &#xAC12;&#xC744; &#xD328;&#xCE58;&#xD558;&#xAE30; &#xC704;&#xD574; <code>windeployqt</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC5D0; &#xCDE8;&#xC57D;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="&#xC0AC;&#xC6A9;-&#xC911;&#xC778;-&#xACBD;&#xB85C;&#xC5D0;-&#xC608;&#xAE30;&#xCE58;-&#xC54A;&#xC740;-ACL&#xC774;-&#xC801;&#xC6A9;&#xB428;"><a href="#&#xC0AC;&#xC6A9;-&#xC911;&#xC778;-&#xACBD;&#xB85C;&#xC5D0;-&#xC608;&#xAE30;&#xCE58;-&#xC54A;&#xC740;-ACL&#xC774;-&#xC801;&#xC6A9;&#xB428;" class="headerlink" title="&#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xACBD;&#xB85C;&#xC5D0; &#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; ACL&#xC774; &#xC801;&#xC6A9;&#xB428;"></a>&#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xACBD;&#xB85C;&#xC5D0; &#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; ACL&#xC774; &#xC801;&#xC6A9;&#xB428;</h2><p>&#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC608;&#xAE30;&#xCE58; &#xC54A;&#xC740; &#xACBD;&#xB85C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xC0AC;&#xC2E4; &#xB2E8;&#xC21C;&#xD55C; &#xACF3;&#xC5D0; &#xC6D0;&#xC778;&#xC774; &#xC788;&#xB2E4;. &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB294; Windows &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;&#xC11C; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;. ACL&#xC744; &#xC801;&#xC808;&#xD558;&#xAC8C; &#xC124;&#xC815;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xCC3E;&#xC73C;&#xB824;&#xBA74; &#xC870;&#xAE08; &#xB354; &#xC870;&#xC0AC;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</p>
<p>Windows &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xB300;&#xBD80;&#xBD84;&#xC758; ACL &#xBB38;&#xC81C;&#xB294; &#xD55C; &#xAC00;&#xC9C0; &#xAC1C;&#xB150;&#xACFC; &#xAD00;&#xB828;&#xC774; &#xC788;&#xB2E4;.<br><code>C:\Program Files\</code> &#xB610;&#xB294; <code>C:\Program Files (x86)\</code>&#xC758; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xC0C1;&#xC18D;&#xC744; &#xD1B5;&#xD574; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBCF4;&#xC548; ACL&#xC744; &#xAC16;&#xB294;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; <code>C:\Program Files\WD\</code>&#xC5D0; &#xC124;&#xCE58;&#xD558;&#xB294; &#xACBD;&#xC6B0;, &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>C:\Program Files\</code>&#xC758; &#xC0C1;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC4F8; &#xC218; &#xC5C6;&#xACE0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>WD</code> &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xAC00; &#xC0C1;&#xC704; &#xAD8C;&#xD55C;&#xC744; &#xC0C1;&#xC18D;&#xD558;&#xBBC0;&#xB85C; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>WD</code> &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC5C6;&#xB2E4;.</p>
<h3 id="ACL&#xC744;-&#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C;-&#xC124;&#xC815;&#xD558;&#xC9C0;-&#xC54A;&#xACE0;-C-ProgramData-&#xB514;&#xB809;&#xD1A0;&#xB9AC;-&#xC0AC;&#xC6A9;"><a href="#ACL&#xC744;-&#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C;-&#xC124;&#xC815;&#xD558;&#xC9C0;-&#xC54A;&#xACE0;-C-ProgramData-&#xB514;&#xB809;&#xD1A0;&#xB9AC;-&#xC0AC;&#xC6A9;" class="headerlink" title="ACL&#xC744; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD558;&#xC9C0; &#xC54A;&#xACE0; C:\ProgramData\ &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC0AC;&#xC6A9;"></a>ACL&#xC744; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD558;&#xC9C0; &#xC54A;&#xACE0; C:\ProgramData\ &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC0AC;&#xC6A9;</h3><p><code>ProgramData</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB294; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xC0C1;&#xC2B9;&#xB41C; &#xAD8C;&#xD55C; &#xC5C6;&#xC774; &#xC4F8; &#xC218; &#xC788;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>ProgramData</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xC0DD;&#xC131;&#xB41C; &#xBAA8;&#xB4E0; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC4F8; &#xC218; &#xC788;&#xB2E4;. &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; <code>ProgramData</code> &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB530;&#xB77C; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xB300;&#xD55C; ACL&#xC774; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774; &#xAC00;&#xB2A5;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; <code>C:\ProgramData\</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xBA70; &#xC608;&#xC57D;&#xB41C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xAC00; &#xC788;&#xB294; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2011.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774;&#xAC83;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC758; &#xB290;&#xC2A8;&#xD55C; ACL&#xB85C; &#xC778;&#xD574; &#xAC00;&#xB2A5;&#xD55C; DLL hijacking&#xC758; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xC0AC;&#xB840;&#xC774;&#xB2E4;. </p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2012.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774;&#xC81C; &#xC9C1;&#xC811; &#xC81C;&#xC791;&#xD55C; <code>calc.exe</code>&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; <code>msi.dll</code>&#xC744; &#xBC30;&#xCE58;&#xD558;&#xBA74; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; SYSTEM &#xAD8C;&#xD55C;&#xC758; <code>calc.exe</code> &#xAC00; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB294; &#xB9CC;&#xC5F0;&#xD558;&#xBA70; &#xC545;&#xC6A9;&#xD558;&#xAE30;&#xAC00; &#xC27D;&#xB2E4;.</p>
<p>DLL hijacking&#xC774; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xC704;&#xD55C; &#xC720;&#xC77C;&#xD55C; &#xC635;&#xC158;&#xC774; &#xC544;&#xB2C8;&#xB77C;&#xB294; &#xC810;&#xC740; &#xC8FC;&#xBAA9;&#xD560; &#xB9CC; &#xD558;&#xB2E4;. &#xAD8C;&#xD55C; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xC0AC;&#xC6A9;&#xC790; &#xC4F0;&#xAE30; &#xAC00;&#xB2A5; &#xD30C;&#xC77C;&#xC740; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xCDE8;&#xC57D;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB2E4;&#xC74C;&#xC740; &#xAD8C;&#xD55C; &#xC788;&#xB294; &#xC790;&#xB3D9; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC9C0;&#xC2DC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xB2E4;. &#xC544;&#xB798;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4EF;&#xC774; &#xC870;&#xC791;&#xB41C; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xC784;&#xC758;&#xC758; &#xBA85;&#xB839;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xACE0; &#xC0AC;&#xC9C4;&#xC758; &#xACBD;&#xC6B0; <code>calc.exe</code>&#xB97C; &#xC2DC;&#xC791;&#xD55C;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2013.png" srcset="/img/loading.gif" alt="Untitled"></p>
<h3 id="&#xC2DC;&#xC2A4;&#xD15C;-&#xB8E8;&#xD2B8;&#xC758;-&#xD558;&#xC704;-&#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;-&#xC124;&#xCE58;"><a href="#&#xC2DC;&#xC2A4;&#xD15C;-&#xB8E8;&#xD2B8;&#xC758;-&#xD558;&#xC704;-&#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;-&#xC124;&#xCE58;" class="headerlink" title="&#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8;&#xC758; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xC124;&#xCE58;"></a>&#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8;&#xC758; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xC124;&#xCE58;</h3><p>&#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8;&#xC758; &#xB2E4;&#xB978; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xBC30;&#xCE58;&#xD558;&#xB294; &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xBCF4;&#xC548;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC801;&#xC808;&#xD55C; ACL&#xC744; &#xC124;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; Python 2.7&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>C:\python27\</code>&#xC5D0; &#xC124;&#xCE58;&#xB41C;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2014.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC758; &#xAE30;&#xBCF8; ACL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xC81C; &#xC774;&#xAC83;&#xC73C;&#xB85C; DLL hijacking &#xAE30;&#xC220;&#xC744; &#xC2DC;&#xB3C4;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2015.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774;&#xB294; &#xC5B4;&#xB835;&#xAC8C; &#xC0DD;&#xAC01;&#xD560; &#xD544;&#xC694;&#xB3C4; &#xC5C6;&#xB2E4;. &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB85C; <code>C:\python27\</code> &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC758; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2016.png" srcset="/img/loading.gif" alt="Untitled"></p>
<h3 id="ACL-&#xC124;&#xC815;-&#xC5C6;&#xC774;-&#xC0AC;&#xC6A9;&#xC790;-&#xC9C0;&#xC815;-&#xC124;&#xCE58;-&#xB514;&#xB809;&#xD1A0;&#xB9AC;-&#xD5C8;&#xC6A9;"><a href="#ACL-&#xC124;&#xC815;-&#xC5C6;&#xC774;-&#xC0AC;&#xC6A9;&#xC790;-&#xC9C0;&#xC815;-&#xC124;&#xCE58;-&#xB514;&#xB809;&#xD1A0;&#xB9AC;-&#xD5C8;&#xC6A9;" class="headerlink" title="ACL &#xC124;&#xC815; &#xC5C6;&#xC774; &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; &#xC124;&#xCE58; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xD5C8;&#xC6A9;"></a>ACL &#xC124;&#xC815; &#xC5C6;&#xC774; &#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815; &#xC124;&#xCE58; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xD5C8;&#xC6A9;</h3><p>&#xB9CE;&#xC740; &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; <code>C:\Program Files\</code>&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xBCF4;&#xC548; ACL &#xC0C1;&#xC18D;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC548;&#xC804;&#xD558;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC790;&#xC2E0;&#xC758; &#xC124;&#xCE58; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xB300;&#xC0C1; &#xC704;&#xCE58;&#xC5D0; ACL&#xC744; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xD14C;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; ACL&#xC744; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB294; &#xB9E4;&#xC6B0; &#xB4DC;&#xBB3C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; Microsoft SQL Server 2019 &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2017.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#x201C;&#xACE0;&#xAE09;&#x201D; &#xB610;&#xB294; &#x201C;&#xC0AC;&#xC6A9;&#xC790; &#xC9C0;&#xC815;&#x201D; &#xC124;&#xCE58;&#xB97C; &#xC218;&#xD589;&#xD560; &#xD544;&#xC694;&#xB3C4; &#xC5C6;&#xC774; &#xC124;&#xCE58; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC6D0;&#xD558;&#xB294; &#xACBD;&#xB85C;&#xB97C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>
<p>&#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; ACL&#xC744; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB85C; &#xC124;&#xC815;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2018.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>SQL Express 2019&#xAC00; &#xC124;&#xCE58;&#xB41C; &#xC704;&#xCE58;&#xB97C; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2019.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>Microsoft SQL Server 2019&#xC640; &#xAC19;&#xC774; &#xC124;&#xCE58;&#xD560; &#xC704;&#xCE58;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC70;&#xC758; &#xBAA8;&#xB4E0; Windows &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xB2E8;&#xC21C;&#xD788; &#xC124;&#xCE58;&#xB41C; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xB530;&#xB77C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC5D0; &#xCDE8;&#xC57D;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC744; &#xBCF4;&#xC5EC;&#xC900;&#xB2E4;.</p>
<h1 id="&#xAD8C;&#xD55C;-&#xC0C1;&#xC2B9;-&#xCDE8;&#xC57D;&#xC810;-&#xBC29;&#xC5B4;"><a href="#&#xAD8C;&#xD55C;-&#xC0C1;&#xC2B9;-&#xCDE8;&#xC57D;&#xC810;-&#xBC29;&#xC5B4;" class="headerlink" title="&#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810; &#xBC29;&#xC5B4;"></a>&#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810; &#xBC29;&#xC5B4;</h1><h2 id="&#xAD8C;&#xD55C;-&#xC5C6;&#xB294;-&#xC0AC;&#xC6A9;&#xC790;&#xC758;-&#xC2DC;&#xC2A4;&#xD15C;-&#xB8E8;&#xD2B8;&#xC5D0;&#xC11C;-&#x201C;&#xD3F4;&#xB354;-&#xB9CC;&#xB4E4;&#xAE30;&#x201D;-&#xAD8C;&#xD55C;-&#xC81C;&#xAC70;"><a href="#&#xAD8C;&#xD55C;-&#xC5C6;&#xB294;-&#xC0AC;&#xC6A9;&#xC790;&#xC758;-&#xC2DC;&#xC2A4;&#xD15C;-&#xB8E8;&#xD2B8;&#xC5D0;&#xC11C;-&#x201C;&#xD3F4;&#xB354;-&#xB9CC;&#xB4E4;&#xAE30;&#x201D;-&#xAD8C;&#xD55C;-&#xC81C;&#xAC70;" class="headerlink" title="&#xAD8C;&#xD55C; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8;&#xC5D0;&#xC11C; &#x201C;&#xD3F4;&#xB354; &#xB9CC;&#xB4E4;&#xAE30;&#x201D; &#xAD8C;&#xD55C; &#xC81C;&#xAC70;"></a>&#xAD8C;&#xD55C; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8;&#xC5D0;&#xC11C; &#x201C;&#xD3F4;&#xB354; &#xB9CC;&#xB4E4;&#xAE30;&#x201D; &#xAD8C;&#xD55C; &#xC81C;&#xAC70;</h2><p>&#xC704;&#xC5D0; &#xC124;&#xBA85;&#xB41C; &#xACF5;&#xACA9;&#xC5D0; &#xB300;&#xD55C; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xC5B4;&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0;&#xC11C; &#xD3F4;&#xB354;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p><img src="/2021/08/18/l0ch/procmon-lpe/Untitled%2020.png" srcset="/img/loading.gif" alt="Untitled"></p>
<h2 id="C-Program-Files-&#xC678;&#xBD80;&#xC5D0;-&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;-&#xC124;&#xCE58;&#xD558;&#xC9C0;-&#xC54A;&#xAE30;"><a href="#C-Program-Files-&#xC678;&#xBD80;&#xC5D0;-&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;-&#xC124;&#xCE58;&#xD558;&#xC9C0;-&#xC54A;&#xAE30;" class="headerlink" title="C:\Program Files\ &#xC678;&#xBD80;&#xC5D0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC124;&#xCE58;&#xD558;&#xC9C0; &#xC54A;&#xAE30;"></a>C:\Program Files\ &#xC678;&#xBD80;&#xC5D0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC124;&#xCE58;&#xD558;&#xC9C0; &#xC54A;&#xAE30;</h2><p>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; <code>C:\Program Files\</code> &#xB610;&#xB294; <code>C:\Program Files (x86)\</code> &#xC774;&#xC678;&#xC758; &#xC704;&#xCE58;&#xC5D0; &#xC124;&#xCE58;&#xB41C; &#xACBD;&#xC6B0;  ACL&#xC744; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC548;&#xC804;&#xD558;&#xB2E4;. &#xAD8C;&#xC7A5;&#xB418;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC704;&#xCE58;&#xC5D0;&#xB9CC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD53C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="&#xC2DC;&#xC2A4;&#xD15C;-&#xD14C;&#xC2A4;&#xD2B8;-&#xBC0F;-&#xAC15;&#xD654;"><a href="#&#xC2DC;&#xC2A4;&#xD15C;-&#xD14C;&#xC2A4;&#xD2B8;-&#xBC0F;-&#xAC15;&#xD654;" class="headerlink" title="&#xC2DC;&#xC2A4;&#xD15C; &#xD14C;&#xC2A4;&#xD2B8; &#xBC0F; &#xAC15;&#xD654;"></a>&#xC2DC;&#xC2A4;&#xD15C; &#xD14C;&#xC2A4;&#xD2B8; &#xBC0F; &#xAC15;&#xD654;</h2><p>&#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB2C8;&#xD130; &#xD544;&#xD130; &#xBC0F; &#xAE30;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC131;&#xC5D0; &#xB300;&#xD574; &#xC790;&#xCCB4; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xD14C;&#xC2A4;&#xD2B8;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC548;&#xC804;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB41C; &#xD30C;&#xC77C; &#xC704;&#xCE58;&#xC758; &#xACBD;&#xC6B0; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD574;&#xB2F9; &#xC704;&#xCE58;&#xB97C; &#xC218;&#xC815;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xD574;&#xB2F9; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xC7A0;&#xAE00; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xBC1C;&#xACAC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xACBD;&#xC6B0; &#xD574;&#xB2F9; &#xACF5;&#xAE09;&#xC5C5;&#xCCB4;&#xC5D0; &#xC5F0;&#xB77D;&#xD574; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC54C;&#xB9AC;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xB2E4;. &#xACF5;&#xAE09;&#xC5C5;&#xCCB4;&#xC640;&#xC758; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0; CERT/CC&#xAC00; &#xC9C0;&#xC6D0;&#xC744; &#xC81C;&#xACF5; &#xD560; &#xC218; &#xC788;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/lpe/">lpe</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/vulnerability/">vulnerability</a>
                  
                  <a class="hover-with-bg" href="/tags/translation/">translation</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/08/20/j0ker/2021-08-20/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[]  CVE-2021-22123 : Fortinet FortiWeb OS Command Injection</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/08/17/l0ch/2021-08-17/">
                    <span class="hidden-mobile">[] CVE-2021-30517: Chrome V8  Type Confusion </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/08/18/l0ch/procmon-lpe/';
        this.page.identifier = '/2021/08/18/l0ch/procmon-lpe/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Process Monitor Windows    &nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
