

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;What-is-Kerberos&#34;&gt;&lt;a href=&#34;#What-is-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;What is Kerberos!&#34;&gt;&lt;/a&gt;What is Kerberos!&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xC774;&amp;#xB984;&amp;#xB9CC; &amp;#xB4E4;&amp;#xC5B4;&amp;#xB3C4; &amp;#xBB34;&amp;#xC2DC;&amp;#xBB34;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC;&amp;#xC744; &amp;#xCE6D;&amp;#xD558;&amp;#xB294; &amp;#xCF00;&amp;#xB974;&amp;#xBCA0;&amp;#xB85C;&amp;#xC2A4;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB294; K&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; C&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; Cerberus&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Kerberos&amp;#xB294; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC; Cerberus&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xB798;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &amp;#xC704;&amp;#xD0A4; &amp;#xBC31;&amp;#xACFC;&amp;#xC5D0; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xC758;&amp;#xBD80;&amp;#xD130; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCEE4;&amp;#xBC84;&amp;#xB85C;&amp;#xC2A4;(Kerberos)&amp;#xB294; &amp;#x201C;&amp;#xD2F0;&amp;#xCF13;&amp;#x201D;(ticket)&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xC99D; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C;&amp;#xC11C; &amp;#xBE44;&amp;#xBCF4;&amp;#xC548; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC548; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xB178;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; Kerberos&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kerberos&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC11C;&amp;#xBC84; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; MIT&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC11C;&amp;#xB85C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD638;&amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Kerberos&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB418;&amp;#xACE0; &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; TTP(Trust Third Party)&amp;#xB97C; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; Kerberos&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; KDC&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC11;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C1;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC77C;&amp;#xB2E8;&amp;#xC740; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; Kerberos&amp;#xC758; &amp;#xC815;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xAC01; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Structure-of-Kerberos&#34;&gt;&lt;a href=&#34;#Structure-of-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;Structure of Kerberos&#34;&gt;&lt;/a&gt;Structure of Kerberos&lt;/h2&gt;&lt;p&gt;Kerberos&amp;#xB294; 3&amp;#xAC1C;&amp;#xC758; &amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xB9CC;&amp;#xD07C; Client, KDC(Key Distribution Center), Service Server 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4;, Authentication Server&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xB450;&amp;#xC5B4;&amp;#xC11C; &amp;#xC778;&amp;#xC99D;&amp;#xACFC; &amp;#xD0A4; &amp;#xBC30;&amp;#xBD84;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; Kerberos &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD574; &amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; Service Server&amp;#xB294; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0; Client&amp;#xB294; &amp;#xC774; Network Service&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xC774;&amp;#xACE0; KDC&amp;#xB294; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Kerberos-KDC-Key-Distribution-Center&#34;&gt;&lt;a href=&#34;#Kerberos-KDC-Key-Distribution-Center&#34; class=&#34;headerlink&#34; title=&#34;Kerberos KDC(Key Distribution Center)&#34;&gt;&lt;/a&gt;Kerberos KDC(Key Distribution Center)&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xACE0; &amp;#xD575;&amp;#xC2EC;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC778; Kerberos KDC&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C;&amp;#xC368;, AS(Authentication Service)&amp;#xC640; TGS(Ticket Granting Service)&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TGS&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; TGS(Ticket Granting Server)&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD88;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Flow-of-Kerberos&#34;&gt;&lt;a href=&#34;#Flow-of-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;Flow of Kerberos&#34;&gt;&lt;/a&gt;Flow of Kerberos&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2022/02/04/poosic/kerberos/image1.png&#34; alt=&#34;Untitled.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;Kerberos&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCC98;&amp;#xC74C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; id&amp;#xC640; pw&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xD6C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xC5B4; &amp;#xC554;&amp;#xD638;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xD6C4; Client&amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; KDC&amp;#xC758; AS&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; id&amp;#xC640; pw&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xACE0; KDC&amp;#xC758; AS&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825; id&amp;#xB97C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xD68C;&amp;#xD574; &amp;#xC785;&amp;#xB825;&amp;#xD55C; pw&amp;#xC640; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Client &amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; AS&amp;#xB294; Client&amp;#xC5D0;&amp;#xAC8C; KDC&amp;#xC758; Secret Key&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;TGT(Ticket to Get Ticket)&lt;/code&gt;&amp;#xC640; &amp;#xC554;&amp;#xD638; &amp;#xD574;&amp;#xC2DC;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;Session Key&lt;/code&gt;&amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Client&amp;#xB294; KDC&amp;#xC758; AS&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC740; &lt;code&gt;TGT&lt;/code&gt;&amp;#xB97C; KDC&amp;#xC758; TGS&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; TGS&amp;#xB294; &lt;code&gt;Secret Key&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; TGT&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xD55C; &amp;#xB4A4; Client &amp;#xCE21;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; Client&amp;#xC640; Service Server &amp;#xBAA8;&amp;#xB450;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xACFC; &lt;code&gt;TGS Session Key&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xB2E4;&amp;#xC74C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xACFC; &lt;code&gt;TGS Session Key&lt;/code&gt;&amp;#xB97C; Client&amp;#xAC00; &amp;#xC804;&amp;#xB2EC; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0; Client&amp;#xB294; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xC744; Service Server&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Servcie Server&amp;#xC740; KDC&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xC758; &lt;code&gt;timestamp&lt;/code&gt;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD574; Client&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;timstamp&lt;/code&gt;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xC138;&amp;#xC158;&amp;#xC774; &amp;#xD615;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[해키피디아] Kerberos - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;What-is-Kerberos&#34;&gt;&lt;a href=&#34;#What-is-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;What is Kerberos!&#34;&gt;&lt;/a&gt;What is Kerberos!&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xC774;&amp;#xB984;&amp;#xB9CC; &amp;#xB4E4;&amp;#xC5B4;&amp;#xB3C4; &amp;#xBB34;&amp;#xC2DC;&amp;#xBB34;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC;&amp;#xC744; &amp;#xCE6D;&amp;#xD558;&amp;#xB294; &amp;#xCF00;&amp;#xB974;&amp;#xBCA0;&amp;#xB85C;&amp;#xC2A4;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB294; K&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; C&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; Cerberus&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Kerberos&amp;#xB294; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC; Cerberus&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xB798;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; &amp;#xC704;&amp;#xD0A4; &amp;#xBC31;&amp;#xACFC;&amp;#xC5D0; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xC758;&amp;#xBD80;&amp;#xD130; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCEE4;&amp;#xBC84;&amp;#xB85C;&amp;#xC2A4;(Kerberos)&amp;#xB294; &amp;#x201C;&amp;#xD2F0;&amp;#xCF13;&amp;#x201D;(ticket)&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xC99D; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C;&amp;#xC11C; &amp;#xBE44;&amp;#xBCF4;&amp;#xC548; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC548; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xB178;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; Kerberos&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBCF4;&amp;#xC548; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kerberos&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC11C;&amp;#xBC84; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; MIT&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC11C;&amp;#xB85C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC0C1;&amp;#xD638;&amp;#xC778;&amp;#xC99D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Kerberos&amp;#xB294; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB418;&amp;#xACE0; &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; TTP(Trust Third Party)&amp;#xB97C; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; Kerberos&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; KDC&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC11;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C1;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC77C;&amp;#xB2E8;&amp;#xC740; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; Kerberos&amp;#xC758; &amp;#xC815;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xAC01; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Structure-of-Kerberos&#34;&gt;&lt;a href=&#34;#Structure-of-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;Structure of Kerberos&#34;&gt;&lt;/a&gt;Structure of Kerberos&lt;/h2&gt;&lt;p&gt;Kerberos&amp;#xB294; 3&amp;#xAC1C;&amp;#xC758; &amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC9C0;&amp;#xC625;&amp;#xACAC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xB9CC;&amp;#xD07C; Client, KDC(Key Distribution Center), Service Server 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4;, Authentication Server&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xB450;&amp;#xC5B4;&amp;#xC11C; &amp;#xC778;&amp;#xC99D;&amp;#xACFC; &amp;#xD0A4; &amp;#xBC30;&amp;#xBD84;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; Kerberos &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD574; &amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; Service Server&amp;#xB294; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0; Client&amp;#xB294; &amp;#xC774; Network Service&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xC774;&amp;#xACE0; KDC&amp;#xB294; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Kerberos-KDC-Key-Distribution-Center&#34;&gt;&lt;a href=&#34;#Kerberos-KDC-Key-Distribution-Center&#34; class=&#34;headerlink&#34; title=&#34;Kerberos KDC(Key Distribution Center)&#34;&gt;&lt;/a&gt;Kerberos KDC(Key Distribution Center)&lt;/h3&gt;&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xACE0; &amp;#xD575;&amp;#xC2EC;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xC778; Kerberos KDC&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C;&amp;#xC368;, AS(Authentication Service)&amp;#xC640; TGS(Ticket Granting Service)&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TGS&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; TGS(Ticket Granting Server)&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD88;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Flow-of-Kerberos&#34;&gt;&lt;a href=&#34;#Flow-of-Kerberos&#34; class=&#34;headerlink&#34; title=&#34;Flow of Kerberos&#34;&gt;&lt;/a&gt;Flow of Kerberos&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2022/02/04/poosic/kerberos/image1.png&#34; alt=&#34;Untitled.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;Kerberos&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCC98;&amp;#xC74C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; id&amp;#xC640; pw&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xD6C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xC5B4; &amp;#xC554;&amp;#xD638;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xD6C4; Client&amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; KDC&amp;#xC758; AS&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; id&amp;#xC640; pw&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xACE0; KDC&amp;#xC758; AS&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825; id&amp;#xB97C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xD68C;&amp;#xD574; &amp;#xC785;&amp;#xB825;&amp;#xD55C; pw&amp;#xC640; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Client &amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; AS&amp;#xB294; Client&amp;#xC5D0;&amp;#xAC8C; KDC&amp;#xC758; Secret Key&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;TGT(Ticket to Get Ticket)&lt;/code&gt;&amp;#xC640; &amp;#xC554;&amp;#xD638; &amp;#xD574;&amp;#xC2DC;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;Session Key&lt;/code&gt;&amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Client&amp;#xB294; KDC&amp;#xC758; AS&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC740; &lt;code&gt;TGT&lt;/code&gt;&amp;#xB97C; KDC&amp;#xC758; TGS&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; TGS&amp;#xB294; &lt;code&gt;Secret Key&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; TGT&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xD55C; &amp;#xB4A4; Client &amp;#xCE21;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; Client&amp;#xC640; Service Server &amp;#xBAA8;&amp;#xB450;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xACFC; &lt;code&gt;TGS Session Key&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xB2E4;&amp;#xC74C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xACFC; &lt;code&gt;TGS Session Key&lt;/code&gt;&amp;#xB97C; Client&amp;#xAC00; &amp;#xC804;&amp;#xB2EC; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0; Client&amp;#xB294; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xC744; Service Server&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Servcie Server&amp;#xC740; KDC&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;Client to Server Ticket&lt;/code&gt;&amp;#xC758; &lt;code&gt;timestamp&lt;/code&gt;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD574; Client&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &lt;code&gt;timstamp&lt;/code&gt;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xC138;&amp;#xC158;&amp;#xC774; &amp;#xD615;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/hackypedia.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2022/02/04/poosic/kerberos/">

  <title>[해키피디아] Kerberos - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2022-02-04 14:00" pubdate>
      2022년 2월 4일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      20
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[해키피디아] Kerberos</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="What-is-Kerberos"><a href="#What-is-Kerberos" class="headerlink" title="What is Kerberos!"></a>What is Kerberos!</h1><p>Kerberos &#xC774;&#xB984;&#xB9CC; &#xB4E4;&#xC5B4;&#xB3C4; &#xBB34;&#xC2DC;&#xBB34;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; &#xC9C0;&#xC625;&#xACAC;&#xC744; &#xCE6D;&#xD558;&#xB294; &#xCF00;&#xB974;&#xBCA0;&#xB85C;&#xC2A4;&#xC758; &#xC57D;&#xC790;&#xB294; K&#xAC00; &#xC544;&#xB2CC; C&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; Cerberus&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Kerberos&#xB294; &#xC9C0;&#xC625;&#xACAC; Cerberus&#xC5D0;&#xC11C; &#xC720;&#xB798;&#xD55C; &#xAC83;&#xC774; &#xB9DE;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; &#xC704;&#xD0A4; &#xBC31;&#xACFC;&#xC5D0; &#xB098;&#xC640; &#xC788;&#xB294; &#xC815;&#xC758;&#xBD80;&#xD130; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xCEE4;&#xBC84;&#xB85C;&#xC2A4;(Kerberos)&#xB294; &#x201C;&#xD2F0;&#xCF13;&#x201D;(ticket)&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xCEF4;&#xD4E8;&#xD130; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC778;&#xC99D; &#xC554;&#xD638;&#xD654; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB85C;&#xC11C; &#xBE44;&#xBCF4;&#xC548; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xD1B5;&#xC2E0;&#xD558;&#xB294; &#xB178;&#xB4DC;&#xAC00; &#xBCF4;&#xC548; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB2E4;&#xB978; &#xB178;&#xB4DC;&#xC5D0; &#xB300;&#xD574; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD5C8;&#xC6A9;&#xD55C;&#xB2E4;.</p>
</blockquote>
<p>&#xAC04;&#xB2E8;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74; Kerberos&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBCF4;&#xC548; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Kerberos&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC11C;&#xBC84; &#xBAA8;&#xB378;&#xC744; &#xBAA9;&#xC801;&#xC73C;&#xB85C; MIT&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xC640; &#xC11C;&#xBC84;&#xAC00; &#xC11C;&#xB85C; &#xC2DD;&#xBCC4;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xC0C1;&#xD638;&#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. Kerberos&#xB294; &#xB300;&#xCE6D;&#xD0A4; &#xC554;&#xD638;&#xB85C; &#xBE4C;&#xB4DC;&#xB418;&#xACE0; &#xC778;&#xC99D; &#xACFC;&#xC815;&#xC5D0;&#xC11C; TTP(Trust Third Party)&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC5ED;&#xD560;&#xC744; Kerberos&#xC5D0;&#xC11C;&#xB294; KDC&#xAC00; &#xB2F4;&#xB2F9;&#xD558;&#xC9C0;&#xB9CC; &#xBC11;&#xC5D0;&#xC11C; &#xC0C1;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACE0; &#xC77C;&#xB2E8;&#xC740; &#xB118;&#xC5B4;&#xAC00;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; Kerberos&#xC758; &#xC815;&#xCCB4;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC558;&#xC73C;&#xB2C8; &#xC5B4;&#xB5A4; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xACE0; &#xAC01; &#xAD6C;&#xC131;&#xC6D0; &#xC0AC;&#xC774;&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xD1B5;&#xC2E0;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Structure-of-Kerberos"><a href="#Structure-of-Kerberos" class="headerlink" title="Structure of Kerberos"></a>Structure of Kerberos</h2><p>Kerberos&#xB294; 3&#xAC1C;&#xC758; &#xBA38;&#xB9AC;&#xB97C; &#xAC00;&#xC9C4; &#xC9C0;&#xC625;&#xACAC;&#xC5D0;&#xC11C; &#xBAA8;&#xD2F0;&#xBE0C;&#xB97C; &#xAC00;&#xC838;&#xC628; &#xB9CC;&#xD07C; Client, KDC(Key Distribution Center), Service Server 3&#xAC00;&#xC9C0;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4;, Authentication Server&#xB97C; &#xB530;&#xB85C; &#xB450;&#xC5B4;&#xC11C; &#xC778;&#xC99D;&#xACFC; &#xD0A4; &#xBC30;&#xBD84;&#xC744; &#xB530;&#xB85C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xACBD;&#xC6B0; 4&#xAC00;&#xC9C0; &#xC774;&#xC9C0;&#xB9CC; &#xC77C;&#xBC18;&#xC801;&#xC778; 3&#xAC00;&#xC9C0; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xAC00;&#xC9C4; Kerberos &#xD615;&#xD0DC;&#xB85C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01; &#xAD6C;&#xC131;&#xC6D0;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD574; &#xB4DC;&#xB9AC;&#xC790;&#xBA74; Service Server&#xB294; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xACE0; Client&#xB294; &#xC774; Network Service&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xC720;&#xC800;&#xC774;&#xACE0; KDC&#xB294; &#xC778;&#xC99D;&#xC744; &#xC704;&#xD55C; &#xD0A4;&#xB97C; &#xBC1C;&#xAE09;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD574;&#xC8FC;&#xB294; &#xC11C;&#xBC84; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Kerberos-KDC-Key-Distribution-Center"><a href="#Kerberos-KDC-Key-Distribution-Center" class="headerlink" title="Kerberos KDC(Key Distribution Center)"></a>Kerberos KDC(Key Distribution Center)</h3><p>&#xAC00;&#xC7A5; &#xC0DD;&#xC18C;&#xD558;&#xACE0; &#xD575;&#xC2EC;&#xC774; &#xB418;&#xB294; &#xAD6C;&#xC131;&#xC6D0;&#xC778; Kerberos KDC&#xC5D0; &#xB300;&#xD574; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. KDC&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC758; &#xC77C;&#xBD80;&#xB85C;&#xC368;, AS(Authentication Service)&#xC640; TGS(Ticket Granting Service)&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. TGS&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; TGS(Ticket Granting Server)&#xB77C;&#xACE0;&#xB3C4; &#xBD88;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h3 id="Flow-of-Kerberos"><a href="#Flow-of-Kerberos" class="headerlink" title="Flow of Kerberos"></a>Flow of Kerberos</h3><p><img src="/2022/02/04/poosic/kerberos/image1.png" srcset="/img/loading.gif" alt="Untitled.jpg"></p>
<p>Kerberos&#xC758; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xD750;&#xB984;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xCC98;&#xC74C; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0; &#xB85C;&#xADF8;&#xC778; &#xD558;&#xAE30; &#xC704;&#xD574; id&#xC640; pw&#xB97C; &#xC785;&#xB825;&#xD558;&#xACE0; &#xC774;&#xD6C4; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xAC00; &#xB300;&#xCE6D;&#xD0A4;&#xB85C; &#xBCC0;&#xD658;&#xB418;&#xC5B4; &#xC554;&#xD638;&#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xD6C4; Client&#xCE21;&#xC5D0;&#xC11C; KDC&#xC758; AS&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; id&#xC640; pw&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xACE0; KDC&#xC758; AS&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC785;&#xB825; id&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xC870;&#xD68C;&#xD574; &#xC785;&#xB825;&#xD55C; pw&#xC640; &#xC77C;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Client &#xC778;&#xC99D;&#xC5D0; &#xC131;&#xACF5;&#xD560; &#xACBD;&#xC6B0; AS&#xB294; Client&#xC5D0;&#xAC8C; KDC&#xC758; Secret Key&#xB85C; &#xC554;&#xD638;&#xD654;&#xB41C; <code>TGT(Ticket to Get Ticket)</code>&#xC640; &#xC554;&#xD638; &#xD574;&#xC2DC;&#xB85C; &#xC554;&#xD638;&#xD654;&#xB41C; <code>Session Key</code>&#xB97C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>Client&#xB294; KDC&#xC758; AS&#xB85C;&#xBD80;&#xD130; &#xBC1C;&#xAE09;&#xBC1B;&#xC740; <code>TGT</code>&#xB97C; KDC&#xC758; TGS&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xACE0; TGS&#xB294; <code>Secret Key</code>&#xB97C; &#xD1B5;&#xD574; &#xC804;&#xB2EC;&#xBC1B;&#xC740; TGT&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD574; &#xC778;&#xC99D;&#xD55C; &#xB4A4; Client &#xCE21;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; Client&#xC640; Service Server &#xBAA8;&#xB450;&#xB97C; &#xC704;&#xD55C; <code>Client to Server Ticket</code>&#xACFC; <code>TGS Session Key</code>&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xADF8; &#xB2E4;&#xC74C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; <code>Client to Server Ticket</code>&#xACFC; <code>TGS Session Key</code>&#xB97C; Client&#xAC00; &#xC804;&#xB2EC; &#xBC1B;&#xAC8C; &#xB418;&#xACE0; Client&#xB294; <code>Client to Server Ticket</code>&#xC744; Service Server&#xB85C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Servcie Server&#xC740; KDC&#xB85C;&#xBD80;&#xD130; &#xBC1B;&#xC740; &#xD0A4;&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>Client to Server Ticket</code>&#xC758; <code>timestamp</code>&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD574; Client&#xC5D0;&#xAC8C; &#xC804;&#xB2EC;&#xD558;&#xACE0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBCF5;&#xD638;&#xD654;&#xB41C; <code>timstamp</code>&#xB97C; &#xBC1B;&#xC558;&#xC744; &#xACBD;&#xC6B0; &#xC138;&#xC158;&#xC774; &#xD615;&#xC131;&#xB418;&#xC5B4; &#xD1B5;&#xC2E0;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
</ol>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Hackypedia/">Hackypedia</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/kerberos/">kerberos</a>
                  
                  <a class="hover-with-bg" href="/tags/poosic/">poosic</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_poosic.jpg" srcset="/img/loading.gif" alt="poosic">
                  </div>

                  <div class="link-text">
                    <div class="link-title">poosic</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/poosic">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2022/02/05/idioth/2022-02-05/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-44790: Apache에서 발견된 integer underflow 코드 실행 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2022/02/03/l0ch/2022-02-03/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-44142: Samba 데몬 smbd의 코드 실행 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2022/02/04/poosic/kerberos/';
        this.page.identifier = '/2022/02/04/poosic/kerberos/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[해키피디아] Kerberos&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
