

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html&#34;&gt;https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;7-Zip &amp;lt; 24.09&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;2024&amp;#xB144; 9&amp;#xC6D4;, Trend ZDI &amp;#xC704;&amp;#xD611; &amp;#xD5CC;&amp;#xD305;&amp;#xD300;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2025-0411&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 7-Zip &amp;#xC555;&amp;#xCD95; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xAE30;&amp;#xAD00;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; SmokeLoader &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;-&amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xBD84;&amp;#xC7C1; &amp;#xC911;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC774; &amp;#xC804;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; homoglyph &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h3&gt;&lt;p&gt;Windows &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xCC98;&amp;#xB7FC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xB54C;, &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &lt;strong&gt;Mark-of-the-Web (MotW)&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &lt;strong&gt;&amp;#xCD9C;&amp;#xCC98; &amp;#xD45C;&amp;#xC2DC;&lt;/strong&gt;&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774; &amp;#xD45C;&amp;#xC2DC;&amp;#xB294; Windows&amp;#xC640; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xC5B4;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, MotW&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; Windows Defender SmartScreen&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; reputation&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xACBD;&amp;#xACE0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;code&gt;Zone.Identifier&lt;/code&gt; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Windows&amp;#xC5D0; &amp;#xC54C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; MotW &amp;#xD0DC;&amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294; Windows Defender SmartScreen &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xACE0;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774;(&amp;#xD30C;&amp;#xB780;&amp;#xBC15;&amp;#xC2A4;) MotW &amp;#xD0DC;&amp;#xADF8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD0DC;&amp;#xADF8;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xACBD;&amp;#xACE0; &amp;#xD31D;&amp;#xC5C5;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;Root-cause&#34;&gt;&lt;a href=&#34;#Root-cause&#34; class=&#34;headerlink&#34; title=&#34;Root cause&#34;&gt;&lt;/a&gt;Root cause&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; CVE-2025-0411 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; 7-Zip&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;strong&gt;&amp;#xC774;&amp;#xC911; &amp;#xC555;&amp;#xCD95;&lt;/strong&gt;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Windows&amp;#xB294; &amp;#xAC89;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB9CC; MotW &amp;#xD45C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xACE0;, &amp;#xADF8; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xB294; MotW &amp;#xD45C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;  &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC548;&amp;#xCABD; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC228;&amp;#xAE30;&amp;#xACE0;, &amp;#xAC89;&amp;#xCABD; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xD3EC;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; Windows&amp;#xC758; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC774;&amp;#xC911;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; 7-Zip&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xACE0; &amp;#xC548;&amp;#xCABD; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;, MotW &amp;#xACBD;&amp;#xACE0;&amp;#xB098; Windows Defender SmartScreen&amp;#xC758; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Proof-of-Concept&#34;&gt;&lt;a href=&#34;#Proof-of-Concept&#34; class=&#34;headerlink&#34; title=&#34;Proof of Concept&#34;&gt;&lt;/a&gt;Proof of Concept&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C; &amp;#xC548;&amp;#xC5D0; &amp;#xC911;&amp;#xCCA9;&amp;#xB41C; CVE-2025-0411&amp;#xC758; PoC &amp;#xB370;&amp;#xBAA8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; PoC&amp;#xC5D0;&amp;#xC11C; &amp;#xC911;&amp;#xCCA9;&amp;#xB41C; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;(poc.outer.zip\poc.inner.zip) &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &lt;code&gt;poc.bat&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB294; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBCF4;&amp;#xD638; &amp;#xBD80;&amp;#xC7AC;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; Windows Defender SmartScreen&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; reputation &amp;#xBC0F; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC555;&amp;#xCD95;&amp;#xD574;&amp;#xC81C; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xBA74;, &amp;#xACBD;&amp;#xACE0; &amp;#xD31D;&amp;#xC5C5;&amp;#xC774; &amp;#xB728;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xB2E8;&amp;#xCCB4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; SmokeLoader &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC744; &amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xC544; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xCCA8;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#x201C;Homoglyph &amp;#xACF5;&amp;#xACA9;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC704;&amp;#xC7A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;Homoglyph&lt;/code&gt; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xC2DC;&amp;#xAC01;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC18D;&amp;#xC774;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB098; &amp;#xD30C;&amp;#xC77C;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB3C4;&amp;#xB85D; &amp;#xC545;&amp;#xC131; &amp;#xCF58;&amp;#xD150;&amp;#xCE20;&amp;#xB97C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xD074;&amp;#xB9AD;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xB77C;&amp;#xD2F4; &amp;#xBB38;&amp;#xC790; &amp;#x201C;c&amp;#x201D; &amp;#xB300;&amp;#xC2E0; &amp;#xD0A4;&amp;#xB9B4; &amp;#xBB38;&amp;#xC790; &amp;#x201C;Es&amp;#x201D;(&amp;#x421; &amp;#xB610;&amp;#xB294; &amp;#x441;)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xB450; &amp;#xBB38;&amp;#xC790;&amp;#xB294; &amp;#xAC89;&amp;#xBCF4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;api-microsoft[.]com&amp;#x201D;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC18D;&amp;#xC544;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;(&amp;#xC544;&amp;#xC774;&amp;#xB514;, &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;)&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC&#34;&gt;https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://www.zerodayinitiative.com/advisories/ZDI-25-045/&#34;&gt;https://www.zerodayinitiative.com/advisories/ZDI-25-045/&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2025-0411&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2025-0411&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/&#34;&gt;https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] CVE-2025-0411 : 7-Zip의 Mark-of-the-Web (MotW) 우회로 인한 악성코드 감염 - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html&#34;&gt;https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;7-Zip &amp;lt; 24.09&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;2024&amp;#xB144; 9&amp;#xC6D4;, Trend ZDI &amp;#xC704;&amp;#xD611; &amp;#xD5CC;&amp;#xD305;&amp;#xD300;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; CVE-2025-0411&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 7-Zip &amp;#xC555;&amp;#xCD95; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xAE30;&amp;#xAD00;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; SmokeLoader &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;-&amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xBD84;&amp;#xC7C1; &amp;#xC911;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC774; &amp;#xC804;&amp;#xC220;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; homoglyph &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h3&gt;&lt;p&gt;Windows &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xCC98;&amp;#xB7FC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xB54C;, &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &lt;strong&gt;Mark-of-the-Web (MotW)&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &lt;strong&gt;&amp;#xCD9C;&amp;#xCC98; &amp;#xD45C;&amp;#xC2DC;&lt;/strong&gt;&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774; &amp;#xD45C;&amp;#xC2DC;&amp;#xB294; Windows&amp;#xC640; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xC5B4;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, MotW&amp;#xAC00; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; Windows Defender SmartScreen&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; reputation&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xACBD;&amp;#xACE0;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &lt;code&gt;Zone.Identifier&lt;/code&gt; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Windows&amp;#xC5D0; &amp;#xC54C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; MotW &amp;#xD0DC;&amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294; Windows Defender SmartScreen &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xACE0;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774;(&amp;#xD30C;&amp;#xB780;&amp;#xBC15;&amp;#xC2A4;) MotW &amp;#xD0DC;&amp;#xADF8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD0DC;&amp;#xADF8;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xACBD;&amp;#xACE0; &amp;#xD31D;&amp;#xC5C5;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;Root-cause&#34;&gt;&lt;a href=&#34;#Root-cause&#34; class=&#34;headerlink&#34; title=&#34;Root cause&#34;&gt;&lt;/a&gt;Root cause&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; CVE-2025-0411 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; 7-Zip&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;strong&gt;&amp;#xC774;&amp;#xC911; &amp;#xC555;&amp;#xCD95;&lt;/strong&gt;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Windows&amp;#xB294; &amp;#xAC89;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB9CC; MotW &amp;#xD45C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xACE0;, &amp;#xADF8; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xB294; MotW &amp;#xD45C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;  &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC548;&amp;#xCABD; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC228;&amp;#xAE30;&amp;#xACE0;, &amp;#xAC89;&amp;#xCABD; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xD3EC;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; Windows&amp;#xC758; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC774;&amp;#xC911;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; 7-Zip&amp;#xC73C;&amp;#xB85C; &amp;#xC5F4;&amp;#xACE0; &amp;#xC548;&amp;#xCABD; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;, MotW &amp;#xACBD;&amp;#xACE0;&amp;#xB098; Windows Defender SmartScreen&amp;#xC758; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Proof-of-Concept&#34;&gt;&lt;a href=&#34;#Proof-of-Concept&#34; class=&#34;headerlink&#34; title=&#34;Proof of Concept&#34;&gt;&lt;/a&gt;Proof of Concept&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C; &amp;#xC548;&amp;#xC5D0; &amp;#xC911;&amp;#xCCA9;&amp;#xB41C; CVE-2025-0411&amp;#xC758; PoC &amp;#xB370;&amp;#xBAA8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; PoC&amp;#xC5D0;&amp;#xC11C; &amp;#xC911;&amp;#xCCA9;&amp;#xB41C; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;(poc.outer.zip\poc.inner.zip) &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &lt;code&gt;poc.bat&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB294; MotW &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBCF4;&amp;#xD638; &amp;#xBD80;&amp;#xC7AC;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xAC10;&amp;#xC5FC; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; Windows Defender SmartScreen&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; reputation &amp;#xBC0F; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC555;&amp;#xCD95;&amp;#xD574;&amp;#xC81C; &amp;#xD6C4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xBA74;, &amp;#xACBD;&amp;#xACE0; &amp;#xD31D;&amp;#xC5C5;&amp;#xC774; &amp;#xB728;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/16/OUYA77/2025-04-16/image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xB2E8;&amp;#xCCB4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; SmokeLoader &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#xB41C; &amp;#xAC83;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC744; &amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xC544; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC545;&amp;#xC131; &amp;#xCCA8;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#x201C;Homoglyph &amp;#xACF5;&amp;#xACA9;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD30C;&amp;#xC77C; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC704;&amp;#xC7A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;Homoglyph&lt;/code&gt; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xC2DC;&amp;#xAC01;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC18D;&amp;#xC774;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB098; &amp;#xD30C;&amp;#xC77C;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB3C4;&amp;#xB85D; &amp;#xC545;&amp;#xC131; &amp;#xCF58;&amp;#xD150;&amp;#xCE20;&amp;#xB97C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xD074;&amp;#xB9AD;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C; &amp;#xB77C;&amp;#xD2F4; &amp;#xBB38;&amp;#xC790; &amp;#x201C;c&amp;#x201D; &amp;#xB300;&amp;#xC2E0; &amp;#xD0A4;&amp;#xB9B4; &amp;#xBB38;&amp;#xC790; &amp;#x201C;Es&amp;#x201D;(&amp;#x421; &amp;#xB610;&amp;#xB294; &amp;#x441;)&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xB450; &amp;#xBB38;&amp;#xC790;&amp;#xB294; &amp;#xAC89;&amp;#xBCF4;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;api-microsoft[.]com&amp;#x201D;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC18D;&amp;#xC544;&amp;#xC11C; &amp;#xAC1C;&amp;#xC778; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;(&amp;#xC544;&amp;#xC774;&amp;#xB514;, &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;)&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC&#34;&gt;https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://www.zerodayinitiative.com/advisories/ZDI-25-045/&#34;&gt;https://www.zerodayinitiative.com/advisories/ZDI-25-045/&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2025-0411&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2025-0411&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/&#34;&gt;https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/04/16/ouya77/2025-04-16/">

  <title>[하루한줄] CVE-2025-0411 : 7-Zip의 Mark-of-the-Web (MotW) 우회로 인한 악성코드 감염 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-04-16 19:00" pubdate>
      2025년 4월 16일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.3k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      26
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] CVE-2025-0411 : 7-Zip의 Mark-of-the-Web (MotW) 우회로 인한 악성코드 감염</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html">https://www.trendmicro.com/ko_kr/research/25/a/cve-2025-0411-ukrainian-organizations-targeted.html</a></p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>7-Zip &lt; 24.09</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>2024&#xB144; 9&#xC6D4;, Trend ZDI &#xC704;&#xD611; &#xD5CC;&#xD305;&#xD300;&#xC740; &#xC2E4;&#xC81C; &#xACF5;&#xACA9;&#xC5D0;&#xC11C; &#xC545;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB294; &#xC81C;&#xB85C;&#xB370;&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC778; CVE-2025-0411&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; 7-Zip &#xC555;&#xCD95; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098; &#xAE30;&#xAD00;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xB294; SmokeLoader &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xCEA0;&#xD398;&#xC778;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB7EC;&#xC2DC;&#xC544; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4; &#xADF8;&#xB8F9;&#xC774; &#xB7EC;&#xC2DC;&#xC544;-&#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098; &#xBD84;&#xC7C1; &#xC911;&#xC5D0; &#xC0AC;&#xC774;&#xBC84; &#xC2A4;&#xD30C;&#xC774; &#xD65C;&#xB3D9;&#xC744; &#xC704;&#xD574; &#xC774; &#xC804;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC73C;&#xBA70;, &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC190;&#xC0C1;&#xB41C; &#xC774;&#xBA54;&#xC77C; &#xACC4;&#xC815;&#xACFC; homoglyph &#xACF5;&#xACA9;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xCD94;&#xC815;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="Background"><a href="#Background" class="headerlink" title="Background"></a>Background</h3><p>Windows &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC778;&#xD130;&#xB137;&#xCC98;&#xB7FC; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xACF3;&#xC5D0;&#xC11C; &#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xB54C;, &#xD30C;&#xC77C;&#xC5D0; <strong>Mark-of-the-Web (MotW)</strong>&#xC774;&#xB77C;&#xB294; &#xC77C;&#xC885;&#xC758; <strong>&#xCD9C;&#xCC98; &#xD45C;&#xC2DC;</strong>&#xB97C; &#xD569;&#xB2C8;&#xB2E4;.  &#xC774; &#xD45C;&#xC2DC;&#xB294; Windows&#xC640; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xC704;&#xD5D8;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xC5B4;, &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xD30C;&#xC77C;&#xC744; &#xC880; &#xB354; &#xC8FC;&#xC758;&#xD574;&#xC11C; &#xB2E4;&#xB8E8;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.  &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, MotW&#xAC00; &#xD45C;&#xC2DC;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB824;&#xACE0; &#xD558;&#xBA74; Windows Defender SmartScreen&#xC774; &#xD30C;&#xC77C;&#xC758; reputation&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xACBD;&#xACE0;&#xB97C; &#xBCF4;&#xB0B4; &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xAC10;&#xC5FC;&#xC744; &#xB9C9;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xADF8;&#xB9BC;&#xC740; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC758; <code>Zone.Identifier</code> &#xC815;&#xBCF4;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774; &#xC815;&#xBCF4;&#xB294; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; &#xC778;&#xD130;&#xB137;&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xAC83;&#xC744; Windows&#xC5D0; &#xC54C;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/16/OUYA77/2025-04-16/image.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xB610;&#xD55C; &#xB2E4;&#xC74C; &#xADF8;&#xB9BC;&#xC740; MotW &#xD0DC;&#xADF8;&#xB85C; &#xC778;&#xD574; &#xB098;&#xD0C0;&#xB098;&#xB294; Windows Defender SmartScreen &#xBCF4;&#xC548; &#xACBD;&#xACE0;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xACE0;&#xB294; &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xC704;&#xD5D8;&#xD560; &#xC218; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xB85C;&#xBD80;&#xD130; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/16/OUYA77/2025-04-16/image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xCC38;&#xACE0;&#xB85C; &#xD30C;&#xC77C;&#xC758; &#xC18D;&#xC131;&#xC5D0;&#xC11C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774;(&#xD30C;&#xB780;&#xBC15;&#xC2A4;) MotW &#xD0DC;&#xADF8; &#xC815;&#xBCF4;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xD0DC;&#xADF8;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589; &#xC2DC; &#xC704;&#xC640; &#xAC19;&#xC774; &#xACBD;&#xACE0; &#xD31D;&#xC5C5;&#xC774; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/16/OUYA77/2025-04-16/image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<h3 id="Root-cause"><a href="#Root-cause" class="headerlink" title="Root cause"></a>Root cause</h3><p>&#xADF8;&#xB7EC;&#xB098; CVE-2025-0411 &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; 7-Zip&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD30C;&#xC77C;&#xC744; <strong>&#xC774;&#xC911; &#xC555;&#xCD95;</strong>&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC774;&#xB7EC;&#xD55C; MotW &#xBCF4;&#xD638;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <strong>Windows&#xB294; &#xAC89;&#xC5D0; &#xC788;&#xB294; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC5D0;&#xB9CC; MotW &#xD45C;&#xC2DC;&#xB97C; &#xD558;&#xACE0;, &#xADF8; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC5D0;&#xB294; MotW &#xD45C;&#xC2DC;&#xB97C; &#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</strong>  &#xBC14;&#xB85C; &#xC774; &#xC810;&#xC744; &#xC545;&#xC6A9;&#xD574;&#xC11C;, &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC545;&#xC131; &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xC744; &#xC548;&#xCABD; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC5D0; &#xC228;&#xAE30;&#xACE0;, &#xAC89;&#xCABD; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC744; &#xD1B5;&#xD574; &#xBC30;&#xD3EC;&#xD568;&#xC73C;&#xB85C;&#xC368; Windows&#xC758; MotW &#xBCF4;&#xD638;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774;&#xB807;&#xAC8C; &#xC774;&#xC911;&#xC73C;&#xB85C; &#xC555;&#xCD95;&#xB41C; &#xD30C;&#xC77C;&#xC744; 7-Zip&#xC73C;&#xB85C; &#xC5F4;&#xACE0; &#xC548;&#xCABD; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74;, MotW &#xACBD;&#xACE0;&#xB098; Windows Defender SmartScreen&#xC758; &#xAC80;&#xC0AC; &#xC5C6;&#xC774; &#xC545;&#xC131; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="Proof-of-Concept"><a href="#Proof-of-Concept" class="headerlink" title="Proof of Concept"></a>Proof of Concept</h3><p><img src="/2025/04/16/OUYA77/2025-04-16/image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xADF8;&#xB9BC;&#xC740; ZIP &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC774; &#xB2E4;&#xB978; ZIP &#xC555;&#xCD95; &#xD30C;&#xC77C; &#xC548;&#xC5D0; &#xC911;&#xCCA9;&#xB41C; CVE-2025-0411&#xC758; PoC &#xB370;&#xBAA8;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774; PoC&#xC5D0;&#xC11C; &#xC911;&#xCCA9;&#xB41C; &#xC555;&#xCD95; &#xD30C;&#xC77C;(poc.outer.zip\poc.inner.zip) &#xB0B4;&#xBD80;&#xC5D0; &#xC788;&#xB294; <code>poc.bat</code> &#xD30C;&#xC77C;&#xC5D0;&#xB294; MotW &#xBCF4;&#xD638;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBCF4;&#xD638; &#xBD80;&#xC7AC;&#xB85C; &#xC778;&#xD574; &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xAC10;&#xC5FC; &#xC704;&#xD5D8;&#xC774; &#xD06C;&#xAC8C; &#xC99D;&#xAC00;&#xD558;&#xACE0; Windows Defender SmartScreen&#xC774; &#xD30C;&#xC77C;&#xC758; reputation &#xBC0F; &#xC11C;&#xBA85;&#xC744; &#xC81C;&#xB300;&#xB85C; &#xAC80;&#xC0AC;&#xD558;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC744; &#xC555;&#xCD95;&#xD574;&#xC81C; &#xD6C4; &#xC2E4;&#xD589;&#xC744; &#xD558;&#xBA74;, &#xACBD;&#xACE0; &#xD31D;&#xC5C5;&#xC774; &#xB728;&#xC9C0; &#xC54A;&#xACE0; &#xBC14;&#xB85C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC2E4;&#xD589;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/16/OUYA77/2025-04-16/image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xC81C;&#xB85C;&#xB370;&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098; &#xB2E8;&#xCCB4;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD55C; SmokeLoader &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xCEA0;&#xD398;&#xC778;&#xC5D0; &#xC545;&#xC6A9;&#xB41C; &#xAC83;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCEA0;&#xD398;&#xC778;&#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098; &#xC815;&#xBD80; &#xAE30;&#xAD00;&#xACFC; &#xAE30;&#xC5C5;&#xC744; &#xD45C;&#xC801;&#xC73C;&#xB85C; &#xC0BC;&#xC544; &#xC0AC;&#xC774;&#xBC84; &#xC2A4;&#xD30C;&#xC774; &#xD65C;&#xB3D9;&#xC744; &#xC218;&#xD589;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB4E4;&#xC740; &#xC190;&#xC0C1;&#xB41C; &#xC774;&#xBA54;&#xC77C; &#xACC4;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xC545;&#xC131; &#xCCA8;&#xBD80; &#xD30C;&#xC77C;&#xC744; &#xC720;&#xD3EC;&#xD558;&#xACE0;, &#xD2B9;&#xD788; &#x201C;Homoglyph &#xACF5;&#xACA9;&#x201D;&#xC774;&#xB77C;&#xB294; &#xAE30;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD30C;&#xC77C; &#xD655;&#xC7A5;&#xC790;&#xB97C; &#xAD50;&#xBB18;&#xD558;&#xAC8C; &#xC704;&#xC7A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<blockquote>
<p><code>Homoglyph</code> &#xACF5;&#xACA9;&#xC740; &#xC2DC;&#xAC01;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xC0AC;&#xD55C; &#xBB38;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC18D;&#xC774;&#xB294; &#xACF5;&#xACA9; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.  &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD569;&#xBC95;&#xC801;&#xC778; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xB098; &#xD30C;&#xC77C;&#xCC98;&#xB7FC; &#xBCF4;&#xC774;&#xB3C4;&#xB85D; &#xC545;&#xC131; &#xCF58;&#xD150;&#xCE20;&#xB97C; &#xC704;&#xC7A5;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xD074;&#xB9AD;&#xC744; &#xC720;&#xB3C4;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xACF5;&#xACA9;&#xC790;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xB984;&#xC5D0;&#xC11C; &#xB77C;&#xD2F4; &#xBB38;&#xC790; &#x201C;c&#x201D; &#xB300;&#xC2E0; &#xD0A4;&#xB9B4; &#xBB38;&#xC790; &#x201C;Es&#x201D;(&#x421; &#xB610;&#xB294; &#x441;)&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xB450; &#xBB38;&#xC790;&#xB294; &#xAC89;&#xBCF4;&#xAE30;&#xC5D0;&#xB294; &#xAC70;&#xC758; &#xB3D9;&#xC77C;&#xD558;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD4E8;&#xD130;&#xB294; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBB38;&#xC790;&#xB85C; &#xC778;&#xC2DD;&#xD569;&#xB2C8;&#xB2E4;.  &#xC774;&#xB97C; &#xD1B5;&#xD574; &#x201C;api-microsoft[.]com&#x201D;&#xACFC; &#xAC19;&#xC774; &#xD569;&#xBC95;&#xC801;&#xC778; Microsoft &#xC0AC;&#xC774;&#xD2B8;&#xCC98;&#xB7FC; &#xBCF4;&#xC774;&#xB294; &#xC545;&#xC131; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC18D;&#xC544;&#xC11C; &#xAC1C;&#xC778; &#xC815;&#xBCF4;&#xB098; &#xC790;&#xACA9; &#xC99D;&#xBA85;(&#xC544;&#xC774;&#xB514;, &#xBE44;&#xBC00;&#xBC88;&#xD638;)&#xC744; &#xC785;&#xB825;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC">https://github.com/dhmosfunk/7-Zip-CVE-2025-0411-POC</a><br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/advisories/ZDI-25-045/">https://www.zerodayinitiative.com/advisories/ZDI-25-045/</a><br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2025-0411">https://nvd.nist.gov/vuln/detail/CVE-2025-0411</a><br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/">https://securityonline.info/cve-2025-0411-7-zip-security-vulnerability-enables-code-execution-update-now/</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/7-Zip/">7-Zip</a>
                  
                  <a class="hover-with-bg" href="/tags/SmokeLoader/">SmokeLoader</a>
                  
                  <a class="hover-with-bg" href="/tags/MotW/">MotW</a>
                  
                  <a class="hover-with-bg" href="/tags/CVE-2025-0411/">CVE-2025-0411</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/04/17/pwndorei/2025-04-17/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2025-21204: Windows Update Stack의 Improper Link Following으로 인한 Privilege Escalation</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/04/13/l0ch/bypassing-kernel-mitigation-part0/en/">
                    <span class="hidden-mobile">[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (En)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/04/16/OUYA77/2025-04-16/';
        this.page.identifier = '/2025/04/16/OUYA77/2025-04-16/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] CVE-2025-0411 : 7-Zip의 Mark-of-the-Web (MotW) 우회로 인한 악성코드 감염&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
