

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; Part 2&amp;#xC5D0;&amp;#xC120; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; 6&amp;#xB2E8;&amp;#xACC4;&amp;#xC778; Preprocess, Schedule, InputGen, InputEval, ConfUpdate, Continue &amp;#xC911; Preprocess&amp;#xC640; Schedule&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC120; &amp;#xD604;&amp;#xC7AC; iteration&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xD0AC; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; InputGen &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;5-Input-Generation&#34;&gt;&lt;a href=&#34;#5-Input-Generation&#34; class=&#34;headerlink&#34; title=&#34;5 Input Generation&#34;&gt;&lt;/a&gt;5 Input Generation&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs stylus&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-title&#34;&gt;InputGen&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(conf)&lt;/span&gt;&lt;/span&gt; &amp;#x2192; tcs&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;test case&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; bug trigger&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Input generation&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xB514;&amp;#xC790;&amp;#xC778; &amp;#xC120;&amp;#xD0DD;&amp;#xC5D0; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; generation-base, mutation-base &amp;#xB450; &amp;#xAC1C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Generation-based&amp;#xB294; PUT&amp;#xC758; expected input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; model&amp;#xC744; &amp;#xD1B5;&amp;#xD574; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; model-based fuzzer&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. mutation-based&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; seed&amp;#xB97C; Mutate(&amp;#xBCC0;&amp;#xC870;) &amp;#xC2DC;&amp;#xCF1C; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Seed&amp;#xAC00; expected input space&amp;#xB97C; &amp;#xB300;&amp;#xD45C;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; model-less fuzzer&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-1-Model-based&#34;&gt;&lt;a href=&#34;#5-1-Model-based&#34; class=&#34;headerlink&#34; title=&#34;5.1 Model-based&#34;&gt;&lt;/a&gt;5.1 Model-based&lt;/h2&gt;&lt;p&gt;model-based&amp;#xB294; PUT&amp;#xC758; expected input space&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; model&amp;#xB85C;&amp;#xBD80;&amp;#xD130; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; input format&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC9C0;&amp;#xCE6D;&amp;#xD558;&amp;#xB294; magic value &amp;#xB4F1;&amp;#xC774; model&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-1-Predefined-Model&#34;&gt;&lt;a href=&#34;#5-1-1-Predefined-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.1 Predefined Model&#34;&gt;&lt;/a&gt;5.1.1 Predefined Model&lt;/h3&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC885;&amp;#xB958;&amp;#xC758; Model-based &amp;#xD37C;&amp;#xC800; &amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#xC0AC;&amp;#xC804; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xBC1B;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Peach, PROTOS, Dharma&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0C1;&amp;#xC138;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC544; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Autodafe, Sulley, SPIKE, SPIKEfile&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; API&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xC2A4;&amp;#xC2A4;&amp;#xB85C; input model&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0;,  Tavor&amp;#xB294; Extended Bakcus-Naur Form(EBNF)&amp;#xC5D0; &amp;#xC801;&amp;#xD78C; input&amp;#xC758; &amp;#xC0C1;&amp;#xC138; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; test case&amp;#xB97C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4; PROTOS, SNOOZE, KiF, T-Fuzz&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xC0C1;&amp;#xC138; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kernel API &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C; &amp;#xD0EC;&amp;#xD50C;&amp;#xB9BF;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB744;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB7F0; &amp;#xD0EC;&amp;#xD50C;&amp;#xB9BF;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; system call&amp;#xC774; &amp;#xAE30;&amp;#xB300;&amp;#xD558;&amp;#xB294; arguments&amp;#xC758; &amp;#xC218;&amp;#xC640; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; model-based &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xBB38;&amp;#xBC95;&amp;#xC774;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xD37C;&amp;#xC800; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; cross_fuzz&amp;#xC640; DOMfuzz&amp;#xB294; &amp;#xB79C;&amp;#xB364; Docutment Object Model (DOM) objects&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; jsfunfuzz&amp;#xB294; &amp;#xBB38;&amp;#xBC95;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xB79C;&amp;#xB364; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBB38;&amp;#xBC95; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; QuickFuzz&amp;#xB294; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; Haskell library &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TLS&amp;#xC640; NFC &amp;#xAC19;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; TLS-Attacker, tlsfuzzer, llfuzzer&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;LangFuzz&amp;#xB294; input&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC740; seed&amp;#xB4E4;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD574; code &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xB79C;&amp;#xB364;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xD569;&amp;#xD574;&amp;#xC11C; seed&amp;#xB97C; mutate &amp;#xC2DC;&amp;#xCF1C; testcase &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD56D;&amp;#xC0C1; syntax&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; js&amp;#xB098; php&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;BlendFuzz&amp;#xB294; LangFuzz&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; xml&amp;#xC744; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-2-Inferred-Model&#34;&gt;&lt;a href=&#34;#5-1-2-Inferred-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.2 Inferred Model&#34;&gt;&lt;/a&gt;5.1.2 Inferred Model&lt;/h3&gt;&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D4; &amp;#xC0AC;&amp;#xC804; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&amp;#xBC1B;&amp;#xB294; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; infer model&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB378; &amp;#xCD94;&amp;#xB860;&amp;#xC740; instrumentation&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; Preprocess&amp;#xB098; ConfUpdate &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5.1.2.1 Model inference in Preprocess&lt;/p&gt;
&lt;p&gt;TestMiner&amp;#xB294; literal &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; input&amp;#xC744; &amp;#xC608;&amp;#xCE21;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Skyfire&amp;#xB294; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB4E4;&amp;#xACFC; &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; data-driven &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;, Probabilistic context-sensitive grammer&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. semantic&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;IMF&amp;#xB294; system API log&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; kernel API &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD558;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; C &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CodeAlchemist&amp;#xB294; &amp;#x201C;code brick&amp;#x201D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; JavaScript&amp;#xB97C; &amp;#xBD84;&amp;#xD574; &amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xB294; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xC811;&amp;#xD55C; brick&amp;#xB07C;&amp;#xB9AC;&amp;#xC758; &amp;#xBD84;&amp;#xB9AC;&amp;#xC640; &amp;#xBCD1;&amp;#xD569;&amp;#xC774; &amp;#xC758;&amp;#xBBF8;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Neural&amp;#xACFC; Learn&amp;amp;Fuzz&amp;#xB294; &amp;#xC2E0;&amp;#xACBD;&amp;#xB9DD; &amp;#xAE30;&amp;#xBC18; &amp;#xBA38;&amp;#xC2E0; &amp;#xB7EC;&amp;#xB2DD;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; test file&amp;#xB85C; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD558;&amp;#xACE0; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5.1.2.2 Model inference in ConfUPDATE&lt;/p&gt;
&lt;p&gt;Preprocess &amp;#xB2E8;&amp;#xACC4;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB9E4; iteration&amp;#xC774; &amp;#xB05D;&amp;#xB0A0; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. PULSAR&amp;#xB294; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD55C; network packet&amp;#xC744; &amp;#xD1B5;&amp;#xD574; network protocol&amp;#xC744; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. state machine&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC01; state&amp;#xC640; message&amp;#xB97C; mapping &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; test case &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; I/O &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xAD00;&amp;#xCC30;&amp;#xD574; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xB294; state machine &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. GLADE&amp;#xB294; PUT&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; I/O &amp;#xC0D8;&amp;#xD50C;&amp;#xB4E4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; context-free grammer&amp;#xB97C; &amp;#xD569;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; inferred &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;go-fuzz&amp;#xB294; grey-box fuzzer&amp;#xB85C; seed pool&amp;#xC5D0; seed&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; seed&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-3-Encoder-Model&#34;&gt;&lt;a href=&#34;#5-1-3-Encoder-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.3 Encoder Model&#34;&gt;&lt;/a&gt;5.1.3 Encoder Model&lt;/h3&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xB4E4;&amp;#xC740; &amp;#xC800;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC758; &amp;#xC808;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB77C; &amp;#xB9D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MutaGen&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xC808;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xACFC;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC740; test case&amp;#xB97C; mutate &amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; test case&amp;#xB97C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; mutate &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC778;&amp;#xCF54;&amp;#xB354;&amp;#xC758; &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-2-Model-less-Fuzzer-mutation-based-fuzzer&#34;&gt;&lt;a href=&#34;#5-2-Model-less-Fuzzer-mutation-based-fuzzer&#34; class=&#34;headerlink&#34; title=&#34;5.2 Model-less Fuzzer (mutation-based fuzzer)&#34;&gt;&lt;/a&gt;5.2 Model-less Fuzzer (mutation-based fuzzer)&lt;/h2&gt;&lt;p&gt;&amp;#xACE0;&amp;#xC804;&amp;#xC801;&amp;#xC778; &amp;#xB79C;&amp;#xB364; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; path &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. if (input == 42)&amp;#xB77C;&amp;#xB294; C &amp;#xAD6C;&amp;#xBB38;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xBA74; input&amp;#xC774; 32-bit integer&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xB79C;&amp;#xB364; &amp;#xD558;&amp;#xAC8C; input&amp;#xC744; &amp;#xC815;&amp;#xD574; &amp;#xB9DE;&amp;#xCD9C; &amp;#xD655;&amp;#xB960;&amp;#xC740; 1/2^32&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. MP3 &amp;#xD30C;&amp;#xC77C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; input&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC0C1;&amp;#xD669;&amp;#xC740; &amp;#xB354;&amp;#xC6B1; &amp;#xC548;&amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xB85C; &amp;#xC628;&amp;#xC804;&amp;#xD55C; mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xB9D0;&amp;#xC774; &amp;#xC548; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xB79C;&amp;#xB364; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD30C;&amp;#xC2F1; &amp;#xB2E8;&amp;#xACC4;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xAE4A;&amp;#xC219;&amp;#xD55C; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; seed-based &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; white-box &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; Model-less &amp;#xD37C;&amp;#xC800;&amp;#xB294; PUT&amp;#xC758; &amp;#xC778;&amp;#xD48B;&amp;#xC774; &amp;#xB418;&amp;#xB294; seed&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD574; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD328;&amp;#xD0B7;, UI &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC774; seed&amp;#xB85C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. seed&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC;&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; crash &amp;#xB4F1;&amp;#xC744; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xAC12;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; input&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;seed&amp;#xB97C; Mutate &amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-1-Bit-Flipping&#34;&gt;&lt;a href=&#34;#5-2-1-Bit-Flipping&#34; class=&#34;headerlink&#34; title=&#34;5.2.1 Bit-Flipping&#34;&gt;&lt;/a&gt;5.2.1 Bit-Flipping&lt;/h3&gt;&lt;p&gt;bit-flipping&amp;#xC740; &amp;#xB9CE;&amp;#xC740; model-less &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xAE38;&amp;#xC774;&amp;#xC758; bit&amp;#xB97C; flip &amp;#xD558;&amp;#xAC70;&amp;#xB098; flip&amp;#xD560; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xB79C;&amp;#xB364;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA87;&amp;#xBA87; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; seed&amp;#xB97C; mutate &amp;#xD560; &amp;#xB54C; mutation-ratio&amp;#xC640; &amp;#xAC19;&amp;#xC740; user-configurable parameter&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; InputGen &amp;#xD55C;&amp;#xBC88; &amp;#xB2F9; flip&amp;#xD560; &amp;#xBE44;&amp;#xD2B8; &amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; N-bit &amp;#xD06C;&amp;#xAE30;&amp;#xC758; seed&amp;#xC5D0;&amp;#xC11C; K-bit &amp;#xB9CC;&amp;#xD07C; &amp;#xB79C;&amp;#xB364; &amp;#xD558;&amp;#xAC8C; flip &amp;#xD560;&amp;#xB54C; mutation-ratio&amp;#xB294; K/N&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. SymFuzz&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xD6A8;&amp;#xC728;&amp;#xC740; &amp;#xC774; mutation-ratio&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; PUT&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD55C; ratio &amp;#xB530;&amp;#xC708; &amp;#xC5C6;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC88B;&amp;#xC740; mutation-ratio&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBB50;&amp;#xAC00; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;BFF&amp;#xC640; FOE&amp;#xB294; mutation-ratio &amp;#xC9D1;&amp;#xD569;&amp;#xC758; &amp;#xC9C0;&amp;#xC218; &amp;#xBD84;&amp;#xD3EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; ratio&amp;#xC5D0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;SymFuzz&amp;#xB294; white-box &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC01; &amp;#xC2DC;&amp;#xB4DC;&amp;#xBCC4; &amp;#xC801;&amp;#xC808;&amp;#xD55C; mutation-raito&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-2-Arithmetic-Mutation&#34;&gt;&lt;a href=&#34;#5-2-2-Arithmetic-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.2 Arithmetic Mutation&#34;&gt;&lt;/a&gt;5.2.2 Arithmetic Mutation&lt;/h3&gt;&lt;p&gt;AFL&amp;#xACFC; honggfuzz&amp;#xB294; mutate &amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; integer&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xACE0; &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; mutation&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD575;&amp;#xC2EC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; AFL&amp;#xC740; seed&amp;#xC5D0;&amp;#xC11C; 4byte&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; integer&amp;#xC640; &amp;#xB367;&amp;#xC148; &amp;#xD639;&amp;#xC740; &amp;#xBE84;&amp;#xC148;&amp;#xC744; &amp;#xD574;&amp;#xC11C; mutate &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; integer&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB294; fuzzer&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xACE0; user-configurable &amp;#xAC12;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xC774; &amp;#xBC94;&amp;#xC704;&amp;#xAC00; 0~35&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-3-Block-based-Mutation&#34;&gt;&lt;a href=&#34;#5-2-3-Block-based-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.3 Block-based Mutation&#34;&gt;&lt;/a&gt;5.2.3 Block-based Mutation&lt;/h3&gt;&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; block-based mutation &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. block&amp;#xC740; seed&amp;#xC758; byte &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBE14;&amp;#xB85D;&amp;#xC744; seed&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;seed&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC0AD;&amp;#xC81C;&lt;/li&gt;
&lt;li&gt;seed&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xAD50;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC7AC;&amp;#xBC30;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;&amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xD06C;&amp;#xAE30; resize &amp;#xBC0F; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D; &amp;#xCCA8;&amp;#xAC00;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;5-2-4-Dictionary-based-Mutation&#34;&gt;&lt;a href=&#34;#5-2-4-Dictionary-based-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.4 Dictionary-based Mutation&#34;&gt;&lt;/a&gt;5.2.4 Dictionary-based Mutation&lt;/h3&gt;&lt;p&gt;&amp;#xC758;&amp;#xBBF8; &amp;#xAC00;&amp;#xC911;&amp;#xCE58;&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD568;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; 0 &amp;#xD639;&amp;#xC740; -1, &amp;#xD3EC;&amp;#xBA67; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9C1; &amp;#xB4F1;&amp;#xC774; mutation&amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;. AFL&amp;#xACFC; honggfuzz, libfuzzer&amp;#xB294; 0&amp;#xACFC; -1, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 1&amp;#xB4F1;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Integer&amp;#xB97C; mutation &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Radamsa&amp;#xB294; unicode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0;, GPF&amp;#xB294; %x, %s &amp;#xB4F1; &amp;#xD3EC;&amp;#xBA67; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; mutate&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-3-White-box-Fuzzers&#34;&gt;&lt;a href=&#34;#5-3-White-box-Fuzzers&#34; class=&#34;headerlink&#34; title=&#34;5.3 White-box Fuzzers&#34;&gt;&lt;/a&gt;5.3 White-box Fuzzers&lt;/h2&gt;&lt;p&gt;white-box fuzzer &amp;#xB610;&amp;#xD55C; model-based&amp;#xC640; model-less&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; dynamic symbolic execution&amp;#xACFC; mutation &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBD80; symbolic executor&amp;#xB294; input grammer&amp;#xB85C; symbolic executor&amp;#xB97C; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; input model&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CE;&amp;#xC740; white-box &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; dynamic symbolic execution&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; white-box fuzzer&amp;#xB4E4;&amp;#xC774; dynamic symbolic executor&amp;#xC778; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBD80; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; white-box &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; PUT&amp;#xC774; &amp;#xC218;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; black-box, grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-1-Dynamic-Symbolic-Execution&#34;&gt;&lt;a href=&#34;#5-3-1-Dynamic-Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;5.3.1 Dynamic Symbolic Execution&#34;&gt;&lt;/a&gt;5.3.1 Dynamic Symbolic Execution&lt;/h3&gt;&lt;p&gt;high level&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xACE0;&amp;#xC804;&amp;#xC801; symbolic execution&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC00;&amp;#xC9D3;&amp;#xC218;&amp;#xC758; input&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. PUT&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xD3C9;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; symbolic expression&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; sybolic interpreter&amp;#xB97C; for k&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xB294; true, &amp;#xB2E4;&amp;#xB978; &amp;#xD558;&amp;#xB098;&amp;#xB294; false branch&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; path&amp;#xB9C8;&amp;#xB2E4; sybolic interpreter&amp;#xB294; path formula&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; concrete input&amp;#xC774; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; path fomula&amp;#xB294; &amp;#xC801;&amp;#xD569;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SMT solver&amp;#xC5D0; path fomula&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD574;&amp;#xB2F5;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; concrete input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Dynamic symbolic execution&amp;#xC740; symbolic execution&amp;#xACFC; concrete execution&amp;#xC774; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; symbolic execution&amp;#xACFC; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; dynmaic symbolic execution&amp;#xC744; concolic ( concrete + symbolic ) testing&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD575;&amp;#xC2EC; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB294; concrete execution state&amp;#xAC00; symbolic constraints&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC9D5; &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; dynamic synbolic execution&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xACF3;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9; &amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic symbolic exection&amp;#xC740; PUT&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Instruction &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; instrument &amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; grey-box, black-box &amp;#xBCF4;&amp;#xB2E4; &amp;#xB290;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xB192;&amp;#xC740; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xAC10;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC881;&amp;#xC740; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xB7B5;&amp;#xC774; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC678;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00;, grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xACFC; concolic testing&amp;#xC744; &amp;#xBC88;&amp;#xAC08;&amp;#xC544;&amp;#xAC00;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Driller&amp;#xC640; Cyberdyne&amp;#xC740; &amp;#xBE60;&amp;#xB978; concolic execution engine&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574; grey-box&amp;#xC640; white-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD569;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. DigFuzz&amp;#xB294; grey-box&amp;#xC640; white-box&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xAD50;&amp;#xB300;&amp;#xD558;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC6B0;&amp;#xC120; grey-box&amp;#xB85C; &amp;#xAC01; path &amp;#xBCC4; &amp;#xB3C4;&amp;#xB2EC; &amp;#xD655;&amp;#xB960;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0;, &amp;#xADF8;&amp;#xC911; grey-box&amp;#xB85C; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xAC00;&amp;#xC7A5; &amp;#xD798;&amp;#xB4E0; path&amp;#xB4E4;&amp;#xC740; white-box&amp;#xAC00; &amp;#xACF5;&amp;#xB7B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-2-Guided-Fuzzing&#34;&gt;&lt;a href=&#34;#5-3-2-Guided-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;5.3.2 Guided Fuzzing&#34;&gt;&lt;/a&gt;5.3.2 Guided Fuzzing&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBD80; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD37C;&amp;#xC9D5;&amp;#xC758; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xC220;&amp;#xB4E4;&amp;#xC740; &amp;#xB450; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xB294;&amp;#xB370;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PUT&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBE44;&amp;#xC6A9; &amp;#xB192;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;TaintScope&amp;#xB294; fine-grained taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; system call&amp;#xC774;&amp;#xB098; API&amp;#xC5D0; &amp;#xD758;&amp;#xB7EC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xAC00;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#x201C;Hot bytes&amp;#x201D;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dowser&amp;#xB294; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3C4;&amp;#xC911; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; heuristic &amp;#xC0C1; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; loop(&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; Pointer derefernce&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; loop)&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; input bytes&amp;#xC640; loop&amp;#xB4E4; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; ciritical bytes&amp;#xB9CC;&amp;#xC744; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; dynamic symbolic execution&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;VUzzer&amp;#xC640; GRT&amp;#xB294; input generation&amp;#xC744; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; PUT&amp;#xC758; data-flow&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB458; &amp;#xB2E4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Angora &amp;#xC640; Read Queen&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xB192;&amp;#xC740; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xBA70; instrumentaion&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB3C4; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; instrumentation&amp;#xC758; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xACE0; hot bytes &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC218;&amp;#xC6A9;&amp;#xD574; taint analysis&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-3-PUT-Mutation&#34;&gt;&lt;a href=&#34;#5-3-3-PUT-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.3.3 PUT Mutation&#34;&gt;&lt;/a&gt;5.3.3 PUT Mutation&lt;/h3&gt;&lt;p&gt;Fuzzing&amp;#xC744; &amp;#xC2E4;&amp;#xC6A9;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; checksum &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; PUT&amp;#xC774; input&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; checksum&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; PUT&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC218;&amp;#xC758; test case&amp;#xB97C; &amp;#xAC70;&amp;#xBD80;&amp;#xD560;  &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; TaintScope&amp;#xB294; checksum-aware fuzzing &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC81C;&amp;#xC548;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; checksum test instruction&amp;#xC744; &amp;#xAD6C;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; PUT&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD574; checksum &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; crash&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xBA74; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xCE58; &amp;#xC804; PUT&amp;#xC758; &amp;#xC62C;&amp;#xBC14;&amp;#xB978; checksum&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574; Input&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. T-Fuzz&amp;#xB294; grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; branch&amp;#xB77C;&amp;#xB3C4; &amp;#xD1B5;&amp;#xACFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; NCC (Non-Critical Cehcks: &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD328;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; branch&amp;#xB4E4;)&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. fuzzing campaign&amp;#xC774; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Path&amp;#xB97C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; NCC&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; PUT&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; fuzzing&amp;#xC744; &amp;#xC7AC;&amp;#xAC1C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; InputGen &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; InputEval &amp;#xB2E8;&amp;#xACC4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; InputGen&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB9CC;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC694;&amp;#xC998; hackyboiz &amp;#xD300;&amp;#xC6D0; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC815;&amp;#xC2E0;&amp;#xC5C6;&amp;#xC774; &amp;#xC0B4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC65C; &amp;#xC5F0;&amp;#xB9D0;&amp;#xB9CC; &amp;#xB418;&amp;#xBA74; &amp;#xBC14;&amp;#xC05C; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;? &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xB2E4;&amp;#xC74C; Part&amp;#xC5D0;&amp;#xC120; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; InputEval, ConfUpdate, Continue&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 퍼징 교양 수업 fuzz 101 - part3 - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Fabu1ous&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xBC88; Part 2&amp;#xC5D0;&amp;#xC120; &amp;#xD37C;&amp;#xC9D5; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC758; 6&amp;#xB2E8;&amp;#xACC4;&amp;#xC778; Preprocess, Schedule, InputGen, InputEval, ConfUpdate, Continue &amp;#xC911; Preprocess&amp;#xC640; Schedule&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC120; &amp;#xD604;&amp;#xC7AC; iteration&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xC2DC;&amp;#xD0AC; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; InputGen &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;5-Input-Generation&#34;&gt;&lt;a href=&#34;#5-Input-Generation&#34; class=&#34;headerlink&#34; title=&#34;5 Input Generation&#34;&gt;&lt;/a&gt;5 Input Generation&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs stylus&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-title&#34;&gt;InputGen&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(conf)&lt;/span&gt;&lt;/span&gt; &amp;#x2192; tcs&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;test case&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; bug trigger&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE58;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Input generation&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xB514;&amp;#xC790;&amp;#xC778; &amp;#xC120;&amp;#xD0DD;&amp;#xC5D0; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xD06C;&amp;#xAC8C; generation-base, mutation-base &amp;#xB450; &amp;#xAC1C;&amp;#xB85C; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. Generation-based&amp;#xB294; PUT&amp;#xC758; expected input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; model&amp;#xC744; &amp;#xD1B5;&amp;#xD574; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; model-based fuzzer&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. mutation-based&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; seed&amp;#xB97C; Mutate(&amp;#xBCC0;&amp;#xC870;) &amp;#xC2DC;&amp;#xCF1C; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Seed&amp;#xAC00; expected input space&amp;#xB97C; &amp;#xB300;&amp;#xD45C;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; model-less fuzzer&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-1-Model-based&#34;&gt;&lt;a href=&#34;#5-1-Model-based&#34; class=&#34;headerlink&#34; title=&#34;5.1 Model-based&#34;&gt;&lt;/a&gt;5.1 Model-based&lt;/h2&gt;&lt;p&gt;model-based&amp;#xB294; PUT&amp;#xC758; expected input space&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; model&amp;#xB85C;&amp;#xBD80;&amp;#xD130; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; input format&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC9C0;&amp;#xCE6D;&amp;#xD558;&amp;#xB294; magic value &amp;#xB4F1;&amp;#xC774; model&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-1-Predefined-Model&#34;&gt;&lt;a href=&#34;#5-1-1-Predefined-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.1 Predefined Model&#34;&gt;&lt;/a&gt;5.1.1 Predefined Model&lt;/h3&gt;&lt;p&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC885;&amp;#xB958;&amp;#xC758; Model-based &amp;#xD37C;&amp;#xC800; &amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#xC0AC;&amp;#xC804; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xBC1B;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Peach, PROTOS, Dharma&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0C1;&amp;#xC138;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC544; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Autodafe, Sulley, SPIKE, SPIKEfile&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB41C; API&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xC2A4;&amp;#xC2A4;&amp;#xB85C; input model&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0;,  Tavor&amp;#xB294; Extended Bakcus-Naur Form(EBNF)&amp;#xC5D0; &amp;#xC801;&amp;#xD78C; input&amp;#xC758; &amp;#xC0C1;&amp;#xC138; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; test case&amp;#xB97C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4; PROTOS, SNOOZE, KiF, T-Fuzz&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xC0C1;&amp;#xC138; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kernel API &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C; &amp;#xD0EC;&amp;#xD50C;&amp;#xB9BF;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB744;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB7F0; &amp;#xD0EC;&amp;#xD50C;&amp;#xB9BF;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; system call&amp;#xC774; &amp;#xAE30;&amp;#xB300;&amp;#xD558;&amp;#xB294; arguments&amp;#xC758; &amp;#xC218;&amp;#xC640; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; model-based &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xBB38;&amp;#xBC95;&amp;#xC774;&amp;#xB098; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xD37C;&amp;#xC800; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; cross_fuzz&amp;#xC640; DOMfuzz&amp;#xB294; &amp;#xB79C;&amp;#xB364; Docutment Object Model (DOM) objects&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; jsfunfuzz&amp;#xB294; &amp;#xBB38;&amp;#xBC95;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xB79C;&amp;#xB364; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBB38;&amp;#xBC95; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; QuickFuzz&amp;#xB294; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; Haskell library &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TLS&amp;#xC640; NFC &amp;#xAC19;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; TLS-Attacker, tlsfuzzer, llfuzzer&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;LangFuzz&amp;#xB294; input&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC740; seed&amp;#xB4E4;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD574; code &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xB79C;&amp;#xB364;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xD569;&amp;#xD574;&amp;#xC11C; seed&amp;#xB97C; mutate &amp;#xC2DC;&amp;#xCF1C; testcase &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD56D;&amp;#xC0C1; syntax&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; js&amp;#xB098; php&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;BlendFuzz&amp;#xB294; LangFuzz&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; xml&amp;#xC744; &amp;#xBAA8;&amp;#xB378;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-2-Inferred-Model&#34;&gt;&lt;a href=&#34;#5-1-2-Inferred-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.2 Inferred Model&#34;&gt;&lt;/a&gt;5.1.2 Inferred Model&lt;/h3&gt;&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D4; &amp;#xC0AC;&amp;#xC804; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&amp;#xBC1B;&amp;#xB294; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; infer model&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558; &amp;#xC0AC;&amp;#xB840;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB378; &amp;#xCD94;&amp;#xB860;&amp;#xC740; instrumentation&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; Preprocess&amp;#xB098; ConfUpdate &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5.1.2.1 Model inference in Preprocess&lt;/p&gt;
&lt;p&gt;TestMiner&amp;#xB294; literal &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; input&amp;#xC744; &amp;#xC608;&amp;#xCE21;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Skyfire&amp;#xB294; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB4E4;&amp;#xACFC; &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; data-driven &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;, Probabilistic context-sensitive grammer&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. semantic&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;IMF&amp;#xB294; system API log&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; kernel API &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD558;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xC758; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; C &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CodeAlchemist&amp;#xB294; &amp;#x201C;code brick&amp;#x201D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; JavaScript&amp;#xB97C; &amp;#xBD84;&amp;#xD574; &amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xB294; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xC778;&amp;#xC811;&amp;#xD55C; brick&amp;#xB07C;&amp;#xB9AC;&amp;#xC758; &amp;#xBD84;&amp;#xB9AC;&amp;#xC640; &amp;#xBCD1;&amp;#xD569;&amp;#xC774; &amp;#xC758;&amp;#xBBF8;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Neural&amp;#xACFC; Learn&amp;amp;Fuzz&amp;#xB294; &amp;#xC2E0;&amp;#xACBD;&amp;#xB9DD; &amp;#xAE30;&amp;#xBC18; &amp;#xBA38;&amp;#xC2E0; &amp;#xB7EC;&amp;#xB2DD;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; test file&amp;#xB85C; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xD559;&amp;#xC2B5;&amp;#xD558;&amp;#xACE0; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5.1.2.2 Model inference in ConfUPDATE&lt;/p&gt;
&lt;p&gt;Preprocess &amp;#xB2E8;&amp;#xACC4;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB9E4; iteration&amp;#xC774; &amp;#xB05D;&amp;#xB0A0; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. PULSAR&amp;#xB294; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD55C; network packet&amp;#xC744; &amp;#xD1B5;&amp;#xD574; network protocol&amp;#xC744; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. state machine&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC01; state&amp;#xC640; message&amp;#xB97C; mapping &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; test case &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; I/O &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xAD00;&amp;#xCC30;&amp;#xD574; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xB294; state machine &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. GLADE&amp;#xB294; PUT&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; I/O &amp;#xC0D8;&amp;#xD50C;&amp;#xB4E4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; context-free grammer&amp;#xB97C; &amp;#xD569;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; inferred &amp;#xBB38;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;go-fuzz&amp;#xB294; grey-box fuzzer&amp;#xB85C; seed pool&amp;#xC5D0; seed&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB420; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; seed&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-1-3-Encoder-Model&#34;&gt;&lt;a href=&#34;#5-1-3-Encoder-Model&#34; class=&#34;headerlink&#34; title=&#34;5.1.3 Encoder Model&#34;&gt;&lt;/a&gt;5.1.3 Encoder Model&lt;/h3&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xB4E4;&amp;#xC740; &amp;#xC800;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xBA67;&amp;#xC758; &amp;#xC808;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC774;&amp;#xB77C; &amp;#xB9D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MutaGen&amp;#xC740; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xC808;&amp;#xB300;&amp;#xC801;&amp;#xC778; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB978; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xACFC;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC740; test case&amp;#xB97C; mutate &amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; test case&amp;#xB97C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC778;&amp;#xCF54;&amp;#xB354; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; mutate &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC804;&amp;#xCCB4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C8; &amp;#xAC70;&amp;#xB77C;&amp;#xB294; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD9C;&amp;#xBC1C;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC778;&amp;#xCF54;&amp;#xB354;&amp;#xC758; &amp;#xC870;&amp;#xAC01;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-2-Model-less-Fuzzer-mutation-based-fuzzer&#34;&gt;&lt;a href=&#34;#5-2-Model-less-Fuzzer-mutation-based-fuzzer&#34; class=&#34;headerlink&#34; title=&#34;5.2 Model-less Fuzzer (mutation-based fuzzer)&#34;&gt;&lt;/a&gt;5.2 Model-less Fuzzer (mutation-based fuzzer)&lt;/h2&gt;&lt;p&gt;&amp;#xACE0;&amp;#xC804;&amp;#xC801;&amp;#xC778; &amp;#xB79C;&amp;#xB364; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; path &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. if (input == 42)&amp;#xB77C;&amp;#xB294; C &amp;#xAD6C;&amp;#xBB38;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xBA74; input&amp;#xC774; 32-bit integer&amp;#xB77C;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xB79C;&amp;#xB364; &amp;#xD558;&amp;#xAC8C; input&amp;#xC744; &amp;#xC815;&amp;#xD574; &amp;#xB9DE;&amp;#xCD9C; &amp;#xD655;&amp;#xB960;&amp;#xC740; 1/2^32&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. MP3 &amp;#xD30C;&amp;#xC77C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC798; &amp;#xC9DC;&amp;#xC5EC;&amp;#xC9C4; input&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC0C1;&amp;#xD669;&amp;#xC740; &amp;#xB354;&amp;#xC6B1; &amp;#xC548;&amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xB85C; &amp;#xC628;&amp;#xC804;&amp;#xD55C; mp3&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xB9D0;&amp;#xC774; &amp;#xC548; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xB79C;&amp;#xB364; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD30C;&amp;#xC2F1; &amp;#xB2E8;&amp;#xACC4;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xAE4A;&amp;#xC219;&amp;#xD55C; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; seed-based &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; white-box &amp;#xC778;&amp;#xD48B; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; Model-less &amp;#xD37C;&amp;#xC800;&amp;#xB294; PUT&amp;#xC758; &amp;#xC778;&amp;#xD48B;&amp;#xC774; &amp;#xB418;&amp;#xB294; seed&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD574; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD328;&amp;#xD0B7;, UI &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC774; seed&amp;#xB85C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. seed&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC;&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; crash &amp;#xB4F1;&amp;#xC744; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xAC12;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; input&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;seed&amp;#xB97C; Mutate &amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-1-Bit-Flipping&#34;&gt;&lt;a href=&#34;#5-2-1-Bit-Flipping&#34; class=&#34;headerlink&#34; title=&#34;5.2.1 Bit-Flipping&#34;&gt;&lt;/a&gt;5.2.1 Bit-Flipping&lt;/h3&gt;&lt;p&gt;bit-flipping&amp;#xC740; &amp;#xB9CE;&amp;#xC740; model-less &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xC220;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACE0;&amp;#xC815;&amp;#xB41C; &amp;#xAE38;&amp;#xC774;&amp;#xC758; bit&amp;#xB97C; flip &amp;#xD558;&amp;#xAC70;&amp;#xB098; flip&amp;#xD560; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xB79C;&amp;#xB364;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA87;&amp;#xBA87; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; seed&amp;#xB97C; mutate &amp;#xD560; &amp;#xB54C; mutation-ratio&amp;#xC640; &amp;#xAC19;&amp;#xC740; user-configurable parameter&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; InputGen &amp;#xD55C;&amp;#xBC88; &amp;#xB2F9; flip&amp;#xD560; &amp;#xBE44;&amp;#xD2B8; &amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; N-bit &amp;#xD06C;&amp;#xAE30;&amp;#xC758; seed&amp;#xC5D0;&amp;#xC11C; K-bit &amp;#xB9CC;&amp;#xD07C; &amp;#xB79C;&amp;#xB364; &amp;#xD558;&amp;#xAC8C; flip &amp;#xD560;&amp;#xB54C; mutation-ratio&amp;#xB294; K/N&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. SymFuzz&amp;#xB294; &amp;#xD37C;&amp;#xC9D5; &amp;#xD6A8;&amp;#xC728;&amp;#xC740; &amp;#xC774; mutation-ratio&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; PUT&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD55C; ratio &amp;#xB530;&amp;#xC708; &amp;#xC5C6;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC88B;&amp;#xC740; mutation-ratio&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBB50;&amp;#xAC00; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;BFF&amp;#xC640; FOE&amp;#xB294; mutation-ratio &amp;#xC9D1;&amp;#xD569;&amp;#xC758; &amp;#xC9C0;&amp;#xC218; &amp;#xBD84;&amp;#xD3EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; ratio&amp;#xC5D0; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; iteration&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;SymFuzz&amp;#xB294; white-box &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC01; &amp;#xC2DC;&amp;#xB4DC;&amp;#xBCC4; &amp;#xC801;&amp;#xC808;&amp;#xD55C; mutation-raito&amp;#xB97C; &amp;#xCD94;&amp;#xB860;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-2-Arithmetic-Mutation&#34;&gt;&lt;a href=&#34;#5-2-2-Arithmetic-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.2 Arithmetic Mutation&#34;&gt;&lt;/a&gt;5.2.2 Arithmetic Mutation&lt;/h3&gt;&lt;p&gt;AFL&amp;#xACFC; honggfuzz&amp;#xB294; mutate &amp;#xD560; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; integer&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xACE0; &amp;#xC0B0;&amp;#xC220; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; mutation&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD575;&amp;#xC2EC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; AFL&amp;#xC740; seed&amp;#xC5D0;&amp;#xC11C; 4byte&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; integer&amp;#xC640; &amp;#xB367;&amp;#xC148; &amp;#xD639;&amp;#xC740; &amp;#xBE84;&amp;#xC148;&amp;#xC744; &amp;#xD574;&amp;#xC11C; mutate &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB79C;&amp;#xB364; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; integer&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB294; fuzzer&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xACE0; user-configurable &amp;#xAC12;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AFL&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xC774; &amp;#xBC94;&amp;#xC704;&amp;#xAC00; 0~35&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-2-3-Block-based-Mutation&#34;&gt;&lt;a href=&#34;#5-2-3-Block-based-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.3 Block-based Mutation&#34;&gt;&lt;/a&gt;5.2.3 Block-based Mutation&lt;/h3&gt;&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; block-based mutation &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. block&amp;#xC740; seed&amp;#xC758; byte &amp;#xC2DC;&amp;#xD000;&amp;#xC2A4;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBE14;&amp;#xB85D;&amp;#xC744; seed&amp;#xC758; &amp;#xC784;&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;seed&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC0AD;&amp;#xC81C;&lt;/li&gt;
&lt;li&gt;seed&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xAD50;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC7AC;&amp;#xBC30;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;&amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xD06C;&amp;#xAE30; resize &amp;#xBC0F; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D; &amp;#xCCA8;&amp;#xAC00;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;5-2-4-Dictionary-based-Mutation&#34;&gt;&lt;a href=&#34;#5-2-4-Dictionary-based-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.2.4 Dictionary-based Mutation&#34;&gt;&lt;/a&gt;5.2.4 Dictionary-based Mutation&lt;/h3&gt;&lt;p&gt;&amp;#xC758;&amp;#xBBF8; &amp;#xAC00;&amp;#xC911;&amp;#xCE58;&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD37C;&amp;#xC800;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD568;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; 0 &amp;#xD639;&amp;#xC740; -1, &amp;#xD3EC;&amp;#xBA67; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9C1; &amp;#xB4F1;&amp;#xC774; mutation&amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;. AFL&amp;#xACFC; honggfuzz, libfuzzer&amp;#xB294; 0&amp;#xACFC; -1, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; 1&amp;#xB4F1;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Integer&amp;#xB97C; mutation &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Radamsa&amp;#xB294; unicode&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0;, GPF&amp;#xB294; %x, %s &amp;#xB4F1; &amp;#xD3EC;&amp;#xBA67; &amp;#xBB38;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; mutate&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;5-3-White-box-Fuzzers&#34;&gt;&lt;a href=&#34;#5-3-White-box-Fuzzers&#34; class=&#34;headerlink&#34; title=&#34;5.3 White-box Fuzzers&#34;&gt;&lt;/a&gt;5.3 White-box Fuzzers&lt;/h2&gt;&lt;p&gt;white-box fuzzer &amp;#xB610;&amp;#xD55C; model-based&amp;#xC640; model-less&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; dynamic symbolic execution&amp;#xACFC; mutation &amp;#xAE30;&amp;#xBC18; &amp;#xD37C;&amp;#xC800;&amp;#xB294; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xBD80; symbolic executor&amp;#xB294; input grammer&amp;#xB85C; symbolic executor&amp;#xB97C; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; input model&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CE;&amp;#xC740; white-box &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC774; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; dynamic symbolic execution&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; white-box fuzzer&amp;#xB4E4;&amp;#xC774; dynamic symbolic executor&amp;#xC778; &amp;#xAC83;&amp;#xC740; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBD80; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; white-box &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; PUT&amp;#xC774; &amp;#xC218;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; input&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; black-box, grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-1-Dynamic-Symbolic-Execution&#34;&gt;&lt;a href=&#34;#5-3-1-Dynamic-Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;5.3.1 Dynamic Symbolic Execution&#34;&gt;&lt;/a&gt;5.3.1 Dynamic Symbolic Execution&lt;/h3&gt;&lt;p&gt;high level&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xACE0;&amp;#xC804;&amp;#xC801; symbolic execution&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC00;&amp;#xC9D3;&amp;#xC218;&amp;#xC758; input&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. PUT&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC0C1;&amp;#xC218;&amp;#xAC12;&amp;#xC744; &amp;#xD3C9;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC2E0; symbolic expression&amp;#xC744; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; sybolic interpreter&amp;#xB97C; for k&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xB294; true, &amp;#xB2E4;&amp;#xB978; &amp;#xD558;&amp;#xB098;&amp;#xB294; false branch&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; path&amp;#xB9C8;&amp;#xB2E4; sybolic interpreter&amp;#xB294; path formula&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; concrete input&amp;#xC774; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; path&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; path fomula&amp;#xB294; &amp;#xC801;&amp;#xD569;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SMT solver&amp;#xC5D0; path fomula&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD574;&amp;#xB2F5;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; concrete input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Dynamic symbolic execution&amp;#xC740; symbolic execution&amp;#xACFC; concrete execution&amp;#xC774; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; symbolic execution&amp;#xACFC; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; dynmaic symbolic execution&amp;#xC744; concolic ( concrete + symbolic ) testing&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD575;&amp;#xC2EC; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB294; concrete execution state&amp;#xAC00; symbolic constraints&amp;#xC758; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC9D5; &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; dynamic synbolic execution&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xACF3;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9; &amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic symbolic exection&amp;#xC740; PUT&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Instruction &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; instrument &amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; grey-box, black-box &amp;#xBCF4;&amp;#xB2E4; &amp;#xB290;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xB192;&amp;#xC740; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xAC10;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC881;&amp;#xC740; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xB7B5;&amp;#xC774; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC678;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00;, grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xACFC; concolic testing&amp;#xC744; &amp;#xBC88;&amp;#xAC08;&amp;#xC544;&amp;#xAC00;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Driller&amp;#xC640; Cyberdyne&amp;#xC740; &amp;#xBE60;&amp;#xB978; concolic execution engine&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574; grey-box&amp;#xC640; white-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD569;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. DigFuzz&amp;#xB294; grey-box&amp;#xC640; white-box&amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xAD50;&amp;#xB300;&amp;#xD558;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC6B0;&amp;#xC120; grey-box&amp;#xB85C; &amp;#xAC01; path &amp;#xBCC4; &amp;#xB3C4;&amp;#xB2EC; &amp;#xD655;&amp;#xB960;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0;, &amp;#xADF8;&amp;#xC911; grey-box&amp;#xB85C; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xAC00;&amp;#xC7A5; &amp;#xD798;&amp;#xB4E0; path&amp;#xB4E4;&amp;#xC740; white-box&amp;#xAC00; &amp;#xACF5;&amp;#xB7B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-2-Guided-Fuzzing&#34;&gt;&lt;a href=&#34;#5-3-2-Guided-Fuzzing&#34; class=&#34;headerlink&#34; title=&#34;5.3.2 Guided Fuzzing&#34;&gt;&lt;/a&gt;5.3.2 Guided Fuzzing&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBD80; &amp;#xD37C;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD37C;&amp;#xC9D5;&amp;#xC758; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xC220;&amp;#xB4E4;&amp;#xC740; &amp;#xB450; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xB294;&amp;#xB370;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PUT&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xB294; &amp;#xBE44;&amp;#xC6A9; &amp;#xB192;&amp;#xC740; &amp;#xC791;&amp;#xC5C5;&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; test case&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;TaintScope&amp;#xB294; fine-grained taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; system call&amp;#xC774;&amp;#xB098; API&amp;#xC5D0; &amp;#xD758;&amp;#xB7EC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xAC00;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#x201C;Hot bytes&amp;#x201D;&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dowser&amp;#xB294; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3C4;&amp;#xC911; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; heuristic &amp;#xC0C1; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; loop(&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; Pointer derefernce&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; loop)&amp;#xB97C; &amp;#xCC3E;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; input bytes&amp;#xC640; loop&amp;#xB4E4; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; ciritical bytes&amp;#xB9CC;&amp;#xC744; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; dynamic symbolic execution&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;VUzzer&amp;#xC640; GRT&amp;#xB294; input generation&amp;#xC744; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; PUT&amp;#xC758; data-flow&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB458; &amp;#xB2E4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Angora &amp;#xC640; Read Queen&amp;#xB294; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xB192;&amp;#xC740; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xBA70; instrumentaion&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Input&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB3C4; &amp;#xC11C;&amp;#xC11C;&amp;#xD788; instrumentation&amp;#xC758; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xACE0; hot bytes &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xB97C; &amp;#xC218;&amp;#xC6A9;&amp;#xD574; taint analysis&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;5-3-3-PUT-Mutation&#34;&gt;&lt;a href=&#34;#5-3-3-PUT-Mutation&#34; class=&#34;headerlink&#34; title=&#34;5.3.3 PUT Mutation&#34;&gt;&lt;/a&gt;5.3.3 PUT Mutation&lt;/h3&gt;&lt;p&gt;Fuzzing&amp;#xC744; &amp;#xC2E4;&amp;#xC6A9;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; checksum &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; PUT&amp;#xC774; input&amp;#xC744; &amp;#xD30C;&amp;#xC2F1; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; checksum&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; PUT&amp;#xC740; &amp;#xB9CE;&amp;#xC740; &amp;#xC218;&amp;#xC758; test case&amp;#xB97C; &amp;#xAC70;&amp;#xBD80;&amp;#xD560;  &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; TaintScope&amp;#xB294; checksum-aware fuzzing &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC81C;&amp;#xC548;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. taint analysis&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; checksum test instruction&amp;#xC744; &amp;#xAD6C;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; PUT&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD574; checksum &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; crash&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xBA74; &amp;#xCF54;&amp;#xB4DC; &amp;#xD328;&amp;#xCE58; &amp;#xC804; PUT&amp;#xC758; &amp;#xC62C;&amp;#xBC14;&amp;#xB978; checksum&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574; Input&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. T-Fuzz&amp;#xB294; grey-box &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; branch&amp;#xB77C;&amp;#xB3C4; &amp;#xD1B5;&amp;#xACFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; NCC (Non-Critical Cehcks: &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD328;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; branch&amp;#xB4E4;)&amp;#xB97C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. fuzzing campaign&amp;#xC774; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Path&amp;#xB97C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; NCC&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; PUT&amp;#xC744; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; fuzzing&amp;#xC744; &amp;#xC7AC;&amp;#xAC1C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/10/24/fabu1ous/fuzz-3/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; InputGen &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; InputEval &amp;#xB2E8;&amp;#xACC4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; InputGen&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB9CC;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC694;&amp;#xC998; hackyboiz &amp;#xD300;&amp;#xC6D0; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC815;&amp;#xC2E0;&amp;#xC5C6;&amp;#xC774; &amp;#xC0B4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC65C; &amp;#xC5F0;&amp;#xB9D0;&amp;#xB9CC; &amp;#xB418;&amp;#xBA74; &amp;#xBC14;&amp;#xC05C; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;? &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xB2E4;&amp;#xC74C; Part&amp;#xC5D0;&amp;#xC120; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; InputEval, ConfUpdate, Continue&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/">

  <title>[Research] 퍼징 교양 수업 fuzz 101 - part3 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-10-24 14:00" pubdate>
      2021년 10월 24일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.8k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      75
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 퍼징 교양 수업 fuzz 101 - part3</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p><img src="/2021/10/24/fabu1ous/fuzz-3/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. Fabu1ous&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xBC88; Part 2&#xC5D0;&#xC120; &#xD37C;&#xC9D5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; 6&#xB2E8;&#xACC4;&#xC778; Preprocess, Schedule, InputGen, InputEval, ConfUpdate, Continue &#xC911; Preprocess&#xC640; Schedule&#xC744; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; Part 3&#xC5D0;&#xC120; &#xD604;&#xC7AC; iteration&#xC5D0; &#xC801;&#xC6A9;&#xC2DC;&#xD0AC; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xB294; InputGen &#xB2E8;&#xACC4;&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="5-Input-Generation"><a href="#5-Input-Generation" class="headerlink" title="5 Input Generation"></a>5 Input Generation</h1><pre><code class="hljs stylus"><span class="hljs-function"><span class="hljs-title">InputGen</span><span class="hljs-params">(conf)</span></span> &#x2192; tcs</code></pre>
<p><img src="/2021/10/24/fabu1ous/fuzz-3/2.png" srcset="/img/loading.gif" alt></p>
<p>test case&#xC758; &#xB0B4;&#xC6A9;&#xC774; bug trigger&#xC5D0; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Input generation&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAE30;&#xC220;&#xC740; &#xD37C;&#xC800;&#xC758; &#xB514;&#xC790;&#xC778; &#xC120;&#xD0DD;&#xC5D0; &#xAC00;&#xC7A5; &#xD070; &#xC601;&#xD5A5;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xD37C;&#xC800;&#xB294; &#xD06C;&#xAC8C; generation-base, mutation-base &#xB450; &#xAC1C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. Generation-based&#xB294; PUT&#xC758; expected input&#xC5D0; &#xB300;&#xD55C; model&#xC744; &#xD1B5;&#xD574; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; model-based fuzzer&#xB77C;&#xACE0;&#xB3C4; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. mutation-based&#xB294; &#xC81C;&#xACF5;&#xB41C; seed&#xB97C; Mutate(&#xBCC0;&#xC870;) &#xC2DC;&#xCF1C; input&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. Seed&#xAC00; expected input space&#xB97C; &#xB300;&#xD45C;&#xD560; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; model-less fuzzer&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<h2 id="5-1-Model-based"><a href="#5-1-Model-based" class="headerlink" title="5.1 Model-based"></a>5.1 Model-based</h2><p>model-based&#xB294; PUT&#xC758; expected input space&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; model&#xB85C;&#xBD80;&#xD130; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xBA74; input format&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; &#xBB38;&#xBC95;&#xC774;&#xB77C;&#xB358;&#xAC00; &#xD30C;&#xC77C; &#xD0C0;&#xC785;&#xC744; &#xC9C0;&#xCE6D;&#xD558;&#xB294; magic value &#xB4F1;&#xC774; model&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-1-1-Predefined-Model"><a href="#5-1-1-Predefined-Model" class="headerlink" title="5.1.1 Predefined Model"></a>5.1.1 Predefined Model</h3><p>&#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; Model-based &#xD37C;&#xC800; &#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#xC0AC;&#xC804; &#xC815;&#xC758;&#xB41C; &#xBAA8;&#xB378;&#xC774;&#xB098; &#xC720;&#xC800;&#xB85C;&#xBD80;&#xD130; &#xBAA8;&#xB378;&#xC744; &#xC81C;&#xACF5;&#xBC1B;&#xB294; &#xD37C;&#xC800;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Peach, PROTOS, Dharma&#xB294; &#xC720;&#xC800;&#xB85C;&#xBD80;&#xD130; &#xBAA8;&#xB378;&#xC5D0; &#xB300;&#xD55C; &#xC0C1;&#xC138;&#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xBC1B;&#xC544; &#xD37C;&#xC9D5;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. Autodafe, Sulley, SPIKE, SPIKEfile&#xC740; &#xBD84;&#xC11D;&#xC774; &#xD5C8;&#xC6A9;&#xB41C; API&#xB85C; &#xBD80;&#xD130; &#xC2A4;&#xC2A4;&#xB85C; input model&#xC744; &#xB9CC;&#xB4E4;&#xACE0;,  Tavor&#xB294; Extended Bakcus-Naur Form(EBNF)&#xC5D0; &#xC801;&#xD78C; input&#xC758; &#xC0C1;&#xC138; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544; test case&#xB97C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xD37C;&#xC800;&#xB4E4; PROTOS, SNOOZE, KiF, T-Fuzz&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xC0C1;&#xC138; &#xC815;&#xBCF4;&#xB97C; &#xC720;&#xC800;&#xB85C;&#xBD80;&#xD130; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. Kernel API &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C; &#xD0EC;&#xD50C;&#xB9BF;&#xC758; &#xD615;&#xD0DC;&#xB97C; &#xB744;&#xB294;&#xB370; &#xC774;&#xB7F0; &#xD0EC;&#xD50C;&#xB9BF;&#xC740; &#xC8FC;&#xB85C; &#xD2B9;&#xC815; system call&#xC774; &#xAE30;&#xB300;&#xD558;&#xB294; arguments&#xC758; &#xC218;&#xC640; &#xD0C0;&#xC785;&#xC744; &#xBA85;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xB978; model-based &#xD37C;&#xC800;&#xB294; &#xD2B9;&#xC815; &#xBB38;&#xBC95;&#xC774;&#xB098; &#xC5B8;&#xC5B4;&#xB97C; &#xBAA8;&#xB378;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;&#xC740; &#xD37C;&#xC800; &#xB0B4;&#xC5D0;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; cross_fuzz&#xC640; DOMfuzz&#xB294; &#xB79C;&#xB364; Docutment Object Model (DOM) objects&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xBE44;&#xC2B7;&#xD558;&#xAC8C; jsfunfuzz&#xB294; &#xBB38;&#xBC95;&#xC5D0; &#xB9DE;&#xB294; &#xB79C;&#xB364; JavaScript &#xCF54;&#xB4DC;&#xB97C; &#xBB38;&#xBC95; &#xBAA8;&#xB378;&#xC5D0; &#xC0DD;&#xC131;&#xD558;&#xACE0; QuickFuzz&#xB294; test case&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; Haskell library &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. TLS&#xC640; NFC &#xAC19;&#xC740; &#xD2B9;&#xC815; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; TLS-Attacker, tlsfuzzer, llfuzzer&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>LangFuzz&#xB294; input&#xC73C;&#xB85C; &#xBC1B;&#xC740; seed&#xB4E4;&#xC744; &#xD30C;&#xC2F1; &#xD574; code &#xC870;&#xAC01;&#xC744; &#xC0DD;&#xC131;, &#xC0DD;&#xC131;&#xB41C; &#xC870;&#xAC01;&#xC744; &#xB79C;&#xB364;&#xC73C;&#xB85C; &#xC870;&#xD569;&#xD574;&#xC11C; seed&#xB97C; mutate &#xC2DC;&#xCF1C; testcase &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xBC95;&#xC744; &#xD1B5;&#xD574; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD56D;&#xC0C1; syntax&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; js&#xB098; php&#xC5D0; &#xC801;&#xC6A9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>BlendFuzz&#xB294; LangFuzz&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; xml&#xC744; &#xBAA8;&#xB378;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-1-2-Inferred-Model"><a href="#5-1-2-Inferred-Model" class="headerlink" title="5.1.2 Inferred Model"></a>5.1.2 Inferred Model</h3><p>&#xCD5C;&#xADFC;&#xC5D4; &#xC0AC;&#xC804; &#xC815;&#xC758;&#xB41C; &#xBAA8;&#xB378;&#xC774;&#xB098; &#xC720;&#xC800;&#xB85C;&#xBD80;&#xD130; &#xC81C;&#xACF5;&#xBC1B;&#xB294; &#xBAA8;&#xB378;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xB294; &#xB300;&#xC2E0; infer model&#xC744; &#xC0AC;&#xC6A9;&#xD558; &#xC0AC;&#xB840;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB378; &#xCD94;&#xB860;&#xC740; instrumentation&#xACFC; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; Preprocess&#xB098; ConfUpdate &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>5.1.2.1 Model inference in Preprocess</p>
<p>TestMiner&#xB294; literal &#xAC12;&#xC744; &#xD1B5;&#xD574; &#xC815;&#xC0C1;&#xC801;&#xC778; input&#xC744; &#xC608;&#xCE21;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Skyfire&#xB294; &#xC2DC;&#xB4DC;&#xB4E4;&#xACFC; &#xBB38;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD55C; data-driven &#xBC29;&#xC2DD;&#xC73C;&#xB85C;, Probabilistic context-sensitive grammer&#xB97C; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xC2DC;&#xB4DC;&#xB97C; &#xB9CC;&#xB4DC;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. semantic&#xC774; &#xC720;&#xD6A8;&#xD55C; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xC9D1;&#xC911;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>IMF&#xB294; system API log&#xB97C; &#xBD84;&#xC11D;&#xD574; kernel API &#xBAA8;&#xB378;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; &#xD2B9;&#xC815; &#xC2DC;&#xD000;&#xC2A4;&#xC758; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; C &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>CodeAlchemist&#xB294; &#x201C;code brick&#x201D; &#xB2E8;&#xC704;&#xB85C; JavaScript&#xB97C; &#xBD84;&#xD574; &#xADF8;&#xC5D0; &#xB300;&#xC751;&#xD558;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xACE0; &#xC778;&#xC811;&#xD55C; brick&#xB07C;&#xB9AC;&#xC758; &#xBD84;&#xB9AC;&#xC640; &#xBCD1;&#xD569;&#xC774; &#xC758;&#xBBF8;&#xC0C1;&#xC73C;&#xB85C; &#xC720;&#xD6A8;&#xD55C;&#xC9C0; &#xAC80;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Neural&#xACFC; Learn&amp;Fuzz&#xB294; &#xC2E0;&#xACBD;&#xB9DD; &#xAE30;&#xBC18; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD;&#xC744; &#xD1B5;&#xD574; &#xC8FC;&#xC5B4;&#xC9C4; test file&#xB85C; &#xBAA8;&#xB378;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>5.1.2.2 Model inference in ConfUPDATE</p>
<p>Preprocess &#xB2E8;&#xACC4;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xB9E4; iteration&#xC774; &#xB05D;&#xB0A0; &#xB54C;&#xB9C8;&#xB2E4; &#xBAA8;&#xB378;&#xC744; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. PULSAR&#xB294; &#xCEA1;&#xCCD0;&#xD55C; network packet&#xC744; &#xD1B5;&#xD574; network protocol&#xC744; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD37C;&#xC9D5;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. state machine&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xAC01; state&#xC640; message&#xB97C; mapping &#xD558;&#xACE0; &#xC774;&#xB97C; &#xB098;&#xC911;&#xC5D0; test case &#xC0DD;&#xC131;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; I/O &#xD589;&#xC704;&#xB97C; &#xAD00;&#xCC30;&#xD574; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xCD94;&#xB860;&#xD558;&#xB294; state machine &#xC544;&#xC774;&#xB514;&#xC5B4;&#xAC00; &#xC81C;&#xC2DC;&#xB418;&#xAE30;&#xB3C4; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. GLADE&#xB294; PUT&#xC744; &#xD37C;&#xC9D5; &#xD558;&#xAE30; &#xC704;&#xD574; I/O &#xC0D8;&#xD50C;&#xB4E4;&#xB85C;&#xBD80;&#xD130; context-free grammer&#xB97C; &#xD569;&#xC131;&#xD574;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; inferred &#xBB38;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>go-fuzz&#xB294; grey-box fuzzer&#xB85C; seed pool&#xC5D0; seed&#xAC00; &#xCD94;&#xAC00;&#xB420; &#xB54C;&#xB9C8;&#xB2E4; &#xBAA8;&#xB378;&#xC744; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB378;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; seed&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-1-3-Encoder-Model"><a href="#5-1-3-Encoder-Model" class="headerlink" title="5.1.3 Encoder Model"></a>5.1.3 Encoder Model</h3><p>&#xD37C;&#xC9D5;&#xC740; &#xD2B9;&#xC815; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC744; &#xD30C;&#xC2F1; &#xD558;&#xB294; &#xB514;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xB4E4;&#xC740; &#xC800;&#xB9C8;&#xB2E4; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xC774;&#xB294; &#xD574;&#xB2F9; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC758; &#xC808;&#xB300;&#xC801;&#xC778; &#xBAA8;&#xB378;&#xC774;&#xB77C; &#xB9D0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>MutaGen&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB2F4;&#xAE34; &#xC808;&#xB300;&#xC801;&#xC778; &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xD37C;&#xC800;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xBBA4;&#xD14C;&#xC774;&#xC158; &#xAE30;&#xBC18; &#xD37C;&#xC800;&#xB4E4;&#xACFC;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC740; test case&#xB97C; mutate &#xD574; &#xC0C8;&#xB85C;&#xC6B4; test case&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; mutate &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC77C;&#xBD80;&#xB9CC; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791;&#xC774; &#xB2EC;&#xB77C;&#xC9C8; &#xAC70;&#xB77C;&#xB294; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xC5D0;&#xC11C; &#xCD9C;&#xBC1C;&#xD574; &#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xC778;&#xCF54;&#xB354;&#xC758; &#xC870;&#xAC01;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="5-2-Model-less-Fuzzer-mutation-based-fuzzer"><a href="#5-2-Model-less-Fuzzer-mutation-based-fuzzer" class="headerlink" title="5.2 Model-less Fuzzer (mutation-based fuzzer)"></a>5.2 Model-less Fuzzer (mutation-based fuzzer)</h2><p>&#xACE0;&#xC804;&#xC801;&#xC778; &#xB79C;&#xB364; &#xD14C;&#xC2A4;&#xD2B8;&#xB294; &#xD2B9;&#xC815; path &#xC0C1;&#xD669;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. if (input == 42)&#xB77C;&#xB294; C &#xAD6C;&#xBB38;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD558;&#xBA74; input&#xC774; 32-bit integer&#xB77C;&#xACE0; &#xD560; &#xB54C; &#xB79C;&#xB364; &#xD558;&#xAC8C; input&#xC744; &#xC815;&#xD574; &#xB9DE;&#xCD9C; &#xD655;&#xB960;&#xC740; 1/2^32&#xC785;&#xB2C8;&#xB2E4;. MP3 &#xD30C;&#xC77C;&#xCC98;&#xB7FC; &#xC798; &#xC9DC;&#xC5EC;&#xC9C4; input&#xC758; &#xACBD;&#xC6B0;, &#xC0C1;&#xD669;&#xC740; &#xB354;&#xC6B1; &#xC548;&#xC88B;&#xACA0;&#xC8E0;? &#xC758;&#xBBF8; &#xC788;&#xB294; &#xC2DC;&#xAC04; &#xB0B4;&#xB85C; &#xC628;&#xC804;&#xD55C; mp3&#xD30C;&#xC77C;&#xC744; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xB9D0;&#xC774; &#xC548; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xB79C;&#xB364; &#xD14C;&#xC2A4;&#xD2B8;&#xB85C;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD30C;&#xC2F1; &#xB2E8;&#xACC4;&#xBCF4;&#xB2E4; &#xB354; &#xAE4A;&#xC219;&#xD55C; path&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xAE30; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; seed-based &#xC778;&#xD48B; &#xC0DD;&#xC131;&#xACFC; white-box &#xC778;&#xD48B; &#xC0DD;&#xC131;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; Model-less &#xD37C;&#xC800;&#xB294; PUT&#xC758; &#xC778;&#xD48B;&#xC774; &#xB418;&#xB294; seed&#xB97C; &#xBCC0;&#xC870;&#xD574; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC77C;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD328;&#xD0B7;, UI &#xC774;&#xBCA4;&#xD2B8; &#xC2DC;&#xD000;&#xC2A4; &#xB4F1;&#xC774; seed&#xB85C; &#xC4F0;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. seed&#xC758; &#xC77C;&#xBD80;&#xB9CC;&#xC744; &#xBCC0;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC720;&#xD6A8;&#xD558;&#xBA74;&#xC11C;&#xB3C4; crash &#xB4F1;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0AC; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC778; &#xAC12;&#xC744; &#xD3EC;&#xD568;&#xD55C; input&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>seed&#xB97C; Mutate &#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-2-1-Bit-Flipping"><a href="#5-2-1-Bit-Flipping" class="headerlink" title="5.2.1 Bit-Flipping"></a>5.2.1 Bit-Flipping</h3><p>bit-flipping&#xC740; &#xB9CE;&#xC740; model-less &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBCF4;&#xD3B8;&#xC801;&#xC778; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. &#xACE0;&#xC815;&#xB41C; &#xAE38;&#xC774;&#xC758; bit&#xB97C; flip &#xD558;&#xAC70;&#xB098; flip&#xD560; &#xAE38;&#xC774;&#xB97C; &#xB79C;&#xB364;&#xC73C;&#xB85C; &#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA87;&#xBA87; &#xD37C;&#xC800;&#xB4E4;&#xC740; seed&#xB97C; mutate &#xD560; &#xB54C; mutation-ratio&#xC640; &#xAC19;&#xC740; user-configurable parameter&#xB97C; &#xBC1B;&#xC544; InputGen &#xD55C;&#xBC88; &#xB2F9; flip&#xD560; &#xBE44;&#xD2B8; &#xC218;&#xB97C; &#xC815;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; N-bit &#xD06C;&#xAE30;&#xC758; seed&#xC5D0;&#xC11C; K-bit &#xB9CC;&#xD07C; &#xB79C;&#xB364; &#xD558;&#xAC8C; flip &#xD560;&#xB54C; mutation-ratio&#xB294; K/N&#xC774; &#xB429;&#xB2C8;&#xB2E4;. SymFuzz&#xB294; &#xD37C;&#xC9D5; &#xD6A8;&#xC728;&#xC740; &#xC774; mutation-ratio&#xC5D0; &#xBBFC;&#xAC10;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; PUT&#xC5D0; &#xC801;&#xD569;&#xD55C; ratio &#xB530;&#xC708; &#xC5C6;&#xB294;&#xB370;, &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC88B;&#xC740; mutation-ratio&#xB97C; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBB50;&#xAC00; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p>BFF&#xC640; FOE&#xB294; mutation-ratio &#xC9D1;&#xD569;&#xC758; &#xC9C0;&#xC218; &#xBD84;&#xD3EC;&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xD6A8;&#xC728;&#xC801;&#xC778; ratio&#xC5D0; &#xB354; &#xB9CE;&#xC740; iteration&#xC744; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>SymFuzz&#xB294; white-box &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xAC01; &#xC2DC;&#xB4DC;&#xBCC4; &#xC801;&#xC808;&#xD55C; mutation-raito&#xB97C; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-2-2-Arithmetic-Mutation"><a href="#5-2-2-Arithmetic-Mutation" class="headerlink" title="5.2.2 Arithmetic Mutation"></a>5.2.2 Arithmetic Mutation</h3><p>AFL&#xACFC; honggfuzz&#xB294; mutate &#xD560; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC120;&#xD0DD;&#xD574; integer&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xACE0; &#xC0B0;&#xC220; &#xC5F0;&#xC0B0;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xBCC0;&#xC870;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; mutation&#xC758; &#xC601;&#xD5A5;&#xC744; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD575;&#xC2EC;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; AFL&#xC740; seed&#xC5D0;&#xC11C; 4byte&#xB97C; &#xC120;&#xD0DD;&#xD574; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xB41C; integer&#xC640; &#xB367;&#xC148; &#xD639;&#xC740; &#xBE84;&#xC148;&#xC744; &#xD574;&#xC11C; mutate &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xB418;&#xB294; integer&#xC758; &#xBC94;&#xC704;&#xB294; fuzzer&#xB9C8;&#xB2E4; &#xB2E4;&#xB974;&#xACE0; user-configurable &#xAC12;&#xC778; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. AFL&#xC758; &#xACBD;&#xC6B0;&#xC5D4; &#xC774; &#xBC94;&#xC704;&#xAC00; 0~35&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-2-3-Block-based-Mutation"><a href="#5-2-3-Block-based-Mutation" class="headerlink" title="5.2.3 Block-based Mutation"></a>5.2.3 Block-based Mutation</h3><p>&#xBA87; &#xAC00;&#xC9C0; block-based mutation &#xBC29;&#xBC95;&#xB860;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. block&#xC740; seed&#xC758; byte &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xBE14;&#xB85D;&#xC744; seed&#xC758; &#xC784;&#xC758; &#xC704;&#xCE58;&#xC5D0; &#xC0BD;&#xC785;</li>
<li>seed&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D;&#xC744; &#xC0AD;&#xC81C;</li>
<li>seed&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D; &#xAD50;&#xCCB4;</li>
<li>&#xC5EC;&#xB7EC; &#xBE14;&#xB85D;&#xC758; &#xC21C;&#xC11C;&#xB97C; &#xC7AC;&#xBC30;&#xCE58;</li>
<li>&#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D; &#xD06C;&#xAE30; resize &#xBC0F; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D; &#xCCA8;&#xAC00;</li>
</ol>
<h3 id="5-2-4-Dictionary-based-Mutation"><a href="#5-2-4-Dictionary-based-Mutation" class="headerlink" title="5.2.4 Dictionary-based Mutation"></a>5.2.4 Dictionary-based Mutation</h3><p>&#xC758;&#xBBF8; &#xAC00;&#xC911;&#xCE58;&#xAC00; &#xB192;&#xC740; &#xC0C1;&#xC218;&#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD37C;&#xC800;&#xB3C4; &#xC874;&#xC7AC;&#xD568;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; 0 &#xD639;&#xC740; -1, &#xD3EC;&#xBA67; &#xC2A4;&#xD2B8;&#xB9C1; &#xB4F1;&#xC774; mutation&#xC758; &#xB300;&#xC0C1;&#xC774; &#xB41C;&#xB2E4;. AFL&#xACFC; honggfuzz, libfuzzer&#xB294; 0&#xACFC; -1, &#xADF8;&#xB9AC;&#xACE0; 1&#xB4F1;&#xC758; &#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD574; Integer&#xB97C; mutation &#xD569;&#xB2C8;&#xB2E4;. Radamsa&#xB294; unicode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, GPF&#xB294; %x, %s &#xB4F1; &#xD3EC;&#xBA67; &#xBB38;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBB38;&#xC790;&#xC5F4;&#xC744; mutate&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="5-3-White-box-Fuzzers"><a href="#5-3-White-box-Fuzzers" class="headerlink" title="5.3 White-box Fuzzers"></a>5.3 White-box Fuzzers</h2><p>white-box fuzzer &#xB610;&#xD55C; model-based&#xC640; model-less&#xB85C; &#xBD84;&#xB958;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; dynamic symbolic execution&#xACFC; mutation &#xAE30;&#xBC18; &#xD37C;&#xC800;&#xB294; &#xBAA8;&#xB378;&#xC774; &#xD544;&#xC694; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC77C;&#xBD80; symbolic executor&#xB294; input grammer&#xB85C; symbolic executor&#xB97C; &#xAC00;&#xC774;&#xB4DC;&#xD558;&#xB294; &#xB4F1; input model&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; white-box &#xD37C;&#xC800;&#xB4E4;&#xC774; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; dynamic symbolic execution&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC;, &#xBAA8;&#xB4E0; white-box fuzzer&#xB4E4;&#xC774; dynamic symbolic executor&#xC778; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC77C;&#xBD80; &#xD37C;&#xC800;&#xB4E4;&#xC740; white-box &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; PUT&#xC774; &#xC218;&#xC6A9;&#xD558;&#xB294; input&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC5B4; &#xC774;&#xB97C; &#xD1B5;&#xD574; black-box, grey-box &#xD37C;&#xC9D5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-3-1-Dynamic-Symbolic-Execution"><a href="#5-3-1-Dynamic-Symbolic-Execution" class="headerlink" title="5.3.1 Dynamic Symbolic Execution"></a>5.3.1 Dynamic Symbolic Execution</h3><p>high level&#xC5D0;&#xC11C;&#xC758; &#xACE0;&#xC804;&#xC801; symbolic execution&#xC740; &#xBAA8;&#xB4E0; &#xAC00;&#xC9D3;&#xC218;&#xC758; input&#xC744; &#xC758;&#xBBF8;&#xD558;&#xB294; &#xBBF8;&#xC9C0;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. PUT&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC0C1;&#xC218;&#xAC12;&#xC744; &#xD3C9;&#xAC00;&#xD558;&#xB294; &#xB300;&#xC2E0; symbolic expression&#xC744; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xBB38;&#xC5D0; &#xB3C4;&#xB2EC;&#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xB450; &#xAC1C;&#xC758; sybolic interpreter&#xB97C; for k&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xB294; true, &#xB2E4;&#xB978; &#xD558;&#xB098;&#xB294; false branch&#xC5D0; &#xB3C4;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBAA8;&#xB4E0; path&#xB9C8;&#xB2E4; sybolic interpreter&#xB294; path formula&#xB97C; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xC758; concrete input&#xC774; &#xC6D0;&#xD558;&#xB294; path&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; path fomula&#xB294; &#xC801;&#xD569;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. SMT solver&#xC5D0; path fomula&#xC5D0; &#xB300;&#xD55C; &#xD574;&#xB2F5;&#xC744; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; concrete input&#xC744; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Dynamic symbolic execution&#xC740; symbolic execution&#xACFC; concrete execution&#xC774; &#xB3D9;&#xC2DC;&#xC5D0; &#xC9C4;&#xD589;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xC804;&#xD1B5;&#xC801;&#xC778; symbolic execution&#xACFC; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; dynmaic symbolic execution&#xC744; concolic ( concrete + symbolic ) testing&#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. &#xD575;&#xC2EC; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB294; concrete execution state&#xAC00; symbolic constraints&#xC758; &#xBCF5;&#xC7A1;&#xB3C4;&#xB97C; &#xAC10;&#xC18C;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD37C;&#xC9D5; &#xB9D0;&#xACE0;&#xB3C4; dynamic synbolic execution&#xB294; &#xC5EC;&#xB7EC; &#xACF3;&#xC5D0; &#xC801;&#xC6A9; &#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Dynamic symbolic exection&#xC740; PUT&#xC758; &#xBAA8;&#xB4E0; Instruction &#xD558;&#xB098;&#xD558;&#xB098; instrument &#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; grey-box, black-box &#xBCF4;&#xB2E4; &#xB290;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xB192;&#xC740; &#xBE44;&#xC6A9;&#xC744; &#xAC10;&#xB2F9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC881;&#xC740; &#xBC94;&#xC704;&#xC5D0;&#xB9CC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC804;&#xB7B5;&#xC774; &#xB300;&#xD45C;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; &#xC720;&#xC800;&#xAC00; &#xD2B9;&#xC815; &#xCF54;&#xB4DC;&#xB97C; &#xC801;&#xC6A9; &#xBC94;&#xC704;&#xC5D0;&#xC11C; &#xC81C;&#xC678;&#xC2DC;&#xD0A8;&#xB2E4;&#xB358;&#xAC00;, grey-box &#xD37C;&#xC9D5;&#xACFC; concolic testing&#xC744; &#xBC88;&#xAC08;&#xC544;&#xAC00;&#xBA70; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Driller&#xC640; Cyberdyne&#xC740; &#xBE60;&#xB978; concolic execution engine&#xC744; &#xAD6C;&#xD604;&#xD574; grey-box&#xC640; white-box &#xD37C;&#xC9D5;&#xC744; &#xD569;&#xCCE4;&#xC2B5;&#xB2C8;&#xB2E4;. DigFuzz&#xB294; grey-box&#xC640; white-box&#xD37C;&#xC9D5;&#xC744; &#xAD50;&#xB300;&#xD558;&#xBA70; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xCD5C;&#xC801;&#xD654;&#xD588;&#xB294;&#xB370;, &#xC6B0;&#xC120; grey-box&#xB85C; &#xAC01; path &#xBCC4; &#xB3C4;&#xB2EC; &#xD655;&#xB960;&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xACE0;, &#xADF8;&#xC911; grey-box&#xB85C; &#xB3C4;&#xB2EC;&#xD558;&#xAE30; &#xAC00;&#xC7A5; &#xD798;&#xB4E0; path&#xB4E4;&#xC740; white-box&#xAC00; &#xACF5;&#xB7B5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-3-2-Guided-Fuzzing"><a href="#5-3-2-Guided-Fuzzing" class="headerlink" title="5.3.2 Guided Fuzzing"></a>5.3.2 Guided Fuzzing</h3><p>&#xC77C;&#xBD80; &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xD37C;&#xC9D5;&#xC758; &#xD6A8;&#xC728;&#xC744; &#xB192;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAE30;&#xC220;&#xB4E4;&#xC740; &#xB450; &#xB2E8;&#xACC4;&#xB97C; &#xAC70;&#xCE58;&#xB294;&#xB370;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>PUT&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xB294; &#xBE44;&#xC6A9; &#xB192;&#xC740; &#xC791;&#xC5C5;</li>
<li>&#xC774;&#xC804; &#xB2E8;&#xACC4;&#xB85C;&#xBD80;&#xD130; &#xC5BB;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xD1A0;&#xB300;&#xB85C; test case&#xB97C; &#xC0DD;&#xC131;</li>
</ol>
<p>TaintScope&#xB294; fine-grained taint analysis&#xB97C; &#xD1B5;&#xD574; &#xCE58;&#xBA85;&#xC801;&#xC778; system call&#xC774;&#xB098; API&#xC5D0; &#xD758;&#xB7EC;&#xB4E4;&#xC5B4; &#xAC00;&#xB294; &#xB370;&#xC774;&#xD130;, &#x201C;Hot bytes&#x201D;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Dowser&#xB294; &#xCEF4;&#xD30C;&#xC77C; &#xB3C4;&#xC911; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; heuristic &#xC0C1; &#xBC84;&#xADF8;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC744; &#xB9CC;&#xD55C; loop(&#xC608;&#xB97C; &#xB4E4;&#xBA74; Pointer derefernce&#xB97C; &#xD3EC;&#xD568;&#xD55C; loop)&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; taint analysis&#xB97C; &#xD1B5;&#xD574; input bytes&#xC640; loop&#xB4E4; &#xC0AC;&#xC774;&#xC758; &#xAD00;&#xACC4;&#xB97C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; ciritical bytes&#xB9CC;&#xC744; symbolic&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; dynamic symbolic execution&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>VUzzer&#xC640; GRT&#xB294; input generation&#xC744; &#xAC00;&#xC774;&#xB4DC;&#xD558;&#xAE30; &#xC704;&#xD55C; PUT&#xC758; data-flow&#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xAE30; &#xC704;&#xD574; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xB458; &#xB2E4; &#xC0AC;&#xC6A9;&#xD574; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Angora &#xC640; Read Queen&#xB294; &#xCC98;&#xC74C;&#xC5D4; &#xB192;&#xC740; &#xBE44;&#xC6A9;&#xC744; &#xC9C0;&#xBD88;&#xD558;&#xBA70; instrumentaion&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; Input&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xC5BB;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xD1A0;&#xB300;&#xB3C4; &#xC11C;&#xC11C;&#xD788; instrumentation&#xC758; &#xBE44;&#xC6A9;&#xC744; &#xC904;&#xC774;&#xACE0; hot bytes &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC218;&#xC6A9;&#xD574; taint analysis&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="5-3-3-PUT-Mutation"><a href="#5-3-3-PUT-Mutation" class="headerlink" title="5.3.3 PUT Mutation"></a>5.3.3 PUT Mutation</h3><p>Fuzzing&#xC744; &#xC2E4;&#xC6A9;&#xC801;&#xC778; &#xBB38;&#xC81C; &#xC911; &#xD558;&#xB098;&#xB294; &#xBC14;&#xB85C; checksum &#xAC80;&#xC0AC;&#xB97C; &#xD1B5;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; PUT&#xC774; input&#xC744; &#xD30C;&#xC2F1; &#xD558;&#xAE30; &#xC804;&#xC5D0; checksum&#xC744; &#xACC4;&#xC0B0;&#xD55C;&#xB2E4;&#xBA74; PUT&#xC740; &#xB9CE;&#xC740; &#xC218;&#xC758; test case&#xB97C; &#xAC70;&#xBD80;&#xD560;  &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; TaintScope&#xB294; checksum-aware fuzzing &#xAE30;&#xC220;&#xC744; &#xC81C;&#xC548;&#xD569;&#xB2C8;&#xB2E4;. taint analysis&#xB97C; &#xD1B5;&#xD574; checksum test instruction&#xC744; &#xAD6C;&#xBCC4;&#xD558;&#xACE0; PUT&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xD328;&#xCE58;&#xD574; checksum &#xAC80;&#xC0AC;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; crash&#xB97C; &#xCC3E;&#xC558;&#xB2E4;&#xBA74; &#xCF54;&#xB4DC; &#xD328;&#xCE58; &#xC804; PUT&#xC758; &#xC62C;&#xBC14;&#xB978; checksum&#xC744; &#xACC4;&#xC0B0;&#xD574; Input&#xC744; &#xC218;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. T-Fuzz&#xB294; grey-box &#xD37C;&#xC9D5;&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB5A0;&#xD55C; &#xC885;&#xB958;&#xC758; &#xC870;&#xAC74;&#xBD80; branch&#xB77C;&#xB3C4; &#xD1B5;&#xACFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; NCC (Non-Critical Cehcks: &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB85C;&#xC9C1;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xACE0; &#xD328;&#xCE58;&#xD560; &#xC218; &#xC788;&#xB294; branch&#xB4E4;)&#xB97C; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. fuzzing campaign&#xC774; &#xC0C8;&#xB85C;&#xC6B4; Path&#xB97C; &#xB354;&#xC774;&#xC0C1; &#xCC3E;&#xC9C0; &#xBABB;&#xD558;&#xBA74; NCC&#xB97C; &#xD558;&#xB098; &#xC120;&#xD0DD;&#xD574; PUT&#xC744; &#xBCC0;&#xC870;&#xD558;&#xACE0; fuzzing&#xC744; &#xC7AC;&#xAC1C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p><img src="/2021/10/24/fabu1ous/fuzz-3/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; InputGen &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; InputEval &#xB2E8;&#xACC4;&#xAE4C;&#xC9C0; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC774;&#xC5C8;&#xC73C;&#xB098; &#xC544;&#xC27D;&#xAC8C;&#xB3C4; InputGen&#xAE4C;&#xC9C0;&#xB9CC; &#xC791;&#xC131;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB9CC;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xC694;&#xC998; hackyboiz &#xD300;&#xC6D0; &#xBAA8;&#xB450;&#xAC00; &#xC815;&#xC2E0;&#xC5C6;&#xC774; &#xC0B4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC65C; &#xC5F0;&#xB9D0;&#xB9CC; &#xB418;&#xBA74; &#xBC14;&#xC05C; &#xAC78;&#xAE4C;&#xC694;? &#xC544;&#xBB34;&#xD2BC; &#xB2E4;&#xC74C; Part&#xC5D0;&#xC120; &#xB098;&#xBA38;&#xC9C0; InputEval, ConfUpdate, Continue&#xB97C; &#xB2E4;&#xB8E8;&#xACE0; &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzer/">fuzzer</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/servey/">servey</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/10/26/fabu1ous/2021-10-26/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] WinRAR’s vulnerable trialware: when free software isn’t free</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/10/22/poosic/rpc/">
                    <span class="hidden-mobile">[해키피디아] RPC(Remote Procedure Call)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/';
        this.page.identifier = '/2021/10/24/fabu1ous/fuzz-3/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 퍼징 교양 수업 fuzz 101 - part3&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
