

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F642; &amp;#xD300;&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;, Offensive Security &amp;#xAD00;&amp;#xC810;&amp;#xC758; &amp;#xAE00;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB7FC; &amp;#xC2E0;&amp;#xC120;&amp;#xD558;&amp;#xAC8C; Defensive Security &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xD55C;&amp;#xD3B8; &amp;#xC368;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!(&lt;del&gt;&amp;#xD788;&amp;#xC5B4;&amp;#xB85C;&amp;#xC640; &amp;#xBE4C;&amp;#xB7F0;&amp;#xCC98;&amp;#xB7FC; &amp;#xC624;&amp;#xD39C;&amp;#xC2DC;&amp;#xBE0C;&amp;#xC640; &amp;#xB514;&amp;#xD39C;&amp;#xC2DC;&amp;#xBE0C;&amp;#xB294; &amp;#xCE6D;&amp;#xAD6C;&amp;#xCE6D;&amp;#xAD6C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694; ^-^&amp;#x2606;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Debugging&#34;&gt;&lt;a href=&#34;#&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Debugging&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&#34;&gt;&lt;/a&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&lt;/h1&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&lt;/strong&gt;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;, &amp;#xC989; &lt;strong&gt;&amp;#xBC84;&amp;#xADF8;(Bug)&lt;/strong&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD488;&amp;#xC9C8;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB370; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/1.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB418;&amp;#xAC8C; &amp;#xC798; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCF4;&amp;#xBA74;,&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://okky.kr/articles/272227&#34;&gt;&amp;#xCD08;&amp;#xBCF4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95; &amp;#xC18C;&amp;#xAC1C;&lt;/a&gt;&lt;br&gt;&lt;em&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC62C;&amp;#xBC14;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xC808;&amp;#xCC28;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;br&gt;(&amp;#xC7AC;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xD655;&amp;#xBCF4;) -&amp;gt; &amp;#xB2E8;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1; -&amp;gt; &amp;#xB2E8;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D; -&amp;gt; &amp;#xAC00;&amp;#xC124; &amp;#xC218;&amp;#xB9BD; -&amp;gt; &amp;#xAC00;&amp;#xC124; &amp;#xAC80;&amp;#xC99D;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC881;&amp;#xD600;&amp;#xAC00;&amp;#xBA70; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB9D0;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;(e.g., &amp;#xBCC0;&amp;#xC218; &amp;#xAC12;, &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC21C;&amp;#xC11C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xD0DC; &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xCC30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370;!! &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xB3C5;&amp;#xCC3D;&amp;#xC801;&amp;#xC778; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xACFC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F480;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;(Reverse Engineering)&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xC138;&amp;#xBD80;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC774;&amp;#xB7F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xD638;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC138;&amp;#xBD80; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;!!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Anti-Debugging&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;(Debugger)&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB3D9;&amp;#xC548; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC5B4;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/2.jpg&#34; alt&gt;&lt;br&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBC1C;&amp;#xC804; &amp;#xC911;&amp;#xC774;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xAC15;&amp;#xD55C; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xD1B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xC838;&amp;#xC628; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xB4E4;&amp;#xC758; &amp;#xAD50;&amp;#xACFC;&amp;#xC11C;, &amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xB4E4;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xBE14;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB098;&amp;#xBB47;&amp;#xC78E;&amp;#xCC45;(&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC;&amp;#xC6D0;&amp;#xB9AC;)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD574;&amp;#xC81C; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD06C;&amp;#xAC8C; Static &amp;#xADF8;&amp;#xB8F9;&amp;#xACFC; Dynamic &amp;#xADF8;&amp;#xB8F9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Static &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#x201C;Run&amp;#x201D;&amp;#xB420; &amp;#xB54C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;(+ API)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; Attach &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74;, PEB&amp;#xB098; TEB&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; NTQueryInformationProcess() &amp;#xB4F1;&amp;#xC758; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#x201C;Trace&amp;#x201D;&amp;#xD560; &amp;#xB54C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70; Exception &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC77C; &amp;#xC2DC;, &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xAC70;&amp;#xB098; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC784;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB3D9;&amp;#xC791; &amp;#xC911;&amp;#xC5D0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Static &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; Windows &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; API&amp;#xB85C;, &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;PEB (Process Environment Block)&lt;/strong&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &lt;code&gt;IsDebuggerPresent()&lt;/code&gt;&amp;#xB294; PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC778;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC12;&amp;#xC774; &lt;code&gt;1&lt;/code&gt;&amp;#xC774;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0;, &amp;#xAC12;&amp;#xC774; &lt;code&gt;0&lt;/code&gt;&amp;#xC774;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC774; &amp;#xC544;&amp;#xB2D8;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; Static &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &lt;strong&gt;&amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; API &amp;#xD638;&amp;#xCD9C;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;, &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Dynamic &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Dynamic &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &lt;strong&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC758; &amp;#xD589;&amp;#xB3D9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;, &amp;#xC815;&amp;#xC801; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD0D0;&amp;#xC9C0; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB4E0; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Timing Anti-Debugging)&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; start_time = t1; &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC2DC;&amp;#xAC04; &amp;#xCE21;&amp;#xC815; &lt;/span&gt;
&amp;lt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCF54;&amp;#xB4DC; &amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; end_time = t2;

&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; elapsed_time = end_time - start_time; 

&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (elapsed_time &amp;gt; threshold) { 
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger is detected!\n&amp;quot;&lt;/span&gt;);
}&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger is not detected!\n&amp;quot;&lt;/span&gt;); 
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD10;&amp;#xB3C4; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; Static &amp;#xAE30;&amp;#xBC95;&amp;#xBCF4;&amp;#xB2E4; Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0; &amp;#xC880; &amp;#xB354; &amp;#xB178;&amp;#xB825;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC10;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/part1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; Static &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC26C;&amp;#xC6B4; &amp;#xB9CC;&amp;#xD07C; Dynamic &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD574;&amp;#xC81C; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xC26C;&amp;#xC6CC; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Static &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xB418;&amp;#xACE0; &amp;#xD574;&amp;#xC81C;&amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xD06C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xBA74;, Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xD654;&amp;#xB098; &amp;#xB3D9;&amp;#xC801; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &lt;strong&gt;Static &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC740; &amp;#xBE60;&amp;#xB978; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC640; &amp;#xCC28;&amp;#xB2E8;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &lt;strong&gt;Dynamic &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC740; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xC6B0;&amp;#xD68C; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638;&amp;#xC5D0; &amp;#xB354; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Static &amp;#xBC29;&amp;#xBC95;&amp;#xACFC; Dynamic &amp;#xBC29;&amp;#xBC95;&amp;#xC758; &amp;#xCC28;&amp;#xC774; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xCC28;&amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC640; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xAC04;&amp;#xC758; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; API &amp;#xCC28;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xB97C; &amp;#xB4E0; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xBC0F; &amp;#xC720;&amp;#xB2C9;&amp;#xC2A4; &amp;#xACC4;&amp;#xC5F4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;ptrace()&lt;/code&gt; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;,&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs autoit&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;sys/ptrace.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;unistd.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;errno.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-built_in&#34;&gt;int&lt;/span&gt; main(void) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ptrace(PTRACE_TRACEME, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;) {
        printf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected or ptrace call failed!\n&amp;quot;&lt;/span&gt;)&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; EXIT_FAILURE&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
    }
    printf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;)&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; EXIT_SUCCESS&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ptrace()&lt;/code&gt; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ptrace()&lt;/code&gt;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC778;&amp;#xB370;, &lt;code&gt;PTRACE_TRACEME&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &lt;strong&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;&lt;/strong&gt; &amp;#xC774;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xACBD;&amp;#xACE0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xB4F1;&amp;#xC758; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xADF8; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/6.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC2E4;&amp;#xC2B5;&amp;#xACFC; &amp;#xD574;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :)&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC5EC;&amp;#xB2F4;&#34;&gt;&lt;a href=&#34;#&amp;#xC5EC;&amp;#xB2F4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5EC;&amp;#xB2F4;&#34;&gt;&lt;/a&gt;&amp;#xC5EC;&amp;#xB2F4;&lt;/h1&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD55C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0AC;&amp;#xC2E4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xB2F9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;&amp;#xC694;. &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xB4E4;&amp;#xC740; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB354;&amp;#xC6B1; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;, &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC640; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;, &amp;#xB9C8;&amp;#xCE58; &amp;#xD788;&amp;#xC5B4;&amp;#xB85C;&amp;#xC640; &amp;#xBE4C;&amp;#xB7F0;&amp;#xCC98;&amp;#xB7FC; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xCE58;&amp;#xC5F4;&amp;#xD55C; &amp;#xC804;&amp;#xC7C1;&amp;#xC744; &amp;#xCE58;&amp;#xB8E8;&amp;#xBA70; &amp;#xAE30;&amp;#xC220; &amp;#xBC1C;&amp;#xC804;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xD53C;&amp;#xC9C0;&amp;#xAE30;&amp;#xBA74; &amp;#xBC31;&amp;#xC804;&amp;#xBC31;&amp;#xC2B9;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xCC98;&amp;#xB7FC;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC219;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB3C4; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB144;&amp;#xC5D0; &amp;#xBD59;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC5F0;&amp;#xB9D0; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC2DC;&amp;#xACE0; 2025&amp;#xB144;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xC131;&amp;#xC7A5;&amp;#xD574;&amp;#xBCF4;&amp;#xC544;&amp;#xC694;! &amp;#x1F64C;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/7.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xBB38;&amp;#xD5CC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.openrce.org/reference_library/anti_reversing&#34;&gt;https://www.openrce.org/reference_library/anti_reversing&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://medium.com/naver-cloud-platform/&amp;#xBCF4;&amp;#xB2E4;-&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C;-&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;-&amp;#xAC8C;&amp;#xC784;&amp;#xC744;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;-2-b08352208672&#34;&gt;https://medium.com/naver-cloud-platform/&amp;#xBCF4;&amp;#xB2E4;-&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C;-&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;-&amp;#xAC8C;&amp;#xC784;&amp;#xC744;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;-2-b08352208672&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.naver.com/kby88power/220946544312&#34;&gt;https://blog.naver.com/kby88power/220946544312&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Anti-Debugging Part 1(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F642; &amp;#xD300;&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;, Offensive Security &amp;#xAD00;&amp;#xC810;&amp;#xC758; &amp;#xAE00;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB7FC; &amp;#xC2E0;&amp;#xC120;&amp;#xD558;&amp;#xAC8C; Defensive Security &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xD55C;&amp;#xD3B8; &amp;#xC368;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!(&lt;del&gt;&amp;#xD788;&amp;#xC5B4;&amp;#xB85C;&amp;#xC640; &amp;#xBE4C;&amp;#xB7F0;&amp;#xCC98;&amp;#xB7FC; &amp;#xC624;&amp;#xD39C;&amp;#xC2DC;&amp;#xBE0C;&amp;#xC640; &amp;#xB514;&amp;#xD39C;&amp;#xC2DC;&amp;#xBE0C;&amp;#xB294; &amp;#xCE6D;&amp;#xAD6C;&amp;#xCE6D;&amp;#xAD6C;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694; ^-^&amp;#x2606;&lt;/del&gt;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Debugging&#34;&gt;&lt;a href=&#34;#&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Debugging&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&#34;&gt;&lt;/a&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&lt;/h1&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Debugging)&lt;/strong&gt;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;, &amp;#xC989; &lt;strong&gt;&amp;#xBC84;&amp;#xADF8;(Bug)&lt;/strong&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xD488;&amp;#xC9C8;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xB370; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/1.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB418;&amp;#xAC8C; &amp;#xC798; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xAE00;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCF4;&amp;#xBA74;,&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://okky.kr/articles/272227&#34;&gt;&amp;#xCD08;&amp;#xBCF4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95; &amp;#xC18C;&amp;#xAC1C;&lt;/a&gt;&lt;br&gt;&lt;em&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xC62C;&amp;#xBC14;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xC808;&amp;#xCC28;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;br&gt;(&amp;#xC7AC;&amp;#xD604; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xD655;&amp;#xBCF4;) -&amp;gt; &amp;#xB2E8;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1; -&amp;gt; &amp;#xB2E8;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D; -&amp;gt; &amp;#xAC00;&amp;#xC124; &amp;#xC218;&amp;#xB9BD; -&amp;gt; &amp;#xAC00;&amp;#xC124; &amp;#xAC80;&amp;#xC99D;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xC881;&amp;#xD600;&amp;#xAC00;&amp;#xBA70; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB9D0;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;(e.g., &amp;#xBCC0;&amp;#xC218; &amp;#xAC12;, &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC21C;&amp;#xC11C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xD0DC; &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xAD00;&amp;#xCC30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370;!! &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A0;&amp;#xAE4C;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xB3C5;&amp;#xCC3D;&amp;#xC801;&amp;#xC778; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xACFC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x1F480;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;(Reverse Engineering)&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;, &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xC138;&amp;#xBD80;&amp;#xC801;&amp;#xC778; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC774;&amp;#xB7F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xD638;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xC138;&amp;#xBD80; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;!!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Anti-Debugging&#34;&gt;&lt;a href=&#34;#&amp;#xC548;&amp;#xD2F0;-&amp;#xB514;&amp;#xBC84;&amp;#xAE45;-Anti-Debugging&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&#34;&gt;&lt;/a&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Anti-Debugging)&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;(Debugger)&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADF8; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xC5EC;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5ED;&amp;#xACF5;&amp;#xD559; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xACFC; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB3D9;&amp;#xC548; &amp;#xC815;&amp;#xB9D0; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC5B4;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/2.jpg&#34; alt&gt;&lt;br&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xBC1C;&amp;#xC804; &amp;#xC911;&amp;#xC774;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xAC15;&amp;#xD55C; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xD1B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xC838;&amp;#xC628; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xB4E4;&amp;#xC758; &amp;#xAD50;&amp;#xACFC;&amp;#xC11C;, &amp;#xB9AC;&amp;#xBC84;&amp;#xC11C;&amp;#xB4E4;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xBE14;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB098;&amp;#xBB47;&amp;#xC78E;&amp;#xCC45;(&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC;&amp;#xC6D0;&amp;#xB9AC;)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xD574;&amp;#xC81C; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD06C;&amp;#xAC8C; Static &amp;#xADF8;&amp;#xB8F9;&amp;#xACFC; Dynamic &amp;#xADF8;&amp;#xB8F9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Static &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#x201C;Run&amp;#x201D;&amp;#xB420; &amp;#xB54C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;(+ API)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; Attach &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74;, PEB&amp;#xB098; TEB&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; NTQueryInformationProcess() &amp;#xB4F1;&amp;#xC758; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Dynamic &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#x201C;Trace&amp;#x201D;&amp;#xD560; &amp;#xB54C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70; Exception &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC77C; &amp;#xC2DC;, &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC78;&amp;#xAC70;&amp;#xB098; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC784;&amp;#xC744; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB3D9;&amp;#xC791; &amp;#xC911;&amp;#xC5D0; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xB809;&amp;#xC158;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Static &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt; &lt;/span&gt;{
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IsDebuggerPresent()) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected!\n&amp;quot;&lt;/span&gt;);
    } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; Windows &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; API&amp;#xB85C;, &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;PEB (Process Environment Block)&lt;/strong&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &lt;code&gt;IsDebuggerPresent()&lt;/code&gt;&amp;#xB294; PEB&amp;#xC758; &lt;code&gt;BeingDebugged&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC778;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC12;&amp;#xC774; &lt;code&gt;1&lt;/code&gt;&amp;#xC774;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0;, &amp;#xAC12;&amp;#xC774; &lt;code&gt;0&lt;/code&gt;&amp;#xC774;&amp;#xBA74; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC911;&amp;#xC774; &amp;#xC544;&amp;#xB2D8;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; Static &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &lt;strong&gt;&amp;#xC9C1;&amp;#xC811;&amp;#xC801;&amp;#xC778; API &amp;#xD638;&amp;#xCD9C;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;, &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Dynamic &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Dynamic &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &lt;strong&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC758; &amp;#xD589;&amp;#xB3D9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC758; &amp;#xC874;&amp;#xC7AC;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C;, &amp;#xC815;&amp;#xC801; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAD6C;&amp;#xD604;&amp;#xC744; &amp;#xD544;&amp;#xC694;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD0D0;&amp;#xC9C0; &amp;#xC815;&amp;#xD655;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB4E0; &amp;#xD0C0;&amp;#xC774;&amp;#xBC0D; &amp;#xAE30;&amp;#xBC18; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;(Timing Anti-Debugging)&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB290;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; start_time = t1; &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC2DC;&amp;#xAC04; &amp;#xCE21;&amp;#xC815; &lt;/span&gt;
&amp;lt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCF54;&amp;#xB4DC; &amp;#xC911; &amp;#xC77C;&amp;#xBD80;&amp;gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; end_time = t2;

&lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; elapsed_time = end_time - start_time; 

&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (elapsed_time &amp;gt; threshold) { 
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger is detected!\n&amp;quot;&lt;/span&gt;);
}&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;{
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger is not detected!\n&amp;quot;&lt;/span&gt;); 
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD10;&amp;#xB3C4; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; Static &amp;#xAE30;&amp;#xBC95;&amp;#xBCF4;&amp;#xB2E4; Dynamic &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0; &amp;#xC880; &amp;#xB354; &amp;#xB178;&amp;#xB825;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC10;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/part1.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; Static &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC26C;&amp;#xC6B4; &amp;#xB9CC;&amp;#xD07C; Dynamic &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD574;&amp;#xC81C; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xC26C;&amp;#xC6CC; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; Static &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xB418;&amp;#xACE0; &amp;#xD574;&amp;#xC81C;&amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xD06C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBC18;&amp;#xBA74;, Dynamic &amp;#xC548;&amp;#xD2F0;&amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xD654;&amp;#xB098; &amp;#xB3D9;&amp;#xC801; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xC790;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &lt;strong&gt;Static &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC740; &amp;#xBE60;&amp;#xB978; &amp;#xD0D0;&amp;#xC9C0;&amp;#xC640; &amp;#xCC28;&amp;#xB2E8;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &lt;strong&gt;Dynamic &amp;#xAE30;&amp;#xBC95;&lt;/strong&gt;&amp;#xC740; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xC6B0;&amp;#xD68C; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC544;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638;&amp;#xC5D0; &amp;#xB354; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Static &amp;#xBC29;&amp;#xBC95;&amp;#xACFC; Dynamic &amp;#xBC29;&amp;#xBC95;&amp;#xC758; &amp;#xCC28;&amp;#xC774; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xCC28;&amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC640; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xAC04;&amp;#xC758; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; API &amp;#xCC28;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC608;&amp;#xB97C; &amp;#xB4E0; &lt;code&gt;IsDebuggerPresent()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xBC0F; &amp;#xC720;&amp;#xB2C9;&amp;#xC2A4; &amp;#xACC4;&amp;#xC5F4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;ptrace()&lt;/code&gt; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;,&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs autoit&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;sys/ptrace.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;unistd.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;errno.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-built_in&#34;&gt;int&lt;/span&gt; main(void) {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (ptrace(PTRACE_TRACEME, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;) == &lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;) {
        printf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Debugger detected or ptrace call failed!\n&amp;quot;&lt;/span&gt;)&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; EXIT_FAILURE&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
    }
    printf(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;No debugger found.\n&amp;quot;&lt;/span&gt;)&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; EXIT_SUCCESS&lt;span class=&#34;hljs-comment&#34;&gt;;&lt;/span&gt;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ptrace()&lt;/code&gt; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xBD99;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ptrace()&lt;/code&gt;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC778;&amp;#xB370;, &lt;code&gt;PTRACE_TRACEME&lt;/code&gt; &amp;#xC635;&amp;#xC158;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &lt;strong&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xAC00; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C;&lt;/strong&gt; &amp;#xC774;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xACBD;&amp;#xACE0; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xB4F1;&amp;#xC758; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xADF8; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/6.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95; &amp;#xC2E4;&amp;#xC2B5;&amp;#xACFC; &amp;#xD574;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :)&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC5EC;&amp;#xB2F4;&#34;&gt;&lt;a href=&#34;#&amp;#xC5EC;&amp;#xB2F4;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5EC;&amp;#xB2F4;&#34;&gt;&lt;/a&gt;&amp;#xC5EC;&amp;#xB2F4;&lt;/h1&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD55C; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0AC;&amp;#xC2E4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xB2F9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD574;&amp;#xC694;. &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xB4E4;&amp;#xC740; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB354;&amp;#xC6B1; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xACFC; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xACFC; &amp;#xC548;&amp;#xD2F0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;, &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC640; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;, &amp;#xB9C8;&amp;#xCE58; &amp;#xD788;&amp;#xC5B4;&amp;#xB85C;&amp;#xC640; &amp;#xBE4C;&amp;#xB7F0;&amp;#xCC98;&amp;#xB7FC; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xCE58;&amp;#xC5F4;&amp;#xD55C; &amp;#xC804;&amp;#xC7C1;&amp;#xC744; &amp;#xCE58;&amp;#xB8E8;&amp;#xBA70; &amp;#xAE30;&amp;#xC220; &amp;#xBC1C;&amp;#xC804;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xD53C;&amp;#xC9C0;&amp;#xAE30;&amp;#xBA74; &amp;#xBC31;&amp;#xC804;&amp;#xBC31;&amp;#xC2B9;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xCC98;&amp;#xB7FC;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC219;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB3C4; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB144;&amp;#xC5D0; &amp;#xBD59;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC5F0;&amp;#xB9D0; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC2DC;&amp;#xACE0; 2025&amp;#xB144;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xC131;&amp;#xC7A5;&amp;#xD574;&amp;#xBCF4;&amp;#xC544;&amp;#xC694;! &amp;#x1F64C;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/12/29/OUYA77/Anti_part1/kr/7.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xBB38;&amp;#xD5CC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD575;&amp;#xC2EC; &amp;#xC6D0;&amp;#xB9AC;: &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xAC00;&amp;#xC758; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;(&amp;#xC800;&amp;#xC790; &amp;#xC774;&amp;#xC2B9;&amp;#xC6D0;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.openrce.org/reference_library/anti_reversing&#34;&gt;https://www.openrce.org/reference_library/anti_reversing&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://medium.com/naver-cloud-platform/&amp;#xBCF4;&amp;#xB2E4;-&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C;-&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;-&amp;#xAC8C;&amp;#xC784;&amp;#xC744;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;-2-b08352208672&#34;&gt;https://medium.com/naver-cloud-platform/&amp;#xBCF4;&amp;#xB2E4;-&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C;-&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;-&amp;#xAC8C;&amp;#xC784;&amp;#xC744;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;-2-b08352208672&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.naver.com/kby88power/220946544312&#34;&gt;https://blog.naver.com/kby88power/220946544312&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/part1.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/12/29/ouya77/anti_part1/kr/">

  <title>[Research] Anti-Debugging Part 1(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-12-29 16:00" pubdate>
      2024 12 29 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      52
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Anti-Debugging Part 1(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; &#xC0C8;&#xB85C; &#xC778;&#xC0AC;&#xB4DC;&#xB9AC;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; OUYA77 &#xC785;&#xB2C8;&#xB2E4;&#x1F642; &#xD300;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;&#xB4E4;&#xC744; &#xBCF4;&#xBA74;, Offensive Security &#xAD00;&#xC810;&#xC758; &#xAE00;&#xB4E4;&#xC774; &#xB9CE;&#xC740;&#xB370;&#xC694;. &#xC800;&#xB294; &#xADF8;&#xB7FC; &#xC2E0;&#xC120;&#xD558;&#xAC8C; Defensive Security &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xD55C;&#xD3B8; &#xC368;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;..!(<del>&#xD788;&#xC5B4;&#xB85C;&#xC640; &#xBE4C;&#xB7F0;&#xCC98;&#xB7FC; &#xC624;&#xD39C;&#xC2DC;&#xBE0C;&#xC640; &#xB514;&#xD39C;&#xC2DC;&#xBE0C;&#xB294; &#xCE6D;&#xAD6C;&#xCE6D;&#xAD6C;&#xB2C8;&#xAE4C;&#xC694; ^-^&#x2606;</del>)</p>
<p>&#xADF8;&#xB7FC; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xB514;&#xBC84;&#xAE45;-Debugging"><a href="#&#xB514;&#xBC84;&#xAE45;-Debugging" class="headerlink" title="&#xB514;&#xBC84;&#xAE45;(Debugging)"></a>&#xB514;&#xBC84;&#xAE45;(Debugging)</h1><p><strong>&#xB514;&#xBC84;&#xAE45;(Debugging)</strong>&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB38;&#xC81C;, &#xC989; <strong>&#xBC84;&#xADF8;(Bug)</strong>&#xB97C; &#xCC3E;&#xC544;&#xB0B4;&#xACE0; &#xC218;&#xC815;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xD488;&#xC9C8;&#xACFC; &#xC548;&#xC815;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD544;&#xC218;&#xC801;&#xC778; &#xB2E8;&#xACC4;&#xB85C;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC758;&#xB3C4;&#xD55C; &#xB300;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4DC;&#xB294; &#xB370; &#xC911;&#xC694;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/1.gif" srcset="/img/loading.gif" alt></p>
<p>&#xB514;&#xBC84;&#xAE45; &#xBC29;&#xBC95;&#xC744; &#xB418;&#xAC8C; &#xC798; &#xC18C;&#xAC1C;&#xD55C; &#xAE00;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xC77C;&#xBD80;&#xBD84;&#xC744; &#xAC00;&#xC838;&#xC640; &#xBCF4;&#xBA74;,</p>
<blockquote>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://okky.kr/articles/272227">&#xCD08;&#xBCF4; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xB514;&#xBC84;&#xAE45; &#xBC29;&#xBC95; &#xC18C;&#xAC1C;</a><br><em>&#xC81C;&#xAC00; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xC62C;&#xBC14;&#xB978; &#xB514;&#xBC84;&#xAE45;&#xC758; &#xC808;&#xCC28;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:<br>(&#xC7AC;&#xD604; &#xAC00;&#xB2A5;&#xC131; &#xD655;&#xBCF4;) -&gt; &#xB2E8;&#xC11C; &#xC218;&#xC9D1; -&gt; &#xB2E8;&#xC11C; &#xBD84;&#xC11D; -&gt; &#xAC00;&#xC124; &#xC218;&#xB9BD; -&gt; &#xAC00;&#xC124; &#xAC80;&#xC99D;</em></p>
</blockquote>
<p>&#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xB294; &#xACF3;&#xC744; &#xCC3E;&#xC544;&#xC11C; &#xBC94;&#xC704;&#xB97C; &#xC881;&#xD600;&#xAC00;&#xBA70; &#xC6D0;&#xC778;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xB9D0;&#xD558;&#xB294;&#xB370;&#xC694;. &#xB514;&#xBC84;&#xAE45; &#xB3C4;&#xAD6C;&#xB294; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB0B4;&#xBD80; &#xC0C1;&#xD0DC;(e.g., &#xBCC0;&#xC218; &#xAC12;, &#xD568;&#xC218; &#xD638;&#xCD9C; &#xC21C;&#xC11C;, &#xBA54;&#xBAA8;&#xB9AC; &#xC0C1;&#xD0DC; &#xB4F1;)&#xB97C; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xAD00;&#xCC30;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB7F0;&#xB370;!! &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC774; &#xAE30;&#xB2A5;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xBA74; &#xC5B4;&#xB5A4; &#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB0A0;&#xAE4C;&#xC694;?!</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xB2A5;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xCF54;&#xB4DC;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xB3C5;&#xCC3D;&#xC801;&#xC778; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xACFC; &#xB85C;&#xC9C1;&#xC744; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;&#x1F480;</p>
<p>&#xB610;&#xD55C; &#xC774; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC5ED;&#xACF5;&#xD559;&#xC801; &#xBD84;&#xC11D;(Reverse Engineering)&#xC5D0;&#xC11C; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xAE30;&#xB3C4; &#xD574;, &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD560; &#xACBD;&#xC6B0;&#xBCF4;&#xB2E4; &#xB354; &#xC138;&#xBD80;&#xC801;&#xC778; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD55C;&#xB370;&#xC694;. &#xB204;&#xAD6C;&#xB098; &#xC774;&#xB7F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC774; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xBCF4;&#xD638;&#xBC1B;&#xC544;&#xC57C;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC138;&#xBD80; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xB2E4; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xACA0;&#xC8E0;!!</p>
<p>&#xADF8;&#xB807;&#xAE30;&#xC5D0; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;(Anti-Debugging)&#xC774; &#xB098;&#xD0C0;&#xB098;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xC548;&#xD2F0;-&#xB514;&#xBC84;&#xAE45;-Anti-Debugging"><a href="#&#xC548;&#xD2F0;-&#xB514;&#xBC84;&#xAE45;-Anti-Debugging" class="headerlink" title="&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;(Anti-Debugging)"></a>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;(Anti-Debugging)</h1><p>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;(Anti-Debugging)&#xC740; &#xB514;&#xBC84;&#xAC70;(Debugger)&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xAC70;&#xB098; &#xADF8; &#xB3D9;&#xC791;&#xC744; &#xBC29;&#xD574;&#xD558;&#xC5EC;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC5ED;&#xACF5;&#xD559; &#xBC0F; &#xBD84;&#xC11D;&#xC5D0; &#xCDE8;&#xC57D;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xAE30;&#xC220;&#xACFC; &#xAE30;&#xBC95;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB3D9;&#xC548; &#xC815;&#xB9D0; &#xB9CE;&#xC740; &#xAE30;&#xBC95;&#xB4E4;&#xC774; &#xC5F0;&#xAD6C;&#xB418;&#xC5B4;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/2.jpg" srcset="/img/loading.gif" alt><br><img src="/2024/12/29/OUYA77/Anti_part1/kr/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC740; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xBC1C;&#xC804; &#xC911;&#xC774;&#xACE0; &#xB514;&#xBC84;&#xAC70;&#xC640; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xAC15;&#xD55C; &#xC758;&#xC874;&#xC131;&#xC774; &#xC788;&#xC5B4; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC5F0;&#xAD6C;&#xB418;&#xACE0; &#xC788;&#xB294;&#xB370;&#xC694;. &#xADF8; &#xC911;&#xC5D0;&#xC11C; &#xC815;&#xD1B5;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB904;&#xC838;&#xC628; &#xAE30;&#xBC95;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC18C;&#xAC1C;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9AC;&#xBC84;&#xC11C;&#xB4E4;&#xC758; &#xAD50;&#xACFC;&#xC11C;, &#xB9AC;&#xBC84;&#xC11C;&#xB4E4;&#xC758; &#xBC14;&#xC774;&#xBE14;&#xACFC; &#xAC19;&#xC740; &#xB098;&#xBB47;&#xC78E;&#xCC45;(&#xB9AC;&#xBC84;&#xC2F1; &#xD575;&#xC2EC;&#xC6D0;&#xB9AC;)&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC740; &#xD574;&#xC81C; &#xBC29;&#xBC95;&#xC5D0; &#xB530;&#xB77C; &#xD06C;&#xAC8C; Static &#xADF8;&#xB8F9;&#xACFC; Dynamic &#xADF8;&#xB8F9;&#xC73C;&#xB85C; &#xAD6C;&#xBD84;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Static &#xADF8;&#xB8F9;&#xC5D0; &#xC18D;&#xD55C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC740; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#x201C;Run&#x201D;&#xB420; &#xB54C; &#xB3D9;&#xC791;&#xD558;&#xBA70; &#xB2E4;&#xC591;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4;(+ API)&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB514;&#xBC84;&#xAC70;&#xAC00; Attach &#xB418;&#xC5B4;&#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74;, PEB&#xB098; TEB&#xC758; &#xAD6C;&#xC870;&#xCCB4; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC5EC; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xB514;&#xBC84;&#xAE45; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD558;&#xAC70;&#xB098; NTQueryInformationProcess() &#xB4F1;&#xC758; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; API&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xB514;&#xBC84;&#xAE45; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Dynamic &#xADF8;&#xB8F9;&#xC5D0; &#xC18D;&#xD55C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC740; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#x201C;Trace&#x201D;&#xD560; &#xB54C; &#xB3D9;&#xC791;&#xD558;&#xBA70; Exception &#xC815;&#xBCF4;&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAE45; &#xC911;&#xC77C; &#xC2DC;, &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xAC78;&#xAC70;&#xB098; &#xC2DC;&#xAC04;&#xC744; &#xCE21;&#xC815;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAE45; &#xC911;&#xC784;&#xC744; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xB4F1; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB3D9;&#xC791; &#xC911;&#xC5D0; &#xC77C;&#xC5B4;&#xB098;&#xB294; &#xC778;&#xD130;&#xB809;&#xC158;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAE45; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C; &#xCF54;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xCC28;&#xC774;&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<ul>
<li>Static &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;</li>
</ul>
<pre><code class="hljs cpp"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span> </span>{
    <span class="hljs-keyword">if</span> (IsDebuggerPresent()) {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger detected!\n&quot;</span>);
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;No debugger found.\n&quot;</span>);
    }
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p><code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xB294; Windows &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xB294; API&#xB85C;, &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB514;&#xBC84;&#xAC70;&#xC5D0; &#xC758;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xB418;&#xACE0; &#xC788;&#xB294;&#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xD568;&#xC218;&#xB294; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; <strong>PEB (Process Environment Block)</strong> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C;, <code>IsDebuggerPresent()</code>&#xB294; PEB&#xC758; <code>BeingDebugged</code> &#xD544;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xD544;&#xB4DC;&#xB294; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB514;&#xBC84;&#xAE45; &#xC911;&#xC778;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; 1&#xBC14;&#xC774;&#xD2B8; &#xD06C;&#xAE30;&#xC758; &#xD50C;&#xB798;&#xADF8;&#xC785;&#xB2C8;&#xB2E4;. &#xAC12;&#xC774; <code>1</code>&#xC774;&#xBA74; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC788;&#xC74C;&#xC744; &#xC758;&#xBBF8;&#xD558;&#xACE0;, &#xAC12;&#xC774; <code>0</code>&#xC774;&#xBA74; &#xB514;&#xBC84;&#xAE45; &#xC911;&#xC774; &#xC544;&#xB2D8;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xCC98;&#xB7FC; Static &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC740; <strong>&#xC9C1;&#xC811;&#xC801;&#xC778; API &#xD638;&#xCD9C;&#xC774;&#xB098; &#xAD6C;&#xC870;&#xCCB4; &#xD544;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xD655;&#xC778;</strong>&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C;, &#xAD6C;&#xD604;&#xC774; &#xAC04;&#xB2E8;&#xD558;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Dynamic &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;</li>
</ul>
<p>Dynamic &#xBC29;&#xC2DD;&#xC740; <strong>&#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xC911;&#xC758; &#xD589;&#xB3D9; &#xD328;&#xD134;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAC70;&#xC758; &#xC874;&#xC7AC;&#xB97C; &#xD0D0;&#xC9C0;</strong>&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC73C;&#xB85C;, &#xC815;&#xC801; &#xAE30;&#xBC95;&#xC5D0; &#xBE44;&#xD574; &#xBCF5;&#xC7A1;&#xD55C; &#xAD6C;&#xD604;&#xC744; &#xD544;&#xC694;&#xB85C; &#xD558;&#xC9C0;&#xB9CC; &#xD0D0;&#xC9C0; &#xC815;&#xD655;&#xB3C4;&#xAC00; &#xB192;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798;&#xC5D0; &#xC608;&#xC2DC;&#xB85C; &#xB4E0; &#xD0C0;&#xC774;&#xBC0D; &#xAE30;&#xBC18; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;(Timing Anti-Debugging)&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB514;&#xBC84;&#xAC70;&#xB97C; &#xBD99;&#xC5EC; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xB290;&#xB9AC;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC744; &#xCF54;&#xB4DC;&#xB85C; &#xD45C;&#xD604;&#xD558;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-keyword">uint64_t</span> start_time = t1; <span class="hljs-comment">//&#xC2DC;&#xC2A4;&#xD15C; &#xC2DC;&#xAC04; &#xCE21;&#xC815; </span>
&lt;&#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xCF54;&#xB4DC; &#xC911; &#xC77C;&#xBD80;&gt;
<span class="hljs-keyword">uint64_t</span> end_time = t2;

<span class="hljs-keyword">uint64_t</span> elapsed_time = end_time - start_time; 

<span class="hljs-keyword">if</span> (elapsed_time &gt; threshold) { 
		<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger is detected!\n&quot;</span>);
}<span class="hljs-keyword">else</span>{
		<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Debugger is not detected!\n&quot;</span>); 
}</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB9CC; &#xBD10;&#xB3C4; API&#xB97C; &#xD638;&#xCD9C;&#xD55C; Static &#xAE30;&#xBC95;&#xBCF4;&#xB2E4; Dynamic &#xAE30;&#xBC95;&#xC774; &#xAD6C;&#xD604;&#xC5D0; &#xC880; &#xB354; &#xB178;&#xB825;&#xC774; &#xB4E4;&#xC5B4;&#xAC10;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/part1.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7EC;&#xB098; Static &#xADF8;&#xB8F9;&#xC5D0; &#xC18D;&#xD55C; &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xAD6C;&#xD604;&#xC774; &#xC26C;&#xC6B4; &#xB9CC;&#xD07C; Dynamic &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xBCF4;&#xB2E4; &#xD574;&#xC81C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xC26C;&#xC6CC; &#xBE44;&#xAD50;&#xC801; &#xC27D;&#xAC8C; &#xC6B0;&#xD68C;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; Static &#xAE30;&#xBC95;&#xC774; &#xB514;&#xBC84;&#xAE45; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xC804;&#xC5D0; &#xBD84;&#xC11D;&#xB418;&#xACE0; &#xD574;&#xC81C;&#xB420; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xD06C;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC18;&#xBA74;, Dynamic &#xC548;&#xD2F0;&#xB514;&#xBC84;&#xAE45;&#xC740; &#xC2E4;&#xD589; &#xC911;&#xC5D0; &#xD658;&#xACBD; &#xBCC0;&#xD654;&#xB098; &#xB3D9;&#xC801; &#xC870;&#xAC74;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAC70;&#xB098; &#xD574;&#xC81C;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBD84;&#xC11D;&#xC790;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB7F0;&#xD0C0;&#xC784; &#xC0C1;&#xD669;&#xC744; &#xCDA9;&#xBD84;&#xD788; &#xC774;&#xD574;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC131;&#xC73C;&#xB85C; &#xC778;&#xD574; <strong>Static &#xAE30;&#xBC95;</strong>&#xC740; &#xBE60;&#xB978; &#xD0D0;&#xC9C0;&#xC640; &#xCC28;&#xB2E8;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD558;&#xC9C0;&#xB9CC;, <strong>Dynamic &#xAE30;&#xBC95;</strong>&#xC740; &#xB354; &#xBCF5;&#xC7A1;&#xD558;&#xACE0; &#xC6B0;&#xD68C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB192;&#xC544;, &#xC2DC;&#xC2A4;&#xD15C; &#xBCF4;&#xD638;&#xC5D0; &#xB354; &#xD6A8;&#xACFC;&#xC801;&#xC778; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Static &#xBC29;&#xBC95;&#xACFC; Dynamic &#xBC29;&#xBC95;&#xC758; &#xCC28;&#xC774; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C;, &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xB530;&#xB978; &#xCC28;&#xC774;&#xC5D0; &#xB530;&#xB77C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC774; &#xB2EC;&#xB77C;&#xC9C0;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC708;&#xB3C4;&#xC6B0;&#xC640; &#xB9AC;&#xB205;&#xC2A4; &#xAC04;&#xC758; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC740; &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xC758; &#xAD6C;&#xC870;&#xC640; API &#xCC28;&#xC774;&#xB85C; &#xC778;&#xD574; &#xB2E4;&#xB974;&#xAC8C; &#xAD6C;&#xD604;&#xB429;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0;&#xC11C; &#xC608;&#xB97C; &#xB4E0; <code>IsDebuggerPresent()</code> &#xD568;&#xC218;&#xB294; &#xC708;&#xB3C4;&#xC6B0;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9AC;&#xB205;&#xC2A4; &#xBC0F; &#xC720;&#xB2C9;&#xC2A4; &#xACC4;&#xC5F4; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C;&#xB294; <code>ptrace()</code> &#xC2DC;&#xC2A4;&#xD15C; &#xD638;&#xCD9C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC5F0;&#xACB0;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#xB97C; &#xD0D0;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;,</p>
<pre><code class="hljs autoit"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;sys/ptrace.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;unistd.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;errno.h&gt;</span></span>

<span class="hljs-built_in">int</span> main(void) {
    <span class="hljs-keyword">if</span> (ptrace(PTRACE_TRACEME, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>) == <span class="hljs-number">-1</span>) {
        printf(<span class="hljs-string">&quot;Debugger detected or ptrace call failed!\n&quot;</span>)<span class="hljs-comment">;</span>
        <span class="hljs-keyword">return</span> EXIT_FAILURE<span class="hljs-comment">;</span>
    }
    printf(<span class="hljs-string">&quot;No debugger found.\n&quot;</span>)<span class="hljs-comment">;</span>
    <span class="hljs-keyword">return</span> EXIT_SUCCESS<span class="hljs-comment">;</span>
}
</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB294; &#xB9AC;&#xB205;&#xC2A4; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; <code>ptrace()</code> &#xC2DC;&#xC2A4;&#xD15C; &#xD638;&#xCD9C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC5D0; &#xB514;&#xBC84;&#xAC70;&#xAC00; &#xBD99;&#xC5B4; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. <code>ptrace()</code>&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xCD94;&#xC801;&#xD558;&#xACE0; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C;&#xC778;&#xB370;, <code>PTRACE_TRACEME</code> &#xC635;&#xC158;&#xC740; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB514;&#xBC84;&#xAE45;&#xB418;&#xB3C4;&#xB85D; &#xD5C8;&#xC6A9;&#xD558;&#xB294; &#xC124;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCF54;&#xB4DC;&#xC758; &#xBAA9;&#xC801;&#xC740; <strong>&#xB514;&#xBC84;&#xAC70;&#xAC00; &#xAC10;&#xC9C0;&#xB418;&#xC5C8;&#xC744; &#xB54C;</strong> &#xC774;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xACE0; &#xACBD;&#xACE0; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xC790;&#xCCB4;&#xAC00; &#xB514;&#xBC84;&#xAC70;&#xB098; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xB4F1;&#xC758; &#xD2B9;&#xC131;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xB0B4;&#xC6A9;&#xC774;&#xAE30;&#xC5D0; &#xBC18;&#xB300;&#xB85C; &#xADF8; &#xD2B9;&#xC131;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;?</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/6.gif" srcset="/img/loading.gif" alt></p>
<p>&#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95; &#xC2E4;&#xC2B5;&#xACFC; &#xD574;&#xC81C;&#xC5D0; &#xB300;&#xD55C; &#xC2E4;&#xC2B5;&#xC740; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0; &#xC9C4;&#xD589;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; :)</p>
<h1 id="&#xC5EC;&#xB2F4;"><a href="#&#xC5EC;&#xB2F4;" class="headerlink" title="&#xC5EC;&#xB2F4;"></a>&#xC5EC;&#xB2F4;</h1><p>&#xC55E;&#xC5D0;&#xC11C; &#xC774;&#xC57C;&#xAE30;&#xD55C; &#xAC83;&#xCC98;&#xB7FC; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC790;&#xC2E0;&#xC758; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xC9C0;&#xB9CC;, &#xC0AC;&#xC2E4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC790;&#xC2E0;&#xC758; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xBD84;&#xC11D;&#xB2F9;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD574;&#xC694;. &#xBD84;&#xC11D;&#xAC00;&#xB4E4;&#xC740; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB354;&#xC6B1; &#xC815;&#xAD50;&#xD55C; &#xAE30;&#xBC95;&#xACFC; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD558;&#xACE0;, &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45; &#xAE30;&#xBC95;&#xC744; &#xBC1C;&#xC804;&#xC2DC;&#xD0A4;&#xB294; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xBC84;&#xC2F1;&#xACFC; &#xC548;&#xD2F0; &#xB9AC;&#xBC84;&#xC2F1;, &#xB514;&#xBC84;&#xAE45;&#xACFC; &#xC548;&#xD2F0; &#xB514;&#xBC84;&#xAE45;, &#xBD84;&#xC11D;&#xAC00;&#xC640; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;, &#xB9C8;&#xCE58; &#xD788;&#xC5B4;&#xB85C;&#xC640; &#xBE4C;&#xB7F0;&#xCC98;&#xB7FC; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xCE58;&#xC5F4;&#xD55C; &#xC804;&#xC7C1;&#xC744; &#xCE58;&#xB8E8;&#xBA70; &#xAE30;&#xC220; &#xBC1C;&#xC804;&#xC744; &#xC774;&#xC5B4;&#xC624;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC9C0;&#xD53C;&#xC9C0;&#xAE30;&#xBA74; &#xBC31;&#xC804;&#xBC31;&#xC2B9;&#xC774;&#xB77C;&#xB294; &#xB9D0;&#xCC98;&#xB7FC;, &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xC220;&#xC744; &#xC219;&#xC9C0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xACA0;&#xC8E0;? &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xB3C4; &#xBCF4;&#xB2E4; &#xC720;&#xC775;&#xD55C; &#xB0B4;&#xC6A9;&#xC73C;&#xB85C; &#xB0B4;&#xB144;&#xC5D0; &#xBD59;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC5F0;&#xB9D0; &#xC798; &#xBCF4;&#xB0B4;&#xC2DC;&#xACE0; 2025&#xB144;&#xC5D0;&#xB3C4; &#xAC19;&#xC774; &#xC131;&#xC7A5;&#xD574;&#xBCF4;&#xC544;&#xC694;! &#x1F64C;</p>
<p><img src="/2024/12/29/OUYA77/Anti_part1/kr/7.gif" srcset="/img/loading.gif" alt></p>
<p>&#xCC38;&#xACE0;&#xBB38;&#xD5CC;</p>
<ul>
<li>&#xB9AC;&#xBC84;&#xC2F1; &#xD575;&#xC2EC; &#xC6D0;&#xB9AC;: &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xAC00;&#xC758; &#xB9AC;&#xBC84;&#xC2F1; &#xC774;&#xC57C;&#xAE30;(&#xC800;&#xC790; &#xC774;&#xC2B9;&#xC6D0;)</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.openrce.org/reference_library/anti_reversing">https://www.openrce.org/reference_library/anti_reversing</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://medium.com/naver-cloud-platform/&#xBCF4;&#xB2E4;-&#xC548;&#xC804;&#xD558;&#xAC8C;-&#xBAA8;&#xBC14;&#xC77C;-&#xAC8C;&#xC784;&#xC744;-&#xC11C;&#xBE44;&#xC2A4;&#xD558;&#xB294;-&#xBC29;&#xBC95;-2-b08352208672">https://medium.com/naver-cloud-platform/&#xBCF4;&#xB2E4;-&#xC548;&#xC804;&#xD558;&#xAC8C;-&#xBAA8;&#xBC14;&#xC77C;-&#xAC8C;&#xC784;&#xC744;-&#xC11C;&#xBE44;&#xC2A4;&#xD558;&#xB294;-&#xBC29;&#xBC95;-2-b08352208672</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.naver.com/kby88power/220946544312">https://blog.naver.com/kby88power/220946544312</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/Reversing/">Reversing</a>
                  
                  <a class="hover-with-bg" href="/tags/Debugging/">Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/Anti-Debugging/">Anti-Debugging</a>
                  
                  <a class="hover-with-bg" href="/tags/Malware/">Malware</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/12/29/OUYA77/Anti_part1/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Anti-Debugging Part 1(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/12/28/mungsul/2024-12-28/">
                    <span class="hidden-mobile">[] CVE-2024-38200: Microsoft Office NTLMv2 Leak Vulnerability</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/12/29/OUYA77/Anti_part1/kr/';
        this.page.identifier = '/2024/12/29/OUYA77/Anti_part1/kr/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Anti-Debugging Part 1(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
