

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC758; &amp;#xC5D0;&amp;#xB2C8;&amp;#xADF8;&amp;#xB9C8; &amp;#xC554;&amp;#xD638; &amp;#xD574;&amp;#xB3C5;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; &amp;#xC601;&amp;#xD654; &amp;#xC774;&amp;#xBBF8;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xAC8C;&amp;#xC784;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A5;&amp;#xBA74;&amp;#xC5D0; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Turing&amp;#x2019;s work inspired generations of research into what scientist calls &amp;#x201C;turing machines&amp;#x201D;. Today, we call them computers.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC774; &amp;#xACE0;&amp;#xC548;&amp;#xD55C; &amp;#xAE30;&amp;#xACC4;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB367;&amp;#xC148;, &amp;#xBE84;&amp;#xC148;, &amp;#xACF1;&amp;#xC148;&amp;#xC740; &amp;#xBB3C;&amp;#xB860; &amp;#xD604;&amp;#xB300; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB2E4;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&amp;#xD29C;&amp;#xB9C1;-&amp;#xC644;&amp;#xC804;(Turing-Complete)&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xD29C;&amp;#xB9C1;-&amp;#xC644;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xBE44;&amp;#xB4DC; &amp;#xD790;&amp;#xBCA0;&amp;#xB974;&amp;#xD2B8;(David Hilbert)&amp;#xB294; &amp;#x2018;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xADF8; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xCC38;&amp;#xC778;&amp;#xC9C0; &amp;#xAC70;&amp;#xC9D3;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAC8C; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC904; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xC2DC;&amp;#xC624;&amp;#x2019; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB0B4;&amp;#xACE0;, &amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;(Halting Problem)&amp;#xB85C; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB780; &amp;#x2018;&amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB9D0;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xD654;&amp;#xB41C; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xAC00;?&amp;#x2019;(&amp;#xC5B4;&amp;#xB5A4; &amp;#xC785;&amp;#xB825; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC744; &amp;#xB54C;, &amp;#xC720;&amp;#xD55C;&amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xB2F5;&amp;#xC774; &amp;#xB098;&amp;#xC62C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;, &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504; &amp;#xB4F1;&amp;#xC744; &amp;#xB3CC;&amp;#xBA70; &amp;#xC601;&amp;#xC6D0;&amp;#xD788; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;)&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/15/y00n_nms/turing-machine/image.png&#34; alt=&#34;image&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB05D;&amp;#xC5C6;&amp;#xC774; &amp;#xAE34; &amp;#xCE78;&amp;#xC5D0; &amp;#xAE30;&amp;#xD638;&amp;#xB4E4;&amp;#xC774; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294; &amp;#xD14C;&amp;#xC774;&amp;#xD504;(Tape)&amp;#xC640; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB41C; &amp;#xAE30;&amp;#xD638;&amp;#xB97C; &amp;#xC77D;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;(Head), &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAE30;&amp;#xB85D;&amp;#xAE30;(State register), &amp;#xAE30;&amp;#xACC4;&amp;#xC758; &amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xD45C;(Action Table)&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xD45C;&amp;#xC758; &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#x2018;&amp;#xD604;&amp;#xC7AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#x2018;A&amp;#x2019;&amp;#xC77C; &amp;#xB54C; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;1&amp;#x2019;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x2018;P&amp;#x2019;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xCE78; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#x2018;B&amp;#x2019;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#x2019;, &amp;#x2018;&amp;#xD604;&amp;#xC7AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#x2018;C&amp;#x2019;&amp;#xC77C; &amp;#xB54C; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;1&amp;#x2019;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x2018;P&amp;#x2019;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xCE78; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#x2018;HALT&amp;#x2019;(&amp;#xC815;&amp;#xC9C0;)&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xADDC;&amp;#xCE59;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD14C;&amp;#xC774;&amp;#xD504; &amp;#xCE78;&amp;#xC758; &amp;#xAE30;&amp;#xD638;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xBA70; &amp;#xC88C;&amp;#xC6B0;&amp;#xB85C; &amp;#xC6C0;&amp;#xC9C1;&amp;#xC774;&amp;#xBA74;&amp;#xC11C; &amp;#xAE30;&amp;#xACC4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC804;&amp;#xBD80;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xAE30;&amp;#xACC4;&amp;#xAC00; &amp;#xB367;&amp;#xC148;&amp;#xB9CC; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, Universal Computing Machine&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC2DC;, &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xADC0;&amp;#xB958;&amp;#xBC95;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC815;&amp;#xC9C0;&amp;#xD560;&amp;#xC9C0; &amp;#xC548; &amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xC5EC; &amp;#xD310;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xD310;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C; &amp;#xD310;&amp;#xBCC4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &lt;code&gt;exit(a, i)&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0; a&amp;#xAC00; &amp;#xC785;&amp;#xB825; i&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74; true, &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; false&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; a(i)&amp;#xAC00; &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C4;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;exit(a, i)==false&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;exit&amp;#xB97C; &amp;#xBAA8;&amp;#xC21C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &lt;code&gt;subroutine()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;exit(s,s)&lt;/code&gt;&amp;#xB294; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;function subroutine(s){
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; exit(s,s) == false
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; true
	&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
		infinite loop
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;true&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; infinite loop&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xCC38;&amp;#xC77C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70;, false&amp;#xC774;&amp;#xBA74; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xB9C8;&amp;#xCE58; &amp;#x2018;&amp;#xC774; &amp;#xBB38;&amp;#xC7A5;&amp;#xC740; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&amp;#x2019; &amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xC774; &amp;#xCC38;&amp;#xC77C;&amp;#xC9C0;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xC21C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA8;&amp;#xC21C;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xADF8;&amp;#xB7F0; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xACB0;&amp;#xB860;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xBA70; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#x2018;&amp;#xACC4;&amp;#xC0B0;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xBC1D;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.udiprod.com/halting-problem/#faq&#34;&gt;&amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAC00;&amp;#xC7A5; &amp;#xC27D;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xC601;&amp;#xC0C1;&amp;#xACFC; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB0A8;&amp;#xAE34; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F5;&lt;/a&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xBCF4;&amp;#xC2DC;&amp;#xAE30;&amp;#xB97C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[해키피디아] Turing Machine, Halt Problem - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC758; &amp;#xC5D0;&amp;#xB2C8;&amp;#xADF8;&amp;#xB9C8; &amp;#xC554;&amp;#xD638; &amp;#xD574;&amp;#xB3C5;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; &amp;#xC601;&amp;#xD654; &amp;#xC774;&amp;#xBBF8;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xAC8C;&amp;#xC784;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC7A5;&amp;#xBA74;&amp;#xC5D0; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Turing&amp;#x2019;s work inspired generations of research into what scientist calls &amp;#x201C;turing machines&amp;#x201D;. Today, we call them computers.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC774; &amp;#xACE0;&amp;#xC548;&amp;#xD55C; &amp;#xAE30;&amp;#xACC4;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB367;&amp;#xC148;, &amp;#xBE84;&amp;#xC148;, &amp;#xACF1;&amp;#xC148;&amp;#xC740; &amp;#xBB3C;&amp;#xB860; &amp;#xD604;&amp;#xB300; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xB2E4;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798; &amp;#xAC78;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&amp;#xD29C;&amp;#xB9C1;-&amp;#xC644;&amp;#xC804;(Turing-Complete)&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xD29C;&amp;#xB9C1;-&amp;#xC644;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xBE44;&amp;#xB4DC; &amp;#xD790;&amp;#xBCA0;&amp;#xB974;&amp;#xD2B8;(David Hilbert)&amp;#xB294; &amp;#x2018;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xADF8; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xCC38;&amp;#xC778;&amp;#xC9C0; &amp;#xAC70;&amp;#xC9D3;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xAC8C; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC904; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xC2DC;&amp;#xC624;&amp;#x2019; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB0B4;&amp;#xACE0;, &amp;#xC568;&amp;#xB7F0; &amp;#xD29C;&amp;#xB9C1;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;(Halting Problem)&amp;#xB85C; &amp;#xBC1C;&amp;#xC804;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB780; &amp;#x2018;&amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB9D0;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xD654;&amp;#xB41C; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xAC00;?&amp;#x2019;(&amp;#xC5B4;&amp;#xB5A4; &amp;#xC785;&amp;#xB825; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBC1B;&amp;#xC558;&amp;#xC744; &amp;#xB54C;, &amp;#xC720;&amp;#xD55C;&amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xB2F5;&amp;#xC774; &amp;#xB098;&amp;#xC62C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;, &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504; &amp;#xB4F1;&amp;#xC744; &amp;#xB3CC;&amp;#xBA70; &amp;#xC601;&amp;#xC6D0;&amp;#xD788; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;)&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/15/y00n_nms/turing-machine/image.png&#34; alt=&#34;image&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB05D;&amp;#xC5C6;&amp;#xC774; &amp;#xAE34; &amp;#xCE78;&amp;#xC5D0; &amp;#xAE30;&amp;#xD638;&amp;#xB4E4;&amp;#xC774; &amp;#xC801;&amp;#xD600;&amp;#xC788;&amp;#xB294; &amp;#xD14C;&amp;#xC774;&amp;#xD504;(Tape)&amp;#xC640; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB41C; &amp;#xAE30;&amp;#xD638;&amp;#xB97C; &amp;#xC77D;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;(Head), &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAE30;&amp;#xB85D;&amp;#xAE30;(State register), &amp;#xAE30;&amp;#xACC4;&amp;#xC758; &amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xD45C;(Action Table)&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xD45C;&amp;#xC758; &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#x2018;&amp;#xD604;&amp;#xC7AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#x2018;A&amp;#x2019;&amp;#xC77C; &amp;#xB54C; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;1&amp;#x2019;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x2018;P&amp;#x2019;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xCE78; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#x2018;B&amp;#x2019;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#x2019;, &amp;#x2018;&amp;#xD604;&amp;#xC7AC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#x2018;C&amp;#x2019;&amp;#xC77C; &amp;#xB54C; &amp;#xD14C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;1&amp;#x2019;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74; &amp;#x2018;P&amp;#x2019;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xCE78; &amp;#xC774;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#x2018;HALT&amp;#x2019;(&amp;#xC815;&amp;#xC9C0;)&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xADDC;&amp;#xCE59;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB3D9; &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD14C;&amp;#xC774;&amp;#xD504; &amp;#xCE78;&amp;#xC758; &amp;#xAE30;&amp;#xD638;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xBA70; &amp;#xC88C;&amp;#xC6B0;&amp;#xB85C; &amp;#xC6C0;&amp;#xC9C1;&amp;#xC774;&amp;#xBA74;&amp;#xC11C; &amp;#xAE30;&amp;#xACC4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC804;&amp;#xBD80;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xAE30;&amp;#xACC4;&amp;#xAC00; &amp;#xB367;&amp;#xC148;&amp;#xB9CC; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, Universal Computing Machine&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC2DC;, &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xADC0;&amp;#xB958;&amp;#xBC95;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC815;&amp;#xC9C0;&amp;#xD560;&amp;#xC9C0; &amp;#xC548; &amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xC5EC; &amp;#xD310;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xAC83;&amp;#xC744; &amp;#xD310;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C; &amp;#xD310;&amp;#xBCC4; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &lt;code&gt;exit(a, i)&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0; a&amp;#xAC00; &amp;#xC785;&amp;#xB825; i&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74; true, &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; false&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; a(i)&amp;#xAC00; &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C4;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;exit(a, i)==false&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;exit&amp;#xB97C; &amp;#xBAA8;&amp;#xC21C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &lt;code&gt;subroutine()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;exit(s,s)&lt;/code&gt;&amp;#xB294; &amp;#xC790;&amp;#xAE30; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;function subroutine(s){
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; exit(s,s) == false
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; true
	&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;
		infinite loop
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;true&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; infinite loop&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xBB34;&amp;#xD55C;&amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xCC38;&amp;#xC77C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70;, false&amp;#xC774;&amp;#xBA74; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; &amp;#xB9C8;&amp;#xCE58; &amp;#x2018;&amp;#xC774; &amp;#xBB38;&amp;#xC7A5;&amp;#xC740; &amp;#xAC70;&amp;#xC9D3;&amp;#xB9D0;&amp;#xC774;&amp;#xB2E4;&amp;#x2019; &amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC7A5;&amp;#xC774; &amp;#xCC38;&amp;#xC77C;&amp;#xC9C0;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC77C;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xC21C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD6D; &amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA8;&amp;#xC21C;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xADF8;&amp;#xB7F0; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xACB0;&amp;#xB860;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xBA70; &amp;#xD29C;&amp;#xB9C1;&amp;#xBA38;&amp;#xC2E0;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#x2018;&amp;#xACC4;&amp;#xC0B0;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xBC1D;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.udiprod.com/halting-problem/#faq&#34;&gt;&amp;#xC815;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAC00;&amp;#xC7A5; &amp;#xC27D;&amp;#xAC8C; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xC601;&amp;#xC0C1;&amp;#xACFC; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB0A8;&amp;#xAE34; &amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2F5;&lt;/a&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xBCF4;&amp;#xC2DC;&amp;#xAE30;&amp;#xB97C; &amp;#xCD94;&amp;#xCC9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/hackypedia.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/09/15/y00n_nms/turing-machine/">

  <title>[해키피디아] Turing Machine, Halt Problem - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-09-15 14:00" pubdate>
      2021년 9월 15일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.2k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      23
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[해키피디아] Turing Machine, Halt Problem</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC568;&#xB7F0; &#xD29C;&#xB9C1;&#xC758; &#xC5D0;&#xB2C8;&#xADF8;&#xB9C8; &#xC554;&#xD638; &#xD574;&#xB3C5;&#xC744; &#xB2F4;&#xC740; &#xC601;&#xD654; &#xC774;&#xBBF8;&#xD14C;&#xC774;&#xC158; &#xAC8C;&#xC784;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xC7A5;&#xBA74;&#xC5D0; &#xB098;&#xC624;&#xB294; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>Turing&#x2019;s work inspired generations of research into what scientist calls &#x201C;turing machines&#x201D;. Today, we call them computers.</p>
</blockquote>
<p>&#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC740; &#xC568;&#xB7F0; &#xD29C;&#xB9C1;&#xC774; &#xACE0;&#xC548;&#xD55C; &#xAE30;&#xACC4;&#xB85C; &#xD2B9;&#xC815; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD1B5;&#xD574; &#xB367;&#xC148;, &#xBE84;&#xC148;, &#xACF1;&#xC148;&#xC740; &#xBB3C;&#xB860; &#xD604;&#xB300; &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xACC4;&#xC0B0;&#xC740; &#xBAA8;&#xB450; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xB2E4;&#xB9CC; &#xC2DC;&#xAC04;&#xC774; &#xC624;&#xB798; &#xAC78;&#xB9BD;&#xB2C8;&#xB2E4;.)</p>
<p>&#xD29C;&#xB9C1;-&#xC644;&#xC804;(Turing-Complete)&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB5A4; &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC73C;&#xB85C; &#xD560; &#xC218; &#xC788;&#xB294; &#xACC4;&#xC0B0;&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xADF8; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xD29C;&#xB9C1;-&#xC644;&#xC804;&#xD558;&#xB2E4;&#xACE0; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB370;&#xC774;&#xBE44;&#xB4DC; &#xD790;&#xBCA0;&#xB974;&#xD2B8;(David Hilbert)&#xB294; &#x2018;&#xBAA8;&#xB4E0; &#xC218;&#xD559;&#xC801; &#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xADF8; &#xBB38;&#xC81C;&#xAC00; &#xCC38;&#xC778;&#xC9C0; &#xAC70;&#xC9D3;&#xC778;&#xC9C0;&#xB97C; &#xD655;&#xC2E4;&#xD558;&#xAC8C; &#xACB0;&#xC815;&#xD574;&#xC904; &#xBA85;&#xD655;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xC99D;&#xBA85;&#xD558;&#xC2DC;&#xC624;&#x2019; &#xC640; &#xAC19;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xB0B4;&#xACE0;, &#xC568;&#xB7F0; &#xD29C;&#xB9C1;&#xC740; &#xC774;&#xB97C; &#xC815;&#xC9C0; &#xBB38;&#xC81C;(Halting Problem)&#xB85C; &#xBC1C;&#xC804;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC815;&#xC9C0; &#xBB38;&#xC81C;&#xB780; &#x2018;&#xC8FC;&#xC5B4;&#xC9C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD574;&#xACB0;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294;&#xC9C0; &#xB9D0;&#xD574;&#xC904; &#xC218; &#xC788;&#xB294; &#xC77C;&#xBC18;&#xD654;&#xB41C; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xAC00;?&#x2019;(&#xC5B4;&#xB5A4; &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBC1B;&#xC558;&#xC744; &#xB54C;, &#xC720;&#xD55C;&#xD55C; &#xB2E8;&#xACC4; &#xC774;&#xD6C4;&#xC5D0; &#xB2F5;&#xC774; &#xB098;&#xC62C; &#xAC83;&#xC778;&#xC9C0;, &#xBB34;&#xD55C;&#xB8E8;&#xD504; &#xB4F1;&#xC744; &#xB3CC;&#xBA70; &#xC601;&#xC6D0;&#xD788; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC778;&#xC9C0;)&#xB77C;&#xB294; &#xBB38;&#xC81C;&#xBA70; &#xC774;&#xB97C; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC73C;&#xB85C; &#xB17C;&#xB9AC;&#xC801;&#xC73C;&#xB85C; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC99D;&#xBA85;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/15/y00n_nms/turing-machine/image.png" srcset="/img/loading.gif" alt="image"></p>
<p><strong>&#xADF8;&#xB7FC; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC740; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;?</strong></p>
<p>&#xB05D;&#xC5C6;&#xC774; &#xAE34; &#xCE78;&#xC5D0; &#xAE30;&#xD638;&#xB4E4;&#xC774; &#xC801;&#xD600;&#xC788;&#xB294; &#xD14C;&#xC774;&#xD504;(Tape)&#xC640; &#xD14C;&#xC774;&#xD504;&#xC5D0; &#xAE30;&#xB85D;&#xB41C; &#xAE30;&#xD638;&#xB97C; &#xC77D;&#xAC70;&#xB098; &#xC218;&#xC815;&#xD558;&#xB294; &#xC7A5;&#xCE58;(Head), &#xADF8;&#xB9AC;&#xACE0; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xC0C1;&#xD0DC; &#xAE30;&#xB85D;&#xAE30;(State register), &#xAE30;&#xACC4;&#xC758; &#xC791;&#xB3D9; &#xADDC;&#xCE59;&#xD45C;(Action Table)&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC791;&#xB3D9; &#xADDC;&#xCE59;&#xD45C;&#xC758; &#xC608;&#xB97C; &#xB4E4;&#xBA74; &#x2018;&#xD604;&#xC7AC; &#xC0C1;&#xD0DC;&#xAC00; &#x2018;A&#x2019;&#xC77C; &#xB54C; &#xD14C;&#xC774;&#xD504;&#xC5D0;&#xC11C; &#x2018;1&#x2019;&#xC744; &#xB9CC;&#xB098;&#xBA74; &#x2018;P&#x2019;&#xB97C; &#xC4F0;&#xACE0; &#xC624;&#xB978;&#xCABD;&#xC73C;&#xB85C; &#xD55C; &#xCE78; &#xC774;&#xB3D9;&#xD558;&#xACE0; &#xC0C1;&#xD0DC;&#xB97C; &#x2018;B&#x2019;&#xB85C; &#xC218;&#xC815;&#x2019;, &#x2018;&#xD604;&#xC7AC; &#xC0C1;&#xD0DC;&#xAC00; &#x2018;C&#x2019;&#xC77C; &#xB54C; &#xD14C;&#xC774;&#xD504;&#xC5D0;&#xC11C; &#x2018;1&#x2019;&#xC744; &#xB9CC;&#xB098;&#xBA74; &#x2018;P&#x2019;&#xB97C; &#xC4F0;&#xACE0; &#xC624;&#xB978;&#xCABD;&#xC73C;&#xB85C; &#xD55C; &#xCE78; &#xC774;&#xB3D9;&#xD558;&#xACE0; &#xC0C1;&#xD0DC;&#xB97C; &#x2018;HALT&#x2019;(&#xC815;&#xC9C0;)&#xC73C;&#xB85C; &#xC218;&#xC815;&#xACFC; &#xAC19;&#xC740; &#xADDC;&#xCE59;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC791;&#xB3D9; &#xADDC;&#xCE59;&#xC5D0; &#xB530;&#xB77C; &#xD14C;&#xC774;&#xD504; &#xCE78;&#xC758; &#xAE30;&#xD638;&#xB97C; &#xC77D;&#xACE0; &#xC218;&#xC815;&#xD558;&#xBA70; &#xC88C;&#xC6B0;&#xB85C; &#xC6C0;&#xC9C1;&#xC774;&#xBA74;&#xC11C; &#xAE30;&#xACC4;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC804;&#xBD80;&#xC774;&#xBA70;, &#xC774;&#xB7EC;&#xD55C; &#xACFC;&#xC815;&#xC73C;&#xB85C; &#xACB0;&#xACFC;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD55C; &#xAE30;&#xACC4;&#xAC00; &#xB367;&#xC148;&#xB9CC; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74;, Universal Computing Machine&#xC740; &#xBAA8;&#xB4E0; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC774; &#xD560; &#xC218; &#xC788;&#xB294; &#xACC4;&#xC0B0;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xB2E4;&#xC2DC;, &#xC815;&#xC9C0; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xADC0;&#xB958;&#xBC95;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC774; &#xC815;&#xC9C0;&#xD560;&#xC9C0; &#xC548; &#xD560;&#xC9C0;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; &#xD310;&#xBCC4;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774;&#xAC83;&#xC744; &#xD310;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xB294; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC815;&#xC9C0; &#xBB38;&#xC81C; &#xD310;&#xBCC4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; <code>exit(a, i)</code> &#xD568;&#xC218;&#xB97C; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0; a&#xAC00; &#xC785;&#xB825; i&#xC5D0; &#xB300;&#xD574; &#xC815;&#xC9C0;&#xD558;&#xACE0; &#xACB0;&#xACFC;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xBA74; true, &#xC544;&#xB2C8;&#xB77C;&#xBA74; false&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC989; a(i)&#xAC00; &#xBB34;&#xD55C;&#xB8E8;&#xD504;&#xC5D0; &#xBE60;&#xC9C4;&#xB2E4;&#xBA74; <code>exit(a, i)==false</code>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>exit&#xB97C; &#xBAA8;&#xC21C; &#xC2DC;&#xD0A4;&#xB294; <code>subroutine()</code> &#xD568;&#xC218;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; <code>exit(s,s)</code>&#xB294; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC744; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xB123;&#xACE0; &#xC2E4;&#xD589;&#xD560; &#xB54C; &#xACB0;&#xACFC;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xAC80;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs python">function subroutine(s){
	<span class="hljs-keyword">if</span> exit(s,s) == false
		<span class="hljs-keyword">return</span> true
	<span class="hljs-keyword">else</span>
		infinite loop
}</code></pre>
<p>true&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; infinite loop&#xC5D0; &#xC758;&#xD574; &#xBB34;&#xD55C;&#xB8E8;&#xD504;&#xB97C; &#xD558;&#xBBC0;&#xB85C; &#xCC38;&#xC77C; &#xC218;&#xAC00; &#xC5C6;&#xC73C;&#xBA70;, false&#xC774;&#xBA74; true&#xB97C; &#xBC18;&#xD658;&#xD558;&#xBBC0;&#xB85C; &#xAC70;&#xC9D3;&#xC77C; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBCF5;&#xC7A1;&#xD574; &#xBCF4;&#xC774;&#xC9C0;&#xB9CC; &#xC774;&#xB294; &#xB9C8;&#xCE58; &#x2018;&#xC774; &#xBB38;&#xC7A5;&#xC740; &#xAC70;&#xC9D3;&#xB9D0;&#xC774;&#xB2E4;&#x2019; &#xB77C;&#xB294; &#xBB38;&#xC7A5;&#xC774; &#xCC38;&#xC77C;&#xC9C0;, &#xAC70;&#xC9D3;&#xC77C;&#xC9C0; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xBE44;&#xC2B7;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBAA8;&#xC21C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xC5EC; &#xACB0;&#xAD6D; &#xC815;&#xC9C0; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD560; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xBAA8;&#xC21C;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xADF8;&#xB7F0; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xACB0;&#xB860;&#xC774; &#xB098;&#xC624;&#xBA70; &#xD29C;&#xB9C1;&#xBA38;&#xC2E0;&#xC740; &#xC0AC;&#xC2E4;&#xC0C1; &#x2018;&#xACC4;&#xC0B0;&#x2019;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC758; &#xD55C;&#xACC4;&#xB97C; &#xBC1D;&#xD614;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.udiprod.com/halting-problem/#faq">&#xC815;&#xC9C0; &#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD574; &#xAC00;&#xC7A5; &#xC27D;&#xAC8C; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xC601;&#xC0C1;&#xACFC; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xB0A8;&#xAE34; &#xC9C8;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xB2F5;</a>&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xD574;&#xD558;&#xB294;&#xB370; &#xC5B4;&#xB824;&#xC6C0;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xBCF4;&#xC2DC;&#xAE30;&#xB97C; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Hackypedia/">Hackypedia</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/y00n-nms/">y00n_nms</a>
                  
                  <a class="hover-with-bg" href="/tags/turing-machine/">turing machine</a>
                  
                  <a class="hover-with-bg" href="/tags/alan-turing/">alan turing</a>
                  
                  <a class="hover-with-bg" href="/tags/halt-problem/">halt problem</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_y00n_nms.jpg" srcset="/img/loading.gif" alt="y00n_nms">
                  </div>

                  <div class="link-text">
                    <div class="link-title">y00n_nms</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/y00n_nms">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/09/16/j0ker/2021-09-16/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] Remote Code Execution 0-Day (CVE-2021-40444) Hits Windows, Triggered Via Office Docs</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/09/14/fabu1ous/2021-09-14/">
                    <span class="hidden-mobile">[하루한줄] PARALLELS DESKTOP STACK CLASH VULNERABILITY</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/09/15/y00n_nms/turing-machine/';
        this.page.identifier = '/2021/09/15/y00n_nms/turing-machine/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[해키피디아] Turing Machine, Halt Problem&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
