

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/19/clalxk/MacOS_TCC-Bypass_ko/&#34;&gt;macOS: Part0 - TCC Bypass&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;macOS: Part1 - SIP Bypass &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! TCC Bypass&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; SIP Bypass&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; macOS&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! Part2&amp;#xB3C4; &amp;#xAE30;&amp;#xB300;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; SIP Bypass &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Entitlement&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC9C0; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;hr&gt;
&lt;h2 id=&#34;System-Integrity-Protection-SIP&#34;&gt;&lt;a href=&#34;#System-Integrity-Protection-SIP&#34; class=&#34;headerlink&#34; title=&#34;System Integrity Protection, SIP&#34;&gt;&lt;/a&gt;System Integrity Protection, SIP&lt;/h2&gt;&lt;p&gt;SIP&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC870;&amp;#xCC28; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; macOS&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Apple &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC804;&amp;#xCCB4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB8E8;&amp;#xD2B8;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (SELinux&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xAC1C;&amp;#xB150;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC0AC;) &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xACE0;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574; &amp;#xB8E8;&amp;#xD2B8;&amp;#xD0B7; &amp;#xC124;&amp;#xCE58;, TCC &amp;#xC6B0;&amp;#xD68C;, &amp;#xC9C0;&amp;#xC18D;&amp;#xD615; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. SIP&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC5B4; &amp;#x2018;&lt;strong&gt;rootless&lt;/strong&gt;&amp;#x2019;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD88;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;SIP&amp;#xC640;-Entitlement&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#SIP&amp;#xC640;-Entitlement&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;SIP&amp;#xC640; Entitlement&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;/a&gt;SIP&amp;#xC640; Entitlement&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&lt;/h3&gt;&lt;p&gt;SIP&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;/System, /bin, /sbin, /usr(&amp;#xC77C;&amp;#xBD80; &amp;#xC81C;&amp;#xC678;)&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCEE4;&amp;#xB110; &amp;#xBC0F; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&lt;/li&gt;
&lt;li&gt;SIP&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xC18D;&amp;#xC131;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;SIP&amp;#xB97C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xBCF5;&amp;#xAD6C; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB4F1;&amp;#xC5D0;&amp;#xB294; SIP&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SIP&amp;#xC758; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;com.apple.rootless.install : SIP &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;li&gt;com.apple.rootless.install.heritable : &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; com.apple.rootless.install &amp;#xC0C1;&amp;#xC18D;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xD639;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#x201C;&lt;a href=&#34;https://developer.apple.com/documentation/bundleresources/entitlements&#34;&gt;&lt;strong&gt;Entitlement&lt;/strong&gt;&lt;/a&gt;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Entitlement&amp;#xB294; &amp;#xC571; &amp;#xC11C;&amp;#xBA85; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Apple&amp;#xC740; macOS&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Entitlement&amp;#xB97C; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70;, &amp;#xB9E4;&amp;#xC6B0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C;  &lt;code&gt;com.apple.rootless.install.heritable&lt;/code&gt;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &lt;code&gt;com.apple.rootless.install&lt;/code&gt;&amp;#xC744; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xC5EC; SIP &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAE08; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC774; Entitlement&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h3 id=&#34;SIP-&amp;#xC124;&amp;#xC815;-&amp;#xC800;&amp;#xC7A5;-&amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#SIP-&amp;#xC124;&amp;#xC815;-&amp;#xC800;&amp;#xC7A5;-&amp;#xC704;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;SIP &amp;#xC124;&amp;#xC815; &amp;#xC800;&amp;#xC7A5; &amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;/a&gt;SIP &amp;#xC124;&amp;#xC815; &amp;#xC800;&amp;#xC7A5; &amp;#xC704;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;SIP&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC0F; &amp;#xC138;&amp;#xBD80; &amp;#xD5C8;&amp;#xC6A9; &amp;#xC0AC;&amp;#xD56D;&amp;#xC740; &lt;strong&gt;bitflag&lt;/strong&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Intel Mac&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; NVRAM&amp;#xC758; &lt;code&gt;csr-active-config&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Apple Silicon (ARM) Mac&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBD80;&amp;#xD305; &amp;#xC2DC; Device Tree&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;lp-sip0&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4; &amp;#xAD6C;&amp;#xC131;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; SIP &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC77D;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBE44;&amp;#xD2B8; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;XNU &amp;#xCEE4;&amp;#xB110; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; csr.h&lt;/strong&gt; &amp;#xD5E4;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;*XNU&amp;#xB294; macOS&amp;#xC640; iOS&amp;#xC758; &amp;#xCEE4;&amp;#xB110;&amp;#xB85C;, Apple&amp;#xC774; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xCEE4;&amp;#xB110;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;SIP-&amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;-&amp;#xBAA9;&amp;#xB85D;&#34;&gt;&lt;a href=&#34;#SIP-&amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;-&amp;#xBAA9;&amp;#xB85D;&#34; class=&#34;headerlink&#34; title=&#34;SIP &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xBAA9;&amp;#xB85D;&#34;&gt;&lt;/a&gt;SIP &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xBAA9;&amp;#xB85D;&lt;/h3&gt;&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xB4DC; &amp;#xD558;&amp;#xB2E8;&amp;#xC758; &amp;#xD45C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; SIP &amp;#xAE30;&amp;#xB2A5; &amp;#xC81C;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;strong&gt;Bit &amp;#xC774;&amp;#xB984; (XNU &amp;#xCF54;&amp;#xB4DC; &amp;#xC0C1;)&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;&amp;#xAE30;&amp;#xB2A5; &amp;#xC124;&amp;#xBA85;&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNTRUSTED_KEXTS&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xD655;&amp;#xC7A5;(KEXT) &amp;#xB85C;&amp;#xB529; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_FS&lt;/td&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBB34;&amp;#xC81C;&amp;#xD55C; &amp;#xC811;&amp;#xADFC; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_TASK_FOR_PID&lt;/td&gt;
&lt;td&gt;&amp;#xD2B9;&amp;#xC815; PID&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; task &amp;#xD3EC;&amp;#xD2B8;(&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6A9;&amp;#xB3C4;) &amp;#xC811;&amp;#xADFC; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_KERNEL_DEBUGGER&lt;/td&gt;
&lt;td&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_DTRACE&lt;/td&gt;
&lt;td&gt;DTrace(&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC0F; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xB3C4;&amp;#xAD6C;)&amp;#xC758; &amp;#xBB34;&amp;#xC81C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_NVRAM&lt;/td&gt;
&lt;td&gt;NVRAM &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xC77D;&amp;#xAE30;&amp;#xB7;&amp;#xC4F0;&amp;#xAE30; &amp;#xC81C;&amp;#xD55C; &amp;#xD574;&amp;#xC81C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNAUTHENTICATED_ROOT&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; APFS &amp;#xB8E8;&amp;#xD2B8; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7; &amp;#xBD80;&amp;#xD305; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB294; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB450; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC0C1;&amp;#xD0DC;(0)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD604; macOS &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; SIP &amp;#xD65C;&amp;#xC131; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ csrutil status

System Integrity Protection status: enabled.&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;enabled: SIP&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;, &amp;#xAE30;&amp;#xBCF8; &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9; &amp;#xC911;&lt;/li&gt;
&lt;li&gt;disabled: SIP&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;intel &amp;#xAE30;&amp;#xBC18; Mac&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP &amp;#xC124;&amp;#xC815;&amp;#xC774; NVRAM &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ nvram csr-active-config

csr-active-config  w%00%00%00&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC12;&amp;#xC740; &lt;strong&gt;16&amp;#xC9C4;&amp;#xC218; &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/strong&gt;&amp;#xB85C; SIP&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAEBC;&amp;#xC838; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; 0x77&amp;#xC774;&amp;#xBA74; &amp;#xC5EC;&amp;#xB7EC; SIP &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Apple Silicon Mac&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; lp-sip0&amp;#xC744; Device Tree&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C;&amp;#xB294; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;SIP-Bypass-&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#SIP-Bypass-&amp;#xC608;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;SIP Bypass &amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;/a&gt;SIP Bypass &amp;#xC608;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&lt;code&gt;com.apple.rootless.install.heritable&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#x2018;drop_sip&amp;#x2019; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;DeviceProcessEvents
| &lt;span class=&#34;hljs-built_in&#34;&gt;where&lt;/span&gt; FileName =~ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;drop_sip&amp;quot;&lt;/span&gt;
| project InitiatingProcessFileName, ProcessCommandLine, SHA256&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;drop_sip&amp;#xB294; Apple&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC11C;&amp;#xBA85;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image1.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;/System/Library/PrivateFrameworks/SystemMigrationUtils.framework/Resources/Tools/drop_sip&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;strong&gt;csops()&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; SIP &amp;#xAD00;&amp;#xB828; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image2.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;.csops &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &lt;code&gt;p_csflags&lt;/code&gt; &amp;#xBA64;&amp;#xBC84; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA70; SIP&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0C1;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xC600;&amp;#xC73C;&amp;#xBA70;, &lt;strong&gt;com.apple.rootless.install.heritable&lt;/strong&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SIP &amp;#xC6B0;&amp;#xD68C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD558;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; drop_sip &amp;#xBC0F; &amp;#xD558;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;DeviceProcessEvents
| &lt;span class=&#34;hljs-built_in&#34;&gt;where&lt;/span&gt; InitiatingProcessFileName =~ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;systemmigrationd&amp;quot;&lt;/span&gt;
| summarize Hits=count(), Cmdline=any(ProcessCommandLine) by FileName&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC704; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; systemmigrationd&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Bash&amp;#xC640; Perl &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xAC00;(/bin/bash, /usr/bin/perl)&amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xAC74; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD78C;&amp;#xD2B8;&amp;#xC600;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;&amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xB294; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC785;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&lt;/strong&gt;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;strong&gt;FileName&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;Hits&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;Cmdline&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;bash&lt;/td&gt;
&lt;td&gt;498&lt;/td&gt;
&lt;td&gt;/bin/bash /System/Library/&amp;#x2026;/firstbootDirectoryServer&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;perl&lt;/td&gt;
&lt;td&gt;171&lt;/td&gt;
&lt;td&gt;/usr/bin/perl /usr/libexec/migrateLocalKDC &amp;#x2026;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Bash&amp;#xC758; &lt;code&gt;BASH_ENV&lt;/code&gt;&amp;#xB098; Perl&amp;#xC758; &lt;code&gt;PERL5OPT&lt;/code&gt; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC258; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_BASH_ENV.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;br&gt;BASH_ENV&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_PERL5OPT_ENV.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;PERL5OPT&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;launchctl setenv PERL5OPT &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;-Mwarnings;system(&amp;quot;/private/tmp/migraine.sh&amp;quot;)&amp;apos;&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74;, Perl&amp;#xC774; &amp;#xAE30;&amp;#xB3D9;&amp;#xB420; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC0BD;&amp;#xC785;&amp;#xD55C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;(/private/tmp/migraine.sh)&amp;#xAC00; SIP &amp;#xBCF4;&amp;#xD638; &amp;#xC601;&amp;#xC5ED; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; SIP &amp;#xC6B0;&amp;#xD68C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB370;&amp;#xBAAC;&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;strong&gt;&amp;#xC774; &amp;#xB370;&amp;#xBAAC;&amp;#xC774; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;&lt;/strong&gt;. &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC740; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xD55C; &amp;#xD6C4;&lt;/strong&gt;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &lt;strong&gt;&amp;#xC6D0;&amp;#xACA9; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xD2B9;&amp;#xC9D5;&lt;/strong&gt;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/strong&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;-&amp;#xC804;&amp;#xCCB4;-&amp;#xD750;&amp;#xB984;-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;-&amp;#xC804;&amp;#xCCB4;-&amp;#xD750;&amp;#xB984;-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984; &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984; &amp;#xC694;&amp;#xC57D;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/flow.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;Migration Assistant&lt;/strong&gt;&lt;br&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB9C8;&amp;#xBC95;&amp;#xC0AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xC571;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#x2192; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xBA70;, &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;SACLOStartLogoutWithOptions&lt;/code&gt; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#x2192; &amp;#xC774; &amp;#xC571;&amp;#xC740; &lt;code&gt;com.apple.private.mbsystemadministration&lt;/code&gt;&amp;#xB77C;&amp;#xB294; Entitlement&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MBSystemAdministration&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Migration Assistant&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &lt;strong&gt;proxy&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;Setup Assistant&lt;/strong&gt;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;_mbsetupuser&lt;/code&gt;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, GUI &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;XPC&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xBA70;, &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; Entitlement&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &lt;strong&gt;&amp;#xAC70;&amp;#xBD80;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Setup Assistant&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;com.apple.private.systemmigration.daemonclient&lt;/code&gt; Entitlement&amp;#xB97C; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &lt;strong&gt;XPC&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;systemmigrationd&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;SystemMigration.framework&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;/Library/SystemMigration/Queue &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC694;&amp;#xCCAD; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &lt;strong&gt;&amp;#x201C;In-Flight&amp;#x201D;&lt;/strong&gt; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;strong&gt;bash&amp;#xB098; perl &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&lt;/strong&gt;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &lt;code&gt;&amp;#xC774; &amp;#xC810;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xB300;&amp;#xB85C;, &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; systemmigrationd&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;SystemMigration.framework&lt;/code&gt;&amp;#xC758; &lt;code&gt;SystemMigrationDaemon&lt;/code&gt; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; XPC &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image4.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;rax = [SystemMigrationDaemon sharedDaemon];
[rax startListeningForConnections];&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xB370;&amp;#xBAAC;&amp;#xC740; &amp;#xC790;&amp;#xCCB4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &amp;#xADF8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;(bash/perl &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Migration-Assistant-&amp;#xD328;&amp;#xCE58;-&amp;#xC2DC;&amp;#xB3C4;&#34;&gt;&lt;a href=&#34;#Migration-Assistant-&amp;#xD328;&amp;#xCE58;-&amp;#xC2DC;&amp;#xB3C4;&#34; class=&#34;headerlink&#34; title=&#34;Migration Assistant &amp;#xD328;&amp;#xCE58; &amp;#xC2DC;&amp;#xB3C4;&#34;&gt;&lt;/a&gt;Migration Assistant &amp;#xD328;&amp;#xCE58; &amp;#xC2DC;&amp;#xB3C4;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image5.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;SIP &amp;#xC6B0;&amp;#xD68C;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Microsoft&amp;#xB294; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC778;&lt;/strong&gt; &lt;code&gt;SACLOStartLogoutWithOptions()&lt;/code&gt;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB824; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xC5C6;&amp;#xC774; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB300;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, 3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xC11C;&amp;#xBA85; &amp;#xC2E4;&amp;#xD328; (codesign failure)&lt;/strong&gt;&lt;br&gt;macOS&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC21C;&amp;#xAC04; &amp;#xC11C;&amp;#xBA85;&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xCC28;&amp;#xB2E8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;PAC(Pointer Authentication Code) &amp;#xBBF8;&amp;#xAC80;&amp;#xC99D; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&lt;br&gt;&amp;#xCD5C;&amp;#xC2E0; Apple Silicon(macOS arm64e)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;PAC &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;strong&gt;PAC &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC5D4;&amp;#xD0C0;&amp;#xC774;&amp;#xD2C0;&amp;#xBA3C;&amp;#xD2B8; &amp;#xC0C1;&amp;#xC2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; Migration Assistant &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;com.apple.private.mbsystemadministration&lt;/code&gt; Entitlement&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &lt;strong&gt;MBSystemAdministration&amp;#xC640;&amp;#xC758; XPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xB7;&amp;#xC218;&amp;#xC815;&amp;#xB7;&amp;#xC7AC;&amp;#xC870;&amp;#xB9BD;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; Entitlement&amp;#xAC00; &lt;strong&gt;&amp;#xC190;&amp;#xC2E4;&amp;#xB418;&amp;#xC5B4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xCC28;&amp;#xB2E8;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098; Migration Assistant&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Setup Assistant&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;(AppleScript, &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;)&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#x2018;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAC1C;&amp;#xC785;&amp;#x2019; &amp;#xC5C6;&amp;#xC774; systemmigrationd &amp;#xB370;&amp;#xBAAC;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xACE0;, bash/perl &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;Apple&amp;#xC758;-&amp;#xB300;&amp;#xC751;&#34;&gt;&lt;a href=&#34;#Apple&amp;#xC758;-&amp;#xB300;&amp;#xC751;&#34; class=&#34;headerlink&#34; title=&#34;Apple&amp;#xC758; &amp;#xB300;&amp;#xC751;&#34;&gt;&lt;/a&gt;Apple&amp;#xC758; &amp;#xB300;&amp;#xC751;&lt;/h2&gt;&lt;p&gt;&amp;#xC704; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C; Apple&amp;#xC740; &amp;#xC57D; 2&amp;#xAC00;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;launchd&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xC804;&amp;#xB2EC; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xAE08;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAE30;&amp;#xC874;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; launchctl setenv &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; BASH_ENV, PERL5OPT &amp;#xB4F1; &amp;#xD2B9;&amp;#xC815; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB4A4;, systemmigrationd&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Apple&amp;#xC740; &lt;strong&gt;launchd&amp;#xAC00; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB0B4;&amp;#xBD80; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC;, &amp;#xC544;&amp;#xC608; &amp;#xC774; &amp;#xBC29;&amp;#xBC95; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;launchctl setenv WHATEVER blah
&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xC624;&amp;#xB958; &amp;#xBC1C;&amp;#xC0DD;:&lt;/span&gt;
Could not &lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; environment: 150: Operation not permitted &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; System Integrity Protection is engaged&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;drop_sip &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; SIP &amp;#xC6B0;&amp;#xD68C; capability&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&lt;/strong&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xBD80;&amp;#xD130; Entitlement, &amp;#xC6B0;&amp;#xD68C; &amp;#xBC0F; &amp;#xD65C;&amp;#xC6A9; &amp;#xBC29;&amp;#xC548;, &amp;#xD328;&amp;#xCE58; &amp;#xACB0;&amp;#xACFC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Sandbox Escape&amp;#xC744; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf&#34;&gt;https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md&#34;&gt;https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.youtube.com/watch?v=zxZesAN-TEk&#34;&gt;https://www.youtube.com/watch?v=zxZesAN-TEk&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.offsec.com/blog/macos-kernel-debugging-with-sip/&#34;&gt;https://www.offsec.com/blog/macos-kernel-debugging-with-sip/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://objective-see.org/blog/blog_0x14.html&#34;&gt;https://objective-see.org/blog/blog_0x14.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/&#34;&gt;https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf&#34;&gt;https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] macOS: Part1 - SIP Bypass (ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/19/clalxk/MacOS_TCC-Bypass_ko/&#34;&gt;macOS: Part0 - TCC Bypass&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;macOS: Part1 - SIP Bypass &amp;#x2190; Now!&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! TCC Bypass&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; SIP Bypass&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; macOS&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! Part2&amp;#xB3C4; &amp;#xAE30;&amp;#xB300;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; SIP Bypass &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Entitlement&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC9C0; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;hr&gt;
&lt;h2 id=&#34;System-Integrity-Protection-SIP&#34;&gt;&lt;a href=&#34;#System-Integrity-Protection-SIP&#34; class=&#34;headerlink&#34; title=&#34;System Integrity Protection, SIP&#34;&gt;&lt;/a&gt;System Integrity Protection, SIP&lt;/h2&gt;&lt;p&gt;SIP&amp;#xB294; &amp;#xB8E8;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC870;&amp;#xCC28; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC0AD;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; macOS&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Apple &amp;#xC0CC;&amp;#xB4DC;&amp;#xBC15;&amp;#xC2A4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC804;&amp;#xCCB4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB8E8;&amp;#xD2B8;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (SELinux&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xAC1C;&amp;#xB150;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC0AC;) &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xACE0;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574; &amp;#xB8E8;&amp;#xD2B8;&amp;#xD0B7; &amp;#xC124;&amp;#xCE58;, TCC &amp;#xC6B0;&amp;#xD68C;, &amp;#xC9C0;&amp;#xC18D;&amp;#xD615; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. SIP&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC5B4; &amp;#x2018;&lt;strong&gt;rootless&lt;/strong&gt;&amp;#x2019;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xBD88;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;SIP&amp;#xC640;-Entitlement&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#SIP&amp;#xC640;-Entitlement&amp;#xC758;-&amp;#xAD00;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;SIP&amp;#xC640; Entitlement&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&#34;&gt;&lt;/a&gt;SIP&amp;#xC640; Entitlement&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&lt;/h3&gt;&lt;p&gt;SIP&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;/System, /bin, /sbin, /usr(&amp;#xC77C;&amp;#xBD80; &amp;#xC81C;&amp;#xC678;)&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCEE4;&amp;#xB110; &amp;#xBC0F; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&lt;/li&gt;
&lt;li&gt;SIP&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xC18D;&amp;#xC131;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;SIP&amp;#xB97C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xBCF5;&amp;#xAD6C; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB4F1;&amp;#xC5D0;&amp;#xB294; SIP&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SIP&amp;#xC758; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAD8C;&amp;#xD55C;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;com.apple.rootless.install : SIP &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&lt;/li&gt;
&lt;li&gt;com.apple.rootless.install.heritable : &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; com.apple.rootless.install &amp;#xC0C1;&amp;#xC18D;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xD639;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#x201C;&lt;a href=&#34;https://developer.apple.com/documentation/bundleresources/entitlements&#34;&gt;&lt;strong&gt;Entitlement&lt;/strong&gt;&lt;/a&gt;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Entitlement&amp;#xB294; &amp;#xC571; &amp;#xC11C;&amp;#xBA85; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Apple&amp;#xC740; macOS&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Entitlement&amp;#xB97C; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70;, &amp;#xB9E4;&amp;#xC6B0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C;  &lt;code&gt;com.apple.rootless.install.heritable&lt;/code&gt;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xBFD0; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &lt;code&gt;com.apple.rootless.install&lt;/code&gt;&amp;#xC744; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xC5EC; SIP &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAE08; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC774; Entitlement&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h3 id=&#34;SIP-&amp;#xC124;&amp;#xC815;-&amp;#xC800;&amp;#xC7A5;-&amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#SIP-&amp;#xC124;&amp;#xC815;-&amp;#xC800;&amp;#xC7A5;-&amp;#xC704;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;SIP &amp;#xC124;&amp;#xC815; &amp;#xC800;&amp;#xC7A5; &amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;/a&gt;SIP &amp;#xC124;&amp;#xC815; &amp;#xC800;&amp;#xC7A5; &amp;#xC704;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;SIP&amp;#xC758; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xBC0F; &amp;#xC138;&amp;#xBD80; &amp;#xD5C8;&amp;#xC6A9; &amp;#xC0AC;&amp;#xD56D;&amp;#xC740; &lt;strong&gt;bitflag&lt;/strong&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Intel Mac&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; NVRAM&amp;#xC758; &lt;code&gt;csr-active-config&lt;/code&gt; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Apple Silicon (ARM) Mac&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBD80;&amp;#xD305; &amp;#xC2DC; Device Tree&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;lp-sip0&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4; &amp;#xAD6C;&amp;#xC131;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; SIP &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xC77D;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBE44;&amp;#xD2B8; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;XNU &amp;#xCEE4;&amp;#xB110; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; csr.h&lt;/strong&gt; &amp;#xD5E4;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;*XNU&amp;#xB294; macOS&amp;#xC640; iOS&amp;#xC758; &amp;#xCEE4;&amp;#xB110;&amp;#xB85C;, Apple&amp;#xC774; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xCEE4;&amp;#xB110;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;SIP-&amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;-&amp;#xBAA9;&amp;#xB85D;&#34;&gt;&lt;a href=&#34;#SIP-&amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;-&amp;#xBAA9;&amp;#xB85D;&#34; class=&#34;headerlink&#34; title=&#34;SIP &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xBAA9;&amp;#xB85D;&#34;&gt;&lt;/a&gt;SIP &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xBAA9;&amp;#xB85D;&lt;/h3&gt;&lt;p&gt;&amp;#xC2AC;&amp;#xB77C;&amp;#xC774;&amp;#xB4DC; &amp;#xD558;&amp;#xB2E8;&amp;#xC758; &amp;#xD45C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; SIP &amp;#xAE30;&amp;#xB2A5; &amp;#xC81C;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;strong&gt;Bit &amp;#xC774;&amp;#xB984; (XNU &amp;#xCF54;&amp;#xB4DC; &amp;#xC0C1;)&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;&amp;#xAE30;&amp;#xB2A5; &amp;#xC124;&amp;#xBA85;&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNTRUSTED_KEXTS&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xD655;&amp;#xC7A5;(KEXT) &amp;#xB85C;&amp;#xB529; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_FS&lt;/td&gt;
&lt;td&gt;&amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBB34;&amp;#xC81C;&amp;#xD55C; &amp;#xC811;&amp;#xADFC; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_TASK_FOR_PID&lt;/td&gt;
&lt;td&gt;&amp;#xD2B9;&amp;#xC815; PID&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; task &amp;#xD3EC;&amp;#xD2B8;(&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC6A9;&amp;#xB3C4;) &amp;#xC811;&amp;#xADFC; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_KERNEL_DEBUGGER&lt;/td&gt;
&lt;td&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_DTRACE&lt;/td&gt;
&lt;td&gt;DTrace(&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC0F; &amp;#xD2B8;&amp;#xB808;&amp;#xC774;&amp;#xC2F1; &amp;#xB3C4;&amp;#xAD6C;)&amp;#xC758; &amp;#xBB34;&amp;#xC81C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNRESTRICTED_NVRAM&lt;/td&gt;
&lt;td&gt;NVRAM &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xC77D;&amp;#xAE30;&amp;#xB7;&amp;#xC4F0;&amp;#xAE30; &amp;#xC81C;&amp;#xD55C; &amp;#xD574;&amp;#xC81C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CSR_ALLOW_UNAUTHENTICATED_ROOT&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; APFS &amp;#xB8E8;&amp;#xD2B8; &amp;#xC2A4;&amp;#xB0C5;&amp;#xC0F7; &amp;#xBD80;&amp;#xD305; &amp;#xD5C8;&amp;#xC6A9;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB294; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xBB34;&amp;#xB825;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB450; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xC0C1;&amp;#xD0DC;(0)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD604; macOS &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; SIP &amp;#xD65C;&amp;#xC131; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ csrutil status

System Integrity Protection status: enabled.&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;enabled: SIP&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;, &amp;#xAE30;&amp;#xBCF8; &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9; &amp;#xC911;&lt;/li&gt;
&lt;li&gt;disabled: SIP&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;intel &amp;#xAE30;&amp;#xBC18; Mac&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP &amp;#xC124;&amp;#xC815;&amp;#xC774; NVRAM &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ nvram csr-active-config

csr-active-config  w%00%00%00&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC12;&amp;#xC740; &lt;strong&gt;16&amp;#xC9C4;&amp;#xC218; &amp;#xBE44;&amp;#xD2B8;&amp;#xD50C;&amp;#xB798;&amp;#xADF8;&lt;/strong&gt;&amp;#xB85C; SIP&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xAEBC;&amp;#xC838; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; 0x77&amp;#xC774;&amp;#xBA74; &amp;#xC5EC;&amp;#xB7EC; SIP &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Apple Silicon Mac&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; lp-sip0&amp;#xC744; Device Tree&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC704; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C;&amp;#xB294; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;SIP-Bypass-&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#SIP-Bypass-&amp;#xC608;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;SIP Bypass &amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;/a&gt;SIP Bypass &amp;#xC608;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&lt;code&gt;com.apple.rootless.install.heritable&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#x2018;drop_sip&amp;#x2019; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;DeviceProcessEvents
| &lt;span class=&#34;hljs-built_in&#34;&gt;where&lt;/span&gt; FileName =~ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;drop_sip&amp;quot;&lt;/span&gt;
| project InitiatingProcessFileName, ProcessCommandLine, SHA256&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;drop_sip&amp;#xB294; Apple&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC11C;&amp;#xBA85;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image1.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;/System/Library/PrivateFrameworks/SystemMigrationUtils.framework/Resources/Tools/drop_sip&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;strong&gt;csops()&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; SIP &amp;#xAD00;&amp;#xB828; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image2.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;.csops &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &lt;code&gt;p_csflags&lt;/code&gt; &amp;#xBA64;&amp;#xBC84; &amp;#xC218;&amp;#xC815;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA70; SIP&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image3.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0C1;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xC600;&amp;#xC73C;&amp;#xBA70;, &lt;strong&gt;com.apple.rootless.install.heritable&lt;/strong&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SIP &amp;#xC6B0;&amp;#xD68C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD558;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC0C1;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; drop_sip &amp;#xBC0F; &amp;#xD558;&amp;#xC704; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; SIP&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;DeviceProcessEvents
| &lt;span class=&#34;hljs-built_in&#34;&gt;where&lt;/span&gt; InitiatingProcessFileName =~ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;systemmigrationd&amp;quot;&lt;/span&gt;
| summarize Hits=count(), Cmdline=any(ProcessCommandLine) by FileName&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4;&amp;#xB85C; &amp;#xC704; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; systemmigrationd&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; Bash&amp;#xC640; Perl &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xAC00;(/bin/bash, /usr/bin/perl)&amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xAC74; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD78C;&amp;#xD2B8;&amp;#xC600;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC65C;&amp;#xB0D0;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;&amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xB294; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCF54;&amp;#xB4DC; &amp;#xC8FC;&amp;#xC785;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&lt;/strong&gt;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&lt;strong&gt;FileName&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;Hits&lt;/strong&gt;&lt;/th&gt;
&lt;th&gt;&lt;strong&gt;Cmdline&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;bash&lt;/td&gt;
&lt;td&gt;498&lt;/td&gt;
&lt;td&gt;/bin/bash /System/Library/&amp;#x2026;/firstbootDirectoryServer&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;perl&lt;/td&gt;
&lt;td&gt;171&lt;/td&gt;
&lt;td&gt;/usr/bin/perl /usr/libexec/migrateLocalKDC &amp;#x2026;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Bash&amp;#xC758; &lt;code&gt;BASH_ENV&lt;/code&gt;&amp;#xB098; Perl&amp;#xC758; &lt;code&gt;PERL5OPT&lt;/code&gt; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC258; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_BASH_ENV.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;br&gt;BASH_ENV&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_PERL5OPT_ENV.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;PERL5OPT&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;launchctl setenv PERL5OPT &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;-Mwarnings;system(&amp;quot;/private/tmp/migraine.sh&amp;quot;)&amp;apos;&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74;, Perl&amp;#xC774; &amp;#xAE30;&amp;#xB3D9;&amp;#xB420; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC0BD;&amp;#xC785;&amp;#xD55C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;(/private/tmp/migraine.sh)&amp;#xAC00; SIP &amp;#xBCF4;&amp;#xD638; &amp;#xC601;&amp;#xC5ED; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; SIP &amp;#xC6B0;&amp;#xD68C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB370;&amp;#xBAAC;&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xACF5;&amp;#xACA9; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC0BC;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;strong&gt;&amp;#xC774; &amp;#xB370;&amp;#xBAAC;&amp;#xC774; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;&lt;/strong&gt;. &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC740; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xD55C; &amp;#xD6C4;&lt;/strong&gt;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &lt;strong&gt;&amp;#xC6D0;&amp;#xACA9; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xD2B9;&amp;#xC9D5;&lt;/strong&gt;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC6B0;&amp;#xD68C; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/strong&gt;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;-&amp;#xC804;&amp;#xCCB4;-&amp;#xD750;&amp;#xB984;-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;-&amp;#xC804;&amp;#xCCB4;-&amp;#xD750;&amp;#xB984;-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984; &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC804;&amp;#xCCB4; &amp;#xD750;&amp;#xB984; &amp;#xC694;&amp;#xC57D;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/flow.jpg&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;Migration Assistant&lt;/strong&gt;&lt;br&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB9C8;&amp;#xBC95;&amp;#xC0AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xC571;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#x2192; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xBA70;, &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;SACLOStartLogoutWithOptions&lt;/code&gt; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#x2192; &amp;#xC774; &amp;#xC571;&amp;#xC740; &lt;code&gt;com.apple.private.mbsystemadministration&lt;/code&gt;&amp;#xB77C;&amp;#xB294; Entitlement&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MBSystemAdministration&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;Migration Assistant&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &lt;strong&gt;proxy&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;Setup Assistant&lt;/strong&gt;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;_mbsetupuser&lt;/code&gt;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA70;, GUI &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;XPC&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xBA70;, &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; Entitlement&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &lt;strong&gt;&amp;#xAC70;&amp;#xBD80;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Setup Assistant&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;systemmigrationd&lt;/code&gt;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;com.apple.private.systemmigration.daemonclient&lt;/code&gt; Entitlement&amp;#xB97C; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &lt;strong&gt;XPC&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;systemmigrationd&lt;/strong&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;SystemMigration.framework&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;/Library/SystemMigration/Queue &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC694;&amp;#xCCAD; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &lt;strong&gt;&amp;#x201C;In-Flight&amp;#x201D;&lt;/strong&gt; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;strong&gt;bash&amp;#xB098; perl &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&lt;/strong&gt;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &lt;code&gt;&amp;#xC774; &amp;#xC810;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xB300;&amp;#xB85C;, &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; systemmigrationd&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;SystemMigration.framework&lt;/code&gt;&amp;#xC758; &lt;code&gt;SystemMigrationDaemon&lt;/code&gt; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; XPC &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image4.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;rax = [SystemMigrationDaemon sharedDaemon];
[rax startListeningForConnections];&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xB370;&amp;#xBAAC;&amp;#xC740; &amp;#xC790;&amp;#xCCB4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &amp;#xADF8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;(bash/perl &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Migration-Assistant-&amp;#xD328;&amp;#xCE58;-&amp;#xC2DC;&amp;#xB3C4;&#34;&gt;&lt;a href=&#34;#Migration-Assistant-&amp;#xD328;&amp;#xCE58;-&amp;#xC2DC;&amp;#xB3C4;&#34; class=&#34;headerlink&#34; title=&#34;Migration Assistant &amp;#xD328;&amp;#xCE58; &amp;#xC2DC;&amp;#xB3C4;&#34;&gt;&lt;/a&gt;Migration Assistant &amp;#xD328;&amp;#xCE58; &amp;#xC2DC;&amp;#xB3C4;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image5.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;SIP &amp;#xC6B0;&amp;#xD68C;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Microsoft&amp;#xB294; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC778;&lt;/strong&gt; &lt;code&gt;SACLOStartLogoutWithOptions()&lt;/code&gt;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB824; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xC5C6;&amp;#xC774; &amp;#xB9C8;&amp;#xC774;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB300;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, 3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC2E4;&amp;#xD328;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xC11C;&amp;#xBA85; &amp;#xC2E4;&amp;#xD328; (codesign failure)&lt;/strong&gt;&lt;br&gt;macOS&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC21C;&amp;#xAC04; &amp;#xC11C;&amp;#xBA85;&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xCC28;&amp;#xB2E8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;PAC(Pointer Authentication Code) &amp;#xBBF8;&amp;#xAC80;&amp;#xC99D; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&lt;br&gt;&amp;#xCD5C;&amp;#xC2E0; Apple Silicon(macOS arm64e)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;PAC &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;strong&gt;PAC &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC5D4;&amp;#xD0C0;&amp;#xC774;&amp;#xD2C0;&amp;#xBA3C;&amp;#xD2B8; &amp;#xC0C1;&amp;#xC2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt; Migration Assistant &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB294; &lt;code&gt;com.apple.private.mbsystemadministration&lt;/code&gt; Entitlement&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &lt;strong&gt;MBSystemAdministration&amp;#xC640;&amp;#xC758; XPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xB7;&amp;#xC218;&amp;#xC815;&amp;#xB7;&amp;#xC7AC;&amp;#xC870;&amp;#xB9BD;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; Entitlement&amp;#xAC00; &lt;strong&gt;&amp;#xC190;&amp;#xC2E4;&amp;#xB418;&amp;#xC5B4; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xCC28;&amp;#xB2E8;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xAC70;&amp;#xB098; Migration Assistant&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Setup Assistant&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;(AppleScript, &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xAE30;&amp;#xBC18; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;)&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#x2018;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB85C;&amp;#xADF8;&amp;#xC544;&amp;#xC6C3;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAC1C;&amp;#xC785;&amp;#x2019; &amp;#xC5C6;&amp;#xC774; systemmigrationd &amp;#xB370;&amp;#xBAAC;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD558;&amp;#xACE0;, bash/perl &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;Apple&amp;#xC758;-&amp;#xB300;&amp;#xC751;&#34;&gt;&lt;a href=&#34;#Apple&amp;#xC758;-&amp;#xB300;&amp;#xC751;&#34; class=&#34;headerlink&#34; title=&#34;Apple&amp;#xC758; &amp;#xB300;&amp;#xC751;&#34;&gt;&lt;/a&gt;Apple&amp;#xC758; &amp;#xB300;&amp;#xC751;&lt;/h2&gt;&lt;p&gt;&amp;#xC704; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD55C; Apple&amp;#xC740; &amp;#xC57D; 2&amp;#xAC00;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xD328;&amp;#xCE58;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;launchd&amp;#xC5D0; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218; &amp;#xC804;&amp;#xB2EC; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xAE08;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAE30;&amp;#xC874;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; launchctl setenv &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; BASH_ENV, PERL5OPT &amp;#xB4F1; &amp;#xD2B9;&amp;#xC815; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB4A4;, systemmigrationd&amp;#xC758; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Apple&amp;#xC740; &lt;strong&gt;launchd&amp;#xAC00; &amp;#xD658;&amp;#xACBD; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB0B4;&amp;#xBD80; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC;, &amp;#xC544;&amp;#xC608; &amp;#xC774; &amp;#xBC29;&amp;#xBC95; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;launchctl setenv WHATEVER blah
&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xC624;&amp;#xB958; &amp;#xBC1C;&amp;#xC0DD;:&lt;/span&gt;
Could not &lt;span class=&#34;hljs-built_in&#34;&gt;set&lt;/span&gt; environment: 150: Operation not permitted &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; System Integrity Protection is engaged&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;drop_sip &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; SIP &amp;#xC6B0;&amp;#xD68C; capability&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&lt;/strong&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; SIP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xBD80;&amp;#xD130; Entitlement, &amp;#xC6B0;&amp;#xD68C; &amp;#xBC0F; &amp;#xD65C;&amp;#xC6A9; &amp;#xBC29;&amp;#xC548;, &amp;#xD328;&amp;#xCE58; &amp;#xACB0;&amp;#xACFC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Sandbox Escape&amp;#xC744; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf&#34;&gt;https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md&#34;&gt;https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.youtube.com/watch?v=zxZesAN-TEk&#34;&gt;https://www.youtube.com/watch?v=zxZesAN-TEk&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.offsec.com/blog/macos-kernel-debugging-with-sip/&#34;&gt;https://www.offsec.com/blog/macos-kernel-debugging-with-sip/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://objective-see.org/blog/blog_0x14.html&#34;&gt;https://objective-see.org/blog/blog_0x14.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/&#34;&gt;https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf&#34;&gt;https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/SIP.jpeg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/05/11/clalxk/macos_sip-bypass_ko/">

  <title>[Research] macOS: Part1 - SIP Bypass (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-05-11 17:00" pubdate>
      2025 5 11 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      65
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] macOS: Part1 - SIP Bypass (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><a href="https://hackyboiz.github.io/2025/01/19/clalxk/MacOS_TCC-Bypass_ko/">macOS: Part0 - TCC Bypass</a></p>
<p>macOS: Part1 - SIP Bypass &#x2190; Now!</p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, clalxk&#xC785;&#xB2C8;&#xB2E4;! TCC Bypass&#xC5D0; &#xC774;&#xC5B4; SIP Bypass&#xC5D0; &#xB300;&#xD574; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; macOS&#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD574; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;! Part2&#xB3C4; &#xAE30;&#xB300;&#xD574;&#xC8FC;&#xC138;&#xC694; &#x314E;&#x314E; </p>
<p>&#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; SIP&#xC758; &#xAC1C;&#xB150;&#xACFC; SIP Bypass &#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC804;&#xBC18;&#xC801;&#xC778; &#xD750;&#xB984;&#xACFC; &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; Entitlement&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xC9C0; &#xB4F1;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB824; &#xD569;&#xB2C8;&#xB2E4;. </p>
<hr>
<h2 id="System-Integrity-Protection-SIP"><a href="#System-Integrity-Protection-SIP" class="headerlink" title="System Integrity Protection, SIP"></a>System Integrity Protection, SIP</h2><p>SIP&#xB294; &#xB8E8;&#xD2B8; &#xC0AC;&#xC6A9;&#xC790;&#xC870;&#xCC28; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xD575;&#xC2EC; &#xD30C;&#xC77C;&#xC744; &#xC218;&#xC815;&#xD558;&#xAC70;&#xB098; &#xC0AD;&#xC81C;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;&#xD558;&#xB294; macOS&#xC758; &#xD575;&#xC2EC; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;. Apple &#xC0CC;&#xB4DC;&#xBC15;&#xC2A4;&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC804;&#xCCB4; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xBCF4;&#xD638;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB8E8;&#xD2B8;&#xB85C;&#xBD80;&#xD130; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. (SELinux&#xAC00; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xACFC; &#xAC1C;&#xB150;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xC0AC;) </p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; SIP&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xACE0;, &#xC2DC;&#xC2A4;&#xD15C; &#xBCF4;&#xD638; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD574; &#xB8E8;&#xD2B8;&#xD0B7; &#xC124;&#xCE58;, TCC &#xC6B0;&#xD68C;, &#xC9C0;&#xC18D;&#xD615; &#xBA40;&#xC6E8;&#xC5B4; &#xC0DD;&#xC131;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC545;&#xC131; &#xD589;&#xC704;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. SIP&#xAC00; &#xC801;&#xC6A9;&#xB41C; &#xC2DC;&#xC2A4;&#xD15C;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xD30C;&#xC77C; &#xBC0F; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB97C; &#xC218;&#xC815;&#xD560; &#xC218; &#xC5C6;&#xC73C;&#xBA70;, &#xC2EC;&#xC9C0;&#xC5B4; root &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xB354;&#xB77C;&#xB3C4; &#xC774;&#xB7EC;&#xD55C; &#xAD8C;&#xD55C;&#xC774; &#xC81C;&#xD55C;&#xB418;&#xC5B4; &#x2018;<strong>rootless</strong>&#x2019;&#xB77C;&#xACE0;&#xB3C4; &#xBD88;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h3 id="SIP&#xC640;-Entitlement&#xC758;-&#xAD00;&#xACC4;"><a href="#SIP&#xC640;-Entitlement&#xC758;-&#xAD00;&#xACC4;" class="headerlink" title="SIP&#xC640; Entitlement&#xC758; &#xAD00;&#xACC4;"></a>SIP&#xC640; Entitlement&#xC758; &#xAD00;&#xACC4;</h3><p>SIP&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xACBD;&#xB85C;&#xB97C; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>/System, /bin, /sbin, /usr(&#xC77C;&#xBD80; &#xC81C;&#xC678;)</li>
<li>&#xC2DC;&#xC2A4;&#xD15C; &#xCEE4;&#xB110; &#xBC0F; &#xD575;&#xC2EC; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</li>
<li>SIP&#xAC00; &#xC124;&#xC815;&#xD55C; &#xC18D;&#xC131;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xD30C;&#xC77C;</li>
</ul>
<blockquote>
<p><em>SIP&#xB97C; &#xC644;&#xC804;&#xD788; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD558;&#xB824;&#xBA74; &#xBCF5;&#xAD6C; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB9CC; &#xC124;&#xC815; &#xBCC0;&#xACBD;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70;, &#xC77C;&#xBC18;&#xC801;&#xC778; &#xB7F0;&#xD0C0;&#xC784; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</em></p>
</blockquote>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC2DC;&#xC2A4;&#xD15C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xB4F1;&#xC5D0;&#xB294; SIP&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xB294; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC608;&#xC678;&#xC801;&#xC73C;&#xB85C; SIP&#xC758; &#xC81C;&#xD55C;&#xC744; &#xBC1B;&#xC9C0; &#xC54A;&#xB294; &#xD2B9;&#xC815; &#xAD8C;&#xD55C;&#xC744; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xAD8C;&#xD55C;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>com.apple.rootless.install : SIP &#xD30C;&#xC77C;&#xC2DC;&#xC2A4;&#xD15C; &#xAC80;&#xC0AC;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xAD8C;&#xD55C;</li>
<li>com.apple.rootless.install.heritable : &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; com.apple.rootless.install &#xC0C1;&#xC18D;</li>
</ul>
<p>&#xD2B9;&#xC815; &#xD30C;&#xC77C; &#xD639;&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC5B4;&#xB5A0;&#xD55C; &#xAD8C;&#xD55C;&#xC744; &#xBD80;&#xC5EC;&#xD558;&#xB294; &#xAC83;&#xC744; &#x201C;<a target="_blank" rel="external nofollow noopener noreferrer" href="https://developer.apple.com/documentation/bundleresources/entitlements"><strong>Entitlement</strong></a>&#x201D;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. Entitlement&#xB294; &#xC571; &#xC11C;&#xBA85; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD569;&#xBC95;&#xC801;&#xC73C;&#xB85C; &#xC704;&#xC870;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. Apple&#xC740; macOS&#xC5D0;&#xC11C; &#xBCF4;&#xC548;&#xC744; &#xAC15;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; Entitlement&#xB97C; &#xAD11;&#xBC94;&#xC704;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xBA70;, &#xB9E4;&#xC6B0; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB0B4;&#xBD80; &#xAD8C;&#xD55C;&#xC744; &#xBD80;&#xC5EC;&#xD569;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xB41C;  <code>com.apple.rootless.install.heritable</code>&#xB294; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xBFD0; &#xC544;&#xB2C8;&#xB77C; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; <code>com.apple.rootless.install</code>&#xC744; &#xC0C1;&#xC18D;&#xD558;&#xC5EC; SIP &#xD30C;&#xC77C;&#xC2DC;&#xC2A4;&#xD15C; &#xBCF4;&#xD638;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC870;&#xAE08; &#xD6C4;&#xC5D0; &#xC774; Entitlement&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC6B0;&#xD68C;&#xD588;&#xB294;&#xC9C0; &#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<h3 id="SIP-&#xC124;&#xC815;-&#xC800;&#xC7A5;-&#xC704;&#xCE58;"><a href="#SIP-&#xC124;&#xC815;-&#xC800;&#xC7A5;-&#xC704;&#xCE58;" class="headerlink" title="SIP &#xC124;&#xC815; &#xC800;&#xC7A5; &#xC704;&#xCE58;"></a>SIP &#xC124;&#xC815; &#xC800;&#xC7A5; &#xC704;&#xCE58;</h3><p>SIP&#xC758; &#xD65C;&#xC131;&#xD654; &#xBC0F; &#xC138;&#xBD80; &#xD5C8;&#xC6A9; &#xC0AC;&#xD56D;&#xC740; <strong>bitflag</strong> &#xD615;&#xD0DC;&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>Intel Mac</strong>&#xC5D0;&#xC11C;&#xB294; NVRAM&#xC758; <code>csr-active-config</code> &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;</li>
<li><strong>Apple Silicon (ARM) Mac</strong>&#xC5D0;&#xC11C;&#xB294; &#xBD80;&#xD305; &#xC2DC; Device Tree&#xC5D0;&#xC11C; <code>lp-sip0</code> &#xAC12;&#xC744; &#xC77D;&#xC5B4; &#xAD6C;&#xC131;</li>
</ul>
<p>&#xC989;, &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB530;&#xB77C; SIP &#xC124;&#xC815;&#xC744; &#xC77D;&#xB294; &#xACBD;&#xB85C;&#xAC00; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBE44;&#xD2B8; &#xD50C;&#xB798;&#xADF8;&#xB4E4;&#xC740; <strong>XNU &#xCEE4;&#xB110; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xC758; csr.h</strong> &#xD5E4;&#xB354; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>*XNU&#xB294; macOS&#xC640; iOS&#xC758; &#xCEE4;&#xB110;&#xB85C;, Apple&#xC774; &#xAC1C;&#xBC1C;&#xD55C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAE30;&#xBC18;&#xC758; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xCEE4;&#xB110;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h3 id="SIP-&#xBE44;&#xD2B8;&#xD50C;&#xB798;&#xADF8;-&#xBAA9;&#xB85D;"><a href="#SIP-&#xBE44;&#xD2B8;&#xD50C;&#xB798;&#xADF8;-&#xBAA9;&#xB85D;" class="headerlink" title="SIP &#xBE44;&#xD2B8;&#xD50C;&#xB798;&#xADF8; &#xBAA9;&#xB85D;"></a>SIP &#xBE44;&#xD2B8;&#xD50C;&#xB798;&#xADF8; &#xBAA9;&#xB85D;</h3><p>&#xC2AC;&#xB77C;&#xC774;&#xB4DC; &#xD558;&#xB2E8;&#xC758; &#xD45C;&#xB294; &#xC2E4;&#xC81C; SIP &#xAE30;&#xB2A5; &#xC81C;&#xC5B4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC8FC;&#xC694; &#xD50C;&#xB798;&#xADF8;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th><strong>Bit &#xC774;&#xB984; (XNU &#xCF54;&#xB4DC; &#xC0C1;)</strong></th>
<th><strong>&#xAE30;&#xB2A5; &#xC124;&#xBA85;</strong></th>
</tr>
</thead>
<tbody>
<tr>
<td>CSR_ALLOW_UNTRUSTED_KEXTS</td>
<td>&#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xCEE4;&#xB110; &#xD655;&#xC7A5;(KEXT) &#xB85C;&#xB529; &#xD5C8;&#xC6A9;</td>
</tr>
<tr>
<td>CSR_ALLOW_UNRESTRICTED_FS</td>
<td>&#xBCF4;&#xD638;&#xB41C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xACBD;&#xB85C;&#xC5D0; &#xB300;&#xD55C; &#xBB34;&#xC81C;&#xD55C; &#xC811;&#xADFC; &#xD5C8;&#xC6A9;</td>
</tr>
<tr>
<td>CSR_ALLOW_TASK_FOR_PID</td>
<td>&#xD2B9;&#xC815; PID&#xC5D0; &#xB300;&#xD55C; task &#xD3EC;&#xD2B8;(&#xB514;&#xBC84;&#xAE45; &#xC6A9;&#xB3C4;) &#xC811;&#xADFC; &#xD5C8;&#xC6A9;</td>
</tr>
<tr>
<td>CSR_ALLOW_KERNEL_DEBUGGER</td>
<td>&#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45; &#xD65C;&#xC131;&#xD654; &#xD5C8;&#xC6A9;</td>
</tr>
<tr>
<td>CSR_ALLOW_UNRESTRICTED_DTRACE</td>
<td>DTrace(&#xB514;&#xBC84;&#xAE45; &#xBC0F; &#xD2B8;&#xB808;&#xC774;&#xC2F1; &#xB3C4;&#xAD6C;)&#xC758; &#xBB34;&#xC81C;&#xD55C; &#xC0AC;&#xC6A9; &#xD5C8;&#xC6A9;</td>
</tr>
<tr>
<td>CSR_ALLOW_UNRESTRICTED_NVRAM</td>
<td>NVRAM &#xBCC0;&#xC218;&#xC758; &#xC77D;&#xAE30;&#xB7;&#xC4F0;&#xAE30; &#xC81C;&#xD55C; &#xD574;&#xC81C;</td>
</tr>
<tr>
<td>CSR_ALLOW_UNAUTHENTICATED_ROOT</td>
<td>&#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC740; APFS &#xB8E8;&#xD2B8; &#xC2A4;&#xB0C5;&#xC0F7; &#xBD80;&#xD305; &#xD5C8;&#xC6A9;</td>
</tr>
</tbody>
</table>
</div>
<p>&#xC774;&#xB7EC;&#xD55C; &#xD50C;&#xB798;&#xADF8;&#xB294; &#xBCF4;&#xC548;&#xC744; &#xBB34;&#xB825;&#xD654;&#xD558;&#xAC70;&#xB098; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC704;&#xD574; &#xD2B9;&#xBCC4;&#xD55C; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xC77C;&#xBC18;&#xC801;&#xC778; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB450; &#xBE44;&#xD65C;&#xC131;&#xD654; &#xC0C1;&#xD0DC;(0)&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xD604; macOS &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; SIP &#xD65C;&#xC131; &#xC0C1;&#xD0DC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xC544;&#xB798; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs bash">$ csrutil status

System Integrity Protection status: enabled.</code></pre>
<ul>
<li>enabled: SIP&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xACE0;, &#xAE30;&#xBCF8; &#xBCF4;&#xD638;&#xAC00; &#xC801;&#xC6A9; &#xC911;</li>
<li>disabled: SIP&#xAC00; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC74C;</li>
</ul>
<p>intel &#xAE30;&#xBC18; Mac&#xC5D0;&#xC11C;&#xB294; SIP &#xC124;&#xC815;&#xC774; NVRAM &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBBC0;&#xB85C;, &#xC544;&#xB798; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">$ nvram csr-active-config

csr-active-config  w%00%00%00</code></pre>
<p>&#xC774; &#xAC12;&#xC740; <strong>16&#xC9C4;&#xC218; &#xBE44;&#xD2B8;&#xD50C;&#xB798;&#xADF8;</strong>&#xB85C; SIP&#xC758; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC774; &#xAEBC;&#xC838; &#xC788;&#xB294;&#xC9C0; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; 0x77&#xC774;&#xBA74; &#xC5EC;&#xB7EC; SIP &#xBCF4;&#xD638; &#xAE30;&#xB2A5;&#xC774; &#xD574;&#xC81C;&#xB41C; &#xC0C1;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. Apple Silicon Mac&#xC5D0;&#xC11C;&#xB294; lp-sip0&#xC744; Device Tree&#xC5D0;&#xC11C; &#xC77D;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC704; &#xBA85;&#xB839;&#xC5B4;&#xB85C;&#xB294; &#xD655;&#xC778;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="SIP-Bypass-&#xC608;&#xC81C;"><a href="#SIP-Bypass-&#xC608;&#xC81C;" class="headerlink" title="SIP Bypass &#xC608;&#xC81C;"></a>SIP Bypass &#xC608;&#xC81C;</h2><p><code>com.apple.rootless.install.heritable</code> &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294; &#x2018;drop_sip&#x2019; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC5EC; &#xC5B4;&#xB5BB;&#xAC8C; SIP&#xB97C; &#xC6B0;&#xD68C;&#xD588;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xB824; &#xD569;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs bash">DeviceProcessEvents
| <span class="hljs-built_in">where</span> FileName =~ <span class="hljs-string">&quot;drop_sip&quot;</span>
| project InitiatingProcessFileName, ProcessCommandLine, SHA256</code></pre>
<p>drop_sip&#xB294; Apple&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC11C;&#xBA85;&#xD55C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image1.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB294; <code>/System/Library/PrivateFrameworks/SystemMigrationUtils.framework/Resources/Tools/drop_sip</code> &#xACBD;&#xB85C;&#xC5D0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC11C;&#xBA85;&#xB41C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB294; <strong>csops()&#xB97C; &#xC0AC;&#xC6A9;&#xD574; SIP &#xAD00;&#xB828; &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC124;&#xC815;&#xD558;&#xACE0; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;</strong>&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image2.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>.csops &#xC2DC;&#xC2A4;&#xD15C; &#xD638;&#xCD9C;&#xB85C; &#xC778;&#xD55C; <code>p_csflags</code> &#xBA64;&#xBC84; &#xC218;&#xC815;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xB418;&#xBA70; SIP&#xB97C; &#xD65C;&#xC131;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image3.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC0C1;&#xC704; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; <code>systemmigrationd</code>&#xC600;&#xC73C;&#xBA70;, <strong>com.apple.rootless.install.heritable</strong> &#xB97C; &#xD1B5;&#xD574; SIP &#xC6B0;&#xD68C; &#xAD8C;&#xD55C;&#xC744; &#xD558;&#xC704; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xAC8C; &#xC0C1;&#xC18D;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; drop_sip &#xBC0F; &#xD558;&#xC704; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC740; SIP&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs bash">DeviceProcessEvents
| <span class="hljs-built_in">where</span> InitiatingProcessFileName =~ <span class="hljs-string">&quot;systemmigrationd&quot;</span>
| summarize Hits=count(), Cmdline=any(ProcessCommandLine) by FileName</code></pre>
<p>&#xC774;&#xD6C4;&#xB85C; &#xC704; &#xCFFC;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; systemmigrationd&#xC758; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xCD94;&#xC801;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; Bash&#xC640; Perl &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xAC00;(/bin/bash, /usr/bin/perl)&#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC83;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xAC74; &#xC911;&#xC694;&#xD55C; &#xD78C;&#xD2B8;&#xC600;&#xB294;&#xB370;&#xC694;, &#xC65C;&#xB0D0;&#xD558;&#xBA74; <strong>&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB294; &#xD658;&#xACBD; &#xBCC0;&#xC218; &#xC870;&#xC791;&#xC744; &#xD1B5;&#xD574; &#xCF54;&#xB4DC; &#xC8FC;&#xC785;&#xC774; &#xAC00;&#xB2A5;</strong>&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th><strong>FileName</strong></th>
<th><strong>Hits</strong></th>
<th><strong>Cmdline</strong></th>
</tr>
</thead>
<tbody>
<tr>
<td>bash</td>
<td>498</td>
<td>/bin/bash /System/Library/&#x2026;/firstbootDirectoryServer</td>
</tr>
<tr>
<td>perl</td>
<td>171</td>
<td>/usr/bin/perl /usr/libexec/migrateLocalKDC &#x2026;</td>
</tr>
</tbody>
</table>
</div>
<p>Bash&#xC758; <code>BASH_ENV</code>&#xB098; Perl&#xC758; <code>PERL5OPT</code> &#xD658;&#xACBD; &#xBCC0;&#xC218;&#xB97C; &#xC545;&#xC6A9;&#xD558;&#xBA74;, &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xC258; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_BASH_ENV.jpg" srcset="/img/loading.gif" alt="image.png"><br>BASH_ENV&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xC6B0;&#xD68C; &#xC608;&#xC2DC;</p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/img_PERL5OPT_ENV.jpg" srcset="/img/loading.gif" alt="image.png"></p>
<p>PERL5OPT&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xC6B0;&#xD68C; &#xC608;&#xC2DC;</p>
<pre><code class="hljs bash">launchctl setenv PERL5OPT <span class="hljs-string">&apos;-Mwarnings;system(&quot;/private/tmp/migraine.sh&quot;)&apos;</span></code></pre>
<p>&#xC774;&#xC81C; &#xC704;&#xC640; &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74;, Perl&#xC774; &#xAE30;&#xB3D9;&#xB420; &#xB54C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC0BD;&#xC785;&#xD55C; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;(/private/tmp/migraine.sh)&#xAC00; SIP &#xBCF4;&#xD638; &#xC601;&#xC5ED; &#xB0B4;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<hr>
<p>&#xC55E;&#xC11C; &#xC18C;&#xAC1C;&#xD55C; SIP &#xC6B0;&#xD68C; &#xCDE8;&#xC57D;&#xC810;&#xC740; <code>systemmigrationd</code>&#xB77C;&#xB294; &#xB370;&#xBAAC;&#xC758; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xACF5;&#xACA9; &#xC9C4;&#xC785;&#xC810;&#xC73C;&#xB85C; &#xC0BC;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBB38;&#xC81C;&#xB294; <strong>&#xC774; &#xB370;&#xBAAC;&#xC774; &#xC791;&#xB3D9;&#xD558;&#xB824;&#xBA74; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158;&#xC774; &#xC2E4;&#xC81C;&#xB85C; &#xD2B8;&#xB9AC;&#xAC70;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC778;&#xB370;&#xC694;</strong>. &#xAE30;&#xC874;&#xC758; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158;&#xC740; <strong>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC644;&#xC804;&#xD788; &#xB85C;&#xADF8;&#xC544;&#xC6C3;&#xD55C; &#xD6C4;</strong>&#xC5D0;&#xB9CC; &#xC9C4;&#xD589;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, <strong>&#xC6D0;&#xACA9; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xC870;&#xC791;&#xD558;&#xAC70;&#xB098; &#xC790;&#xB3D9;&#xD654;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B4; &#xD2B9;&#xC9D5;</strong>&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC804;&#xCCB4; &#xD750;&#xB984;&#xC744; &#xBD84;&#xC11D;&#xD574; <strong>&#xC790;&#xB3D9;&#xD654; &#xAC00;&#xB2A5;&#xD55C; &#xC6B0;&#xD68C; &#xC9C0;&#xC810;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</strong></p>
<h3 id="&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158;-&#xC804;&#xCCB4;-&#xD750;&#xB984;-&#xC694;&#xC57D;"><a href="#&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158;-&#xC804;&#xCCB4;-&#xD750;&#xB984;-&#xC694;&#xC57D;" class="headerlink" title="&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC804;&#xCCB4; &#xD750;&#xB984; &#xC694;&#xC57D;"></a>&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC804;&#xCCB4; &#xD750;&#xB984; &#xC694;&#xC57D;</h3><p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/flow.jpg" srcset="/img/loading.gif" alt="image.png"></p>
<ol>
<li><strong>Migration Assistant</strong><br>&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xB9C8;&#xBC95;&#xC0AC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAE30;&#xBCF8; &#xC571;&#xC785;&#xB2C8;&#xB2E4;.<br>&#x2192; &#xB85C;&#xADF8;&#xC544;&#xC6C3;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xBA70;, &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; <code>SACLOStartLogoutWithOptions</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.<br>&#x2192; &#xC774; &#xC571;&#xC740; <code>com.apple.private.mbsystemadministration</code>&#xB77C;&#xB294; Entitlement&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>MBSystemAdministration</strong><ul>
<li>Migration Assistant&#xC758; &#xC694;&#xCCAD;&#xC744; <strong>proxy</strong>&#xD558;&#xC5EC; <strong>Setup Assistant</strong>&#xB85C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. <code>_mbsetupuser</code>&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xBA70;, GUI &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
<li>XPC&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0;&#xD558;&#xBA70;, &#xC694;&#xCCAD;&#xC744; &#xAC80;&#xC99D;&#xD560; &#xB54C; Entitlement&#xAC00; &#xC5C6;&#xC73C;&#xBA74; <strong>&#xAC70;&#xBD80;</strong>&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>Setup Assistant</strong><ul>
<li>&#xC2E4;&#xC81C; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xB85C;&#xC9C1;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA70;, <code>systemmigrationd</code>&#xC640; &#xD1B5;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>com.apple.private.systemmigration.daemonclient</code> Entitlement&#xB97C; &#xC694;&#xAD6C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xC694;&#xCCAD;&#xC740; <strong>XPC</strong>&#xB97C; &#xD1B5;&#xD574; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong>systemmigrationd</strong><ul>
<li>&#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC694;&#xCCAD;&#xC744; &#xC218;&#xC2E0;&#xD558;&#xACE0;, <strong>SystemMigration.framework</strong>&#xB97C; &#xD1B5;&#xD574; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>/Library/SystemMigration/Queue &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xC5D0; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC694;&#xCCAD; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xC774;&#xB97C; <strong>&#x201C;In-Flight&#x201D;</strong> &#xC0C1;&#xD0DC;&#xB85C; &#xBC14;&#xAFD4; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <strong>bash&#xB098; perl &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;</strong>&#xD558;&#xB294;&#xB370;, <code>&#xC774; &#xC810;&#xC774; &#xBC14;&#xB85C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD658;&#xACBD; &#xBCC0;&#xC218; &#xAE30;&#xBC18; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xB294; &#xC9C0;&#xC810;</code>&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<p>&#xC0B4;&#xD3B4;&#xBCF8; &#xB300;&#xB85C;, &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xACFC;&#xC815;&#xC5D0;&#xC11C; systemmigrationd&#xB294; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; <code>SystemMigration.framework</code>&#xC758; <code>SystemMigrationDaemon</code> &#xAC1D;&#xCCB4;&#xB97C; &#xD1B5;&#xD574; XPC &#xC694;&#xCCAD;&#xC744; &#xC218;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;.  </p>
<p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image4.png" srcset="/img/loading.gif" alt="image.png"></p>
<pre><code class="hljs bash">rax = [SystemMigrationDaemon sharedDaemon];
[rax startListeningForConnections];</code></pre>
<p>&#xC774;&#xCC98;&#xB7FC; &#xB370;&#xBAAC;&#xC740; &#xC790;&#xCCB4; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC694;&#xCCAD;&#xC744; &#xC218;&#xC2E0;&#xD558;&#xACE0;, &#xADF8;&#xC5D0; &#xB530;&#xB77C; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;(bash/perl &#xB4F1;)&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="Migration-Assistant-&#xD328;&#xCE58;-&#xC2DC;&#xB3C4;"><a href="#Migration-Assistant-&#xD328;&#xCE58;-&#xC2DC;&#xB3C4;" class="headerlink" title="Migration Assistant &#xD328;&#xCE58; &#xC2DC;&#xB3C4;"></a>Migration Assistant &#xD328;&#xCE58; &#xC2DC;&#xB3C4;</h3><p><img src="/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/image5.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>SIP &#xC6B0;&#xD68C;&#xB97C; &#xC790;&#xB3D9;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574;, Microsoft&#xB294; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xACFC;&#xC815;&#xC5D0;&#xC11C; <strong>&#xB85C;&#xADF8;&#xC544;&#xC6C3;&#xC744; &#xC720;&#xB3C4;&#xD558;&#xB294; &#xD568;&#xC218;&#xC778;</strong> <code>SACLOStartLogoutWithOptions()</code>&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xB824; &#xC2DC;&#xB3C4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD568;&#xC218;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xBA74; <strong>&#xC0AC;&#xC6A9;&#xC790; &#xB85C;&#xADF8;&#xC544;&#xC6C3; &#xC5C6;&#xC774; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83;</strong>&#xC73C;&#xB85C; &#xAE30;&#xB300;&#xD588;&#xC9C0;&#xB9CC;, 3&#xAC00;&#xC9C0;&#xC758; &#xC774;&#xC720;&#xB85C; &#xC2E4;&#xD328;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC720;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xCF54;&#xB4DC; &#xC11C;&#xBA85; &#xC2E4;&#xD328; (codesign failure)</strong><br>macOS&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC758; &#xC11C;&#xBA85;&#xC744; &#xAC15;&#xB825;&#xD558;&#xAC8C; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xC21C;&#xAC04; &#xC11C;&#xBA85;&#xC774; &#xAE68;&#xC9C0;&#xACE0; &#xC2E4;&#xD589; &#xC790;&#xCCB4;&#xAC00; &#xCC28;&#xB2E8;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li><strong>PAC(Pointer Authentication Code) &#xBBF8;&#xAC80;&#xC99D; &#xBB38;&#xC81C;</strong><br>&#xCD5C;&#xC2E0; Apple Silicon(macOS arm64e)&#xC5D0;&#xC11C;&#xB294; <strong>PAC &#xAE30;&#xB2A5;&#xC774; &#xD65C;&#xC131;&#xD654;</strong>&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB294; <strong>PAC &#xAC80;&#xC99D;&#xC744; &#xD1B5;&#xACFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></li>
<li><p><strong>&#xC5D4;&#xD0C0;&#xC774;&#xD2C0;&#xBA3C;&#xD2B8; &#xC0C1;&#xC2E4;</strong></p>
<p> Migration Assistant &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB294; <code>com.apple.private.mbsystemadministration</code> Entitlement&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC57C; <strong>MBSystemAdministration&#xC640;&#xC758; XPC &#xD1B5;&#xC2E0;&#xC774; &#xAC00;&#xB2A5;</strong>&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCD94;&#xCD9C;&#xB7;&#xC218;&#xC815;&#xB7;&#xC7AC;&#xC870;&#xB9BD;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC774; Entitlement&#xAC00; <strong>&#xC190;&#xC2E4;&#xB418;&#xC5B4; &#xD1B5;&#xC2E0;&#xC774; &#xCC28;&#xB2E8;</strong>&#xB429;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C;, &#xB2E8;&#xC21C;&#xD788; &#xB85C;&#xADF8;&#xC544;&#xC6C3; &#xCF54;&#xB4DC;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xAC70;&#xB098; Migration Assistant&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC740; &#xD604;&#xC2E4;&#xC801;&#xC73C;&#xB85C; &#xBD88;&#xAC00;&#xB2A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5BB;&#xC740; &#xAC83;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xCD94;&#xAC00; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; Setup Assistant&#xB97C; &#xC9C1;&#xC811; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC6B0;&#xD68C; &#xBC29;&#xBC95;(AppleScript, &#xD658;&#xACBD; &#xBCC0;&#xC218; &#xAE30;&#xBC18; &#xD398;&#xC774;&#xB85C;&#xB4DC; &#xB4F1;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xC790;&#xB3D9;&#xD654;)&#xC744; &#xC801;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#x2018;&#xC2DC;&#xC2A4;&#xD15C; &#xB85C;&#xADF8;&#xC544;&#xC6C3;, &#xC0AC;&#xC6A9;&#xC790; &#xAC1C;&#xC785;&#x2019; &#xC5C6;&#xC774; systemmigrationd &#xB370;&#xBAAC;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xACE0;, bash/perl &#xC2E4;&#xD589; &#xC2DC;&#xC810;&#xC5D0; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. </p>
<h2 id="Apple&#xC758;-&#xB300;&#xC751;"><a href="#Apple&#xC758;-&#xB300;&#xC751;" class="headerlink" title="Apple&#xC758; &#xB300;&#xC751;"></a>Apple&#xC758; &#xB300;&#xC751;</h2><p>&#xC704; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD655;&#xC778;&#xD55C; Apple&#xC740; &#xC57D; 2&#xAC00;&#xC9C0; &#xC815;&#xB3C4;&#xC758; &#xD328;&#xCE58;&#xB97C; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ol>
<li><p><strong>launchd&#xC5D0; &#xD658;&#xACBD; &#xBCC0;&#xC218; &#xC804;&#xB2EC; &#xC790;&#xCCB4;&#xB97C; &#xAE08;&#xC9C0;</strong></p>
<ul>
<li><p>&#xAE30;&#xC874;&#xC5D0;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xAC00; launchctl setenv &#xBA85;&#xB839;&#xC744; &#xC0AC;&#xC6A9;&#xD574; BASH_ENV, PERL5OPT &#xB4F1; &#xD2B9;&#xC815; &#xD658;&#xACBD; &#xBCC0;&#xC218;&#xB97C; &#xC124;&#xC815;&#xD55C; &#xB4A4;, systemmigrationd&#xC758; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC545;&#xC131; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Apple&#xC740; <strong>launchd&#xAC00; &#xD658;&#xACBD; &#xBCC0;&#xC218;&#xB97C; &#xBB34;&#xC2DC;&#xD558;&#xB3C4;&#xB85D; &#xB0B4;&#xBD80; &#xB85C;&#xC9C1;&#xC744; &#xBCC0;&#xACBD;</strong>&#xD558;&#xC5EC;, &#xC544;&#xC608; &#xC774; &#xBC29;&#xBC95; &#xC804;&#xCCB4;&#xB97C; &#xCC28;&#xB2E8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">launchctl setenv WHATEVER blah
<span class="hljs-comment"># &#xC624;&#xB958; &#xBC1C;&#xC0DD;:</span>
Could not <span class="hljs-built_in">set</span> environment: 150: Operation not permitted <span class="hljs-keyword">while</span> System Integrity Protection is engaged</code></pre>
</li>
</ul>
</li>
<li><p><strong>drop_sip &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC0AC;&#xC804;&#xC5D0; SIP &#xC6B0;&#xD68C; capability&#xB97C; &#xC81C;&#xAC70;</strong></p>
</li>
</ol>
<h2 id="&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;"></a>&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;</h2><p>&#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; SIP&#xC758; &#xAC1C;&#xB150;&#xBD80;&#xD130; Entitlement, &#xC6B0;&#xD68C; &#xBC0F; &#xD65C;&#xC6A9; &#xBC29;&#xC548;, &#xD328;&#xCE58; &#xACB0;&#xACFC;&#xAE4C;&#xC9C0; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB2E4;&#xC74C; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C;&#xB294; Sandbox Escape&#xC744; &#xC8FC;&#xC81C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<h3 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf">https://powerofcommunity.net/poc2024/Csaba%20Fitzl,%20Apple%20Disk-O%20Party.pdf</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md">https://github.com/LearningKijo/SecurityResearcher-Note/blob/main/SecurityResearcher-Note-Folder/Day14-macOS-SIP-Bypass-Insights.md</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=zxZesAN-TEk">https://www.youtube.com/watch?v=zxZesAN-TEk</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.offsec.com/blog/macos-kernel-debugging-with-sip/">https://www.offsec.com/blog/macos-kernel-debugging-with-sip/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://objective-see.org/blog/blog_0x14.html">https://objective-see.org/blog/blog_0x14.html</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/">https://www.microsoft.com/en-us/security/blog/2023/05/30/new-macos-vulnerability-migraine-could-bypass-system-integrity-protection/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf">https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/Jonathan%20Bar%20Or%20Michael%20Pearse%20Anurag%20Bohra%20-%20Getting%20a%20Migraine%20-%20uncovering%20a%20unique%20SIP%20bypass%20on%20macOS.pdf</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/clalxk/">clalxk</a>
                  
                  <a class="hover-with-bg" href="/tags/MacOS/">MacOS</a>
                  
                  <a class="hover-with-bg" href="/tags/TCC-Bypass/">TCC Bypass</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_clalxk.jpg" srcset="/img/loading.gif" alt="clalxk">
                  </div>

                  <div class="link-text">
                    <div class="link-title">clalxk</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/clalxk">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/05/12/ogu123/NamedPipe/KR/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Windows Named Pipe (KR)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/05/11/clalxk/MacOS_SIP-Bypass_en/">
                    <span class="hidden-mobile">[Research] macOS: Part1 - SIP Bypass (en)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/';
        this.page.identifier = '/2025/05/11/clalxk/MacOS_SIP-Bypass_ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] macOS: Part1 - SIP Bypass (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
