

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC120; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xACFC; &amp;#xD569;&amp;#xC758; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC704;&amp;#xC5D0; &amp;#xAD6C;&amp;#xCD95;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC778; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xACC4;&amp;#xC57D;&amp;#xC740; &amp;#xC885;&amp;#xC774; &amp;#xBB38;&amp;#xC11C;&amp;#xC640; &amp;#xC11C;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0;, &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xC911;&amp;#xAC1C;&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Smart Contract&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&lt;/h2&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xD574;&amp;#xB454; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC57D;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC694;. &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC911;&amp;#xAC1C; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC808;&amp;#xAC10;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC81C;3&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xACC4;&amp;#xC57D;&amp;#xC744; &amp;#xC774;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC740; 1994&amp;#xB144;, &amp;#xB2C9; &amp;#xC0AC;&amp;#xBCF4;(Nick Szabo)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC548; &amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. (&amp;#xC5EC;&amp;#xB2F4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; Nick Szabo&amp;#xB294; &amp;#xC0AC;&amp;#xD1A0;&amp;#xC2DC; &amp;#xB098;&amp;#xCE74;&amp;#xBAA8;&amp;#xD1A0;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xBB3C; &amp;#xC911; &amp;#xD55C; &amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xC8FC; &amp;#xC5B8;&amp;#xAE09;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;) &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xB54C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150; &amp;#xBFD0;&amp;#xC774;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC2E4;&amp;#xD604;&amp;#xC740; &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. 2013&amp;#xB144; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC758; &amp;#xCC3D;&amp;#xC2DC;&amp;#xC790;&amp;#xC778; &amp;#xBE44;&amp;#xD0C8;&amp;#xB9AD; &amp;#xBD80;&amp;#xD14C;&amp;#xB9B0;(Vitalik Buterin)&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &lt;a href=&#34;https://web.archive.org/web/20131228111141/http://vbuterin.com/ethereum.html&#34;&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; &amp;#xBC31;&amp;#xC11C;&lt;/a&gt;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xD6C4; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC774; 2015&amp;#xB144;&amp;#xC5D0; &amp;#xC815;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB7F0;&amp;#xCE6D;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F0;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB7F0; &amp;#xACC4;&amp;#xC57D;&amp;#xB4E4;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; if-then &amp;#xC870;&amp;#xAC74;&amp;#xBB38; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xC5EC;&amp;#xACA8;&amp;#xC838;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xB3D9;&amp;#xC791;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xB3D9;&amp;#xC791;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&lt;/h3&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xB3D9;&amp;#xC791; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xC791;&amp;#xC131;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Solidity&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB85C; &amp;#xC815;&amp;#xB9D0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;pragma solidity ^0.8.26;

contract Coin {
    // The keyword &amp;quot;public&amp;quot; makes variables
    // accessible from other contracts
    address public minter;
    mapping(address =&amp;gt; uint) public balances;

    // Events allow clients to react to specific
    // contract changes you declare
    event Sent(address from, address to, uint amount);

    // Constructor code is only run when the contract
    // is created
    constructor() {
        minter = msg.sender;
    }

    // Sends an amount of newly created coins to an address
    // Can only be called by the contract creator
    function mint(address receiver, uint amount) public {
        require(msg.sender == minter);
        balances[receiver] += amount;
    }

    // Errors allow you to provide information about
    // why an operation failed. They are returned
    // to the caller of the function.
    error InsufficientBalance(uint requested, uint available);

    // Sends an amount of existing coins
    // from any caller to an address
    function send(address receiver, uint amount) public {
        require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;address public minter;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218; minter&amp;#xB97C; &amp;#xC120;&amp;#xC5B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. address &amp;#xD0C0;&amp;#xC785;&amp;#xC740; 160&amp;#xBE44;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C;, &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xACC4;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C; &amp;#xD639;&amp;#xC740; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; public &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xBA74; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; getter &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;mapping(address =&amp;gt; uint) public balances;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; address&amp;#xB97C; &amp;#xD0A4;&amp;#xB85C; &amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758;&amp;#xCF54;&amp;#xC778; &amp;#xC218;&amp;#xB7C9;&amp;#xC744; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB9E4;&amp;#xD551;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; public&amp;#xC774; &amp;#xBD99;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; balances&amp;#xB97C; &amp;#xC8FC;&amp;#xC18C; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;event Sent(address from, address to, uint amount);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;send()&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC904;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC694;. Sent &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xB9AC;&amp;#xC2A4;&amp;#xB108;&amp;#xB294; &amp;#xC804;&amp;#xC1A1;&amp;#xC790;, &amp;#xC218;&amp;#xC2E0;&amp;#xC790;, &amp;#xAE08;&amp;#xC561; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; transaction&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;constructor() {
    minter = msg.sender;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xC790;(Constructor) &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC30;&amp;#xD3EC;&amp;#xB420; &amp;#xB54C; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xB3FC;&amp;#xC694;. msg.sender&amp;#xB294; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC774;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; minter&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function mint(address receiver, uint amount) public {
    require(msg.sender == minter);
    balances[receiver] += amount;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;require(msg.sender == minter)&lt;/code&gt; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xC624;&amp;#xC9C1; &amp;#xBC30;&amp;#xD3EC;&amp;#xC790;&amp;#xB9CC;&amp;#xC774; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&amp;#xD574;&amp;#xC694;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9CC;&amp;#xC57D; &lt;code&gt;balances[receiver]+amount&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; uint256&amp;#xC758; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12;&amp;#xC744; &amp;#xB118;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74;,  Solidity&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC5F0;&amp;#xC0B0; &amp;#xC548;&amp;#xC804;&amp;#xC131;(Checked Arithmetic)&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; revert &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;error InsufficientBalance(uint requested, uint available);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xB7EC;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; error&amp;#xC640; revert&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C4; &amp;#xCF54;&amp;#xC778;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC591;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; InsufficientBalance &amp;#xC624;&amp;#xB958;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xCDE8;&amp;#xC18C;&amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function send(address receiver, uint amount) public {
    require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
    balances[msg.sender] -= amount;
    balances[receiver] += amount;
    emit Sent(msg.sender, receiver, amount);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; require &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; InsufficientBalance &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;2) &lt;strong&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xBC30;&amp;#xD3EC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; Solidity &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Bytecode&amp;#xC640; Application Binary Interface (ABI)&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bytecode&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(EVM)&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC800;&amp;#xC218;&amp;#xC900; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;ABI&amp;#xB294; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC804;&amp;#xD30C;&amp;#xB418;&amp;#xBA70;, &amp;#xC774; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBD80;&amp;#xC5EC;&amp;#xBC1B;&amp;#xC544; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;3) &lt;strong&gt;&amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xD638;&amp;#xCD9C;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function send(address receiver, uint amount) public {
        require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC815;&amp;#xBCF4;(&amp;#xB300;&amp;#xC0C1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;, ABI &amp;#xAE30;&amp;#xBC18; &amp;#xD568;&amp;#xC218; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;, &amp;#xAC00;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4; &amp;#xB4F1;)&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB85C;&amp;#xB4DC;&amp;#xCE90;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; Coin.sol&amp;#xC758; send() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xB54C;, &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xB178;&amp;#xB4DC;&amp;#xC758; mempool&amp;#xC5D0; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0;, &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;(miner &amp;#xB610;&amp;#xB294; validator)&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; mempool&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xD6C4;, &amp;#xC218;&amp;#xC218;&amp;#xB8CC;(gas price)&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB3FC;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#x2192; mempool(Memory Pool): &amp;#xC544;&amp;#xC9C1; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF5;&amp;#xAC04;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC774; &amp;#xD2B8;&amp;#xB79C;&amp;#xC81D;&amp;#xC158;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB85C;&amp;#xB4DC;&amp;#xCE90;&amp;#xC2A4;&amp;#xD305;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;4) &lt;strong&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC2E4;&amp;#xD589; (EVM)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;&amp;#xAC00; &amp;#xBA3C;&amp;#xC800; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xAC80;&amp;#xC99D; &amp;#xB178;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC7AC;&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC815;&amp;#xB2F9;&amp;#xC131;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;, EVM&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;(send() &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. EVM&amp;#xC740; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xACE0;, require &amp;#xC870;&amp;#xAC74;&amp;#xBB38;, &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xACBD;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xAE30;&amp;#xB85D; &amp;#xB4F1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xACC4;&amp;#xC57D;&amp;#xC774; &amp;#xC774;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; InsufficientBalance &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098; revert&amp;#xB418;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xB864;&amp;#xBC31;&amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;5) &lt;strong&gt;&amp;#xAC00;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; EVM&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0;&amp;#xB294; &amp;#xAC00;&amp;#xC2A4;(Gas)&amp;#xAC00; &amp;#xC18C;&amp;#xBAA8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;(&amp;#xAC80;&amp;#xC99D;&amp;#xC790;)&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC778;&amp;#xC13C;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB85C; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0;, &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xD55C; gasLimit&amp;#xACFC; &amp;#xC2E4;&amp;#xC81C; &amp;#xC18C;&amp;#xBAA8;&amp;#xB7C9;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB0A8;&amp;#xC740; &amp;#xAC00;&amp;#xC2A4;&amp;#xB294; &amp;#xD658;&amp;#xBD88;&amp;#xB418;&amp;#xBA70;, &amp;#xC2E4;&amp;#xD328;&amp;#xD55C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xB3C4; &amp;#xAC00;&amp;#xC2A4;&amp;#xB294; &amp;#xC18C;&amp;#xBAA8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;6) &lt;strong&gt;&amp;#xACB0;&amp;#xACFC; &amp;#xC800;&amp;#xC7A5;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xBC18;&amp;#xC601;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xD654;: &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;balances[msg.sender] -= amount&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB0B4;&amp;#xBD80; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xD2B8;&amp;#xB77C;&amp;#xC774;(&lt;strong&gt;state trie)&lt;/strong&gt;&amp;#xC5D0; &amp;#xBC18;&amp;#xC601;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xB85C;&amp;#xADF8;: &lt;code&gt;emit Sent(&amp;#x2026;)&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xB85C;&amp;#xADF8; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;(receipts)&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xC601;&amp;#xAD6C;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB85D;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xB204;&amp;#xAD6C;&amp;#xB4E0;&amp;#xC9C0; &amp;#xC774;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xACC4;&amp;#xC57D; &amp;#xBC29;&amp;#xC2DD;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC544;&amp;#xC8FC; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC911;&amp;#xAC1C;&amp;#xC790; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xACC4;&amp;#xC57D;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xD22C;&amp;#xBA85;&amp;#xC131; &amp;#xACFC; &amp;#xBCC0;&amp;#xACBD; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xBCF4;&amp;#xC7A5;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xB3C4; &amp;#xB192;&amp;#xC740; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC7A5;&amp;#xC810; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC810;&amp;#xC810; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xB113;&amp;#xD600;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC0AC;&amp;#xB840;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC0AC;&amp;#xB840;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD65C;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD65C;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&lt;/h2&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xAC16;&amp;#xCD98; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;DeFi (&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654; &amp;#xAE08;&amp;#xC735;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DeFi&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xC740;&amp;#xD589;, &amp;#xC99D;&amp;#xAD8C;&amp;#xC0AC; &amp;#xAC19;&amp;#xC740; &amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAE08;&amp;#xC735;&amp;#xAE30;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4;, &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xAE08;, &amp;#xB300;&amp;#xCD9C;, &amp;#xC790;&amp;#xC0B0;&amp;#xAC70;&amp;#xB798;, &amp;#xD30C;&amp;#xC0DD; &amp;#xC0C1;&amp;#xD488; &amp;#xB4F1;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD0C8; &amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAE08;&amp;#xC735; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. DeFi &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE08;&amp;#xC735; &amp;#xAC70;&amp;#xB798; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Aave&amp;#xB098; Compound&amp;#xAC19;&amp;#xC740; DeFi &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC608;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB2F4;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB300;&amp;#xCD9C;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC608;&amp;#xB85C;&amp;#xB294; Uniswap&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC911;&amp;#xC559; &amp;#xAC70;&amp;#xB798;&amp;#xC18C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD50;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC778;&amp;#xB370;, &amp;#xAC70;&amp;#xB798;&amp;#xB294; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC608;&amp;#xCE58;&amp;#xB41C; &amp;#xC720;&amp;#xB3D9;&amp;#xC131; &amp;#xD480;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xAD50;&amp;#xD658; &amp;#xB85C;&amp;#xC9C1; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB3FC;&amp;#xC694;. &amp;#xC774;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xAC8C; Curve&amp;#xB294; &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778; &amp;#xAC04;&amp;#xC758; &amp;#xAD50;&amp;#xD658;&amp;#xC5D0; &amp;#xD2B9;&amp;#xD654;&amp;#xB41C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C;, &amp;#xAC70;&amp;#xB798; &amp;#xACFC;&amp;#xC815; &amp;#xB610;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;2) &lt;strong&gt;DAO (&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xC790;&amp;#xC728;&amp;#xC870;&amp;#xC9C1;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DAO (Decentralized Autonomous Organization)&amp;#xB294; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xC870;&amp;#xC9C1;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xADDC;&amp;#xCE59;&amp;#xACFC; &amp;#xC758;&amp;#xC0AC; &amp;#xACB0;&amp;#xC815;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC9D1;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC870;&amp;#xC9C1; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC740; DAO &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xBCF4;&amp;#xC720;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD22C;&amp;#xD45C;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0;, &amp;#xC81C;&amp;#xC548;&amp;#xB41C; &amp;#xC548;&amp;#xAC74;&amp;#xC774; &amp;#xC77C;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xBA74; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xADF8; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB294; MarkerDAO&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. MarkerDAO&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; DAO&amp;#xB85C;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778;&amp;#xC778; DAI&amp;#xB97C; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. MarkerDAO&amp;#xB294; DAI&amp;#xC758; &amp;#xAC00;&amp;#xCE58;&amp;#xB97C; &amp;#xC548;&amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xC790;&amp;#xC728; &amp;#xC870;&amp;#xC815;&amp;#xC774;&amp;#xB098; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD22C;&amp;#xD45C;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; DAO&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xAC1C;&amp;#xC785; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC6B4;&amp;#xC601;&amp;#xC774; &amp;#xC870;&amp;#xC9C1;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;3) &lt;strong&gt;CryptoKitties&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;CryptoKitties&amp;#xB294; 2017&amp;#xB144; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAC8C;&amp;#xC784;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xAD50;&amp;#xBC30;&amp;#xD558;&amp;#xBA70; &amp;#xAC70;&amp;#xB798;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xACFC; &amp;#xC678;&amp;#xD615;&amp;#xC744; &amp;#xC9C0;&amp;#xB2CC; NFT&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB3FC;&amp;#xC694;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB450; &amp;#xB9C8;&amp;#xB9AC;&amp;#xC758; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xAD50;&amp;#xBC30;&amp;#xC2DC;&amp;#xCF1C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xD0C4;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC774; &amp;#xB54C; &amp;#xC720;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xC758; &amp;#xC870;&amp;#xD569;&amp;#xACFC; &amp;#xAD50;&amp;#xBC30; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; NFT&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF4;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xCD9C;&amp;#xC2DC; &amp;#xC9C1;&amp;#xD6C4; &amp;#xD070; &amp;#xC778;&amp;#xAE30;&amp;#xB97C; &amp;#xB04C;&amp;#xBA70; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xACFC;&amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xC815;&amp;#xB3C4;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xAE08;&amp;#xC735;, &amp;#xC870;&amp;#xC9C1; &amp;#xC6B4;&amp;#xC601;, &amp;#xAC8C;&amp;#xC784; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xBC1C;&amp;#xD558;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xC131;&amp;#xC774; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB09C; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBA87; &amp;#xCC28;&amp;#xB840; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xB840;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBC14; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&amp;#xC640; &amp;#xD568;&amp;#xAED8; smart contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Smart-Contract&amp;#xC758;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#Smart-Contract&amp;#xC758;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;Smart Contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;/a&gt;Smart Contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/h2&gt;&lt;h3 id=&#34;1-Reentrancy-Attack&#34;&gt;&lt;a href=&#34;#1-Reentrancy-Attack&#34; class=&#34;headerlink&#34; title=&#34;1. Reentrancy Attack&#34;&gt;&lt;/a&gt;1. Reentrancy Attack&lt;/h3&gt;&lt;p&gt;Reentrancy Attack(&amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;)&amp;#xC740; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(state)&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD558;&amp;#xAE30;&amp;#xC804;&amp;#xC5D0; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;(&amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;)&amp;#xAC00; &amp;#xC6D0;&amp;#xB798; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xAE08; &amp;#xB4F1;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2016&amp;#xB144; DAO &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC57D; 6000&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;&amp;#xAC00; &amp;#xD0C8;&amp;#xCDE8;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xAC80;&amp;#xD1A0;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xBCF4;&amp;#xC548; &amp;#xD56D;&amp;#xBAA9;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC608;&amp;#xC2DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC678;&amp;#xBD80; &amp;#xC8FC;&amp;#xC18C; (&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;)&amp;#xB85C; &amp;#xC774;&amp;#xB354;(ETH)&amp;#xB098; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xBA74;, &amp;#xC218;&amp;#xC2E0;&amp;#xC790; &amp;#xCABD;&amp;#xC758; &amp;#xD568;&amp;#xC218; (fallback() &amp;#xB610;&amp;#xB294; receive())&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C; &amp;#xADF8; &amp;#xD568;&amp;#xC218; &amp;#xC548;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xD68C;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC6D0;&amp;#xB798; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC7AC;&amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74;, &amp;#xC6D0;&amp;#xB798; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xC774;&amp;#xC804; &amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB610; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xACB0;&amp;#xACFC;, &amp;#xC794;&amp;#xC561; &amp;#xAC80;&amp;#xC99D; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xACC4;&amp;#xC18D; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBE7C;&amp;#xB0B4;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; DAO &amp;#xD574;&amp;#xD0B9; &amp;#xB2F9;&amp;#xC2DC; &amp;#xCDE8;&amp;#xC57D;&amp;#xD588;&amp;#xB358; &amp;#xD568;&amp;#xC218; splitDAO()&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C;, &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD588;&amp;#xB358; &amp;#xAD6C;&amp;#xC870;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function splitDAO(uint _proposalID, address _newCurator) noEther onlyTokenholders returns (bool _success) {
    ...
		// [1]
    uint fundsToBeMoved = (balances[msg.sender] * p.splitData[0].splitBalance) / p.splitData[0].totalSupply;
    //Since the balance is never updated the attacker can pass this modifier several times 
    // [2]
    if (p.splitData[0].newDAO.createTokenProxy.value(fundsToBeMoved)(msg.sender) == false) throw;

    ...

    // Burn DAO Tokens
    // Funds are transferred before the balance is updated
    //[3]
    Transfer(msg.sender, 0, balances[msg.sender]);
    withdrawRewardFor(msg.sender); // be nice, and get his rewards
    // Only now after the funds are transferred is the balance updated
    totalSupply -= balances[msg.sender];
    paidOut[msg.sender] = 0;
    return true;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;splitDAO() &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; DAO&amp;#xB97C; &amp;#xD0C8;&amp;#xD1F4;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; DAO&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[1]&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBC1B;&amp;#xC744; &amp;#xC774;&amp;#xB354; &amp;#xAE08;&amp;#xC561;&amp;#xC778; &lt;code&gt;fundsToBeMoved&lt;/code&gt;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294;,. &amp;#xC774; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;balances[msg.sender]&lt;/code&gt;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;[2]&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB354;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;(&lt;code&gt;createTokenProxy&lt;/code&gt;)&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC545;&amp;#xC131; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; splitDAO()&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &lt;code&gt;balances[msg.sender]&lt;/code&gt;&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xAC12;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE08;&amp;#xC561;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xC778;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;[3] &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC678;&amp;#xBD80; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xBC29;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC804;&amp;#xD600; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;Checks-Effects-Interactions &amp;#xD328;&amp;#xD134; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; checks &amp;#x2192; Effects &amp;#x2192; Interaction &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Checks: &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xACFC; &amp;#xC870;&amp;#xAC74; &amp;#xAC80;&amp;#xC99D;&lt;/li&gt;
&lt;li&gt;Effects: &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;Interactions: &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xD638;&amp;#xCD9C;&lt;br&gt;2) &lt;strong&gt;ReentrancyGuard &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;&lt;a href=&#34;https://docs.openzeppelin.com/contracts/4.x/api/security#ReentrancyGuard&#34;&gt;OpenZeppelin&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; ReentrancyGuard&amp;#xB294; &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;nonReentrant&lt;/code&gt; modifier&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC77C; &amp;#xB54C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;2-Improper-Access-Control&#34;&gt;&lt;a href=&#34;#2-Improper-Access-Control&#34; class=&#34;headerlink&#34; title=&#34;2. Improper Access Control&#34;&gt;&lt;/a&gt;2. Improper Access Control&lt;/h3&gt;&lt;p&gt;Access control vulnerability (&amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;)&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;(ex. &amp;#xD1A0;&amp;#xD070; &amp;#xBC1C;&amp;#xD589;, &amp;#xC790;&amp;#xC0B0; &amp;#xC778;&amp;#xCD9C;, &amp;#xACC4;&amp;#xC57D; &amp;#xC815;&amp;#xC9C0;, &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC; &amp;#xB4F1;)&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xACC4;&amp;#xC57D;&amp;#xC758; &amp;#xBCF4;&amp;#xC548;&amp;#xC131;&amp;#xACFC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC704;&amp;#xD611;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

contract Solidity_AccessControl {
    mapping(address =&amp;gt; uint256) public balances;

    // Burn function with no access control
    function burn(address account, uint256 amount) public {
        _burn(account, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC608;&amp;#xC81C;&amp;#xB294; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; burn &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC544;&amp;#xBB34; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xD1A0;&amp;#xD070; &amp;#xC794;&amp;#xC561;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xD30C;&amp;#xAD34;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xC5C6;&amp;#xC774; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD55C; &amp;#xC804;&amp;#xD615;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; onlyOwner modifier&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xC9C1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB9CC; burn&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

// Import the Ownable contract from OpenZeppelin to manage ownership
import &amp;quot;@openzeppelin/contracts/access/Ownable.sol&amp;quot;;

contract Solidity_AccessControl is Ownable {
    mapping(address =&amp;gt; uint256) public balances;

    // Burn function with proper access control, only accessible by the contract owner
    function burn(address account, uint256 amount) public onlyOwner {
        _burn(account, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;2017&amp;#xB144; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Parity Multisig Wallet &amp;#xD574;&amp;#xD0B9;&amp;#xC740; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD568;&amp;#xC218; &lt;code&gt;initWallet()&lt;/code&gt;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC774; &amp;#xC6D0;&amp;#xC778;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xC9C0;&amp;#xAC11;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD588;&amp;#xACE0;, &amp;#xC57D; 15&amp;#xB9CC; ETH(&amp;#xB2F9;&amp;#xC2DC; &amp;#xC57D; 3&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;)&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;Mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;OpenZeppelin&amp;#xC758; &lt;a href=&#34;https://docs.openzeppelin.com/contracts/2.x/api/ownership#Ownable&#34;&gt;&lt;code&gt;Ownable&lt;/code&gt;&lt;/a&gt;, &lt;code&gt;AccessControl&lt;/code&gt;, &lt;code&gt;RBAC&lt;/code&gt;(Role-Based Access Control) &amp;#xAC19;&amp;#xC740; &amp;#xAC80;&amp;#xC99D;&amp;#xB41C; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;2) &lt;strong&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC5D0; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xACE0; &amp;#xCCB4;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC124;&amp;#xACC4;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;h3 id=&#34;3-Price-oracle-manipulation&#34;&gt;&lt;a href=&#34;#3-Price-oracle-manipulation&#34; class=&#34;headerlink&#34; title=&#34;3. Price oracle manipulation&#34;&gt;&lt;/a&gt;3. &lt;strong&gt;Price oracle manipulation&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC678;&amp;#xBD80;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xAC00;&amp;#xACA9;&amp;#xC774;&amp;#xB098; &amp;#xAE30;&amp;#xD0C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xB54C; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; DeFi&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC0B0; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC774; &amp;#xC870;&amp;#xC791;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xAC70;&amp;#xC9D3; &amp;#xAC00;&amp;#xACA9; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD574; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBB34;&amp;#xB2E8; &amp;#xC778;&amp;#xCD9C;, &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xB808;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xD30C;&amp;#xC0B0;, &amp;#xC720;&amp;#xB3D9;&amp;#xC131; &amp;#xD480; &amp;#xACE0;&amp;#xAC08; &amp;#xB4F1;&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC608;&amp;#xC2DC;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;
// [1]
interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }
		// [2]
    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        require(price &amp;gt; 0, &amp;quot;Price must be positive&amp;quot;);
	
        // Vulnerability: No validation or protection against price manipulation
        //[3]
        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on manipulated price
        // If an attacker manipulates the oracle, they could borrow more than they should
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;[1]&amp;#xC758; getLatestPrice() &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC678;&amp;#xBD80; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;(&amp;#xC624;&amp;#xB77C;&amp;#xD074;)&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD5C8;&amp;#xC704; &amp;#xAC00;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[2]&amp;#xB85C; borrow()&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C;, &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xD604;&amp;#xC7AC; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xBC1B;&amp;#xC544;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. price &amp;gt; 0 &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC;&amp;#xACE0;, &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xAC00;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBC29;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[3]&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC1B;&amp;#xC544;&amp;#xC628; &amp;#xAC00;&amp;#xACA9; &amp;#xAC12;&amp;#xACFC; amount&amp;#xB97C; &amp;#xACF1;&amp;#xD574;&amp;#xC11C; &amp;#xB2F4;&amp;#xBCF4; &amp;#xAC00;&amp;#xCE58;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xAC12;&amp;#xC774; &amp;#xACFC;&amp;#xB300;&amp;#xD3C9;&amp;#xAC00;&amp;#xB418;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBE4C;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD5C8;&amp;#xC704; &amp;#xAC00;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB2F4;&amp;#xBCF4; &amp;#xB300;&amp;#xBE44; &amp;#xCD08;&amp;#xACFC; &amp;#xB300;&amp;#xCD9C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC790;&amp;#xC0B0; &amp;#xC720;&amp;#xCD9C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC644;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;
    // [1]
    int public minPrice = 1000; // Set minimum acceptable price
    int public maxPrice = 2000; // Set maximum acceptable price

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }

    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        // [2]
        require(price &amp;gt; 0 &amp;amp;&amp;amp; price &amp;gt;= minPrice &amp;amp;&amp;amp; price &amp;lt;= maxPrice, &amp;quot;Price manipulation detected&amp;quot;);

        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on valid price
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;[1] &amp;#xAC00;&amp;#xACA9; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE30;&amp;#xC900;&amp;#xAC12; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xACE0; [2] &amp;#xAC00;&amp;#xACA9; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;2023&amp;#xB144; 2&amp;#xC6D4; BonqDAO &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xC870;&amp;#xC791; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; 1&amp;#xC5B5; 2&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;&amp;#xC758; &amp;#xC190;&amp;#xC2E4;&amp;#xC744; &amp;#xC785;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ALBT &amp;#xD1A0;&amp;#xD070; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xC778;&amp;#xC704;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD480;&amp;#xB9AC;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xB2F4;&amp;#xBCF4;&amp;#xB85C; BEUR &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xACFC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xBC1C;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC740; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xAC00;&amp;#xACA9; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC7AC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;2023&amp;#xB144; 5&amp;#xC6D4; Baby Doge &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xC870;&amp;#xC791; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC57D; 13&amp;#xB9CC; 7&amp;#xCC9C; &amp;#xB2EC;&amp;#xB7EC; &amp;#xC0C1;&amp;#xB2F9;&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC785;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC9D1;&amp;#xACC4;&amp;#xD558;&amp;#xBA74; &amp;#xC870;&amp;#xC791; &amp;#xC704;&amp;#xD5D8;&amp;#xC744; &amp;#xC904;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE09;&amp;#xACA9;&amp;#xD55C; &amp;#xAC00;&amp;#xACA9; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xAC00;&amp;#xACA9;&amp;#xC5D0; &amp;#xCD5C;&amp;#xC18C;&amp;#xAC12; &amp;#xBC0F; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12; &amp;#xC784;&amp;#xACC4; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC784;&amp;#xB77D;(time lock)&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC00;&amp;#xACA9; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC744; &amp;#xB450;&amp;#xBA74; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC778; &amp;#xAC00;&amp;#xACA9; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xC11C;&amp;#xBA85; &amp;#xB4F1; &amp;#xC99D;&amp;#xBA85; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0;&amp;#xB97C; &amp;#xB2E4;&amp;#xB918;&amp;#xC5B4;&amp;#xC694;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xBD84;&amp;#xB7C9; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xB840;&amp;#xC640; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB354; &amp;#xB2E4;&amp;#xB904;&amp;#xBCFC;&amp;#xAE4C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC911;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xB9D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC74C; &amp;#xC8FC;&amp;#xC81C;&amp;#xAC00; &amp;#xAF2D; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F605; &amp;#xAE34; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html&#34;&gt;https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/pcaversaccio/reentrancy-attacks&#34;&gt;https://github.com/pcaversaccio/reentrancy-attacks&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://owasp.org/www-project-smart-contract-top-10/&#34;&gt;https://owasp.org/www-project-smart-contract-top-10/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2&#34;&gt;https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] From Paper to Code: Smart Contract [ko] - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC120; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xACFC; &amp;#xD569;&amp;#xC758; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC704;&amp;#xC5D0; &amp;#xAD6C;&amp;#xCD95;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC778; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xACC4;&amp;#xC57D;&amp;#xC740; &amp;#xC885;&amp;#xC774; &amp;#xBB38;&amp;#xC11C;&amp;#xC640; &amp;#xC11C;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0;, &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xC911;&amp;#xAC1C;&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Smart Contract&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&lt;/h2&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xD574;&amp;#xB454; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC57D;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC694;. &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC911;&amp;#xAC1C; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xC808;&amp;#xAC10;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC81C;3&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xACC4;&amp;#xC57D;&amp;#xC744; &amp;#xC774;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC740; 1994&amp;#xB144;, &amp;#xB2C9; &amp;#xC0AC;&amp;#xBCF4;(Nick Szabo)&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC548; &amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. (&amp;#xC5EC;&amp;#xB2F4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; Nick Szabo&amp;#xB294; &amp;#xC0AC;&amp;#xD1A0;&amp;#xC2DC; &amp;#xB098;&amp;#xCE74;&amp;#xBAA8;&amp;#xD1A0;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xBB3C; &amp;#xC911; &amp;#xD55C; &amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xC8FC; &amp;#xC5B8;&amp;#xAE09;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;) &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xB54C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150; &amp;#xBFD0;&amp;#xC774;&amp;#xC5C8;&amp;#xACE0;, &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC2E4;&amp;#xD604;&amp;#xC740; &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. 2013&amp;#xB144; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC758; &amp;#xCC3D;&amp;#xC2DC;&amp;#xC790;&amp;#xC778; &amp;#xBE44;&amp;#xD0C8;&amp;#xB9AD; &amp;#xBD80;&amp;#xD14C;&amp;#xB9B0;(Vitalik Buterin)&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &lt;a href=&#34;https://web.archive.org/web/20131228111141/http://vbuterin.com/ethereum.html&#34;&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xB2F4;&amp;#xC740; &amp;#xBC31;&amp;#xC11C;&lt;/a&gt;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xD6C4; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC774; 2015&amp;#xB144;&amp;#xC5D0; &amp;#xC815;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB7F0;&amp;#xCE6D;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F0;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB7F0; &amp;#xACC4;&amp;#xC57D;&amp;#xB4E4;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; if-then &amp;#xC870;&amp;#xAC74;&amp;#xBB38; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xACC4;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC73C;&amp;#xB85C; &amp;#xC5EC;&amp;#xACA8;&amp;#xC838;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xB3D9;&amp;#xC791;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xB3D9;&amp;#xC791;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&lt;/h3&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xB3D9;&amp;#xC791; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;&amp;#xCF54;&amp;#xB4DC; &amp;#xC791;&amp;#xC131;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Solidity&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB85C; &amp;#xC815;&amp;#xB9D0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;pragma solidity ^0.8.26;

contract Coin {
    // The keyword &amp;quot;public&amp;quot; makes variables
    // accessible from other contracts
    address public minter;
    mapping(address =&amp;gt; uint) public balances;

    // Events allow clients to react to specific
    // contract changes you declare
    event Sent(address from, address to, uint amount);

    // Constructor code is only run when the contract
    // is created
    constructor() {
        minter = msg.sender;
    }

    // Sends an amount of newly created coins to an address
    // Can only be called by the contract creator
    function mint(address receiver, uint amount) public {
        require(msg.sender == minter);
        balances[receiver] += amount;
    }

    // Errors allow you to provide information about
    // why an operation failed. They are returned
    // to the caller of the function.
    error InsufficientBalance(uint requested, uint available);

    // Sends an amount of existing coins
    // from any caller to an address
    function send(address receiver, uint amount) public {
        require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;address public minter;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218; minter&amp;#xB97C; &amp;#xC120;&amp;#xC5B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. address &amp;#xD0C0;&amp;#xC785;&amp;#xC740; 160&amp;#xBE44;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xB85C;, &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xACC4;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C; &amp;#xD639;&amp;#xC740; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; public &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD99;&amp;#xC774;&amp;#xBA74; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; getter &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;mapping(address =&amp;gt; uint) public balances;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; address&amp;#xB97C; &amp;#xD0A4;&amp;#xB85C; &amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758;&amp;#xCF54;&amp;#xC778; &amp;#xC218;&amp;#xB7C9;&amp;#xC744; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB9E4;&amp;#xD551;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; public&amp;#xC774; &amp;#xBD99;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; balances&amp;#xB97C; &amp;#xC8FC;&amp;#xC18C; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;event Sent(address from, address to, uint amount);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;send()&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xC904;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC694;. Sent &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xB9AC;&amp;#xC2A4;&amp;#xB108;&amp;#xB294; &amp;#xC804;&amp;#xC1A1;&amp;#xC790;, &amp;#xC218;&amp;#xC2E0;&amp;#xC790;, &amp;#xAE08;&amp;#xC561; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; transaction&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;constructor() {
    minter = msg.sender;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xC790;(Constructor) &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC30;&amp;#xD3EC;&amp;#xB420; &amp;#xB54C; &amp;#xD55C; &amp;#xBC88;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xB3FC;&amp;#xC694;. msg.sender&amp;#xB294; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC774;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; minter&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function mint(address receiver, uint amount) public {
    require(msg.sender == minter);
    balances[receiver] += amount;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;require(msg.sender == minter)&lt;/code&gt; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xC624;&amp;#xC9C1; &amp;#xBC30;&amp;#xD3EC;&amp;#xC790;&amp;#xB9CC;&amp;#xC774; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC81C;&amp;#xD55C;&amp;#xD574;&amp;#xC694;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB9CC;&amp;#xC57D; &lt;code&gt;balances[receiver]+amount&lt;/code&gt; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC774; uint256&amp;#xC758; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12;&amp;#xC744; &amp;#xB118;&amp;#xB294;&amp;#xB2E4;&amp;#xBA74;,  Solidity&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC5F0;&amp;#xC0B0; &amp;#xC548;&amp;#xC804;&amp;#xC131;(Checked Arithmetic)&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; revert &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;error InsufficientBalance(uint requested, uint available);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC5D0;&amp;#xB7EC;&amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; error&amp;#xC640; revert&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C4; &amp;#xCF54;&amp;#xC778;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC591;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; InsufficientBalance &amp;#xC624;&amp;#xB958;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xCDE8;&amp;#xC18C;&amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function send(address receiver, uint amount) public {
    require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
    balances[msg.sender] -= amount;
    balances[receiver] += amount;
    emit Sent(msg.sender, receiver, amount);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xB2E4;&amp;#xB978; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; require &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; InsufficientBalance &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xB098;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;2) &lt;strong&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xBC30;&amp;#xD3EC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; Solidity &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Bytecode&amp;#xC640; Application Binary Interface (ABI)&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bytecode&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xAC00;&amp;#xC0C1;&amp;#xBA38;&amp;#xC2E0;(EVM)&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC800;&amp;#xC218;&amp;#xC900; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;ABI&amp;#xB294; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB85C;, &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC804;&amp;#xD30C;&amp;#xB418;&amp;#xBA70;, &amp;#xC774; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBD80;&amp;#xC5EC;&amp;#xBC1B;&amp;#xC544; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;3) &lt;strong&gt;&amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xD638;&amp;#xCD9C;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function send(address receiver, uint amount) public {
        require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xC815;&amp;#xBCF4;(&amp;#xB300;&amp;#xC0C1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;, ABI &amp;#xAE30;&amp;#xBC18; &amp;#xD568;&amp;#xC218; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;, &amp;#xAC00;&amp;#xC2A4; &amp;#xC815;&amp;#xBCF4; &amp;#xB4F1;)&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB85C;&amp;#xB4DC;&amp;#xCE90;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; Coin.sol&amp;#xC758; send() &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xB54C;, &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xB178;&amp;#xB4DC;&amp;#xC758; mempool&amp;#xC5D0; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xACE0;, &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;(miner &amp;#xB610;&amp;#xB294; validator)&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; mempool&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC04; &amp;#xD6C4;, &amp;#xC218;&amp;#xC218;&amp;#xB8CC;(gas price)&amp;#xAC00; &amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB3FC;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#x2192; mempool(Memory Pool): &amp;#xC544;&amp;#xC9C1; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xB4E4;&amp;#xC774; &amp;#xC784;&amp;#xC2DC;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xACF5;&amp;#xAC04;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC774; &amp;#xD2B8;&amp;#xB79C;&amp;#xC81D;&amp;#xC158;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB85C;&amp;#xB4DC;&amp;#xCE90;&amp;#xC2A4;&amp;#xD305;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/07/13/bekim/smartcontract/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;4) &lt;strong&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC2E4;&amp;#xD589; (EVM)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;&amp;#xAC00; &amp;#xBA3C;&amp;#xC800; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xAC80;&amp;#xC99D; &amp;#xB178;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xC7AC;&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC815;&amp;#xB2F9;&amp;#xC131;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC790;&amp;#xB294; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;, EVM&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;(send() &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. EVM&amp;#xC740; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xACE0;, require &amp;#xC870;&amp;#xAC74;&amp;#xBB38;, &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xACBD;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xAE30;&amp;#xB85D; &amp;#xB4F1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;require(amount &amp;lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xACC4;&amp;#xC57D;&amp;#xC774; &amp;#xC774;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; InsufficientBalance &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB098; revert&amp;#xB418;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBCC0;&amp;#xACBD;&amp;#xC774; &amp;#xB864;&amp;#xBC31;&amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;5) &lt;strong&gt;&amp;#xAC00;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; EVM&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&amp;#xC5D0;&amp;#xB294; &amp;#xAC00;&amp;#xC2A4;(Gas)&amp;#xAC00; &amp;#xC18C;&amp;#xBAA8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xB4DC;(&amp;#xAC80;&amp;#xC99D;&amp;#xC790;)&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC778;&amp;#xC13C;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB85C; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0;, &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xD55C; gasLimit&amp;#xACFC; &amp;#xC2E4;&amp;#xC81C; &amp;#xC18C;&amp;#xBAA8;&amp;#xB7C9;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB0A8;&amp;#xC740; &amp;#xAC00;&amp;#xC2A4;&amp;#xB294; &amp;#xD658;&amp;#xBD88;&amp;#xB418;&amp;#xBA70;, &amp;#xC2E4;&amp;#xD328;&amp;#xD55C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xB3C4; &amp;#xAC00;&amp;#xC2A4;&amp;#xB294; &amp;#xC18C;&amp;#xBAA8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;6) &lt;strong&gt;&amp;#xACB0;&amp;#xACFC; &amp;#xC800;&amp;#xC7A5;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xBC18;&amp;#xC601;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xD654;: &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;balances[msg.sender] -= amount&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB0B4;&amp;#xBD80; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC; &amp;#xD2B8;&amp;#xB77C;&amp;#xC774;(&lt;strong&gt;state trie)&lt;/strong&gt;&amp;#xC5D0; &amp;#xBC18;&amp;#xC601;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xB85C;&amp;#xADF8;: &lt;code&gt;emit Sent(&amp;#x2026;)&lt;/code&gt; &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xB85C;&amp;#xADF8; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;(receipts)&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xC601;&amp;#xAD6C;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB85D;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xB204;&amp;#xAD6C;&amp;#xB4E0;&amp;#xC9C0; &amp;#xC774;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xCDA9;&amp;#xC871;&amp;#xB418;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xACC4;&amp;#xC57D; &amp;#xBC29;&amp;#xC2DD;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC544;&amp;#xC8FC; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC911;&amp;#xAC1C;&amp;#xC790; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xACC4;&amp;#xC57D;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xD22C;&amp;#xBA85;&amp;#xC131; &amp;#xACFC; &amp;#xBCC0;&amp;#xACBD; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xBCF4;&amp;#xC7A5;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xB3C4; &amp;#xB192;&amp;#xC740; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC7A5;&amp;#xC810; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC810;&amp;#xC810; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xB113;&amp;#xD600;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC0AC;&amp;#xB840;&#34;&gt;&lt;a href=&#34;#&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;-&amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758;-&amp;#xD65C;&amp;#xC6A9;-&amp;#xC0AC;&amp;#xB840;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD65C;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&#34;&gt;&lt;/a&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD65C;&amp;#xC6A9; &amp;#xC0AC;&amp;#xB840;&lt;/h2&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xAC16;&amp;#xCD98; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;DeFi (&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654; &amp;#xAE08;&amp;#xC735;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DeFi&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xC740;&amp;#xD589;, &amp;#xC99D;&amp;#xAD8C;&amp;#xC0AC; &amp;#xAC19;&amp;#xC740; &amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAE08;&amp;#xC735;&amp;#xAE30;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4;, &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xAE08;, &amp;#xB300;&amp;#xCD9C;, &amp;#xC790;&amp;#xC0B0;&amp;#xAC70;&amp;#xB798;, &amp;#xD30C;&amp;#xC0DD; &amp;#xC0C1;&amp;#xD488; &amp;#xB4F1;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD0C8; &amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAE08;&amp;#xC735; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. DeFi &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAE08;&amp;#xC735; &amp;#xAC70;&amp;#xB798; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Aave&amp;#xB098; Compound&amp;#xAC19;&amp;#xC740; DeFi &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC608;&amp;#xCE58;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC790;&amp;#xB97C; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB2F4;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB300;&amp;#xCD9C;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC608;&amp;#xB85C;&amp;#xB294; Uniswap&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC911;&amp;#xC559; &amp;#xAC70;&amp;#xB798;&amp;#xC18C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xAD50;&amp;#xD658;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC778;&amp;#xB370;, &amp;#xAC70;&amp;#xB798;&amp;#xB294; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC608;&amp;#xCE58;&amp;#xB41C; &amp;#xC720;&amp;#xB3D9;&amp;#xC131; &amp;#xD480;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xACE0;, &amp;#xAD50;&amp;#xD658; &amp;#xB85C;&amp;#xC9C1; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB3FC;&amp;#xC694;. &amp;#xC774;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xAC8C; Curve&amp;#xB294; &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778; &amp;#xAC04;&amp;#xC758; &amp;#xAD50;&amp;#xD658;&amp;#xC5D0; &amp;#xD2B9;&amp;#xD654;&amp;#xB41C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C;, &amp;#xAC70;&amp;#xB798; &amp;#xACFC;&amp;#xC815; &amp;#xB610;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;2) &lt;strong&gt;DAO (&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xC790;&amp;#xC728;&amp;#xC870;&amp;#xC9C1;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DAO (Decentralized Autonomous Organization)&amp;#xB294; &amp;#xC804;&amp;#xD1B5;&amp;#xC801;&amp;#xC778; &amp;#xC870;&amp;#xC9C1;&amp;#xCC98;&amp;#xB7FC; &amp;#xD2B9;&amp;#xC815; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xADDC;&amp;#xCE59;&amp;#xACFC; &amp;#xC758;&amp;#xC0AC; &amp;#xACB0;&amp;#xC815;&amp;#xC774; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC9D1;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC870;&amp;#xC9C1; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC740; DAO &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xBCF4;&amp;#xC720;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD22C;&amp;#xD45C;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0;, &amp;#xC81C;&amp;#xC548;&amp;#xB41C; &amp;#xC548;&amp;#xAC74;&amp;#xC774; &amp;#xC77C;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xBA74; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xADF8; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB294; MarkerDAO&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. MarkerDAO&amp;#xB294; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; DAO&amp;#xB85C;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778;&amp;#xC778; DAI&amp;#xB97C; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. MarkerDAO&amp;#xB294; DAI&amp;#xC758; &amp;#xAC00;&amp;#xCE58;&amp;#xB97C; &amp;#xC548;&amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xAD6C;&amp;#xC131;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xC790;&amp;#xC728; &amp;#xC870;&amp;#xC815;&amp;#xC774;&amp;#xB098; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD22C;&amp;#xD45C;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; DAO&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xAC1C;&amp;#xC785; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC6B4;&amp;#xC601;&amp;#xC774; &amp;#xC870;&amp;#xC9C1;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;3) &lt;strong&gt;CryptoKitties&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;CryptoKitties&amp;#xB294; 2017&amp;#xB144; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAC8C;&amp;#xC784;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xAD50;&amp;#xBC30;&amp;#xD558;&amp;#xBA70; &amp;#xAC70;&amp;#xB798;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC5D0;&amp;#xC11C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&amp;#xACFC; &amp;#xC678;&amp;#xD615;&amp;#xC744; &amp;#xC9C0;&amp;#xB2CC; NFT&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xB3FC;&amp;#xC694;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB450; &amp;#xB9C8;&amp;#xB9AC;&amp;#xC758; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xAD50;&amp;#xBC30;&amp;#xC2DC;&amp;#xCF1C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xD0C4;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC774; &amp;#xB54C; &amp;#xC720;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xC758; &amp;#xC870;&amp;#xD569;&amp;#xACFC; &amp;#xAD50;&amp;#xBC30; &amp;#xACB0;&amp;#xACFC;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; NFT&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xACE0;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xB97C; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF4;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xAC8C;&amp;#xC784;&amp;#xC740; &amp;#xCD9C;&amp;#xC2DC; &amp;#xC9C1;&amp;#xD6C4; &amp;#xD070; &amp;#xC778;&amp;#xAE30;&amp;#xB97C; &amp;#xB04C;&amp;#xBA70; &amp;#xC774;&amp;#xB354;&amp;#xB9AC;&amp;#xC6C0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xACFC;&amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xC815;&amp;#xB3C4;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xAE08;&amp;#xC735;, &amp;#xC870;&amp;#xC9C1; &amp;#xC6B4;&amp;#xC601;, &amp;#xAC8C;&amp;#xC784; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBD84;&amp;#xC57C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xBC1C;&amp;#xD558;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xC131;&amp;#xC774; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB09C; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBA87; &amp;#xCC28;&amp;#xB840; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xB840;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBC14; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&amp;#xC640; &amp;#xD568;&amp;#xAED8; smart contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Smart-Contract&amp;#xC758;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#Smart-Contract&amp;#xC758;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;Smart Contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;/a&gt;Smart Contract&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/h2&gt;&lt;h3 id=&#34;1-Reentrancy-Attack&#34;&gt;&lt;a href=&#34;#1-Reentrancy-Attack&#34; class=&#34;headerlink&#34; title=&#34;1. Reentrancy Attack&#34;&gt;&lt;/a&gt;1. Reentrancy Attack&lt;/h3&gt;&lt;p&gt;Reentrancy Attack(&amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;)&amp;#xC740; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC;(state)&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD558;&amp;#xAE30;&amp;#xC804;&amp;#xC5D0; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;(&amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;)&amp;#xAC00; &amp;#xC6D0;&amp;#xB798; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xAE08; &amp;#xB4F1;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2016&amp;#xB144; DAO &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC57D; 6000&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;&amp;#xAC00; &amp;#xD0C8;&amp;#xCDE8;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xAC80;&amp;#xD1A0;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xBCF4;&amp;#xC548; &amp;#xD56D;&amp;#xBAA9;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC608;&amp;#xC2DC;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; &amp;#xC678;&amp;#xBD80; &amp;#xC8FC;&amp;#xC18C; (&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;)&amp;#xB85C; &amp;#xC774;&amp;#xB354;(ETH)&amp;#xB098; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xBA74;, &amp;#xC218;&amp;#xC2E0;&amp;#xC790; &amp;#xCABD;&amp;#xC758; &amp;#xD568;&amp;#xC218; (fallback() &amp;#xB610;&amp;#xB294; receive())&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C; &amp;#xADF8; &amp;#xD568;&amp;#xC218; &amp;#xC548;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xAE30;&amp;#xD68C;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC6D0;&amp;#xB798; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC7AC;&amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74;, &amp;#xC6D0;&amp;#xB798; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xC774;&amp;#xC804; &amp;#xD568;&amp;#xC218; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB610; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xACB0;&amp;#xACFC;, &amp;#xC794;&amp;#xC561; &amp;#xAC80;&amp;#xC99D; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xACC4;&amp;#xC18D; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBE7C;&amp;#xB0B4;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; DAO &amp;#xD574;&amp;#xD0B9; &amp;#xB2F9;&amp;#xC2DC; &amp;#xCDE8;&amp;#xC57D;&amp;#xD588;&amp;#xB358; &amp;#xD568;&amp;#xC218; splitDAO()&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xB85C;, &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD588;&amp;#xB358; &amp;#xAD6C;&amp;#xC870;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;function splitDAO(uint _proposalID, address _newCurator) noEther onlyTokenholders returns (bool _success) {
    ...
		// [1]
    uint fundsToBeMoved = (balances[msg.sender] * p.splitData[0].splitBalance) / p.splitData[0].totalSupply;
    //Since the balance is never updated the attacker can pass this modifier several times 
    // [2]
    if (p.splitData[0].newDAO.createTokenProxy.value(fundsToBeMoved)(msg.sender) == false) throw;

    ...

    // Burn DAO Tokens
    // Funds are transferred before the balance is updated
    //[3]
    Transfer(msg.sender, 0, balances[msg.sender]);
    withdrawRewardFor(msg.sender); // be nice, and get his rewards
    // Only now after the funds are transferred is the balance updated
    totalSupply -= balances[msg.sender];
    paidOut[msg.sender] = 0;
    return true;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;splitDAO() &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; DAO&amp;#xB97C; &amp;#xD0C8;&amp;#xD1F4;&amp;#xD558;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; DAO&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[1]&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBC1B;&amp;#xC744; &amp;#xC774;&amp;#xB354; &amp;#xAE08;&amp;#xC561;&amp;#xC778; &lt;code&gt;fundsToBeMoved&lt;/code&gt;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294;,. &amp;#xC774; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;balances[msg.sender]&lt;/code&gt;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;[2]&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB354;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xD568;&amp;#xC218;(&lt;code&gt;createTokenProxy&lt;/code&gt;)&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC545;&amp;#xC131; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xAC00; splitDAO()&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &lt;code&gt;balances[msg.sender]&lt;/code&gt;&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xAC12;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE08;&amp;#xC561;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xC778;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB3FC;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;[3] &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBBF8; &amp;#xC678;&amp;#xBD80; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xB05D;&amp;#xB09C; &amp;#xD6C4;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xBC29;&amp;#xC5B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC804;&amp;#xD600; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;Checks-Effects-Interactions &amp;#xD328;&amp;#xD134; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xB0B4;&amp;#xBD80; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; checks &amp;#x2192; Effects &amp;#x2192; Interaction &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Checks: &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xACFC; &amp;#xC870;&amp;#xAC74; &amp;#xAC80;&amp;#xC99D;&lt;/li&gt;
&lt;li&gt;Effects: &amp;#xC0C1;&amp;#xD0DC; &amp;#xBCC0;&amp;#xC218; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&lt;/li&gt;
&lt;li&gt;Interactions: &amp;#xC678;&amp;#xBD80; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xD638;&amp;#xCD9C;&lt;br&gt;2) &lt;strong&gt;ReentrancyGuard &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;&lt;a href=&#34;https://docs.openzeppelin.com/contracts/4.x/api/security#ReentrancyGuard&#34;&gt;OpenZeppelin&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; ReentrancyGuard&amp;#xB294; &amp;#xC7AC;&amp;#xC9C4;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;nonReentrant&lt;/code&gt; modifier&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC77C; &amp;#xB54C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;2-Improper-Access-Control&#34;&gt;&lt;a href=&#34;#2-Improper-Access-Control&#34; class=&#34;headerlink&#34; title=&#34;2. Improper Access Control&#34;&gt;&lt;/a&gt;2. Improper Access Control&lt;/h3&gt;&lt;p&gt;Access control vulnerability (&amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;)&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;(ex. &amp;#xD1A0;&amp;#xD070; &amp;#xBC1C;&amp;#xD589;, &amp;#xC790;&amp;#xC0B0; &amp;#xC778;&amp;#xCD9C;, &amp;#xACC4;&amp;#xC57D; &amp;#xC815;&amp;#xC9C0;, &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC; &amp;#xB4F1;)&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xACC4;&amp;#xC57D;&amp;#xC758; &amp;#xBCF4;&amp;#xC548;&amp;#xC131;&amp;#xACFC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC704;&amp;#xD611;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

contract Solidity_AccessControl {
    mapping(address =&amp;gt; uint256) public balances;

    // Burn function with no access control
    function burn(address account, uint256 amount) public {
        _burn(account, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC608;&amp;#xC81C;&amp;#xB294; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; burn &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC544;&amp;#xBB34; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xD1A0;&amp;#xD070; &amp;#xC794;&amp;#xC561;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xD30C;&amp;#xAD34;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xC5C6;&amp;#xC774; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD55C; &amp;#xC804;&amp;#xD615;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; onlyOwner modifier&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xC9C1; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB9CC; burn&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

// Import the Ownable contract from OpenZeppelin to manage ownership
import &amp;quot;@openzeppelin/contracts/access/Ownable.sol&amp;quot;;

contract Solidity_AccessControl is Ownable {
    mapping(address =&amp;gt; uint256) public balances;

    // Burn function with proper access control, only accessible by the contract owner
    function burn(address account, uint256 amount) public onlyOwner {
        _burn(account, amount);
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;2017&amp;#xB144; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Parity Multisig Wallet &amp;#xD574;&amp;#xD0B9;&amp;#xC740; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD568;&amp;#xC218; &lt;code&gt;initWallet()&lt;/code&gt;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC774; &amp;#xC6D0;&amp;#xC778;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xC9C0;&amp;#xAC11;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xC790;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD588;&amp;#xACE0;, &amp;#xC57D; 15&amp;#xB9CC; ETH(&amp;#xB2F9;&amp;#xC2DC; &amp;#xC57D; 3&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;)&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;Mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;1) &lt;strong&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&lt;br&gt;OpenZeppelin&amp;#xC758; &lt;a href=&#34;https://docs.openzeppelin.com/contracts/2.x/api/ownership#Ownable&#34;&gt;&lt;code&gt;Ownable&lt;/code&gt;&lt;/a&gt;, &lt;code&gt;AccessControl&lt;/code&gt;, &lt;code&gt;RBAC&lt;/code&gt;(Role-Based Access Control) &amp;#xAC19;&amp;#xC740; &amp;#xAC80;&amp;#xC99D;&amp;#xB41C; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;2) &lt;strong&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC5D0; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xACE0; &amp;#xCCB4;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC124;&amp;#xACC4;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/p&gt;
&lt;h3 id=&#34;3-Price-oracle-manipulation&#34;&gt;&lt;a href=&#34;#3-Price-oracle-manipulation&#34; class=&#34;headerlink&#34; title=&#34;3. Price oracle manipulation&#34;&gt;&lt;/a&gt;3. &lt;strong&gt;Price oracle manipulation&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB294; &amp;#xC678;&amp;#xBD80;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xAC00;&amp;#xACA9;&amp;#xC774;&amp;#xB098; &amp;#xAE30;&amp;#xD0C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC62C; &amp;#xB54C; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; DeFi&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC0B0; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC774; &amp;#xC870;&amp;#xC791;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xAC70;&amp;#xC9D3; &amp;#xAC00;&amp;#xACA9; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD574; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBB34;&amp;#xB2E8; &amp;#xC778;&amp;#xCD9C;, &amp;#xACFC;&amp;#xB3C4;&amp;#xD55C; &amp;#xB808;&amp;#xBC84;&amp;#xB9AC;&amp;#xC9C0;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xD30C;&amp;#xC0B0;, &amp;#xC720;&amp;#xB3D9;&amp;#xC131; &amp;#xD480; &amp;#xACE0;&amp;#xAC08; &amp;#xB4F1;&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xC608;&amp;#xC2DC;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;
// [1]
interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }
		// [2]
    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        require(price &amp;gt; 0, &amp;quot;Price must be positive&amp;quot;);
	
        // Vulnerability: No validation or protection against price manipulation
        //[3]
        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on manipulated price
        // If an attacker manipulates the oracle, they could borrow more than they should
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;[1]&amp;#xC758; getLatestPrice() &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC678;&amp;#xBD80; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;(&amp;#xC624;&amp;#xB77C;&amp;#xD074;)&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD5C8;&amp;#xC704; &amp;#xAC00;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[2]&amp;#xB85C; borrow()&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C;, &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xD604;&amp;#xC7AC; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xBC1B;&amp;#xC544;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. price &amp;gt; 0 &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC;&amp;#xACE0;, &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xAC00;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBC29;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;[3]&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC1B;&amp;#xC544;&amp;#xC628; &amp;#xAC00;&amp;#xACA9; &amp;#xAC12;&amp;#xACFC; amount&amp;#xB97C; &amp;#xACF1;&amp;#xD574;&amp;#xC11C; &amp;#xB2F4;&amp;#xBCF4; &amp;#xAC00;&amp;#xCE58;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xAC12;&amp;#xC774; &amp;#xACFC;&amp;#xB300;&amp;#xD3C9;&amp;#xAC00;&amp;#xB418;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xBE4C;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD5C8;&amp;#xC704; &amp;#xAC00;&amp;#xACA9; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB2F4;&amp;#xBCF4; &amp;#xB300;&amp;#xBE44; &amp;#xCD08;&amp;#xACFC; &amp;#xB300;&amp;#xCD9C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC790;&amp;#xC0B0; &amp;#xC720;&amp;#xCD9C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xC55E;&amp;#xC11C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC900; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCF4;&amp;#xC644;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs solidity&#34;&gt;// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;
    // [1]
    int public minPrice = 1000; // Set minimum acceptable price
    int public maxPrice = 2000; // Set maximum acceptable price

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }

    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        // [2]
        require(price &amp;gt; 0 &amp;amp;&amp;amp; price &amp;gt;= minPrice &amp;amp;&amp;amp; price &amp;lt;= maxPrice, &amp;quot;Price manipulation detected&amp;quot;);

        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on valid price
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;[1] &amp;#xAC00;&amp;#xACA9; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE30;&amp;#xC900;&amp;#xAC12; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xACE0; [2] &amp;#xAC00;&amp;#xACA9; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xC0AC;&amp;#xB840;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;2023&amp;#xB144; 2&amp;#xC6D4; BonqDAO &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xC870;&amp;#xC791; &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; 1&amp;#xC5B5; 2&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;&amp;#xC758; &amp;#xC190;&amp;#xC2E4;&amp;#xC744; &amp;#xC785;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ALBT &amp;#xD1A0;&amp;#xD070; &amp;#xAC00;&amp;#xACA9;&amp;#xC744; &amp;#xC778;&amp;#xC704;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD480;&amp;#xB9AC;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xB2F4;&amp;#xBCF4;&amp;#xB85C; BEUR &amp;#xC2A4;&amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xACFC;&amp;#xB3C4;&amp;#xD558;&amp;#xAC8C; &amp;#xBC1C;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC740; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xAC00;&amp;#xACA9; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xC7AC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;2023&amp;#xB144; 5&amp;#xC6D4; Baby Doge &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xC870;&amp;#xC791; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC57D; 13&amp;#xB9CC; 7&amp;#xCC9C; &amp;#xB2EC;&amp;#xB7EC; &amp;#xC0C1;&amp;#xB2F9;&amp;#xC758; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC785;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;mitigation&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC9D1;&amp;#xACC4;&amp;#xD558;&amp;#xBA74; &amp;#xC870;&amp;#xC791; &amp;#xC704;&amp;#xD5D8;&amp;#xC744; &amp;#xC904;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8; &amp;#xB85C;&amp;#xC9C1;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE09;&amp;#xACA9;&amp;#xD55C; &amp;#xAC00;&amp;#xACA9; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xAC00;&amp;#xACA9;&amp;#xC5D0; &amp;#xCD5C;&amp;#xC18C;&amp;#xAC12; &amp;#xBC0F; &amp;#xCD5C;&amp;#xB300;&amp;#xAC12; &amp;#xC784;&amp;#xACC4; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC784;&amp;#xB77D;(time lock)&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC00;&amp;#xACA9; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC5F0;&amp;#xC744; &amp;#xB450;&amp;#xBA74; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC778; &amp;#xAC00;&amp;#xACA9; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC624;&amp;#xB77C;&amp;#xD074;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1B;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xC11C;&amp;#xBA85; &amp;#xB4F1; &amp;#xC99D;&amp;#xBA85; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0;&amp;#xB97C; &amp;#xB2E4;&amp;#xB918;&amp;#xC5B4;&amp;#xC694;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xBD84;&amp;#xB7C9; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xB840;&amp;#xC640; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB354; &amp;#xB2E4;&amp;#xB904;&amp;#xBCFC;&amp;#xAE4C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC911;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xB9D0;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB2E4;&amp;#xC74C; &amp;#xC8FC;&amp;#xC81C;&amp;#xAC00; &amp;#xAF2D; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F605; &amp;#xAE34; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html&#34;&gt;https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/pcaversaccio/reentrancy-attacks&#34;&gt;https://github.com/pcaversaccio/reentrancy-attacks&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://owasp.org/www-project-smart-contract-top-10/&#34;&gt;https://owasp.org/www-project-smart-contract-top-10/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2&#34;&gt;https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/07/13/bekim/smartcontract/ko/image.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/07/13/bekim/smartcontract/ko/">

  <title>[Research] From Paper to Code: Smart Contract [ko] - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-07-13 17:00" pubdate>
      2025 7 13 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      6.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      122
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] From Paper to Code: Smart Contract [ko]</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#xC55E;&#xC120; &#xAE00;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xACFC; &#xD569;&#xC758; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA70;, &#xD0C8;&#xC911;&#xC559;&#xD654;&#xB41C; &#xAD6C;&#xC870;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD588;&#xC5B4;&#xC694;. &#xC774;&#xBC88;&#xC5D0;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xC704;&#xC5D0; &#xAD6C;&#xCD95;&#xB420; &#xC218; &#xC788;&#xB294; &#xD575;&#xC2EC; &#xAE30;&#xC220;&#xC778; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB904;&#xBCF4;&#xB824;&#xACE0; &#xD574;&#xC694;.</p>
<p>&#xAE30;&#xC874;&#xC758; &#xACC4;&#xC57D;&#xC740; &#xC885;&#xC774; &#xBB38;&#xC11C;&#xC640; &#xC11C;&#xBA85;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC;, &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC774; &#xACC4;&#xC57D; &#xC870;&#xAC74;&#xC744; &#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xD604;&#xD558;&#xACE0;, &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB418;&#xBA74; &#xC911;&#xAC1C;&#xC790; &#xC5C6;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xC774; &#xAE00;&#xC5D0;&#xC11C;&#xB294; Smart Contract&#xC758; &#xC6D0;&#xB9AC;&#xC640; &#xC0AC;&#xB840;&#xB97C; &#xC18C;&#xAC1C;&#xD558;&#xACE0;, &#xC774;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xB3C4; &#xD568;&#xAED8; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;"><a href="#&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;" class="headerlink" title="&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;"></a>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;</h2><p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xBBF8;&#xB9AC; &#xC815;&#xD574;&#xB454; &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB418;&#xBA74; &#xD574;&#xB2F9; &#xACC4;&#xC57D;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB41C; &#xCF54;&#xB4DC;&#xC5D0;&#xC694;. &#xACC4;&#xC57D; &#xC870;&#xAC74;&#xC744; &#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xD604;&#xD574;&#xC11C; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xC0C1;&#xC5D0;&#xC11C;&#xB3C4; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC131; &#xB355;&#xBD84;&#xC5D0; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC911;&#xAC1C; &#xBE44;&#xC6A9;&#xC744; &#xC808;&#xAC10;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC81C;3&#xC790; &#xC5C6;&#xC774; &#xACC4;&#xC57D;&#xC744; &#xC774;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;.</p>
<p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xAC1C;&#xB150;&#xC740; 1994&#xB144;, &#xB2C9; &#xC0AC;&#xBCF4;(Nick Szabo)&#xC5D0; &#xC758;&#xD574; &#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xC81C;&#xC548; &#xB418;&#xC5C8;&#xC5B4;&#xC694;. (&#xC5EC;&#xB2F4;&#xC774;&#xC9C0;&#xB9CC; Nick Szabo&#xB294; &#xC0AC;&#xD1A0;&#xC2DC; &#xB098;&#xCE74;&#xBAA8;&#xD1A0;&#xB85C; &#xCD94;&#xC815;&#xB418;&#xB294; &#xC778;&#xBB3C; &#xC911; &#xD55C; &#xBA85;&#xC73C;&#xB85C; &#xC790;&#xC8FC; &#xC5B8;&#xAE09;&#xB418;&#xACE0; &#xC788;&#xC5B4;&#xC694;) &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xB54C;&#xB294; &#xAC1C;&#xB150; &#xBFD0;&#xC774;&#xC5C8;&#xACE0;, &#xAE30;&#xC220;&#xC801; &#xC2E4;&#xD604;&#xC740; &#xADF8; &#xC774;&#xD6C4;&#xC5D0; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xC5B4;&#xC694;. 2013&#xB144; &#xC774;&#xB354;&#xB9AC;&#xC6C0;&#xC758; &#xCC3D;&#xC2DC;&#xC790;&#xC778; &#xBE44;&#xD0C8;&#xB9AD; &#xBD80;&#xD14C;&#xB9B0;(Vitalik Buterin)&#xC740; &#xC790;&#xC2E0;&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://web.archive.org/web/20131228111141/http://vbuterin.com/ethereum.html">&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xAC1C;&#xB150;&#xC744; &#xB2F4;&#xC740; &#xBC31;&#xC11C;</a>&#xB97C; &#xACF5;&#xAC1C;&#xD588;&#xC5B4;&#xC694;. &#xC774;&#xD6C4; &#xC774;&#xB354;&#xB9AC;&#xC6C0;&#xC774;&#xB77C;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD50C;&#xB7AB;&#xD3FC;&#xC774; 2015&#xB144;&#xC5D0; &#xC815;&#xC2DD;&#xC73C;&#xB85C; &#xB7F0;&#xCE6D;&#xB418;&#xC5C8;&#xACE0;, &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xC2E4;&#xC81C; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xC0C1;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC5B4;&#xC694;.</p>
<p><img src="/2025/07/13/bekim/smartcontract/ko/image.jpg" srcset="/img/loading.gif" alt></p>
<p>&#xD604;&#xC7AC; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC774;&#xB354;&#xB9AC;&#xC6C0; &#xC678;&#xC5D0;&#xB3C4; &#xB2E4;&#xC591;&#xD55C; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xACE0;, &#xC774;&#xB7F0; &#xACC4;&#xC57D;&#xB4E4;&#xC740; &#xB300;&#xBD80;&#xBD84; if-then &#xC870;&#xAC74;&#xBB38; &#xD615;&#xD0DC;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC740; &#xC5EC;&#xB7EC; &#xCC38;&#xC5EC;&#xC790;&#xAC00; &#xAC19;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xACE0; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xACC4;&#xC57D; &#xC870;&#xAC74;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xAE30;&#xC5D0; &#xB9E4;&#xC6B0; &#xC801;&#xC808;&#xD55C; &#xD658;&#xACBD;&#xC73C;&#xB85C; &#xC5EC;&#xACA8;&#xC838;&#xC694;.</p>
<h3 id="&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758;-&#xB3D9;&#xC791;-&#xBC29;&#xC2DD;"><a href="#&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758;-&#xB3D9;&#xC791;-&#xBC29;&#xC2DD;" class="headerlink" title="&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;"></a>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;</h3><p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xB294;&#xB370; &#xB3D9;&#xC791; &#xC21C;&#xC11C;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD558;&#xC790;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>1) <strong>&#xCF54;&#xB4DC; &#xC791;&#xC131;</strong></p>
<p>Solidity&#xC640; &#xAC19;&#xC740; &#xC5B8;&#xC5B4;&#xB85C; &#xC815;&#xB9D0; &#xAC04;&#xB2E8;&#xD55C; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">pragma solidity ^0.8.26;

contract Coin {
    // The keyword &quot;public&quot; makes variables
    // accessible from other contracts
    address public minter;
    mapping(address =&gt; uint) public balances;

    // Events allow clients to react to specific
    // contract changes you declare
    event Sent(address from, address to, uint amount);

    // Constructor code is only run when the contract
    // is created
    constructor() {
        minter = msg.sender;
    }

    // Sends an amount of newly created coins to an address
    // Can only be called by the contract creator
    function mint(address receiver, uint amount) public {
        require(msg.sender == minter);
        balances[receiver] += amount;
    }

    // Errors allow you to provide information about
    // why an operation failed. They are returned
    // to the caller of the function.
    error InsufficientBalance(uint requested, uint available);

    // Sends an amount of existing coins
    // from any caller to an address
    function send(address receiver, uint amount) public {
        require(amount &lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }
}</code></pre>
<p>&#xC704;&#xCC98;&#xB7FC; &#xC791;&#xC131;&#xB41C; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xAC1C;&#xB150;&#xC774; &#xB4F1;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">address public minter;</code></pre>
<p>&#xC774; &#xCF54;&#xB4DC;&#xB294; &#xC8FC;&#xC18C; &#xD0C0;&#xC785;&#xC758; &#xC0C1;&#xD0DC; &#xBCC0;&#xC218; minter&#xB97C; &#xC120;&#xC5B8;&#xD569;&#xB2C8;&#xB2E4;. address &#xD0C0;&#xC785;&#xC740; 160&#xBE44;&#xD2B8; &#xD06C;&#xAE30;&#xB85C;, &#xC5F0;&#xC0B0;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xBA70;, &#xACC4;&#xC815; &#xC8FC;&#xC18C; &#xD639;&#xC740; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB3FC;&#xC694;. &#xB610;&#xD55C; public &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xBD99;&#xC774;&#xBA74; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; getter &#xD568;&#xC218;&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xC11C; &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xC774; &#xAC12;&#xC744; &#xC870;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;</p>
<pre><code class="hljs solidity">mapping(address =&gt; uint) public balances;</code></pre>
<p>&#xC774; &#xCF54;&#xB4DC;&#xB294; address&#xB97C; &#xD0A4;&#xB85C; &#xD558;&#xACE0;, &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xC758;&#xCF54;&#xC778; &#xC218;&#xB7C9;&#xC744; &#xAC12;&#xC73C;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB9E4;&#xD551;&#xC785;&#xB2C8;&#xB2E4;. &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; public&#xC774; &#xBD99;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC678;&#xBD80;&#xC5D0;&#xC11C; balances&#xB97C; &#xC8FC;&#xC18C; &#xD615;&#xD0DC;&#xB85C; &#xC870;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;</p>
<pre><code class="hljs solidity">event Sent(address from, address to, uint amount);</code></pre>
<p>send()&#xD568;&#xC218;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xC904;&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xC774;&#xBCA4;&#xD2B8;&#xC5D0;&#xC694;. Sent &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xB9AC;&#xC2A4;&#xB108;&#xB294; &#xC804;&#xC1A1;&#xC790;, &#xC218;&#xC2E0;&#xC790;, &#xAE08;&#xC561; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544;&#xC11C; transaction&#xC744; &#xCD94;&#xC801;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">constructor() {
    minter = msg.sender;
}</code></pre>
<p>&#xC0DD;&#xC131;&#xC790;(Constructor) &#xCF54;&#xB4DC;&#xB294; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xBC30;&#xD3EC;&#xB420; &#xB54C; &#xD55C; &#xBC88;&#xB9CC; &#xC2E4;&#xD589;&#xB3FC;&#xC694;. msg.sender&#xB294; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xBC30;&#xD3EC;&#xD55C; &#xC8FC;&#xC18C;&#xC774;&#xACE0;, &#xC774;&#xB97C; minter&#xB85C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">function mint(address receiver, uint amount) public {
    require(msg.sender == minter);
    balances[receiver] += amount;
}</code></pre>
<p>&#xC0C8;&#xB85C;&#xC6B4; &#xCF54;&#xC778;&#xC744; &#xBC1C;&#xD589;&#xD558;&#xC5EC; &#xB2E4;&#xB978; &#xC8FC;&#xC18C;&#xB85C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; <code>require(msg.sender == minter)</code> &#xC870;&#xAC74;&#xC740; &#xC624;&#xC9C1; &#xBC30;&#xD3EC;&#xC790;&#xB9CC;&#xC774; &#xC774; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;&#xD574;&#xC694;. &#xADF8;&#xB9AC;&#xACE0; &#xB9CC;&#xC57D; <code>balances[receiver]+amount</code> &#xC5F0;&#xC0B0;&#xC774; uint256&#xC758; &#xCD5C;&#xB300;&#xAC12;&#xC744; &#xB118;&#xB294;&#xB2E4;&#xBA74;,  Solidity&#xC758; &#xAE30;&#xBCF8; &#xC5F0;&#xC0B0; &#xC548;&#xC804;&#xC131;(Checked Arithmetic)&#xC5D0; &#xB530;&#xB77C; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC740; &#xC790;&#xB3D9;&#xC73C;&#xB85C; revert &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">error InsufficientBalance(uint requested, uint available);</code></pre>
<p>&#xC5D0;&#xB7EC;&#xBA54;&#xC2DC;&#xC9C0; error&#xC640; revert&#xB97C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAC00;&#xC9C4; &#xCF54;&#xC778;&#xBCF4;&#xB2E4; &#xB354; &#xB9CE;&#xC740; &#xC591;&#xC744; &#xBCF4;&#xB0B4;&#xB824;&#xACE0; &#xD560; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; InsufficientBalance &#xC624;&#xB958;&#xC640; &#xD568;&#xAED8; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; &#xCDE8;&#xC18C;&#xB3FC;&#xC694;.</p>
<pre><code class="hljs solidity">function send(address receiver, uint amount) public {
    require(amount &lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
    balances[msg.sender] -= amount;
    balances[receiver] += amount;
    emit Sent(msg.sender, receiver, amount);
}</code></pre>
<p>&#xC790;&#xC2E0;&#xC774; &#xBCF4;&#xC720;&#xD55C; &#xCF54;&#xC778;&#xC744; &#xB2E4;&#xB978; &#xC8FC;&#xC18C;&#xB85C; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; require &#xC870;&#xAC74;&#xC744; &#xCDA9;&#xC871;&#xD558;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;&#xBA74; InsufficientBalance &#xC5D0;&#xB7EC;&#xAC00; &#xB098;&#xB294; &#xCF54;&#xB4DC;&#xC5D0;&#xC694;.</p>
<p>2) <strong>&#xCEF4;&#xD30C;&#xC77C; &#xBC0F; &#xBC30;&#xD3EC;</strong></p>
<p>&#xC791;&#xC131;&#xD55C; &#xCF54;&#xB4DC;&#xB294; Solidity &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB97C; &#xD1B5;&#xD574; Bytecode&#xC640; Application Binary Interface (ABI)&#xB85C; &#xBCC0;&#xD658;&#xB429;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>Bytecode&#xB294; &#xC774;&#xB354;&#xB9AC;&#xC6C0; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;(EVM)&#xC774; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC800;&#xC218;&#xC900; &#xCF54;&#xB4DC;&#xB85C;, &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xBC30;&#xD3EC;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB3FC;&#xC694;.</li>
<li>ABI&#xB294; &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB85C;, &#xD568;&#xC218; &#xC774;&#xB984;&#xACFC; &#xD30C;&#xB77C;&#xBBF8;&#xD130; &#xD615;&#xC2DD;&#xC744; &#xC815;&#xC758;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;</li>
</ul>
<p>&#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xC131;&#xB41C; &#xBC14;&#xC774;&#xD2B8; &#xCF54;&#xB4DC;&#xB294; &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xD615;&#xD0DC;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC804;&#xD30C;&#xB418;&#xBA70;, &#xC774; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; &#xBE14;&#xB85D;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xBA74; &#xD574;&#xB2F9; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xACE0;&#xC720;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xBD80;&#xC5EC;&#xBC1B;&#xC544; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xB4F1;&#xB85D;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/07/13/bekim/smartcontract/ko/image1.png" srcset="/img/loading.gif" alt></p>
<p>3) <strong>&#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xD638;&#xCD9C;</strong></p>
<pre><code class="hljs solidity">function send(address receiver, uint amount) public {
        require(amount &lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));
        balances[msg.sender] -= amount;
        balances[receiver] += amount;
        emit Sent(msg.sender, receiver, amount);
    }</code></pre>
<p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD2B9;&#xC815; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xD568;&#xC218; &#xD638;&#xCD9C; &#xC815;&#xBCF4;(&#xB300;&#xC0C1; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xC8FC;&#xC18C;, ABI &#xAE30;&#xBC18; &#xD568;&#xC218; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;, &#xAC00;&#xC2A4; &#xC815;&#xBCF4; &#xB4F1;)&#xB97C; &#xB2F4;&#xC740; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xC5EC; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xBE0C;&#xB85C;&#xB4DC;&#xCE90;&#xC2A4;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC; &#xCF54;&#xB4DC;&#xCC98;&#xB7FC; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; Coin.sol&#xC758; send() &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;&#xB294; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC744; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xACE0; &#xD560; &#xB54C;, &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC740; &#xB178;&#xB4DC;&#xC758; mempool&#xC5D0; &#xC77C;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC800;&#xC7A5;&#xB418;&#xACE0;, &#xBE14;&#xB85D; &#xC0DD;&#xC131;&#xC790;(miner &#xB610;&#xB294; validator)&#xAC00; &#xC120;&#xD0DD;&#xD574; &#xBE14;&#xB85D;&#xC5D0; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; mempool&#xC5D0; &#xB4E4;&#xC5B4;&#xAC04; &#xD6C4;, &#xC218;&#xC218;&#xB8CC;(gas price)&#xAC00; &#xB192;&#xC740; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xCC98;&#xB9AC;&#xB3FC;&#xC694;!</p>
<p>&#x2192; mempool(Memory Pool): &#xC544;&#xC9C1; &#xBE14;&#xB85D;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xB4E4;&#xC774; &#xC784;&#xC2DC;&#xB85C; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xACF5;&#xAC04;</p>
<p><img src="/2025/07/13/bekim/smartcontract/ko/image2.png" srcset="/img/loading.gif" alt></p>
<p> &#xC774; &#xD2B8;&#xB79C;&#xC81D;&#xC158;&#xC744; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xBE0C;&#xB85C;&#xB4DC;&#xCE90;&#xC2A4;&#xD305;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/07/13/bekim/smartcontract/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>4) <strong>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xC2E4;&#xD589; (EVM)</strong></p>
<p>&#xBE14;&#xB85D; &#xC0DD;&#xC131;&#xC790;&#xAC00; &#xBA3C;&#xC800; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0;, &#xB2E4;&#xB978; &#xAC80;&#xC99D; &#xB178;&#xB4DC;&#xB4E4;&#xC740; &#xC774;&#xB97C; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xC7AC;&#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xBE14;&#xB85D;&#xC758; &#xC815;&#xB2F9;&#xC131;&#xC744; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;. &#xBE14;&#xB85D; &#xC0DD;&#xC131;&#xC790;&#xB294; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC744; &#xCC98;&#xB9AC;&#xD560; &#xB54C;, EVM&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xD568;&#xC218;(send() &#xB4F1;)&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. EVM&#xC740; &#xC785;&#xB825;&#xAC12;&#xC744; &#xB514;&#xCF54;&#xB529;&#xD558;&#xC5EC; &#xD638;&#xCD9C;&#xD560; &#xD568;&#xC218;&#xB97C; &#xB9E4;&#xD551;&#xD558;&#xACE0;, require &#xC870;&#xAC74;&#xBB38;, &#xC0C1;&#xD0DC; &#xBCC0;&#xACBD;, &#xC774;&#xBCA4;&#xD2B8; &#xAE30;&#xB85D; &#xB4F1; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xB85C;&#xC9C1;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">require(amount &lt;= balances[msg.sender], InsufficientBalance(amount, balances[msg.sender]));</code></pre>
<p>&#xC774; &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB418;&#xBA74; &#xACC4;&#xC57D;&#xC774; &#xC774;&#xD589;&#xB418;&#xACE0;, &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; InsufficientBalance &#xC624;&#xB958;&#xAC00; &#xB098; revert&#xB418;&#xACE0; &#xBAA8;&#xB4E0; &#xBCC0;&#xACBD;&#xC774; &#xB864;&#xBC31;&#xB3FC;&#xC694;.</p>
<p>5) <strong>&#xAC00;&#xC2A4; &#xCC98;&#xB9AC;</strong></p>
<p>&#xB610;&#xD55C; EVM&#xC758; &#xC2E4;&#xD589;&#xC5D0;&#xB294; &#xAC00;&#xC2A4;(Gas)&#xAC00; &#xC18C;&#xBAA8;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xB178;&#xB4DC;(&#xAC80;&#xC99D;&#xC790;)&#xB4E4;&#xC5D0;&#xAC8C; &#xC778;&#xC13C;&#xD2F0;&#xBE0C;&#xB85C; &#xC8FC;&#xC5B4;&#xC9C0;&#xACE0;, &#xACFC;&#xB3C4;&#xD55C; &#xC5F0;&#xC0B0;&#xC744; &#xBC29;&#xC9C0;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC5B4;&#xC694;. &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC124;&#xC815;&#xD55C; gasLimit&#xACFC; &#xC2E4;&#xC81C; &#xC18C;&#xBAA8;&#xB7C9;&#xC5D0; &#xB530;&#xB77C; &#xB0A8;&#xC740; &#xAC00;&#xC2A4;&#xB294; &#xD658;&#xBD88;&#xB418;&#xBA70;, &#xC2E4;&#xD328;&#xD55C; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xB3C4; &#xAC00;&#xC2A4;&#xB294; &#xC18C;&#xBAA8;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>6) <strong>&#xACB0;&#xACFC; &#xC800;&#xC7A5;</strong></p>
<p>&#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xC2E4;&#xD589;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xACB0;&#xACFC;&#xAC00; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xBC18;&#xC601;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC0C1;&#xD0DC; &#xBCC0;&#xD654;: &#xC608;&#xB97C; &#xB4E4;&#xC5B4; <code>balances[msg.sender] -= amount</code> &#xAC19;&#xC740; &#xB0B4;&#xBD80; &#xC800;&#xC7A5;&#xC18C; &#xBCC0;&#xD654;&#xB294; &#xC0C1;&#xD0DC; &#xD2B8;&#xB77C;&#xC774;(<strong>state trie)</strong>&#xC5D0; &#xBC18;&#xC601;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xBCA4;&#xD2B8; &#xB85C;&#xADF8;: <code>emit Sent(&#x2026;)</code> &#xC640; &#xAC19;&#xC740; &#xC774;&#xBCA4;&#xD2B8;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xB85C;&#xADF8; &#xC800;&#xC7A5;&#xC18C;(receipts)&#xC5D0; &#xAE30;&#xB85D;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xB7F0; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC740; &#xBE14;&#xB85D;&#xC5D0; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xBAA8;&#xB4E0; &#xB178;&#xB4DC;&#xAC00; &#xACF5;&#xC720;&#xD558;&#xB294; &#xC601;&#xAD6C;&#xC801;&#xC778; &#xAE30;&#xB85D;&#xC774; &#xB418;&#xACE0;, &#xB204;&#xAD6C;&#xB4E0;&#xC9C0; &#xC774;&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xAC70;&#xB098; &#xC870;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC131;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C;, &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB418;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xACC4;&#xC57D; &#xBC29;&#xC2DD;&#xBCF4;&#xB2E4; &#xC544;&#xC8FC; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xC5D0;&#xC694;. &#xD2B9;&#xD788; &#xC911;&#xAC1C;&#xC790; &#xC5C6;&#xC774;&#xB3C4; &#xACC4;&#xC57D;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD560; &#xACBD;&#xC6B0; &#xD22C;&#xBA85;&#xC131; &#xACFC; &#xBCC0;&#xACBD; &#xBD88;&#xAC00;&#xB2A5;&#xC131;&#xC774; &#xBCF4;&#xC7A5;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2E0;&#xB8B0;&#xC131;&#xB3C4; &#xB192;&#xC740; &#xD3B8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC7A5;&#xC810; &#xB355;&#xBD84;&#xC5D0;, &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC810;&#xC810; &#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xB85C; &#xD65C;&#xC6A9; &#xBC94;&#xC704;&#xB97C; &#xB113;&#xD600;&#xAC00;&#xACE0; &#xC788;&#xC5B4;&#xC694;</p>
<h2 id="&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758;-&#xD65C;&#xC6A9;-&#xC0AC;&#xB840;"><a href="#&#xC2A4;&#xB9C8;&#xD2B8;-&#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758;-&#xD65C;&#xC6A9;-&#xC0AC;&#xB840;" class="headerlink" title="&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD65C;&#xC6A9; &#xC0AC;&#xB840;"></a>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD65C;&#xC6A9; &#xC0AC;&#xB840;</h2><p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xC774;&#xB354;&#xB9AC;&#xC6C0;&#xC774;&#xB77C;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xD1B5;&#xD574; &#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xD65C;&#xC6A9; &#xAE30;&#xBC18;&#xC744; &#xAC16;&#xCD98; &#xC774;&#xD6C4;&#xB85C;, &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xB85C; &#xD655;&#xC7A5;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>1) <strong>DeFi (&#xD0C8;&#xC911;&#xC559;&#xD654; &#xAE08;&#xC735;)</strong></p>
<p>DeFi&#xB294; &#xAE30;&#xC874;&#xC758; &#xC740;&#xD589;, &#xC99D;&#xAD8C;&#xC0AC; &#xAC19;&#xC740; &#xC911;&#xC559;&#xD654;&#xB41C; &#xAE08;&#xC735;&#xAE30;&#xAD00; &#xC5C6;&#xC774;&#xB3C4;, &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC608;&#xAE08;, &#xB300;&#xCD9C;, &#xC790;&#xC0B0;&#xAC70;&#xB798;, &#xD30C;&#xC0DD; &#xC0C1;&#xD488; &#xB4F1;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xD0C8; &#xC911;&#xC559;&#xD654;&#xB41C; &#xAE08;&#xC735; &#xC2DC;&#xC2A4;&#xD15C;&#xC785;&#xB2C8;&#xB2E4;. DeFi &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xBAA8;&#xB4E0; &#xAE08;&#xC735; &#xAC70;&#xB798; &#xB85C;&#xC9C1;&#xC744; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB85C; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, Aave&#xB098; Compound&#xAC19;&#xC740; DeFi &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC554;&#xD638;&#xD654;&#xD3D0;&#xB97C; &#xC608;&#xCE58;&#xD558;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC774;&#xC790;&#xB97C; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xACE0;, &#xB2E4;&#xB978; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xB2F4;&#xBCF4;&#xB97C; &#xAC78;&#xACE0; &#xB300;&#xCD9C;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC5B4;&#xC694;</p>
<p>&#xB610; &#xB2E4;&#xB978; &#xC608;&#xB85C;&#xB294; Uniswap&#xC774; &#xC788;&#xC5B4;&#xC694;. &#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xC911;&#xC559; &#xAC70;&#xB798;&#xC18C; &#xC5C6;&#xC774;&#xB3C4; &#xC554;&#xD638;&#xD654;&#xD3D0;&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAD50;&#xD658;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC778;&#xB370;, &#xAC70;&#xB798;&#xB294; &#xBBF8;&#xB9AC; &#xC608;&#xCE58;&#xB41C; &#xC720;&#xB3D9;&#xC131; &#xD480;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC9C4;&#xD589;&#xB418;&#xACE0;, &#xAD50;&#xD658; &#xB85C;&#xC9C1; &#xC5ED;&#xC2DC; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB85C; &#xCC98;&#xB9AC;&#xB3FC;&#xC694;. &#xC774;&#xC640; &#xC720;&#xC0AC;&#xD558;&#xAC8C; Curve&#xB294; &#xC2A4;&#xD14C;&#xC774;&#xBE14; &#xCF54;&#xC778; &#xAC04;&#xC758; &#xAD50;&#xD658;&#xC5D0; &#xD2B9;&#xD654;&#xB41C; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C;, &#xAC70;&#xB798; &#xACFC;&#xC815; &#xB610;&#xD55C; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0; &#xC758;&#xD574; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>2) <strong>DAO (&#xD0C8;&#xC911;&#xC559;&#xD654;&#xB41C; &#xC790;&#xC728;&#xC870;&#xC9C1;)</strong></p>
<p>DAO (Decentralized Autonomous Organization)&#xB294; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xC870;&#xC9C1;&#xCC98;&#xB7FC; &#xD2B9;&#xC815; &#xAD00;&#xB9AC;&#xC790;&#xB098; &#xC6B4;&#xC601;&#xC790;&#xAC00; &#xC544;&#xB2C8;&#xB77C;, &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0; &#xC758;&#xD574; &#xADDC;&#xCE59;&#xACFC; &#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC9D1;&#xD589;&#xB418;&#xB294; &#xC870;&#xC9C1; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. &#xAD6C;&#xC131;&#xC6D0;&#xB4E4;&#xC740; DAO &#xD1A0;&#xD070;&#xC744; &#xBCF4;&#xC720;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xD22C;&#xD45C;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xACE0;, &#xC81C;&#xC548;&#xB41C; &#xC548;&#xAC74;&#xC774; &#xC77C;&#xC815; &#xC870;&#xAC74;&#xC744; &#xCDA9;&#xC871;&#xD558;&#xBA74; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xADF8; &#xB0B4;&#xC6A9;&#xC744; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xD45C;&#xC801;&#xC778; &#xC608;&#xC2DC;&#xB85C;&#xB294; MarkerDAO&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. MarkerDAO&#xB294; &#xC774;&#xB354;&#xB9AC;&#xC6C0; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xAE30;&#xBC18;&#xC758; DAO&#xB85C;, &#xD0C8;&#xC911;&#xC559;&#xD654;&#xB41C; &#xC2A4;&#xD14C;&#xC774;&#xBE14; &#xCF54;&#xC778;&#xC778; DAI&#xB97C; &#xBC1C;&#xD589;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. MarkerDAO&#xB294; DAI&#xC758; &#xAC00;&#xCE58;&#xB97C; &#xC548;&#xC815;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xBA74;&#xC11C; &#xAD6C;&#xC131;&#xC6D0;&#xB4E4;&#xC774; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xC790;&#xC728; &#xC870;&#xC815;&#xC774;&#xB098; &#xC2DC;&#xC2A4;&#xD15C; &#xC5C5;&#xADF8;&#xB808;&#xC774;&#xB4DC; &#xB4F1;&#xC5D0; &#xB300;&#xD574; &#xD22C;&#xD45C;&#xD574;&#xC694;.</p>
<p>&#xC774;&#xCC98;&#xB7FC; DAO&#xB294; &#xC0AC;&#xB78C;&#xC758; &#xAC1C;&#xC785; &#xC5C6;&#xC774;&#xB3C4; &#xCF54;&#xB4DC;&#xC5D0; &#xC758;&#xD574; &#xC6B4;&#xC601;&#xC774; &#xC870;&#xC9C1;&#xB420; &#xC218; &#xC788;&#xB294; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>3) <strong>CryptoKitties</strong></p>
<p>CryptoKitties&#xB294; 2017&#xB144; &#xB4F1;&#xC7A5;&#xD55C; &#xC774;&#xB354;&#xB9AC;&#xC6C0; &#xAE30;&#xBC18;&#xC758; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xAC8C;&#xC784;&#xC774;&#xC5D0;&#xC694;. &#xC774; &#xAC8C;&#xC784;&#xC740; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xB514;&#xC9C0;&#xD138; &#xACE0;&#xC591;&#xC774;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xACE0; &#xAD50;&#xBC30;&#xD558;&#xBA70; &#xAC70;&#xB798;&#xD560; &#xC218; &#xC788;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p>&#xC774; &#xAC8C;&#xC784;&#xC5D0;&#xC11C; &#xACE0;&#xC591;&#xC774;&#xB294; &#xAC01;&#xAC01; &#xACE0;&#xC720;&#xD55C; &#xD2B9;&#xC131;&#xACFC; &#xC678;&#xD615;&#xC744; &#xC9C0;&#xB2CC; NFT&#xB85C; &#xD45C;&#xD604;&#xB3FC;&#xC694;. &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xB450; &#xB9C8;&#xB9AC;&#xC758; &#xACE0;&#xC591;&#xC774;&#xB97C; &#xAD50;&#xBC30;&#xC2DC;&#xCF1C; &#xC0C8;&#xB85C;&#xC6B4; &#xACE0;&#xC591;&#xC774;&#xB97C; &#xD0C4;&#xC0DD;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xACE0;, &#xC774; &#xB54C; &#xC720;&#xC804; &#xC815;&#xBCF4;&#xC758; &#xC870;&#xD569;&#xACFC; &#xAD50;&#xBC30; &#xACB0;&#xACFC;&#xB294; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0; &#xC758;&#xD574; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xACB0;&#xC815;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xC131;&#xB41C; &#xACE0;&#xC591;&#xC774;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; NFT&#xB85C; &#xB4F1;&#xB85D;&#xB418;&#xACE0;, &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC774; &#xACE0;&#xC591;&#xC774;&#xB97C; &#xB2E4;&#xB978; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xD310;&#xB9E4;&#xD558;&#xAC70;&#xB098; &#xBCF4;&#xC720;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;. &#xC774; &#xAC8C;&#xC784;&#xC740; &#xCD9C;&#xC2DC; &#xC9C1;&#xD6C4; &#xD070; &#xC778;&#xAE30;&#xB97C; &#xB04C;&#xBA70; &#xC774;&#xB354;&#xB9AC;&#xC6C0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xACFC;&#xBD80;&#xD558;&#xB97C; &#xC77C;&#xC73C;&#xD0AC; &#xC815;&#xB3C4;&#xC600;&#xC5B4;&#xC694;.</p>
<p>&#xC704;&#xC640; &#xAC19;&#xC774; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xAE08;&#xC735;, &#xC870;&#xC9C1; &#xC6B4;&#xC601;, &#xAC8C;&#xC784; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xD65C;&#xBC1C;&#xD558;&#xAC8C; &#xD65C;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC740; &#xBCF4;&#xC548;&#xC131;&#xC774; &#xB6F0;&#xC5B4;&#xB09C; &#xAE30;&#xC220;&#xB85C; &#xC54C;&#xB824;&#xC838; &#xC788;&#xC9C0;&#xB9CC;, &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xBA87; &#xCC28;&#xB840; &#xD574;&#xD0B9; &#xC0AC;&#xB840;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xBC14; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; &#xC2E4;&#xC81C; &#xC0AC;&#xB840;&#xC640; &#xD568;&#xAED8; smart contract&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Smart-Contract&#xC758;-&#xCDE8;&#xC57D;&#xC810;"><a href="#Smart-Contract&#xC758;-&#xCDE8;&#xC57D;&#xC810;" class="headerlink" title="Smart Contract&#xC758; &#xCDE8;&#xC57D;&#xC810;"></a>Smart Contract&#xC758; &#xCDE8;&#xC57D;&#xC810;</h2><h3 id="1-Reentrancy-Attack"><a href="#1-Reentrancy-Attack" class="headerlink" title="1. Reentrancy Attack"></a>1. Reentrancy Attack</h3><p>Reentrancy Attack(&#xC7AC;&#xC9C4;&#xC785; &#xACF5;&#xACA9;)&#xC740; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xC790;&#xC2E0;&#xC758; &#xC0C1;&#xD0DC;(state)&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD558;&#xAE30;&#xC804;&#xC5D0; &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB85C; &#xD638;&#xCD9C;&#xC744; &#xC218;&#xD589;&#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0;, &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;(&#xC545;&#xC758;&#xC801;&#xC778; &#xACBD;&#xC6B0;)&#xAC00; &#xC6D0;&#xB798; &#xD568;&#xC218;&#xB85C; &#xB2E4;&#xC2DC; &#xC7AC;&#xC9C4;&#xC785;&#xD558;&#xC5EC;, &#xAC19;&#xC740; &#xC0C1;&#xD0DC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xCD9C;&#xAE08; &#xB4F1;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;. </p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; 2016&#xB144; DAO &#xD574;&#xD0B9; &#xC0AC;&#xAC74;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC57D; 6000&#xB9CC; &#xB2EC;&#xB7EC;&#xAC00; &#xD0C8;&#xCDE8;&#xB2F9;&#xD558;&#xBA74;&#xC11C;, &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xAC80;&#xD1A0;&#xD574;&#xC57C;&#xD560; &#xBCF4;&#xC548; &#xD56D;&#xBAA9;&#xC774; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8; &#xC608;&#xC2DC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC544;&#xC694;.</p>
<ul>
<li>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; &#xC678;&#xBD80; &#xC8FC;&#xC18C; (&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;)&#xB85C; &#xC774;&#xB354;(ETH)&#xB098; &#xD1A0;&#xD070;&#xC744; &#xC804;&#xC1A1;&#xD558;&#xBA74;, &#xC218;&#xC2E0;&#xC790; &#xCABD;&#xC758; &#xD568;&#xC218; (fallback() &#xB610;&#xB294; receive())&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774; &#xB54C; &#xADF8; &#xD568;&#xC218; &#xC548;&#xC758; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C;, &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC774; &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB85C; &#xB118;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</li>
<li>&#xACF5;&#xACA9;&#xC790;&#xB294; &#xC774; &#xAE30;&#xD68C;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB2E4;&#xC2DC; &#xC6D0;&#xB798; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD568;&#xC218;&#xB97C; &#xC7AC;&#xD638;&#xCD9C;&#xD558;&#xBA74;, &#xC6D0;&#xB798; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC544;&#xC9C1; &#xC774;&#xC804; &#xD568;&#xC218; &#xC2E4;&#xD589;&#xC774; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xC558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC0C1;&#xD0DC;&#xAC00; &#xC815;&#xB9AC;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xB610; &#xC2E4;&#xD589;&#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xADF8; &#xACB0;&#xACFC;, &#xC794;&#xC561; &#xAC80;&#xC99D; &#xC774;&#xC804;&#xC5D0; &#xACC4;&#xC18D; &#xC790;&#xAE08;&#xC744; &#xBE7C;&#xB0B4;&#xB294; &#xB4F1;&#xC758; &#xACF5;&#xACA9;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB294; DAO &#xD574;&#xD0B9; &#xB2F9;&#xC2DC; &#xCDE8;&#xC57D;&#xD588;&#xB358; &#xD568;&#xC218; splitDAO()&#xC758; &#xC77C;&#xBD80;&#xB85C;, &#xC7AC;&#xC9C4;&#xC785; &#xACF5;&#xACA9;&#xC5D0; &#xCDE8;&#xC57D;&#xD588;&#xB358; &#xAD6C;&#xC870;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">function splitDAO(uint _proposalID, address _newCurator) noEther onlyTokenholders returns (bool _success) {
    ...
		// [1]
    uint fundsToBeMoved = (balances[msg.sender] * p.splitData[0].splitBalance) / p.splitData[0].totalSupply;
    //Since the balance is never updated the attacker can pass this modifier several times 
    // [2]
    if (p.splitData[0].newDAO.createTokenProxy.value(fundsToBeMoved)(msg.sender) == false) throw;

    ...

    // Burn DAO Tokens
    // Funds are transferred before the balance is updated
    //[3]
    Transfer(msg.sender, 0, balances[msg.sender]);
    withdrawRewardFor(msg.sender); // be nice, and get his rewards
    // Only now after the funds are transferred is the balance updated
    totalSupply -= balances[msg.sender];
    paidOut[msg.sender] = 0;
    return true;
}</code></pre>
<p>splitDAO() &#xD568;&#xC218;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; DAO&#xB97C; &#xD0C8;&#xD1F4;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; DAO&#xB85C; &#xC774;&#xB3D9;&#xD560; &#xB54C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>[1]&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBC1B;&#xC744; &#xC774;&#xB354; &#xAE08;&#xC561;&#xC778; <code>fundsToBeMoved</code>&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xB294;,. &#xC774; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; <code>balances[msg.sender]</code>&#xB294; &#xC544;&#xC9C1; &#xC904;&#xC5B4;&#xB4E4;&#xC9C0; &#xC54A;&#xC740; &#xC0C1;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>[2]&#xC5D0;&#xC11C; &#xC774;&#xB354;&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xBA74;&#xC11C; &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xD568;&#xC218;(<code>createTokenProxy</code>)&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAC8C; &#xB418;&#xB294;&#xB370;, &#xC774; &#xB54C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB9CC;&#xB4E0; &#xC545;&#xC131; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xAC00; splitDAO()&#xB97C; &#xB2E4;&#xC2DC; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xBA74; <code>balances[msg.sender]</code>&#xB294; &#xC5EC;&#xC804;&#xD788; &#xAC12;&#xC774; &#xADF8;&#xB300;&#xB85C;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB3D9;&#xC77C;&#xD55C; &#xAE08;&#xC561;&#xC744; &#xC5EC;&#xB7EC; &#xBC88; &#xC694;&#xCCAD;&#xC5D0; &#xC790;&#xAE08;&#xC744; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#xC778;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB3FC;&#xC694;.</p>
<p>[3] &#xC774;&#xD6C4;&#xC5D0; &#xB0B4;&#xBD80; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xC9C0;&#xB9CC;, &#xC774;&#xBBF8; &#xC678;&#xBD80; &#xD638;&#xCD9C;&#xC774; &#xB05D;&#xB09C; &#xD6C4;&#xC5D0; &#xBC1C;&#xC0DD;&#xD558;&#xBBC0;&#xB85C;, &#xBC29;&#xC5B4;&#xC5D0;&#xB294; &#xC804;&#xD600; &#xD6A8;&#xACFC;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><strong>Mitigation</strong></p>
<p>1) <strong>Checks-Effects-Interactions &#xD328;&#xD134; &#xC0AC;&#xC6A9;</strong><br>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD558;&#xAE30; &#xC804;&#xC5D0; &#xB0B4;&#xBD80; &#xC0C1;&#xD0DC;&#xB97C; &#xBA3C;&#xC800; &#xBCC0;&#xACBD;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574; checks &#x2192; Effects &#x2192; Interaction &#xC21C;&#xC11C;&#xB85C; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Checks: &#xC785;&#xB825;&#xAC12;&#xACFC; &#xC870;&#xAC74; &#xAC80;&#xC99D;</li>
<li>Effects: &#xC0C1;&#xD0DC; &#xBCC0;&#xC218; &#xC5C5;&#xB370;&#xC774;&#xD2B8;</li>
<li>Interactions: &#xC678;&#xBD80; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xD638;&#xCD9C;<br>2) <strong>ReentrancyGuard &#xC0AC;&#xC6A9;</strong><br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.openzeppelin.com/contracts/4.x/api/security#ReentrancyGuard">OpenZeppelin</a>&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; ReentrancyGuard&#xB294; &#xC7AC;&#xC9C4;&#xC785; &#xACF5;&#xACA9;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xB294; &#xBAA8;&#xB4C8;&#xC785;&#xB2C8;&#xB2E4;. <code>nonReentrant</code> modifier&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xBA74;, &#xD568;&#xC218;&#xAC00; &#xC2E4;&#xD589; &#xC911;&#xC77C; &#xB54C; &#xB3D9;&#xC77C;&#xD55C; &#xD568;&#xC218;&#xAC00; &#xB2E4;&#xC2DC; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xAC83;&#xC744; &#xCC28;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<h3 id="2-Improper-Access-Control"><a href="#2-Improper-Access-Control" class="headerlink" title="2. Improper Access Control"></a>2. Improper Access Control</h3><p>Access control vulnerability (&#xC811;&#xADFC; &#xC81C;&#xC5B4; &#xCDE8;&#xC57D;&#xC810;)&#xB294; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC774;&#xB098; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xC811;&#xADFC;&#xC744; &#xC801;&#xC808;&#xD558;&#xAC8C; &#xC81C;&#xD55C;&#xD558;&#xC9C0; &#xBABB;&#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB85C; &#xC778;&#xD574; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB3C4; &#xBBFC;&#xAC10;&#xD55C; &#xAE30;&#xB2A5;(ex. &#xD1A0;&#xD070; &#xBC1C;&#xD589;, &#xC790;&#xC0B0; &#xC778;&#xCD9C;, &#xACC4;&#xC57D; &#xC815;&#xC9C0;, &#xC5C5;&#xADF8;&#xB808;&#xC774;&#xB4DC; &#xB4F1;)&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xACC4;&#xC57D;&#xC758; &#xBCF4;&#xC548;&#xC131;&#xACFC; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xC704;&#xD611;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xB294; &#xCDE8;&#xC57D;&#xD55C; &#xBC84;&#xC804;&#xC758; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

contract Solidity_AccessControl {
    mapping(address =&gt; uint256) public balances;

    // Burn function with no access control
    function burn(address account, uint256 amount) public {
        _burn(account, amount);
    }
}</code></pre>
<p>&#xC774; &#xC608;&#xC81C;&#xB294; &#xB204;&#xAD6C;&#xB098; burn &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC544;&#xBB34; &#xC8FC;&#xC18C;&#xC758; &#xD1A0;&#xD070; &#xC794;&#xC561;&#xC744; &#xC904;&#xC774;&#xAC70;&#xB098; &#xD30C;&#xAD34;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xAD8C;&#xD55C; &#xAC80;&#xC99D; &#xC5C6;&#xC774; &#xBBFC;&#xAC10;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xB178;&#xCD9C;&#xD55C; &#xC804;&#xD615;&#xC801;&#xC778; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB294; onlyOwner modifier&#xB97C; &#xD1B5;&#xD574; &#xC624;&#xC9C1; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xC18C;&#xC720;&#xC790;&#xB9CC; burn&#xC744; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC218;&#xC815;&#xB41C; &#xBC84;&#xC804;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

// Import the Ownable contract from OpenZeppelin to manage ownership
import &quot;@openzeppelin/contracts/access/Ownable.sol&quot;;

contract Solidity_AccessControl is Ownable {
    mapping(address =&gt; uint256) public balances;

    // Burn function with proper access control, only accessible by the contract owner
    function burn(address account, uint256 amount) public onlyOwner {
        _burn(account, amount);
    }
}</code></pre>
<p><strong>&#xC2E4;&#xC81C; &#xC0AC;&#xB840;</strong></p>
<ul>
<li>2017&#xB144; &#xBC1C;&#xC0DD;&#xD55C; Parity Multisig Wallet &#xD574;&#xD0B9;&#xC740; &#xCD08;&#xAE30;&#xD654; &#xD568;&#xC218; <code>initWallet()</code>&#xC5D0; &#xC811;&#xADFC; &#xC81C;&#xD55C;&#xC774; &#xC5C6;&#xC5C8;&#xB358; &#xAC83;&#xC774; &#xC6D0;&#xC778;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xC790;&#xC2E0;&#xC744; &#xC9C0;&#xAC11;&#xC758; &#xC18C;&#xC720;&#xC790;&#xB85C; &#xB4F1;&#xB85D;&#xD588;&#xACE0;, &#xC57D; 15&#xB9CC; ETH(&#xB2F9;&#xC2DC; &#xC57D; 3&#xCC9C;&#xB9CC; &#xB2EC;&#xB7EC;)&#xB97C; &#xD0C8;&#xCDE8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><strong>Mitigation</strong></p>
<p>1) <strong>&#xAD8C;&#xD55C; &#xC81C;&#xC5B4; &#xBAA8;&#xB4C8; &#xC0AC;&#xC6A9;</strong><br>OpenZeppelin&#xC758; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.openzeppelin.com/contracts/2.x/api/ownership#Ownable"><code>Ownable</code></a>, <code>AccessControl</code>, <code>RBAC</code>(Role-Based Access Control) &#xAC19;&#xC740; &#xAC80;&#xC99D;&#xB41C; &#xC811;&#xADFC; &#xC81C;&#xC5B4; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.<br>2) <strong>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xB0B4;&#xC5D0; &#xBA85;&#xD655;&#xD558;&#xACE0; &#xCCB4;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xC811;&#xADFC; &#xC81C;&#xC5B4; &#xB9E4;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC124;&#xACC4;&#xD558;&#xACE0; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</strong></p>
<h3 id="3-Price-oracle-manipulation"><a href="#3-Price-oracle-manipulation" class="headerlink" title="3. Price oracle manipulation"></a>3. <strong>Price oracle manipulation</strong></h3><p>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB294; &#xC678;&#xBD80;&#xB85C;&#xBD80;&#xD130; &#xAC00;&#xACA9;&#xC774;&#xB098; &#xAE30;&#xD0C0; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC838;&#xC62C; &#xB54C; &#xC624;&#xB77C;&#xD074;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; DeFi&#xC5D0;&#xC11C; &#xC790;&#xC0B0; &#xAC00;&#xACA9;&#xC744; &#xAC00;&#xC838;&#xC624;&#xAE30; &#xC704;&#xD574; &#xC624;&#xB77C;&#xD074;&#xC744; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;, &#xC774; &#xC624;&#xB77C;&#xD074;&#xC774; &#xC870;&#xC791;&#xB418;&#xAC70;&#xB098;, &#xCDE8;&#xC57D;&#xD558;&#xAC70;&#xB098;, &#xC2E0;&#xB8B0;&#xC131;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xAC70;&#xC9D3; &#xAC00;&#xACA9; &#xC815;&#xBCF4;&#xB97C; &#xC8FC;&#xC785;&#xD574; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xC798;&#xBABB;&#xB41C; &#xB3D9;&#xC791;&#xC744; &#xC720;&#xBC1C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xBB34;&#xB2E8; &#xC778;&#xCD9C;, &#xACFC;&#xB3C4;&#xD55C; &#xB808;&#xBC84;&#xB9AC;&#xC9C0;, &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xD30C;&#xC0B0;, &#xC720;&#xB3D9;&#xC131; &#xD480; &#xACE0;&#xAC08; &#xB4F1;&#xC758; &#xD53C;&#xD574;&#xB97C; &#xC77C;&#xC73C;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xC608;&#xC2DC;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xC124;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC791;&#xC131;&#xB41C; &#xC0D8;&#xD50C; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs solidity">// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;
// [1]
interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }
		// [2]
    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        require(price &gt; 0, &quot;Price must be positive&quot;);
	
        // Vulnerability: No validation or protection against price manipulation
        //[3]
        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on manipulated price
        // If an attacker manipulates the oracle, they could borrow more than they should
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}</code></pre>
<p>[1]&#xC758; getLatestPrice() &#xD568;&#xC218;&#xB85C; &#xC678;&#xBD80; &#xC2DC;&#xC2A4;&#xD15C;(&#xC624;&#xB77C;&#xD074;)&#xC5D0;&#xC11C; &#xCD5C;&#xC2E0; &#xAC00;&#xACA9;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;. &#xC774; &#xC624;&#xB77C;&#xD074;&#xC744; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xAC70;&#xB098; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB2E4;&#xBA74;, &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD5C8;&#xC704; &#xAC00;&#xACA9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC5D0; &#xC8FC;&#xC785;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>[2]&#xB85C; borrow()&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xB54C;, &#xC624;&#xB77C;&#xD074;&#xB85C;&#xBD80;&#xD130; &#xC790;&#xC0B0;&#xC758; &#xD604;&#xC7AC; &#xAC00;&#xACA9;&#xC744; &#xBC1B;&#xC544;&#xC635;&#xB2C8;&#xB2E4;. price &gt; 0 &#xC870;&#xAC74;&#xC740; &#xB2E8;&#xC21C;&#xD788; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xACE0;, &#xC870;&#xC791;&#xB41C; &#xAC00;&#xACA9;&#xC5D0; &#xB300;&#xD55C; &#xBC29;&#xC5B4;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>[3]&#xC5D0;&#xC11C;&#xB294; &#xBC1B;&#xC544;&#xC628; &#xAC00;&#xACA9; &#xAC12;&#xACFC; amount&#xB97C; &#xACF1;&#xD574;&#xC11C; &#xB2F4;&#xBCF4; &#xAC00;&#xCE58;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xB294;&#xB370;, &#xC774; &#xAC12;&#xC774; &#xACFC;&#xB300;&#xD3C9;&#xAC00;&#xB418;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC2E4;&#xC81C;&#xBCF4;&#xB2E4; &#xB354; &#xB9CE;&#xC740; &#xC790;&#xAE08;&#xC744; &#xBE4C;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD5C8;&#xC704; &#xAC00;&#xACA9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xC785;&#xD588;&#xB2E4;&#xBA74;, &#xB2F4;&#xBCF4; &#xB300;&#xBE44; &#xCD08;&#xACFC; &#xB300;&#xCD9C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC2DC;&#xC2A4;&#xD15C; &#xC790;&#xC0B0; &#xC720;&#xCD9C;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xB294; &#xC55E;&#xC11C; &#xBCF4;&#xC5EC;&#xC900; &#xCDE8;&#xC57D;&#xD55C; &#xBC84;&#xC804;&#xC758; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xB97C; &#xBCF4;&#xC644;&#xD55C; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs solidity">// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

interface IPriceFeed {
    function getLatestPrice() external view returns (int);
}

contract PriceOracleManipulation {
    address public owner;
    IPriceFeed public priceFeed;
    // [1]
    int public minPrice = 1000; // Set minimum acceptable price
    int public maxPrice = 2000; // Set maximum acceptable price

    constructor(address _priceFeed) {
        owner = msg.sender;
        priceFeed = IPriceFeed(_priceFeed);
    }

    function borrow(uint256 amount) public {
        int price = priceFeed.getLatestPrice();
        // [2]
        require(price &gt; 0 &amp;&amp; price &gt;= minPrice &amp;&amp; price &lt;= maxPrice, &quot;Price manipulation detected&quot;);

        uint256 collateralValue = uint256(price) * amount;

        // Borrow logic based on valid price
    }

    function repay(uint256 amount) public {
        // Repayment logic
    }
}</code></pre>
<p>[1] &#xAC00;&#xACA9; &#xC870;&#xC791;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xAE30;&#xC900;&#xAC12; &#xBCC0;&#xC218;&#xB97C; &#xC815;&#xD558;&#xACE0; [2] &#xAC00;&#xACA9; &#xAC80;&#xC99D;&#xC744; &#xC704;&#xD55C; &#xB85C;&#xC9C1;&#xC744; &#xCD94;&#xAC00;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xC2E4;&#xC81C; &#xC0AC;&#xB840;</strong></p>
<ul>
<li>2023&#xB144; 2&#xC6D4; BonqDAO &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xC624;&#xB77C;&#xD074; &#xC870;&#xC791; &#xACF5;&#xACA9;&#xC774; &#xBC1C;&#xC0DD;&#xD574; 1&#xC5B5; 2&#xCC9C;&#xB9CC; &#xB2EC;&#xB7EC;&#xC758; &#xC190;&#xC2E4;&#xC744; &#xC785;&#xD614;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC624;&#xB77C;&#xD074;&#xC744; &#xD1B5;&#xD574; ALBT &#xD1A0;&#xD070; &#xAC00;&#xACA9;&#xC744; &#xC778;&#xC704;&#xC801;&#xC73C;&#xB85C; &#xBD80;&#xD480;&#xB9AC;&#xACE0;, &#xC774;&#xB97C; &#xB2F4;&#xBCF4;&#xB85C; BEUR &#xC2A4;&#xD14C;&#xC774;&#xBE14; &#xCF54;&#xC778;&#xC744; &#xACFC;&#xB3C4;&#xD558;&#xAC8C; &#xBC1C;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACF5;&#xACA9;&#xC758; &#xC6D0;&#xC778;&#xC740; &#xC624;&#xB77C;&#xD074; &#xAC00;&#xACA9; &#xAC80;&#xC99D; &#xBD80;&#xC7AC;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>2023&#xB144; 5&#xC6D4; Baby Doge &#xD1A0;&#xD070;&#xC774; &#xC624;&#xB77C;&#xD074; &#xC870;&#xC791; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC57D; 13&#xB9CC; 7&#xCC9C; &#xB2EC;&#xB7EC; &#xC0C1;&#xB2F9;&#xC758; &#xD53C;&#xD574;&#xB97C; &#xC785;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><strong>mitigation</strong></p>
<ul>
<li>&#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xC624;&#xB77C;&#xD074;&#xB85C;&#xBD80;&#xD130; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC9D1;&#xACC4;&#xD558;&#xBA74; &#xC870;&#xC791; &#xC704;&#xD5D8;&#xC744; &#xC904;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8; &#xB85C;&#xC9C1;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xB294; &#xAE09;&#xACA9;&#xD55C; &#xAC00;&#xACA9; &#xBCC0;&#xB3D9;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574;, &#xC624;&#xB77C;&#xD074;&#xB85C;&#xBD80;&#xD130; &#xBC1B;&#xC740; &#xAC00;&#xACA9;&#xC5D0; &#xCD5C;&#xC18C;&#xAC12; &#xBC0F; &#xCD5C;&#xB300;&#xAC12; &#xC784;&#xACC4; &#xC870;&#xAC74;&#xC744; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD0C0;&#xC784;&#xB77D;(time lock)&#xC744; &#xB3C4;&#xC785;&#xD558;&#xC5EC;, &#xAC00;&#xACA9; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC0AC;&#xC774;&#xC5D0; &#xC9C0;&#xC5F0;&#xC744; &#xB450;&#xBA74; &#xC989;&#xAC01;&#xC801;&#xC778; &#xAC00;&#xACA9; &#xBCC0;&#xB3D9;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB9C9;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC624;&#xB77C;&#xD074;&#xB85C;&#xBD80;&#xD130; &#xBC1B;&#xC740; &#xB370;&#xC774;&#xD130;&#xC758; &#xC2E0;&#xB8B0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574;, &#xC554;&#xD638;&#xD559;&#xC801; &#xC11C;&#xBA85; &#xB4F1; &#xC99D;&#xBA85; &#xBC29;&#xC2DD;&#xC744; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xAC1C;&#xB150;&#xACFC; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;, &#xADF8;&#xB9AC;&#xACE0; &#xB300;&#xD45C;&#xC801;&#xC778; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xBA87; &#xAC00;&#xC9C0;&#xB97C; &#xB2E4;&#xB918;&#xC5B4;&#xC694;. &#xC0AC;&#xC2E4; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC880; &#xB354; &#xB2E4;&#xB8E8;&#xACE0; &#xC2F6;&#xC5C8;&#xB294;&#xB370; &#xBD84;&#xB7C9; &#xBB38;&#xC81C;&#xB85C; 3&#xAC00;&#xC9C0;&#xB9CC; &#xAC04;&#xB2E8;&#xD788; &#xC815;&#xB9AC;&#xD560; &#xC218;&#xBC16;&#xC5D0; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;..</p>
<p>&#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xC2E4;&#xC81C; &#xD574;&#xD0B9; &#xC0AC;&#xB840;&#xC640; &#xB2E4;&#xC591;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB354; &#xB2E4;&#xB904;&#xBCFC;&#xAE4C; &#xC0DD;&#xAC01;&#xC911;&#xC774;&#xC5D0;&#xC694;. </p>
<p>&#xB77C;&#xACE0; &#xB9D0;&#xD588;&#xC9C0;&#xB9CC; &#xB2E4;&#xC74C; &#xC8FC;&#xC81C;&#xAC00; &#xAF2D; &#xADF8;&#xB807;&#xAC8C; &#xB420;&#xC9C0;&#xB294; &#xC544;&#xC9C1; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F605; &#xAE34; &#xC5F0;&#xAD6C;&#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!</p>
<h3 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html">https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/pcaversaccio/reentrancy-attacks">https://github.com/pcaversaccio/reentrancy-attacks</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://owasp.org/www-project-smart-contract-top-10/">https://owasp.org/www-project-smart-contract-top-10/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2">https://medium.com/coinmonks/10-smart-contract-vulnerabilities-with-code-examples-38562685fca2</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/bekim/">bekim</a>
                  
                  <a class="hover-with-bg" href="/tags/blockchain/">blockchain</a>
                  
                  <a class="hover-with-bg" href="/tags/smartcontract/">smartcontract</a>
                  
                  <a class="hover-with-bg" href="/tags/ethereum/">ethereum</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_bekim.jpg" srcset="/img/loading.gif" alt="bekim">
                  </div>

                  <div class="link-text">
                    <div class="link-title">bekim</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/bekim">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/07/16/poosic/cve-2025-32462/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-32462: sudo -h    (EoP) </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/07/13/bekim/smartcontract/en/">
                    <span class="hidden-mobile">[Research] From Paper to Code: Smart Contract [en]</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/07/13/bekim/smartcontract/ko/';
        this.page.identifier = '/2025/07/13/bekim/smartcontract/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] From Paper to Code: Smart Contract [ko]&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
