

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F606;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xCD08;&amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xC9C0;&amp;#xB098;&amp;#xACE0; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6CC;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &lt;strong&gt;&amp;#x2600;&amp;#xFE0F;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0B0;&amp;#xB73B;&amp;#xD55C; &amp;#xC9C0;&amp;#xAE08;&amp;#xB3C4;, &amp;#xB2E4;&amp;#xAC00;&amp;#xC62C; &amp;#xC5EC;&amp;#xB984;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC9C0;&amp;#xB09C;&amp;#xD574; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xD574;&amp;#xD0B9;&amp;#x2026; 2&amp;#xB144;&amp;#xC5EC;&amp;#xAC04; 1,014GB &amp;#xBD84;&amp;#xB7C9; &amp;#xBC0F; 5,171&amp;#xAC1C; &amp;#xBB38;&amp;#xC11C; &amp;#xD0C8;&amp;#xCDE8;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.12 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://m.boannews.com/html/detail.html?mtype=1&amp;amp;idx=129709&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC218;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; 2021&amp;#xB144; 1&amp;#xC6D4; 7&amp;#xC77C; &amp;#xC774;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD;&amp;#xC5D0; &amp;#xCE68;&amp;#xC785;&amp;#xD588;&amp;#xB2E4;&amp;#xB124;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC0C1;&amp;#xC138;&amp;#xD55C; &amp;#xAE30;&amp;#xB85D;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xCD5C;&amp;#xCD08; &amp;#xCE68;&amp;#xC785; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xC6D0;&amp;#xC778;&amp;#xC740; &amp;#xBC1D;&amp;#xD790; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC;, 2023&amp;#xB144; 2&amp;#xC6D4; 9&amp;#xC77C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC57D; 2&amp;#xB144;&amp;#xAC04; &amp;#xBC1C;&amp;#xAC01;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xBC31;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB418;&amp;#xC5B4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xB824; 1,014GB&amp;#xC758; &amp;#xBC95;&amp;#xC6D0; &amp;#xC790;&amp;#xB8CC;&amp;#xAC00; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xC678;&amp;#xBD80;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xC5ED;&amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xC5EC; 5,171&amp;#xAC1C; &amp;#xD30C;&amp;#xC77C;(&amp;#xC57D; 4.7GB)&amp;#xC744; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;&amp;#x2026; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#x2018;&lt;em&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC790;&amp;#xD544;&amp;#xC9C4;&amp;#xC220;&amp;#xC11C;, &amp;#xCC44;&amp;#xBB34;&amp;#xC99D;&amp;#xB300; &amp;#xBC0F; &amp;#xC9C0;&amp;#xAE09;&amp;#xBD88;&amp;#xB2A5; &amp;#xACBD;&amp;#xC704;&amp;#xC11C;, &amp;#xD63C;&amp;#xC778;&amp;#xAD00;&amp;#xACC4;&amp;#xC99D;&amp;#xBA85;&amp;#xC11C;, &amp;#xC9C4;&amp;#xB2E8;&amp;#xC11C; &amp;#xB4F1;&lt;/em&gt; &amp;#x2019; &amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; 2&amp;#xCC28; &amp;#xD53C;&amp;#xD574;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC720;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;&amp;#x1F630;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;, &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB294; &amp;#x2018;P@ssw0rd&amp;#x2019;, &amp;#x2018;123qwe&amp;#x2019;, &amp;#x2018;oracle99&amp;#x2019; &amp;#xB4F1; &amp;#xC18D;&amp;#xCE6D; &amp;#xAE68;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC77C;&amp;#xBD80; &amp;#xACC4;&amp;#xC815;&amp;#xC740; 2016&amp;#xB144; 8&amp;#xC6D4;&amp;#xBD80;&amp;#xD130; 6&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#x2018;P@ssw0rd&amp;#x2019; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F440;  OMG..&amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xBD81;&amp;#xD55C;&amp;#xC774; &amp;#xBC30;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xBC94;&amp;#xD589;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC11C;&amp;#xBC84; &amp;#xACB0;&amp;#xC81C;&amp;#xB0B4;&amp;#xC5ED;(&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;), IP &amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1;&amp;#xC744; &amp;#xAE30;&amp;#xC874; &amp;#xBD81;&amp;#xD55C;&amp;#xBC1C;&amp;#xB85C; &amp;#xADDC;&amp;#xBA85;&amp;#xB41C; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xAC74;&amp;#xACFC; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xAD50; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xB77C;&amp;#xC790;&amp;#xB8E8;&amp;#xC2A4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC778; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xBD81;&amp;#xD55C; IP&amp;#xC5D0;&amp;#xC11C; &amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBC84; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xAC83;&amp;#xB4E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.17 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156016&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD81;&amp;#xD55C; IT &amp;#xC778;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xD0C0; &amp;#xAD6D;&amp;#xAC00;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5; &amp;#xCDE8;&amp;#xC5C5;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xB098;&amp;#xC694;? &amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xBBF8; &amp;#xBC95;&amp;#xBB34;&amp;#xBD80;&amp;#xAC00; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xC218;&amp;#xC0AC;&amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xD611;&amp;#xB825;&amp;#xD574; &amp;#xBD81;&amp;#xD55C; IT &amp;#xC778;&amp;#xB825;&amp;#xC758; &amp;#xC704;&amp;#xC7A5; &amp;#xCDE8;&amp;#xC5C5; &amp;#xBC0F; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD55C; &amp;#xD610;&amp;#xC758;&amp;#xB97C; &amp;#xBC1B;&amp;#xB294; &amp;#xC6A9;&amp;#xC758;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xAE30; &amp;#xD610;&amp;#xC758; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC18C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xBD81;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xB3C8;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xBC1B;&amp;#xC544; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC744; &amp;#xAD6C;&amp;#xC785;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774;&amp;#xD6C4; &amp;#xBD81;&amp;#xD55C; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xC774; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xACA9; &amp;#xC811;&amp;#xC18D;&amp;#xD574; &amp;#xAD6C;&amp;#xC9C1; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1FAE2; &lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xAE00; &amp;#xB9E8;&amp;#xB514;&amp;#xC5B8;&amp;#xD2B8;(Mandiant)&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xBD81;&amp;#xD55C; IP &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; 1&amp;#xB2EC; &amp;#xAC04; &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC0AC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xAD6D;&amp;#xAC00;&amp;#xC5D0; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xB454; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F632; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC790;&amp;#xB8CC; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xBB38;&amp;#xC11C;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBBF8;&amp;#xAD6D;&amp;#xC758; &amp;#x2018;&amp;#xC778;&amp;#xBE48;&amp;#xC11C;&amp;#xBE14;&amp;#x2019;, &amp;#xC77C;&amp;#xBCF8;&amp;#xC758; &amp;#x2018;&amp;#xB2EC;&amp;#xB9AC;&amp;#xC544; &amp;#xC778; &amp;#xBE14;&amp;#xB8F8;&amp;#x2018;, BBC&amp;#xC758; &amp;#x2019;&amp;#xC625;&amp;#xD1A0;&amp;#xB11B;&amp;#x2018; &amp;#xB4F1;&amp;#xC758; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC8FC;&amp;#xC11D;&amp;#xC774; &amp;#xC911;&amp;#xAD6D;&amp;#xC5B4;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xC544; &amp;#xC8FC;&amp;#xC694; &amp;#xC81C;&amp;#xC791;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xADFC;&amp;#xBB34;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xBA87; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC70;&amp;#xCE5C; &amp;#xD558;&amp;#xCCAD; &amp;#xC5C5;&amp;#xBB34;&amp;#xB97C; &amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;Intel, 90&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; 41&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xAD8C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.15 | SecurityWeek | &lt;a href=&#34;https://www.securityweek.com/intel-publishes-41-security-advisories-for-over-90-vulnerabilities/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;Intel &amp;#xC81C;&amp;#xD488;&amp;#xAD70;&amp;#xC5D0;&amp;#xC11C; 90&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD55C; 41&amp;#xAC1C;&amp;#xC758; Released&amp;#xAC00; &amp;#xBC1C;&amp;#xD45C;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xAC00;&amp;#xC7A5; critical &amp;#xD55C; &amp;#xB4F1;&amp;#xAE09;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC; &amp;#xBC1B;&amp;#xC740; &amp;#xAC83;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;CVSS&lt;/a&gt; 10&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;CVE-2024-22476&lt;/a&gt; &amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F632;  &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xBAA8;&amp;#xB378; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; CPU &amp;#xB610;&amp;#xB294; GPU&amp;#xC5D0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB525; &amp;#xB7EC;&amp;#xB2DD; &amp;#xCD94;&amp;#xB860; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBAA8;&amp;#xB378; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; AI &amp;#xC81C;&amp;#xD488;&amp;#xC778; Neural Compressor&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;&amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;, Intel&amp;#xC740; &amp;#xC774; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#x201C;&amp;#xC6D0;&amp;#xACA9; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#x201D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xD328;&amp;#xCE58; &amp;#xC0AC;&amp;#xD56D;&amp;#xC740; &lt;a href=&#34;https://www.intel.com/content/www/us/en/security-center/default.html&#34;&gt;&amp;#xCC38;&amp;#xACE0; &amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC720;&amp;#xBA85; &amp;#xD574;&amp;#xD0B9; &amp;#xD3EC;&amp;#xB7FC; &amp;#x2018;BreachForums&amp;#x2019;, &amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;2024.05.16 | SecurityWeek | &lt;a href=&#34;https://www.securityweek.com/breachforums-shut-down-in-apparent-law-enforcement-operation/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;BreachForums&amp;#x2019; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84; &amp;#xC788;&amp;#xB098;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;BreachForums&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&lt;/a&gt; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xACE0; &amp;#xD30C;&amp;#xB294; &amp;#xACF3;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#x2639;&amp;#xFE0F; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC218;&amp;#xC2ED; &amp;#xAC74;&amp;#xC529; &amp;#xC804;&amp;#xC138;&amp;#xACC4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xACE0; &amp;#xD30C;&amp;#xB294; &amp;#xAE00;&amp;#xB4E4;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xC5B4;&amp;#xC694;.. &amp;#x1F613; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF3;&amp;#xC744; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB274;&amp;#xC9C8;&amp;#xB79C;&amp;#xB4DC;, &amp;#xD638;&amp;#xC8FC;, &amp;#xC601;&amp;#xAD6D;, &amp;#xC2A4;&amp;#xC704;&amp;#xC2A4;, &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098;, &amp;#xC544;&amp;#xC774;&amp;#xC2AC;&amp;#xB780;&amp;#xB4DC; &amp;#xB4F1;&amp;#xACFC; FBI&amp;#xC758; &amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; BreachForums&amp;#xB97C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, RaidForums&amp;#xC774; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xACE0; BreachForums&amp;#xC774; &amp;#xC0DD;&amp;#xACBC;&amp;#xB4EF;&amp;#xC774; &amp;#xC5B8;&amp;#xC81C; &amp;#xB610; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC838; &amp;#xC6B4;&amp;#xC601;&amp;#xB420; &amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC694; &amp;#x2639;&amp;#xFE0F;&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xB0B4; &amp;#xAC00;&amp;#xC871; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD749;&amp;#xB0B4;&amp;#xB0B8; AI &amp;#xC2E0;&amp;#xC885; &amp;#xD53C;&amp;#xC2F1; &amp;#xC8FC;&amp;#xC758;!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.16 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129836&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB525;&amp;#xD398;&amp;#xC774;&amp;#xD06C;&lt;/a&gt;, &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB525;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&lt;/a&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; AI &amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&amp;#xD53C;&amp;#xC2F1;&amp;#xC774; &amp;#xC131;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xB140;&amp;#xC758; &amp;#xC5BC;&amp;#xAD74;&amp;#xACFC; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xAC00;&amp;#xC871;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C8;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC885; AI &amp;#xD53C;&amp;#xC2F1;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; SNS&amp;#xAC00; &amp;#xD65C;&amp;#xBC1C;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD574;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC74C;&amp;#xC131; &amp;#xBC0F; &amp;#xC601;&amp;#xC0C1;&amp;#xBB3C;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;! &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;CVSS&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC2EC;&amp;#xAC01;&amp;#xC131;&amp;#xC744; &amp;#xD3C9;&amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xC810;&amp;#xC218; &amp;#xCCB4;&amp;#xACC4;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CVE-2024-22476&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-22476&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2024-22476&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC5EC; &amp;#xD2B9;&amp;#xC815; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;(&amp;#xC608;: Tor, I2P &amp;#xB4F1;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC6F9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xD398;&amp;#xC774;&amp;#xD06C;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xBB3C;&amp;#xC758; &amp;#xC5BC;&amp;#xAD74;&amp;#xC774;&amp;#xB098; &amp;#xD2B9;&amp;#xC815; &amp;#xBD80;&amp;#xC704;&amp;#xB97C; &amp;#xD569;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC1C;&amp;#xD654;&amp;#xC5D0; &amp;#xD569;&amp;#xC131;&amp;#xD55C; &amp;#xAE30;&amp;#xC220; &lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129881&#34;&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC0AC;&amp;#xAC74; &amp;#xAD00;&amp;#xB828; &amp;#xC911;&amp;#xC694; &amp;#xC54C;&amp;#xB9BC;? KISA &amp;#xC0AC;&amp;#xCE6D; &amp;#xD53C;&amp;#xC2F1; &amp;#xBA54;&amp;#xC77C; &amp;#xC720;&amp;#xD3EC;&amp;#x2026; &amp;#xBD81;&amp;#xD55C;&amp;#xBC1C; &amp;#xACF5;&amp;#xACA9; &amp;#xCD94;&amp;#xC815;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129869&#34;&gt;&amp;#xBBF8;&amp;#xAD6D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD81;&amp;#xD55C; &amp;#xC815;&amp;#xAD8C; &amp;#xBA39;&amp;#xC5EC;&amp;#xC0B4;&amp;#xB9AC;&amp;#xB824; &amp;#xC2E0;&amp;#xC6D0; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xC77C;&amp;#xB2F9; &amp;#xCCB4;&amp;#xD3EC;&amp;#xB3FC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156059&#34;&gt;D-Link &amp;#xB77C;&amp;#xC6B0;&amp;#xD130;&amp;#xC640; ivanti EPMM &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC8FC;&amp;#xC758;&amp;#x2026;&amp;#xD574;&amp;#xD0B9;&amp;#xACFC; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C; &amp;#xC6B0;&amp;#xB824;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156027&#34;&gt;Apple, &amp;#xC571;&amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC560;&amp;#xD50C; &amp;#xD398;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&amp;#x2026;&amp;#x201D;4&amp;#xB144;&amp;#xAC04; 70&amp;#xC5B5; &amp;#xB2EC;&amp;#xB7EC; &amp;#xADDC;&amp;#xBAA8; &amp;#xC571;&amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xBD80;&amp;#xC815; &amp;#xAD6C;&amp;#xB9E4; &amp;#xCC28;&amp;#xB2E8;&amp;#x201D;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.yna.co.kr/view/AKR20240512045400530&#34;&gt;&amp;#x2018;&amp;#xACFC;&amp;#xC9D5;&amp;#xAE08; 75&amp;#xC5B5;&amp;#x2019;&amp;#x2026;&amp;#xB9E4;&amp;#xC11C;&amp;#xC6CC;&amp;#xC9C4; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xADDC;&amp;#xC81C;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC740; &amp;#xC81C;&amp;#xC678;?&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;5&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#5&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;5&amp;#xC6D4; &amp;#xAD50;&amp;#xC721;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;BoB 13&amp;#xAE30;&lt;/a&gt; | KITRI | 2024.05.28&amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] ë²•ì›.. í•´í‚¹ ë‹¹í•˜ë‹¤?! - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F606;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xCD08;&amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xC9C0;&amp;#xB098;&amp;#xACE0; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6CC;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &lt;strong&gt;&amp;#x2600;&amp;#xFE0F;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0B0;&amp;#xB73B;&amp;#xD55C; &amp;#xC9C0;&amp;#xAE08;&amp;#xB3C4;, &amp;#xB2E4;&amp;#xAC00;&amp;#xC62C; &amp;#xC5EC;&amp;#xB984;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC9C0;&amp;#xB09C;&amp;#xD574; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xD574;&amp;#xD0B9;&amp;#x2026; 2&amp;#xB144;&amp;#xC5EC;&amp;#xAC04; 1,014GB &amp;#xBD84;&amp;#xB7C9; &amp;#xBC0F; 5,171&amp;#xAC1C; &amp;#xBB38;&amp;#xC11C; &amp;#xD0C8;&amp;#xCDE8;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.12 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://m.boannews.com/html/detail.html?mtype=1&amp;amp;idx=129709&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD;&amp;#xC774; &amp;#xACF5;&amp;#xACA9;&amp;#xB2F9;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC218;&amp;#xC0AC; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC801;&amp;#xC5B4;&amp;#xB3C4; 2021&amp;#xB144; 1&amp;#xC6D4; 7&amp;#xC77C; &amp;#xC774;&amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD;&amp;#xC5D0; &amp;#xCE68;&amp;#xC785;&amp;#xD588;&amp;#xB2E4;&amp;#xB124;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC0C1;&amp;#xC138;&amp;#xD55C; &amp;#xAE30;&amp;#xB85D;&amp;#xC740; &amp;#xC774;&amp;#xBBF8; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC5B4; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xCD5C;&amp;#xCD08; &amp;#xCE68;&amp;#xC785; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xC6D0;&amp;#xC778;&amp;#xC740; &amp;#xBC1D;&amp;#xD790; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC9C0;&amp;#xB9CC;, 2023&amp;#xB144; 2&amp;#xC6D4; 9&amp;#xC77C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC57D; 2&amp;#xB144;&amp;#xAC04; &amp;#xBC1C;&amp;#xAC01;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xBC31;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB418;&amp;#xC5B4; &amp;#xC720;&amp;#xCD9C; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xB824; 1,014GB&amp;#xC758; &amp;#xBC95;&amp;#xC6D0; &amp;#xC790;&amp;#xB8CC;&amp;#xAC00; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xC678;&amp;#xBD80;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xC5ED;&amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xC5EC; 5,171&amp;#xAC1C; &amp;#xD30C;&amp;#xC77C;(&amp;#xC57D; 4.7GB)&amp;#xC744; &amp;#xBC95;&amp;#xC6D0; &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;&amp;#x2026; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xC911;&amp;#xC5D0;&amp;#xB294; &amp;#x2018;&lt;em&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC790;&amp;#xD544;&amp;#xC9C4;&amp;#xC220;&amp;#xC11C;, &amp;#xCC44;&amp;#xBB34;&amp;#xC99D;&amp;#xB300; &amp;#xBC0F; &amp;#xC9C0;&amp;#xAE09;&amp;#xBD88;&amp;#xB2A5; &amp;#xACBD;&amp;#xC704;&amp;#xC11C;, &amp;#xD63C;&amp;#xC778;&amp;#xAD00;&amp;#xACC4;&amp;#xC99D;&amp;#xBA85;&amp;#xC11C;, &amp;#xC9C4;&amp;#xB2E8;&amp;#xC11C; &amp;#xB4F1;&lt;/em&gt; &amp;#x2019; &amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; 2&amp;#xCC28; &amp;#xD53C;&amp;#xD574;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC720;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;&amp;#x1F630;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;, &amp;#xC804;&amp;#xC0B0;&amp;#xB9DD; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB294; &amp;#x2018;P@ssw0rd&amp;#x2019;, &amp;#x2018;123qwe&amp;#x2019;, &amp;#x2018;oracle99&amp;#x2019; &amp;#xB4F1; &amp;#xC18D;&amp;#xCE6D; &amp;#xAE68;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC77C;&amp;#xBD80; &amp;#xACC4;&amp;#xC815;&amp;#xC740; 2016&amp;#xB144; 8&amp;#xC6D4;&amp;#xBD80;&amp;#xD130; 6&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#x2018;P@ssw0rd&amp;#x2019; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F440;  OMG..&amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xBD81;&amp;#xD55C;&amp;#xC774; &amp;#xBC30;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xBC88; &amp;#xBC94;&amp;#xD589;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC11C;&amp;#xBC84; &amp;#xACB0;&amp;#xC81C;&amp;#xB0B4;&amp;#xC5ED;(&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;), IP &amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1;&amp;#xC744; &amp;#xAE30;&amp;#xC874; &amp;#xBD81;&amp;#xD55C;&amp;#xBC1C;&amp;#xB85C; &amp;#xADDC;&amp;#xBA85;&amp;#xB41C; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xAC74;&amp;#xACFC; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xAD50; &amp;#xBC0F; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xB77C;&amp;#xC790;&amp;#xB8E8;&amp;#xC2A4; &amp;#xADF8;&amp;#xB8F9;&amp;#xC778; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xBD81;&amp;#xD55C; IP&amp;#xC5D0;&amp;#xC11C; &amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBC84; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xAC83;&amp;#xB4E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.17 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156016&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD81;&amp;#xD55C; IT &amp;#xC778;&amp;#xB825;&amp;#xB4E4;&amp;#xC774; &amp;#xD0C0; &amp;#xAD6D;&amp;#xAC00;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5; &amp;#xCDE8;&amp;#xC5C5;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xB098;&amp;#xC694;? &amp;#x1F440;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xBBF8; &amp;#xBC95;&amp;#xBB34;&amp;#xBD80;&amp;#xAC00; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xC218;&amp;#xC0AC;&amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xD611;&amp;#xB825;&amp;#xD574; &amp;#xBD81;&amp;#xD55C; IT &amp;#xC778;&amp;#xB825;&amp;#xC758; &amp;#xC704;&amp;#xC7A5; &amp;#xCDE8;&amp;#xC5C5; &amp;#xBC0F; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD55C; &amp;#xD610;&amp;#xC758;&amp;#xB97C; &amp;#xBC1B;&amp;#xB294; &amp;#xC6A9;&amp;#xC758;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xAE30; &amp;#xD610;&amp;#xC758; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC18C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xBD81;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xB3C8;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xBC1B;&amp;#xC544; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC744; &amp;#xAD6C;&amp;#xC785;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774;&amp;#xD6C4; &amp;#xBD81;&amp;#xD55C; &amp;#xC778;&amp;#xB825;&amp;#xC774; &amp;#xC774; &amp;#xB178;&amp;#xD2B8;&amp;#xBD81;&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xACA9; &amp;#xC811;&amp;#xC18D;&amp;#xD574; &amp;#xAD6C;&amp;#xC9C1; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1FAE2; &lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xAE00; &amp;#xB9E8;&amp;#xB514;&amp;#xC5B8;&amp;#xD2B8;(Mandiant)&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xBD81;&amp;#xD55C; IP &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4; 1&amp;#xB2EC; &amp;#xAC04; &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC0AC;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xC5EC;&amp;#xB7EC; &amp;#xAD6D;&amp;#xAC00;&amp;#xC5D0; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xB454; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC790;&amp;#xB8CC;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F632; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC790;&amp;#xB8CC; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xBB38;&amp;#xC11C;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBBF8;&amp;#xAD6D;&amp;#xC758; &amp;#x2018;&amp;#xC778;&amp;#xBE48;&amp;#xC11C;&amp;#xBE14;&amp;#x2019;, &amp;#xC77C;&amp;#xBCF8;&amp;#xC758; &amp;#x2018;&amp;#xB2EC;&amp;#xB9AC;&amp;#xC544; &amp;#xC778; &amp;#xBE14;&amp;#xB8F8;&amp;#x2018;, BBC&amp;#xC758; &amp;#x2019;&amp;#xC625;&amp;#xD1A0;&amp;#xB11B;&amp;#x2018; &amp;#xB4F1;&amp;#xC758; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC8FC;&amp;#xC11D;&amp;#xC774; &amp;#xC911;&amp;#xAD6D;&amp;#xC5B4;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCF4;&amp;#xC544; &amp;#xC8FC;&amp;#xC694; &amp;#xC81C;&amp;#xC791;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xADFC;&amp;#xBB34;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xBA87; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xAC70;&amp;#xCE5C; &amp;#xD558;&amp;#xCCAD; &amp;#xC5C5;&amp;#xBB34;&amp;#xB97C; &amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD30C;&amp;#xC545;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F631; &lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;Intel, 90&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; 41&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xAD8C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.15 | SecurityWeek | &lt;a href=&#34;https://www.securityweek.com/intel-publishes-41-security-advisories-for-over-90-vulnerabilities/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;Intel &amp;#xC81C;&amp;#xD488;&amp;#xAD70;&amp;#xC5D0;&amp;#xC11C; 90&amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD328;&amp;#xCE58;&amp;#xD55C; 41&amp;#xAC1C;&amp;#xC758; Released&amp;#xAC00; &amp;#xBC1C;&amp;#xD45C;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xAC00;&amp;#xC7A5; critical &amp;#xD55C; &amp;#xB4F1;&amp;#xAE09;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC; &amp;#xBC1B;&amp;#xC740; &amp;#xAC83;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;CVSS&lt;/a&gt; 10&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;CVE-2024-22476&lt;/a&gt; &amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F632;  &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xBAA8;&amp;#xB378; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xACE0; CPU &amp;#xB610;&amp;#xB294; GPU&amp;#xC5D0; &amp;#xBC30;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB525; &amp;#xB7EC;&amp;#xB2DD; &amp;#xCD94;&amp;#xB860; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBAA8;&amp;#xB378; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; AI &amp;#xC81C;&amp;#xD488;&amp;#xC778; Neural Compressor&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;&amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;, Intel&amp;#xC740; &amp;#xC774; &amp;#xCE58;&amp;#xBA85;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#x201C;&amp;#xC6D0;&amp;#xACA9; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#x201D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xD328;&amp;#xCE58; &amp;#xC0AC;&amp;#xD56D;&amp;#xC740; &lt;a href=&#34;https://www.intel.com/content/www/us/en/security-center/default.html&#34;&gt;&amp;#xCC38;&amp;#xACE0; &amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC720;&amp;#xBA85; &amp;#xD574;&amp;#xD0B9; &amp;#xD3EC;&amp;#xB7FC; &amp;#x2018;BreachForums&amp;#x2019;, &amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870;&amp;#xB85C; &amp;#xD3D0;&amp;#xC1C4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;2024.05.16 | SecurityWeek | &lt;a href=&#34;https://www.securityweek.com/breachforums-shut-down-in-apparent-law-enforcement-operation/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;BreachForums&amp;#x2019; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84; &amp;#xC788;&amp;#xB098;&amp;#xC694;?!&lt;/p&gt;
&lt;p&gt;BreachForums&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&lt;/a&gt; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC0AC;&amp;#xACE0; &amp;#xD30C;&amp;#xB294; &amp;#xACF3;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#x2639;&amp;#xFE0F; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xD558;&amp;#xB8E8;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC218;&amp;#xC2ED; &amp;#xAC74;&amp;#xC529; &amp;#xC804;&amp;#xC138;&amp;#xACC4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xACE0; &amp;#xD30C;&amp;#xB294; &amp;#xAE00;&amp;#xB4E4;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xC5B4;&amp;#xC694;.. &amp;#x1F613; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACF3;&amp;#xC744; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB274;&amp;#xC9C8;&amp;#xB79C;&amp;#xB4DC;, &amp;#xD638;&amp;#xC8FC;, &amp;#xC601;&amp;#xAD6D;, &amp;#xC2A4;&amp;#xC704;&amp;#xC2A4;, &amp;#xC6B0;&amp;#xD06C;&amp;#xB77C;&amp;#xC774;&amp;#xB098;, &amp;#xC544;&amp;#xC774;&amp;#xC2AC;&amp;#xB780;&amp;#xB4DC; &amp;#xB4F1;&amp;#xACFC; FBI&amp;#xC758; &amp;#xAD6D;&amp;#xC81C; &amp;#xACF5;&amp;#xC870; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; BreachForums&amp;#xB97C; &amp;#xD3D0;&amp;#xC1C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, RaidForums&amp;#xC774; &amp;#xD3D0;&amp;#xC1C4;&amp;#xB418;&amp;#xACE0; BreachForums&amp;#xC774; &amp;#xC0DD;&amp;#xACBC;&amp;#xB4EF;&amp;#xC774; &amp;#xC5B8;&amp;#xC81C; &amp;#xB610; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC838; &amp;#xC6B4;&amp;#xC601;&amp;#xB420; &amp;#xC9C0; &amp;#xBAB0;&amp;#xB77C;&amp;#xC694; &amp;#x2639;&amp;#xFE0F;&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xB0B4; &amp;#xAC00;&amp;#xC871; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD749;&amp;#xB0B4;&amp;#xB0B8; AI &amp;#xC2E0;&amp;#xC885; &amp;#xD53C;&amp;#xC2F1; &amp;#xC8FC;&amp;#xC758;!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.16 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129836&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/05/20/clalxk/newsletter0520/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB525;&amp;#xD398;&amp;#xC774;&amp;#xD06C;&lt;/a&gt;, &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB525;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&lt;/a&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; AI &amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&amp;#xD53C;&amp;#xC2F1;&amp;#xC774; &amp;#xC131;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xB140;&amp;#xC758; &amp;#xC5BC;&amp;#xAD74;&amp;#xACFC; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xAC00;&amp;#xC871;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C8;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC885; AI &amp;#xD53C;&amp;#xC2F1;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; SNS&amp;#xAC00; &amp;#xD65C;&amp;#xBC1C;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD574;&amp;#xC694;. &amp;#xD2B9;&amp;#xD788; &amp;#xC74C;&amp;#xC131; &amp;#xBC0F; &amp;#xC601;&amp;#xC0C1;&amp;#xBB3C;&amp;#xC744; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;! &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;CVSS&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC2EC;&amp;#xAC01;&amp;#xC131;&amp;#xC744; &amp;#xD3C9;&amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xC810;&amp;#xC218; &amp;#xCCB4;&amp;#xACC4;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CVE-2024-22476&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-22476&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2024-22476&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB85C;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC5EC; &amp;#xD2B9;&amp;#xC815; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;(&amp;#xC608;: Tor, I2P &amp;#xB4F1;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC6F9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xD398;&amp;#xC774;&amp;#xD06C;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xBB3C;&amp;#xC758; &amp;#xC5BC;&amp;#xAD74;&amp;#xC774;&amp;#xB098; &amp;#xD2B9;&amp;#xC815; &amp;#xBD80;&amp;#xC704;&amp;#xB97C; &amp;#xD569;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xBCF4;&amp;#xC774;&amp;#xC2A4;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xBAA9;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC1C;&amp;#xD654;&amp;#xC5D0; &amp;#xD569;&amp;#xC131;&amp;#xD55C; &amp;#xAE30;&amp;#xC220; &lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129881&#34;&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC0AC;&amp;#xAC74; &amp;#xAD00;&amp;#xB828; &amp;#xC911;&amp;#xC694; &amp;#xC54C;&amp;#xB9BC;? KISA &amp;#xC0AC;&amp;#xCE6D; &amp;#xD53C;&amp;#xC2F1; &amp;#xBA54;&amp;#xC77C; &amp;#xC720;&amp;#xD3EC;&amp;#x2026; &amp;#xBD81;&amp;#xD55C;&amp;#xBC1C; &amp;#xACF5;&amp;#xACA9; &amp;#xCD94;&amp;#xC815;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=129869&#34;&gt;&amp;#xBBF8;&amp;#xAD6D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD81;&amp;#xD55C; &amp;#xC815;&amp;#xAD8C; &amp;#xBA39;&amp;#xC5EC;&amp;#xC0B4;&amp;#xB9AC;&amp;#xB824; &amp;#xC2E0;&amp;#xC6D0; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xC77C;&amp;#xB2F9; &amp;#xCCB4;&amp;#xD3EC;&amp;#xB3FC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156059&#34;&gt;D-Link &amp;#xB77C;&amp;#xC6B0;&amp;#xD130;&amp;#xC640; ivanti EPMM &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC8FC;&amp;#xC758;&amp;#x2026;&amp;#xD574;&amp;#xD0B9;&amp;#xACFC; &amp;#xC815;&amp;#xBCF4;&amp;#xC720;&amp;#xCD9C; &amp;#xC6B0;&amp;#xB824;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156027&#34;&gt;Apple, &amp;#xC571;&amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC560;&amp;#xD50C; &amp;#xD398;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&amp;#x2026;&amp;#x201D;4&amp;#xB144;&amp;#xAC04; 70&amp;#xC5B5; &amp;#xB2EC;&amp;#xB7EC; &amp;#xADDC;&amp;#xBAA8; &amp;#xC571;&amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xBD80;&amp;#xC815; &amp;#xAD6C;&amp;#xB9E4; &amp;#xCC28;&amp;#xB2E8;&amp;#x201D;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.yna.co.kr/view/AKR20240512045400530&#34;&gt;&amp;#x2018;&amp;#xACFC;&amp;#xC9D5;&amp;#xAE08; 75&amp;#xC5B5;&amp;#x2019;&amp;#x2026;&amp;#xB9E4;&amp;#xC11C;&amp;#xC6CC;&amp;#xC9C4; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xADDC;&amp;#xC81C;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00;&amp;#xC740; &amp;#xC81C;&amp;#xC678;?&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;5&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#5&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;5&amp;#xC6D4; &amp;#xAD50;&amp;#xC721;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;amp;per_page=15&amp;amp;st=subject&amp;amp;q=#&#34;&gt;BoB 13&amp;#xAE30;&lt;/a&gt; | KITRI | 2024.05.28&amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/Newsletter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] ë²•ì›.. í•´í‚¹ ë‹¹í•˜ë‹¤?! - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-05-20 17:00" pubdate>
      2024ë…„ 5ì›” 20ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.9k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      38
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] ë²•ì›.. í•´í‚¹ ë‹¹í•˜ë‹¤?!</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, clalxk &#xC785;&#xB2C8;&#xB2E4; &#x1F606;</p>
<p>&#xC774;&#xC81C; &#xCD08;&#xC5EC;&#xB984;&#xC774; &#xC9C0;&#xB098;&#xACE0; &#xC5EC;&#xB984;&#xC774; &#xAC00;&#xAE4C;&#xC6CC;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC694; <strong>&#x2600;&#xFE0F;</strong></p>
<p>&#xC0B0;&#xB73B;&#xD55C; &#xC9C0;&#xAE08;&#xB3C4;, &#xB2E4;&#xAC00;&#xC62C; &#xC5EC;&#xB984;&#xB3C4; &#xD574;&#xD0B9;&#xC9F9;&#xC9F9;&#xACFC; &#xD568;&#xAED8; &#xD574;&#xC694;! </p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xC9C0;&#xB09C;&#xD574; &#xBC95;&#xC6D0; &#xC804;&#xC0B0;&#xB9DD; &#xD574;&#xD0B9;&#x2026; 2&#xB144;&#xC5EC;&#xAC04; 1,014GB &#xBD84;&#xB7C9; &#xBC0F; 5,171&#xAC1C; &#xBB38;&#xC11C; &#xD0C8;&#xCDE8;</strong></p>
</blockquote>
<p>2024.05.12 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.boannews.com/html/detail.html?mtype=1&amp;idx=129709">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/05/20/clalxk/newsletter0520/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xBC95;&#xC6D0; &#xC804;&#xC0B0;&#xB9DD;&#xC774; &#xACF5;&#xACA9;&#xB2F9;&#xD588;&#xC5B4;&#xC694;! </p>
<p>&#xC218;&#xC0AC; &#xACB0;&#xACFC;&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC801;&#xC5B4;&#xB3C4; 2021&#xB144; 1&#xC6D4; 7&#xC77C; &#xC774;&#xC804;&#xBD80;&#xD130; &#xBC95;&#xC6D0; &#xC804;&#xC0B0;&#xB9DD;&#xC5D0; &#xCE68;&#xC785;&#xD588;&#xB2E4;&#xB124;&#xC694; &#x1F631; </p>
<p>&#xB2F9;&#xC2DC; &#xC0C1;&#xC138;&#xD55C; &#xAE30;&#xB85D;&#xC740; &#xC774;&#xBBF8; &#xC0AD;&#xC81C;&#xB418;&#xC5B4; &#xC815;&#xD655;&#xD55C; &#xCD5C;&#xCD08; &#xCE68;&#xC785; &#xC2DC;&#xC810;&#xACFC; &#xC6D0;&#xC778;&#xC740; &#xBC1D;&#xD790; &#xC218; &#xC5C6;&#xC5C8;&#xC9C0;&#xB9CC;, 2023&#xB144; 2&#xC6D4; 9&#xC77C;&#xAE4C;&#xC9C0; &#xC57D; 2&#xB144;&#xAC04; &#xBC1C;&#xAC01;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB358; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBC31;&#xC2E0;&#xC5D0; &#xD0D0;&#xC9C0;&#xB418;&#xC5B4; &#xC720;&#xCD9C; &#xC0AC;&#xC2E4;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1FAE2;</p>
<p>&#xBB34;&#xB824; 1,014GB&#xC758; &#xBC95;&#xC6D0; &#xC790;&#xB8CC;&#xAC00; &#xBC95;&#xC6D0; &#xC804;&#xC0B0;&#xB9DD; &#xC678;&#xBD80;&#xB85C; &#xC804;&#xC1A1;&#xB418;&#xC5C8;&#xACE0;, &#xC774;&#xB97C; &#xC5ED;&#xCD94;&#xC801;&#xD558;&#xC5EC; 5,171&#xAC1C; &#xD30C;&#xC77C;(&#xC57D; 4.7GB)&#xC744; &#xBC95;&#xC6D0; &#xC804;&#xC0B0;&#xB9DD; &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xD588;&#xC5B4;&#xC694;&#x2026; &#xC774;&#xB807;&#xAC8C; &#xC720;&#xCD9C;&#xB41C; &#xD30C;&#xC77C; &#xC911;&#xC5D0;&#xB294; &#x2018;<em>&#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xC790;&#xD544;&#xC9C4;&#xC220;&#xC11C;, &#xCC44;&#xBB34;&#xC99D;&#xB300; &#xBC0F; &#xC9C0;&#xAE09;&#xBD88;&#xB2A5; &#xACBD;&#xC704;&#xC11C;, &#xD63C;&#xC778;&#xAD00;&#xACC4;&#xC99D;&#xBA85;&#xC11C;, &#xC9C4;&#xB2E8;&#xC11C; &#xB4F1;</em> &#x2019; &#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5C8;&#xC5B4;&#xC694;. &#xC720;&#xCD9C;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; 2&#xCC28; &#xD53C;&#xD574;&#xAC00; &#xC0DD;&#xAE38; &#xC218; &#xC788;&#xC73C;&#xB2C8; &#xC720;&#xC758;&#xD574;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xB124;&#xC694;&#x1F630;</p>
<p>&#xB610;, &#xC804;&#xC0B0;&#xB9DD; &#xAD00;&#xB9AC;&#xC790; &#xACC4;&#xC815;&#xC758; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB294; &#x2018;P@ssw0rd&#x2019;, &#x2018;123qwe&#x2019;, &#x2018;oracle99&#x2019; &#xB4F1; &#xC18D;&#xCE6D; &#xAE68;&#xAE30; &#xC26C;&#xC6B4; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xC5B4;&#xC694;. &#xD2B9;&#xD788; &#xC77C;&#xBD80; &#xACC4;&#xC815;&#xC740; 2016&#xB144; 8&#xC6D4;&#xBD80;&#xD130; 6&#xB144; &#xB118;&#xAC8C; &#x2018;P@ssw0rd&#x2019; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xBC14;&#xAFB8;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F440;  OMG..&#x1F631; </p>
<p>&#xD574;&#xB2F9; &#xC0AC;&#xAC74;&#xC740; &#xBD81;&#xD55C;&#xC774; &#xBC30;&#xD6C4;&#xC5D0; &#xC788;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBC1D;&#xD600;&#xC84C;&#xC5B4;&#xC694;. &#xC774;&#xBC88; &#xBC94;&#xD589;&#xC5D0; &#xC0AC;&#xC6A9;&#xB41C; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;, &#xC11C;&#xBC84; &#xACB0;&#xC81C;&#xB0B4;&#xC5ED;(&#xAC00;&#xC0C1;&#xC790;&#xC0B0;), IP &#xC8FC;&#xC18C; &#xB4F1;&#xC744; &#xAE30;&#xC874; &#xBD81;&#xD55C;&#xBC1C;&#xB85C; &#xADDC;&#xBA85;&#xB41C; &#xD574;&#xD0B9; &#xC0AC;&#xAC74;&#xACFC; &#xC885;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xBE44;&#xAD50; &#xBC0F; &#xBD84;&#xC11D;&#xD55C; &#xACB0;&#xACFC; &#xBD81;&#xD55C;&#xC758; &#xB77C;&#xC790;&#xB8E8;&#xC2A4; &#xADF8;&#xB8F9;&#xC778; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1FAE0;</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; <strong>&#xBD81;&#xD55C; IP&#xC5D0;&#xC11C; &#xB178;&#xCD9C;&#xB41C; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xC11C;&#xBC84; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xAC83;&#xB4E4;</strong></p>
</blockquote>
<p>2024.05.17 | &#xB370;&#xC77C;&#xB9AC;&#xC2DC;&#xD050; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156016">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xBD81;&#xD55C; IT &#xC778;&#xB825;&#xB4E4;&#xC774; &#xD0C0; &#xAD6D;&#xAC00;&#xB85C; &#xC704;&#xC7A5; &#xCDE8;&#xC5C5;&#xD55C;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xB4E4;&#xC5B4;&#xBCF4;&#xC168;&#xB098;&#xC694;? &#x1F440;</p>
<p>&#xCD5C;&#xADFC; &#xBBF8; &#xBC95;&#xBB34;&#xBD80;&#xAC00; &#xC804; &#xC138;&#xACC4; &#xC218;&#xC0AC;&#xAE30;&#xAD00;&#xACFC; &#xD611;&#xB825;&#xD574; &#xBD81;&#xD55C; IT &#xC778;&#xB825;&#xC758; &#xC704;&#xC7A5; &#xCDE8;&#xC5C5; &#xBC0F; &#xC0AC;&#xC774;&#xBC84; &#xD65C;&#xB3D9;&#xC744; &#xC9C0;&#xC6D0;&#xD55C; &#xD610;&#xC758;&#xB97C; &#xBC1B;&#xB294; &#xC6A9;&#xC758;&#xC790;&#xB4E4;&#xC744; &#xC0AC;&#xAE30; &#xD610;&#xC758; &#xB4F1;&#xC73C;&#xB85C; &#xAE30;&#xC18C;&#xD588;&#xB2E4;&#xACE0; &#xBC1C;&#xD45C;&#xD588;&#xC5B4;&#xC694;!</p>
<p>&#xC774;&#xB4E4;&#xC740; &#xBD81;&#xD55C;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xB3C8;&#xC744; &#xC9C0;&#xC6D0;&#xBC1B;&#xC544; &#xB178;&#xD2B8;&#xBD81;&#xC744; &#xAD6C;&#xC785;&#xD588;&#xC73C;&#xBA70;, &#xC774;&#xD6C4; &#xBD81;&#xD55C; &#xC778;&#xB825;&#xC774; &#xC774; &#xB178;&#xD2B8;&#xBD81;&#xC73C;&#xB85C; &#xC6D0;&#xACA9; &#xC811;&#xC18D;&#xD574; &#xAD6C;&#xC9C1; &#xD65C;&#xB3D9;&#xC744; &#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;&#x1FAE2; </p>
<p>&#xAD6C;&#xAE00; &#xB9E8;&#xB514;&#xC5B8;&#xD2B8;(Mandiant)&#xC758; &#xC5F0;&#xAD6C;&#xC6D0;&#xB4E4;&#xC774; &#xBD81;&#xD55C; IP &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xC11C;&#xBC84;&#xB97C; &#xCC3E;&#xC544;&#xB0B4; 1&#xB2EC; &#xAC04; &#xD2B8;&#xB798;&#xD53D;&#xC744; &#xC218;&#xC9D1;&#xD558;&#xACE0; &#xC870;&#xC0AC;&#xD55C; &#xACB0;&#xACFC;&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xC5EC;&#xB7EC; &#xAD6D;&#xAC00;&#xC5D0; &#xAE30;&#xBC18;&#xC744; &#xB454; &#xB2E4;&#xC591;&#xD55C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC790;&#xB8CC;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F632; </p>
<p><img src="/2024/05/20/clalxk/newsletter0520/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC704; &#xC0AC;&#xC9C4;&#xC740; &#xBC1C;&#xACAC;&#xB41C; &#xC790;&#xB8CC; &#xC911; &#xD558;&#xB098;&#xB85C;, &#xBD81;&#xD55C;&#xC758; &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xD130;&#xAC00; &#xC791;&#xC5C5;&#xD55C; &#xB0B4;&#xC6A9;&#xC774;&#xC5D0;&#xC694;. </p>
<p>&#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; &#xC791;&#xC5C5;&#xD55C; &#xBB38;&#xC11C;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xB2C8; &#xBBF8;&#xAD6D;&#xC758; &#x2018;&#xC778;&#xBE48;&#xC11C;&#xBE14;&#x2019;, &#xC77C;&#xBCF8;&#xC758; &#x2018;&#xB2EC;&#xB9AC;&#xC544; &#xC778; &#xBE14;&#xB8F8;&#x2018;, BBC&#xC758; &#x2019;&#xC625;&#xD1A0;&#xB11B;&#x2018; &#xB4F1;&#xC758; &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xC6A9;&#xC774; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xACE0;, &#xC791;&#xC5C5;&#xD55C; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC758; &#xC8FC;&#xC11D;&#xC774; &#xC911;&#xAD6D;&#xC5B4;&#xB85C; &#xC791;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC744; &#xBCF4;&#xC544; &#xC8FC;&#xC694; &#xC81C;&#xC791;&#xC0AC;&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; &#xADFC;&#xBB34;&#xD55C; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xBA87; &#xB2E8;&#xACC4;&#xB97C; &#xAC70;&#xCE5C; &#xD558;&#xCCAD; &#xC5C5;&#xBB34;&#xB97C; &#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xD30C;&#xC545;&#xB418;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1F631; </p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>Intel, 90&#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; 41&#xAC00;&#xC9C0;&#xC758; &#xBCF4;&#xC548; &#xAD8C;&#xACE0; &#xBC1C;&#xD45C;</strong></p>
</blockquote>
<p>2024.05.15 | SecurityWeek | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.securityweek.com/intel-publishes-41-security-advisories-for-over-90-vulnerabilities/">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/05/20/clalxk/newsletter0520/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>Intel &#xC81C;&#xD488;&#xAD70;&#xC5D0;&#xC11C; 90&#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xACE0;, &#xC774;&#xB97C; &#xD328;&#xCE58;&#xD55C; 41&#xAC1C;&#xC758; Released&#xAC00; &#xBC1C;&#xD45C;&#xB418;&#xC5C8;&#xC5B4;&#xC694;! </p>
<p>&#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810; &#xC911; &#xAC00;&#xC7A5; critical &#xD55C; &#xB4F1;&#xAE09;&#xC744; &#xBD80;&#xC5EC; &#xBC1B;&#xC740; &#xAC83;&#xC740; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">CVSS</a> 10&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">CVE-2024-22476</a> &#xC774;&#xB77C;&#xACE0; &#xD574;&#xC694; &#x1F632;  </p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xBAA8;&#xB378; &#xD06C;&#xAE30;&#xB97C; &#xC904;&#xC774;&#xACE0; CPU &#xB610;&#xB294; GPU&#xC5D0; &#xBC30;&#xD3EC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB525; &#xB7EC;&#xB2DD; &#xCD94;&#xB860; &#xC18D;&#xB3C4;&#xB97C; &#xB192;&#xC774;&#xAE30; &#xC704;&#xD574; &#xBAA8;&#xB378; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; AI &#xC81C;&#xD488;&#xC778; Neural Compressor&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;&#x1F914;</p>
<p>&#xB610;, Intel&#xC740; &#xC774; &#xCE58;&#xBA85;&#xC801;&#xC778; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC778;&#xC99D;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#x201C;&#xC6D0;&#xACA9; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xD65C;&#xC131;&#xD654;&#x201D;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xBC1D;&#xD614;&#xC5B4;&#xC694;!</p>
<p>&#xC790;&#xC138;&#xD55C; &#xD328;&#xCE58; &#xC0AC;&#xD56D;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.intel.com/content/www/us/en/security-center/default.html">&#xCC38;&#xACE0; &#xB9C1;&#xD06C;</a>&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xC138;&#xC694;! </p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><p>&#x1F5E3;&#xFE0F; <strong>&#xC720;&#xBA85; &#xD574;&#xD0B9; &#xD3EC;&#xB7FC; &#x2018;BreachForums&#x2019;, &#xAD6D;&#xC81C; &#xACF5;&#xC870;&#xB85C; &#xD3D0;&#xC1C4;</strong></p>
<p>2024.05.16 | SecurityWeek | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.securityweek.com/breachforums-shut-down-in-apparent-law-enforcement-operation/">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/05/20/clalxk/newsletter0520/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#x2018;BreachForums&#x2019; &#xB4E4;&#xC5B4;&#xBCF4;&#xC2E0; &#xBD84; &#xC788;&#xB098;&#xC694;?!</p>
<p>BreachForums&#xC740; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB2E4;&#xD06C;&#xC6F9;</a> &#xC0C1;&#xC5D0;&#xC11C; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xC790;&#xB4E4;&#xC774; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xB97C; &#xBE44;&#xB86F;&#xD55C; &#xAC01;&#xC885; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xC0AC;&#xACE0; &#xD30C;&#xB294; &#xACF3;&#xC774;&#xC5D0;&#xC694;. &#x2639;&#xFE0F; &#xD3D0;&#xC1C4;&#xB418;&#xAE30; &#xC774;&#xC804;&#xC5D0;&#xB294; &#xD558;&#xB8E8;&#xC5D0;&#xB3C4; &#xC218;&#xC2ED; &#xAC74;&#xC529; &#xC804;&#xC138;&#xACC4;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0AC;&#xACE0; &#xD30C;&#xB294; &#xAE00;&#xB4E4;&#xC774; &#xC62C;&#xB77C;&#xC654;&#xC5B4;&#xC694;.. &#x1F613; </p>
<p>&#xC774; &#xACF3;&#xC744; &#xD3D0;&#xC1C4;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB274;&#xC9C8;&#xB79C;&#xB4DC;, &#xD638;&#xC8FC;, &#xC601;&#xAD6D;, &#xC2A4;&#xC704;&#xC2A4;, &#xC6B0;&#xD06C;&#xB77C;&#xC774;&#xB098;, &#xC544;&#xC774;&#xC2AC;&#xB780;&#xB4DC; &#xB4F1;&#xACFC; FBI&#xC758; &#xAD6D;&#xC81C; &#xACF5;&#xC870; &#xC791;&#xC5C5;&#xC744; &#xD1B5;&#xD574; BreachForums&#xB97C; &#xD3D0;&#xC1C4;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F60E;</p>
<p>&#xD558;&#xC9C0;&#xB9CC;, RaidForums&#xC774; &#xD3D0;&#xC1C4;&#xB418;&#xACE0; BreachForums&#xC774; &#xC0DD;&#xACBC;&#xB4EF;&#xC774; &#xC5B8;&#xC81C; &#xB610; &#xBE44;&#xC2B7;&#xD55C; &#xC0AC;&#xC774;&#xD2B8;&#xAC00; &#xB9CC;&#xB4E4;&#xC5B4;&#xC838; &#xC6B4;&#xC601;&#xB420; &#xC9C0; &#xBAB0;&#xB77C;&#xC694; &#x2639;&#xFE0F;</p>
<h2 id="-3"><a href="#-3" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; <strong>&#xB0B4; &#xAC00;&#xC871; &#xBAA9;&#xC18C;&#xB9AC;&#xAE4C;&#xC9C0; &#xD749;&#xB0B4;&#xB0B8; AI &#xC2E0;&#xC885; &#xD53C;&#xC2F1; &#xC8FC;&#xC758;!</strong></p>
</blockquote>
<p>2024.05.16 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=129836">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/05/20/clalxk/newsletter0520/image5.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xCD5C;&#xADFC; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB525;&#xD398;&#xC774;&#xD06C;</a>, <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB525;&#xBCF4;&#xC774;&#xC2A4;</a>&#xB97C; &#xD65C;&#xC6A9;&#xD55C; AI &#xBCF4;&#xC774;&#xC2A4;&#xD53C;&#xC2F1;&#xC774; &#xC131;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xC790;&#xB140;&#xC758; &#xC5BC;&#xAD74;&#xACFC; &#xBAA9;&#xC18C;&#xB9AC;&#xB97C; &#xC870;&#xC791;&#xD574; &#xAC00;&#xC871;&#xB4E4;&#xC5D0;&#xAC8C; &#xB3C8;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xC2E0;&#xC885; AI &#xD53C;&#xC2F1;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;! </p>
<p>&#xD2B9;&#xD788; SNS&#xAC00; &#xD65C;&#xBC1C;&#xD788; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xBCF4;&#xB2C8; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xB97C; &#xC5C5;&#xB85C;&#xB4DC; &#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xAD00;&#xB9AC;&#xAC00; &#xD544;&#xC694;&#xD574;&#xC694;. &#xD2B9;&#xD788; &#xC74C;&#xC131; &#xBC0F; &#xC601;&#xC0C1;&#xBB3C;&#xC744; &#xC5C5;&#xB85C;&#xB4DC;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xB124;&#xC694;! &#x1FAE0;</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>CVSS</strong> </p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC2EC;&#xAC01;&#xC131;&#xC744; &#xD3C9;&#xAC00;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD45C;&#xC900;&#xD654;&#xB41C; &#xC810;&#xC218; &#xCCB4;&#xACC4;</p>
<p><strong>CVE-2024-22476</strong></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2024-22476">https://nvd.nist.gov/vuln/detail/CVE-2024-22476</a></p>
<p><strong>&#xB2E4;&#xD06C;&#xC6F9;</strong></p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xC778;&#xD130;&#xB137; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C;&#xB294; &#xC811;&#xADFC;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xBA70; &#xC554;&#xD638;&#xD654;&#xB41C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xC5EC; &#xD2B9;&#xC815; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;(&#xC608;: Tor, I2P &#xB4F1;)&#xB97C; &#xD1B5;&#xD574;&#xC11C;&#xB9CC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; &#xC6F9;</p>
<p><strong>&#xB525;&#xD398;&#xC774;&#xD06C;</strong></p>
<p>&#xC778;&#xACF5;&#xC9C0;&#xB2A5;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC778;&#xBB3C;&#xC758; &#xC5BC;&#xAD74;&#xC774;&#xB098; &#xD2B9;&#xC815; &#xBD80;&#xC704;&#xB97C; &#xD569;&#xC131;&#xD558;&#xB294; &#xAE30;&#xC220;</p>
<p><strong>&#xB525;&#xBCF4;&#xC774;&#xC2A4;</strong></p>
<p>&#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAE30;&#xC220;&#xB85C; &#xD2B9;&#xC815;&#xD55C; &#xC0AC;&#xB78C;&#xC758; &#xBAA9;&#xC18C;&#xB9AC;&#xB97C; &#xBC1C;&#xD654;&#xC5D0; &#xD569;&#xC131;&#xD55C; &#xAE30;&#xC220; </p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=129881">&#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xC0AC;&#xAC74; &#xAD00;&#xB828; &#xC911;&#xC694; &#xC54C;&#xB9BC;? KISA &#xC0AC;&#xCE6D; &#xD53C;&#xC2F1; &#xBA54;&#xC77C; &#xC720;&#xD3EC;&#x2026; &#xBD81;&#xD55C;&#xBC1C; &#xACF5;&#xACA9; &#xCD94;&#xC815;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=129869">&#xBBF8;&#xAD6D;&#xC5D0;&#xC11C; &#xBD81;&#xD55C; &#xC815;&#xAD8C; &#xBA39;&#xC5EC;&#xC0B4;&#xB9AC;&#xB824; &#xC2E0;&#xC6D0; &#xB3C4;&#xC6A9;&#xD588;&#xB358; &#xC77C;&#xB2F9; &#xCCB4;&#xD3EC;&#xB3FC;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156059">D-Link &#xB77C;&#xC6B0;&#xD130;&#xC640; ivanti EPMM &#xC2DC;&#xC2A4;&#xD15C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xC8FC;&#xC758;&#x2026;&#xD574;&#xD0B9;&#xACFC; &#xC815;&#xBCF4;&#xC720;&#xCD9C; &#xC6B0;&#xB824;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156027">Apple, &#xC571;&#xC2A4;&#xD1A0;&#xC5B4; &#xBC0F; &#xC560;&#xD50C; &#xD398;&#xC774; &#xBCF4;&#xC548; &#xAC15;&#xD654;&#x2026;&#x201D;4&#xB144;&#xAC04; 70&#xC5B5; &#xB2EC;&#xB7EC; &#xADDC;&#xBAA8; &#xC571;&#xC2A4;&#xD1A0;&#xC5B4; &#xBD80;&#xC815; &#xAD6C;&#xB9E4; &#xCC28;&#xB2E8;&#x201D;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.yna.co.kr/view/AKR20240512045400530">&#x2018;&#xACFC;&#xC9D5;&#xAE08; 75&#xC5B5;&#x2019;&#x2026;&#xB9E4;&#xC11C;&#xC6CC;&#xC9C4; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xBCF4;&#xD638; &#xADDC;&#xC81C;, &#xACF5;&#xACF5;&#xAE30;&#xAD00;&#xC740; &#xC81C;&#xC678;?</a></p>
<h2 id="5&#xC6D4;-&#xAD50;&#xC721;-&#x1F425;"><a href="#5&#xC6D4;-&#xAD50;&#xC721;-&#x1F425;" class="headerlink" title="5&#xC6D4; &#xAD50;&#xC721; &#x1F425;"></a><strong>5&#xC6D4; &#xAD50;&#xC721;</strong> &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.kitribob.kr/board/detail/1/9079?current_page=1&amp;per_page=15&amp;st=subject&amp;q=#">BoB 13&#xAE30;</a> | KITRI | 2024.05.28&#xAE4C;&#xC9C0; &#xC811;&#xC218;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/clalxk/">clalxk</a>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_clalxk.jpg" srcset="/img/loading.gif" alt="clalxk">
                  </div>

                  <div class="link-text">
                    <div class="link-title">clalxk</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/clalxk">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/05/22/pwndorei/2024-05-22/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-4367 : PDF.jsì˜ ìž„ì˜ì˜ Javascript ì½”ë“œ ì‹¤í–‰ ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/05/19/l0ch/2024-05-19/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-32002: gitì˜ ì›ê²© ì½”ë“œ ì‹¤í–‰ ì·¨ì•½ì </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/05/20/clalxk/newsletter0520/';
        this.page.identifier = '/2024/05/20/clalxk/newsletter0520/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] ë²•ì›.. í•´í‚¹ ë‹¹í•˜ë‹¤?!&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
