

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/&#34;&gt;https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;cFS version Aquila(Releases)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;NASA&amp;#xC758; cFS(Core Flight System)&amp;#xB294; &amp;#xC704;&amp;#xC131;, &amp;#xC6B0;&amp;#xC8FC; &amp;#xD0D0;&amp;#xC0AC;&amp;#xC120;, &amp;#xAE30;&amp;#xD0C0; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xCD5C;&amp;#xADFC; cFS&amp;#xC758; Memory Management(MM) &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xAC70;&amp;#xBD80;(DoS, Denial of Service) &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; MM &amp;#xBAA8;&amp;#xB4C8;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC77D;&amp;#xAE30; &amp;#xB610;&amp;#xB294; &amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C;, &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0;&amp;#xB97C; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xC8FC;&amp;#xC694; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MM_Load&lt;/code&gt;&lt;/strong&gt;: &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC77D;&amp;#xAE30; &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MM_Dump&lt;/code&gt;&lt;/strong&gt;: &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xD568;&amp;#xC218; &amp;#xBAA8;&amp;#xB450; &amp;#xC678;&amp;#xBD80; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xB098; &amp;#xBA85;&amp;#xB839;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA70;, &amp;#xAC80;&amp;#xC99D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C; &amp;#xC811;&amp;#xADFC; &amp;#xC2DC; &lt;strong&gt;Segmentation fault&lt;/strong&gt;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Proof-of-Concept&#34;&gt;&lt;a href=&#34;#Proof-of-Concept&#34; class=&#34;headerlink&#34; title=&#34;Proof of Concept&#34;&gt;&lt;/a&gt;Proof of Concept&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&lt;code&gt;MM_DUMP_MEM_TO_FILE_CC&lt;/code&gt;&lt;/strong&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xC218;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB364;&amp;#xD504;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;, &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD06C;&amp;#xAE30;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xC7A5;&amp;#xB420; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &lt;strong&gt;cFS&lt;/strong&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xC5B4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xAC70;&amp;#xBD80;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &lt;strong&gt;mm/fsw/inc/mm_msg.h&lt;/strong&gt; &amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &lt;strong&gt;MM_DumpMemToFileCmd&lt;/strong&gt; (mm/fsw/src/mm_dump.c)&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xAC80;&amp;#xC99D;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MM_ResolveSymAddr&lt;/strong&gt; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; &lt;strong&gt;Valid = True&lt;/strong&gt;&amp;#xB97C; &lt;strong&gt;**&amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 525~526&amp;#xD589;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2EC;&amp;#xBCFC; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xB110; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774;&amp;#xBA74; &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xC808;&amp;#xB300; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; True&amp;#xB97C; &lt;/strong&gt;&amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xB354;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &lt;strong&gt;MM_VerifyLoadDumpParams&lt;/strong&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC218;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC791;&amp;#xC740;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xD6C4; &lt;strong&gt;CFE_PSP_MemValidateRange&lt;/strong&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; PSP &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0; &amp;#xC18D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PSP &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC740; &amp;#xBD80;&amp;#xD305; &amp;#xC2DC; &lt;strong&gt;CFE_PSP_SetupReservedMemoryMap&lt;/strong&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xC758;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;strong&gt;.&lt;/strong&gt; Linux &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC740; &amp;#xC804;&amp;#xCCB4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC77D;&amp;#xAE30;/&amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; PSP&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.SymAddress.Offset = SrcAddress;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC8FC;&amp;#xC18C;(&lt;code&gt;SrcAddress&lt;/code&gt;)&amp;#xAC00; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;code&gt;SymAddress&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xB0B4; &lt;code&gt;Offset&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.MemType = CmdPtr-&amp;gt;Payload.MemType;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&lt;strong&gt;(&lt;/strong&gt;&lt;code&gt;MemType&lt;/code&gt;&lt;strong&gt;)&lt;/strong&gt; (&amp;#xC608;: RAM, EEPROM)&amp;#xC774; &amp;#xBA85;&amp;#xB839; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.NumOfBytes = CmdPtr-&amp;gt;Payload.NumOfBytes;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;(&lt;code&gt;NumOfBytes&lt;/code&gt;)&amp;#xAC00; &amp;#xBA85;&amp;#xB839; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; mcp750-vxworks&amp;#xB9CC;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Linux&amp;#xC640; &amp;#xB300;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C; mcp750-vxworks&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; PSP &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xB354;&amp;#xC6B1; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xB9CC;&amp;#xC744; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC601;&amp;#xC5ED;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;MM_DumpMemToFileCmd&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; RAM &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xACC4;&amp;#xC18D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC548;&amp;#xB0B4;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5D0;&amp;#xC11C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC774; &lt;strong&gt;MM_RAM&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;MM_EEPROM&lt;/strong&gt;&amp;#xC774;&amp;#xBA74; , &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;MM_DumpMemToFile&amp;#xC744;&lt;/strong&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC774;&amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &lt;code&gt;memcpy&lt;/code&gt;&amp;#xC758; &amp;#xC18C;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &lt;code&gt;memcpy&lt;/code&gt; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC94;&amp;#xC704; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xC5EC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;cmdUtil&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; MM_DUMP_MEM_TO_FILE_CC &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;Segmentation fault&lt;/strong&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;https://visionspace.com/wp-content/uploads/2025/03/image-57-1024x627.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD654;&amp;#xBA74; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC774;&amp;#xB358; &lt;strong&gt;cSF&lt;/strong&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778; 0x40 &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC790; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2025-25372&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2025-25372&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] CVE-2025-25372: cFS 메모리 관리 모듈의 부적절한 메모리 접근 검증으로 인한 서비스 거부 취약점 - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/&#34;&gt;https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;cFS version Aquila(Releases)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;NASA&amp;#xC758; cFS(Core Flight System)&amp;#xB294; &amp;#xC704;&amp;#xC131;, &amp;#xC6B0;&amp;#xC8FC; &amp;#xD0D0;&amp;#xC0AC;&amp;#xC120;, &amp;#xAE30;&amp;#xD0C0; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xCD5C;&amp;#xADFC; cFS&amp;#xC758; Memory Management(MM) &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xAC70;&amp;#xBD80;(DoS, Denial of Service) &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; MM &amp;#xBAA8;&amp;#xB4C8;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC77D;&amp;#xAE30; &amp;#xB610;&amp;#xB294; &amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xB54C;, &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0;&amp;#xB97C; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xC8FC;&amp;#xC694; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MM_Load&lt;/code&gt;&lt;/strong&gt;: &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC77D;&amp;#xAE30; &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MM_Dump&lt;/code&gt;&lt;/strong&gt;: &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xD568;&amp;#xC218; &amp;#xBAA8;&amp;#xB450; &amp;#xC678;&amp;#xBD80; &amp;#xC785;&amp;#xB825;&amp;#xC774;&amp;#xB098; &amp;#xBA85;&amp;#xB839;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA70;, &amp;#xAC80;&amp;#xC99D;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C; &amp;#xC811;&amp;#xADFC; &amp;#xC2DC; &lt;strong&gt;Segmentation fault&lt;/strong&gt;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Proof-of-Concept&#34;&gt;&lt;a href=&#34;#Proof-of-Concept&#34; class=&#34;headerlink&#34; title=&#34;Proof of Concept&#34;&gt;&lt;/a&gt;Proof of Concept&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&lt;code&gt;MM_DUMP_MEM_TO_FILE_CC&lt;/code&gt;&lt;/strong&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xC218;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB364;&amp;#xD504;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;, &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD06C;&amp;#xAE30;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xC7A5;&amp;#xB420; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &lt;strong&gt;cFS&lt;/strong&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xC5B4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xAC70;&amp;#xBD80;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &lt;strong&gt;mm/fsw/inc/mm_msg.h&lt;/strong&gt; &amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &lt;strong&gt;MM_DumpMemToFileCmd&lt;/strong&gt; (mm/fsw/src/mm_dump.c)&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xAC80;&amp;#xC99D;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MM_ResolveSymAddr&lt;/strong&gt; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; &lt;strong&gt;Valid = True&lt;/strong&gt;&amp;#xB97C; &lt;strong&gt;**&amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 525~526&amp;#xD589;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2EC;&amp;#xBCFC; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xB110; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774;&amp;#xBA74; &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xC808;&amp;#xB300; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; True&amp;#xB97C; &lt;/strong&gt;&amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC785;&amp;#xB825;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xB41C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xB354;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &lt;strong&gt;MM_VerifyLoadDumpParams&lt;/strong&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0;, &amp;#xC694;&amp;#xCCAD;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC218;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC791;&amp;#xC740;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xD6C4; &lt;strong&gt;CFE_PSP_MemValidateRange&lt;/strong&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; PSP &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0; &amp;#xC18D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PSP &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC740; &amp;#xBD80;&amp;#xD305; &amp;#xC2DC; &lt;strong&gt;CFE_PSP_SetupReservedMemoryMap&lt;/strong&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xC758;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;strong&gt;.&lt;/strong&gt; Linux &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC740; &amp;#xC804;&amp;#xCCB4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC77D;&amp;#xAE30;/&amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; PSP&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xC124;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.SymAddress.Offset = SrcAddress;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC8FC;&amp;#xC18C;(&lt;code&gt;SrcAddress&lt;/code&gt;)&amp;#xAC00; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;code&gt;SymAddress&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xB0B4; &lt;code&gt;Offset&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.MemType = CmdPtr-&amp;gt;Payload.MemType;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&lt;strong&gt;(&lt;/strong&gt;&lt;code&gt;MemType&lt;/code&gt;&lt;strong&gt;)&lt;/strong&gt; (&amp;#xC608;: RAM, EEPROM)&amp;#xC774; &amp;#xBA85;&amp;#xB839; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&lt;code&gt;MMFileHeader.NumOfBytes = CmdPtr-&amp;gt;Payload.NumOfBytes;&lt;/code&gt;&lt;/strong&gt;:&lt;ul&gt;
&lt;li&gt;&amp;#xB364;&amp;#xD504;&amp;#xD560; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;(&lt;code&gt;NumOfBytes&lt;/code&gt;)&amp;#xAC00; &amp;#xBA85;&amp;#xB839; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; mcp750-vxworks&amp;#xB9CC;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Linux&amp;#xC640; &amp;#xB300;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC5B8;&amp;#xAE09;&amp;#xB41C; mcp750-vxworks&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; PSP &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xB354;&amp;#xC6B1; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xB9CC;&amp;#xC744; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC601;&amp;#xC5ED;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;MM_DumpMemToFileCmd&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; RAM &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xACC4;&amp;#xC18D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xC548;&amp;#xB0B4;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5D0;&amp;#xC11C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC720;&amp;#xD615;&amp;#xC774; &lt;strong&gt;MM_RAM&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;MM_EEPROM&lt;/strong&gt;&amp;#xC774;&amp;#xBA74; , &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;strong&gt;MM_DumpMemToFile&amp;#xC744;&lt;/strong&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt; &amp;#xC774;&amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &lt;code&gt;memcpy&lt;/code&gt;&amp;#xC758; &amp;#xC18C;&amp;#xC2A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; &lt;code&gt;memcpy&lt;/code&gt; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC94;&amp;#xC704; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xD638;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xC5EC; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD14C;&amp;#xC774;&amp;#xC158; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;cmdUtil&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; MM_DUMP_MEM_TO_FILE_CC &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &lt;strong&gt;Segmentation fault&lt;/strong&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;https://visionspace.com/wp-content/uploads/2025/03/image-57-1024x627.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD654;&amp;#xBA74; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC774;&amp;#xB358; &lt;strong&gt;cSF&lt;/strong&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778; 0x40 &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB364;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC790; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2025-25372&#34;&gt;https://nvd.nist.gov/vuln/detail/CVE-2025-25372&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/05/01/ouya77/2025-05-01/">

  <title>[하루한줄] CVE-2025-25372: cFS 메모리 관리 모듈의 부적절한 메모리 접근 검증으로 인한 서비스 거부 취약점 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-05-01 22:05" pubdate>
      2025년 5월 1일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.3k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      25
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] CVE-2025-25372: cFS 메모리 관리 모듈의 부적절한 메모리 접근 검증으로 인한 서비스 거부 취약점</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/">https://visionspace.com/nasa-cfs-version-aquila-software-vulnerability-assessment/</a></p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>cFS version Aquila(Releases)</li>
</ul>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>NASA&#xC758; cFS(Core Flight System)&#xB294; &#xC704;&#xC131;, &#xC6B0;&#xC8FC; &#xD0D0;&#xC0AC;&#xC120;, &#xAE30;&#xD0C0; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xD65C;&#xC6A9;&#xB418;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;.  &#xCD5C;&#xADFC; cFS&#xC758; Memory Management(MM) &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; &#xC11C;&#xBE44;&#xC2A4; &#xAC70;&#xBD80;(DoS, Denial of Service) &#xACF5;&#xACA9;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; MM &#xBAA8;&#xB4C8;&#xC774; &#xBA54;&#xBAA8;&#xB9AC; &#xC77D;&#xAE30; &#xB610;&#xB294; &#xC4F0;&#xAE30; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD560; &#xB54C;, &#xC811;&#xADFC;&#xD558;&#xB824;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xC720;&#xD6A8;&#xD55C;&#xC9C0;&#xB97C; &#xC801;&#xC808;&#xD788; &#xAC80;&#xC99D;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xCDE8;&#xC57D;&#xD55C; &#xC8FC;&#xC694; &#xD568;&#xC218;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li><strong><code>MM_Load</code></strong>: &#xBA54;&#xBAA8;&#xB9AC; &#xC77D;&#xAE30; &#xAD00;&#xB828; &#xD568;&#xC218;</li>
<li><strong><code>MM_Dump</code></strong>: &#xBA54;&#xBAA8;&#xB9AC; &#xC4F0;&#xAE30; &#xAD00;&#xB828; &#xD568;&#xC218;</li>
</ul>
<p>&#xC774; &#xB450; &#xD568;&#xC218; &#xBAA8;&#xB450; &#xC678;&#xBD80; &#xC785;&#xB825;&#xC774;&#xB098; &#xBA85;&#xB839;&#xC5D0; &#xB530;&#xB77C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC9C1;&#xC811; &#xC811;&#xADFC;&#xD558;&#xAC8C; &#xB418;&#xBA70;, &#xAC80;&#xC99D;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC8FC;&#xC18C; &#xC811;&#xADFC; &#xC2DC; <strong>Segmentation fault</strong>&#xB97C; &#xC720;&#xBC1C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Proof-of-Concept"><a href="#Proof-of-Concept" class="headerlink" title="Proof of Concept"></a>Proof of Concept</h3><p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; <strong><code>MM_DUMP_MEM_TO_FILE_CC</code></strong> &#xBA85;&#xB839;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xC704;&#xCE58;&#xC5D0;&#xC11C; &#xC9C0;&#xC815;&#xB41C; &#xC218;&#xC758; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xD30C;&#xC77C;&#xC5D0; &#xB364;&#xD504;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xD568;&#xC218;&#xB294; &#xC18C;&#xC2A4; &#xC8FC;&#xC18C;, &#xC8FC;&#xC18C; &#xBC94;&#xC704;, &#xC694;&#xCCAD;&#xB41C; &#xB370;&#xC774;&#xD130; &#xD06C;&#xAE30;, &#xADF8;&#xB9AC;&#xACE0; &#xC800;&#xC7A5;&#xB420; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xB97C; &#xAC80;&#xC99D;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB7EC;&#xD55C; &#xBAA8;&#xB4E0; &#xAC80;&#xC99D;&#xC774; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xC218;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xC544; <strong>cFS</strong> &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xAC00; &#xC911;&#xB2E8;&#xB418;&#xC5B4; &#xC11C;&#xBE44;&#xC2A4; &#xAC70;&#xBD80;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA85;&#xB839; &#xAD6C;&#xC870;&#xB294; <strong>mm/fsw/inc/mm_msg.h</strong> &#xC5D0; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; :</p>
<p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xAD6C;&#xC870;&#xB294; <strong>MM_DumpMemToFileCmd</strong> (mm/fsw/src/mm_dump.c)&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xAC01; &#xD544;&#xB4DC;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xAC80;&#xC99D;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB364;&#xD504;&#xD560; &#xC2EC;&#xBCFC;&#xB9AD; &#xC8FC;&#xC18C;&#xC5D0;&#xC11C; &#xC77C;&#xC5B4;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><strong>MM_ResolveSymAddr</strong> &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xB97C; &#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC624;&#xD504;&#xC14B;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xACBD;&#xC6B0; &#xC774; &#xD568;&#xC218;&#xB294; &#xD56D;&#xC0C1; <strong>Valid = True</strong>&#xB97C; <strong>**&#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. 525~526&#xD589;&#xC5D0;&#xC11C; &#xC2EC;&#xBCFC; &#xC774;&#xB984;&#xC774; &#xB110; &#xBB38;&#xC790;&#xC5F4;&#xC774;&#xBA74; &#xC785;&#xB825;&#xB41C; &#xC624;&#xD504;&#xC14B;&#xC744; &#xC808;&#xB300; &#xC8FC;&#xC18C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; True&#xB97C; </strong>&#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xC804;&#xC1A1;&#xB41C; &#xC2EC;&#xBCFC;&#xC758; &#xC8FC;&#xC18C;&#xC640; &#xC624;&#xD504;&#xC14B;&#xC744; &#xB354;&#xD55C; &#xAC12;&#xC744; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0; &#xB2E4;&#xC74C; <strong>MM_VerifyLoadDumpParams</strong>&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%205.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774; &#xD568;&#xC218;&#xB294; &#xBA3C;&#xC800; &#xC120;&#xD0DD;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC720;&#xD615;&#xC774; &#xC720;&#xD6A8;&#xD55C;&#xC9C0;, &#xC694;&#xCCAD;&#xB41C; &#xBC14;&#xC774;&#xD2B8; &#xC218;&#xAC00; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC; &#xC720;&#xD615;&#xC758; &#xCD5C;&#xB300; &#xD06C;&#xAE30;&#xBCF4;&#xB2E4; &#xC791;&#xC740;&#xC9C0; &#xD655;&#xC778;&#xD55C; &#xD6C4; <strong>CFE_PSP_MemValidateRange</strong>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC8FC;&#xC18C;&#xAC00; PSP &#xBA54;&#xBAA8;&#xB9AC; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xC720;&#xD6A8;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xBC94;&#xC704;&#xC5D0; &#xC18D;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>PSP &#xD14C;&#xC774;&#xBE14;&#xC740; &#xBD80;&#xD305; &#xC2DC; <strong>CFE_PSP_SetupReservedMemoryMap</strong>&#xC5D0; &#xC758;&#xD574; &#xC815;&#xC758;&#xB429;&#xB2C8;&#xB2E4;<strong>.</strong> Linux &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xACBD;&#xC6B0;, &#xAE30;&#xBCF8; &#xC124;&#xC815;&#xC740; &#xC804;&#xCCB4; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xC77D;&#xAE30;/&#xC4F0;&#xAE30; &#xC791;&#xC5C5;&#xC5D0; &#xC720;&#xD6A8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xC740; PSP&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xD14C;&#xC774;&#xBE14; &#xC124;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
<ul>
<li><strong><code>MMFileHeader.SymAddress.Offset = SrcAddress;</code></strong>:<ul>
<li>&#xB364;&#xD504;&#xD560; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC2DC;&#xC791; &#xC8FC;&#xC18C;(<code>SrcAddress</code>)&#xAC00; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xC758; <code>SymAddress</code> &#xAD6C;&#xC870;&#xCCB4; &#xB0B4; <code>Offset</code> &#xD544;&#xB4DC;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong><code>MMFileHeader.MemType = CmdPtr-&gt;Payload.MemType;</code></strong>:<ul>
<li>&#xB364;&#xD504;&#xD560; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xD0C0;&#xC785;<strong>(</strong><code>MemType</code><strong>)</strong> (&#xC608;: RAM, EEPROM)&#xC774; &#xBA85;&#xB839; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xCD94;&#xCD9C;&#xB418;&#xC5B4; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><strong><code>MMFileHeader.NumOfBytes = CmdPtr-&gt;Payload.NumOfBytes;</code></strong>:<ul>
<li>&#xB364;&#xD504;&#xD560; &#xB370;&#xC774;&#xD130;&#xC758; &#xD06C;&#xAE30;(<code>NumOfBytes</code>)&#xAC00; &#xBA85;&#xB839; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xCD94;&#xCD9C;&#xB418;&#xC5B4; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p>&#xC774;&#xB294; &#xB2E4;&#xB978; &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xC5D0;&#xB3C4; &#xD574;&#xB2F9;&#xB418;&#xB294;&#xB370;, &#xC5EC;&#xAE30;&#xC11C;&#xB294; mcp750-vxworks&#xB9CC;&#xC774; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC81C;&#xD55C;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>Linux&#xC640; &#xB300;&#xC870;&#xC801;&#xC73C;&#xB85C;, &#xC5B8;&#xAE09;&#xB41C; mcp750-vxworks&#xC640; &#xAC19;&#xC740; &#xD2B9;&#xC815; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; PSP &#xBA54;&#xBAA8;&#xB9AC; &#xD14C;&#xC774;&#xBE14;&#xC774; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <strong>&#xB354;&#xC6B1; &#xC81C;&#xD55C;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xB9CC;&#xC744; &#xC720;&#xD6A8;&#xD55C; &#xC601;&#xC5ED;&#xC73C;&#xB85C; &#xC815;&#xC758;</strong>&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD568;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><strong>MM_DumpMemToFileCmd</strong>&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xB41C; &#xBAA8;&#xB4E0; RAM &#xC8FC;&#xC18C;&#xB294; &#xAC80;&#xC99D;&#xC744; &#xD1B5;&#xACFC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xC774; &#xACC4;&#xC18D;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xB364;&#xD504;&#xB97C; &#xC548;&#xB0B4;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB420; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xB97C; &#xC815;&#xC758;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA85;&#xB839;&#xC5D0;&#xC11C; &#xC120;&#xD0DD;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC720;&#xD615;&#xC774; <strong>MM_RAM</strong> &#xB610;&#xB294; <strong>MM_EEPROM</strong>&#xC774;&#xBA74; , &#xC774;&#xC804;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; <strong>MM_DumpMemToFile&#xC744;</strong> &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
<p> &#xC774;&#xB54C; &#xD30C;&#xC77C; &#xD5E4;&#xB354;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xC624;&#xD504;&#xC14B;&#xC744; <code>memcpy</code>&#xC758; &#xC18C;&#xC2A4; &#xD3EC;&#xC778;&#xD130;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30;&#xC5D0; <code>memcpy</code> &#xC791;&#xC5C5;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC94;&#xC704; &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xBCF4;&#xD638;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xBCF5;&#xC0AC;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD558;&#xC5EC; &#xC138;&#xADF8;&#xBA3C;&#xD14C;&#xC774;&#xC158; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>cmdUtil&#xACFC; &#xAC19;&#xC740; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; MM_DUMP_MEM_TO_FILE_CC &#xBA85;&#xB839;&#xC744; &#xD638;&#xCD9C;&#xD558;&#xBA74; <strong>Segmentation fault</strong>&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="https://visionspace.com/wp-content/uploads/2025/03/image-57-1024x627.png" srcset="/img/loading.gif" alt></p>
<p>&#xD654;&#xBA74; &#xC0C1;&#xB2E8;&#xC5D0;&#xC11C; &#xC2E4;&#xD589; &#xC911;&#xC774;&#xB358; <strong>cSF</strong> &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xAC00; &#xC720;&#xD6A8;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC8FC;&#xC18C;&#xC778; 0x40 &#xC8FC;&#xC18C;&#xC5D0;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC; &#xB364;&#xD504; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xC790; &#xC885;&#xB8CC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2025-25372">https://nvd.nist.gov/vuln/detail/CVE-2025-25372</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/NASA-cFS/">NASA cFS</a>
                  
                  <a class="hover-with-bg" href="/tags/Memory-Management/">Memory Management</a>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/CVE-2025-25372/">CVE-2025-25372</a>
                  
                  <a class="hover-with-bg" href="/tags/DoS/">DoS</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/05/03/j0ker/2025-05-03/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2024-26809 : Linux Kernel Netfilter의 Use-After-Free로 인한 LPE 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/04/30/clalxk/CVE-2025-1094/">
                    <span class="hidden-mobile">[하루한줄] CVE-2025-1094: PostgreSQL 14.15의 SQL 인젝션 취약점으로 인한 RCE</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/05/01/OUYA77/2025-05-01/';
        this.page.identifier = '/2025/05/01/OUYA77/2025-05-01/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] CVE-2025-25372: cFS 메모리 관리 모듈의 부적절한 메모리 접근 검증으로 인한 서비스 거부 취약점&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
