

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;[Research] &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB358; &amp;#xB3C4;&amp;#xC911; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB358; &amp;#xC810;&amp;#xACFC; &amp;#xB2F5;&amp;#xBCC0;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB41C; &amp;#xC810;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;-&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;-&amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;-&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;-&amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 4&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Q1-&amp;#xD37C;&amp;#xC9D5;-&amp;#xC774;&amp;#xC804;-&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744;-&amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34;&gt;&lt;a href=&#34;#Q1-&amp;#xD37C;&amp;#xC9D5;-&amp;#xC774;&amp;#xC804;-&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744;-&amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34; class=&#34;headerlink&#34; title=&#34;Q1. &amp;#xD37C;&amp;#xC9D5; &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&#34;&gt;&lt;/a&gt;Q1. &amp;#xD37C;&amp;#xC9D5; &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222248949.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222248949&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCD94;&amp;#xD6C4; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB0B4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &lt;strong&gt;&amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xAE30; &amp;#xD3B8;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; string search&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xB0B4;&amp;#xAC00; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC5B4;&amp;#xB290; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xB123;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &lt;strong&gt;&amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54C;&amp;#xAE30; &amp;#xC27D;&amp;#xB2E4;.&lt;/strong&gt; &amp;#xB77C;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB85C;&amp;#xB4DC;&amp;#xB77C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? (&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;? &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;?) &lt;ul&gt;
&lt;li&gt;&amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q2-ECX-&amp;#xAC12;&amp;#xC774;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;-&amp;#xC800;&amp;#xC7A5;&#34;&gt;&lt;a href=&#34;#Q2-ECX-&amp;#xAC12;&amp;#xC774;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;-&amp;#xC800;&amp;#xC7A5;&#34; class=&#34;headerlink&#34; title=&#34;Q2. ECX &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&#34;&gt;&lt;/a&gt;Q2. ECX &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222312219.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222312219&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;ecx &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;ecx &amp;#xAC12;&amp;#xC744; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB610; ecx&amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;ecx&amp;#xAC12;&amp;#xC774; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E5;&amp;#xC2A4; &amp;#xC5D0;&amp;#xB514;&amp;#xD130; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB2E4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; ecx&amp;#xAC12;&amp;#xC774; &amp;#xD328;&amp;#xD134;&amp;#xB300;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30;&amp;#xB85C;&amp;#xB294; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC2DC; &amp;#xBC18;&amp;#xBCF5; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB85C; &amp;#xC54C;&amp;#xACE0;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; eip, esp, ebp &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xAC12;&amp;#xC744; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB54C;&amp;#xB3C4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;call ecx &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; eip&amp;#xAC00; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xB9C8;&amp;#xC74C;&amp;#xB300;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q3-Windbg&amp;#xC5D0;&amp;#xC11C;-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;-&amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Q3-Windbg&amp;#xC5D0;&amp;#xC11C;-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;-&amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Q3. Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Q3. Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222328034.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222328034&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xD0C0;&amp;#xB294; &lt;code&gt;IMLodader + 0x357c&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC12;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294;&amp;#xAC74;&amp;#xC9C0;? (&amp;#xD568;&amp;#xC218; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xBD84;? &amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158; &amp;#xC8FC;&amp;#xC18C;? &amp;#xBD84;&amp;#xAE30;&amp;#xD560;&amp;#xB54C;&amp;#xC758; &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;?)&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2E4;&amp;#xD589; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB05D;&amp;#xB09C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4; &amp;#xD639;&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC9C0;&amp;#xC810; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;ul&gt;
&lt;li&gt;&amp;#xB300;&amp;#xCCB4;&amp;#xB85C; Warning&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA70; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC624;&amp;#xC5FC;&amp;#xB418;&amp;#xC5B4; kb &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC785;&amp;#xB825; &amp;#xC2DC; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xB5A0; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xB4F1; &amp;#xD310;&amp;#xB2E8;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q4-&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;-&amp;#xC2DC;&amp;#xC5D0;-&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;-&amp;#xBD80;&amp;#xBD84;&amp;#xC744;-&amp;#xBAA8;&amp;#xB450;-0x41&amp;#xB85C;-&amp;#xBC14;&amp;#xAFB8;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34;&gt;&lt;a href=&#34;#Q4-&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;-&amp;#xC2DC;&amp;#xC5D0;-&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;-&amp;#xBD80;&amp;#xBD84;&amp;#xC744;-&amp;#xBAA8;&amp;#xB450;-0x41&amp;#xB85C;-&amp;#xBC14;&amp;#xAFB8;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34; class=&#34;headerlink&#34; title=&#34;Q4. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xC5D0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xC774;&amp;#xC720;&#34;&gt;&lt;/a&gt;Q4. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xC5D0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915223000840.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915223000840&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xC168;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74;&amp;#xC740; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD588;&amp;#xB358; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC804;&amp;#xCCB4;&amp;#xB85C; 0x41&amp;#xB85C; &amp;#xCC44;&amp;#xC6B4; &amp;#xAC83;&amp;#xC778;&amp;#xAC00;&amp;#xC694;?&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xD5E4;&amp;#xB354; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; 0x41&amp;#xB85C; &amp;#xCC44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; 0x41&amp;#xB85C; &amp;#xC804;&amp;#xBD80; &amp;#xBC14;&amp;#xAFBC;&amp;#xB4A4;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? (eax&amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;..? &amp;#xAC12;&amp;#xC774; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#x2026;? &amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xB984;&amp;#xB300;&amp;#xB85C; &amp;#xB0B4;&amp;#xB9B0; &amp;#xACB0;&amp;#xB860;&amp;#xC740;, &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xC815;&amp;#xBCF4;(&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;)&amp;#xB85C; &amp;#xB9D0;&amp;#xBBF8;&amp;#xC554;&amp;#xC544; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC778;&amp;#xB370; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xB3C4; &amp;#xB420;&amp;#xC9C0;? &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q5-&amp;#xD30C;&amp;#xC77C;&amp;#xC774;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C;-&amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Q5-&amp;#xD30C;&amp;#xC77C;&amp;#xC774;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C;-&amp;#xC704;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Q5. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Q5. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;? (&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC0C1;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;??) &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBDF0;&amp;#xC5B4;&amp;#xB294; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xAE30;&amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBCF4;&amp;#xAE38; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBDF0;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC62C;&amp;#xB824; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB610;&amp;#xD55C; &amp;#xC774; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/strong&gt;&amp;#xB97C; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC774; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xAC12;&amp;#xC744; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xAE30;&amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB85C; &amp;#xB9D0;&amp;#xBBF8;&amp;#xC554;&amp;#xC544; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC77C; (&amp;#xC775;&amp;#xC2A4;? &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;..?) &amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xAC10;&amp;#xC774; &amp;#xC7A1;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xD615;&amp;#xB41C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xD070; &amp;#xAC12;&amp;#xC744; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xAC12;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xAC8C;&amp;#xB418;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC81C;&amp;#xC77C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB97C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xAF2D; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q6-&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;-WARNING&#34;&gt;&lt;a href=&#34;#Q6-&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;-WARNING&#34; class=&#34;headerlink&#34; title=&#34;Q6. &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&#34;&gt;&lt;/a&gt;Q6. &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224007813.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915224007813&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&amp;#xC740; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC9C4; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;&amp;#xACE0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC8C; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xBABB;&amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xCABD;&amp;#xC5D0; &amp;#xB098;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; WARNING&amp;#xC744; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xCABD;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xAC00;&amp;#xC694; &amp;#xC804;&amp;#xBD80;&amp;#xB2E4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q7-&amp;#xBD84;&amp;#xC11D;-&amp;#xC2DC;&amp;#xC791;-&amp;#xC9C0;&amp;#xC810;-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Q7-&amp;#xBD84;&amp;#xC11D;-&amp;#xC2DC;&amp;#xC791;-&amp;#xC9C0;&amp;#xC810;-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Q7. &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810; &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Q7. &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810; &amp;#xCC3E;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224030807.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915224030807&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC740; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xB294;&amp;#xB370;. &amp;#xC774;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;??&lt;ul&gt;
&lt;li&gt;&amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0D1;-&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xCB49; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xBC14;&amp;#xD140;-&amp;#xC5C5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xC9C0;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD0C0;&amp;#xACE0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xD568;&amp;#xC218; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xAC70;&amp;#xCE60;&amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; Q1-1&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; string search&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB290;&amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;BM &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAC70;&amp;#xB098;, &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;, &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xC911;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC70;&amp;#xB098; &amp;#xBCF4;&amp;#xB294; &amp;#xC774;&amp;#xC720;..(&lt;code&gt;InLoader+0x2590&lt;/code&gt;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0;.. ub&amp;#xB85C; &amp;#xADF8; &amp;#xC8FC;&amp;#xBCC0; &amp;#xC720;&amp;#xC694;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;..) &amp;#xC870;&amp;#xCC28; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#x2018;BM&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; dib &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xAC00; &amp;#x2018;BM&amp;#x2019;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xB85C;&amp;#xB4DC;&amp;#xC2DC;&amp;#xD0AC; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xC5EC; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC54C;&amp;#xB9DE;&amp;#xC740; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC774;&amp;#xB2E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#x2018;BM&amp;#x2019;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC190;&amp;#xC218; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;.&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB77C;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C;&amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; call&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; ret&amp;#xC77C;&amp;#xB54C; &amp;#xC774;&amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xBFD0;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;.. &lt;strong&gt;&amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;Q3-1&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC313;&amp;#xC774;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; ret&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC12;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q8-&amp;#xD5E4;&amp;#xB354;-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;-&amp;#xC788;&amp;#xB294;-&amp;#xBD80;&amp;#xBD84;&#34;&gt;&lt;a href=&#34;#Q8-&amp;#xD5E4;&amp;#xB354;-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;-&amp;#xC788;&amp;#xB294;-&amp;#xBD80;&amp;#xBD84;&#34; class=&#34;headerlink&#34; title=&#34;Q8. &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&#34;&gt;&lt;/a&gt;Q8. &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230056194.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230056194&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xBB54;&amp;#xC9C0; ? (&amp;#xC989;, &lt;strong&gt;&amp;#xBD80;&amp;#xBD84;&lt;/strong&gt; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD2B9;&amp;#xC815; &amp;#xBAA8;&amp;#xB4C8;? &amp;#xD568;&amp;#xC218;? &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;?)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xB2F4;&amp;#xAE34; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB610; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95; (&amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB77C;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;? &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xBD80;&amp;#xD130; &amp;#xC5B4;&amp;#xB514;&amp;#xC778;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB358; &amp;#xAC83;?? &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xAC83;&amp;#xC5D0; &amp;#xD655;&amp;#xC2E0;&amp;#xC774; &amp;#xC798; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; r &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77D;&amp;#xC744; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC78;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q9-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744;-&amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Q9-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744;-&amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Q9. &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Q9. &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xC168;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xC2E0;&amp;#xAC74;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;&amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2F5;&amp;#xBCC0;&amp;#xD558;&amp;#xB294; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; esp&amp;#xB97C; &amp;#xB298;&amp;#xB9AC;&amp;#xAE30;&amp;#xC804; &amp;#xC2A4;&amp;#xD0DD; &amp;#xCD5C;&amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q10-&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;-&amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4;-eip-&amp;#xC7A1;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Q10-&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;-&amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4;-eip-&amp;#xC7A1;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Q10. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip &amp;#xC7A1;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Q10. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip &amp;#xC7A1;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230913412.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230913412&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip&amp;#xB97C; &amp;#xC7A1;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD30C;&amp;#xC77C; &amp;#xAC12;&amp;#xC744; 11111111&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xAC12;&amp;#xC744; 11111111&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xAC74;&amp;#xC9C0;? &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD558;&amp;#xC2E0;&amp;#xAC74;&amp;#xC9C0; &amp;#xC5EC;&amp;#xB5A4; &amp;#xC785;&amp;#xB825; &amp;#xAC12;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xC2E0; &amp;#xAC74;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;11111111&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q11-0x11111111&amp;#xC774;-&amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294;-&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-&amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34;&gt;&lt;a href=&#34;#Q11-0x11111111&amp;#xC774;-&amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294;-&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-&amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34; class=&#34;headerlink&#34; title=&#34;Q11. 0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34;&gt;&lt;/a&gt;Q11. 0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230905032.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230905032&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB780;? (&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; eax&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB0D0;..?)&lt;ul&gt;
&lt;li&gt;Q10-1&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;mov [eax], edx&lt;/code&gt; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC9C0;&amp;#xB0A0;&amp;#xB54C; 0x11111111&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC548;&amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC12;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C0;&amp;#xB0A0; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; 0x11111111&amp;#xC740; &amp;#xADF8;&amp;#xB0E5; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC778;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;Q11-1 &amp;#xB2F5;&amp;#xBCC0;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; &amp;#xC774;&amp;#xB140;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; eax&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#x2026;? &amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;&amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9CC;&amp;#xC57D; &amp;#xB2E4;&amp;#xB97C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB054;&amp;#xCC0D;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;0x11111111 - 0x101cb056 &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;ul&gt;
&lt;li&gt;call [ecx-4]&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; ecx&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 버그헌팅 튜토리얼 리뷰 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;[Research] &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB358; &amp;#xB3C4;&amp;#xC911; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB358; &amp;#xC810;&amp;#xACFC; &amp;#xB2F5;&amp;#xBCC0;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB41C; &amp;#xC810;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;-&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;-&amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;-&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;-&amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 2&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/&#34;&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC; Part 4&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Q1-&amp;#xD37C;&amp;#xC9D5;-&amp;#xC774;&amp;#xC804;-&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744;-&amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34;&gt;&lt;a href=&#34;#Q1-&amp;#xD37C;&amp;#xC9D5;-&amp;#xC774;&amp;#xC804;-&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744;-&amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34; class=&#34;headerlink&#34; title=&#34;Q1. &amp;#xD37C;&amp;#xC9D5; &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&#34;&gt;&lt;/a&gt;Q1. &amp;#xD37C;&amp;#xC9D5; &amp;#xC774;&amp;#xC804; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222248949.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222248949&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCD94;&amp;#xD6C4; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB0B4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &lt;strong&gt;&amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD558;&amp;#xAE30; &amp;#xD3B8;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&lt;ul&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; string search&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xB0B4;&amp;#xAC00; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC5B4;&amp;#xB290; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xD3B8;&amp;#xD558;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xB123;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &lt;strong&gt;&amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54C;&amp;#xAE30; &amp;#xC27D;&amp;#xB2E4;.&lt;/strong&gt; &amp;#xB77C;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB85C;&amp;#xB4DC;&amp;#xB77C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? (&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;? &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD37C;&amp;#xC800;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;?) &lt;ul&gt;
&lt;li&gt;&amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB05D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q2-ECX-&amp;#xAC12;&amp;#xC774;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;-&amp;#xC800;&amp;#xC7A5;&#34;&gt;&lt;a href=&#34;#Q2-ECX-&amp;#xAC12;&amp;#xC774;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;-&amp;#xC800;&amp;#xC7A5;&#34; class=&#34;headerlink&#34; title=&#34;Q2. ECX &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&#34;&gt;&lt;/a&gt;Q2. ECX &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222312219.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222312219&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;ecx &amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;ecx &amp;#xAC12;&amp;#xC744; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB610; ecx&amp;#xAC12;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;ecx&amp;#xAC12;&amp;#xC774; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &lt;/li&gt;
&lt;/ol&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E5;&amp;#xC2A4; &amp;#xC5D0;&amp;#xB514;&amp;#xD130; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xB2E4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC; &amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; ecx&amp;#xAC12;&amp;#xC774; &amp;#xD328;&amp;#xD134;&amp;#xB300;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30;&amp;#xB85C;&amp;#xB294; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC2DC; &amp;#xBC18;&amp;#xBCF5; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB85C; &amp;#xC54C;&amp;#xACE0;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; eip, esp, ebp &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xAC12;&amp;#xC744; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xB54C;&amp;#xB3C4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;call ecx &amp;#xAC19;&amp;#xC740; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; eip&amp;#xAC00; ecx &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xB9C8;&amp;#xC74C;&amp;#xB300;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q3-Windbg&amp;#xC5D0;&amp;#xC11C;-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;-&amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Q3-Windbg&amp;#xC5D0;&amp;#xC11C;-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;-&amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Q3. Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Q3. Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBCF4;&amp;#xB294;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222328034.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915222328034&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xD0C0;&amp;#xB294; &lt;code&gt;IMLodader + 0x357c&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC12;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD558;&amp;#xB294;&amp;#xAC74;&amp;#xC9C0;? (&amp;#xD568;&amp;#xC218; &amp;#xC2DC;&amp;#xC791;&amp;#xBD80;&amp;#xBD84;? &amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158; &amp;#xC8FC;&amp;#xC18C;? &amp;#xBD84;&amp;#xAE30;&amp;#xD560;&amp;#xB54C;&amp;#xC758; &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;?)&lt;ul&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2E4;&amp;#xD589; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB05D;&amp;#xB09C; &amp;#xB4A4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4; &amp;#xD639;&amp;#xC740; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC9C0;&amp;#xC810; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;ul&gt;
&lt;li&gt;&amp;#xB300;&amp;#xCCB4;&amp;#xB85C; Warning&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA70; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC624;&amp;#xC5FC;&amp;#xB418;&amp;#xC5B4; kb &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC785;&amp;#xB825; &amp;#xC2DC; &amp;#xC774;&amp;#xC0C1;&amp;#xD558;&amp;#xAC8C; &amp;#xB5A0; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xB4F1; &amp;#xD310;&amp;#xB2E8;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q4-&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;-&amp;#xC2DC;&amp;#xC5D0;-&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;-&amp;#xBD80;&amp;#xBD84;&amp;#xC744;-&amp;#xBAA8;&amp;#xB450;-0x41&amp;#xB85C;-&amp;#xBC14;&amp;#xAFB8;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34;&gt;&lt;a href=&#34;#Q4-&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;-&amp;#xC2DC;&amp;#xC5D0;-&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;-&amp;#xBD80;&amp;#xBD84;&amp;#xC744;-&amp;#xBAA8;&amp;#xB450;-0x41&amp;#xB85C;-&amp;#xBC14;&amp;#xAFB8;&amp;#xB294;-&amp;#xC774;&amp;#xC720;&#34; class=&#34;headerlink&#34; title=&#34;Q4. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xC5D0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xC774;&amp;#xC720;&#34;&gt;&lt;/a&gt;Q4. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC2DC;&amp;#xC5D0; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915223000840.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915223000840&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2E0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xC168;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74;&amp;#xC740; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD588;&amp;#xB358; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xD2B8; &amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC804;&amp;#xCCB4;&amp;#xB85C; 0x41&amp;#xB85C; &amp;#xCC44;&amp;#xC6B4; &amp;#xAC83;&amp;#xC778;&amp;#xAC00;&amp;#xC694;?&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xD5E4;&amp;#xB354; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; 0x41&amp;#xB85C; &amp;#xCC44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; 0x41&amp;#xB85C; &amp;#xC804;&amp;#xBD80; &amp;#xBC14;&amp;#xAFBC;&amp;#xB4A4;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? (eax&amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;..? &amp;#xAC12;&amp;#xC774; 0x41&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#x2026;? &amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xB984;&amp;#xB300;&amp;#xB85C; &amp;#xB0B4;&amp;#xB9B0; &amp;#xACB0;&amp;#xB860;&amp;#xC740;, &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFBC; &amp;#xC815;&amp;#xBCF4;(&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xC815;&amp;#xBCF4;)&amp;#xB85C; &amp;#xB9D0;&amp;#xBBF8;&amp;#xC554;&amp;#xC544; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC778;&amp;#xB370; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xB3C4; &amp;#xB420;&amp;#xC9C0;? &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q5-&amp;#xD30C;&amp;#xC77C;&amp;#xC774;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C;-&amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Q5-&amp;#xD30C;&amp;#xC77C;&amp;#xC774;-&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C;-&amp;#xC704;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Q5. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Q5. &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC; &amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;? (&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xC778;&amp;#xD48B; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC0C1;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;??) &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBDF0;&amp;#xC5B4;&amp;#xB294; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xBCF4;&amp;#xAE30;&amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBCF4;&amp;#xAE38; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBDF0;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC62C;&amp;#xB824; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74;, &amp;#xB610;&amp;#xD55C; &amp;#xC774; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0C1;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC57C;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/strong&gt;&amp;#xB97C; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xD6C4;&amp;#xC5D0; &amp;#xC774; &amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xAC12;&amp;#xC744; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xAE30;&amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xB85C; &amp;#xB9D0;&amp;#xBBF8;&amp;#xC554;&amp;#xC544; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC77C; (&amp;#xC775;&amp;#xC2A4;? &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;..?) &amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xAC10;&amp;#xC774; &amp;#xC7A1;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xD615;&amp;#xB41C; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD06C;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xD070; &amp;#xAC12;&amp;#xC744; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xAC12;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xAC8C;&amp;#xB418;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC81C;&amp;#xC77C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB97C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xAF2D; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q6-&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;-WARNING&#34;&gt;&lt;a href=&#34;#Q6-&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;-WARNING&#34; class=&#34;headerlink&#34; title=&#34;Q6. &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&#34;&gt;&lt;/a&gt;Q6. &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224007813.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915224007813&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; WARNING&amp;#xC740; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xAE68;&amp;#xC9C4; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC900;&amp;#xB2E4;&amp;#xACE0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC8C; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C; &amp;#xBABB;&amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xC708;&amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798;&amp;#xCABD;&amp;#xC5D0; &amp;#xB098;&amp;#xC640;&amp;#xC788;&amp;#xB294; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;? &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; WARNING&amp;#xC744; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xCABD;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xAC00;&amp;#xC694; &amp;#xC804;&amp;#xBD80;&amp;#xB2E4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;&amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q7-&amp;#xBD84;&amp;#xC11D;-&amp;#xC2DC;&amp;#xC791;-&amp;#xC9C0;&amp;#xC810;-&amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Q7-&amp;#xBD84;&amp;#xC11D;-&amp;#xC2DC;&amp;#xC791;-&amp;#xC9C0;&amp;#xC810;-&amp;#xCC3E;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Q7. &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810; &amp;#xCC3E;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Q7. &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791; &amp;#xC9C0;&amp;#xC810; &amp;#xCC3E;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224030807.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915224030807&#34;&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC2DC;&amp;#xB4DC;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC740; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xAC00;&amp;#xB294;&amp;#xB370;. &amp;#xC774;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;??&lt;ul&gt;
&lt;li&gt;&amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0D1;-&amp;#xB2E4;&amp;#xC6B4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xCB49; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xACFC; &amp;#xBC14;&amp;#xD140;-&amp;#xC5C5; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xC9C0;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD0C0;&amp;#xACE0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xD568;&amp;#xC218; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xAC70;&amp;#xCE60;&amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; Q1-1&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD55C; string search&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB290;&amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;BM &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAC70;&amp;#xB098;, &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;, &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xC911;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34;&amp;#xAC70;&amp;#xB098; &amp;#xBCF4;&amp;#xB294; &amp;#xC774;&amp;#xC720;..(&lt;code&gt;InLoader+0x2590&lt;/code&gt;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294; &amp;#xAC74;&amp;#xC9C0;.. ub&amp;#xB85C; &amp;#xADF8; &amp;#xC8FC;&amp;#xBCC0; &amp;#xC720;&amp;#xC694;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;..) &amp;#xC870;&amp;#xCC28; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#x2018;BM&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; dib &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xAC00; &amp;#x2018;BM&amp;#x2019;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC98;&amp;#xC74C; &amp;#xB85C;&amp;#xB4DC;&amp;#xC2DC;&amp;#xD0AC; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xC5EC; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC54C;&amp;#xB9DE;&amp;#xC740; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC774;&amp;#xB2E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#x2018;BM&amp;#x2019;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8; &amp;#xBD80;&amp;#xBD84;&amp;#xBD80;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC190;&amp;#xC218; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;.&lt;/li&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC774; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610;&amp;#xD55C; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB77C;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C;&amp;#xC704; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; call&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; ret&amp;#xC77C;&amp;#xB54C; &amp;#xC774;&amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xBFD0;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;.. &lt;strong&gt;&amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xADF8; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;Q3-1&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC313;&amp;#xC774;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; ret&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6B0;&amp;#xC5F0;&amp;#xD788; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC12;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Q8-&amp;#xD5E4;&amp;#xB354;-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;-&amp;#xC788;&amp;#xB294;-&amp;#xBD80;&amp;#xBD84;&#34;&gt;&lt;a href=&#34;#Q8-&amp;#xD5E4;&amp;#xB354;-&amp;#xC815;&amp;#xBCF4;&amp;#xB97C;-&amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;-&amp;#xC788;&amp;#xB294;-&amp;#xBD80;&amp;#xBD84;&#34; class=&#34;headerlink&#34; title=&#34;Q8. &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&#34;&gt;&lt;/a&gt;Q8. &amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230056194.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230056194&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD5E4;&amp;#xB354; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xBB54;&amp;#xC9C0; ? (&amp;#xC989;, &lt;strong&gt;&amp;#xBD80;&amp;#xBD84;&lt;/strong&gt; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD2B9;&amp;#xC815; &amp;#xBAA8;&amp;#xB4C8;? &amp;#xD568;&amp;#xC218;? &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;?)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xB2F4;&amp;#xAE34; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xB610; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95; (&amp;#xD2B9;&amp;#xC815; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB77C;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC778;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;? &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xBD80;&amp;#xD130; &amp;#xC5B4;&amp;#xB514;&amp;#xC778;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB358; &amp;#xAC83;?? &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xD574;&amp;#xD55C; &amp;#xAC83;&amp;#xC5D0; &amp;#xD655;&amp;#xC2E0;&amp;#xC774; &amp;#xC798; &amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; r &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77D;&amp;#xC744; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xBE0C;&amp;#xB808;&amp;#xC774;&amp;#xD06C; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC78;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q9-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744;-&amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Q9-&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744;-&amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Q9. &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Q9. &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCC9C;&amp;#xCC9C;&amp;#xD788; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xC168;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD558;&amp;#xC2E0;&amp;#xAC74;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;&amp;#xC9C8;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2F5;&amp;#xBCC0;&amp;#xD558;&amp;#xB294; &amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC; &amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; esp&amp;#xB97C; &amp;#xB298;&amp;#xB9AC;&amp;#xAE30;&amp;#xC804; &amp;#xC2A4;&amp;#xD0DD; &amp;#xCD5C;&amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB9AC;&amp;#xD134;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB808;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xB7F0; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574; &amp;#xCF5C;&amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q10-&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;-&amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4;-eip-&amp;#xC7A1;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Q10-&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;-&amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4;-eip-&amp;#xC7A1;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Q10. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip &amp;#xC7A1;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Q10. &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip &amp;#xC7A1;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230913412.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230913412&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC26C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xD6C4; eip&amp;#xB97C; &amp;#xC7A1;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD30C;&amp;#xC77C; &amp;#xAC12;&amp;#xC744; 11111111&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xAC12;&amp;#xC744; 11111111&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xAC74;&amp;#xC9C0;? &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD558;&amp;#xC2E0;&amp;#xAC74;&amp;#xC9C0; &amp;#xC5EC;&amp;#xB5A4; &amp;#xC785;&amp;#xB825; &amp;#xAC12;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xC2E0; &amp;#xAC74;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;11111111&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Q11-0x11111111&amp;#xC774;-&amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294;-&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-&amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34;&gt;&lt;a href=&#34;#Q11-0x11111111&amp;#xC774;-&amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294;-&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640;-&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-&amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34; class=&#34;headerlink&#34; title=&#34;Q11. 0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&#34;&gt;&lt;/a&gt;Q11. 0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230905032.png&#34; alt=&#34;./bughunting-tutorial-review/image-20210915230905032&#34;&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;0x11111111&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB780;? (&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; eax&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB0D0;..?)&lt;ul&gt;
&lt;li&gt;Q10-1&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;mov [eax], edx&lt;/code&gt; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC9C0;&amp;#xB0A0;&amp;#xB54C; 0x11111111&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xC548;&amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC12;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD574;&amp;#xB2F9; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C0;&amp;#xB0A0; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; 0x11111111&amp;#xC740; &amp;#xADF8;&amp;#xB0E5; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC778;&amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xC778;&amp;#xC9C0;?&lt;ul&gt;
&lt;li&gt;Q11-1 &amp;#xB2F5;&amp;#xBCC0;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB610; &amp;#xC774;&amp;#xB140;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; eax&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#x2026;? &amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;&amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xB2E4;&amp;#xB97C; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9CC;&amp;#xC57D; &amp;#xB2E4;&amp;#xB97C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB054;&amp;#xCC0D;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;0x11111111 - 0x101cb056 &amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;ul&gt;
&lt;li&gt;call [ecx-4]&amp;#xC5D0;&amp;#xC11C; &amp;#xD06C;&amp;#xB798;&amp;#xC26C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; ecx&amp;#xB97C; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD568;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222328034.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/11/07/juntheworld/bughunting-tutorial-review/">

  <title>[Research] 버그헌팅 튜토리얼 리뷰 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-11-07 18:00" pubdate>
      2021년 11월 7일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      59
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 버그헌팅 튜토리얼 리뷰</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>[Research] &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC744; &#xBCF4;&#xACE0; &#xACF5;&#xBD80;&#xD558;&#xB358; &#xB3C4;&#xC911; &#xAD81;&#xAE08;&#xD588;&#xB358; &#xC810;&#xACFC; &#xB2F5;&#xBCC0;&#xC73C;&#xB85C; &#xC0C8;&#xB85C; &#xC54C;&#xAC8C; &#xB41C; &#xC810;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xBC84;&#xADF8;&#xD5CC;&#xD305;-&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;-&#xBCF4;&#xB7EC;&#xAC00;&#xAE30;"><a href="#&#xBC84;&#xADF8;&#xD5CC;&#xD305;-&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;-&#xBCF4;&#xB7EC;&#xAC00;&#xAE30;" class="headerlink" title="&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;"></a>&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 1</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 2</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 3</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 4</a></p>
<h1 id="Q1-&#xD37C;&#xC9D5;-&#xC774;&#xC804;-&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744;-&#xC218;&#xC815;&#xD558;&#xB294;-&#xC774;&#xC720;"><a href="#Q1-&#xD37C;&#xC9D5;-&#xC774;&#xC804;-&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744;-&#xC218;&#xC815;&#xD558;&#xB294;-&#xC774;&#xC720;" class="headerlink" title="Q1. &#xD37C;&#xC9D5; &#xC774;&#xC804; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xC218;&#xC815;&#xD558;&#xB294; &#xC774;&#xC720;"></a>Q1. &#xD37C;&#xC9D5; &#xC774;&#xC804; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xC218;&#xC815;&#xD558;&#xB294; &#xC774;&#xC720;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222248949.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915222248949"></p>
<ol>
<li>&#xCD94;&#xD6C4; &#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xC2DC;&#xC5D0; &#xB0B4; &#xD30C;&#xC77C;&#xC774; <strong>&#xC5B4;&#xB514;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;</strong>&#xD558;&#xAE30; &#xD3B8;&#xD55C; &#xC774;&#xC720;<ul>
<li>&#xB514;&#xBC84;&#xAC70;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; string search&#xB97C; &#xD1B5;&#xD574; &#xD2B9;&#xC815; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xB0B4;&#xAC00; &#xC218;&#xC815;&#xD55C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC5B4;&#xB290; &#xC704;&#xCE58;&#xC5D0; &#xC62C;&#xB77C;&#xAC00;&#xB294;&#xC9C0; &#xD3B8;&#xD558;&#xAC8C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xB610; &#xB9C8;&#xC9C0;&#xB9C9; &#xBD80;&#xBD84;&#xC5D0; &#xB123;&#xC744; &#xACBD;&#xC6B0; <strong>&#xB05D;&#xAE4C;&#xC9C0; &#xB2E4; &#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#xB3C4; &#xC54C;&#xAE30; &#xC27D;&#xB2E4;.</strong> &#xB77C;&#xACE0; &#xC5B8;&#xAE09;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xB370;, &#xB85C;&#xB4DC;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC774; &#xC5B4;&#xB5A4; &#xAC83;&#xC778;&#xC9C0;? (&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB85C;&#xB4DC;? &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC774; &#xD37C;&#xC800;&#xC5D0; &#xB85C;&#xB4DC;?) <ul>
<li>&#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC77C;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC774; &#xB05D;&#xAE4C;&#xC9C0; &#xB2E4; &#xB85C;&#xB4DC;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xB294;&#xC9C0;?<ul>
<li>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB9C8;&#xB2E4; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q2-ECX-&#xAC12;&#xC774;-&#xD30C;&#xC77C;&#xC5D0;-&#xC800;&#xC7A5;"><a href="#Q2-ECX-&#xAC12;&#xC774;-&#xD30C;&#xC77C;&#xC5D0;-&#xC800;&#xC7A5;" class="headerlink" title="Q2. ECX &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;"></a>Q2. ECX &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222312219.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915222312219"></p>
<ol>
<li><p>ecx &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC744; &#xBB34;&#xC5C7;&#xC744; &#xBCF4;&#xACE0; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0;</p>
</li>
<li><p>ecx &#xAC12;&#xC744; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xC54C; &#xC218; &#xC788;&#xB294;&#xC9C0;</p>
</li>
<li><p>&#xB610; ecx&#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4;&#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0;</p>
</li>
<li>ecx&#xAC12;&#xC774; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC774; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; </li>
</ol>
<ul>
<li>&#xD5E5;&#xC2A4; &#xC5D0;&#xB514;&#xD130; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD30C;&#xC77C;&#xC5D0;&#xB2E4; &#xBB38;&#xC790;&#xC5F4; &#xD328;&#xD134;&#xC744; &#xC0DD;&#xC131;&#xD55C; &#xB2E4;&#xC2DC; &#xD30C;&#xC77C;&#xC744; &#xB85C;&#xB4DC; &#xC2DC;&#xD0A4;&#xBA74; ecx&#xAC12;&#xC774; &#xD328;&#xD134;&#xB300;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB2E4;&#xBA74; &#xCEE8;&#xD2B8;&#xB864;&#xC744; &#xC27D;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC81C;&#xAC00; &#xC54C;&#xAE30;&#xB85C;&#xB294; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB294; &#xBA85;&#xB839;&#xC5B4; &#xC0AC;&#xC6A9;&#xC2DC; &#xBC18;&#xBCF5; &#xCE74;&#xC6B4;&#xD130;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB85C; &#xC54C;&#xACE0;&#xC788;&#xB294;&#xB370;, &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC758; &#xD750;&#xB984;&#xC744; &#xC870;&#xC808;&#xD560; &#xC218; &#xC788;&#xB294; eip, esp, ebp &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xC544;&#xB2CC; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xB2F4;&#xAE34; &#xAC12;&#xC744; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xC744;&#xB54C;&#xB3C4; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC774; &#xC5B4;&#xB5A4; &#xC6D0;&#xB9AC;&#xB85C; &#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC778;&#xC9C0; &#xC798; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.<ul>
<li>call ecx &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74; eip&#xAC00; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB85C; &#xBC14;&#xB00C;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCF54;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC744; &#xB9C8;&#xC74C;&#xB300;&#xB85C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </li>
</ul>
</li>
</ul>
<h1 id="Q3-Windbg&#xC5D0;&#xC11C;-&#xCF5C;&#xC2A4;&#xD0DD;-&#xBCF4;&#xB294;&#xBC95;"><a href="#Q3-Windbg&#xC5D0;&#xC11C;-&#xCF5C;&#xC2A4;&#xD0DD;-&#xBCF4;&#xB294;&#xBC95;" class="headerlink" title="Q3. Windbg&#xC5D0;&#xC11C; &#xCF5C;&#xC2A4;&#xD0DD; &#xBCF4;&#xB294;&#xBC95;"></a>Q3. Windbg&#xC5D0;&#xC11C; &#xCF5C;&#xC2A4;&#xD0DD; &#xBCF4;&#xB294;&#xBC95;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222328034.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915222328034"></p>
<ol>
<li>Windbg&#xC5D0;&#xC11C; &#xB098;&#xD0C0;&#xB294; <code>IMLodader + 0x357c</code>&#xC640; &#xAC19;&#xC740; &#xAC12;&#xC774; &#xC5B4;&#xB5A4; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD558;&#xB294;&#xAC74;&#xC9C0;? (&#xD568;&#xC218; &#xC2DC;&#xC791;&#xBD80;&#xBD84;? &#xD568;&#xC218;&#xB0B4;&#xC758; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158; &#xC8FC;&#xC18C;? &#xBD84;&#xAE30;&#xD560;&#xB54C;&#xC758; &#xADF8; &#xC8FC;&#xC18C;?)<ul>
<li>&#xD568;&#xC218;&#xB0B4;&#xC5D0;&#xC11C; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xB2E4;&#xC74C; &#xC2E4;&#xD589; &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xAC8C; &#xB418;&#xB294;&#xB370; &#xD638;&#xCD9C;&#xD55C; &#xD568;&#xC218;&#xAC00; &#xB05D;&#xB09C; &#xB4A4; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xC624;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xCF5C;&#xC2A4;&#xD0DD; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xC815;&#xBCF4; &#xD639;&#xC740; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD558;&#xB294; &#xC815;&#xBCF4;&#xB294; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;?<ul>
<li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD; &#xC9C0;&#xC810; &#xC774;&#xC804;&#xC5D0; &#xC5B4;&#xB514;&#xC11C; &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xB294;&#xC9C0; &#xB4F1; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xAE68;&#xC838;&#xC788;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;<ul>
<li>&#xB300;&#xCCB4;&#xB85C; Warning&#xC774;&#xB77C;&#xACE0; &#xC54C;&#xB824;&#xC8FC;&#xBA70; &#xC2A4;&#xD0DD;&#xC774; &#xC624;&#xC5FC;&#xB418;&#xC5B4; kb &#xBA85;&#xB839;&#xC5B4; &#xC785;&#xB825; &#xC2DC; &#xC774;&#xC0C1;&#xD558;&#xAC8C; &#xB5A0; &#xC788;&#xB294; &#xACBD;&#xC6B0; &#xB4F1; &#xD310;&#xB2E8;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q4-&#xB9AC;&#xBC84;&#xC2F1;-&#xC2DC;&#xC5D0;-&#xBE44;&#xD2B8;&#xB9F5;-&#xBD80;&#xBD84;&#xC744;-&#xBAA8;&#xB450;-0x41&#xB85C;-&#xBC14;&#xAFB8;&#xB294;-&#xC774;&#xC720;"><a href="#Q4-&#xB9AC;&#xBC84;&#xC2F1;-&#xC2DC;&#xC5D0;-&#xBE44;&#xD2B8;&#xB9F5;-&#xBD80;&#xBD84;&#xC744;-&#xBAA8;&#xB450;-0x41&#xB85C;-&#xBC14;&#xAFB8;&#xB294;-&#xC774;&#xC720;" class="headerlink" title="Q4. &#xB9AC;&#xBC84;&#xC2F1; &#xC2DC;&#xC5D0; &#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFB8;&#xB294; &#xC774;&#xC720;"></a>Q4. &#xB9AC;&#xBC84;&#xC2F1; &#xC2DC;&#xC5D0; &#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFB8;&#xB294; &#xC774;&#xC720;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915223000840.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915223000840"></p>
<ol>
<li><p>&#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFBC; &#xB2E4;&#xC74C; &#xB2E4;&#xC2DC; &#xB514;&#xBC84;&#xAC70;&#xB85C; &#xD655;&#xC778;&#xD558;&#xC2E0;&#xB2E4;&#xACE0; &#xD558;&#xC168;&#xB294;&#xB370;, &#xADF8;&#xB7EC;&#xBA74;&#xC740; &#xD06C;&#xB798;&#xC2DC; &#xBC1C;&#xC0DD;&#xC744; &#xC720;&#xBC1C;&#xD588;&#xB358; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xB41C; &#xBD80;&#xBD84;&#xC740; &#xADF8;&#xB300;&#xB85C; &#xB450;&#xACE0; &#xB098;&#xBA38;&#xC9C0; &#xBD80;&#xBD84;&#xC744; &#xC804;&#xCCB4;&#xB85C; 0x41&#xB85C; &#xCC44;&#xC6B4; &#xAC83;&#xC778;&#xAC00;&#xC694;?</p>
<ul>
<li>&#xD5E4;&#xB354;&#xB294; &#xD06C;&#xB798;&#xC26C;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xD5E4;&#xB354; &#xADF8;&#xB300;&#xB85C; &#xB450;&#xACE0; &#xB098;&#xBA38;&#xC9C0; &#xB0B4;&#xC6A9;&#xC744; 0x41&#xB85C; &#xCC44;&#xC6C1;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><p>&#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD574;&#xC11C; 0x41&#xB85C; &#xC804;&#xBD80; &#xBC14;&#xAFBC;&#xB4A4;&#xC5D0; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xC744; &#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC778;&#xC9C0;? (eax&#xAC12;&#xC744; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;..? &#xAC12;&#xC774; 0x41&#xB85C; &#xBC14;&#xB00C;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#x2026;? &#xC81C;&#xAC00; &#xB098;&#xB984;&#xB300;&#xB85C; &#xB0B4;&#xB9B0; &#xACB0;&#xB860;&#xC740;, &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC2DC;&#xC810;&#xC5D0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xBC14;&#xAFBC; &#xC815;&#xBCF4;(&#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;)&#xB85C; &#xB9D0;&#xBBF8;&#xC554;&#xC544; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xAC8C; &#xB418;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD568;&#xC778;&#xB370; &#xC774;&#xB807;&#xAC8C; &#xC774;&#xD574;&#xD574;&#xB3C4; &#xB420;&#xC9C0;? </p>
<ul>
<li>&#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q5-&#xD30C;&#xC77C;&#xC774;-&#xB85C;&#xB4DC;&#xB41C;-&#xC704;&#xCE58;"><a href="#Q5-&#xD30C;&#xC77C;&#xC774;-&#xB85C;&#xB4DC;&#xB41C;-&#xC704;&#xCE58;" class="headerlink" title="Q5. &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;"></a>Q5. &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;</h1><ol>
<li><p>&#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC; &#xB41C;&#xB2E4;&#xB294; &#xAC1C;&#xB150;? (&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xD2B9;&#xC815;&#xD55C; &#xC778;&#xD48B; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xC0C1;&#xC5D0; &#xB85C;&#xB4DC;&#xAC00; &#xB418;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;??) </p>
<ul>
<li>&#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC774;&#xBBF8;&#xC9C0; &#xBDF0;&#xC5B4;&#xB294; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBCF4;&#xAE30;&#xC704;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xBBC0;&#xB85C; &#xC6B0;&#xB9AC;&#xAC00; &#xBCF4;&#xAE38; &#xC6D0;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xBDF0;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC62C;&#xB824; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><p>&#xB9CC;&#xC57D; &#xADF8;&#xB807;&#xB2E4;&#xBA74;, &#xB610;&#xD55C; &#xC774; <strong>&#xD30C;&#xC77C;&#xC774; &#xBA54;&#xBAA8;&#xB9AC; &#xC0C1;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xC544;&#xC57C;&#xD558;&#xB294; &#xC774;&#xC720;</strong>&#xB97C; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xD6C4;&#xC5D0; &#xC774; &#xACF3;&#xC5D0;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xAC12;&#xC744; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xAE30;&#xC704;&#xD574;&#xC11C;&#xB77C;&#xB294; &#xAC83;&#xC740; &#xC54C;&#xACA0;&#xB294;&#xB370;, &#xADF8;&#xB85C; &#xB9D0;&#xBBF8;&#xC554;&#xC544; &#xD560; &#xC218; &#xC788;&#xB294; &#xC77C; (&#xC775;&#xC2A4;? &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;..?) &#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC798; &#xAC10;&#xC774; &#xC7A1;&#xD788;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBCC0;&#xD615;&#xB41C; &#xD5E4;&#xB354;&#xC5D0; &#xC758;&#xD574; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xD06C;&#xAE30;&#xBCF4;&#xB2E4; &#xB354; &#xD070; &#xAC12;&#xC744; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC;&#xC2DC;&#xD0A4;&#xAC8C; &#xB418;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB098;&#xC911;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB420; &#xAC12;&#xC744; &#xD2B9;&#xC815;&#xD55C; &#xAC12;&#xC73C;&#xB85C; &#xB36E;&#xAC8C;&#xB418;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xC870;&#xC791;&#xD574; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC81C;&#xC77C; &#xC911;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB294; &#xBCF4;&#xACE0;&#xC11C;&#xB97C; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xC791;&#xC131;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC99D;&#xBA85;&#xC744; &#xC704;&#xD574; &#xAF2D; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</li>
</ul>
</li>
</ol>
<h1 id="Q6-&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C;-WARNING"><a href="#Q6-&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C;-WARNING" class="headerlink" title="Q6. &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING"></a>Q6. &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224007813.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915224007813"></p>
<ul>
<li>&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING&#xC740; &#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xAE68;&#xC9C4; &#xAC83;&#xC744; &#xC54C;&#xB824;&#xC900;&#xB2E4;&#xACE0; &#xC54C;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xC774;&#xAC8C; &#xC798;&#xBABB;&#xB418;&#xC5B4;&#xC11C; &#xBABB;&#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xACBD;&#xC6B0; &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xCABD;&#xC5D0; &#xB098;&#xC640;&#xC788;&#xB294; &#xC815;&#xBCF4;&#xB4E4;&#xB3C4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xC9C0;? &#xC544;&#xB2C8;&#xBA74; WARNING&#xC744; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC704;&#xCABD;&#xC744; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xAC00;&#xC694; &#xC804;&#xBD80;&#xB2E4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xC9C0;?<ul>
<li>&#xCF00;&#xC774;&#xC2A4;&#xB9C8;&#xB2E4; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<h1 id="Q7-&#xBD84;&#xC11D;-&#xC2DC;&#xC791;-&#xC9C0;&#xC810;-&#xCC3E;&#xAE30;"><a href="#Q7-&#xBD84;&#xC11D;-&#xC2DC;&#xC791;-&#xC9C0;&#xC810;-&#xCC3E;&#xAE30;" class="headerlink" title="Q7. &#xBD84;&#xC11D; &#xC2DC;&#xC791; &#xC9C0;&#xC810; &#xCC3E;&#xAE30;"></a>Q7. &#xBD84;&#xC11D; &#xC2DC;&#xC791; &#xC9C0;&#xC810; &#xCC3E;&#xAE30;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224030807.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915224030807"></p>
<ul>
<li><strong>&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xBBA4;&#xD14C;&#xC774;&#xC158;&#xB41C; &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xACE0;, &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB0B4;&#xC5D0;&#xC11C; &#xADF8; &#xBD80;&#xBD84;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;</strong>&#xC740; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xB294;&#xB370;. &#xC774;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294;&#xC9C0;??<ul>
<li>&#xBC29;&#xBC95;&#xC740; &#xB2E4;&#xC591;&#xD569;&#xB2C8;&#xB2E4;. &#xD0D1;-&#xB2E4;&#xC6B4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xCB49; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xCC3E;&#xB294; &#xBC29;&#xC2DD;&#xACFC; &#xBC14;&#xD140;-&#xC5C5; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD06C;&#xB798;&#xC26C; &#xC9C0;&#xC810;&#xBD80;&#xD130; &#xD0C0;&#xACE0; &#xC62C;&#xB77C;&#xAC00;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xC788;&#xB294;&#xB370;, &#xD568;&#xC218; &#xD558;&#xB098;&#xC529; &#xAC70;&#xCE60;&#xB54C;&#xB9C8;&#xB2E4; Q1-1&#xC5D0;&#xC11C; &#xB9D0;&#xD55C; string search&#xB97C; &#xD1B5;&#xD574; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC5B4;&#xB290;&#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xACE0;, &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>BM &#xC774;&#xB77C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xCC3E;&#xC544;&#xBCF4;&#xAC70;&#xB098;, &#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xD558;&#xB098;&#xD558;&#xB098; &#xBCF4;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xB294; &#xC774;&#xC720;, &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xC774;&#xC911;&#xC5D0; &#xC544;&#xBB34;&#xAC70;&#xB098; &#xBCF4;&#xB294; &#xC774;&#xC720;..(<code>InLoader+0x2590</code>&#xAC00; &#xBB34;&#xC5C7;&#xC744; &#xB73B;&#xD558;&#xB294; &#xAC74;&#xC9C0;.. ub&#xB85C; &#xADF8; &#xC8FC;&#xBCC0; &#xC720;&#xC694;&#xD55C; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xCC3E;&#xB294; &#xC774;&#xC720;..) &#xC870;&#xCC28; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<ul>
<li>&#x2018;BM&#x2019;&#xC774;&#xB77C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCC3E;&#xB294; &#xC774;&#xC720;&#xB294; dib &#xD30C;&#xC77C;&#xC758; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xAC00; &#x2018;BM&#x2019;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xCC98;&#xC74C; &#xB85C;&#xB4DC;&#xC2DC;&#xD0AC; &#xB54C; &#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xC5EC; &#xAC01; &#xD30C;&#xC77C;&#xC5D0; &#xC54C;&#xB9DE;&#xC740; &#xB8E8;&#xD2F4;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294;&#xB370; &#xC544;&#xC774;&#xB2E4;&#xC5D0;&#xC11C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xAC80;&#xC0C9;&#xD588;&#xC744; &#xB54C; &#x2018;BM&#x2019;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xADF8; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC5C6;&#xC73C;&#xBA74; &#xC190;&#xC218; &#xCC3E;&#xC544;&#xC57C;&#xACA0;&#xC8E0;.</li>
<li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xBA74; &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC27D;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xB610;&#xD55C; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB77C;&#xBA74; &#xBC14;&#xB85C;&#xC704; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; call&#xC774;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370; ret&#xC77C;&#xB54C; &#xC774;&#xC8FC;&#xC18C;&#xB294; &#xC6B0;&#xC5F0;&#xD788; &#xADF8; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC5C8;&#xB358; &#xAC83; &#xBFD0;&#xC774;&#xB77C;&#xACE0; &#xD588;&#xB294;&#xB370;.. <strong>&#xC774; &#xC8FC;&#xC18C;&#xAC00; &#xADF8; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;</strong>&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<ul>
<li>Q3-1&#xC5D0;&#xC11C; &#xB9D0;&#xD588;&#xB4EF;&#xC774; &#xCF5C;&#xC2A4;&#xD0DD;&#xC740; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD588;&#xC744; &#xB54C; &#xC313;&#xC774;&#xAC8C; &#xB418;&#xB294;&#xB370; ret&#xC740; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xBBC0;&#xB85C; &#xC6B0;&#xC5F0;&#xD788; &#xC2A4;&#xD0DD;&#xC5D0; &#xC788;&#xC5C8;&#xB358; &#xAC12;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<h1 id="Q8-&#xD5E4;&#xB354;-&#xC815;&#xBCF4;&#xB97C;-&#xAC00;&#xC9C0;&#xACE0;-&#xC788;&#xB294;-&#xBD80;&#xBD84;"><a href="#Q8-&#xD5E4;&#xB354;-&#xC815;&#xBCF4;&#xB97C;-&#xAC00;&#xC9C0;&#xACE0;-&#xC788;&#xB294;-&#xBD80;&#xBD84;" class="headerlink" title="Q8. &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;"></a>Q8. &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230056194.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915230056194"></p>
<ol>
<li><p>&#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;&#xC774;&#xB77C;&#xB294;&#xAC8C; &#xBB54;&#xC9C0; ? (&#xC989;, <strong>&#xBD80;&#xBD84;</strong> &#xC774;&#xB77C;&#xB294; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#xD2B9;&#xC815; &#xBAA8;&#xB4C8;? &#xD568;&#xC218;? &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;?)</p>
<ul>
<li>&#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC774;&#xBBF8;&#xC9C0; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD5E4;&#xB354;&#xAC00; &#xB2F4;&#xAE34; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><p>&#xB610; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xBC29;&#xBC95; (&#xD2B9;&#xC815; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC5D0;&#xC11C; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xC8FC;&#xC18C;&#xB77C;&#xBA74; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC778;&#xC9C0;&#xD558;&#xB294; &#xAC83;? &#xC774;&#xB97C; &#xC704;&#xD574;&#xC11C; &#xC774;&#xC804;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xC5B4;&#xB514;&#xBD80;&#xD130; &#xC5B4;&#xB514;&#xC778;&#xC9C0; &#xC0AC;&#xC804;&#xC5D0; &#xCC3E;&#xC544;&#xB0B4;&#xB824;&#xACE0; &#xD588;&#xB358; &#xAC83;?? &#xC81C;&#xAC00; &#xC774;&#xD574;&#xD55C; &#xAC83;&#xC5D0; &#xD655;&#xC2E0;&#xC774; &#xC798; &#xAC00;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;)</p>
<ul>
<li>ba &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xBA54;&#xBAA8;&#xB9AC; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; r &#xC635;&#xC158;&#xC744; &#xC8FC;&#xBA74; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC77D;&#xC744; &#xC2DC;&#xC810;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xAC00; &#xAC78;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q9-&#xCF5C;&#xC2A4;&#xD0DD;&#xC744;-&#xBCF5;&#xAD6C;&#xD558;&#xB294;-&#xBC29;&#xBC95;"><a href="#Q9-&#xCF5C;&#xC2A4;&#xD0DD;&#xC744;-&#xBCF5;&#xAD6C;&#xD558;&#xB294;-&#xBC29;&#xBC95;" class="headerlink" title="Q9. &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;"></a>Q9. &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;</h1><ol>
<li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xACE0; &#xCC9C;&#xCC9C;&#xD788; &#xB530;&#xB77C;&#xAC00;&#xB294; &#xACFC;&#xC815;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xC168;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5BB;&#xAC8C; &#xD558;&#xC2E0;&#xAC74;&#xC9C0; &#xAD81;&#xAE08;&#xD569;&#xB2C8;&#xB2E4;!<ul>
<li>&#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xBCC0;&#xD558;&#xB294; &#xD544;&#xC790;&#xB294; &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD; &#xC2DC; &#xD568;&#xC218; &#xD504;&#xB864;&#xB85C;&#xADF8; &#xC2DC;&#xC810;&#xC5D0; esp&#xB97C; &#xB298;&#xB9AC;&#xAE30;&#xC804; &#xC2A4;&#xD0DD; &#xCD5C;&#xC0C1;&#xB2E8;&#xC5D0; &#xC788;&#xB294; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xCC3E;&#xC544;&#xB0B4;&#xC11C; &#xC774;&#xB7F0; &#xACFC;&#xC815;&#xC744; &#xBC18;&#xBCF5;&#xD574; &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q10-&#xD06C;&#xB798;&#xC2DC;-&#xBD84;&#xC11D;&#xC774;&#xD6C4;-eip-&#xC7A1;&#xAE30;"><a href="#Q10-&#xD06C;&#xB798;&#xC2DC;-&#xBD84;&#xC11D;&#xC774;&#xD6C4;-eip-&#xC7A1;&#xAE30;" class="headerlink" title="Q10. &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip &#xC7A1;&#xAE30;"></a>Q10. &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip &#xC7A1;&#xAE30;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230913412.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915230913412"></p>
<ol>
<li>&#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip&#xB97C; &#xC7A1;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD30C;&#xC77C; &#xAC12;&#xC744; 11111111&#xB85C; &#xC218;&#xC815;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xAC12;&#xC744; 11111111&#xB85C; &#xBC14;&#xAFD4;&#xC11C; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD55C;&#xAC74;&#xC9C0;? &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xC2E0;&#xAC74;&#xC9C0; &#xC5EC;&#xB5A4; &#xC785;&#xB825; &#xAC12;&#xC744; &#xBC14;&#xAFB8;&#xC2E0; &#xAC74;&#xC9C0;<ul>
<li>11111111&#xB85C; &#xBC14;&#xAFD4;&#xC11C; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD55C; &#xAC83;&#xC774; &#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<h1 id="Q11-0x11111111&#xC774;-&#xAC00;&#xB9AC;&#xD0A4;&#xB294;-&#xB370;&#xC774;&#xD130;&#xC640;-&#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758;-&#xC624;&#xD504;&#xC14B;"><a href="#Q11-0x11111111&#xC774;-&#xAC00;&#xB9AC;&#xD0A4;&#xB294;-&#xB370;&#xC774;&#xD130;&#xC640;-&#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758;-&#xC624;&#xD504;&#xC14B;" class="headerlink" title="Q11. 0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC640; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;"></a>Q11. 0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC640; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230905032.png" srcset="/img/loading.gif" alt="./bughunting-tutorial-review/image-20210915230905032"></p>
<ol>
<li>0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xB780;? (&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC624;&#xD504;&#xC14B;&#xC774; eax&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; &#xC77C;&#xCE58;&#xD558;&#xB0D0;..?)<ul>
<li>Q10-1&#xC758; &#xC774;&#xBBF8;&#xC9C0;&#xC5D0;&#xC11C; <code>mov [eax], edx</code> &#xACFC;&#xC815;&#xC744; &#xC9C0;&#xB0A0;&#xB54C; 0x11111111&#xC758; &#xC8FC;&#xC18C;&#xC548;&#xC5D0; &#xC720;&#xD6A8;&#xD55C; &#xAC12;&#xC774; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xC5B4;&#xC57C; &#xD574;&#xB2F9; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC9C0;&#xB0A0; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xB610; 0x11111111&#xC740; &#xADF8;&#xB0E5; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xB123;&#xC740; &#xB370;&#xC774;&#xD130; &#xC778;&#xAC83;&#xC73C;&#xB85C; &#xC774;&#xD574;&#xD588;&#xB294;&#xB370;, &#xC774; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xAC00;&#xB97C; &#xAC00;&#xB9AC;&#xD0A8;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0;?<ul>
<li>Q11-1 &#xB2F5;&#xBCC0;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xB610; &#xC774;&#xB140;&#xC11D;&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; eax&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;&#xACFC; &#xC77C;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xCC3E;&#xB294; &#xC774;&#xC720;&#x2026;? &#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;<ul>
<li>&#xC624;&#xD504;&#xC14B;&#xC774; &#xB2E4;&#xB97C; &#xACBD;&#xC6B0;&#xB294; &#xAC70;&#xC758; &#xC5C6;&#xC9C0;&#xB9CC; &#xB9CC;&#xC57D; &#xB2E4;&#xB97C; &#xACBD;&#xC6B0; &#xB054;&#xCC0D;&#xD55C; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;..</li>
</ul>
</li>
<li>0x11111111 - 0x101cb056 &#xC640; &#xAC19;&#xC740; &#xC5F0;&#xC0B0;&#xC744; &#xD558;&#xB294; &#xC774;&#xC720;<ul>
<li>call [ecx-4]&#xC5D0;&#xC11C; &#xD06C;&#xB798;&#xC26C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; ecx&#xB97C; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD568;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/pwnable/">pwnable</a>
                  
                  <a class="hover-with-bg" href="/tags/juntheworld/">juntheworld</a>
                  
                  <a class="hover-with-bg" href="/tags/bughunting/">bughunting</a>
                  
                  <a class="hover-with-bg" href="/tags/review/">review</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_juntheworld.jpg" srcset="/img/loading.gif" alt="juntheworld">
                  </div>

                  <div class="link-text">
                    <div class="link-title">juntheworld</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/juntheworld">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/11/09/d0hwq1/2021-11-09/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-41117: Keypair 모듈의 잘못된 랜덤 시드 생성</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/11/05/poosic/shared-memory/">
                    <span class="hidden-mobile">[해키피디아] Shared Memory</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/11/07/juntheworld/bughunting-tutorial-review/';
        this.page.identifier = '/2021/11/07/juntheworld/bughunting-tutorial-review/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 버그헌팅 튜토리얼 리뷰&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
