

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, hunjison&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD56D;&amp;#xC0C1; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xB358; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBC14;&amp;#xB85C; CVE&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC5B4;&amp;#xB290; &amp;#xB0A0;,,, &lt;code&gt;OUYA77&lt;/code&gt; &amp;#xC5D0;&amp;#xAC8C; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4E3;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#x2026;.&amp;#xB465;..!! &amp;#xBC14;&amp;#xB85C; KISA&amp;#xC5D0;&amp;#xC11C; IP CAM 1.5 &amp;#xBC30; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC78; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; IP CAM&amp;#xC774; &amp;#xB3C8;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC798;&amp;#xD558;&amp;#xBA74; CVE&amp;#xB3C4; &amp;#xBC1C;&amp;#xAE09; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB2E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;IP-CAM-target-search&#34;&gt;&lt;a href=&#34;#IP-CAM-target-search&#34; class=&#34;headerlink&#34; title=&#34;IP CAM target search&#34;&gt;&lt;/a&gt;IP CAM target search&lt;/h1&gt;&lt;p&gt;&lt;code&gt;OUYA77&lt;/code&gt;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xBC14;&amp;#xB85C; IP CAM &amp;#xC81C;&amp;#xD488;&amp;#xAD70; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD94;&amp;#xB9AC;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC815;&amp;#xC6A9; IP CAM&amp;#xC740; 2&amp;#xB9CC;&amp;#xC6D0;&amp;#xC5D0;&amp;#xC11C; 10&amp;#xB9CC;&amp;#xC6D0; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xAC00;&amp;#xACA9;&amp;#xB300;&amp;#xC600;&amp;#xACE0;, &amp;#xAE30;&amp;#xC5C5;&amp;#xC6A9; IP CAM&amp;#xC740; 20&amp;#xB9CC;&amp;#xC6D0;&amp;#xB300;&amp;#xBD80;&amp;#xD130; 100&amp;#xB9CC;&amp;#xC6D0;&amp;#xC774; &amp;#xB118;&amp;#xB294; &amp;#xAC83;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xAC00;&amp;#xB09C;&amp;#xD588;&amp;#xACE0; &amp;#xB3C8;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC00;&amp;#xC815;&amp;#xC6A9; IP CAM&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC0AC;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC678;&amp;#xBD80; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C; Attack vector&amp;#xAC00; &amp;#xB9CE;&amp;#xC740; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Wifi (AP)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;App (iOS/Android &amp;#x2192; IP CAM)&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Windows program&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;External cloud storage&lt;/li&gt;
&lt;li&gt;Ethernet&lt;/li&gt;
&lt;li&gt;SDCard&lt;/li&gt;
&lt;li&gt;USB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; IP CAM &amp;#xB4E4;&amp;#xC740; &amp;#xC704; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC911; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC0B4;&amp;#xC9DD; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC628;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xD68D;&amp;#xB4DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0;&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 4&amp;#xAC1C;&amp;#xC758; &amp;#xC791;&amp;#xACE0; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6B4; IP CAM&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xB9E4;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; 2&amp;#xAC1C; IP CAM&amp;#xC758; &amp;#xBD84;&amp;#xC11D; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Target-A&#34;&gt;&lt;a href=&#34;#Target-A&#34; class=&#34;headerlink&#34; title=&#34;Target A&#34;&gt;&lt;/a&gt;Target A&lt;/h1&gt;&lt;h2 id=&#34;1-Initial-exploration&#34;&gt;&lt;a href=&#34;#1-Initial-exploration&#34; class=&#34;headerlink&#34; title=&#34;#1 - Initial exploration&#34;&gt;&lt;/a&gt;#1 - Initial exploration&lt;/h2&gt;&lt;p&gt;Target A&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; interface&amp;#xC5D0;&amp;#xB294; App (iOS / Android)&amp;#xC640; Windows EXE&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xCD08;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;App&lt;ul&gt;
&lt;li&gt;&amp;#xD68C;&amp;#xC6D0;&amp;#xAC00;&amp;#xC785;/&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xD544;&amp;#xC218;&amp;#xC774;&amp;#xACE0;, App &amp;#x2192; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC; App&amp;#xC758; QR code&amp;#xB97C; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xC778;&amp;#xC2DD;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC57C; &amp;#xD558;&amp;#xBA70;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; Wi-Fi &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC644;&amp;#xB8CC; &amp;#xD6C4; &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;ul&gt;
&lt;li&gt;&amp;#xD68C;&amp;#xC6D0;&amp;#xAC00;&amp;#xC785;/&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, EXE &amp;#x2192; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC774;&amp;#xD6C4; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD568;. &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;&amp;#xC740; &amp;#xAE30;&amp;#xAE30;&amp;#xC758; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xC2DC;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95; &amp;#xC54C;&amp;#xC544;&amp;#xB0C4;&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;/device/{device-model}/{device-model}&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; URL &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;binwalk&lt;/code&gt; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;squashfs&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xD30C;&amp;#xC77C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;2-Windows-EXE-analysis&#34;&gt;&lt;a href=&#34;#2-Windows-EXE-analysis&#34; class=&#34;headerlink&#34; title=&#34;#2 - Windows EXE analysis&#34;&gt;&lt;/a&gt;#2 - Windows EXE analysis&lt;/h2&gt;&lt;p&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294;&amp;#xC9C0;?&lt;/li&gt;
&lt;li&gt;&amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84; / IP CAM&amp;#xACFC; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; Wireshark&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TLS &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD328;&amp;#xD0B7;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SSLKEYLOGFILE&lt;/code&gt;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574; Wireshark&amp;#xC5D0;&amp;#xC11C; TLS &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB4EF;&amp;#xC774;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; TLS &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574; Key &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB824; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; TLS &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; Frida &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, Frida&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; SSL &amp;#xAD00;&amp;#xB828; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; Hooking &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows EXE&amp;#xC5D0;&amp;#xC11C; Import&amp;#xD558;&amp;#xB294; SSL &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; argument &amp;#xAC12; &amp;#xB610;&amp;#xB294; return buffer&amp;#xB97C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xCD9C;&amp;#xB825;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;, HTTP 200&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Frida Hooking &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Windows EXE &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Watching-video-after-user-login-WAN-network&#34;&gt;&lt;a href=&#34;#2-1-Watching-video-after-user-login-WAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.1 - Watching video after user login (WAN network)&#34;&gt;&lt;/a&gt;#2.1 - Watching video after user login (WAN network)&lt;/h3&gt;&lt;p&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; IP CAM&amp;#xC774; &amp;#xAC19;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; WAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294;, &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TLS &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xBA74;, &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC601;&amp;#xC0C1; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; IP CAM&amp;#xACFC; server&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; TLS 1.2&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. TLS 1.2 &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Cipher suite&amp;#xAC00; RSA&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB9CC; &amp;#xBA87;&amp;#xBA87; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBD84;&amp;#xC11D; &amp;#xB300;&amp;#xC0C1; IP CAM&amp;#xC758; Cipher suite&amp;#xB294; &lt;code&gt;TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256&lt;/code&gt;&amp;#xB85C; MITM &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;See-also-Packet-sniffing-with-Wi-Fi-dongle&#34;&gt;&lt;a href=&#34;#See-also-Packet-sniffing-with-Wi-Fi-dongle&#34; class=&#34;headerlink&#34; title=&#34;[See also] Packet sniffing with Wi-Fi dongle&#34;&gt;&lt;/a&gt;[See also] Packet sniffing with Wi-Fi dongle&lt;/h3&gt;&lt;p&gt;IP CAM&amp;#xACFC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; Wi-Fi dongle&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. Dongle&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; Wi-Fi &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; Wi-Fi&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; PC&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xC774;&amp;#xB354;&amp;#xB137;&amp;#xC744; Wi-Fi&amp;#xB85C; &amp;#xBFCC;&amp;#xB824;&amp;#xC8FC;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; dongle&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; dongle&amp;#xC774; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Wireshark&amp;#xC5D0;&amp;#xC11C; dongle &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD558;&amp;#xBA74;, IP CAM&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD328;&amp;#xD0B7;&amp;#xC774; &amp;#xCEA1;&amp;#xCCD0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-2-Watching-video-after-user-login-LAN-network&#34;&gt;&lt;a href=&#34;#2-2-Watching-video-after-user-login-LAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.2 - Watching video after user login (LAN network)&#34;&gt;&lt;/a&gt;#2.2 - Watching video after user login (LAN network)&lt;/h3&gt;&lt;p&gt;&amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows EXE&amp;#xC640; IP CAM&amp;#xC774; LAN encrypt key&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD574; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC800;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xACE0;&amp;#xC815;&amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; Target A&amp;#xB97C; &amp;#xB108;&amp;#xBB34; &amp;#xC595;&amp;#xBD24;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;,,,&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC2DC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; JWT Token&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; LAN encrypt key&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Server&amp;#xC640; IP CAM &amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; LAN encrypt key&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCE21;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-3-Watching-video-with-no-user-login-LAN-network&#34;&gt;&lt;a href=&#34;#2-3-Watching-video-with-no-user-login-LAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.3 - Watching video with no user login (LAN network)&#34;&gt;&lt;/a&gt;#2.3 - Watching video with no user login (LAN network)&lt;/h3&gt;&lt;p&gt;Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC5C6;&amp;#xC774; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD574; &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xC2DC;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows EXE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xCE90;&amp;#xC2F1;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xAC78; &amp;#xC78A;&amp;#xC5B4;&amp;#xBC84;&amp;#xB824; &amp;#xC81C;&amp;#xAC00; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xCC29;&amp;#xAC01;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#xC791;&amp;#xC131; &amp;#xC9C1;&amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC00;&amp;#xC11C;&amp;#xC57C; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xAE68;&amp;#xB2EC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-4-Watching-video-with-no-user-login-RTSP-protocol&#34;&gt;&lt;a href=&#34;#2-4-Watching-video-with-no-user-login-RTSP-protocol&#34; class=&#34;headerlink&#34; title=&#34;#2.4 - Watching video with no user login (RTSP protocol)&#34;&gt;&lt;/a&gt;#2.4 - Watching video with no user login (RTSP protocol)&lt;/h3&gt;&lt;p&gt;Target A&amp;#xB294; RTSP &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. RTSP(Real Time Streaming Protocol)&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xB514;&amp;#xC624;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB4F1;&amp;#xC758; &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Target A&amp;#xC758; RTSP URL&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACFC;&amp;#xAC70; &amp;#xBC84;&amp;#xC804;&amp;#xC758; Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;6&amp;#xC790;&amp;#xB9AC;&amp;#xC758; device code&amp;#xB97C; RTSP &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC6A9;&lt;/strong&gt;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xCD5C;&amp;#xC2E0; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-API-server&#34;&gt;&lt;a href=&#34;#3-API-server&#34; class=&#34;headerlink&#34; title=&#34;#3 - API server&#34;&gt;&lt;/a&gt;#3 - API server&lt;/h2&gt;&lt;p&gt;Frida&amp;#xB85C; Windows EXE&amp;#xB97C; hooking&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; API &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBB34;&amp;#xB824; Internet explorer&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; !!! &amp;#xC544;&amp;#xC8FC; &amp;#xD5C8;&amp;#xB984;&amp;#xD55C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC600;&amp;#xC8E0;. Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xD68C;&amp;#xC6D0; &amp;#xAC00;&amp;#xC785;, &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;, &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xBCC0;&amp;#xACBD; &amp;#xB4F1; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xACE0;&amp;#xBBFC;&amp;#xD558;&amp;#xB358; &amp;#xC911;, &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB09C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAE68;&amp;#xB2EB;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBA48;&amp;#xCDC4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;4-Firmware-analysis&#34;&gt;&lt;a href=&#34;#4-Firmware-analysis&#34; class=&#34;headerlink&#34; title=&#34;#4 - Firmware analysis&#34;&gt;&lt;/a&gt;#4 - Firmware analysis&lt;/h2&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC73C;&amp;#xB098; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Command Injection: &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC73C;&amp;#xB098; &amp;#xC2E4;&amp;#xD328;&lt;/li&gt;
&lt;li&gt;BOF / DOS attack: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; request &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; length &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xB294;&amp;#xB370;, &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;5-Result&#34;&gt;&lt;a href=&#34;#5-Result&#34; class=&#34;headerlink&#34; title=&#34;#5 - Result&#34;&gt;&lt;/a&gt;#5 - Result&lt;/h2&gt;&lt;p&gt;Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows EXE &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xBCC4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Target A&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740;, &amp;#xC774;&amp;#xBBF8; &amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xAC04; &amp;#xAC78;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;h1 id=&#34;2&amp;#xC5D0;&amp;#xC11C;-&amp;#xBD84;&amp;#xC11D;&amp;#xD55C;-4&amp;#xAC00;&amp;#xC9C0;-&amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;-&amp;#xB300;&amp;#xD574;-&amp;#xC548;&amp;#xC804;&amp;#xD55C;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xBC95;&amp;#xC744;-&amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;-&amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;-&amp;#xC774;&amp;#xB807;&amp;#xAC8C;-&amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744;-&amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294;-&amp;#xC808;&amp;#xB300;-&amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&#34;&gt;&lt;a href=&#34;#2&amp;#xC5D0;&amp;#xC11C;-&amp;#xBD84;&amp;#xC11D;&amp;#xD55C;-4&amp;#xAC00;&amp;#xC9C0;-&amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;-&amp;#xB300;&amp;#xD574;-&amp;#xC548;&amp;#xC804;&amp;#xD55C;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xBC95;&amp;#xC744;-&amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;-&amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;-&amp;#xC774;&amp;#xB807;&amp;#xAC8C;-&amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744;-&amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294;-&amp;#xC808;&amp;#xB300;-&amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&#34; class=&#34;headerlink&#34; title=&#34;2&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&#34;&gt;&lt;/a&gt;2&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/h1&gt;&lt;/li&gt;
&lt;li&gt;BOF &amp;#xAD00;&amp;#xB828; length &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCCA0;&amp;#xC800;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;Target-B&#34;&gt;&lt;a href=&#34;#Target-B&#34; class=&#34;headerlink&#34; title=&#34;Target B&#34;&gt;&lt;/a&gt;Target B&lt;/h1&gt;&lt;h2 id=&#34;1-Initial-exploration-1&#34;&gt;&lt;a href=&#34;#1-Initial-exploration-1&#34; class=&#34;headerlink&#34; title=&#34;#1 - Initial exploration&#34;&gt;&lt;/a&gt;#1 - Initial exploration&lt;/h2&gt;&lt;p&gt; Target B&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; interface&amp;#xC5D0;&amp;#xB294; App (iOS / Android)&amp;#xC640; Windows EXE&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows EXE&amp;#xC758; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; IP CAM&amp;#xC758; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; Web Interface&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;App&lt;ul&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xD488; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC124;&amp;#xBA85;&amp;#xC11C;&amp;#xC5D0; &amp;#xCD08;&amp;#xAE30; &amp;#xC124;&amp;#xC815;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xAF64;&amp;#xB098; &amp;#xCDE8;&amp;#xC57D;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;App&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294;, IP CAM&amp;#xC758; Wi-Fi&amp;#xC5D0; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C; &amp;#xAE30;&amp;#xAE30;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB358; Wi-Fi &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB118;&amp;#xACA8;&amp;#xC8FC;&amp;#xBA74; &amp;#xCD08;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC644;&amp;#xB8CC; &amp;#xD6C4; &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD; &amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB179;&amp;#xD654;, &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;, &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xC0C1;&amp;#xD558;&amp;#xC88C;&amp;#xC6B0; &amp;#xC774;&amp;#xB3D9;, &amp;#xBC84;&amp;#xC800;&amp;#xC74C; &amp;#xCD9C;&amp;#xB825; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Windows EXE&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xCEEC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Web Interface&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC758; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294; CGI &amp;#xAE30;&amp;#xBC18; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. UI&amp;#xAC00; &amp;#xD5C8;&amp;#xC811;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC544; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/li&gt;
&lt;li&gt;App&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xBC31;&amp;#xC5C5; / &amp;#xB85C;&amp;#xB4DC;, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;2-Web-Interface&#34;&gt;&lt;a href=&#34;#2-Web-Interface&#34; class=&#34;headerlink&#34; title=&#34;#2 - Web Interface&#34;&gt;&lt;/a&gt;#2 - Web Interface&lt;/h2&gt;&lt;h3 id=&#34;2-1-System-configuration-backup-load&#34;&gt;&lt;a href=&#34;#2-1-System-configuration-backup-load&#34; class=&#34;headerlink&#34; title=&#34;#2.1 - System configuration backup / load&#34;&gt;&lt;/a&gt;#2.1 - System configuration backup / load&lt;/h3&gt;&lt;p&gt;Web interface&amp;#xC5D0;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC31;&amp;#xC5C5;(IP CAM &amp;#x2192; PC &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;)&amp;#xD558;&amp;#xACE0;, &amp;#xB85C;&amp;#xB4DC;(PC &amp;#x2192; IP CAM)&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC774;&amp;#xB7AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Header (0x200)&lt;ul&gt;
&lt;li&gt;MD5 hash &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Body&lt;ul&gt;
&lt;li&gt;TAR &amp;#xAD6C;&amp;#xC870;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;BODY &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; TAR &amp;#xAD6C;&amp;#xC870;&amp;#xC784;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;, &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574; &lt;code&gt;/etc/shadow&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB0B4;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; overwrite&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; MD5 hash&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE38;&amp;#xC774;&amp;#xAC00; MD5&amp;#xC784;&amp;#xC774; &amp;#xBD84;&amp;#xBA85;&amp;#xD55C;&amp;#xB370; &amp;#xAC12;&amp;#xC774; &amp;#xC804;&amp;#xD600; &amp;#xB9DE;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC911;,, 2019&amp;#xB144; &amp;#xD55C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; MD5 &amp;#xAC12;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB3D9;&amp;#xC77C; IP CAM&amp;#xC758; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC774;&amp;#xB7F0;,,,, &amp;#xC774;&amp;#xBBF8; &amp;#xB204;&amp;#xAD70;&amp;#xAC00; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xAC83;&amp;#xC774; &amp;#xD2C0;&amp;#xB9BC; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F602; &amp;#xC774;&amp;#xD6C4; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; MD5 hash &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xACC4;&amp;#xC0B0;&amp;#xBC95;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC758; &amp;#xB178;&amp;#xB825;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-Firmware-update&#34;&gt;&lt;a href=&#34;#2-2-Firmware-update&#34; class=&#34;headerlink&#34; title=&#34;#2.2 - Firmware update&#34;&gt;&lt;/a&gt;#2.2 - Firmware update&lt;/h3&gt;&lt;p&gt;&amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xC758; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBD84;&amp;#xBA85; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC544;&amp;#xB294; ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC778;&amp;#xB370;&amp;#xB3C4; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xC77C;&amp;#xBD80; customization&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77C;&amp;#xBD80; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xACB0;&amp;#xACFC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; (&amp;#xC77C;&amp;#xBD80; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC740; &amp;#xD798;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;[https://blog.forensicresearch.kr/3](https://blog.forensicresearch.kr/3)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.forensicresearch.kr/3&#34;&gt;https://blog.forensicresearch.kr/3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC911;,, &amp;#xC81C;&amp;#xC870;&amp;#xC0AC; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD604;&amp;#xC7AC;&amp;#xBD80;&amp;#xD130; &amp;#xACFC;&amp;#xAC70;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xC74C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC545;&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xAC00;&amp;#xBA70; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&lt;ul&gt;
&lt;li&gt;System config &amp;#xD30C;&amp;#xC77C;(firmware&amp;#xC640; &amp;#xAD6C;&amp;#xC870; &amp;#xAC19;&amp;#xC74C;) &amp;#xC0DD;&amp;#xC131; &amp;#xB85C;&amp;#xC9C1; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD574; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D; &amp;#xCD94;&amp;#xC801;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;b6c855a3-b38e-402f-bffd-ea5f99fa942b.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB010; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCC0;&amp;#xACBD; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xC744;&amp;#xC9C0; &amp;#xB290;&amp;#xB084; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xADF8;&amp;#xC800; &amp;#xBD80;&amp;#xB7FD;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870; &amp;#xBCC0;&amp;#xACBD;&lt;ul&gt;
&lt;li&gt;&amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xB2E8;&amp;#xC21C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xC911;&amp;#xAC04;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBD80;&amp;#xBD84; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD588;&amp;#xACE0;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;MD5 hash &amp;#xC0DD;&amp;#xC131; &amp;#xB85C;&amp;#xC9C1;&lt;ul&gt;
&lt;li&gt;&amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;MD5(BODY)&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xC600;&amp;#xC73C;&amp;#xB098;, &lt;code&gt;MD5(BODY + &amp;quot;secret string&amp;quot;)&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xACE0;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xC704;&amp;#xCE58;&lt;ul&gt;
&lt;li&gt;2017&amp;#xB144;&amp;#xBD80;&amp;#xD130; 2021&amp;#xB144;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; App&amp;#xACFC; &amp;#xC5F0;&amp;#xB3D9;&amp;#xB418;&amp;#xB294; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;3-App&#34;&gt;&lt;a href=&#34;#3-App&#34; class=&#34;headerlink&#34; title=&#34;#3 - App&#34;&gt;&lt;/a&gt;#3 - App&lt;/h2&gt;&lt;p&gt;Android &amp;#xB8E8;&amp;#xD305; &amp;#xD3F0;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xAD00;&amp;#xACC4;&amp;#xB85C;, App &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xC548; &amp;#xD55C;&amp;#xAC8C; &amp;#xB9DE;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;..^^ iPhone&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD328;&amp;#xD0B7; &amp;#xCEA1;&amp;#xCCD0;&amp;#xB97C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xB9E5;&amp;#xBD81;&amp;#xACFC; iPhone&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xBA74; iPhone &amp;#xD328;&amp;#xD0B7; &amp;#xCEA1;&amp;#xCCD0;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;[https://lxxyeon.tistory.com/157](https://lxxyeon.tistory.com/157)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://lxxyeon.tistory.com/157&#34;&gt;https://lxxyeon.tistory.com/157&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;iPhone &amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; IP CAM&amp;#xACFC;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC774;&amp;#xB7AC;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC758; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C0;&amp;#xBA74; server&amp;#xC640; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD574;&amp;#xC694;. IP CAM&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; IP &amp;#xC640; &amp;#xC811;&amp;#xC18D; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; server&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3EC;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; 1&amp;#xBD84;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBC14;&amp;#xB00C;&amp;#xC5B4;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; App&amp;#xC744; &amp;#xCF1C;&amp;#xBA74; server&amp;#xC5D0; communication request&amp;#xB97C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; IP / port &amp;#xC815;&amp;#xBCF4;&amp;#xB85C; IP CAM&amp;#xC5D0; communicaiton request&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC8E0;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; IP / port &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB3FC;&amp;#xC694;.&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Target B&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;, &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD50C;&amp;#xB798;&amp;#xC2DC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xCE69;&amp;#xC624;&amp;#xD504;&amp;#xD558;&amp;#xACE0;, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB364;&amp;#xD504;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; BOF &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;RCE&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC258;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; IP CAM&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB4E4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD50C;&amp;#xB798;&amp;#xC2DC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xBD80;&amp;#xD130; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC911;&amp;#xC694;&amp;#xD568;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC815;&amp;#xB9D0;&amp;#xB85C;, &amp;#xC815;&amp;#xB9D0;&amp;#xB85C; &amp;#xC774;&amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xC911;&amp;#xC694;&amp;#xD574;&amp;#xC694;..&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;4-Windows-EXE&#34;&gt;&lt;a href=&#34;#4-Windows-EXE&#34; class=&#34;headerlink&#34; title=&#34;#4 - Windows EXE&#34;&gt;&lt;/a&gt;#4 - Windows EXE&lt;/h2&gt;&lt;p&gt;Windows EXE&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC810;&amp;#xC740; App&amp;#xACFC; Windows EXE&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC804;&amp;#xD600; &amp;#xB2EC;&amp;#xB790;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IP CAM&amp;#xC774; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xB108;&amp;#xBB34;&amp;#xB098; &amp;#xB2E4;&amp;#xC591;&amp;#xD574; &amp;#xC798; &amp;#xCC3E;&amp;#xAE30;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAF64;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xB4EF;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xC57D; 3&amp;#xB2EC;(24.11 ~ 25.1)&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; IP CAM 2&amp;#xAC1C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xC57D; 4&amp;#xAC1C;&amp;#xC758; IP CAM&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C; &amp;#xACBD;&amp;#xD5D8;&amp;#xD558;&amp;#xB294; IoT &amp;#xAE30;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C; &amp;#xBBF8;&amp;#xD761;&amp;#xD55C; &amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; Windows EXE &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC774;&amp;#xB77C; &amp;#xAF64;&amp;#xB098; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC81C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xC6B4; &amp;#xC810;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xB530;&amp;#xB85C; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xAC70;&amp;#xCCD0;&amp;#xAC04; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC218;&amp;#xC900;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IP CAM&amp;#xC5D0;&amp;#xC11C; &amp;#xB108;&amp;#xBB34; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC5B4;&amp;#xB290;&amp;#xC815;&amp;#xB3C4; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IoT &amp;#xAE30;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE30;&amp;#xCD08; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC694;&amp;#xAD6C;&amp;#xD55C;&amp;#xB2E4;. Windows EXE &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBD84;&amp;#xC11D;, &amp;#xC18C;&amp;#xCF13; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;, &amp;#xC6F9;&amp;#xD574;&amp;#xD0B9;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD574;&amp;#xD0B9;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC801; &amp;#xC811;&amp;#xADFC; &amp;#xB4F1; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xAC8C; &amp;#xB9CE;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xC6B0;&amp;#xC120;&amp;#xC2DC; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]  IP CAM   (ko) - hackyboiz">
  <meta property="og:description" content="&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, hunjison&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD56D;&amp;#xC0C1; &amp;#xC544;&amp;#xC26C;&amp;#xC6E0;&amp;#xB358; &amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBC14;&amp;#xB85C; CVE&amp;#xAC00; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC5B4;&amp;#xB290; &amp;#xB0A0;,,, &lt;code&gt;OUYA77&lt;/code&gt; &amp;#xC5D0;&amp;#xAC8C; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4E3;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450;&amp;#x2026;.&amp;#xB465;..!! &amp;#xBC14;&amp;#xB85C; KISA&amp;#xC5D0;&amp;#xC11C; IP CAM 1.5 &amp;#xBC30; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC78; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; IP CAM&amp;#xC774; &amp;#xB3C8;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC798;&amp;#xD558;&amp;#xBA74; CVE&amp;#xB3C4; &amp;#xBC1C;&amp;#xAE09; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB2E4; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;IP-CAM-target-search&#34;&gt;&lt;a href=&#34;#IP-CAM-target-search&#34; class=&#34;headerlink&#34; title=&#34;IP CAM target search&#34;&gt;&lt;/a&gt;IP CAM target search&lt;/h1&gt;&lt;p&gt;&lt;code&gt;OUYA77&lt;/code&gt;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xBC14;&amp;#xB85C; IP CAM &amp;#xC81C;&amp;#xD488;&amp;#xAD70; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCD94;&amp;#xB9AC;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC00;&amp;#xC815;&amp;#xC6A9; IP CAM&amp;#xC740; 2&amp;#xB9CC;&amp;#xC6D0;&amp;#xC5D0;&amp;#xC11C; 10&amp;#xB9CC;&amp;#xC6D0; &amp;#xC815;&amp;#xB3C4;&amp;#xC758; &amp;#xAC00;&amp;#xACA9;&amp;#xB300;&amp;#xC600;&amp;#xACE0;, &amp;#xAE30;&amp;#xC5C5;&amp;#xC6A9; IP CAM&amp;#xC740; 20&amp;#xB9CC;&amp;#xC6D0;&amp;#xB300;&amp;#xBD80;&amp;#xD130; 100&amp;#xB9CC;&amp;#xC6D0;&amp;#xC774; &amp;#xB118;&amp;#xB294; &amp;#xAC83;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC591;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xAC00;&amp;#xB09C;&amp;#xD588;&amp;#xACE0; &amp;#xB3C8;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC00;&amp;#xC815;&amp;#xC6A9; IP CAM&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xC0AC;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC678;&amp;#xBD80; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C; Attack vector&amp;#xAC00; &amp;#xB9CE;&amp;#xC740; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Wifi (AP)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;App (iOS/Android &amp;#x2192; IP CAM)&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Windows program&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;External cloud storage&lt;/li&gt;
&lt;li&gt;Ethernet&lt;/li&gt;
&lt;li&gt;SDCard&lt;/li&gt;
&lt;li&gt;USB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; IP CAM &amp;#xB4E4;&amp;#xC740; &amp;#xC704; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC911; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC0B4;&amp;#xC9DD; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC628;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &amp;#xD68D;&amp;#xB4DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0;&amp;#xB97C; &amp;#xACE0;&amp;#xB824;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 4&amp;#xAC1C;&amp;#xC758; &amp;#xC791;&amp;#xACE0; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6B4; IP CAM&amp;#xB4E4;&amp;#xC744; &amp;#xAD6C;&amp;#xB9E4;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; 2&amp;#xAC1C; IP CAM&amp;#xC758; &amp;#xBD84;&amp;#xC11D; &amp;#xD6C4;&amp;#xAE30;&amp;#xB97C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;Target-A&#34;&gt;&lt;a href=&#34;#Target-A&#34; class=&#34;headerlink&#34; title=&#34;Target A&#34;&gt;&lt;/a&gt;Target A&lt;/h1&gt;&lt;h2 id=&#34;1-Initial-exploration&#34;&gt;&lt;a href=&#34;#1-Initial-exploration&#34; class=&#34;headerlink&#34; title=&#34;#1 - Initial exploration&#34;&gt;&lt;/a&gt;#1 - Initial exploration&lt;/h2&gt;&lt;p&gt;Target A&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; interface&amp;#xC5D0;&amp;#xB294; App (iOS / Android)&amp;#xC640; Windows EXE&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xB294; &amp;#xCD08;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;App&lt;ul&gt;
&lt;li&gt;&amp;#xD68C;&amp;#xC6D0;&amp;#xAC00;&amp;#xC785;/&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xD544;&amp;#xC218;&amp;#xC774;&amp;#xACE0;, App &amp;#x2192; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC; App&amp;#xC758; QR code&amp;#xB97C; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xC778;&amp;#xC2DD;&amp;#xC2DC;&amp;#xCF1C;&amp;#xC57C; &amp;#xD558;&amp;#xBA70;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; Wi-Fi &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC644;&amp;#xB8CC; &amp;#xD6C4; &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;ul&gt;
&lt;li&gt;&amp;#xD68C;&amp;#xC6D0;&amp;#xAC00;&amp;#xC785;/&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, EXE &amp;#x2192; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC774;&amp;#xD6C4; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD568;. &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;&amp;#xC740; &amp;#xAE30;&amp;#xAE30;&amp;#xC758; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC5BC; &amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xC2DC;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC29;&amp;#xBC95; &amp;#xC54C;&amp;#xC544;&amp;#xB0C4;&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;/device/{device-model}/{device-model}&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; URL &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;binwalk&lt;/code&gt; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;squashfs&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xD30C;&amp;#xC77C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;2-Windows-EXE-analysis&#34;&gt;&lt;a href=&#34;#2-Windows-EXE-analysis&#34; class=&#34;headerlink&#34; title=&#34;#2 - Windows EXE analysis&#34;&gt;&lt;/a&gt;#2 - Windows EXE analysis&lt;/h2&gt;&lt;p&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294;&amp;#xC9C0;?&lt;/li&gt;
&lt;li&gt;&amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84; / IP CAM&amp;#xACFC; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC778;&amp;#xC99D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; Wireshark&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TLS &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD328;&amp;#xD0B7;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SSLKEYLOGFILE&lt;/code&gt;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574; Wireshark&amp;#xC5D0;&amp;#xC11C; TLS &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB4EF;&amp;#xC774;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; TLS &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD574; Key &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB824; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; TLS &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC11C; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; Frida &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, Frida&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; SSL &amp;#xAD00;&amp;#xB828; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; Hooking &amp;#xC2DC;&amp;#xB3C4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows EXE&amp;#xC5D0;&amp;#xC11C; Import&amp;#xD558;&amp;#xB294; SSL &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; argument &amp;#xAC12; &amp;#xB610;&amp;#xB294; return buffer&amp;#xB97C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC801;&amp;#xC808;&amp;#xD788; &amp;#xCD9C;&amp;#xB825;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;, HTTP 200&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Frida Hooking &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Windows EXE &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Watching-video-after-user-login-WAN-network&#34;&gt;&lt;a href=&#34;#2-1-Watching-video-after-user-login-WAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.1 - Watching video after user login (WAN network)&#34;&gt;&lt;/a&gt;#2.1 - Watching video after user login (WAN network)&lt;/h3&gt;&lt;p&gt;Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; IP CAM&amp;#xC774; &amp;#xAC19;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; WAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294;, &amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TLS &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xBA74;, &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC778;&amp;#xC99D;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC601;&amp;#xC0C1; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; IP CAM&amp;#xACFC; server&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; TLS 1.2&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. TLS 1.2 &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Cipher suite&amp;#xAC00; RSA&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB9CC; &amp;#xBA87;&amp;#xBA87; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xBD84;&amp;#xC11D; &amp;#xB300;&amp;#xC0C1; IP CAM&amp;#xC758; Cipher suite&amp;#xB294; &lt;code&gt;TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256&lt;/code&gt;&amp;#xB85C; MITM &amp;#xACF5;&amp;#xACA9;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;See-also-Packet-sniffing-with-Wi-Fi-dongle&#34;&gt;&lt;a href=&#34;#See-also-Packet-sniffing-with-Wi-Fi-dongle&#34; class=&#34;headerlink&#34; title=&#34;[See also] Packet sniffing with Wi-Fi dongle&#34;&gt;&lt;/a&gt;[See also] Packet sniffing with Wi-Fi dongle&lt;/h3&gt;&lt;p&gt;IP CAM&amp;#xACFC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; Wi-Fi dongle&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. Dongle&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; Wi-Fi &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; Wi-Fi&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; PC&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xC774;&amp;#xB354;&amp;#xB137;&amp;#xC744; Wi-Fi&amp;#xB85C; &amp;#xBFCC;&amp;#xB824;&amp;#xC8FC;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; dongle&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; dongle&amp;#xC774; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Wireshark&amp;#xC5D0;&amp;#xC11C; dongle &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD558;&amp;#xBA74;, IP CAM&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD328;&amp;#xD0B7;&amp;#xC774; &amp;#xCEA1;&amp;#xCCD0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-2-Watching-video-after-user-login-LAN-network&#34;&gt;&lt;a href=&#34;#2-2-Watching-video-after-user-login-LAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.2 - Watching video after user login (LAN network)&#34;&gt;&lt;/a&gt;#2.2 - Watching video after user login (LAN network)&lt;/h3&gt;&lt;p&gt;&amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows EXE&amp;#xC640; IP CAM&amp;#xC774; LAN encrypt key&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD574; &amp;#xC8FC;&amp;#xACE0; &amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xC800;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xACE0;&amp;#xC815;&amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; Target A&amp;#xB97C; &amp;#xB108;&amp;#xBB34; &amp;#xC595;&amp;#xBD24;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;,,,&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC2DC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; JWT Token&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; LAN encrypt key&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Server&amp;#xC640; IP CAM &amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; LAN encrypt key&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCE21;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-3-Watching-video-with-no-user-login-LAN-network&#34;&gt;&lt;a href=&#34;#2-3-Watching-video-with-no-user-login-LAN-network&#34; class=&#34;headerlink&#34; title=&#34;#2.3 - Watching video with no user login (LAN network)&#34;&gt;&lt;/a&gt;#2.3 - Watching video with no user login (LAN network)&lt;/h3&gt;&lt;p&gt;Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xC5C6;&amp;#xC774; LAN &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE94;&amp;#xD574; &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xC2DC;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows EXE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xCE90;&amp;#xC2F1;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xAC78; &amp;#xC78A;&amp;#xC5B4;&amp;#xBC84;&amp;#xB824; &amp;#xC81C;&amp;#xAC00; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xCC29;&amp;#xAC01;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#xC791;&amp;#xC131; &amp;#xC9C1;&amp;#xC804;&amp;#xAE4C;&amp;#xC9C0; &amp;#xAC00;&amp;#xC11C;&amp;#xC57C; &amp;#xBB34;&amp;#xC5B8;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xAE68;&amp;#xB2EC;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h3 id=&#34;2-4-Watching-video-with-no-user-login-RTSP-protocol&#34;&gt;&lt;a href=&#34;#2-4-Watching-video-with-no-user-login-RTSP-protocol&#34; class=&#34;headerlink&#34; title=&#34;#2.4 - Watching video with no user login (RTSP protocol)&#34;&gt;&lt;/a&gt;#2.4 - Watching video with no user login (RTSP protocol)&lt;/h3&gt;&lt;p&gt;Target A&amp;#xB294; RTSP &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. RTSP(Real Time Streaming Protocol)&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xB514;&amp;#xC624;, &amp;#xBE44;&amp;#xB514;&amp;#xC624;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB4F1;&amp;#xC758; &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Target A&amp;#xC758; RTSP URL&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACFC;&amp;#xAC70; &amp;#xBC84;&amp;#xC804;&amp;#xC758; Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;6&amp;#xC790;&amp;#xB9AC;&amp;#xC758; device code&amp;#xB97C; RTSP &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC6A9;&lt;/strong&gt;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xCD5C;&amp;#xC2E0; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-API-server&#34;&gt;&lt;a href=&#34;#3-API-server&#34; class=&#34;headerlink&#34; title=&#34;#3 - API server&#34;&gt;&lt;/a&gt;#3 - API server&lt;/h2&gt;&lt;p&gt;Frida&amp;#xB85C; Windows EXE&amp;#xB97C; hooking&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; API &amp;#xC11C;&amp;#xBC84;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBB34;&amp;#xB824; Internet explorer&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; !!! &amp;#xC544;&amp;#xC8FC; &amp;#xD5C8;&amp;#xB984;&amp;#xD55C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC600;&amp;#xC8E0;. Windows &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xD68C;&amp;#xC6D0; &amp;#xAC00;&amp;#xC785;, &amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;, &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xBCC0;&amp;#xACBD; &amp;#xB4F1; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC744; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xACE0;&amp;#xBBFC;&amp;#xD558;&amp;#xB358; &amp;#xC911;, &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB09C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAE68;&amp;#xB2EB;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xBA48;&amp;#xCDC4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;h2 id=&#34;4-Firmware-analysis&#34;&gt;&lt;a href=&#34;#4-Firmware-analysis&#34; class=&#34;headerlink&#34; title=&#34;#4 - Firmware analysis&#34;&gt;&lt;/a&gt;#4 - Firmware analysis&lt;/h2&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC73C;&amp;#xB098; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Command Injection: &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC73C;&amp;#xB098; &amp;#xC2E4;&amp;#xD328;&lt;/li&gt;
&lt;li&gt;BOF / DOS attack: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; request &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; length &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xB294;&amp;#xB370;, &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xCC3E;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;5-Result&#34;&gt;&lt;a href=&#34;#5-Result&#34; class=&#34;headerlink&#34; title=&#34;#5 - Result&#34;&gt;&lt;/a&gt;#5 - Result&lt;/h2&gt;&lt;p&gt;Target A&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows EXE &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xBCC4; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Target A&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740;, &amp;#xC774;&amp;#xBBF8; &amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC81C;&amp;#xD488;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xAC04; &amp;#xAC78;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;h1 id=&#34;2&amp;#xC5D0;&amp;#xC11C;-&amp;#xBD84;&amp;#xC11D;&amp;#xD55C;-4&amp;#xAC00;&amp;#xC9C0;-&amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;-&amp;#xB300;&amp;#xD574;-&amp;#xC548;&amp;#xC804;&amp;#xD55C;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xBC95;&amp;#xC744;-&amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;-&amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;-&amp;#xC774;&amp;#xB807;&amp;#xAC8C;-&amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744;-&amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294;-&amp;#xC808;&amp;#xB300;-&amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&#34;&gt;&lt;a href=&#34;#2&amp;#xC5D0;&amp;#xC11C;-&amp;#xBD84;&amp;#xC11D;&amp;#xD55C;-4&amp;#xAC00;&amp;#xC9C0;-&amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0;-&amp;#xB300;&amp;#xD574;-&amp;#xC548;&amp;#xC804;&amp;#xD55C;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xBC95;&amp;#xC744;-&amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;-&amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130;-&amp;#xC774;&amp;#xB807;&amp;#xAC8C;-&amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744;-&amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294;-&amp;#xC808;&amp;#xB300;-&amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;-&amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&#34; class=&#34;headerlink&#34; title=&#34;2&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&#34;&gt;&lt;/a&gt;2&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; 4&amp;#xAC00;&amp;#xC9C0; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xD588;&amp;#xC744; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0;&amp;#xB294; &amp;#xC808;&amp;#xB300; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/h1&gt;&lt;/li&gt;
&lt;li&gt;BOF &amp;#xAD00;&amp;#xB828; length &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCCA0;&amp;#xC800;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;Target-B&#34;&gt;&lt;a href=&#34;#Target-B&#34; class=&#34;headerlink&#34; title=&#34;Target B&#34;&gt;&lt;/a&gt;Target B&lt;/h1&gt;&lt;h2 id=&#34;1-Initial-exploration-1&#34;&gt;&lt;a href=&#34;#1-Initial-exploration-1&#34; class=&#34;headerlink&#34; title=&#34;#1 - Initial exploration&#34;&gt;&lt;/a&gt;#1 - Initial exploration&lt;/h2&gt;&lt;p&gt; Target B&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; interface&amp;#xC5D0;&amp;#xB294; App (iOS / Android)&amp;#xC640; Windows EXE&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows EXE&amp;#xC758; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; IP CAM&amp;#xC758; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; Web Interface&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;App&lt;ul&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xD488; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC124;&amp;#xBA85;&amp;#xC11C;&amp;#xC5D0; &amp;#xCD08;&amp;#xAE30; &amp;#xC124;&amp;#xC815;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xAF64;&amp;#xB098; &amp;#xCDE8;&amp;#xC57D;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;App&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294;, IP CAM&amp;#xC758; Wi-Fi&amp;#xC5D0; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C; &amp;#xAE30;&amp;#xAE30;&amp;#xAC00; &amp;#xC811;&amp;#xC18D;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB358; Wi-Fi &amp;#xC811;&amp;#xC18D; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB118;&amp;#xACA8;&amp;#xC8FC;&amp;#xBA74; &amp;#xCD08;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xAE30;&amp;#xAE30; &amp;#xB4F1;&amp;#xB85D; &amp;#xC644;&amp;#xB8CC; &amp;#xD6C4; &amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC601;&amp;#xC0C1; &amp;#xC2DC;&amp;#xCCAD; &amp;#xC774;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB179;&amp;#xD654;, &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;, &amp;#xCE74;&amp;#xBA54;&amp;#xB77C; &amp;#xC0C1;&amp;#xD558;&amp;#xC88C;&amp;#xC6B0; &amp;#xC774;&amp;#xB3D9;, &amp;#xBC84;&amp;#xC800;&amp;#xC74C; &amp;#xCD9C;&amp;#xB825; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Windows EXE&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xCEEC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Web Interface&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC758; IP &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294; CGI &amp;#xAE30;&amp;#xBC18; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. UI&amp;#xAC00; &amp;#xD5C8;&amp;#xC811;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC544; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/li&gt;
&lt;li&gt;App&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xBC31;&amp;#xC5C5; / &amp;#xB85C;&amp;#xB4DC;, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;2-Web-Interface&#34;&gt;&lt;a href=&#34;#2-Web-Interface&#34; class=&#34;headerlink&#34; title=&#34;#2 - Web Interface&#34;&gt;&lt;/a&gt;#2 - Web Interface&lt;/h2&gt;&lt;h3 id=&#34;2-1-System-configuration-backup-load&#34;&gt;&lt;a href=&#34;#2-1-System-configuration-backup-load&#34; class=&#34;headerlink&#34; title=&#34;#2.1 - System configuration backup / load&#34;&gt;&lt;/a&gt;#2.1 - System configuration backup / load&lt;/h3&gt;&lt;p&gt;Web interface&amp;#xC5D0;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC124;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC31;&amp;#xC5C5;(IP CAM &amp;#x2192; PC &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;)&amp;#xD558;&amp;#xACE0;, &amp;#xB85C;&amp;#xB4DC;(PC &amp;#x2192; IP CAM)&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC774;&amp;#xB7AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Header (0x200)&lt;ul&gt;
&lt;li&gt;MD5 hash &amp;#xC874;&amp;#xC7AC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Body&lt;ul&gt;
&lt;li&gt;TAR &amp;#xAD6C;&amp;#xC870;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;BODY &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; TAR &amp;#xAD6C;&amp;#xC870;&amp;#xC784;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8;, &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xACBD;&amp;#xB85C;&amp;#xC640; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574; &lt;code&gt;/etc/shadow&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB0B4;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB123;&amp;#xC5B4;&amp;#xC8FC;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; overwrite&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; MD5 hash&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE38;&amp;#xC774;&amp;#xAC00; MD5&amp;#xC784;&amp;#xC774; &amp;#xBD84;&amp;#xBA85;&amp;#xD55C;&amp;#xB370; &amp;#xAC12;&amp;#xC774; &amp;#xC804;&amp;#xD600; &amp;#xB9DE;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC911;,, 2019&amp;#xB144; &amp;#xD55C; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; MD5 &amp;#xAC12;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB3D9;&amp;#xC77C; IP CAM&amp;#xC758; &amp;#xB8E8;&amp;#xD2B8; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC774;&amp;#xB7F0;,,,, &amp;#xC774;&amp;#xBBF8; &amp;#xB204;&amp;#xAD70;&amp;#xAC00; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xAC83;&amp;#xC774; &amp;#xD2C0;&amp;#xB9BC; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F602; &amp;#xC774;&amp;#xD6C4; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; MD5 hash &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xACC4;&amp;#xC0B0;&amp;#xBC95;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC758; &amp;#xB178;&amp;#xB825;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-Firmware-update&#34;&gt;&lt;a href=&#34;#2-2-Firmware-update&#34; class=&#34;headerlink&#34; title=&#34;#2.2 - Firmware update&#34;&gt;&lt;/a&gt;#2.2 - Firmware update&lt;/h3&gt;&lt;p&gt;&amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xC758; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xBD84;&amp;#xBA85; &amp;#xBAA8;&amp;#xB450;&amp;#xAC00; &amp;#xC544;&amp;#xB294; ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC778;&amp;#xB370;&amp;#xB3C4; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC555;&amp;#xCD95; &amp;#xD574;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xC77C;&amp;#xBD80; customization&amp;#xB41C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC77C;&amp;#xBD80; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xACB0;&amp;#xACFC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; (&amp;#xC77C;&amp;#xBD80; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC740; &amp;#xD798;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC8E0;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;[https://blog.forensicresearch.kr/3](https://blog.forensicresearch.kr/3)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.forensicresearch.kr/3&#34;&gt;https://blog.forensicresearch.kr/3&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB358; &amp;#xC911;,, &amp;#xC81C;&amp;#xC870;&amp;#xC0AC; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD604;&amp;#xC7AC;&amp;#xBD80;&amp;#xD130; &amp;#xACFC;&amp;#xAC70;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xC74C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xAD6C;&amp;#xC870; &amp;#xD30C;&amp;#xC545;&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xAC00;&amp;#xBA70; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&lt;ul&gt;
&lt;li&gt;System config &amp;#xD30C;&amp;#xC77C;(firmware&amp;#xC640; &amp;#xAD6C;&amp;#xC870; &amp;#xAC19;&amp;#xC74C;) &amp;#xC0DD;&amp;#xC131; &amp;#xB85C;&amp;#xC9C1; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD574; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D; &amp;#xCD94;&amp;#xC801;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;b6c855a3-b38e-402f-bffd-ea5f99fa942b.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xACB0;&amp;#xACFC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB010; &amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCC0;&amp;#xACBD; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xC744;&amp;#xC9C0; &amp;#xB290;&amp;#xB084; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xADF8;&amp;#xC800; &amp;#xBD80;&amp;#xB7FD;&amp;#xB124;&amp;#xC694;&amp;#x2026;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ZIP &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870; &amp;#xBCC0;&amp;#xACBD;&lt;ul&gt;
&lt;li&gt;&amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB97C; &amp;#xB2E8;&amp;#xC21C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xC911;&amp;#xAC04;&amp;#xC5D0;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBD80;&amp;#xBD84; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD588;&amp;#xACE0;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC784;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;MD5 hash &amp;#xC0DD;&amp;#xC131; &amp;#xB85C;&amp;#xC9C1;&lt;ul&gt;
&lt;li&gt;&amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;MD5(BODY)&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xC600;&amp;#xC73C;&amp;#xB098;, &lt;code&gt;MD5(BODY + &amp;quot;secret string&amp;quot;)&lt;/code&gt; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xACE0;, &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xC704;&amp;#xCE58;&lt;ul&gt;
&lt;li&gt;2017&amp;#xB144;&amp;#xBD80;&amp;#xD130; 2021&amp;#xB144;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; App&amp;#xACFC; &amp;#xC5F0;&amp;#xB3D9;&amp;#xB418;&amp;#xB294; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xC5B4;&amp;#xB518;&amp;#xAC00;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;3-App&#34;&gt;&lt;a href=&#34;#3-App&#34; class=&#34;headerlink&#34; title=&#34;#3 - App&#34;&gt;&lt;/a&gt;#3 - App&lt;/h2&gt;&lt;p&gt;Android &amp;#xB8E8;&amp;#xD305; &amp;#xD3F0;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB358; &amp;#xAD00;&amp;#xACC4;&amp;#xB85C;, App &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xC548; &amp;#xD55C;&amp;#xAC8C; &amp;#xB9DE;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;..^^ iPhone&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD328;&amp;#xD0B7; &amp;#xCEA1;&amp;#xCCD0;&amp;#xB97C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xB9E5;&amp;#xBD81;&amp;#xACFC; iPhone&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xBA74; iPhone &amp;#xD328;&amp;#xD0B7; &amp;#xCEA1;&amp;#xCCD0;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;[https://lxxyeon.tistory.com/157](https://lxxyeon.tistory.com/157)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://lxxyeon.tistory.com/157&#34;&gt;https://lxxyeon.tistory.com/157&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;iPhone &amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xD328;&amp;#xD0B7;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; IP CAM&amp;#xACFC;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC774;&amp;#xB7AC;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC758; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C0;&amp;#xBA74; server&amp;#xC640; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD574;&amp;#xC694;. IP CAM&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; IP &amp;#xC640; &amp;#xC811;&amp;#xC18D; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; server&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD3EC;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; 1&amp;#xBD84;&amp;#xB9C8;&amp;#xB2E4; &amp;#xBC14;&amp;#xB00C;&amp;#xC5B4;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; App&amp;#xC744; &amp;#xCF1C;&amp;#xBA74; server&amp;#xC5D0; communication request&amp;#xB97C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; IP / port &amp;#xC815;&amp;#xBCF4;&amp;#xB85C; IP CAM&amp;#xC5D0; communicaiton request&amp;#xB97C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC8E0;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; IP / port &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB3FC;&amp;#xC694;.&lt;ul&gt;
&lt;li&gt;IP CAM&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Target B&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xACF5;&amp;#xACA9; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;, &amp;#xADF8;&amp;#xB4E4;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD50C;&amp;#xB798;&amp;#xC2DC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xCE69;&amp;#xC624;&amp;#xD504;&amp;#xD558;&amp;#xACE0;, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xB364;&amp;#xD504;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; BOF &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;RCE&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC258;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; IP CAM&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xB4E4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD50C;&amp;#xB798;&amp;#xC2DC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xBD80;&amp;#xD130; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC911;&amp;#xC694;&amp;#xD568;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC815;&amp;#xB9D0;&amp;#xB85C;, &amp;#xC815;&amp;#xB9D0;&amp;#xB85C; &amp;#xC774;&amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xC911;&amp;#xC694;&amp;#xD574;&amp;#xC694;..&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;4-Windows-EXE&#34;&gt;&lt;a href=&#34;#4-Windows-EXE&#34; class=&#34;headerlink&#34; title=&#34;#4 - Windows EXE&#34;&gt;&lt;/a&gt;#4 - Windows EXE&lt;/h2&gt;&lt;p&gt;Windows EXE&amp;#xB294; &amp;#xB85C;&amp;#xC9C1;&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC810;&amp;#xC740; App&amp;#xACFC; Windows EXE&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xC804;&amp;#xD600; &amp;#xB2EC;&amp;#xB790;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IP CAM&amp;#xC774; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774; &amp;#xB108;&amp;#xBB34;&amp;#xB098; &amp;#xB2E4;&amp;#xC591;&amp;#xD574; &amp;#xC798; &amp;#xCC3E;&amp;#xAE30;&amp;#xB9CC; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAF64;&amp;#xB098; &amp;#xB9CE;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB098;&amp;#xC62C; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xB4EF;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xB294; &amp;#xC57D; 3&amp;#xB2EC;(24.11 ~ 25.1)&amp;#xC5D0; &amp;#xAC78;&amp;#xCCD0; &amp;#xC774; &amp;#xAE00;&amp;#xC5D0; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; IP CAM 2&amp;#xAC1C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xC57D; 4&amp;#xAC1C;&amp;#xC758; IP CAM&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C; &amp;#xACBD;&amp;#xD5D8;&amp;#xD558;&amp;#xB294; IoT &amp;#xAE30;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C; &amp;#xBBF8;&amp;#xD761;&amp;#xD55C; &amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; Windows EXE &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC774;&amp;#xB77C; &amp;#xAF64;&amp;#xB098; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC81C;&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xC6B4; &amp;#xC810;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xB530;&amp;#xB85C; &amp;#xC788;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xAC70;&amp;#xCCD0;&amp;#xAC04; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC218;&amp;#xC900;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IP CAM&amp;#xC5D0;&amp;#xC11C; &amp;#xB108;&amp;#xBB34; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC5B4;&amp;#xB290;&amp;#xC815;&amp;#xB3C4; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;IoT &amp;#xAE30;&amp;#xAE30; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE30;&amp;#xCD08; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC694;&amp;#xAD6C;&amp;#xD55C;&amp;#xB2E4;. Windows EXE &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBD84;&amp;#xC11D;, &amp;#xC18C;&amp;#xCF13; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;, &amp;#xC6F9;&amp;#xD574;&amp;#xD0B9;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD574;&amp;#xD0B9;, &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC801; &amp;#xC811;&amp;#xADFC; &amp;#xB4F1; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xAC8C; &amp;#xB9CE;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCD94;&amp;#xCD9C;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xAD6C;&amp;#xCD95;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xC6B0;&amp;#xC120;&amp;#xC2DC; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/02/16/hunjison/IPCAM/ko/image%202.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/02/16/hunjison/ipcam/ko/">

  <title>[Research]  IP CAM   (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-02-16 20:00" pubdate>
      2025 2 16 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      88
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]  IP CAM   (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, hunjison&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xB294; &#xD574;&#xD0B9; &#xACF5;&#xBD80;&#xB97C; &#xD558;&#xBA74;&#xC11C; &#xD56D;&#xC0C1; &#xC544;&#xC26C;&#xC6E0;&#xB358; &#xC810;&#xC774; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xBC14;&#xB85C; CVE&#xAC00; &#xD558;&#xB098;&#xB3C4; &#xC5C6;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB358; &#xC5B4;&#xB290; &#xB0A0;,,, <code>OUYA77</code> &#xC5D0;&#xAC8C; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xD558;&#xB098; &#xB4E3;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB450;&#x2026;.&#xB465;..!! &#xBC14;&#xB85C; KISA&#xC5D0;&#xC11C; IP CAM 1.5 &#xBC30; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xC5C8;&#xB294;&#xB370;&#xC694;.</p>
<p>&#xC774;&#xAC78; &#xBCF4;&#xACE0; &#xBD80;&#xD130;&#xB294; &#xBAA8;&#xB4E0; IP CAM&#xC774; &#xB3C8;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC798;&#xD558;&#xBA74; CVE&#xB3C4; &#xBC1C;&#xAE09; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xACA0;&#xB2E4; &#xC0DD;&#xAC01;&#xD588;&#xC8E0;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<h1 id="IP-CAM-target-search"><a href="#IP-CAM-target-search" class="headerlink" title="IP CAM target search"></a>IP CAM target search</h1><p><code>OUYA77</code>&#xACFC; &#xD568;&#xAED8; &#xBC14;&#xB85C; IP CAM &#xC81C;&#xD488;&#xAD70; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xCD94;&#xB9AC;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC00;&#xC815;&#xC6A9; IP CAM&#xC740; 2&#xB9CC;&#xC6D0;&#xC5D0;&#xC11C; 10&#xB9CC;&#xC6D0; &#xC815;&#xB3C4;&#xC758; &#xAC00;&#xACA9;&#xB300;&#xC600;&#xACE0;, &#xAE30;&#xC5C5;&#xC6A9; IP CAM&#xC740; 20&#xB9CC;&#xC6D0;&#xB300;&#xBD80;&#xD130; 100&#xB9CC;&#xC6D0;&#xC774; &#xB118;&#xB294; &#xAC83;&#xAE4C;&#xC9C0; &#xB2E4;&#xC591;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xC800;&#xD76C;&#xB294; &#xAC00;&#xB09C;&#xD588;&#xACE0; &#xB3C8;&#xC740; &#xB9CE;&#xC774; &#xBC8C;&#xACE0; &#xC2F6;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xAC00;&#xC815;&#xC6A9; IP CAM&#xC744; &#xC5EC;&#xB7EC; &#xAC1C; &#xC0AC;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xADF8; &#xC911;&#xC5D0;&#xC11C;&#xB3C4; &#xC678;&#xBD80; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xC704;&#xC8FC;&#xB85C; Attack vector&#xAC00; &#xB9CE;&#xC740; &#xC81C;&#xD488;&#xC744; &#xC120;&#xC815;&#xD558;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xAC00; &#xD30C;&#xC545;&#xD55C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC544;&#xC694;.</p>
<ul>
<li>Wifi (AP)</li>
<li><strong>App (iOS/Android &#x2192; IP CAM)</strong></li>
<li><strong>Windows program</strong></li>
<li>External cloud storage</li>
<li>Ethernet</li>
<li>SDCard</li>
<li>USB</li>
</ul>
<p>&#xCD5C;&#xADFC; IP CAM &#xB4E4;&#xC740; &#xC704; &#xC5B8;&#xAE09;&#xD55C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xC911; &#xB300;&#xBD80;&#xBD84;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC0B4;&#xC9DD; &#xBE44;&#xC2B7;&#xD55C; &#xB290;&#xB08C;&#xC774; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xD38C;&#xC6E8;&#xC5B4;&#xAC00; &#xC628;&#xB77C;&#xC778;&#xC5D0;&#xC11C; &#xD68D;&#xB4DD; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0;&#xB97C; &#xACE0;&#xB824;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; 4&#xAC1C;&#xC758; &#xC791;&#xACE0; &#xADC0;&#xC5EC;&#xC6B4; IP CAM&#xB4E4;&#xC744; &#xAD6C;&#xB9E4;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xC911;&#xC5D0;&#xC11C;&#xB3C4; 2&#xAC1C; IP CAM&#xC758; &#xBD84;&#xC11D; &#xD6C4;&#xAE30;&#xB97C; &#xC18C;&#xAC1C;&#xD560;&#xAC8C;&#xC694;.</p>
<h1 id="Target-A"><a href="#Target-A" class="headerlink" title="Target A"></a>Target A</h1><h2 id="1-Initial-exploration"><a href="#1-Initial-exploration" class="headerlink" title="#1 - Initial exploration"></a>#1 - Initial exploration</h2><p>Target A&#xC758; &#xC0AC;&#xC6A9;&#xC790; interface&#xC5D0;&#xB294; App (iOS / Android)&#xC640; Windows EXE&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798;&#xB294; &#xCD08;&#xAE30; &#xBD84;&#xC11D;&#xC744; &#xC218;&#xD589;&#xD55C; &#xB0B4;&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>App<ul>
<li>&#xD68C;&#xC6D0;&#xAC00;&#xC785;/&#xB85C;&#xADF8;&#xC778;&#xC774; &#xD544;&#xC218;&#xC774;&#xACE0;, App &#x2192; &#xC11C;&#xBC84;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC784;</li>
<li>&#xAE30;&#xAE30; &#xB4F1;&#xB85D; &#xC2DC; App&#xC758; QR code&#xB97C; &#xAE30;&#xAE30;&#xC5D0; &#xC778;&#xC2DD;&#xC2DC;&#xCF1C;&#xC57C; &#xD558;&#xBA70;, &#xC5EC;&#xAE30;&#xC5D0;&#xB294; Wi-Fi &#xC811;&#xC18D; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB428;</li>
<li>&#xAE30;&#xAE30; &#xB4F1;&#xB85D; &#xC644;&#xB8CC; &#xD6C4; &#xC601;&#xC0C1; &#xC2DC;&#xCCAD;&#xC774; &#xAC00;&#xB2A5;&#xD568;</li>
</ul>
</li>
<li>Windows &#xD504;&#xB85C;&#xADF8;&#xB7A8;<ul>
<li>&#xD68C;&#xC6D0;&#xAC00;&#xC785;/&#xB85C;&#xADF8;&#xC778;&#xD560; &#xACBD;&#xC6B0;, EXE &#x2192; &#xC11C;&#xBC84;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC784;</li>
<li>&#xB85C;&#xADF8;&#xC778; &#xC774;&#xD6C4; LAN &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC788;&#xB294; &#xAE30;&#xAE30;&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD0D0;&#xC0C9;&#xD568;. &#xAE30;&#xAE30; &#xB4F1;&#xB85D;&#xC740; &#xAE30;&#xAE30;&#xC758; &#xC2DC;&#xB9AC;&#xC5BC; &#xBC88;&#xD638;&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;</li>
<li>&#xB85C;&#xADF8;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xACBD;&#xC6B0; LAN &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xAE30;&#xAE30;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xACE0; &#xC601;&#xC0C1;&#xC744; &#xC2DC;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC74C;</li>
</ul>
</li>
<li>&#xC778;&#xD130;&#xB137;&#xC5D0; &#xACF5;&#xAC1C;&#xB41C; &#xBE14;&#xB85C;&#xADF8; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0;&#xC11C; &#xD38C;&#xC6E8;&#xC5B4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC29;&#xBC95; &#xC54C;&#xC544;&#xB0C4;<ul>
<li>&#xACF5;&#xC2DD; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; <code>/device/{device-model}/{device-model}</code> &#xD615;&#xD0DC;&#xC758; URL &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xAC00;&#xB2A5;</li>
<li><code>binwalk</code> &#xC774;&#xC6A9;&#xD574; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB2C8; <code>squashfs</code> &#xD30C;&#xC77C;&#xC2DC;&#xC2A4;&#xD15C;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD574; &#xD30C;&#xC77C; &#xCD94;&#xCD9C;&#xD568;</li>
</ul>
</li>
</ul>
<h2 id="2-Windows-EXE-analysis"><a href="#2-Windows-EXE-analysis" class="headerlink" title="#2 - Windows EXE analysis"></a>#2 - Windows EXE analysis</h2><p>Windows &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xAC83;&#xB4E4;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB824; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xB85C;&#xADF8;&#xC778; &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xC11C;&#xBC84;&#xC640; &#xC5B4;&#xB5A4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0; &#xBC1B;&#xB294;&#xC9C0;?</li>
<li>&#xC601;&#xC0C1; &#xC2DC;&#xCCAD; &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xC11C;&#xBC84; / IP CAM&#xACFC; &#xC5B4;&#xB5A4; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xD1B5;&#xD574; &#xC778;&#xC99D;&#xD558;&#xB294;&#xC9C0;?</li>
</ul>
<p>&#xC6B0;&#xC120; Wireshark&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBD84;&#xC11D;&#xC744; &#xC2DC;&#xB3C4;&#xD588;&#xC5B4;&#xC694;.</p>
<ul>
<li>TLS &#xC554;&#xD638;&#xD654; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC778;&#xC2DD; &#xAC00;&#xB2A5;&#xD55C; &#xD328;&#xD0B7;&#xC774; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; <code>SSLKEYLOGFILE</code>&#xB97C; &#xCD94;&#xCD9C;&#xD574; Wireshark&#xC5D0;&#xC11C; TLS &#xD328;&#xD0B7;&#xC744; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xB4EF;&#xC774;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; TLS &#xB85C;&#xC9C1;&#xC744; &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xD574; Key &#xD30C;&#xC77C;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xB824; &#xC2DC;&#xB3C4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; TLS &#xAD6C;&#xC870; &#xD30C;&#xC545;&#xD574;&#xC11C; &#xB9AC;&#xBC84;&#xC2F1;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB824;&#xC6CC; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xB2E4;&#xD589;&#xD788; &#xC774;&#xC804;&#xC5D0; Frida &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF8; &#xACBD;&#xD5D8;&#xC774; &#xC788;&#xC5C8;&#xACE0;, Frida&#xB97C; &#xC774;&#xC6A9;&#xD574; SSL &#xAD00;&#xB828; &#xC554;&#xBCF5;&#xD638;&#xD654; &#xD568;&#xC218;&#xB4E4;&#xC744; Hooking &#xC2DC;&#xB3C4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Windows EXE&#xC5D0;&#xC11C; Import&#xD558;&#xB294; SSL &#xAD00;&#xB828; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xC2DD;&#xBCC4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xD568;&#xC218;&#xC758; argument &#xAC12; &#xB610;&#xB294; return buffer&#xB97C; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xB97C; &#xCC38;&#xACE0;&#xD574; &#xC801;&#xC808;&#xD788; &#xCD9C;&#xB825;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB978;&#xCABD; &#xC0AC;&#xC9C4;&#xC744; &#xBCF4;&#xBA74;, HTTP 200&#xC774; &#xBCF4;&#xC774;&#xB124;&#xC694;!</li>
</ul>
<p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>Frida Hooking &#xBC29;&#xBC95;&#xC744; &#xD1B5;&#xD574; Windows EXE &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-1-Watching-video-after-user-login-WAN-network"><a href="#2-1-Watching-video-after-user-login-WAN-network" class="headerlink" title="#2.1 - Watching video after user login (WAN network)"></a>#2.1 - Watching video after user login (WAN network)</h3><p>Windows &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; IP CAM&#xC774; &#xAC19;&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC788;&#xC9C0; &#xC54A;&#xC740; WAN &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294;, &#xC544;&#xB798; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xB85C; &#xD1B5;&#xC2E0;&#xD574;&#xC694;.</p>
<ul>
<li>TLS &#xBCF5;&#xD638;&#xD654;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xB098;&#xBA74;, &#xC11C;&#xBC84;&#xC5D0; &#xC0AC;&#xC6A9;&#xC790; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC804;&#xB2EC;&#xD574;&#xC694;.</li>
<li>&#xC778;&#xC99D;&#xC5D0; &#xC131;&#xACF5;&#xD558;&#xBA74; &#xC11C;&#xBC84;&#xAC00; &#xC601;&#xC0C1; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xB0B4;&#xC90D;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xADF8;&#xB7EC;&#xB098; IP CAM&#xACFC; server&#xAC00; &#xC8FC;&#xACE0; &#xBC1B;&#xB294; TLS 1.2&#xB85C; &#xC554;&#xD638;&#xD654;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB294; &#xBCF5;&#xD638;&#xD654;&#xAC00; &#xBD88;&#xAC00;&#xD588;&#xC5B4;&#xC694;. TLS 1.2 &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xACBD;&#xC6B0; Cipher suite&#xAC00; RSA&#xC778; &#xACBD;&#xC6B0;&#xC5D0;&#xB9CC; &#xBA87;&#xBA87; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC774; &#xC54C;&#xB824;&#xC838; &#xC788;&#xB2E4;&#xACE0; &#xD558;&#xB294;&#xB370;, &#xBD84;&#xC11D; &#xB300;&#xC0C1; IP CAM&#xC758; Cipher suite&#xB294; <code>TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256</code>&#xB85C; MITM &#xACF5;&#xACA9;&#xC774; &#xBD88;&#xAC00;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="See-also-Packet-sniffing-with-Wi-Fi-dongle"><a href="#See-also-Packet-sniffing-with-Wi-Fi-dongle" class="headerlink" title="[See also] Packet sniffing with Wi-Fi dongle"></a>[See also] Packet sniffing with Wi-Fi dongle</h3><p>IP CAM&#xACFC; &#xC11C;&#xBC84;&#xAC00; &#xC8FC;&#xACE0; &#xBC1B;&#xB294; &#xD328;&#xD0B7;&#xC744; &#xCEA1;&#xCCD0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; Wi-Fi dongle&#xC744; &#xC774;&#xC6A9;&#xD588;&#xC5B4;&#xC694;. Dongle&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C;&#xB294; Wi-Fi &#xAE30;&#xB2A5;&#xC774; &#xC5C6;&#xB294; &#xAE30;&#xAE30;&#xC5D0;&#xC11C; Wi-Fi&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;&#xC694;. &#xC6B0;&#xB9AC;&#xB294; &#xBC18;&#xB300;&#xB85C; PC&#xC5D0; &#xC5F0;&#xACB0;&#xB41C; &#xC774;&#xB354;&#xB137;&#xC744; Wi-Fi&#xB85C; &#xBFCC;&#xB824;&#xC8FC;&#xAE30; &#xC704;&#xD55C; &#xBAA9;&#xC801;&#xC73C;&#xB85C; dongle&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>&#xC544;&#xB798; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; dongle&#xC774; &#xACF5;&#xC720;&#xAE30;&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li>Wireshark&#xC5D0;&#xC11C; dongle &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xC120;&#xD0DD;&#xD574; &#xCEA1;&#xCCD0;&#xD558;&#xBA74;, IP CAM&#xC73C;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xBAA8;&#xB4E0; &#xD328;&#xD0B7;&#xC774; &#xCEA1;&#xCCD0; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<h3 id="2-2-Watching-video-after-user-login-LAN-network"><a href="#2-2-Watching-video-after-user-login-LAN-network" class="headerlink" title="#2.2 - Watching video after user login (LAN network)"></a>#2.2 - Watching video after user login (LAN network)</h3><p>&#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xB85C;&#xC9C1;&#xC740; LAN &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Windows EXE&#xC640; IP CAM&#xC774; LAN encrypt key&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD574; &#xC8FC;&#xACE0; &#xBC1B;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD588;&#xC744; &#xB54C;, &#xC800;&#xB294; &#xB2F9;&#xC5F0;&#xD788; &#xACE0;&#xC815;&#xD0A4;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; Target A&#xB97C; &#xB108;&#xBB34; &#xC595;&#xBD24;&#xB358; &#xAC83;&#xC774;&#xC8E0;,,,</p>
<p>&#xC544;&#xB798; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xC0AC;&#xC6A9;&#xC790; &#xB85C;&#xADF8;&#xC778; &#xC2DC; &#xC11C;&#xBC84;&#xAC00; JWT Token&#xC744; &#xBC1C;&#xAE09;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; LAN encrypt key&#xB97C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. Server&#xC640; IP CAM &#xAC04;&#xC5D0;&#xB3C4; &#xC720;&#xC0AC;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; LAN encrypt key&#xAC00; &#xC804;&#xB2EC;&#xB420; &#xAC83;&#xC73C;&#xB85C; &#xCD94;&#xCE21;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<h3 id="2-3-Watching-video-with-no-user-login-LAN-network"><a href="#2-3-Watching-video-with-no-user-login-LAN-network" class="headerlink" title="#2.3 - Watching video with no user login (LAN network)"></a>#2.3 - Watching video with no user login (LAN network)</h3><p>Target A&#xC5D0;&#xC11C;&#xB294; &#xB85C;&#xADF8;&#xC778; &#xC5C6;&#xC774; LAN &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xAE30;&#xAE30;&#xB97C; &#xC2A4;&#xCE94;&#xD574; &#xC601;&#xC0C1;&#xC744; &#xC2DC;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xC601;&#xC0C1; &#xC2DC;&#xCCAD;&#xC744; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xAC00; &#xD544;&#xC694;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Windows EXE&#xC5D0;&#xC11C;&#xB294; &#xD55C; &#xBC88; &#xC131;&#xACF5;&#xD55C; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xCE90;&#xC2F1;&#xD574;&#xC11C; &#xB2E4;&#xC74C;&#xBD80;&#xD130;&#xB294; &#xBCC4;&#xB3C4;&#xB85C; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xBB3C;&#xC5B4;&#xBCF4;&#xC9C0; &#xC54A;&#xAE30;&#xB3C4; &#xD558;&#xB294;&#xB370;, &#xC800;&#xB294; &#xADF8;&#xAC78; &#xC78A;&#xC5B4;&#xBC84;&#xB824; &#xC81C;&#xAC00; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC558;&#xB2E4;&#xACE0; &#xCC29;&#xAC01;&#xD588;&#xC5C8;&#xC8E0;. &#xBCF4;&#xACE0;&#xC11C; &#xC791;&#xC131; &#xC9C1;&#xC804;&#xAE4C;&#xC9C0; &#xAC00;&#xC11C;&#xC57C; &#xBB34;&#xC5B8;&#xAC00; &#xC798;&#xBABB;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xAE68;&#xB2EC;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;..</li>
</ul>
<p><img src="image%205.png" srcset="/img/loading.gif" alt="image.png"></p>
<h3 id="2-4-Watching-video-with-no-user-login-RTSP-protocol"><a href="#2-4-Watching-video-with-no-user-login-RTSP-protocol" class="headerlink" title="#2.4 - Watching video with no user login (RTSP protocol)"></a>#2.4 - Watching video with no user login (RTSP protocol)</h3><p>Target A&#xB294; RTSP &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB3C4; &#xC9C0;&#xC6D0;&#xD588;&#xB294;&#xB370;&#xC694;. RTSP(Real Time Streaming Protocol)&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xC624;&#xB514;&#xC624;, &#xBE44;&#xB514;&#xC624;, &#xB370;&#xC774;&#xD130; &#xB4F1;&#xC758; &#xBA40;&#xD2F0;&#xBBF8;&#xB514;&#xC5B4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;. &#xC778;&#xD130;&#xB137; &#xBE14;&#xB85C;&#xADF8; &#xAC8C;&#xC2DC;&#xAE00;&#xC744; &#xD1B5;&#xD574; Target A&#xC758; RTSP URL&#xC744; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>&#xACFC;&#xAC70; &#xBC84;&#xC804;&#xC758; Target A&#xC5D0;&#xC11C;&#xB294; <strong>6&#xC790;&#xB9AC;&#xC758; device code&#xB97C; RTSP &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB85C; &#xC774;&#xC6A9;</strong>&#xD588;&#xC73C;&#xB098;, &#xCD5C;&#xC2E0; &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xAE30; &#xB4F1;&#xB85D; &#xC2DC; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC124;&#xC815;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="3-API-server"><a href="#3-API-server" class="headerlink" title="#3 - API server"></a>#3 - API server</h2><p>Frida&#xB85C; Windows EXE&#xB97C; hooking&#xD558;&#xB2E4;&#xAC00; API &#xC11C;&#xBC84;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xBC1C;&#xACAC;&#xD588;&#xC5B4;&#xC694;. Windows &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xB3D9;&#xC77C; &#xAE30;&#xB2A5;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0;&#xB9CC;, &#xBB34;&#xB824; Internet explorer&#xC5D0;&#xC11C;&#xB9CC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; !!! &#xC544;&#xC8FC; &#xD5C8;&#xB984;&#xD55C; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xC600;&#xC8E0;. Windows &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xD68C;&#xC6D0; &#xAC00;&#xC785;, &#xAE30;&#xAE30; &#xB4F1;&#xB85D;, &#xD328;&#xC2A4;&#xC6CC;&#xB4DC; &#xBCC0;&#xACBD; &#xB4F1; &#xAE30;&#xB2A5;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA87;&#xBA87; &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xD14C;&#xC2A4;&#xD2B8;&#xD574;&#xBCF4;&#xB824;&#xACE0; &#xACE0;&#xBBFC;&#xD558;&#xB358; &#xC911;, &#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;&#xC758; &#xBC94;&#xC704;&#xB97C; &#xBC97;&#xC5B4;&#xB09C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xAE68;&#xB2EB;&#xACE0; &#xBD84;&#xC11D;&#xC744; &#xBA48;&#xCDC4;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<h2 id="4-Firmware-analysis"><a href="#4-Firmware-analysis" class="headerlink" title="#4 - Firmware analysis"></a>#4 - Firmware analysis</h2><p>&#xBD84;&#xC11D; &#xCD08;&#xAE30;&#xC5D0; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xD68D;&#xB4DD;&#xD588;&#xB2E4;&#xACE0; &#xC5B8;&#xAE09;&#xD588;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xBD80;&#xBD84;&#xB4E4;&#xC744; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD588;&#xC73C;&#xB098; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Command Injection: &#xC2DC;&#xC2A4;&#xD15C; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC778;&#xC790;&#xB85C; &#xBC1B;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC788;&#xC5B4; &#xD574;&#xB2F9; &#xBD80;&#xBD84; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD588;&#xC73C;&#xB098; &#xC2E4;&#xD328;</li>
<li>BOF / DOS attack: &#xC0AC;&#xC6A9;&#xC790; request &#xCC98;&#xB9AC; &#xACFC;&#xC815;&#xC5D0;&#xC11C; length &#xAC80;&#xC99D;&#xC744; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xD558;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBD24;&#xB294;&#xB370;, &#xBCC4;&#xB3C4;&#xB85C; &#xCC3E;&#xC9C0; &#xBABB;&#xD588;&#xC74C;</li>
</ul>
<h2 id="5-Result"><a href="#5-Result" class="headerlink" title="#5 - Result"></a>#5 - Result</h2><p>Target A&#xC5D0;&#xC11C;&#xB294; Windows EXE &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xBCC4; &#xB85C;&#xC9C1;&#xC744; &#xC8FC;&#xB85C; &#xBD84;&#xC11D;&#xD588;&#xB294;&#xB370;&#xC694;. &#xC544;&#xC27D;&#xAC8C;&#xB3C4; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xC218;&#xAC00; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Target A&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080; &#xC810;&#xC740;, &#xC774;&#xBBF8; &#xB9CE;&#xC740; &#xD574;&#xCEE4;&#xB4E4;&#xC774; &#xD574;&#xB2F9; &#xC81C;&#xD488;&#xC744; &#xAC70;&#xCCD0;&#xAC04; &#xAC78;&#xB85C; &#xBCF4;&#xC778;&#xB2E4;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><h1 id="2&#xC5D0;&#xC11C;-&#xBD84;&#xC11D;&#xD55C;-4&#xAC00;&#xC9C0;-&#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0;-&#xB300;&#xD574;-&#xC548;&#xC804;&#xD55C;-&#xC554;&#xD638;&#xD654;-&#xBC29;&#xBC95;&#xC744;-&#xC801;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;-&#xCC98;&#xC74C;&#xBD80;&#xD130;-&#xC774;&#xB807;&#xAC8C;-&#xC124;&#xACC4;&#xD588;&#xC744;-&#xAC70;&#xB77C;&#xACE0;&#xB294;-&#xC808;&#xB300;-&#xC0DD;&#xAC01;&#xD558;&#xC9C0;-&#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;"><a href="#2&#xC5D0;&#xC11C;-&#xBD84;&#xC11D;&#xD55C;-4&#xAC00;&#xC9C0;-&#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0;-&#xB300;&#xD574;-&#xC548;&#xC804;&#xD55C;-&#xC554;&#xD638;&#xD654;-&#xBC29;&#xBC95;&#xC744;-&#xC801;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;-&#xCC98;&#xC74C;&#xBD80;&#xD130;-&#xC774;&#xB807;&#xAC8C;-&#xC124;&#xACC4;&#xD588;&#xC744;-&#xAC70;&#xB77C;&#xACE0;&#xB294;-&#xC808;&#xB300;-&#xC0DD;&#xAC01;&#xD558;&#xC9C0;-&#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;" class="headerlink" title="2&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xD55C; 4&#xAC00;&#xC9C0; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0; &#xB300;&#xD574; &#xC548;&#xC804;&#xD55C; &#xC554;&#xD638;&#xD654; &#xBC29;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xC774;&#xB807;&#xAC8C; &#xC124;&#xACC4;&#xD588;&#xC744; &#xAC70;&#xB77C;&#xACE0;&#xB294; &#xC808;&#xB300; &#xC0DD;&#xAC01;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.."></a>2&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xD55C; 4&#xAC00;&#xC9C0; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0; &#xB300;&#xD574; &#xC548;&#xC804;&#xD55C; &#xC554;&#xD638;&#xD654; &#xBC29;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xC774;&#xB807;&#xAC8C; &#xC124;&#xACC4;&#xD588;&#xC744; &#xAC70;&#xB77C;&#xACE0;&#xB294; &#xC808;&#xB300; &#xC0DD;&#xAC01;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;..</h1></li>
<li>BOF &#xAD00;&#xB828; length &#xAC80;&#xC99D;&#xC774; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCCA0;&#xC800;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<h1 id="Target-B"><a href="#Target-B" class="headerlink" title="Target B"></a>Target B</h1><h2 id="1-Initial-exploration-1"><a href="#1-Initial-exploration-1" class="headerlink" title="#1 - Initial exploration"></a>#1 - Initial exploration</h2><p> Target B&#xC758; &#xC0AC;&#xC6A9;&#xC790; interface&#xC5D0;&#xB294; App (iOS / Android)&#xC640; Windows EXE&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Windows EXE&#xC758; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBD84;&#xC11D;&#xC744; &#xC218;&#xD589;&#xD558;&#xB2E4; IP CAM&#xC758; IP &#xC8FC;&#xC18C;&#xC5D0; Web Interface&#xB97C; &#xCD94;&#xAC00;&#xB85C; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>App<ul>
<li>&#xC81C;&#xD488; &#xC0AC;&#xC6A9;&#xC124;&#xBA85;&#xC11C;&#xC5D0; &#xCD08;&#xAE30; &#xC124;&#xC815;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBD80;&#xBD84;&#xC774; &#xAF64;&#xB098; &#xCDE8;&#xC57D;&#xD574; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>App&#xC744; &#xD1B5;&#xD574; &#xAE30;&#xAE30;&#xB97C; &#xB4F1;&#xB85D;&#xD560; &#xB54C;&#xC5D0;&#xB294;, IP CAM&#xC758; Wi-Fi&#xC5D0; &#xBAA8;&#xBC14;&#xC77C; &#xAE30;&#xAE30;&#xAC00; &#xC811;&#xC18D;&#xD55C; &#xD6C4;&#xC5D0; &#xBAA8;&#xBC14;&#xC77C; &#xAE30;&#xAE30;&#xC5D0;&#xC11C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB358; Wi-Fi &#xC811;&#xC18D; &#xC815;&#xBCF4;&#xB97C; &#xB118;&#xACA8;&#xC8FC;&#xBA74; &#xCD08;&#xAE30; &#xB4F1;&#xB85D;&#xC774; &#xC644;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xAE30;&#xAE30; &#xB4F1;&#xB85D; &#xC644;&#xB8CC; &#xD6C4; &#xC601;&#xC0C1; &#xC2DC;&#xCCAD;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC601;&#xC0C1; &#xC2DC;&#xCCAD; &#xC774;&#xC678;&#xC5D0;&#xB3C4; &#xB179;&#xD654;, &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC5C5;&#xB85C;&#xB4DC;, &#xCE74;&#xBA54;&#xB77C; &#xC0C1;&#xD558;&#xC88C;&#xC6B0; &#xC774;&#xB3D9;, &#xBC84;&#xC800;&#xC74C; &#xCD9C;&#xB825; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xB2A5;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Windows EXE<ul>
<li>&#xB85C;&#xCEEC; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC788;&#xB294; &#xAE30;&#xAE30;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xACE0; &#xB4F1;&#xB85D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xB9CE;&#xC740; &#xAE30;&#xB2A5;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>Web Interface<ul>
<li>IP CAM&#xC758; IP &#xC8FC;&#xC18C;&#xC5D0; &#xC5F4;&#xB824;&#xC788;&#xB294; CGI &#xAE30;&#xBC18; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;. &#xC6F9;&#xC0AC;&#xC774;&#xD2B8; &#xC811;&#xC18D;&#xC744; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xC790; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB85C; &#xC778;&#xC99D;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. UI&#xAC00; &#xD5C8;&#xC811;&#xD574; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB9CE;&#xC544; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;!!</li>
<li>App&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC124;&#xC815; &#xD30C;&#xC77C; &#xBC31;&#xC5C5; / &#xB85C;&#xB4DC;, &#xD38C;&#xC6E8;&#xC5B4; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xAE30;&#xB2A5;</strong>&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<h2 id="2-Web-Interface"><a href="#2-Web-Interface" class="headerlink" title="#2 - Web Interface"></a>#2 - Web Interface</h2><h3 id="2-1-System-configuration-backup-load"><a href="#2-1-System-configuration-backup-load" class="headerlink" title="#2.1 - System configuration backup / load"></a>#2.1 - System configuration backup / load</h3><p>Web interface&#xC5D0;&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xC124;&#xC815; &#xD30C;&#xC77C;&#xC744; &#xBC31;&#xC5C5;(IP CAM &#x2192; PC &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;)&#xD558;&#xACE0;, &#xB85C;&#xB4DC;(PC &#x2192; IP CAM)&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xD30C;&#xC77C;&#xC758; &#xAD6C;&#xC870;&#xAC00; &#xC774;&#xB7AC;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Header (0x200)<ul>
<li>MD5 hash &#xC874;&#xC7AC;</li>
</ul>
</li>
<li>Body<ul>
<li>TAR &#xAD6C;&#xC870;</li>
</ul>
</li>
</ul>
<p>BODY &#xD544;&#xB4DC;&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; TAR &#xAD6C;&#xC870;&#xC784;&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xACE0; &#xCD94;&#xCD9C;&#xD574;&#xBCF4;&#xB2C8;, &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xCC98;&#xB7FC; &#xD30C;&#xC77C;&#xC758; &#xACBD;&#xB85C;&#xC640; &#xC6D0;&#xBCF8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xAD6C;&#xC870;&#xB97C; &#xC218;&#xC815;&#xD574; <code>/etc/shadow</code> &#xACBD;&#xB85C;&#xC5D0; &#xB0B4;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB123;&#xC5B4;&#xC8FC;&#xBA74; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; overwrite&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC8E0;.</p>
<p><img src="image%208.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xBB38;&#xC81C;&#xB294; MD5 hash&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAE38;&#xC774;&#xAC00; MD5&#xC784;&#xC774; &#xBD84;&#xBA85;&#xD55C;&#xB370; &#xAC12;&#xC774; &#xC804;&#xD600; &#xB9DE;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB358; &#xC911;,, 2019&#xB144; &#xD55C; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0;&#xC11C; MD5 &#xAC12;&#xC744; &#xB9DE;&#xCDB0; &#xB3D9;&#xC77C; IP CAM&#xC758; &#xB8E8;&#xD2B8; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xBCC0;&#xACBD;&#xD55C; &#xC0AC;&#xB840;&#xB97C; &#xC54C;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xC774;&#xB7F0;,,,, &#xC774;&#xBBF8; &#xB204;&#xAD70;&#xAC00; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC81C;&#xBCF4;&#xD574; &#xD328;&#xCE58;&#xB41C; &#xAC83;&#xC774; &#xD2C0;&#xB9BC; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F602; &#xC774;&#xD6C4; &#xD38C;&#xC6E8;&#xC5B4; &#xCD94;&#xCD9C; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xB354; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC9C0;&#xB9CC; MD5 hash &#xD544;&#xB4DC;&#xC758; &#xACC4;&#xC0B0;&#xBC95;&#xC740; &#xD574;&#xCEE4;&#xB4E4;&#xC758; &#xB178;&#xB825;&#xC5D0; &#xB530;&#xB77C; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-2-Firmware-update"><a href="#2-2-Firmware-update" class="headerlink" title="#2.2 - Firmware update"></a>#2.2 - Firmware update</h3><p>&#xC81C;&#xC870;&#xC0AC;&#xC758; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xBD84;&#xBA85; &#xBAA8;&#xB450;&#xAC00; &#xC544;&#xB294; ZIP &#xAD6C;&#xC870;&#xC778;&#xB370;&#xB3C4; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC555;&#xCD95; &#xD574;&#xC81C;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC544; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2C8; &#xAD6C;&#xC870;&#xC5D0; &#xC77C;&#xBD80; customization&#xB41C; &#xBD80;&#xBD84;&#xC774; &#xC874;&#xC7AC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>ZIP &#xAD6C;&#xC870;&#xC5D0; &#xB9DE;&#xCDB0; &#xB530;&#xB77C;&#xAC00;&#xBA74;&#xC11C; &#xADDC;&#xCE59;&#xC744; &#xD30C;&#xC545;&#xD574; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC77C;&#xBD80; &#xC218;&#xC815;&#xD574;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xACB0;&#xACFC; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xB370;&#xC5D0; &#xC131;&#xACF5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4; (&#xC77C;&#xBD80; &#xC5D0;&#xB7EC;&#xAC00; &#xBC1C;&#xC0DD;&#xD574; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C; &#xCD94;&#xCD9C;&#xC740; &#xD798;&#xB4E4;&#xC5C8;&#xC8E0;)</p>
<p><img src="image%209.png" srcset="/img/loading.gif" alt="[https://blog.forensicresearch.kr/3](https://blog.forensicresearch.kr/3)"></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.forensicresearch.kr/3">https://blog.forensicresearch.kr/3</a></p>
<p>&#xADF8;&#xB7EC;&#xB358; &#xC911;,, &#xC81C;&#xC870;&#xC0AC; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xD604;&#xC7AC;&#xBD80;&#xD130; &#xACFC;&#xAC70;&#xAE4C;&#xC9C0; &#xD38C;&#xC6E8;&#xC5B4; &#xBAA8;&#xC74C;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xD76C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>ZIP &#xAD6C;&#xC870; &#xD30C;&#xC545;<ul>
<li>ZIP &#xAD6C;&#xC870;&#xC5D0; &#xB9DE;&#xCDB0; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xBCC0;&#xACBD;&#xD574;&#xAC00;&#xBA70; &#xD38C;&#xC6E8;&#xC5B4; &#xCD94;&#xCD9C;</li>
</ul>
</li>
<li>&#xBA54;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB9AC;&#xBC84;&#xC2F1;<ul>
<li>System config &#xD30C;&#xC77C;(firmware&#xC640; &#xAD6C;&#xC870; &#xAC19;&#xC74C;) &#xC0DD;&#xC131; &#xB85C;&#xC9C1; &#xB9AC;&#xBC84;&#xC2F1;&#xD574; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D; &#xCD94;&#xC801;</li>
</ul>
</li>
</ul>
<p><img src="b6c855a3-b38e-402f-bffd-ea5f99fa942b.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xBD84;&#xC11D; &#xACB0;&#xACFC; &#xD38C;&#xC6E8;&#xC5B4; &#xBC84;&#xC804;&#xC774; &#xC62C;&#xB77C;&#xAC00;&#xBA74;&#xC11C; &#xBC14;&#xB010; &#xC810;&#xB4E4;&#xC744; &#xC54C;&#xC544;&#xB0BC; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBCC0;&#xACBD; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5BC;&#xB9C8;&#xB098; &#xB9CE;&#xC740; &#xD574;&#xCEE4;&#xAC00; &#xCC38;&#xC5EC;&#xD588;&#xC744;&#xC9C0; &#xB290;&#xB084; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xADF8;&#xC800; &#xBD80;&#xB7FD;&#xB124;&#xC694;&#x2026;</p>
<ul>
<li>ZIP &#xD30C;&#xC77C; &#xAD6C;&#xC870; &#xBCC0;&#xACBD;<ul>
<li>&#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xB2E8;&#xC21C; &#xBCC0;&#xACBD;&#xD574; &#xC54C;&#xC544;&#xBCFC; &#xC218; &#xC5C6;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC73C;&#xB098;, &#xC911;&#xAC04;&#xC5D0;&#xB294; &#xD30C;&#xC77C;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC744; &#xBD80;&#xBD84; &#xC554;&#xD638;&#xD654;&#xD588;&#xACE0;, &#xD604;&#xC7AC;&#xB294; &#xD30C;&#xC77C; &#xC804;&#xCCB4;&#xAC00; &#xC554;&#xD638;&#xD654;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC784;</li>
</ul>
</li>
<li>MD5 hash &#xC0DD;&#xC131; &#xB85C;&#xC9C1;<ul>
<li>&#xCD08;&#xAE30;&#xC5D0;&#xB294; <code>MD5(BODY)</code> &#xD615;&#xD0DC;&#xC600;&#xC73C;&#xB098;, <code>MD5(BODY + &quot;secret string&quot;)</code> &#xD615;&#xD0DC;&#xB85C; &#xBC14;&#xB00C;&#xACE0;, &#xD604;&#xC7AC;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC74C;</li>
</ul>
</li>
<li>&#xD38C;&#xC6E8;&#xC5B4; &#xD30C;&#xC77C; &#xC5C5;&#xB85C;&#xB4DC; &#xC704;&#xCE58;<ul>
<li>2017&#xB144;&#xBD80;&#xD130; 2021&#xB144;&#xAE4C;&#xC9C0; &#xD38C;&#xC6E8;&#xC5B4;&#xB294; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xC5C5;&#xB85C;&#xB4DC; &#xB418;&#xC5C8;&#xC73C;&#xB098;, &#xADF8; &#xC774;&#xD6C4;&#xC5D0;&#xB294; App&#xACFC; &#xC5F0;&#xB3D9;&#xB418;&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xC5B4;&#xB518;&#xAC00;&#xB85C; &#xC5C5;&#xB85C;&#xB4DC;&#xB428;</li>
</ul>
</li>
</ul>
<h2 id="3-App"><a href="#3-App" class="headerlink" title="#3 - App"></a>#3 - App</h2><p>Android &#xB8E8;&#xD305; &#xD3F0;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xC558;&#xB358; &#xAD00;&#xACC4;&#xB85C;, App &#xBD84;&#xC11D;&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC218;&#xC900;&#xC5D0;&#xC11C;&#xB9CC; &#xC9C4;&#xD589;&#xD588;&#xC5B4;&#xC694;. &#xADC0;&#xCC2E;&#xC544;&#xC11C; &#xC548; &#xD55C;&#xAC8C; &#xB9DE;&#xAE34; &#xD569;&#xB2C8;&#xB2E4;..^^ iPhone&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD328;&#xD0B7; &#xCEA1;&#xCCD0;&#xB97C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC218;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xAD6C;&#xAE00;&#xC5D0; &#xAC80;&#xC0C9;&#xD574;&#xBCF4;&#xB2C8; &#xB9E5;&#xBD81;&#xACFC; iPhone&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xBA74; iPhone &#xD328;&#xD0B7; &#xCEA1;&#xCCD0;&#xAC00; &#xAC00;&#xB2A5;&#xD588;&#xC5B4;&#xC694;</li>
</ul>
<p><img src="image%2010.png" srcset="/img/loading.gif" alt="[https://lxxyeon.tistory.com/157](https://lxxyeon.tistory.com/157)"></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://lxxyeon.tistory.com/157">https://lxxyeon.tistory.com/157</a></p>
<p>iPhone &#xC5D0;&#xC11C; &#xC218;&#xC9D1;&#xD55C; &#xD328;&#xD0B7;&#xC744; &#xBD84;&#xC11D;&#xD574; &#xD30C;&#xC545;&#xD55C; IP CAM&#xACFC;&#xC758; &#xD1B5;&#xC2E0; &#xACFC;&#xC815;&#xC740; &#xC774;&#xB7AC;&#xC5B4;&#xC694;.</p>
<ul>
<li>IP CAM&#xC758; &#xC804;&#xC6D0;&#xC774; &#xCF1C;&#xC9C0;&#xBA74; server&#xC640; &#xC8FC;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xD1B5;&#xC2E0;&#xD574;&#xC694;. IP CAM&#xC740; &#xC790;&#xC2E0;&#xC758; IP &#xC640; &#xC811;&#xC18D; &#xAC00;&#xB2A5;&#xD55C; &#xD3EC;&#xD2B8; &#xC815;&#xBCF4;&#xB97C; server&#xC5D0; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xD3EC;&#xD2B8; &#xC815;&#xBCF4;&#xAC00; 1&#xBD84;&#xB9C8;&#xB2E4; &#xBC14;&#xB00C;&#xC5B4;&#xC694;.</li>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; App&#xC744; &#xCF1C;&#xBA74; server&#xC5D0; communication request&#xB97C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xBC1B;&#xC740; &#xC11C;&#xBC84;&#xB294; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; IP / port &#xC815;&#xBCF4;&#xB85C; IP CAM&#xC5D0; communicaiton request&#xB97C; &#xBCF4;&#xB0B4;&#xC8E0;. &#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; IP / port &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB3FC;&#xC694;.<ul>
<li>IP CAM&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC5F0;&#xACB0; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<p><img src="image%2011.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>Target B&#xC5D0; &#xB300;&#xD574; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xACF5;&#xAC1C;&#xB41C; &#xACF5;&#xACA9; &#xC0AC;&#xB840;&#xB97C; &#xBCF4;&#xBA74;, &#xADF8;&#xB4E4;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC21C;&#xC11C;&#xB85C; &#xACF5;&#xACA9;&#xC744; &#xC218;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xD50C;&#xB798;&#xC2DC; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xCE69;&#xC624;&#xD504;&#xD558;&#xACE0;, &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xB364;&#xD504;&#xD568;</li>
<li>&#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xACE0; BOF &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD568;</li>
<li>RCE&#xB97C; &#xD1B5;&#xD574; &#xC258;&#xC744; &#xD68D;&#xB4DD;&#xD568;</li>
</ul>
<p><img src="image%2012.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xB9CC;&#xC57D; &#xC6B0;&#xB9AC;&#xAC00; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; IP CAM&#xC744; &#xBD84;&#xC11D;&#xD55C;&#xB2E4;&#xBA74; &#xADF8;&#xB4E4;&#xACFC; &#xAC19;&#xC774; &#xD50C;&#xB798;&#xC2DC; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xBD80;&#xD130; &#xC218;&#xD589;&#xD588;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xD38C;&#xC6E8;&#xC5B4; &#xD655;&#xBCF4;&#xD558;&#xACE0; &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xD658;&#xACBD;&#xC744; &#xAC00;&#xC9C0;&#xB294; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; &#xC911;&#xC694;&#xD568;&#xC744; &#xC54C;&#xAC8C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC815;&#xB9D0;&#xB85C;, &#xC815;&#xB9D0;&#xB85C; &#xC774;&#xAC8C; &#xC81C;&#xC77C; &#xC911;&#xC694;&#xD574;&#xC694;..</li>
</ul>
<h2 id="4-Windows-EXE"><a href="#4-Windows-EXE" class="headerlink" title="#4 - Windows EXE"></a>#4 - Windows EXE</h2><p>Windows EXE&#xB294; &#xB85C;&#xC9C1;&#xC740; &#xB2E8;&#xC21C;&#xD588;&#xC9C0;&#xB9CC;, &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xC758; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xC810;&#xC740; App&#xACFC; Windows EXE&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC804;&#xD600; &#xB2EC;&#xB790;&#xB2E4;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;. IP CAM&#xC774; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xB108;&#xBB34;&#xB098; &#xB2E4;&#xC591;&#xD574; &#xC798; &#xCC3E;&#xAE30;&#xB9CC; &#xD55C;&#xB2E4;&#xBA74; &#xAF64;&#xB098; &#xB9CE;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB098;&#xC62C; &#xC218; &#xC788;&#xC744; &#xB4EF;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2013.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<h1 id="&#xB9C8;&#xBB34;&#xB9AC;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;"></a>&#xB9C8;&#xBB34;&#xB9AC;</h1><p>&#xC800;&#xB294; &#xC57D; 3&#xB2EC;(24.11 ~ 25.1)&#xC5D0; &#xAC78;&#xCCD0; &#xC774; &#xAE00;&#xC5D0; &#xC18C;&#xAC1C;&#xD55C; IP CAM 2&#xAC1C;&#xB97C; &#xD3EC;&#xD568;&#xD574; &#xC57D; 4&#xAC1C;&#xC758; IP CAM&#xC744; &#xBD84;&#xC11D;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C; &#xACBD;&#xD5D8;&#xD558;&#xB294; IoT &#xAE30;&#xAE30; &#xBD84;&#xC11D;&#xC774;&#xB77C; &#xBBF8;&#xD761;&#xD55C; &#xC810;&#xC774; &#xB9CE;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; Windows EXE &#xBD84;&#xC11D;&#xACFC; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBD84;&#xC11D;&#xC740; &#xB9CE;&#xC774; &#xD574;&#xBCF4;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xC774;&#xB77C; &#xAF64;&#xB098; &#xC5B4;&#xC0C9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xC81C;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xBC30;&#xC6B4; &#xC810;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB9CE;&#xC774; &#xB098;&#xC624;&#xB294; &#xD0C0;&#xAC9F;&#xC740; &#xB530;&#xB85C; &#xC788;&#xB2E4;. &#xD574;&#xCEE4;&#xB4E4;&#xC774; &#xB9CE;&#xC774; &#xAC70;&#xCCD0;&#xAC04; &#xD0C0;&#xAC9F;&#xC740; &#xBCF4;&#xC548; &#xC218;&#xC900;&#xC774; &#xB9E4;&#xC6B0; &#xB192;&#xB2E4;.</li>
<li>IP CAM&#xC5D0;&#xC11C; &#xB108;&#xBB34; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC5B4;&#xB290;&#xC815;&#xB3C4; &#xD328;&#xCE58;&#xAC00; &#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC778;&#xB2E4;.</li>
<li>IoT &#xAE30;&#xAE30; &#xBD84;&#xC11D;&#xC774; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xAE30;&#xCD08; &#xC9C0;&#xC2DD;&#xC744; &#xB9CE;&#xC774; &#xC694;&#xAD6C;&#xD55C;&#xB2E4;. Windows EXE &#xC815;&#xC801; &#xBD84;&#xC11D;, &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD3EC;&#xD568;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBD84;&#xC11D;, &#xC18C;&#xCF13; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;, &#xC6F9;&#xD574;&#xD0B9;, &#xC2DC;&#xC2A4;&#xD15C; &#xD574;&#xD0B9;, &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC801; &#xC811;&#xADFC; &#xB4F1; &#xC54C;&#xC544;&#xC57C; &#xD560; &#xAC8C; &#xB9CE;&#xB2E4;.</li>
<li>&#xD38C;&#xC6E8;&#xC5B4; &#xCD94;&#xCD9C;&#xACFC; &#xB3D9;&#xC801; &#xB514;&#xBC84;&#xAE45; &#xD658;&#xACBD; &#xAD6C;&#xCD95;&#xC774; &#xAC00;&#xC7A5; &#xC6B0;&#xC120;&#xC2DC; &#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</li>
</ul>
<p><img src="image%2014.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/hunjison/">hunjison</a>
                  
                  <a class="hover-with-bg" href="/tags/Bug-Bounty/">Bug Bounty</a>
                  
                  <a class="hover-with-bg" href="/tags/IP-CAMERA/">IP CAMERA</a>
                  
                  <a class="hover-with-bg" href="/tags/IoT/">IoT</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_hunjison.jpg" srcset="/img/loading.gif" alt="hunjison">
                  </div>

                  <div class="link-text">
                    <div class="link-title">hunjison</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/hunjison">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/02/21/hunjison/CVE-2025-24200/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-24200: iOS  iPadOS      USB restricted mode  </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/02/16/hunjison/IPCAM/en/">
                    <span class="hidden-mobile">[Research] One day.. I got an IPCAM (en)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/02/16/hunjison/IPCAM/ko/';
        this.page.identifier = '/2025/02/16/hunjison/IPCAM/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]  IP CAM   (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
