

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB72C;&amp;#xAE08; &amp;#xC5C6;&amp;#xC774; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xB098;&amp;#xC640;&amp;#xC11C; &amp;#xB2F9;&amp;#xD669;&amp;#xD558;&amp;#xC168;&amp;#xC8E0;. &amp;#xC800;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xD06C;&amp;#xB86C;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC904;&amp;#xC740; &amp;#xBAB0;&amp;#xB790;&amp;#xB294;&amp;#xB370;, &amp;#xC5B4;&amp;#xCA4C;&amp;#xB2E4;&amp;#xAC00; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#x201C;&amp;#xC640;, &amp;#xC7AC;&amp;#xBC0C;&amp;#xB2E4;.&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC544;&amp;#xBB34;&amp;#xC0DD;&amp;#xAC01; &amp;#xC5C6;&amp;#xC774; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;(&lt;a href=&#34;https://www.youtube.com/watch?v=RL2po1swXO4&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;).&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB86C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;, &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xAC70;&amp;#xCC3D;&amp;#xD55C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xC5C6;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#x2018;&amp;#xC7AC;&amp;#xBC0C;&amp;#xC73C;&amp;#xB2C8; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#x2019; &amp;#xC815;&amp;#xB3C4; &amp;#xC778;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2EC;&amp;#xC2EC;&amp;#xCE58; &amp;#xC54A;&amp;#xAC8C; &amp;#xB4E4;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; Type Confusion &amp;#xC774; &amp;#xBB58;&amp;#xAE4C;&amp;#xB3C4; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xCB49; &amp;#xBD24;&amp;#xB294;&amp;#xB370;, js, &amp;#xC6F9; &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; 1&amp;#xB3C4; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC800;&amp;#xB85C;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB108;&amp;#xBB34;&amp;#xC5B4;&amp;#xB824;&amp;#xC6E0;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; Chrome Exploit &amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC544; &amp;#xC774;&amp;#xB798;&amp;#xC11C; Type Confusion &amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xAC78; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; Exploit&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xAD6C;&amp;#xB098; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xACF5;&amp;#xBD80;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC0B0;&amp;#xC131;&amp;#xC788;&amp;#xAC8C; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;, &amp;#x201C;&amp;#xBC30;&amp;#xC6CC;&amp;#xC11C; &amp;#xB0A8;&amp;#xC8FC;&amp;#xC790;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xCC98;&amp;#xB7FC; &amp;#xD06C;&amp;#xB86C; exploit &amp;#xACF5;&amp;#xBD80;&amp;#xC5D0; &amp;#xAC00;&amp;#xC7A5; baseline &amp;#xC774; &amp;#xB418;&amp;#xB294; Type Confusion&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xBB38;&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xAC78;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8; &amp;#xC720;&amp;#xC758;&amp;#xBBF8;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;TypeConfusion101.png&#34; alt=&#34;TypeConfusion101.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Type Confusion &amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#xD06C;&amp;#xB86C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC65C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA70;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xBBF8; &amp;#xC800;&amp;#xC758; &amp;#xC0AC;&amp;#xC2EC;(?)&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; Type Confusion &amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xC2A4;&amp;#xD3EC;&amp;#xB97C; &amp;#xC774;&amp;#xBBF8; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://maily.so/hackyboiz/posts/1gz2v4jxr3q&#34;&gt;https://maily.so/hackyboiz/posts/1gz2v4jxr3q&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;^^&lt;/p&gt;
&lt;p&gt;Type Confusion 101 in Chrome &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; 4&amp;#xBD80;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC778;&amp;#xB370;, &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB300;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xAC8C; &amp;#xC7AC;&amp;#xBBF8; &amp;#xC544;&amp;#xB2C8;&amp;#xACA0;&amp;#xC5B4;&amp;#xC694;?!? &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#xB294; &amp;#xAC19;&amp;#xC774; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBCF4;&amp;#xC790;&amp;#xAD6C;&amp;#xC694;! &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xB0B4;&amp;#xC6A9;&amp;#xBD80;&amp;#xD130; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xB2E4; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; Type Confusion &amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; V8&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; component&amp;#xC778;&amp;#xC9C0; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xB7EC; &amp;#xAC00;&amp;#xC2DC;&amp;#xC8E0; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;1-Chrome-&amp;#xC804;&amp;#xCCB4;-&amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#1-Chrome-&amp;#xC804;&amp;#xCCB4;-&amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;1. Chrome &amp;#xC804;&amp;#xCCB4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&lt;strong&gt;1. Chrome &amp;#xC804;&amp;#xCCB4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xAC1C;&amp;#xC694;&lt;/strong&gt;&lt;/h2&gt;&lt;h3 id=&#34;1-1-Multi-process-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#1-1-Multi-process-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Multi-process &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;1.1 Multi-process &amp;#xAD6C;&amp;#xC870;&lt;/h3&gt;&lt;p&gt;&amp;#xD06C;&amp;#xB86C;&amp;#xC740; &amp;#xB538;&amp;#xAE4D;(&amp;#xC544;&amp;#xC774;&amp;#xCF58; &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;)&amp;#xD558;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; IPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD558;&amp;#xBA70; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (IPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74; &amp;#x2192; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/&#34;&gt;**[Research] Windows Named Pipe (KR)&lt;/a&gt; )**&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;ref. &lt;a href=&#34;https://developer.chrome.com/blog/inside-browser-part1&#34;&gt;https://developer.chrome.com/blog/inside-browser-part1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xD568;&amp;#xAED8; &amp;#xC791;&amp;#xB3D9;&amp;#xD574; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD1B5;&amp;#xD569;&amp;#xB41C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Browser Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC77C; &amp;#xBCF4;&amp;#xB294; &amp;#xD0ED;, &amp;#xC8FC;&amp;#xC18C;&amp;#xCC3D;, &amp;#xC990;&amp;#xACA8;&amp;#xCC3E;&amp;#xAE30; &amp;#xBC14; &amp;#xB4F1; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC758; UI&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Renderer Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xC2E4;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HTML, CSS, JavaScript &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB7F0;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xAC01;&amp;#xC801; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;GPU Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  2D/3D &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xCC98;&amp;#xB9AC;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC00;&amp;#xC18D;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC804;&amp;#xB2F4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Utility / Network / Extension Process &amp;#xB4F1;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xAC01;&amp;#xAC01; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD1B5;&amp;#xC2E0;, &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xCC98;&amp;#xB9AC;, &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xAC19;&amp;#xC740; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC01; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xBD84;&amp;#xB2F4;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBA40;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;&amp;#xBCF4;&amp;#xC548;&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;&amp;#xC548;&amp;#xC815;&amp;#xC131;&lt;/strong&gt; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &lt;strong&gt;&amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;, &amp;#xC124;&amp;#xB839; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC804;&amp;#xCCB4; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xAC00; &amp;#xBA39;&amp;#xD1B5;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xB300;&amp;#xCC38;&amp;#xC0AC;&amp;#xB97C; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Renderer Process&amp;#xAC00; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, Browser Process&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC0B4;&amp;#xC544;&amp;#xB0A8;&amp;#xC544; &amp;#x201C;&amp;#xC774; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xAC00; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x201D; &amp;#xAC19;&amp;#xC740; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &amp;#xC774; &lt;strong&gt;&amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &lt;strong&gt;Sandbox &amp;#xBCF4;&amp;#xC548; &amp;#xBAA8;&amp;#xB378;&lt;/strong&gt;&amp;#xC774; &amp;#xD06C;&amp;#xB86C; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (Sandbox&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD3B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!)&lt;/p&gt;
&lt;h3 id=&#34;1-2-&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC;-&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xACFC;&amp;#xC815;-in-Chrome&#34;&gt;&lt;a href=&#34;#1-2-&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC;-&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xACFC;&amp;#xC815;-in-Chrome&#34; class=&#34;headerlink&#34; title=&#34;1.2 &amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; in Chrome&#34;&gt;&lt;/a&gt;1.2 &amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; in Chrome&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Chrome &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &lt;strong&gt;&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;, &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; HTML, CSS, JavaScript &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC1B;&amp;#xC544;&amp;#xC640; &amp;#xC774;&amp;#xB97C; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD0ED; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC5F4;&amp;#xACE0; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xADF8; &amp;#xC9E7;&amp;#xC740; &amp;#xC21C;&amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xBA40;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xAF64; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800;, &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &lt;strong&gt;HTML &amp;#xBB38;&amp;#xC11C;&lt;/strong&gt;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;lt;link&amp;gt;&lt;/code&gt;&amp;#xB098; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8; &amp;#xB4F1;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;, &amp;#xADF8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC678;&amp;#xBD80; &lt;strong&gt;CSS &amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;JavaScript &amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xB3C4; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xACE0; &amp;#xBD88;&amp;#xB7EC;&amp;#xC624;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC1B;&amp;#xC544;&amp;#xC628; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;HTML&lt;/strong&gt;&amp;#xC740; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xBF08;&amp;#xB300; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xACE0;, &lt;strong&gt;CSS&lt;/strong&gt;&amp;#xB294; &amp;#xADF8; &amp;#xBF08;&amp;#xB300;&amp;#xC5D0; &amp;#xC0C9;&amp;#xACFC; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC785;&amp;#xD788;&amp;#xB294; &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xC8E0;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;JavaScript&lt;/strong&gt;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xCC98;&amp;#xB9AC;, &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158; &amp;#xB4F1; &lt;strong&gt;&amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC0DD;&amp;#xBA85;&amp;#xB825;&amp;#xC744; &amp;#xBD88;&amp;#xC5B4;&amp;#xB123;&amp;#xB294; &amp;#xB3D9;&amp;#xC791; &amp;#xB85C;&amp;#xC9C1;&lt;/strong&gt;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; JavaScript&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xACE0;&lt;/strong&gt;, &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &lt;strong&gt;&amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&lt;/strong&gt;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC6F9; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC720;&amp;#xC5F0;&amp;#xD574;&amp;#xC9C0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xC740; &amp;#xD6E8;&amp;#xC52C; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;V8 JavaScript &amp;#xC5D4;&amp;#xC9C4;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC774; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;, &amp;#xADF8; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB77C;&amp;#xB294; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xAC04; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xB354; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB7EC; &amp;#xAC00;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;2-About-Render-Process&#34;&gt;&lt;a href=&#34;#2-About-Render-Process&#34; class=&#34;headerlink&#34; title=&#34;2. About Render Process&#34;&gt;&lt;/a&gt;2. About Render Process&lt;/h2&gt;&lt;p&gt;&amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#x201C;&amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#x201D; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &lt;strong&gt;&amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD0ED;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xBA70;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; HTML &amp;#xD30C;&amp;#xC2F1;&amp;#xACFC; CSS &amp;#xC801;&amp;#xC6A9;, DOM &amp;#xAD6C;&amp;#xC131;, JavaScript &amp;#xC2E4;&amp;#xD589;, &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xACC4;&amp;#xC0B0;, &amp;#xD398;&amp;#xC778;&amp;#xD305;, &amp;#xCEF4;&amp;#xD3EC;&amp;#xC9C0;&amp;#xD305;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC804;&amp;#xCCB4; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC774; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;JavaScript&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xAC70;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xC720;&amp;#xC5F0;&amp;#xC131;&amp;#xC740; &amp;#xACE7;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC870;&amp;#xB098; &lt;strong&gt;Type Confusion&lt;/strong&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC704;&amp;#xD5D8;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Chrome&amp;#xC740; &lt;strong&gt;JavaScript&amp;#xB97C; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0ED; &amp;#xD558;&amp;#xB098;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xD0ED;&amp;#xC774;&amp;#xB098; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB7F0; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;JavaScript&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Blink-&amp;#x2192;-V8-&amp;#xD750;&amp;#xB984;&#34;&gt;&lt;a href=&#34;#2-1-Blink-&amp;#x2192;-V8-&amp;#xD750;&amp;#xB984;&#34; class=&#34;headerlink&#34; title=&#34;2.1 Blink &amp;#x2192; V8 &amp;#xD750;&amp;#xB984;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.1 Blink &amp;#x2192; V8 &amp;#xD750;&amp;#xB984;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;HTML &amp;#xD30C;&amp;#xC2F1;&amp;#xACFC; &amp;#xD654;&amp;#xBA74; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1;&lt;/strong&gt;&amp;#xC740; Blink &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&lt;/strong&gt;&amp;#xC740; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB450; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC740; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE34;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Blink&lt;/strong&gt;&amp;#xB294; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC73C;&amp;#xB85C;, HTML&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xACE0; DOM&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xBA70;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;V8&lt;/strong&gt;&amp;#xC740; JavaScript &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC804;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; Blink&amp;#xC5D0;&amp;#xC11C; V8&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2460; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Blink&amp;#xB294; HTML&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xB358; &amp;#xC911; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74;, JavaScript &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xB4E4;&amp;#xC774;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D;&amp;#xB41C; JS &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0;, &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; V8&amp;#xC774; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#x2461; &lt;strong&gt;Scanner: &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#x2192; &amp;#xD1A0;&amp;#xD070;(Token) &amp;#xBD84;&amp;#xD574;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Blink&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &lt;strong&gt;UTF-16 &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; JavaScript &amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2A4;&amp;#xCE90;&amp;#xB108;&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xCE90;&amp;#xB108;&amp;#xB294; &amp;#xC774; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC758; &amp;#xBB38;&amp;#xBC95; &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; &amp;#xB2E8;&amp;#xC704;&amp;#xC778; &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;function&lt;/code&gt;, &lt;code&gt;if&lt;/code&gt;, &lt;code&gt;=&lt;/code&gt;, &lt;code&gt;123&lt;/code&gt;, &lt;code&gt;&amp;apos;hello&amp;apos;&lt;/code&gt; &amp;#xB4F1;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xB9AC;&amp;#xB418;&amp;#xBA70;, &amp;#xC774;&amp;#xD6C4; &amp;#xAD6C;&amp;#xBB38; &amp;#xBD84;&amp;#xC11D; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2462; Parser: AST &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &lt;strong&gt;Parser&lt;/strong&gt;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; AST (&amp;#xCD94;&amp;#xC0C1; &amp;#xAD6C;&amp;#xBB38; &amp;#xD2B8;&amp;#xB9AC;, Abstract Syntax Tree)&amp;#xB97C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xD45C;&amp;#xD604;&amp;#xD55C; &amp;#xB098;&amp;#xBB34; &amp;#xAD6C;&amp;#xC870;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC778;&amp;#xB370;, &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2463; Ignition: Bytecode&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; AST&amp;#xB294; V8&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xC778; &lt;strong&gt;Ignition&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Ignition&amp;#xC740; &amp;#xC774; AST&amp;#xB97C; &amp;#xC21C;&amp;#xD68C;&amp;#xD558;&amp;#xBA70;, JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; CPU&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;&amp;#xC73C;&amp;#xB85C;, &amp;#xBE60;&amp;#xB978; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2464; &amp;#xC2E4;&amp;#xD589;!&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;strong&gt;Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xB108;&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, DOM&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xB4E4;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. V8&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xC5EC;, &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB098; &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;, &amp;#xC774;&amp;#xB97C; &amp;#xB354;&amp;#xC6B1; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; TurboFan&amp;#xC744; &amp;#xB3D9;&amp;#xC791;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &lt;strong&gt;JIT(Just-In-Time) &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xB418;&amp;#xBA70;, &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; JavaScript &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC228;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &lt;strong&gt;V8 &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xB97C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-V8-&amp;#xC5D4;&amp;#xC9C4;-&amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;a href=&#34;#2-2-V8-&amp;#xC5D4;&amp;#xC9C4;-&amp;#xC18C;&amp;#xAC1C;&#34; class=&#34;headerlink&#34; title=&#34;2.2 V8 &amp;#xC5D4;&amp;#xC9C4; &amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.2 V8 &amp;#xC5D4;&amp;#xC9C4; &amp;#xC18C;&amp;#xAC1C;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;V8&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5; &amp;#xC790;&amp;#xB3D9;&amp;#xCC28; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB530;&amp;#xC628; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Chrome &amp;#xD300;&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; JavaScript &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB9C8;&amp;#xCE58; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBD99;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; V8&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB41C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;, JavaScript&amp;#xB294; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xD0C0;&amp;#xC774;&amp;#xD551; &amp;#xC5B8;&amp;#xC5B4;&lt;/strong&gt;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xACE0; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5D4;&amp;#xC9C4; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC131;&amp;#xB2A5; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xC640; &amp;#xBCF4;&amp;#xC548; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xB3C4;&amp;#xC804; &amp;#xACFC;&amp;#xC81C;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; V8&amp;#xC740; &amp;#xB2E4;&amp;#xB2E8;&amp;#xACC4; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130; &amp;#xC5C6;&amp;#xC774;, &amp;#xACE7;&amp;#xBC14;&amp;#xB85C; JIT &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; &lt;strong&gt;Crankshaft&lt;/strong&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD55C;&amp;#xACC4;&amp;#xC5D0; &amp;#xBD80;&amp;#xB52A;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xC774; &amp;#xB9CE;&amp;#xACE0; &amp;#xC2DC;&amp;#xC791; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB290;&amp;#xB9BC;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xC5B8;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC131;&amp;#xC0C1; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC2E4;&amp;#xD328; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&lt;/strong&gt;&amp;#xC774; &amp;#xB192;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;(deopt)&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC6A9;&amp;#xB3C4; &amp;#xD07C;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ECMAScript &amp;#xD45C;&amp;#xC900; &amp;#xBC1C;&amp;#xC804;&lt;/strong&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBB38;&amp;#xBC95; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; Crankshaft&amp;#xB294; &lt;strong&gt;&amp;#xC720;&amp;#xC9C0; &amp;#xBCF4;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, V8 &amp;#xD300;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC124;&amp;#xACC4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;TurboFan&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TurboFan&amp;#xC758; &amp;#xB4F1;&amp;#xC7A5; (v5.9 &amp;#xC774;&amp;#xD6C4;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TurboFan&amp;#xC740; Crankshaft&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xACE0;&amp;#xAE09; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCCA0;&amp;#xD559;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC804;&amp;#xCCB4; JavaScript &amp;#xC5B8;&amp;#xC5B4; &amp;#xC2A4;&amp;#xD399;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;&amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;(IR)&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xCCB4;&amp;#xACC4;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xACFC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC774;&amp;#xC2DD;&amp;#xC131; &amp;#xD655;&amp;#xBCF4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;TurboFan&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xBE44;&amp;#xC6A9;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9E7;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, TurboFan&amp;#xC740; &amp;#xACFC;&amp;#xD55C; &amp;#xBB34;&amp;#xAE30;&amp;#xC600;&amp;#xB358; &amp;#xC148;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SparkPlug&amp;#xC758; &amp;#xB3C4;&amp;#xC785; (2021)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, V8 &amp;#xD300;&amp;#xC740; &lt;strong&gt;&amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xACBD;&amp;#xB7C9; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; SparkPlug&lt;/strong&gt;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC5EC;, &amp;#xC774;&amp;#xBBF8; &amp;#xD574;&amp;#xC11D;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB098; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0;, &amp;#xBE60;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC6B0;&amp;#xC120;&amp;#xC2DC;&lt;/li&gt;
&lt;li&gt;TurboFan&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE60;&amp;#xB974;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB35C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;SparkPlug&amp;#xB294; Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE60;&amp;#xB974;&amp;#xACE0;, TurboFan&amp;#xBCF4;&amp;#xB2E4; &amp;#xAC00;&amp;#xBCBC;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368;, JavaScript &amp;#xC2E4;&amp;#xD589;&amp;#xC758; &amp;#xCD08;&amp;#xAE30; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD070; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB85C;&amp;#xB529;&amp;#xC774;&amp;#xB098; &amp;#xCD08;&amp;#xAE30; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC5D0; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Maglev&amp;#xC758; &amp;#xCD94;&amp;#xAC00; (2022~)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;SparkPlug&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; &amp;#xB098;&amp;#xC058;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC911;&amp;#xAC04;&amp;#xAE09; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xB0AE;&amp;#xC740; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC218;&amp;#xC900;&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. V8 &amp;#xD300;&amp;#xC740; SparkPlug&amp;#xC640; TurboFan &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; &amp;#xB354; &amp;#xB611;&amp;#xB611;&amp;#xD55C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xC6D0;&amp;#xD588;&amp;#xACE0;, &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Maglev&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Maglev&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;SparkPlug&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; aggressive&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAE30;&amp;#xBC18; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xC5EC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; SparkPlug&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; TurboFan&amp;#xC5D0; &amp;#xADFC;&amp;#xC811;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Maglev&amp;#xB294; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC131;&amp;#xB2A5; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD2B9;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, Tiering &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C; Ignition &amp;#x2192; Maglev &amp;#x2192; TurboFan&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xACC4;&amp;#xCE35;&amp;#xC801; &amp;#xC2E4;&amp;#xD589; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC;, &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#x201C;&amp;#xD56B;&amp;#xD568;&amp;#x201D;(hot code)&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC218;&amp;#xC900;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-V8-&amp;#xC2E4;&amp;#xD589;-&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#2-3-V8-&amp;#xC2E4;&amp;#xD589;-&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;2.3 V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;2.3 V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&lt;/h3&gt;&lt;p&gt;&amp;#xC704; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &lt;strong&gt;Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xACE0;, &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Ignition&amp;#xC740; &amp;#xBE60;&amp;#xB978; &amp;#xC2DC;&amp;#xC791;&amp;#xACFC; &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBE44;&amp;#xB97C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xD06C;&amp;#xB86C; v5.9&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC874;&amp;#xC758; Full-codegen&amp;#xC744; &amp;#xB300;&amp;#xCCB4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xAE30;&amp;#xB300;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC77C;&amp;#xC815; &amp;#xAE30;&amp;#xC900;&amp;#xC744; &amp;#xB118;&amp;#xB294; &amp;#x201C;&amp;#xD56B; &amp;#xCF54;&amp;#xB4DC;(hot code)&amp;#x201D;&amp;#xB294; &amp;#xC774;&amp;#xD6C4; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;SparkPlug&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD0C0;&amp;#xC785; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB098; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC5C6;&amp;#xC774; &lt;strong&gt;&amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB192;&amp;#xC774;&amp;#xACE0;, &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; CPU &amp;#xC790;&amp;#xC6D0;&amp;#xACFC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xB3C4; &amp;#xC808;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB85C;&amp;#xB529;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB978; &amp;#xBC18;&amp;#xC751;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xAC00;&amp;#xBCCD;&amp;#xACE0; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB54C;&amp;#xB85C;&amp;#xB294; &amp;#xB354; &amp;#xB192;&amp;#xC740; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; V8&amp;#xC758; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; &lt;strong&gt;TurboFan&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. TurboFan&amp;#xC740; Ignition&amp;#xC774;&amp;#xB098; SparkPlug &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &lt;strong&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;, &amp;#xD638;&amp;#xCD9C; &amp;#xD328;&amp;#xD134;, &amp;#xB8E8;&amp;#xD504; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;, &amp;#xACE0;&amp;#xAE09; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xB77C;&amp;#xC774;&amp;#xB2DD;, &amp;#xB8E8;&amp;#xD504; &amp;#xC804;&amp;#xAC1C;, &amp;#xD0C0;&amp;#xC785; &amp;#xD2B9;&amp;#xD654; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC;, &lt;strong&gt;&amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBABB;&amp;#xC9C0;&amp;#xC54A;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC758; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xBC88; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC774;&amp;#xD6C4; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; TurboFan&amp;#xC758; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD07D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; TurboFan&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBE44;&amp;#xC6A9;&amp;#xC774; &amp;#xD06C;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;(deopt)&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &lt;strong&gt;Maglev&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Maglev&amp;#xB294; &lt;strong&gt;SparkPlug&amp;#xC640; TurboFan &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;-&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xADE0;&amp;#xD615;&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xCD5C;&amp;#xC2E0; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xC815;&amp;#xAD50;&amp;#xD558;&amp;#xAC8C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xBA70;, &amp;#xBD80;&amp;#xBD84;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xC785; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, TurboFan&amp;#xB9CC;&amp;#xD07C; &amp;#xBB34;&amp;#xAC81;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2022&amp;#xB144;&amp;#xBD80;&amp;#xD130; &amp;#xC810;&amp;#xC9C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC785;&amp;#xB41C; Maglev&amp;#xB294; &amp;#xD2B9;&amp;#xD788; &lt;strong&gt;&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC790;&amp;#xC6D0;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0C1;&amp;#xC6D4;&amp;#xD55C; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBC1C;&amp;#xD718;&amp;#xD558;&amp;#xBA70;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xB300;&amp;#xC751;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC911;&amp;#xAC04; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xD615;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, V8&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C;&amp;#xD55C; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC;, &lt;strong&gt;&amp;#xC0C1;&amp;#xD669;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xB4E4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB9CC;&amp;#xD07C;&amp;#xB9CC; &amp;#xD22C;&amp;#xC790;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC810;&amp;#xC810; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xB04C;&amp;#xC5B4;&amp;#xC62C;&amp;#xB9AC;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC8E0;. &amp;#xC774; &amp;#xACC4;&amp;#xCE35;&amp;#xD654;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xCCB4;&amp;#xACC4; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; V8&amp;#xC740; &lt;strong&gt;&amp;#xBE60;&amp;#xB978; &amp;#xC2DC;&amp;#xC791;, &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBE44;, &amp;#xB192;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC138; &amp;#xB9C8;&amp;#xB9AC; &amp;#xD1A0;&amp;#xB07C;&amp;#xB97C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC7A1;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; JavaScript&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xD29C;&amp;#xB2DD; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2015.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &lt;strong&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&lt;/strong&gt;&amp;#xB3C4; &amp;#xB0B4;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. V8&amp;#xC758; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#x201C;&amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xAD6C;&amp;#xC870;&amp;#xC77C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;, &amp;#x201C;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC00;&amp;#xC815;&amp;#xC5D0; &amp;#xAE30;&amp;#xBC18;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC00;&amp;#xC815;&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xB294; &amp;#xC21C;&amp;#xAC04;, V8&amp;#xC740; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC804;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/strong&gt;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC740; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C;, &amp;#xAC1D;&amp;#xCCB4;&amp;#xB098; &amp;#xAC12;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xCD94;&amp;#xB860;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xAE30;&amp;#xC874; &amp;#xAC00;&amp;#xC815;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xD0C0;&amp;#xC785;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xCC44; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC815;&amp;#xC218; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xB418;&amp;#xB358; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xB3C4;&amp;#xC911; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4;, V8&amp;#xC774; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC774;&amp;#xB97C; &amp;#xC815;&amp;#xC218; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD558;&amp;#xACE0; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCC38;&amp;#xC870;&amp;#xB098; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870; &amp;#xC190;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC740; &amp;#xD2B9;&amp;#xD788; TurboFan&amp;#xC774;&amp;#xB098; Maglev&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACE0;&amp;#xAE09; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xC785; &amp;#xD2B9;&amp;#xD654;(type specialization), &amp;#xC778;&amp;#xB77C;&amp;#xC774;&amp;#xB2DD;(inlining), &amp;#xAC1D;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870; &amp;#xACE0;&amp;#xC815;(hidden class assumption) &amp;#xB4F1;&amp;#xC758; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xADF9;&amp;#xB300;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xACE0;&amp;#xC815;&amp;#xD55C; &amp;#xCC44; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;, &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC758; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xACE0;&amp;#xB824;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC77C;&amp;#xBD80; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#x201C;&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4;, &lt;strong&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC;, &lt;strong&gt;V8&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; Native Code&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xB3D9;&amp;#xC791;&lt;/strong&gt;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC218;&amp;#xC758; Chrome &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xBA70;, &amp;#xCD5C;&amp;#xADFC;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; V8 &amp;#xAE30;&amp;#xBC18; Type Confusion &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xACE0;&amp;#xC704;&amp;#xD5D8;&amp;#xAD70;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xC5D4;&amp;#xC9C4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB418;&amp;#xBA70;, &amp;#xB098;&amp;#xC544;&amp;#xAC00; &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC774;&amp;#xC288;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD55C;&amp;#xD638;&amp;#xD761; &amp;#xB04A;&amp;#xACE0; &amp;#xAC00;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#x314E;.&amp;#x314E; &amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C;&amp;#xD3B8;&amp;#xC744; &amp;#xC608;&amp;#xACE0;&amp;#xD558;&amp;#xBA70; &amp;#xC800;&amp;#xB294; Part 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Part 2 &amp;#xC608;&amp;#xACE0;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2016.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;v &lt;strong&gt;Conference Video&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.youtube.com/watch?v=RL2po1swXO4&#34;&gt;https://www.youtube.com/watch?v=RL2po1swXO4&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;v &lt;strong&gt;V8 Engine&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://v8.dev/&#34;&gt;https://v8.dev/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/V8_(JavaScript_engine&#34;&gt;https://en.wikipedia.org/wiki/V8_(JavaScript_engine&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://evan-moon.github.io/2019/06/28/v8-analysis/&#34;&gt;https://evan-moon.github.io/2019/06/28/v8-analysis/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d&#34;&gt;https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84&#34;&gt;https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551&#34;&gt;https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Type Confusion 101  Chrome Exploit ^-^Part 1.(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; OUYA77 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB72C;&amp;#xAE08; &amp;#xC5C6;&amp;#xC774; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xB098;&amp;#xC640;&amp;#xC11C; &amp;#xB2F9;&amp;#xD669;&amp;#xD558;&amp;#xC168;&amp;#xC8E0;. &amp;#xC800;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xD06C;&amp;#xB86C;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC904;&amp;#xC740; &amp;#xBAB0;&amp;#xB790;&amp;#xB294;&amp;#xB370;, &amp;#xC5B4;&amp;#xCA4C;&amp;#xB2E4;&amp;#xAC00; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#x201C;&amp;#xC640;, &amp;#xC7AC;&amp;#xBC0C;&amp;#xB2E4;.&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC544;&amp;#xBB34;&amp;#xC0DD;&amp;#xAC01; &amp;#xC5C6;&amp;#xC774; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;(&lt;a href=&#34;https://www.youtube.com/watch?v=RL2po1swXO4&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;).&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB86C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;, &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xAC70;&amp;#xCC3D;&amp;#xD55C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xC5C6;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#x2018;&amp;#xC7AC;&amp;#xBC0C;&amp;#xC73C;&amp;#xB2C8; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#x2019; &amp;#xC815;&amp;#xB3C4; &amp;#xC778;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC6A9;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2EC;&amp;#xC2EC;&amp;#xCE58; &amp;#xC54A;&amp;#xAC8C; &amp;#xB4E4;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; Type Confusion &amp;#xC774; &amp;#xBB58;&amp;#xAE4C;&amp;#xB3C4; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xCB49; &amp;#xBD24;&amp;#xB294;&amp;#xB370;, js, &amp;#xC6F9; &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; 1&amp;#xB3C4; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC800;&amp;#xB85C;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xB108;&amp;#xBB34;&amp;#xC5B4;&amp;#xB824;&amp;#xC6E0;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; Chrome Exploit &amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC544; &amp;#xC774;&amp;#xB798;&amp;#xC11C; Type Confusion &amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xAC78; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; Exploit&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xAD6C;&amp;#xB098; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xACF5;&amp;#xBD80;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC0B0;&amp;#xC131;&amp;#xC788;&amp;#xAC8C; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;, &amp;#x201C;&amp;#xBC30;&amp;#xC6CC;&amp;#xC11C; &amp;#xB0A8;&amp;#xC8FC;&amp;#xC790;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xB9D0;&amp;#xCC98;&amp;#xB7FC; &amp;#xD06C;&amp;#xB86C; exploit &amp;#xACF5;&amp;#xBD80;&amp;#xC5D0; &amp;#xAC00;&amp;#xC7A5; baseline &amp;#xC774; &amp;#xB418;&amp;#xB294; Type Confusion&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xBB38;&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xAC8C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xADF8;&amp;#xAC78;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8; &amp;#xC720;&amp;#xC758;&amp;#xBBF8;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!!!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;TypeConfusion101.png&#34; alt=&#34;TypeConfusion101.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Type Confusion &amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#xD06C;&amp;#xB86C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC65C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA70;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC774;&amp;#xBBF8; &amp;#xC800;&amp;#xC758; &amp;#xC0AC;&amp;#xC2EC;(?)&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xC11C; Type Confusion &amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xC2A4;&amp;#xD3EC;&amp;#xB97C; &amp;#xC774;&amp;#xBBF8; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://maily.so/hackyboiz/posts/1gz2v4jxr3q&#34;&gt;https://maily.so/hackyboiz/posts/1gz2v4jxr3q&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;^^&lt;/p&gt;
&lt;p&gt;Type Confusion 101 in Chrome &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB294; 4&amp;#xBD80;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01; &amp;#xC911;&amp;#xC778;&amp;#xB370;, &amp;#xC778;&amp;#xC0DD;&amp;#xC740; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xB300;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#xAC8C; &amp;#xC7AC;&amp;#xBBF8; &amp;#xC544;&amp;#xB2C8;&amp;#xACA0;&amp;#xC5B4;&amp;#xC694;?!? &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#xB294; &amp;#xAC19;&amp;#xC774; &amp;#xC9C0;&amp;#xCF1C;&amp;#xBCF4;&amp;#xC790;&amp;#xAD6C;&amp;#xC694;! &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xB0B4;&amp;#xC6A9;&amp;#xBD80;&amp;#xD130; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xB2E4; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; Type Confusion &amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; V8&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; component&amp;#xC778;&amp;#xC9C0; &amp;#xAC19;&amp;#xC774; &amp;#xBCF4;&amp;#xB7EC; &amp;#xAC00;&amp;#xC2DC;&amp;#xC8E0; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;1-Chrome-&amp;#xC804;&amp;#xCCB4;-&amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#1-Chrome-&amp;#xC804;&amp;#xCCB4;-&amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;1. Chrome &amp;#xC804;&amp;#xCCB4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&lt;strong&gt;1. Chrome &amp;#xC804;&amp;#xCCB4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xAC1C;&amp;#xC694;&lt;/strong&gt;&lt;/h2&gt;&lt;h3 id=&#34;1-1-Multi-process-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#1-1-Multi-process-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Multi-process &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;1.1 Multi-process &amp;#xAD6C;&amp;#xC870;&lt;/h3&gt;&lt;p&gt;&amp;#xD06C;&amp;#xB86C;&amp;#xC740; &amp;#xB538;&amp;#xAE4D;(&amp;#xC544;&amp;#xC774;&amp;#xCF58; &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;)&amp;#xD558;&amp;#xBA74; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xCF1C;&amp;#xC9C0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; IPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD558;&amp;#xBA70; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (IPC &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74; &amp;#x2192; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/&#34;&gt;**[Research] Windows Named Pipe (KR)&lt;/a&gt; )**&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;ref. &lt;a href=&#34;https://developer.chrome.com/blog/inside-browser-part1&#34;&gt;https://developer.chrome.com/blog/inside-browser-part1&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xD568;&amp;#xAED8; &amp;#xC791;&amp;#xB3D9;&amp;#xD574; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD1B5;&amp;#xD569;&amp;#xB41C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Browser Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC77C; &amp;#xBCF4;&amp;#xB294; &amp;#xD0ED;, &amp;#xC8FC;&amp;#xC18C;&amp;#xCC3D;, &amp;#xC990;&amp;#xACA8;&amp;#xCC3E;&amp;#xAE30; &amp;#xBC14; &amp;#xB4F1; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC758; UI&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Renderer Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xC2E4;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HTML, CSS, JavaScript &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB7F0;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC;, &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2DC;&amp;#xAC01;&amp;#xC801; &amp;#xACB0;&amp;#xACFC;&amp;#xBB3C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;GPU Process&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  2D/3D &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xCC98;&amp;#xB9AC;&amp;#xB098; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC00;&amp;#xC18D;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC804;&amp;#xB2F4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Utility / Network / Extension Process &amp;#xB4F1;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;  &amp;#xAC01;&amp;#xAC01; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD1B5;&amp;#xC2E0;, &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xCC98;&amp;#xB9AC;, &amp;#xD655;&amp;#xC7A5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xAC19;&amp;#xC740; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC01; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xBD84;&amp;#xB2F4;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBA40;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD06C;&amp;#xB86C;&amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;&amp;#xBCF4;&amp;#xC548;&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;&amp;#xC548;&amp;#xC815;&amp;#xC131;&lt;/strong&gt; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC11C;&amp;#xB85C; &lt;strong&gt;&amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C;, &amp;#xC124;&amp;#xB839; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC804;&amp;#xCCB4; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xAC00; &amp;#xBA39;&amp;#xD1B5;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xB300;&amp;#xCC38;&amp;#xC0AC;&amp;#xB97C; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Renderer Process&amp;#xAC00; &amp;#xBE44;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, Browser Process&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC0B4;&amp;#xC544;&amp;#xB0A8;&amp;#xC544; &amp;#x201C;&amp;#xC774; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xAC00; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x201D; &amp;#xAC19;&amp;#xC740; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xB85C; &amp;#xC774; &lt;strong&gt;&amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &lt;strong&gt;Sandbox &amp;#xBCF4;&amp;#xC548; &amp;#xBAA8;&amp;#xB378;&lt;/strong&gt;&amp;#xC774; &amp;#xD06C;&amp;#xB86C; &amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (Sandbox&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD3B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!)&lt;/p&gt;
&lt;h3 id=&#34;1-2-&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC;-&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xACFC;&amp;#xC815;-in-Chrome&#34;&gt;&lt;a href=&#34;#1-2-&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC;-&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;-&amp;#xCC98;&amp;#xB9AC;-&amp;#xACFC;&amp;#xC815;-in-Chrome&#34; class=&#34;headerlink&#34; title=&#34;1.2 &amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; in Chrome&#34;&gt;&lt;/a&gt;1.2 &amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; in Chrome&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;Chrome &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &lt;strong&gt;&amp;#xD504;&amp;#xB860;&amp;#xD2B8;&amp;#xC5D4;&amp;#xB4DC; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;, &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; HTML, CSS, JavaScript &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBC1B;&amp;#xC544;&amp;#xC640; &amp;#xC774;&amp;#xB97C; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD0ED; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC5F4;&amp;#xACE0; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xB294; &amp;#xADF8; &amp;#xC9E7;&amp;#xC740; &amp;#xC21C;&amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC168;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xBA40;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xAF64; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800;, &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &lt;strong&gt;HTML &amp;#xBB38;&amp;#xC11C;&lt;/strong&gt;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xBC1B;&amp;#xC544;&amp;#xC624;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;&amp;lt;link&amp;gt;&lt;/code&gt;&amp;#xB098; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8; &amp;#xB4F1;&amp;#xC744; &amp;#xB9CC;&amp;#xB098;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;, &amp;#xADF8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC678;&amp;#xBD80; &lt;strong&gt;CSS &amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;JavaScript &amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xB3C4; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xACE0; &amp;#xBD88;&amp;#xB7EC;&amp;#xC624;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC1B;&amp;#xC544;&amp;#xC628; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC740; &amp;#xAC01;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC774; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;HTML&lt;/strong&gt;&amp;#xC740; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xBF08;&amp;#xB300; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xACE0;, &lt;strong&gt;CSS&lt;/strong&gt;&amp;#xB294; &amp;#xADF8; &amp;#xBF08;&amp;#xB300;&amp;#xC5D0; &amp;#xC0C9;&amp;#xACFC; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC785;&amp;#xD788;&amp;#xB294; &amp;#xC2A4;&amp;#xD0C0;&amp;#xC77C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xC8E0;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;JavaScript&lt;/strong&gt;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640;&amp;#xC758; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xCC98;&amp;#xB9AC;, &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158; &amp;#xB4F1; &lt;strong&gt;&amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC0DD;&amp;#xBA85;&amp;#xB825;&amp;#xC744; &amp;#xBD88;&amp;#xC5B4;&amp;#xB123;&amp;#xB294; &amp;#xB3D9;&amp;#xC791; &amp;#xB85C;&amp;#xC9C1;&lt;/strong&gt;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; JavaScript&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC5B8;&amp;#xC5B4;&amp;#xB4E4;&amp;#xACFC; &amp;#xB2EC;&amp;#xB9AC; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xACE0;&lt;/strong&gt;, &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &lt;strong&gt;&amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xD2B9;&amp;#xC131;&lt;/strong&gt;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xD2B9;&amp;#xC131; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC6F9; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC774; &amp;#xD6E8;&amp;#xC52C; &amp;#xC720;&amp;#xC5F0;&amp;#xD574;&amp;#xC9C0;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xC740; &amp;#xD6E8;&amp;#xC52C; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;V8 JavaScript &amp;#xC5D4;&amp;#xC9C4;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xB86C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xC774; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;, &amp;#xADF8; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB77C;&amp;#xB294; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xAC04; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB904;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xB354; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB7EC; &amp;#xAC00;&amp;#xC2DC;&amp;#xC8E0;!&lt;/p&gt;
&lt;h2 id=&#34;2-About-Render-Process&#34;&gt;&lt;a href=&#34;#2-About-Render-Process&#34; class=&#34;headerlink&#34; title=&#34;2. About Render Process&#34;&gt;&lt;/a&gt;2. About Render Process&lt;/h2&gt;&lt;p&gt;&amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#x201C;&amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294;&amp;#x201D; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &lt;strong&gt;&amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xD0ED;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xBA70;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; HTML &amp;#xD30C;&amp;#xC2F1;&amp;#xACFC; CSS &amp;#xC801;&amp;#xC6A9;, DOM &amp;#xAD6C;&amp;#xC131;, JavaScript &amp;#xC2E4;&amp;#xD589;, &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xACC4;&amp;#xC0B0;, &amp;#xD398;&amp;#xC778;&amp;#xD305;, &amp;#xCEF4;&amp;#xD3EC;&amp;#xC9C0;&amp;#xD305;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC804;&amp;#xCCB4; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC774; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;JavaScript&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC5D0; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xAC70;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xC720;&amp;#xC5F0;&amp;#xC131;&amp;#xC740; &amp;#xACE7;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC870;&amp;#xB098; &lt;strong&gt;Type Confusion&lt;/strong&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xC704;&amp;#xD5D8;&amp;#xC744; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, Chrome&amp;#xC740; &lt;strong&gt;JavaScript&amp;#xB97C; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xACA9;&amp;#xB9AC;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0ED; &amp;#xD558;&amp;#xB098;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xACA8;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACE0;, &amp;#xB2E4;&amp;#xB978; &amp;#xD0ED;&amp;#xC774;&amp;#xB098; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774;&amp;#xB7F0; &amp;#xB80C;&amp;#xB354;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;JavaScript&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Blink-&amp;#x2192;-V8-&amp;#xD750;&amp;#xB984;&#34;&gt;&lt;a href=&#34;#2-1-Blink-&amp;#x2192;-V8-&amp;#xD750;&amp;#xB984;&#34; class=&#34;headerlink&#34; title=&#34;2.1 Blink &amp;#x2192; V8 &amp;#xD750;&amp;#xB984;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.1 Blink &amp;#x2192; V8 &amp;#xD750;&amp;#xB984;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC758; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;HTML &amp;#xD30C;&amp;#xC2F1;&amp;#xACFC; &amp;#xD654;&amp;#xBA74; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1;&lt;/strong&gt;&amp;#xC740; Blink &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589;&lt;/strong&gt;&amp;#xC740; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB450; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC740; &amp;#xC6F9;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB97C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE34;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Blink&lt;/strong&gt;&amp;#xB294; &amp;#xB80C;&amp;#xB354;&amp;#xB9C1; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC73C;&amp;#xB85C;, HTML&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xACE0; DOM&amp;#xC744; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xBA70;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;V8&lt;/strong&gt;&amp;#xC740; JavaScript &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC804;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; Blink&amp;#xC5D0;&amp;#xC11C; V8&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2460; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Blink&amp;#xB294; HTML&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xB358; &amp;#xC911; &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xBA74;, JavaScript &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xB4E4;&amp;#xC774;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D;&amp;#xB41C; JS &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0;, &amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; V8&amp;#xC774; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#x2461; &lt;strong&gt;Scanner: &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#x2192; &amp;#xD1A0;&amp;#xD070;(Token) &amp;#xBD84;&amp;#xD574;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Blink&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &lt;strong&gt;UTF-16 &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; JavaScript &amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC2A4;&amp;#xCE90;&amp;#xB108;&amp;#xAC00; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xCE90;&amp;#xB108;&amp;#xB294; &amp;#xC774; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xC758; &amp;#xBB38;&amp;#xBC95; &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC758;&amp;#xBBF8; &amp;#xC788;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C; &amp;#xB2E8;&amp;#xC704;&amp;#xC778; &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xD574;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &lt;code&gt;function&lt;/code&gt;, &lt;code&gt;if&lt;/code&gt;, &lt;code&gt;=&lt;/code&gt;, &lt;code&gt;123&lt;/code&gt;, &lt;code&gt;&amp;apos;hello&amp;apos;&lt;/code&gt; &amp;#xB4F1;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xB9AC;&amp;#xB418;&amp;#xBA70;, &amp;#xC774;&amp;#xD6C4; &amp;#xAD6C;&amp;#xBB38; &amp;#xBD84;&amp;#xC11D; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2462; Parser: AST &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &lt;strong&gt;Parser&lt;/strong&gt;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; AST (&amp;#xCD94;&amp;#xC0C1; &amp;#xAD6C;&amp;#xBB38; &amp;#xD2B8;&amp;#xB9AC;, Abstract Syntax Tree)&amp;#xB97C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xD45C;&amp;#xD604;&amp;#xD55C; &amp;#xB098;&amp;#xBB34; &amp;#xAD6C;&amp;#xC870;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC778;&amp;#xB370;, &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xC774;&amp;#xB860;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2463; Ignition: Bytecode&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0DD;&amp;#xC131;&amp;#xB41C; AST&amp;#xB294; V8&amp;#xC758; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xC778; &lt;strong&gt;Ignition&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Ignition&amp;#xC740; &amp;#xC774; AST&amp;#xB97C; &amp;#xC21C;&amp;#xD68C;&amp;#xD558;&amp;#xBA70;, JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; CPU&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xBCF4;&amp;#xB2E4; &amp;#xD55C; &amp;#xB2E8;&amp;#xACC4; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654;&amp;#xB41C; &amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;&amp;#xC73C;&amp;#xB85C;, &amp;#xBE60;&amp;#xB978; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2464; &amp;#xC2E4;&amp;#xD589;!&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &lt;strong&gt;Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC791;&amp;#xC131;&amp;#xD55C; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBA70;, &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xB108;&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, DOM&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xB4E4;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. V8&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xC5EC;, &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB098; &amp;#xD2B9;&amp;#xC815; &amp;#xC870;&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC10;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;, &amp;#xC774;&amp;#xB97C; &amp;#xB354;&amp;#xC6B1; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; TurboFan&amp;#xC744; &amp;#xB3D9;&amp;#xC791;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4; &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &lt;strong&gt;JIT(Just-In-Time) &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xB418;&amp;#xBA70;, &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xD06C;&amp;#xAC8C; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; JavaScript &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC228;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &lt;strong&gt;V8 &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xB97C; &amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-V8-&amp;#xC5D4;&amp;#xC9C4;-&amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;a href=&#34;#2-2-V8-&amp;#xC5D4;&amp;#xC9C4;-&amp;#xC18C;&amp;#xAC1C;&#34; class=&#34;headerlink&#34; title=&#34;2.2 V8 &amp;#xC5D4;&amp;#xC9C4; &amp;#xC18C;&amp;#xAC1C;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.2 V8 &amp;#xC5D4;&amp;#xC9C4; &amp;#xC18C;&amp;#xAC1C;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;V8&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5; &amp;#xC790;&amp;#xB3D9;&amp;#xCC28; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB530;&amp;#xC628; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Chrome &amp;#xD300;&amp;#xC740; &amp;#xC790;&amp;#xC2E0;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E0; JavaScript &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xB9C8;&amp;#xCE58; V8 &amp;#xC5D4;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAE38; &amp;#xBC14;&amp;#xB77C;&amp;#xB294; &amp;#xB9C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBD99;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; V8&amp;#xC740; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xAE30;&amp;#xC220;&amp;#xC774; &amp;#xACB0;&amp;#xD569;&amp;#xB41C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;, JavaScript&amp;#xB294; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xD0C0;&amp;#xC774;&amp;#xD551; &amp;#xC5B8;&amp;#xC5B4;&lt;/strong&gt;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xC810;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xACE0; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5D4;&amp;#xC9C4; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC131;&amp;#xB2A5; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xC640; &amp;#xBCF4;&amp;#xC548; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD070; &amp;#xB3C4;&amp;#xC804; &amp;#xACFC;&amp;#xC81C;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; V8&amp;#xC740; &amp;#xB2E4;&amp;#xB2E8;&amp;#xACC4; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC744; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130; &amp;#xC5C6;&amp;#xC774;, &amp;#xACE7;&amp;#xBC14;&amp;#xB85C; JIT &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; &lt;strong&gt;Crankshaft&lt;/strong&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; JavaScript &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD55C;&amp;#xACC4;&amp;#xC5D0; &amp;#xBD80;&amp;#xB52A;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xC774; &amp;#xB9CE;&amp;#xACE0; &amp;#xC2DC;&amp;#xC791; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB290;&amp;#xB9BC;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xC5B8;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC131;&amp;#xC0C1; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC2E4;&amp;#xD328; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&lt;/strong&gt;&amp;#xC774; &amp;#xB192;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xBCF5;&amp;#xAD6C;(deopt)&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC6A9;&amp;#xB3C4; &amp;#xD07C;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ECMAScript &amp;#xD45C;&amp;#xC900; &amp;#xBC1C;&amp;#xC804;&lt;/strong&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBB38;&amp;#xBC95; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC774; &amp;#xC5B4;&amp;#xB824;&amp;#xC6C0;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB85C; Crankshaft&amp;#xB294; &lt;strong&gt;&amp;#xC720;&amp;#xC9C0; &amp;#xBCF4;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, V8 &amp;#xD300;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC124;&amp;#xACC4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;TurboFan&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TurboFan&amp;#xC758; &amp;#xB4F1;&amp;#xC7A5; (v5.9 &amp;#xC774;&amp;#xD6C4;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TurboFan&amp;#xC740; Crankshaft&amp;#xB97C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xACE0;&amp;#xAE09; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCCA0;&amp;#xD559;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC804;&amp;#xCCB4; JavaScript &amp;#xC5B8;&amp;#xC5B4; &amp;#xC2A4;&amp;#xD399;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;&amp;#xC911;&amp;#xAC04; &amp;#xD45C;&amp;#xD604;(IR)&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xCCB4;&amp;#xACC4;&amp;#xD654;&lt;/li&gt;
&lt;li&gt;&amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xACFC; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD655;&amp;#xC7A5;&amp;#xC131;&amp;#xACFC; &amp;#xC774;&amp;#xC2DD;&amp;#xC131; &amp;#xD655;&amp;#xBCF4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;TurboFan&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04;&amp;#xACFC; &amp;#xBE44;&amp;#xC6A9;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9E7;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, TurboFan&amp;#xC740; &amp;#xACFC;&amp;#xD55C; &amp;#xBB34;&amp;#xAE30;&amp;#xC600;&amp;#xB358; &amp;#xC148;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SparkPlug&amp;#xC758; &amp;#xB3C4;&amp;#xC785; (2021)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, V8 &amp;#xD300;&amp;#xC740; &lt;strong&gt;&amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xACBD;&amp;#xB7C9; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; SparkPlug&lt;/strong&gt;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC5EC;, &amp;#xC774;&amp;#xBBF8; &amp;#xD574;&amp;#xC11D;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB098; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0;, &amp;#xBE60;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC6B0;&amp;#xC120;&amp;#xC2DC;&lt;/li&gt;
&lt;li&gt;TurboFan&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE60;&amp;#xB974;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB35C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;SparkPlug&amp;#xB294; Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBE60;&amp;#xB974;&amp;#xACE0;, TurboFan&amp;#xBCF4;&amp;#xB2E4; &amp;#xAC00;&amp;#xBCBC;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368;, JavaScript &amp;#xC2E4;&amp;#xD589;&amp;#xC758; &amp;#xCD08;&amp;#xAE30; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD070; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB85C;&amp;#xB529;&amp;#xC774;&amp;#xB098; &amp;#xCD08;&amp;#xAE30; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC5D0; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Maglev&amp;#xC758; &amp;#xCD94;&amp;#xAC00; (2022~)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;SparkPlug&amp;#xC758; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; &amp;#xB098;&amp;#xC058;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC911;&amp;#xAC04;&amp;#xAE09; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xB0AE;&amp;#xC740; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC218;&amp;#xC900;&amp;#xC5D0; &amp;#xBA38;&amp;#xBB34;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. V8 &amp;#xD300;&amp;#xC740; SparkPlug&amp;#xC640; TurboFan &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xBA74;&amp;#xC11C;&amp;#xB3C4; &amp;#xB354; &amp;#xB611;&amp;#xB611;&amp;#xD55C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xC6D0;&amp;#xD588;&amp;#xACE0;, &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Maglev&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Maglev&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;SparkPlug&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; aggressive&amp;#xD55C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAE30;&amp;#xBC18; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;&amp;#xC744; &amp;#xC5B4;&amp;#xB290; &amp;#xC815;&amp;#xB3C4; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xC5EC; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC0DD;&amp;#xC131;&lt;/li&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC18D;&amp;#xB3C4;&amp;#xB294; SparkPlug&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; TurboFan&amp;#xC5D0; &amp;#xADFC;&amp;#xC811;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Maglev&amp;#xB294; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC131;&amp;#xB2A5; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD2B9;&amp;#xD788; &amp;#xC720;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, Tiering &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C; Ignition &amp;#x2192; Maglev &amp;#x2192; TurboFan&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xACC4;&amp;#xCE35;&amp;#xC801; &amp;#xC2E4;&amp;#xD589; &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC;, &amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#x201C;&amp;#xD56B;&amp;#xD568;&amp;#x201D;(hot code)&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC218;&amp;#xC900;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-V8-&amp;#xC2E4;&amp;#xD589;-&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#2-3-V8-&amp;#xC2E4;&amp;#xD589;-&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;2.3 V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;2.3 V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&lt;/h3&gt;&lt;p&gt;&amp;#xC704; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; V8 &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &lt;strong&gt;Ignition &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xACE0;, &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Ignition&amp;#xC740; &amp;#xBE60;&amp;#xB978; &amp;#xC2DC;&amp;#xC791;&amp;#xACFC; &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBE44;&amp;#xB97C; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xD06C;&amp;#xB86C; v5.9&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xC874;&amp;#xC758; Full-codegen&amp;#xC744; &amp;#xB300;&amp;#xCCB4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130;&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xAE30;&amp;#xB300;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC77C;&amp;#xC815; &amp;#xAE30;&amp;#xC900;&amp;#xC744; &amp;#xB118;&amp;#xB294; &amp;#x201C;&amp;#xD56B; &amp;#xCF54;&amp;#xB4DC;(hot code)&amp;#x201D;&amp;#xB294; &amp;#xC774;&amp;#xD6C4; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xB2E8;&amp;#xACC4;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; &lt;strong&gt;SparkPlug&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD574;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD0C0;&amp;#xC785; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB098; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC5C6;&amp;#xC774; &lt;strong&gt;&amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xB192;&amp;#xC774;&amp;#xACE0;, &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; CPU &amp;#xC790;&amp;#xC6D0;&amp;#xACFC; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xB3C4; &amp;#xC808;&amp;#xC57D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xC911;&amp;#xAC04; &amp;#xB2E8;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xB294; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB85C;&amp;#xB529;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB978; &amp;#xBC18;&amp;#xC751;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xAC00;&amp;#xBCCD;&amp;#xACE0; &amp;#xC989;&amp;#xAC01;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB54C;&amp;#xB85C;&amp;#xB294; &amp;#xB354; &amp;#xB192;&amp;#xC740; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; V8&amp;#xC758; &amp;#xACE0;&amp;#xC131;&amp;#xB2A5; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC778; &lt;strong&gt;TurboFan&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. TurboFan&amp;#xC740; Ignition&amp;#xC774;&amp;#xB098; SparkPlug &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &lt;strong&gt;&amp;#xD0C0;&amp;#xC785; &amp;#xD53C;&amp;#xB4DC;&amp;#xBC31;, &amp;#xD638;&amp;#xCD9C; &amp;#xD328;&amp;#xD134;, &amp;#xB8E8;&amp;#xD504; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;, &amp;#xACE0;&amp;#xAE09; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xB77C;&amp;#xC774;&amp;#xB2DD;, &amp;#xB8E8;&amp;#xD504; &amp;#xC804;&amp;#xAC1C;, &amp;#xD0C0;&amp;#xC785; &amp;#xD2B9;&amp;#xD654; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC;, &lt;strong&gt;&amp;#xC815;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB41C; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBABB;&amp;#xC9C0;&amp;#xC54A;&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC758; &amp;#xBA38;&amp;#xC2E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xBC88; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC774;&amp;#xD6C4; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C;, &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; TurboFan&amp;#xC758; &amp;#xD6A8;&amp;#xACFC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD07D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; TurboFan&amp;#xC740; &amp;#xC131;&amp;#xB2A5;&amp;#xC740; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBE44;&amp;#xC6A9;&amp;#xC774; &amp;#xD06C;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xAC00; &amp;#xC2E4;&amp;#xD328;(deopt)&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xC131;&amp;#xB2A5;&amp;#xC774; &amp;#xC800;&amp;#xD558;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &lt;strong&gt;Maglev&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Maglev&amp;#xB294; &lt;strong&gt;SparkPlug&amp;#xC640; TurboFan &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC131;&amp;#xB2A5;-&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xADE0;&amp;#xD615;&amp;#xC744; &amp;#xB9DE;&amp;#xCD94;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xCD5C;&amp;#xC2E0; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SparkPlug&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xC815;&amp;#xAD50;&amp;#xD558;&amp;#xAC8C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xBA70;, &amp;#xBD80;&amp;#xBD84;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xC785; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, TurboFan&amp;#xB9CC;&amp;#xD07C; &amp;#xBB34;&amp;#xAC81;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2022&amp;#xB144;&amp;#xBD80;&amp;#xD130; &amp;#xC810;&amp;#xC9C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC785;&amp;#xB41C; Maglev&amp;#xB294; &amp;#xD2B9;&amp;#xD788; &lt;strong&gt;&amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC790;&amp;#xC6D0;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0C1;&amp;#xC6D4;&amp;#xD55C; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xBC1C;&amp;#xD718;&amp;#xD558;&amp;#xBA70;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xC5D0; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xB300;&amp;#xC751;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC911;&amp;#xAC04; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xD615;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2014.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, V8&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xB2E8;&amp;#xC77C;&amp;#xD55C; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC;, &lt;strong&gt;&amp;#xC0C1;&amp;#xD669;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&lt;/strong&gt;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE44;&amp;#xC6A9;&amp;#xC744; &amp;#xB4E4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB9CC;&amp;#xD07C;&amp;#xB9CC; &amp;#xD22C;&amp;#xC790;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC810;&amp;#xC810; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xB04C;&amp;#xC5B4;&amp;#xC62C;&amp;#xB9AC;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xC8E0;. &amp;#xC774; &amp;#xACC4;&amp;#xCE35;&amp;#xD654;&amp;#xB41C; &amp;#xC2E4;&amp;#xD589; &amp;#xCCB4;&amp;#xACC4; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; V8&amp;#xC740; &lt;strong&gt;&amp;#xBE60;&amp;#xB978; &amp;#xC2DC;&amp;#xC791;, &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC18C;&amp;#xBE44;, &amp;#xB192;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xC131;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC138; &amp;#xB9C8;&amp;#xB9AC; &amp;#xD1A0;&amp;#xB07C;&amp;#xB97C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC7A1;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; JavaScript&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD504;&amp;#xB9AC;&amp;#xD130; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC784;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xC131;&amp;#xB2A5; &amp;#xD29C;&amp;#xB2DD; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xC720;&amp;#xC5F0;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image%2015.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &lt;strong&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&lt;/strong&gt;&amp;#xB3C4; &amp;#xB0B4;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. V8&amp;#xC758; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#x201C;&amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xAD6C;&amp;#xC870;&amp;#xC77C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;, &amp;#x201C;&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&amp;#x201D;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xAC00;&amp;#xC815;&amp;#xC5D0; &amp;#xAE30;&amp;#xBC18;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC00;&amp;#xC815;&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xB294; &amp;#xC21C;&amp;#xAC04;, V8&amp;#xC740; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC804;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC811;&amp;#xADFC;&amp;#xC774;&amp;#xB098; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD574;&amp;#xC11D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&lt;/strong&gt;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xBC14;&amp;#xB85C; &amp;#xC774; &amp;#xC9C0;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xC740; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C;, &amp;#xAC1D;&amp;#xCCB4;&amp;#xB098; &amp;#xAC12;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xCD94;&amp;#xB860;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xAE30;&amp;#xC874; &amp;#xAC00;&amp;#xC815;&amp;#xACFC; &amp;#xB2E4;&amp;#xB978; &amp;#xD0C0;&amp;#xC785;&amp;#xC73C;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xCC44; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC815;&amp;#xC218; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xB418;&amp;#xB358; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; &amp;#xB3C4;&amp;#xC911; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4;, V8&amp;#xC774; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xC774;&amp;#xB97C; &amp;#xC815;&amp;#xC218; &amp;#xBC30;&amp;#xC5F4;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD558;&amp;#xACE0; &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCC38;&amp;#xC870;&amp;#xB098; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870; &amp;#xC190;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC740; &amp;#xD2B9;&amp;#xD788; TurboFan&amp;#xC774;&amp;#xB098; Maglev&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACE0;&amp;#xAE09; JIT &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xC785; &amp;#xD2B9;&amp;#xD654;(type specialization), &amp;#xC778;&amp;#xB77C;&amp;#xC774;&amp;#xB2DD;(inlining), &amp;#xAC1D;&amp;#xCCB4; &amp;#xAD6C;&amp;#xC870; &amp;#xACE0;&amp;#xC815;(hidden class assumption) &amp;#xB4F1;&amp;#xC758; &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC911;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC27D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC131;&amp;#xB2A5;&amp;#xC744; &amp;#xADF9;&amp;#xB300;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xACE0;&amp;#xC815;&amp;#xD55C; &amp;#xCC44; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74;, &amp;#xADF8; &amp;#xC774;&amp;#xD6C4;&amp;#xC758; &amp;#xC608;&amp;#xC678;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xACE0;&amp;#xB824;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC77C;&amp;#xBD80; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBC18;&amp;#xBCF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#x201C;&amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4;, &lt;strong&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xC758;&amp;#xB3C4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;&amp;#xC774;&amp;#xB098; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&lt;/strong&gt;&amp;#xD558;&amp;#xC5EC;, &lt;strong&gt;V8&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; Native Code&amp;#xC758; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xB3D9;&amp;#xC791;&lt;/strong&gt;&amp;#xC744; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC218;&amp;#xC758; Chrome &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC6A9;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xBA70;, &amp;#xCD5C;&amp;#xADFC;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; V8 &amp;#xAE30;&amp;#xBC18; Type Confusion &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xACE0;&amp;#xC704;&amp;#xD5D8;&amp;#xAD70;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; V8 &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xC5D4;&amp;#xC9C4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD45C;&amp;#xD604;&amp;#xB418;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB418;&amp;#xBA70;, &amp;#xB098;&amp;#xC544;&amp;#xAC00; &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &lt;strong&gt;Type Confusion&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xC774;&amp;#xC288;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD55C;&amp;#xD638;&amp;#xD761; &amp;#xB04A;&amp;#xACE0; &amp;#xAC00;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#x314E;.&amp;#x314E; &amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C;&amp;#xD3B8;&amp;#xC744; &amp;#xC608;&amp;#xACE0;&amp;#xD558;&amp;#xBA70; &amp;#xC800;&amp;#xB294; Part 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Part 2 &amp;#xC608;&amp;#xACE0;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image%2016.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;p&gt;v &lt;strong&gt;Conference Video&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.youtube.com/watch?v=RL2po1swXO4&#34;&gt;https://www.youtube.com/watch?v=RL2po1swXO4&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;v &lt;strong&gt;V8 Engine&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://v8.dev/&#34;&gt;https://v8.dev/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/V8_(JavaScript_engine&#34;&gt;https://en.wikipedia.org/wiki/V8_(JavaScript_engine&lt;/a&gt;)&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://evan-moon.github.io/2019/06/28/v8-analysis/&#34;&gt;https://evan-moon.github.io/2019/06/28/v8-analysis/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d&#34;&gt;https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84&#34;&gt;https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551&#34;&gt;https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/07/01/OUYA77/Chrome_part1/kr/TypeConfusion101.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/07/01/ouya77/chrome_part1/kr/">

  <title>[Research] Type Confusion 101  Chrome Exploit ^-^Part 1.(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-07-01 17:20" pubdate>
      2025 7 1 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      5.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      116
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Type Confusion 101  Chrome Exploit ^-^Part 1.(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; OUYA77 &#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC11;&#xC790;&#xAE30; &#xB72C;&#xAE08; &#xC5C6;&#xC774; &#xD06C;&#xB86C;&#xC774; &#xB098;&#xC640;&#xC11C; &#xB2F9;&#xD669;&#xD558;&#xC168;&#xC8E0;. &#xC800;&#xB3C4; &#xB9CE;&#xC774; &#xB2F9;&#xD669;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC81C;&#xAC00; &#xD06C;&#xB86C;&#xC744; &#xD558;&#xACE0; &#xC788;&#xC744;&#xC904;&#xC740; &#xBAB0;&#xB790;&#xB294;&#xB370;, &#xC5B4;&#xCA4C;&#xB2E4;&#xAC00; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#xB3D9;&#xC601;&#xC0C1;&#xC744; &#xBCF4;&#xAC8C; &#xB418;&#xC5C8;&#xACE0; &#xADF8;&#xB0E5; &#x201C;&#xC640;, &#xC7AC;&#xBC0C;&#xB2E4;.&#x201D;&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5B4;&#xC11C; &#xC544;&#xBB34;&#xC0DD;&#xAC01; &#xC5C6;&#xC774; &#xACF5;&#xBD80;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=RL2po1swXO4">&#xB9C1;&#xD06C;</a>).</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xD06C;&#xB86C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xD574;&#xC57C;&#xC9C0;, &#xC81C;&#xB85C;&#xB370;&#xC774;&#xB97C; &#xCC3E;&#xC544;&#xC57C;&#xC9C0; &#xAC19;&#xC740; &#xAC70;&#xCC3D;&#xD55C; &#xBAA9;&#xD45C;&#xB294; &#xC5C6;&#xAD6C;&#xC694;. &#xADF8;&#xB0E5; &#x2018;&#xC7AC;&#xBC0C;&#xC73C;&#xB2C8; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xB2E4;&#x2019; &#xC815;&#xB3C4; &#xC778;&#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD06C;&#xB86C;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D; &#xACF5;&#xBD80;&#xB97C; &#xD574;&#xBCF4;&#xBA74; <strong>Type Confusion</strong>&#xC774;&#xB77C;&#xB294; &#xC6A9;&#xC5B4;&#xB97C; &#xC2EC;&#xC2EC;&#xCE58; &#xC54A;&#xAC8C; &#xB4E4;&#xC744; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC774; Type Confusion &#xC774; &#xBB58;&#xAE4C;&#xB3C4; &#xAD81;&#xAE08;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC788;&#xB294; &#xBE14;&#xB85C;&#xADF8; &#xAE00;&#xB4E4;&#xC744; &#xCB49; &#xBD24;&#xB294;&#xB370;, js, &#xC6F9; &#xAD00;&#xB828; &#xB0B4;&#xC6A9;&#xC744; 1&#xB3C4; &#xBAA8;&#xB974;&#xB294; &#xC800;&#xB85C;&#xC11C;&#xB294; &#xC774;&#xD574;&#xD558;&#xAE30;&#xAC00; &#xB108;&#xBB34;&#xC5B4;&#xB824;&#xC6E0;&#xC5B4;&#xC694;. &#xADF8;&#xB798;&#xB3C4; Chrome Exploit &#xC744; &#xACF5;&#xBD80;&#xD574;&#xBD24;&#xB294;&#xB370; &#xC544; &#xC774;&#xB798;&#xC11C; Type Confusion &#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC774;&#xAC78; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; Exploit&#xC744; &#xD558;&#xB294;&#xAD6C;&#xB098; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC81C;&#xAC00; &#xACF5;&#xBD80;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0DD;&#xC0B0;&#xC131;&#xC788;&#xAC8C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC838;&#xAC08; &#xC218; &#xC788;&#xC744;&#xAE4C; &#xACE0;&#xBBFC;&#xD574;&#xBCF4;&#xC558;&#xB294;&#xB370;, &#x201C;&#xBC30;&#xC6CC;&#xC11C; &#xB0A8;&#xC8FC;&#xC790;&#x201D;&#xB77C;&#xB294; &#xB9D0;&#xCC98;&#xB7FC; &#xD06C;&#xB86C; exploit &#xACF5;&#xBD80;&#xC5D0; &#xAC00;&#xC7A5; baseline &#xC774; &#xB418;&#xB294; Type Confusion&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xCD08;&#xC2EC;&#xC790;&#xAC00; &#xC785;&#xBB38;&#xD558;&#xAE30; &#xC88B;&#xAC8C; &#xD55C;&#xB2E4;&#xBA74; &#xADF8;&#xAC78;&#xB85C; &#xC774;&#xBBF8; &#xC720;&#xC758;&#xBBF8;&#xD55C; &#xACB0;&#xACFC;&#xAC00; &#xC544;&#xB2D0;&#xAE4C; &#xC0DD;&#xAC01;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xC11C; &#xB098;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;!!!!</p>
<p><img src="TypeConfusion101.png" srcset="/img/loading.gif" alt="TypeConfusion101.png"></p>
<p>Type Confusion &#xC774; &#xBB34;&#xC5C7;&#xC774;&#xACE0; &#xD06C;&#xB86C;&#xC5D0;&#xC11C;&#xB294; &#xC65C; &#xBC1C;&#xC0DD;&#xD558;&#xBA70;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xBB34;&#xC5C7;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xD55C;&#xBC88; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; &#xC774;&#xBBF8; &#xC800;&#xC758; &#xC0AC;&#xC2EC;(?)&#xC744; &#xB2F4;&#xC544;&#xC11C; Type Confusion &#xC5D0; &#xAD00;&#xB828;&#xD55C; &#xC2A4;&#xD3EC;&#xB97C; &#xC774;&#xBBF8; &#xD558;&#xACE0; &#xC788;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://maily.so/hackyboiz/posts/1gz2v4jxr3q">https://maily.so/hackyboiz/posts/1gz2v4jxr3q</a></p>
<p>&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;^^</p>
<p>Type Confusion 101 in Chrome &#xC2DC;&#xB9AC;&#xC988;&#xB294; 4&#xBD80;&#xC791;&#xC73C;&#xB85C; &#xC0DD;&#xAC01; &#xC911;&#xC778;&#xB370;, &#xC778;&#xC0DD;&#xC740; &#xC5ED;&#xC2DC; &#xC0DD;&#xAC01;&#xD55C;&#xB300;&#xB85C; &#xC548;&#xB418;&#xB294;&#xAC8C; &#xC7AC;&#xBBF8; &#xC544;&#xB2C8;&#xACA0;&#xC5B4;&#xC694;?!? &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xC9C0;&#xB294; &#xAC19;&#xC774; &#xC9C0;&#xCF1C;&#xBCF4;&#xC790;&#xAD6C;&#xC694;! &#x314E;&#x314E;</p>
<p>&#xC624;&#xB298;&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xB0B4;&#xC6A9;&#xBD80;&#xD130; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBBF8; &#xB2E4; &#xC544;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC; &#xD06C;&#xB86C;&#xC774; &#xBB34;&#xC5C7;&#xC774;&#xACE0; Type Confusion &#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; V8&#xC740; &#xC5B4;&#xB5A4; component&#xC778;&#xC9C0; &#xAC19;&#xC774; &#xBCF4;&#xB7EC; &#xAC00;&#xC2DC;&#xC8E0; </p>
<p><img src="image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="1-Chrome-&#xC804;&#xCCB4;-&#xC544;&#xD0A4;&#xD14D;&#xCC98;-&#xAC1C;&#xC694;"><a href="#1-Chrome-&#xC804;&#xCCB4;-&#xC544;&#xD0A4;&#xD14D;&#xCC98;-&#xAC1C;&#xC694;" class="headerlink" title="1. Chrome &#xC804;&#xCCB4; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xAC1C;&#xC694;"></a><strong>1. Chrome &#xC804;&#xCCB4; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xAC1C;&#xC694;</strong></h2><h3 id="1-1-Multi-process-&#xAD6C;&#xC870;"><a href="#1-1-Multi-process-&#xAD6C;&#xC870;" class="headerlink" title="1.1 Multi-process &#xAD6C;&#xC870;"></a>1.1 Multi-process &#xAD6C;&#xC870;</h3><p>&#xD06C;&#xB86C;&#xC740; &#xB538;&#xAE4D;(&#xC544;&#xC774;&#xCF58; &#xB354;&#xBE14;&#xD074;&#xB9AD;)&#xD558;&#xBA74; &#xD558;&#xB098;&#xC758; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xCF1C;&#xC9C0;&#xC9C0;&#xB9CC;, &#xC0AC;&#xC2E4;&#xC740; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC774; IPC &#xD1B5;&#xC2E0;&#xC744; &#xD558;&#xBA70; &#xB3CC;&#xC544;&#xAC00;&#xB294; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (IPC &#xD1B5;&#xC2E0;&#xC774; &#xAD81;&#xAE08;&#xD558;&#xC2DC;&#xB2E4;&#xBA74; &#x2192; <a href="https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/">**[Research] Windows Named Pipe (KR)</a> )**</p>
<p><img src="image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>ref. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://developer.chrome.com/blog/inside-browser-part1">https://developer.chrome.com/blog/inside-browser-part1</a></p>
<p>&#xD06C;&#xB86C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xB0B4;&#xBD80;&#xC5D0;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xD575;&#xC2EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01;&#xC740; &#xD2B9;&#xC815; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xBA70;, &#xD568;&#xAED8; &#xC791;&#xB3D9;&#xD574; &#xD558;&#xB098;&#xC758; &#xD1B5;&#xD569;&#xB41C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD658;&#xACBD;&#xC744; &#xAD6C;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><strong>Browser Process</strong></p>
<p>  &#xC6B0;&#xB9AC;&#xAC00; &#xB9E4;&#xC77C; &#xBCF4;&#xB294; &#xD0ED;, &#xC8FC;&#xC18C;&#xCC3D;, &#xC990;&#xACA8;&#xCC3E;&#xAE30; &#xBC14; &#xB4F1; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC758; UI&#xB97C; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xD06C;&#xB86C;&#xC744; &#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C; &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xC791;&#xB3D9;&#xD558;&#xB294; &#xD575;&#xC2EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Renderer Process</strong></p>
<p>  &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xC758; &#xC2E4;&#xC9C8;&#xC801;&#xC778; &#xB80C;&#xB354;&#xB9C1; &#xC791;&#xC5C5;&#xC744; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. HTML, CSS, JavaScript &#xAC19;&#xC740; &#xD504;&#xB7F0;&#xD2B8;&#xC5D4;&#xB4DC; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xC5EC;, &#xC6B0;&#xB9AC;&#xAC00; &#xB208;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xB294; &#xC2DC;&#xAC01;&#xC801; &#xACB0;&#xACFC;&#xBB3C;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>GPU Process</strong></p>
<p>  2D/3D &#xADF8;&#xB798;&#xD53D; &#xCC98;&#xB9AC;&#xB098; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xAC00;&#xC18D;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xC791;&#xC5C5;&#xC744; &#xC804;&#xB2F4;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Utility / Network / Extension Process &#xB4F1;</strong></p>
<p>  &#xAC01;&#xAC01; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;, &#xBA40;&#xD2F0;&#xBBF8;&#xB514;&#xC5B4; &#xCC98;&#xB9AC;, &#xD655;&#xC7A5; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xAC19;&#xC740; &#xBCC4;&#xB3C4;&#xC758; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<p>&#xC774;&#xCC98;&#xB7FC; &#xAC01; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC5ED;&#xD560;&#xC744; &#xBD84;&#xB2F4;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xB97C; &#xC6B0;&#xB9AC;&#xB294; &#xBA40;&#xD2F0; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; &#xD06C;&#xB86C;&#xC774; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; &#xB098;&#xB258;&#xC5B4; &#xC788;&#xB294; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xB294; &#xBC14;&#xB85C; <strong>&#xBCF4;&#xC548;</strong>&#xACFC; <strong>&#xC548;&#xC815;&#xC131;</strong> &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC11C;&#xB85C; <strong>&#xACA9;&#xB9AC;</strong>&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC11C;, &#xC124;&#xB839; &#xD558;&#xB098;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC804;&#xCCB4; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xAC00; &#xBA39;&#xD1B5;&#xC774; &#xB418;&#xB294; &#xB300;&#xCC38;&#xC0AC;&#xB97C; &#xB9C9;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC545;&#xC131; &#xCF54;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8; &#xB54C;&#xBB38;&#xC5D0; Renderer Process&#xAC00; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC885;&#xB8CC;&#xB418;&#xB354;&#xB77C;&#xB3C4;, Browser Process&#xB294; &#xC5EC;&#xC804;&#xD788; &#xC0B4;&#xC544;&#xB0A8;&#xC544; &#x201C;&#xC774; &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xC751;&#xB2F5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;&#x201D; &#xAC19;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC804;&#xB2EC;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<p><img src="image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xBC14;&#xB85C; &#xC774; <strong>&#xACA9;&#xB9AC;</strong> &#xAC1C;&#xB150;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xD55C; <strong>Sandbox &#xBCF4;&#xC548; &#xBAA8;&#xB378;</strong>&#xC774; &#xD06C;&#xB86C; &#xBCF4;&#xC548;&#xC758; &#xD575;&#xC2EC; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. (Sandbox&#xB294; &#xB2E4;&#xC74C; &#xD3B8;&#xC5D0;&#xC11C; &#xB354; &#xC790;&#xC138;&#xD788; &#xB2E4;&#xB8E8;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!)</p>
<h3 id="1-2-&#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC;-&#xB9AC;&#xC18C;&#xC2A4;-&#xCC98;&#xB9AC;-&#xACFC;&#xC815;-in-Chrome"><a href="#1-2-&#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC;-&#xB9AC;&#xC18C;&#xC2A4;-&#xCC98;&#xB9AC;-&#xACFC;&#xC815;-in-Chrome" class="headerlink" title="1.2 &#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC; &#xB9AC;&#xC18C;&#xC2A4; &#xCC98;&#xB9AC; &#xACFC;&#xC815; in Chrome"></a>1.2 &#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC; &#xB9AC;&#xC18C;&#xC2A4; &#xCC98;&#xB9AC; &#xACFC;&#xC815; in Chrome</h3><p><img src="image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>Chrome &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB294; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; <strong>&#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC; &#xB9AC;&#xC18C;&#xC2A4;</strong>, &#xC608;&#xB97C; &#xB4E4;&#xC5B4; HTML, CSS, JavaScript &#xD30C;&#xC77C;&#xC744; &#xBC1B;&#xC544;&#xC640; &#xC774;&#xB97C; &#xB80C;&#xB354;&#xB9C1;&#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; &#xD0ED; &#xD558;&#xB098;&#xB97C; &#xC5F4;&#xACE0; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xB294; &#xADF8; &#xC9E7;&#xC740; &#xC21C;&#xAC04;&#xC5D0;&#xB3C4; &#xC704;&#xC5D0;&#xC11C; &#xBCF4;&#xC168;&#xB2E4;&#xC2DC;&#xD53C; &#xBA40;&#xD2F0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xAF64; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB294; &#xC11C;&#xBC84;&#xB85C;&#xBD80;&#xD130; <strong>HTML &#xBB38;&#xC11C;</strong>&#xB97C; &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xBC1B;&#xC544;&#xC624;&#xACE0; &#xC774;&#xB97C; &#xD30C;&#xC2F1;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; <code>&lt;link&gt;</code>&#xB098; <code>&lt;script&gt;</code> &#xD0DC;&#xADF8; &#xB4F1;&#xC744; &#xB9CC;&#xB098;&#xAC8C; &#xB418;&#xBA74;, &#xADF8;&#xC5D0; &#xB530;&#xB77C; &#xC678;&#xBD80; <strong>CSS &#xD30C;&#xC77C;</strong>&#xACFC; <strong>JavaScript &#xD30C;&#xC77C;</strong>&#xB3C4; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xD558;&#xACE0; &#xBD88;&#xB7EC;&#xC624;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xBC1B;&#xC544;&#xC628; &#xB9AC;&#xC18C;&#xC2A4;&#xB4E4;&#xC740; &#xAC01;&#xC790; &#xC5ED;&#xD560;&#xC774; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. <strong>HTML</strong>&#xC740; &#xD398;&#xC774;&#xC9C0;&#xC758; &#xAE30;&#xBCF8; &#xAD6C;&#xC870;&#xB97C; &#xC815;&#xC758;&#xD558;&#xB294; &#xBF08;&#xB300; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xACE0;, <strong>CSS</strong>&#xB294; &#xADF8; &#xBF08;&#xB300;&#xC5D0; &#xC0C9;&#xACFC; &#xD615;&#xD0DC;&#xB97C; &#xC785;&#xD788;&#xB294; &#xC2A4;&#xD0C0;&#xC77C; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xB2F9;&#xD558;&#xC8E0;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; <strong>JavaScript</strong>&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC640;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;, &#xC774;&#xBCA4;&#xD2B8; &#xCC98;&#xB9AC;, &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158; &#xB4F1; <strong>&#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xC0DD;&#xBA85;&#xB825;&#xC744; &#xBD88;&#xC5B4;&#xB123;&#xB294; &#xB3D9;&#xC791; &#xB85C;&#xC9C1;</strong>&#xC744; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD2B9;&#xD788; JavaScript&#xB294; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB4E4;&#xACFC; &#xB2EC;&#xB9AC; <strong>&#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD0C0;&#xC785;&#xC774; &#xBC14;&#xB00C;&#xACE0;</strong>, &#xC2E4;&#xD589; &#xC911;&#xC5D0; <strong>&#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAC70;&#xB098; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294; &#xC720;&#xC5F0;&#xD55C; &#xD2B9;&#xC131;</strong>&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xC774;&#xB7F0; &#xD2B9;&#xC131; &#xB355;&#xBD84;&#xC5D0; &#xC6F9; &#xAC1C;&#xBC1C;&#xC774; &#xD6E8;&#xC52C; &#xC720;&#xC5F0;&#xD574;&#xC9C0;&#xC9C0;&#xB9CC;, &#xBC18;&#xB300;&#xB85C; &#xC774;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xB0B4;&#xBD80;&#xC758; &#xC2E4;&#xD589; &#xD658;&#xACBD;&#xC740; &#xD6E8;&#xC52C; &#xB354; &#xBCF5;&#xC7A1;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%205.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xADF8;&#xB798;&#xC11C; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBC14;&#xB85C; <strong>V8 JavaScript &#xC5D4;&#xC9C4;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xD06C;&#xB86C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB294; &#xC774; V8 &#xC5D4;&#xC9C4;&#xC744; &#xC0AC;&#xC6A9;&#xD574; JavaScript &#xCF54;&#xB4DC;&#xB97C; &#xBE60;&#xB974;&#xACE0; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xBA70;, &#xADF8; &#xBAA8;&#xB4E0; &#xACFC;&#xC815;&#xC740; &#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB77C;&#xB294; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xACF5;&#xAC04; &#xC548;&#xC5D0;&#xC11C; &#xC774;&#xB904;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xB354; &#xC54C;&#xC544;&#xBCF4;&#xB7EC; &#xAC00;&#xC2DC;&#xC8E0;!</p>
<h2 id="2-About-Render-Process"><a href="#2-About-Render-Process" class="headerlink" title="2. About Render Process"></a>2. About Render Process</h2><p>&#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC2E4;&#xC81C;&#xB85C; &#x201C;&#xBCF4;&#xC5EC;&#xC8FC;&#xACE0; &#xB3D9;&#xC791;&#xD558;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294;&#x201D; &#xBAA8;&#xB4E0; &#xCC98;&#xB9AC;&#xB294; &#xBC14;&#xB85C; &#xC774; <strong>&#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;</strong>&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xC758; &#xD0ED;&#xC740; &#xD558;&#xB098;&#xC758; &#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB2F4;&#xB2F9;&#xD558;&#xBA70;, &#xC774; &#xC548;&#xC5D0;&#xC11C; HTML &#xD30C;&#xC2F1;&#xACFC; CSS &#xC801;&#xC6A9;, DOM &#xAD6C;&#xC131;, JavaScript &#xC2E4;&#xD589;, &#xB808;&#xC774;&#xC544;&#xC6C3; &#xACC4;&#xC0B0;, &#xD398;&#xC778;&#xD305;, &#xCEF4;&#xD3EC;&#xC9C0;&#xD305;&#xAE4C;&#xC9C0; &#xC804;&#xCCB4; &#xB80C;&#xB354;&#xB9C1; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC774; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>JavaScript&#xB294; &#xC2E4;&#xD589; &#xC911;&#xC5D0; &#xD0C0;&#xC785;&#xC774; &#xBC14;&#xB00C;&#xAC70;&#xB098; &#xAC1D;&#xCCB4; &#xAD6C;&#xC870;&#xAC00; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xBCC0;&#xD560; &#xC218; &#xC788;&#xB294; &#xC544;&#xC8FC; &#xC720;&#xC5F0;&#xD55C; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xB7F0; &#xC720;&#xC5F0;&#xC131;&#xC740; &#xACE7;, &#xBA54;&#xBAA8;&#xB9AC; &#xBCC0;&#xC870;&#xB098; <strong>Type Confusion</strong> &#xAC19;&#xC740; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC704;&#xD5D8;&#xB3C4; &#xD568;&#xAED8; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC704;&#xD5D8;&#xC744; &#xC904;&#xC774;&#xAE30; &#xC704;&#xD574;, Chrome&#xC740; <strong>JavaScript&#xB97C; &#xBCC4;&#xB3C4;&#xC758; &#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xACA9;&#xB9AC;</strong>&#xD558;&#xC5EC; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD0ED; &#xD558;&#xB098;&#xC5D0;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xC0DD;&#xACA8;&#xB3C4; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB9CC; &#xC885;&#xB8CC;&#xD558;&#xBA74; &#xB418;&#xACE0;, &#xB2E4;&#xB978; &#xD0ED;&#xC774;&#xB098; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xC804;&#xCCB4;&#xC5D0;&#xB294; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xAC8C; &#xC124;&#xACC4;&#xB41C; &#xAC70;&#xC8E0;. &#xC774;&#xC81C; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C;, &#xC774;&#xB7F0; &#xB80C;&#xB354;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; <strong>JavaScript&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0;</strong> &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-1-Blink-&#x2192;-V8-&#xD750;&#xB984;"><a href="#2-1-Blink-&#x2192;-V8-&#xD750;&#xB984;" class="headerlink" title="2.1 Blink &#x2192; V8 &#xD750;&#xB984;"></a><strong>2.1 Blink &#x2192; V8 &#xD750;&#xB984;</strong></h3><p>&#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC758; &#xB80C;&#xB354;&#xB9C1; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC5D0;&#xC11C; <strong>HTML &#xD30C;&#xC2F1;&#xACFC; &#xD654;&#xBA74; &#xB80C;&#xB354;&#xB9C1;</strong>&#xC740; Blink &#xC5D4;&#xC9C4;&#xC774; &#xB2F4;&#xB2F9;&#xD558;&#xACE0;, <strong>JavaScript &#xCF54;&#xB4DC;&#xC758; &#xC2E4;&#xD589;</strong>&#xC740; V8 &#xC5D4;&#xC9C4;&#xC774; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB450; &#xC5D4;&#xC9C4;&#xC740; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC644;&#xC804;&#xD788; &#xAD6C;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xAE34;&#xBC00;&#xD558;&#xAC8C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>Blink</strong>&#xB294; &#xB80C;&#xB354;&#xB9C1; &#xC5D4;&#xC9C4;&#xC73C;&#xB85C;, HTML&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xACE0; DOM&#xC744; &#xAD6C;&#xC131;&#xD558;&#xBA70;</p>
<p><strong>V8</strong>&#xC740; JavaScript &#xC2E4;&#xD589;&#xC744; &#xC804;&#xBB38;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xC5D4;&#xC9C4;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xC774;&#xC81C; Blink&#xC5D0;&#xC11C; V8&#xC73C;&#xB85C; &#xC81C;&#xC5B4; &#xD750;&#xB984;&#xC774; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#x2460; <code>&lt;script&gt;</code> &#xD0DC;&#xADF8;&#xB97C; &#xB9CC;&#xB098;&#xBA74;</strong></p>
<p>Blink&#xB294; HTML&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xB358; &#xC911; <code>&lt;script&gt;</code> &#xD0DC;&#xADF8;&#xB97C; &#xB9CC;&#xB098;&#xBA74;, JavaScript &#xD30C;&#xC77C;&#xC744; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xAE30; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D;&#xB41C; JS &#xCF54;&#xB4DC;&#xB294; &#xBB38;&#xC790;&#xC5F4; &#xD615;&#xD0DC;&#xB85C; V8 &#xC5D4;&#xC9C4;&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xACE0;, &#xC774;&#xC81C;&#xBD80;&#xD130;&#xB294; V8&#xC774; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xC774;&#xC5B4;&#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<p>&#x2461; <strong>Scanner: &#xBB38;&#xC790;&#xC5F4; &#x2192; &#xD1A0;&#xD070;(Token) &#xBD84;&#xD574;</strong></p>
<p>V8 &#xB0B4;&#xBD80;&#xC5D0;&#xC11C;&#xB294; Blink&#xB85C;&#xBD80;&#xD130; &#xC804;&#xB2EC;&#xBC1B;&#xC740; <strong>UTF-16 &#xBB38;&#xC790;&#xC5F4; &#xD615;&#xD0DC;&#xC758; JavaScript &#xCF54;&#xB4DC;</strong>&#xB97C; &#xBA3C;&#xC800; &#xC2A4;&#xCE90;&#xB108;&#xAC00; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xCE90;&#xB108;&#xB294; &#xC774; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC758; &#xBB38;&#xBC95; &#xADDC;&#xCE59;&#xC5D0; &#xB530;&#xB77C; &#xC758;&#xBBF8; &#xC788;&#xB294; &#xCD5C;&#xC18C; &#xB2E8;&#xC704;&#xC778; &#xD1A0;&#xD070;&#xC73C;&#xB85C; &#xBD84;&#xD574;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; <code>function</code>, <code>if</code>, <code>=</code>, <code>123</code>, <code>&apos;hello&apos;</code> &#xB4F1;&#xC740; &#xBAA8;&#xB450; &#xAC01;&#xAC01;&#xC758; &#xD1A0;&#xD070;&#xC73C;&#xB85C; &#xBD84;&#xB9AC;&#xB418;&#xBA70;, &#xC774;&#xD6C4; &#xAD6C;&#xBB38; &#xBD84;&#xC11D; &#xB2E8;&#xACC4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%208.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<p><strong>&#x2462; Parser: AST &#xC0DD;&#xC131;</strong></p>
<p>&#xC774;&#xC81C; <strong>Parser</strong>&#xAC00; &#xD1A0;&#xD070;&#xB4E4;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xC11C; AST (&#xCD94;&#xC0C1; &#xAD6C;&#xBB38; &#xD2B8;&#xB9AC;, Abstract Syntax Tree)&#xB97C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xC774; &#xD2B8;&#xB9AC;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xC758;&#xBBF8;&#xB97C; &#xD45C;&#xD604;&#xD55C; &#xB098;&#xBB34; &#xAD6C;&#xC870;&#xC758; &#xB370;&#xC774;&#xD130;&#xC778;&#xB370;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xC774;&#xB860;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xBBC0;&#xB85C; &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xB118;&#xC5B4;&#xAC00;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%209.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<p><strong>&#x2463; Ignition: Bytecode&#xB85C; &#xBCC0;&#xD658;</strong></p>
<p>&#xC0DD;&#xC131;&#xB41C; AST&#xB294; V8&#xC758; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xC778; <strong>Ignition</strong>&#xC73C;&#xB85C; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;. Ignition&#xC740; &#xC774; AST&#xB97C; &#xC21C;&#xD68C;&#xD558;&#xBA70;, JavaScript &#xCF54;&#xB4DC;&#xB97C; V8 &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB294; CPU&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xBA38;&#xC2E0; &#xCF54;&#xB4DC;&#xBCF4;&#xB2E4; &#xD55C; &#xB2E8;&#xACC4; &#xCD94;&#xC0C1;&#xD654;&#xB41C; &#xC911;&#xAC04; &#xD45C;&#xD604;&#xC73C;&#xB85C;, &#xBE60;&#xB978; &#xC2E4;&#xD589;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2010.png" srcset="/img/loading.gif" alt="image.png"></p>
<hr>
<p><strong>&#x2464; &#xC2E4;&#xD589;!</strong></p>
<p>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB41C; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB294; <strong>Ignition &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;</strong>&#xC5D0; &#xC758;&#xD574; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xAC00; &#xC791;&#xC131;&#xD55C; JavaScript &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xBA70;, &#xC774;&#xBCA4;&#xD2B8; &#xB9AC;&#xC2A4;&#xB108;&#xB97C; &#xB4F1;&#xB85D;&#xD558;&#xAC70;&#xB098;, DOM&#xC744; &#xC218;&#xC815;&#xD558;&#xAC70;&#xB098;, &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB3D9;&#xC791;&#xB4E4;&#xC774; &#xC218;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. V8&#xC740; &#xC2E4;&#xD589; &#xC911; &#xCF54;&#xB4DC;&#xC758; &#xC2E4;&#xD589; &#xD328;&#xD134;&#xC744; &#xAD00;&#xCC30;&#xD558;&#xC5EC;, &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xD568;&#xC218;&#xB098; &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xAC10;&#xC9C0;&#xD558;&#xBA74;, &#xC774;&#xB97C; &#xB354;&#xC6B1; &#xBE60;&#xB974;&#xAC8C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCD5C;&#xC801;&#xD654; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC778; TurboFan&#xC744; &#xB3D9;&#xC791;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB294; &#xAE30;&#xACC4;&#xC5B4; &#xC218;&#xC900;&#xC758; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xCF54;&#xB4DC;&#xB85C; <strong>JIT(Just-In-Time) &#xCEF4;&#xD30C;&#xC77C;</strong>&#xB418;&#xBA70;, &#xC131;&#xB2A5;&#xC774; &#xD06C;&#xAC8C; &#xD5A5;&#xC0C1;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774;&#xC81C;&#xBD80;&#xD130;&#xB294; &#xC774;&#xB7EC;&#xD55C; JavaScript &#xC2E4;&#xD589; &#xACFC;&#xC815; &#xB4A4;&#xC5D0; &#xC228;&#xC5B4; &#xC788;&#xB294; <strong>V8 &#xB0B4;&#xBD80; &#xAD6C;&#xC870;</strong>&#xB97C; &#xC870;&#xAE08; &#xB354; &#xB4E4;&#xC5EC;&#xB2E4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-2-V8-&#xC5D4;&#xC9C4;-&#xC18C;&#xAC1C;"><a href="#2-2-V8-&#xC5D4;&#xC9C4;-&#xC18C;&#xAC1C;" class="headerlink" title="2.2 V8 &#xC5D4;&#xC9C4; &#xC18C;&#xAC1C;"></a><strong>2.2 V8 &#xC5D4;&#xC9C4; &#xC18C;&#xAC1C;</strong></h3><p><img src="image%2011.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>V8&#xC774;&#xB77C;&#xB294; &#xC774;&#xB984;&#xC740; &#xACE0;&#xC131;&#xB2A5; &#xC790;&#xB3D9;&#xCC28; &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C; &#xB530;&#xC628; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. Chrome &#xD300;&#xC740; &#xC790;&#xC2E0;&#xB4E4;&#xC774; &#xB9CC;&#xB4E0; JavaScript &#xC5D4;&#xC9C4;&#xC774; &#xB9C8;&#xCE58; V8 &#xC5D4;&#xC9C4;&#xCC98;&#xB7FC; &#xBE60;&#xB974;&#xACE0; &#xAC15;&#xB825;&#xD558;&#xAE38; &#xBC14;&#xB77C;&#xB294; &#xB9C8;&#xC74C;&#xC5D0;&#xC11C; &#xC774; &#xC774;&#xB984;&#xC744; &#xBD99;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; V8&#xC740; &#xB2E8;&#xC21C;&#xD55C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xAC00; &#xC544;&#xB2C8;&#xB77C;, &#xB2E4;&#xC591;&#xD55C; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xC220;&#xC774; &#xACB0;&#xD569;&#xB41C; &#xBCF5;&#xC7A1;&#xD558;&#xACE0; &#xC815;&#xAD50;&#xD55C; &#xC2E4;&#xD589; &#xC5D4;&#xC9C4;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xC55E;&#xC5D0;&#xC11C;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774;, JavaScript&#xB294; <strong>&#xB3D9;&#xC801; &#xD0C0;&#xC774;&#xD551; &#xC5B8;&#xC5B4;</strong>&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2E4;&#xD589; &#xC2DC;&#xC810;&#xAE4C;&#xC9C0; &#xBCC0;&#xC218;&#xC758; &#xD0C0;&#xC785;&#xC774;&#xB098; &#xAC1D;&#xCCB4;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xC815;&#xD655;&#xD788; &#xC54C; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xAC1C;&#xBC1C;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xB9E4;&#xC6B0; &#xC720;&#xC5F0;&#xD558;&#xACE0; &#xD3B8;&#xB9AC;&#xD558;&#xC9C0;&#xB9CC;, &#xC5D4;&#xC9C4; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xC131;&#xB2A5; &#xCD5C;&#xC801;&#xD654;&#xC640; &#xBCF4;&#xC548; &#xCE21;&#xBA74;&#xC5D0;&#xC11C; &#xB9E4;&#xC6B0; &#xD070; &#xB3C4;&#xC804; &#xACFC;&#xC81C;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; V8&#xC740; &#xB2E4;&#xB2E8;&#xACC4; &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xC5C6;&#xC774;, &#xACE7;&#xBC14;&#xB85C; JIT &#xCD5C;&#xC801;&#xD654; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC778; <strong>Crankshaft</strong>&#xB97C; &#xC0AC;&#xC6A9;&#xD574; JavaScript &#xCF54;&#xB4DC;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xBA38;&#xC2E0; &#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD588;&#xC9C0;&#xB9CC;, &#xC774;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD55C;&#xACC4;&#xC5D0; &#xBD80;&#xB52A;&#xD614;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;&#xB97C; &#xCD5C;&#xC801;&#xD654;&#xD558;&#xB824;&#xB2E4; &#xBCF4;&#xB2C8; <strong>&#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB9CE;&#xACE0; &#xC2DC;&#xC791; &#xC18D;&#xB3C4;&#xAC00; &#xB290;&#xB9BC;</strong></li>
<li><strong>&#xB3D9;&#xC801; &#xC5B8;&#xC5B4; &#xD2B9;&#xC131;&#xC0C1; &#xCD5C;&#xC801;&#xD654; &#xC2E4;&#xD328; &#xAC00;&#xB2A5;&#xC131;</strong>&#xC774; &#xB192;&#xACE0;, &#xC774;&#xB97C; &#xBCF5;&#xAD6C;(deopt)&#xD558;&#xB294; &#xBE44;&#xC6A9;&#xB3C4; &#xD07C;</li>
<li><strong>ECMAScript &#xD45C;&#xC900; &#xBC1C;&#xC804;</strong>&#xC5D0; &#xB530;&#xB978; &#xC0C8;&#xB85C;&#xC6B4; &#xBB38;&#xBC95; &#xC9C0;&#xC6D0;&#xC774; &#xC5B4;&#xB824;&#xC6C0;</li>
</ul>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC720;&#xB85C; Crankshaft&#xB294; <strong>&#xC720;&#xC9C0; &#xBCF4;&#xC218;&#xAC00; &#xC5B4;&#xB824;&#xC6B4; &#xAD6C;&#xC870;</strong>&#xAC00; &#xB418;&#xC5C8;&#xACE0;, V8 &#xD300;&#xC740; &#xC774;&#xB97C; &#xB300;&#xCCB4;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC124;&#xACC4;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; &#xACB0;&#xACFC;&#xB85C; &#xB4F1;&#xC7A5;&#xD55C; &#xAC83;&#xC774; &#xBC14;&#xB85C; <strong>TurboFan</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2012.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><strong>TurboFan&#xC758; &#xB4F1;&#xC7A5; (v5.9 &#xC774;&#xD6C4;)</strong></p>
<p>TurboFan&#xC740; Crankshaft&#xB97C; &#xB300;&#xCCB4;&#xD558;&#xB294; &#xACE0;&#xAE09; &#xCD5C;&#xC801;&#xD654; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB85C;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xCCA0;&#xD559;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xC804;&#xCCB4; JavaScript &#xC5B8;&#xC5B4; &#xC2A4;&#xD399;&#xC744; &#xC9C0;&#xC6D0;</li>
<li>&#xC911;&#xAC04; &#xD45C;&#xD604;(IR)&#xC744; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xACFC; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xCCB4;&#xACC4;&#xD654;</li>
<li>&#xB2E4;&#xC591;&#xD55C; &#xD50C;&#xB7AB;&#xD3FC;&#xACFC; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xB300;&#xD574; &#xD655;&#xC7A5;&#xC131;&#xACFC; &#xC774;&#xC2DD;&#xC131; &#xD655;&#xBCF4;</li>
</ul>
<p>TurboFan&#xC740; &#xAC15;&#xB825;&#xD55C; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD588;&#xC9C0;&#xB9CC;, &#xC5EC;&#xC804;&#xD788; &#xCD5C;&#xC801;&#xD654;&#xAE4C;&#xC9C0; &#xB3C4;&#xB2EC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC2DC;&#xAC04;&#xACFC; &#xBE44;&#xC6A9;&#xC774; &#xBB38;&#xC81C;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xC218;&#xB9CE;&#xC740; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; &#xC9E7;&#xAC8C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xACBD;&#xC6B0;, TurboFan&#xC740; &#xACFC;&#xD55C; &#xBB34;&#xAE30;&#xC600;&#xB358; &#xC148;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><strong>SparkPlug&#xC758; &#xB3C4;&#xC785; (2021)</strong></p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;, V8 &#xD300;&#xC740; <strong>&#xC911;&#xAC04; &#xB2E8;&#xACC4;&#xC758; &#xACBD;&#xB7C9; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC778; SparkPlug</strong>&#xB97C; &#xB3C4;&#xC785;&#xD569;&#xB2C8;&#xB2E4;. SparkPlug&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xBAA9;&#xD45C;&#xB85C; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD558;&#xC5EC;, &#xC774;&#xBBF8; &#xD574;&#xC11D;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xCEF4;&#xD30C;&#xC77C;</li>
<li>&#xD0C0;&#xC785; &#xBD84;&#xC11D;&#xC774;&#xB098; &#xBCF5;&#xC7A1;&#xD55C; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xC0DD;&#xB7B5;&#xD558;&#xACE0;, &#xBE60;&#xB978; &#xCF54;&#xB4DC; &#xC0DD;&#xC131;&#xC744; &#xC6B0;&#xC120;&#xC2DC;</li>
<li>TurboFan&#xBCF4;&#xB2E4; &#xBE60;&#xB974;&#xC9C0;&#xB9CC; &#xB35C; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xBA38;&#xC2E0; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;</li>
</ul>
<p>SparkPlug&#xB294; Ignition &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xBCF4;&#xB2E4; &#xBE60;&#xB974;&#xACE0;, TurboFan&#xBCF4;&#xB2E4; &#xAC00;&#xBCBC;&#xC6B4; &#xC2E4;&#xD589;&#xC744; &#xC81C;&#xACF5;&#xD568;&#xC73C;&#xB85C;&#xC368;, JavaScript &#xC2E4;&#xD589;&#xC758; &#xCD08;&#xAE30; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xD070; &#xD6A8;&#xC728;&#xC744; &#xAC00;&#xC838;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xD398;&#xC774;&#xC9C0; &#xB85C;&#xB529;&#xC774;&#xB098; &#xCD08;&#xAE30; &#xC0AC;&#xC6A9;&#xC790; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC5D0; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>Maglev&#xC758; &#xCD94;&#xAC00; (2022~)</strong></p>
<p>SparkPlug&#xC758; &#xC131;&#xB2A5;&#xC740; &#xB098;&#xC058;&#xC9C0; &#xC54A;&#xC558;&#xC9C0;&#xB9CC;, &#xC5EC;&#xC804;&#xD788; &#xC911;&#xAC04;&#xAE09; &#xC131;&#xB2A5;&#xACFC; &#xB0AE;&#xC740; &#xCD5C;&#xC801;&#xD654; &#xC218;&#xC900;&#xC5D0; &#xBA38;&#xBB34;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. V8 &#xD300;&#xC740; SparkPlug&#xC640; TurboFan &#xC0AC;&#xC774;&#xC5D0; &#xB354; &#xBE60;&#xB974;&#xBA74;&#xC11C;&#xB3C4; &#xB354; &#xB611;&#xB611;&#xD55C; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB97C; &#xC6D0;&#xD588;&#xACE0;, &#xADF8;&#xB807;&#xAC8C; &#xB4F1;&#xC7A5;&#xD55C; &#xAC83;&#xC774; &#xBC14;&#xB85C; Maglev&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Maglev&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAE30;&#xC220;&#xC801; &#xC774;&#xC720;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>SparkPlug&#xBCF4;&#xB2E4; &#xB354; aggressive&#xD55C; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xAE30;&#xBC18; &#xCF54;&#xB4DC; &#xC0DD;&#xC131;</li>
<li>&#xD0C0;&#xC785; &#xD53C;&#xB4DC;&#xBC31;&#xC744; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xBC18;&#xC601;&#xD558;&#xC5EC; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xCF54;&#xB4DC; &#xC0DD;&#xC131;</li>
<li>&#xCEF4;&#xD30C;&#xC77C; &#xC18D;&#xB3C4;&#xB294; SparkPlug&#xC640; &#xBE44;&#xC2B7;&#xD558;&#xC9C0;&#xB9CC;, &#xC2E4;&#xD589; &#xC131;&#xB2A5;&#xC740; TurboFan&#xC5D0; &#xADFC;&#xC811;</li>
</ul>
<p>Maglev&#xB294; &#xBAA8;&#xBC14;&#xC77C;&#xACFC; &#xAC19;&#xC774; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xC81C;&#xD55C;&#xB41C; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC131;&#xB2A5; &#xCD5C;&#xC801;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0; &#xD2B9;&#xD788; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, Tiering &#xAD6C;&#xC870;&#xC5D0;&#xC11C; Ignition &#x2192; Maglev &#x2192; TurboFan&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xACC4;&#xCE35;&#xC801; &#xC2E4;&#xD589; &#xBAA8;&#xB378;&#xC744; &#xAD6C;&#xCD95;&#xD558;&#xC5EC;, &#xCF54;&#xB4DC;&#xC758; &#x201C;&#xD56B;&#xD568;&#x201D;(hot code)&#xC5D0; &#xB530;&#xB77C; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xCD5C;&#xC801;&#xD654; &#xC218;&#xC900;&#xC744; &#xC870;&#xC808;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-3-V8-&#xC2E4;&#xD589;-&#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;-&#xAD6C;&#xC870;"><a href="#2-3-V8-&#xC2E4;&#xD589;-&#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;-&#xAD6C;&#xC870;" class="headerlink" title="2.3 V8 &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778; &#xAD6C;&#xC870;"></a>2.3 V8 &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778; &#xAD6C;&#xC870;</h3><p>&#xC704; &#xB0B4;&#xC6A9;&#xC744; &#xD1A0;&#xB300;&#xB85C; V8 &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778; &#xAD6C;&#xC870;&#xB97C; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2013.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC740; <strong>Ignition &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC18C;&#xC2A4;&#xB97C; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xACE0;, &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xB7F0;&#xD0C0;&#xC784; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;. Ignition&#xC740; &#xBE60;&#xB978; &#xC2DC;&#xC791;&#xACFC; &#xB0AE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xC18C;&#xBE44;&#xB97C; &#xBAA9;&#xD45C;&#xB85C; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xD06C;&#xB86C; v5.9&#xC5D0;&#xC11C; &#xAE30;&#xC874;&#xC758; Full-codegen&#xC744; &#xB300;&#xCCB4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB9CC;&#xC73C;&#xB85C;&#xB294; &#xACE0;&#xC131;&#xB2A5;&#xC744; &#xAE30;&#xB300;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC77C;&#xC815; &#xAE30;&#xC900;&#xC744; &#xB118;&#xB294; &#x201C;&#xD56B; &#xCF54;&#xB4DC;(hot code)&#x201D;&#xB294; &#xC774;&#xD6C4; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xB2E8;&#xACC4;&#xB85C; &#xC9C4;&#xC785;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB54C; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBC14;&#xB85C; <strong>SparkPlug</strong>&#xC785;&#xB2C8;&#xB2E4;. SparkPlug&#xB294; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xD574;&#xC11D;&#xD55C; &#xACB0;&#xACFC;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C;, &#xBCF5;&#xC7A1;&#xD55C; &#xD0C0;&#xC785; &#xBD84;&#xC11D;&#xC774;&#xB098; &#xCD5C;&#xC801;&#xD654; &#xC5C6;&#xC774; <strong>&#xBE60;&#xB974;&#xAC8C; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xCF54;&#xB4DC;&#xB85C; &#xCEF4;&#xD30C;&#xC77C;</strong>&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xB192;&#xC774;&#xACE0;, &#xB3D9;&#xC2DC;&#xC5D0; CPU &#xC790;&#xC6D0;&#xACFC; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xB3C4; &#xC808;&#xC57D;&#xD560; &#xC218; &#xC788;&#xB294; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xC911;&#xAC04; &#xB2E8;&#xACC4;&#xC785;&#xB2C8;&#xB2E4;. SparkPlug&#xB294; &#xD398;&#xC774;&#xC9C0; &#xB85C;&#xB529;&#xCC98;&#xB7FC; &#xBE60;&#xB978; &#xBC18;&#xC751;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC2DC;&#xC810;&#xC5D0;&#xC11C; <strong>&#xAC00;&#xBCCD;&#xACE0; &#xC989;&#xAC01;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xC131;&#xB2A5;&#xC744; &#xD655;&#xBCF4;&#xD558;&#xB294; &#xB370; &#xCD5C;&#xC801;&#xD654;</strong>&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xB54C;&#xB85C;&#xB294; &#xB354; &#xB192;&#xC740; &#xCD5C;&#xC801;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC774; V8&#xC758; &#xACE0;&#xC131;&#xB2A5; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC778; <strong>TurboFan</strong>&#xC785;&#xB2C8;&#xB2E4;. TurboFan&#xC740; Ignition&#xC774;&#xB098; SparkPlug &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC218;&#xC9D1;&#xB41C; <strong>&#xD0C0;&#xC785; &#xD53C;&#xB4DC;&#xBC31;, &#xD638;&#xCD9C; &#xD328;&#xD134;, &#xB8E8;&#xD504; &#xAD6C;&#xC870;</strong> &#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xD65C;&#xC6A9;&#xD574;, &#xACE0;&#xAE09; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD568;&#xC218; &#xC778;&#xB77C;&#xC774;&#xB2DD;, &#xB8E8;&#xD504; &#xC804;&#xAC1C;, &#xD0C0;&#xC785; &#xD2B9;&#xD654; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xC5EC;, <strong>&#xC815;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xC5B8;&#xC5B4; &#xBABB;&#xC9C0;&#xC54A;&#xC740; &#xC131;&#xB2A5;&#xC758; &#xBA38;&#xC2E0; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;</strong>&#xD569;&#xB2C8;&#xB2E4;. &#xD55C; &#xBC88; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xCF54;&#xB4DC;&#xB294; &#xCE90;&#xC2DC;&#xB418;&#xC5B4; &#xC774;&#xD6C4; &#xD638;&#xCD9C; &#xC2DC; &#xBE60;&#xB974;&#xAC8C; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C;, &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; TurboFan&#xC758; &#xD6A8;&#xACFC;&#xAC00; &#xB9E4;&#xC6B0; &#xD07D;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; TurboFan&#xC740; &#xC131;&#xB2A5;&#xC740; &#xB6F0;&#xC5B4;&#xB098;&#xC9C0;&#xB9CC; &#xCEF4;&#xD30C;&#xC77C; &#xBE44;&#xC6A9;&#xC774; &#xD06C;&#xACE0;, &#xCD5C;&#xC801;&#xD654;&#xAC00; &#xC2E4;&#xD328;(deopt)&#xD560; &#xACBD;&#xC6B0; &#xC624;&#xD788;&#xB824; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xBCF4;&#xC644;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB4F1;&#xC7A5;&#xD55C; &#xAC83;&#xC774; <strong>Maglev</strong>&#xC785;&#xB2C8;&#xB2E4;. Maglev&#xB294; <strong>SparkPlug&#xC640; TurboFan &#xC0AC;&#xC774;&#xC758; &#xC131;&#xB2A5;-&#xCEF4;&#xD30C;&#xC77C; &#xC2DC;&#xAC04; &#xADE0;&#xD615;&#xC744; &#xB9DE;&#xCD94;&#xAE30; &#xC704;&#xD574; &#xC124;&#xACC4;&#xB41C; &#xCD5C;&#xC2E0; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;</strong>&#xC785;&#xB2C8;&#xB2E4;. SparkPlug&#xBCF4;&#xB2E4; &#xB354; &#xC815;&#xAD50;&#xD558;&#xAC8C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xBA70;, &#xBD80;&#xBD84;&#xC801;&#xC778; &#xD0C0;&#xC785; &#xC815;&#xBCF4;&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD558;&#xC9C0;&#xB9CC;, TurboFan&#xB9CC;&#xD07C; &#xBB34;&#xAC81;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. 2022&#xB144;&#xBD80;&#xD130; &#xC810;&#xC9C4;&#xC801;&#xC73C;&#xB85C; &#xB3C4;&#xC785;&#xB41C; Maglev&#xB294; &#xD2B9;&#xD788; <strong>&#xBAA8;&#xBC14;&#xC77C;&#xACFC; &#xAC19;&#xC774; &#xC790;&#xC6D0;&#xC774; &#xC81C;&#xD55C;&#xB41C; &#xD658;&#xACBD;</strong>&#xC5D0;&#xC11C; &#xD0C1;&#xC6D4;&#xD55C; &#xC131;&#xB2A5;&#xC744; &#xBC1C;&#xD718;&#xD558;&#xBA70;, &#xB2E4;&#xC591;&#xD55C; &#xC2E4;&#xD589; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0; &#xC720;&#xC5F0;&#xD558;&#xAC8C; &#xB300;&#xC751;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xC911;&#xAC04; &#xACC4;&#xCE35;&#xC744; &#xD615;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2014.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, V8&#xC758; &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC740; &#xB2E8;&#xC77C;&#xD55C; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC544;&#xB2CC;, <strong>&#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978; &#xC804;&#xB7B5;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xC720;&#xC5F0;&#xD55C; &#xAD6C;&#xC870;</strong>&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xB54C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xBAA8;&#xB4E0; &#xBE44;&#xC6A9;&#xC744; &#xB4E4;&#xC774;&#xC9C0; &#xC54A;&#xACE0;, &#xD544;&#xC694;&#xD55C; &#xB9CC;&#xD07C;&#xB9CC; &#xD22C;&#xC790;&#xD558;&#xBA74;&#xC11C; &#xC810;&#xC810; &#xC131;&#xB2A5;&#xC744; &#xB04C;&#xC5B4;&#xC62C;&#xB9AC;&#xB294; &#xAD6C;&#xC870;&#xC8E0;. &#xC774; &#xACC4;&#xCE35;&#xD654;&#xB41C; &#xC2E4;&#xD589; &#xCCB4;&#xACC4; &#xB355;&#xBD84;&#xC5D0; V8&#xC740; <strong>&#xBE60;&#xB978; &#xC2DC;&#xC791;, &#xB0AE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xC18C;&#xBE44;, &#xB192;&#xC740; &#xC2E4;&#xD589; &#xC131;&#xB2A5;</strong>&#xC774;&#xB77C;&#xB294; &#xC138; &#xB9C8;&#xB9AC; &#xD1A0;&#xB07C;&#xB97C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC7A1;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<hr>
<p>&#xC774; &#xAD6C;&#xC870; &#xB355;&#xBD84;&#xC5D0; JavaScript&#xB294; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xC5B8;&#xC5B4;&#xC784;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xC218;&#xC900;&#xC5D0; &#xAC00;&#xAE4C;&#xC6B4; &#xC131;&#xB2A5;&#xC744; &#xB0BC; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xC131;&#xB2A5; &#xD29C;&#xB2DD; &#xC5C6;&#xC774;&#xB3C4; &#xC720;&#xC5F0;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image%2015.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xB807;&#xAC8C; &#xC815;&#xAD50;&#xD55C; &#xC2E4;&#xD589; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC740; &#xB3D9;&#xC2DC;&#xC5D0; <strong>&#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xAC00;&#xB2A5;&#xC131;</strong>&#xB3C4; &#xB0B4;&#xD3EC;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. V8&#xC758; &#xCD5C;&#xC801;&#xD654;&#xB294; &#xB300;&#xBD80;&#xBD84; &#x201C;&#xC774; &#xAC1D;&#xCCB4;&#xB294; &#xC55E;&#xC73C;&#xB85C;&#xB3C4; &#xAC19;&#xC740; &#xAD6C;&#xC870;&#xC77C; &#xAC83;&#xC774;&#xB2E4;&#x201D;, &#x201C;&#xC774; &#xD568;&#xC218;&#xB294; &#xD56D;&#xC0C1; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB420; &#xAC83;&#xC774;&#xB2E4;&#x201D;&#xC640; &#xAC19;&#xC740; &#xAC00;&#xC815;&#xC5D0; &#xAE30;&#xBC18;&#xD558;&#xC5EC; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7EC;&#xD55C; &#xAC00;&#xC815;&#xC774; &#xAE68;&#xC9C0;&#xB294; &#xC21C;&#xAC04;, V8&#xC740; &#xC798;&#xBABB;&#xB41C; &#xC804;&#xC81C; &#xC704;&#xC5D0;&#xC11C; <strong>&#xBA54;&#xBAA8;&#xB9AC; &#xC811;&#xADFC;&#xC774;&#xB098; &#xAC1D;&#xCCB4; &#xD574;&#xC11D;&#xC744; &#xC218;&#xD589;</strong>&#xD558;&#xAC8C; &#xB418;&#xACE0;, &#xBC14;&#xB85C; &#xC774; &#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xB300;&#xD45C;&#xC801;&#xC778; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC778; <strong>Type Confusion</strong>&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <strong>Type Confusion</strong>&#xC740; &#xB9D0; &#xADF8;&#xB300;&#xB85C;, &#xAC1D;&#xCCB4;&#xB098; &#xAC12;&#xC758; &#xD0C0;&#xC785;&#xC5D0; &#xB300;&#xD574; &#xC5D4;&#xC9C4;&#xC774; &#xC798;&#xBABB;&#xB41C; &#xCD94;&#xB860;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC70;&#xB098;, &#xAE30;&#xC874; &#xAC00;&#xC815;&#xACFC; &#xB2E4;&#xB978; &#xD0C0;&#xC785;&#xC73C;&#xB85C; &#xC804;&#xD658;&#xB418;&#xC5C8;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC778;&#xC2DD;&#xD558;&#xC9C0; &#xBABB;&#xD55C; &#xCC44; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC0C1;&#xD669;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xB2E8;&#xC21C;&#xD55C; &#xC815;&#xC218; &#xBC30;&#xC5F4;&#xB85C; &#xCDE8;&#xAE09;&#xB418;&#xB358; &#xAC1D;&#xCCB4;&#xAC00; &#xB7F0;&#xD0C0;&#xC784; &#xB3C4;&#xC911; &#xBCF5;&#xC7A1;&#xD55C; &#xAC1D;&#xCCB4; &#xBC30;&#xC5F4;&#xB85C; &#xBC14;&#xB00C;&#xC5C8;&#xC74C;&#xC5D0;&#xB3C4;, V8&#xC774; &#xC5EC;&#xC804;&#xD788; &#xC774;&#xB97C; &#xC815;&#xC218; &#xBC30;&#xC5F4;&#xB85C; &#xAC04;&#xC8FC;&#xD558;&#xACE0; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;&#xBA74;, &#xC774;&#xB294; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xCC38;&#xC870;&#xB098; &#xB0B4;&#xBD80; &#xAD6C;&#xC870; &#xC190;&#xC0C1;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC0C1;&#xD669;&#xC740; &#xD2B9;&#xD788; TurboFan&#xC774;&#xB098; Maglev&#xC640; &#xAC19;&#xC740; &#xACE0;&#xAE09; JIT &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC218;&#xD589;&#xD558;&#xB294; &#xD0C0;&#xC785; &#xD2B9;&#xD654;(type specialization), &#xC778;&#xB77C;&#xC774;&#xB2DD;(inlining), &#xAC1D;&#xCCB4; &#xAD6C;&#xC870; &#xACE0;&#xC815;(hidden class assumption) &#xB4F1;&#xC758; &#xCD5C;&#xC801;&#xD654; &#xC911;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC131;&#xB2A5;&#xC744; &#xADF9;&#xB300;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD0C0;&#xC785;&#xC774;&#xB098; &#xAD6C;&#xC870;&#xB97C; &#xACE0;&#xC815;&#xD55C; &#xCC44; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAC8C; &#xB418;&#xBA74;, &#xADF8; &#xC774;&#xD6C4;&#xC758; &#xC608;&#xC678;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC774;&#xB098; &#xAD6C;&#xC870; &#xBCC0;&#xD654;&#xB294; &#xACE0;&#xB824;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xCDE8;&#xC57D;&#xD55C; &#xC9C0;&#xC810;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC77C;&#xBD80; &#xD568;&#xC218;&#xB97C; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC5D4;&#xC9C4;&#xC774; &#xD574;&#xB2F9; &#xD328;&#xD134;&#xC744; &#x201C;&#xC548;&#xC804;&#xD558;&#xB2E4;&#x201D;&#xACE0; &#xD310;&#xB2E8;&#xD558;&#xAC8C; &#xB9CC;&#xB4E0; &#xB4A4;, <strong>&#xD2B9;&#xC815; &#xC2DC;&#xC810;&#xC5D0; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xD0C0;&#xC785;&#xC774;&#xB098; &#xAD6C;&#xC870;&#xB97C; &#xBCC0;&#xC870;</strong>&#xD558;&#xC5EC;, <strong>V8&#xC774; &#xC0DD;&#xC131;&#xD55C; Native Code&#xC758; &#xC798;&#xBABB;&#xB41C; &#xB3D9;&#xC791;</strong>&#xC744; &#xC720;&#xB3C4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xB2E4;&#xC218;&#xC758; Chrome &#xCDE8;&#xC57D;&#xC810;&#xC5D0;&#xC11C; &#xC545;&#xC6A9;&#xB41C; &#xBC29;&#xC2DD;&#xC774;&#xBA70;, &#xCD5C;&#xADFC;&#xAE4C;&#xC9C0;&#xB3C4; V8 &#xAE30;&#xBC18; Type Confusion &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xACE0;&#xC704;&#xD5D8;&#xAD70;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xACF5;&#xACA9; &#xBCA1;&#xD130;&#xB85C; &#xBD84;&#xB958;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774;&#xC81C; V8 &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xCF54;&#xB4DC;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0; &#xAE30;&#xBCF8; &#xAD6C;&#xC870;&#xB97C; &#xC774;&#xD574;&#xD588;&#xC73C;&#xB2C8;, &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C;&#xB294; &#xC774; &#xC5D4;&#xC9C4; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xAC1D;&#xCCB4;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xD45C;&#xD604;&#xB418;&#xACE0;, &#xCD5C;&#xC801;&#xD654;&#xB418;&#xBA70;, &#xB098;&#xC544;&#xAC00; &#xC774; &#xAD6C;&#xC870;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; <strong>Type Confusion</strong>&#xACFC; &#xAC19;&#xC740; &#xBCF4;&#xC548; &#xC774;&#xC288;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xB97C; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xD55C;&#xD638;&#xD761; &#xB04A;&#xACE0; &#xAC00;&#xB294;&#xAC8C; &#xC88B;&#xACA0;&#xC8E0;? &#x314E;.&#x314E; &#xADF8;&#xB7FC; &#xB2E4;&#xC74C;&#xD3B8;&#xC744; &#xC608;&#xACE0;&#xD558;&#xBA70; &#xC800;&#xB294; Part 2&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Part 2 &#xC608;&#xACE0;)</li>
</ul>
<p><img src="image%2016.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p>v <strong>Conference Video</strong></p>
<ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=RL2po1swXO4">https://www.youtube.com/watch?v=RL2po1swXO4</a></li>
</ul>
<p>v <strong>V8 Engine</strong></p>
<ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://v8.dev/">https://v8.dev/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/V8_(JavaScript_engine">https://en.wikipedia.org/wiki/V8_(JavaScript_engine</a>)</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://evan-moon.github.io/2019/06/28/v8-analysis/">https://evan-moon.github.io/2019/06/28/v8-analysis/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d">https://blog.bitsrc.io/secret-behind-javascript-performance-v8-hidden-classes-ba4d0ebfb89d</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84">https://medium.com/@yanguly/sparkplug-v8-baseline-javascript-compiler-758a7bc96e84</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551">https://pks2974.medium.com/v8-%EC%97%90%EC%84%9C-javascript-%EC%BD%94%EB%93%9C%EB%A5%BC-%EC%8B%A4%ED%96%89%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95-%EC%A0%95%EB%A6%AC%ED%95%B4%EB%B3%B4%EA%B8%B0-25837f61f551</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/OUYA77/">OUYA77</a>
                  
                  <a class="hover-with-bg" href="/tags/Chrome/">Chrome</a>
                  
                  <a class="hover-with-bg" href="/tags/Type-Confusion/">Type Confusion</a>
                  
                  <a class="hover-with-bg" href="/tags/Type-Confusion-101/">Type Confusion 101</a>
                  
                  <a class="hover-with-bg" href="/tags/Chromium/">Chromium</a>
                  
                  <a class="hover-with-bg" href="/tags/Chrome-internal/">Chrome internal</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_OUYA77.jpg" srcset="/img/loading.gif" alt="OUYA77">
                  </div>

                  <div class="link-text">
                    <div class="link-title">OUYA77</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/OUYA77">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/07/01/OUYA77/Chrome_part1/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Starting Chrome Exploitation with Type Confusion 101 ^-^ Part 1.(EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/06/28/bekim/2025-06-28/">
                    <span class="hidden-mobile">[] CVE202532433: Erlang/OTP SSH Pre-auth RCE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/07/01/OUYA77/Chrome_part1/kr/';
        this.page.identifier = '/2025/07/01/OUYA77/Chrome_part1/kr/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Type Confusion 101  Chrome Exploit ^-^Part 1.(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
