

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB984;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; 6&amp;#xC6D4;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;.&lt;br&gt;&amp;#xD587;&amp;#xC0B4; &amp;#xAC00;&amp;#xB4DD;&amp;#xD55C; &amp;#xB0A0;&amp;#xC528;&amp;#x2600;&amp;#xFE0F;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD589;&amp;#xC6B4;&amp;#x1F340;&amp;#xC774; &amp;#xAC00;&amp;#xB4DD;&amp;#xAC00;&amp;#xB4DD;&amp;#xD55C; &amp;#xD55C; &amp;#xB2EC;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC5B4;&amp;#xC694;!&lt;br&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;&amp;#xB3C4; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xB4DD;&amp;#xAC00;&amp;#xB4DD; &amp;#xB2F4;&amp;#xC544; &amp;#xC654;&amp;#xC5B4;&amp;#xC694; &amp;#x1F44B;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#x7F8E; &amp;#xBD88;&amp;#xBC95;&amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#x201C;&amp;#x5317;, &amp;#xC7AC;&amp;#xC791;&amp;#xB144; &amp;#xC57D;1&amp;#xC870;&amp;#xC6D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xCDE8;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.30 | &amp;#xC5F0;&amp;#xD569;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.yna.co.kr/view/AKR20240530008000071?input=1195m&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;br&gt;&lt;a href=&#34;https://home.treasury.gov/news/press-releases/jy2382&#34;&gt;&amp;#xCD9C;&amp;#xCC98;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC7AC;&amp;#xBB34;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;2024 &amp;#xB300;&amp;#xCCB4;&amp;#xBD88;&amp;#xAC00;&amp;#xD1A0;&amp;#xD070;(&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;NFT&lt;/a&gt;) &amp;#xAD00;&amp;#xB828; &amp;#xBD88;&amp;#xBC95; &amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xD3C9;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#x2019;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBD81;&amp;#xD55C;&amp;#xC740; 2022&amp;#xB144;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xB3C4;&amp;#xB85C; &lt;strong&gt;7&amp;#xC5B5; 2&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;(9,860&amp;#xC5B5; &amp;#xC6D0;) &amp;#xC774;&amp;#xC0C1;&lt;/strong&gt;&amp;#xC744; &amp;#xBAA8;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;&amp;#xC774;&amp;#xB294; &amp;#xBD81;&amp;#xD55C;&amp;#xC774; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCDA9;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xC785;&amp;#xC758; &amp;#xD070; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&amp;#xB610;&amp;#xD55C;, &amp;#xC7AC;&amp;#xBB34;&amp;#xBD80;&amp;#xB294; &amp;#x201C;&amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xBBF8;&amp;#xAD6D; &amp;#xBC0F; &amp;#xC720;&amp;#xC5D4; &amp;#xC81C;&amp;#xC7AC;&amp;#xC758; &amp;#xC555;&amp;#xBC15; &amp;#xC544;&amp;#xB798;, &amp;#xBD81;&amp;#xD55C;&amp;#xC740; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xC0AC;&amp;#xC5C5;&amp;#xC790;(VASP) &amp;#xBC0F; &amp;#xB2E4;&amp;#xB978; &amp;#xAE08;&amp;#xC735; &amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC744; &amp;#xC0C1;&amp;#xB300;&amp;#xB85C; &amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC808;&amp;#xB3C4; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xBD88;&amp;#xBC95; &amp;#xD65C;&amp;#xB3D9;&amp;#xC5D0; &amp;#xC758;&amp;#xC9C0;&amp;#xD574; &amp;#xBD88;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xB7C9;&amp;#xC0B4;&amp;#xC0C1;&amp;#xBB34;&amp;#xAE30;(WMD)&amp;#xC640; &amp;#xD0C4;&amp;#xB3C4;&amp;#xBBF8;&amp;#xC0AC;&amp;#xC77C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC4F8; &amp;#xC7AC;&amp;#xC6D0;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xC9C0;&amp;#xC801;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F4B0;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xBC14;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xD589;&amp;#xC704;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;&amp;#xC57D; 500&amp;#xAC1C;&amp;#xC758; &amp;#x2018;&amp;#xBBF8;&amp;#xB07C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#x2019;&amp;#x1F3A3;&lt;/strong&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xB3C4;&amp;#xB97C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xBCF4;&amp;#xC720;&amp;#xC790;&amp;#xB4E4;&amp;#xC774;  &lt;strong&gt;&amp;#xC545;&amp;#xC131; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC29;&amp;#xBB38;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; &amp;#x1FAAA;&amp;#xB4F1;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&lt;/strong&gt;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xC5D0;&amp;#xB294; &amp;#x201C;&amp;#xBD81;&amp;#xD55C;&amp;#xC740; &amp;#xC804;&amp;#xBB38; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBA38;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xB7C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC591;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4; &amp;#xC138;&amp;#xACC4; &amp;#xAC01;&amp;#xC9C0;&amp;#xB85C; &amp;#xD30C;&amp;#xACAC;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xC800;&amp;#xC9C0;&amp;#xB974;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C5;&amp;#xB824;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87; &amp;#xB144; &amp;#xAC04; &amp;#xC218;&amp;#xC775; &amp;#xCC3D;&amp;#xCD9C;&amp;#xACFC; &amp;#xB3C8;&amp;#xC138;&amp;#xD0C1;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xADDC;&amp;#xC81C; &amp;#xC0AC;&amp;#xAC01;&amp;#xC9C0;&amp;#xB300;&amp;#xC5D0; &amp;#xB193;&amp;#xC778; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xC2DC;&amp;#xC7A5;&amp;#xC744; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB178;&amp;#xB824;&amp;#xC654;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC218;&amp;#xC900;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F4C8;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;2024 &amp;#xB300;&amp;#xCCB4;&amp;#xBD88;&amp;#xAC00;&amp;#xD1A0;&amp;#xD070;(NFT) &amp;#xAD00;&amp;#xB828; &amp;#xBD88;&amp;#xBC95; &amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xD3C9;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#x2019;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://home.treasury.gov/news/press-releases/jy2382&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;, &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xCD5C;&amp;#xCD08; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xD55C;&amp;#xB2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xC804;&amp;#xC790;&amp;#xC2E0;&amp;#xBB38; | &lt;a href=&#34;https://m.etnews.com/20240528000233&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xAC00; &amp;#xB0B4;&amp;#xB144;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &lt;strong&gt;&amp;#xCD5C;!&amp;#xCD08;!&amp;#xB85C;!&amp;#x1F60E;&lt;/strong&gt; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC804;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC778;, &amp;#xD559;&amp;#xC0DD; &amp;#xB4F1;&amp;#xC774; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &lt;strong&gt;&amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xB9CC;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xC774;&amp;#xBC88;&amp;#xC774; &amp;#xCC98;&amp;#xC74C;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC544;&amp;#xAC00; 2026&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC678;&amp;#xB85C; &amp;#xB300;&amp;#xC0C1;&amp;#xC744; &amp;#xB113;&amp;#xD600; &amp;#xC804;&amp;#xAD6D; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC5D0; &amp;#xD574;&amp;#xC678;&amp;#xB3C4;&amp;#xC2DC; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &lt;strong&gt;&amp;#xAD6D;&amp;#xC81C;&amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xB97C; &amp;#xCD94;&amp;#xC9C4;&lt;/strong&gt;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB098; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; &amp;#xBBFC;&amp;#xAC04;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xC804;&amp;#xBB38;&amp;#xC131;&amp;#xC744; &amp;#xC313;&amp;#xC744; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC801;&amp;#xC5B4; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC8FC;&amp;#xB85C; &amp;#xC678;&amp;#xBD80; &amp;#xC6A9;&amp;#xC5ED;&amp;#xC774;&amp;#xB098; &amp;#xC5C5;&amp;#xCCB4; &amp;#xC758;&amp;#xC874;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC758; &amp;#xC5C5;&amp;#xBB34; &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC7AC; &amp;#xB2A5;&amp;#xB825;&amp;#xC744; &amp;#xD5A5;&amp;#xC0C1;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xBA64;&amp;#xBC84;&amp;#xB85C;&amp;#xC11C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xB2E4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBC94;&amp;#xC6A9; &amp;#xB300;&amp;#xD68C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC790;&amp;#xCCB4; &amp;#xD589;&amp;#xC0AC;&amp;#xB97C; &amp;#xAE30;&amp;#xD68D;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&amp;#x1F60A;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;strong&gt;&amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xC2DC;&amp;#xD2F0; &amp;#xC778;&amp;#xD504;&amp;#xB77C; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&lt;/strong&gt;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904; &amp;#xB2E4;&amp;#xB978; &amp;#xB300;&amp;#xD68C;&amp;#xC640; &amp;#xCC28;&amp;#xBCC4;&amp;#xC131;&amp;#xC744; &amp;#xB454;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xB610;&amp;#xD55C;, &amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xD65C;&amp;#xB3D9;, &amp;#xBCF4;&amp;#xC548;&amp;#xAD00;&amp;#xC81C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC6B4;&amp;#xC601; &amp;#xAD00;&amp;#xB9AC; &amp;#xB4F1; &amp;#xC804;&amp;#xBC18;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC804;&amp;#xB9DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC810;&amp;#xC810; &amp;#xAD50;&amp;#xBB18;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#x5317;&amp;#xD574;&amp;#xD0B9;&amp;#xAE30;&amp;#xC220;&amp;#x2026;&amp;#x201D;MS &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xC774;&amp;#xB370;&amp;#xC77C;&amp;#xB9AC; | &lt;a href=&#34;https://m.edaily.co.kr/news/read?newsId=03047126638893512&amp;amp;mediaCodeNo=257&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD81;&amp;#xD55C;&amp;#xC758; Kimsuky APT &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC804;&amp;#xB7B5;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574; &amp;#xC774;&amp;#xC288;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F6A8;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC778;&amp;#xB4E4;&amp;#xC774; &amp;#xC798; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xAD00;&amp;#xB9AC; &amp;#xCF58;&amp;#xC194;(MSC)&lt;/a&gt; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;.&lt;br&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;1&amp;#xCC28; &amp;#xBC29;&amp;#xC5B4;&amp;#xC120;&amp;#xC778; &amp;#xBC31;&amp;#xC2E0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB97C; &amp;#xD53C;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC774;&amp;#xBC88; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B8;&amp;#xC2A4; &amp;#xC2DC;&amp;#xD050;&amp;#xB9AC;&amp;#xD2F0;&amp;#xB300;&amp;#xC751;&amp;#xC13C;&amp;#xD130;(GSC)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xBD81;&amp;#xD55C; &amp;#xD574;&amp;#xD0B9;&amp;#xC870;&amp;#xC9C1; &amp;#x2018;&amp;#xAE40;&amp;#xC218;&amp;#xD0A4;(Kimsuky)&amp;#x2019;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC758; &amp;#xBD81;&amp;#xD55C;&amp;#xC778;&amp;#xAD8C;&amp;#xAD6D;&amp;#xC81C;&amp;#xD611;&amp;#xB825;&amp;#xB300;&amp;#xC0AC;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD55C; &lt;strong&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; MS &amp;#xAD00;&amp;#xB9AC;&amp;#xCF58;&amp;#xC194; &amp;#xBB38;&amp;#xC11C;&amp;#xB85C; &amp;#xAD6D;&amp;#xB0B4; &amp;#xB300;&amp;#xBD81;&amp;#xB7;&amp;#xC548;&amp;#xBCF4; &amp;#xC885;&amp;#xC0AC;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xD0B9;&amp;#xD55C; &amp;#xAC83;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xB0B4; &amp;#xD2B9;&amp;#xC815; &amp;#xACF5;&amp;#xC9C1;&amp;#xC790; &amp;#xD504;&amp;#xB85C;&amp;#xD544;&amp;#xCC98;&amp;#xB7FC; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC00;&amp;#xC9DC; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD574; &amp;#xBE44;&amp;#xACF5;&amp;#xAC1C; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD574; &amp;#xC8FC;&amp;#xB294; &amp;#xCC99;&amp;#xD558;&amp;#xBA70; URL &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;(OneDrive) &amp;#xB9C1;&amp;#xD06C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &amp;#xD30C;&amp;#xC77C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD654;&amp;#xBA74;&amp;#xC774; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#x2018;My_Essay(prof).msc&amp;#x2019;&amp;#xC73C;&amp;#xB85C;, &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB294; [.msc] &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#x2018;Microsoft Management Console&amp;#x2019; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#x2018;Microsoft Common Console &amp;#xBB38;&amp;#xC11C;&amp;#x2019; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC83;&amp;#xC740; &lt;strong&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD1A0;&amp;#xD0C8; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB2F9;&amp;#xC2DC; &amp;#xB2E4;&amp;#xAD6D;&amp;#xC801; 60&amp;#xAC1C; Anti-Malware &amp;#xC2A4;&amp;#xCE90;&amp;#xB108; &amp;#xC804;&amp;#xBD80; &amp;#xC704;&amp;#xD611; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xC810;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://www.genians.co.kr/blog/threat_intelligence/facebook&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!!&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC911;&amp;#xAD6D; &amp;#xD574;&amp;#xCEE4; &amp;#xB2C8;&amp;#xC60C;, &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xB7;&amp;#xC81C;&amp;#xC8FC;&amp;#xB300; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4; &amp;#xD574;&amp;#xD0B9; &amp;#xC8FC;&amp;#xC7A5;&amp;#x2026; &amp;#xB610; &amp;#xC2DC;&amp;#xC791;&amp;#xB410;&amp;#xB098;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.27 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130077&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC62C;&amp;#xD574; &amp;#xCD08; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4; &amp;#xACF5;&amp;#xACA9;&amp;#xD55C; &amp;#xC911;&amp;#xAD6D; &amp;#xD574;&amp;#xCEE4; &amp;#xB2C8;&amp;#xC60C;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?  &lt;a href=&#34;https://news.nate.com/view/20240207n40464&#34;&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; 100&amp;#xC5EC;&amp;#xAC1C;&amp;#xC758; &amp;#xAD6D;&amp;#xB0B4; &amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xAD50;&amp;#xC721; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xD588;&amp;#xC8E0;.&amp;#x1F621;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xB2C8;&amp;#xC60C;&amp;#xC740; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50;&amp;#xC640; &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xC778; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC640; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2C8;&amp;#xC60C;&amp;#xC740; &amp;#xD574;&amp;#xD0B9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD55C; &amp;#xADFC;&amp;#xAC70;&amp;#xB85C; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xB85C; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xD559;&amp;#xAD50;&amp;#xC758; &amp;#xBC1B;&amp;#xC740; &amp;#xBA54;&amp;#xC77C;&amp;#xD568; &amp;#xB0B4;&amp;#xBD80; &amp;#xD654;&amp;#xBA74;&amp;#xACFC; &amp;#xBA54;&amp;#xC77C; &amp;#xC4F0;&amp;#xAE30; &amp;#xD654;&amp;#xBA74;&amp;#xACFC; &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xBA54;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD654;&amp;#xBA74;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xBCF4;&amp;#xC548;&amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB4E4;&amp;#xC740; &amp;#xC8FC; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xC600;&amp;#xB358; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC6F9;&amp;#xC258;&lt;/a&gt; &amp;#xB4F1; &amp;#xC6F9;&amp;#xC11C;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB300;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xACC4;&amp;#xC815; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC6F9;&amp;#xBA54;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC778;&amp;#xC99D;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xD53C;&amp;#xC2F1;, &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1; &amp;#xD559;&amp;#xAD50; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xACBD;&amp;#xACE0;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F6A8;&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC2A4;&amp;#xCEA0;&amp;#x2026; &amp;#x201C;&amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C; &amp;#xC548; &amp;#xAE54;&amp;#xC544;&amp;#xB3C4; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0; DM &amp;#xC720;&amp;#xC758;&amp;#xD574;&amp;#xC57C;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.24 | &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | &lt;a href=&#34;https://biz.chosun.com/it-science/ict/2024/05/24/3BEYQ5MNVVFXDN3AEKPHZGQRUE/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC2A4;&amp;#xCEA0;(&amp;#xC0AC;&amp;#xAE30;)&amp;#xC774; &amp;#xB2E4;&amp;#xC591;&amp;#xD574;&amp;#xC9C0;&amp;#xACE0; &amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C;, &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8; &amp;#xB4F1; &amp;#xC18C;&amp;#xC15C;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4;(SNS)&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xAC00; &amp;#xB298;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC758;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC2A4;&amp;#xCEA0; &amp;#xC218;&amp;#xBC95;&amp;#xC774; &amp;#xC810;&amp;#xC810; &amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;, &amp;#xD2B9;&amp;#xD788; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&amp;#xACE0;&amp;#xC218;&amp;#xC775; &amp;#xBD80;&amp;#xC5C5;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC720;&amp;#xC778;&amp;#xD574; &amp;#xBD88;&amp;#xBC95; &amp;#xCE74;&amp;#xC9C0;&amp;#xB178; &amp;#xBCA0;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC694;. &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xB294; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xACBD;&amp;#xC81C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5EC;&amp;#xC720;&amp;#xB85C;&amp;#xC6B4; &amp;#xC0DD;&amp;#xD65C;&amp;#xACFC; &amp;#xAC12;&amp;#xBE44;&amp;#xC2FC; &amp;#xBB3C;&amp;#xAC74; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBB34;&amp;#xB2E8;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD574; &amp;#xAD11;&amp;#xACE0;&amp;#xD558;&amp;#xACE0;, &amp;#xC8FC;&amp;#xB85C; &amp;#xC804;&amp;#xC5C5;&amp;#xC8FC;&amp;#xBD80;&amp;#xB098; &amp;#xC5EC;&amp;#xC131;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xC694;. &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBA3C;&amp;#xC800; &amp;#xC5F0;&amp;#xB77D;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;, &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xC218;&amp;#xC775;&amp;#xAE08;&amp;#xC744; &amp;#xC9C0;&amp;#xAE09;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD22C;&amp;#xC790;&amp;#xAE08;&amp;#xC774; &amp;#xCEE4;&amp;#xC9C0;&amp;#xBA74; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xAE08;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xBA70; &amp;#xB3C8;&amp;#xC744; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC694;.&amp;#x1F911;&lt;/p&gt;
&lt;p&gt;&amp;#xBAB8;&amp;#xCEA0; &amp;#xD53C;&amp;#xC2F1;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;. &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB97C; &amp;#xD611;&amp;#xBC15;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;strong&gt;&amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC9C0;&amp;#xC778; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD55C; &amp;#xD6C4;, &amp;#xC131;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xD654;&amp;#xB098; &amp;#xC601;&amp;#xC0C1; &amp;#xD1B5;&amp;#xD654;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC720;&amp;#xCD9C;&amp;#xD558;&amp;#xACA0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD611;&amp;#xBC15;&amp;#xD574;&amp;#xC694;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB7A9; &amp;#xC2DC;&amp;#xD050;&amp;#xB9AC;&amp;#xD2F0; &amp;#xC778;&amp;#xD154;&amp;#xB9AC;&amp;#xC804;&amp;#xC2A4; &amp;#xC13C;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://asec.ahnlab.com/ko/63616/&#34;&gt;&amp;#xAD00;&amp;#xB828; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&lt;/a&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xAD00;&amp;#xB9AC; &amp;#xCF58;&amp;#xC194;(MSC)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;(OS)&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB85C;, &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B4;&amp;#xC601;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBAA8;&amp;#xC544; &amp;#xB193;&amp;#xC740; &amp;#xD654;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;NFT&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xAD8C;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xC5EC; &amp;#xC720;&amp;#xC77C;&amp;#xC131;&amp;#xACFC; &amp;#xD76C;&amp;#xC18C;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC6F9;&amp;#xC258;&lt;/strong&gt;(Web Shell)&lt;/p&gt;
&lt;p&gt;&amp;#xC6F9; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xACE0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB300;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB098; &amp;#xC554;&amp;#xD638;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xD574;&amp;#xD0B9; &amp;#xAE30;&amp;#xBC95;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://news.zum.com/articles/90884865&#34;&gt;&amp;#x201C;&amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC5C5; &amp;#xB354; &amp;#xC798;&amp;#xD558;&amp;#xC790;&amp;#x201D; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; &amp;#xBCF4;&amp;#xC548;&amp;#xAE30;&amp;#xC5C5; &amp;#xC778;&amp;#xC218;&amp;#xD569;&amp;#xBCD1; &amp;#xD589;&amp;#xB82C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130083&amp;amp;direct=mobile&#34;&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xBC31;&amp;#xC2E0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;, &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD615; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD3EC;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130074&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xC911;&amp;#xAD6D; &amp;#xBC30;&amp;#xD6C4; &amp;#xD574;&amp;#xCEE4;&amp;#xC870;&amp;#xC9C1;, &amp;#xACF5;&amp;#xACA9; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB7;&amp;#xCD94;&amp;#xC801; &amp;#xD53C;&amp;#xD558;&amp;#xB294; ORB &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.dt.co.kr/contents.html?article_no=2024052802109931065006&amp;amp;ref=naver&#34;&gt;&amp;#x65E5; 20&amp;#xB300; &amp;#xB0A8;&amp;#xC131;, AI &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#x2026;&amp;#x201D;&amp;#xB3C8; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;5&amp;#xC6D4;-&amp;#xBCF4;&amp;#xC548;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#5&amp;#xC6D4;-&amp;#xBCF4;&amp;#xC548;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xC6D4; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;5&amp;#xC6D4; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.pisfair.org/2024/index.html&#34;&gt;&lt;strong&gt;&amp;#xC81C;13&amp;#xD68C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD398;&amp;#xC5B4; &amp;amp; CPO&amp;#xC6CC;&amp;#xD06C;&amp;#xC20D;&lt;/strong&gt;&lt;/a&gt; | &lt;strong&gt;6&amp;#xC6D4; 4&amp;#xC77C;(&amp;#xD654;) ~ 5&amp;#xC77C;(&amp;#xC218;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] ì ì  ì»¤ì§€ëŠ” åŒ— í•´í‚¹ê¸°ìˆ ðŸ¤¦â€ - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB984;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; 6&amp;#xC6D4;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;.&lt;br&gt;&amp;#xD587;&amp;#xC0B4; &amp;#xAC00;&amp;#xB4DD;&amp;#xD55C; &amp;#xB0A0;&amp;#xC528;&amp;#x2600;&amp;#xFE0F;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD589;&amp;#xC6B4;&amp;#x1F340;&amp;#xC774; &amp;#xAC00;&amp;#xB4DD;&amp;#xAC00;&amp;#xB4DD;&amp;#xD55C; &amp;#xD55C; &amp;#xB2EC;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC5B4;&amp;#xC694;!&lt;br&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;&amp;#xB3C4; &amp;#xC18C;&amp;#xC2DD;&amp;#xC744; &amp;#xAC00;&amp;#xB4DD;&amp;#xAC00;&amp;#xB4DD; &amp;#xB2F4;&amp;#xC544; &amp;#xC654;&amp;#xC5B4;&amp;#xC694; &amp;#x1F44B;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#x7F8E; &amp;#xBD88;&amp;#xBC95;&amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#x201C;&amp;#x5317;, &amp;#xC7AC;&amp;#xC791;&amp;#xB144; &amp;#xC57D;1&amp;#xC870;&amp;#xC6D0; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xCDE8;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.30 | &amp;#xC5F0;&amp;#xD569;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.yna.co.kr/view/AKR20240530008000071?input=1195m&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;br&gt;&lt;a href=&#34;https://home.treasury.gov/news/press-releases/jy2382&#34;&gt;&amp;#xCD9C;&amp;#xCC98;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC7AC;&amp;#xBB34;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;2024 &amp;#xB300;&amp;#xCCB4;&amp;#xBD88;&amp;#xAC00;&amp;#xD1A0;&amp;#xD070;(&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;NFT&lt;/a&gt;) &amp;#xAD00;&amp;#xB828; &amp;#xBD88;&amp;#xBC95; &amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xD3C9;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#x2019;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBD81;&amp;#xD55C;&amp;#xC740; 2022&amp;#xB144;&amp;#xC5D0; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC640; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xB3C4;&amp;#xB85C; &lt;strong&gt;7&amp;#xC5B5; 2&amp;#xCC9C;&amp;#xB9CC; &amp;#xB2EC;&amp;#xB7EC;(9,860&amp;#xC5B5; &amp;#xC6D0;) &amp;#xC774;&amp;#xC0C1;&lt;/strong&gt;&amp;#xC744; &amp;#xBAA8;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;&amp;#xC774;&amp;#xB294; &amp;#xBD81;&amp;#xD55C;&amp;#xC774; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCDA9;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC218;&amp;#xC785;&amp;#xC758; &amp;#xD070; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC28;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&amp;#xB610;&amp;#xD55C;, &amp;#xC7AC;&amp;#xBB34;&amp;#xBD80;&amp;#xB294; &amp;#x201C;&amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xBBF8;&amp;#xAD6D; &amp;#xBC0F; &amp;#xC720;&amp;#xC5D4; &amp;#xC81C;&amp;#xC7AC;&amp;#xC758; &amp;#xC555;&amp;#xBC15; &amp;#xC544;&amp;#xB798;, &amp;#xBD81;&amp;#xD55C;&amp;#xC740; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xC0AC;&amp;#xC5C5;&amp;#xC790;(VASP) &amp;#xBC0F; &amp;#xB2E4;&amp;#xB978; &amp;#xAE08;&amp;#xC735; &amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC744; &amp;#xC0C1;&amp;#xB300;&amp;#xB85C; &amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xC808;&amp;#xB3C4; &amp;#xD589;&amp;#xC704;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xBD88;&amp;#xBC95; &amp;#xD65C;&amp;#xB3D9;&amp;#xC5D0; &amp;#xC758;&amp;#xC9C0;&amp;#xD574; &amp;#xBD88;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xB7C9;&amp;#xC0B4;&amp;#xC0C1;&amp;#xBB34;&amp;#xAE30;(WMD)&amp;#xC640; &amp;#xD0C4;&amp;#xB3C4;&amp;#xBBF8;&amp;#xC0AC;&amp;#xC77C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC4F8; &amp;#xC7AC;&amp;#xC6D0;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#x201D;&amp;#xACE0; &amp;#xC9C0;&amp;#xC801;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F4B0;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xBC14;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xBD81;&amp;#xD55C;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4; &amp;#xD589;&amp;#xC704;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &lt;strong&gt;&amp;#xC57D; 500&amp;#xAC1C;&amp;#xC758; &amp;#x2018;&amp;#xBBF8;&amp;#xB07C; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#x2019;&amp;#x1F3A3;&lt;/strong&gt;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xAC00;&amp;#xC0C1; &amp;#xC790;&amp;#xC0B0; &amp;#xC808;&amp;#xB3C4;&amp;#xB97C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xBCF4;&amp;#xC720;&amp;#xC790;&amp;#xB4E4;&amp;#xC774;  &lt;strong&gt;&amp;#xC545;&amp;#xC131; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBC29;&amp;#xBB38;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; &amp;#x1FAAA;&amp;#xB4F1;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&lt;/strong&gt;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xC5D0;&amp;#xB294; &amp;#x201C;&amp;#xBD81;&amp;#xD55C;&amp;#xC740; &amp;#xC804;&amp;#xBB38; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBA38;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xB7C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC591;&amp;#xC131;&amp;#xD55C; &amp;#xB4A4; &amp;#xC138;&amp;#xACC4; &amp;#xAC01;&amp;#xC9C0;&amp;#xB85C; &amp;#xD30C;&amp;#xACAC;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xC800;&amp;#xC9C0;&amp;#xB974;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C5;&amp;#xB824;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87; &amp;#xB144; &amp;#xAC04; &amp;#xC218;&amp;#xC775; &amp;#xCC3D;&amp;#xCD9C;&amp;#xACFC; &amp;#xB3C8;&amp;#xC138;&amp;#xD0C1;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xADDC;&amp;#xC81C; &amp;#xC0AC;&amp;#xAC01;&amp;#xC9C0;&amp;#xB300;&amp;#xC5D0; &amp;#xB193;&amp;#xC778; &amp;#xAC00;&amp;#xC0C1;&amp;#xC790;&amp;#xC0B0; &amp;#xC2DC;&amp;#xC7A5;&amp;#xC744; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB178;&amp;#xB824;&amp;#xC654;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC218;&amp;#xC900;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F4C8;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;2024 &amp;#xB300;&amp;#xCCB4;&amp;#xBD88;&amp;#xAC00;&amp;#xD1A0;&amp;#xD070;(NFT) &amp;#xAD00;&amp;#xB828; &amp;#xBD88;&amp;#xBC95; &amp;#xAE08;&amp;#xC735; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD06C; &amp;#xD3C9;&amp;#xAC00;&amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#x2019;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://home.treasury.gov/news/press-releases/jy2382&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &lt;strong&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;, &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xCD5C;&amp;#xCD08; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xD55C;&amp;#xB2E4;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xC804;&amp;#xC790;&amp;#xC2E0;&amp;#xBB38; | &lt;a href=&#34;https://m.etnews.com/20240528000233&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xAC00; &amp;#xB0B4;&amp;#xB144;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &lt;strong&gt;&amp;#xCD5C;!&amp;#xCD08;!&amp;#xB85C;!&amp;#x1F60E;&lt;/strong&gt; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC804;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC778;, &amp;#xD559;&amp;#xC0DD; &amp;#xB4F1;&amp;#xC774; &amp;#xCC38;&amp;#xAC00;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &lt;strong&gt;&amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xB9CC;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB294; &amp;#xC774;&amp;#xBC88;&amp;#xC774; &amp;#xCC98;&amp;#xC74C;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB098;&amp;#xC544;&amp;#xAC00; 2026&amp;#xB144;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC678;&amp;#xB85C; &amp;#xB300;&amp;#xC0C1;&amp;#xC744; &amp;#xB113;&amp;#xD600; &amp;#xC804;&amp;#xAD6D; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC5D0; &amp;#xD574;&amp;#xC678;&amp;#xB3C4;&amp;#xC2DC; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &lt;strong&gt;&amp;#xAD6D;&amp;#xC81C;&amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C;&amp;#xB97C; &amp;#xAC1C;&amp;#xCD5C;&amp;#xB97C; &amp;#xCD94;&amp;#xC9C4;&lt;/strong&gt;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC9C0;&amp;#xC790;&amp;#xCCB4;&amp;#xB098; &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; &amp;#xBBFC;&amp;#xAC04;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xC804;&amp;#xBB38;&amp;#xC131;&amp;#xC744; &amp;#xC313;&amp;#xC744; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC801;&amp;#xC5B4; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4; &amp;#xAD00;&amp;#xB828; &amp;#xC8FC;&amp;#xB85C; &amp;#xC678;&amp;#xBD80; &amp;#xC6A9;&amp;#xC5ED;&amp;#xC774;&amp;#xB098; &amp;#xC5C5;&amp;#xCCB4; &amp;#xC758;&amp;#xC874;&amp;#xB3C4;&amp;#xAC00; &amp;#xB192;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;, &amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; &amp;#xC7AC;&amp;#xC9C1;&amp;#xC790;&amp;#xC758; &amp;#xC5C5;&amp;#xBB34; &amp;#xAD00;&amp;#xB828; &amp;#xB0B4;&amp;#xC7AC; &amp;#xB2A5;&amp;#xB825;&amp;#xC744; &amp;#xD5A5;&amp;#xC0C1;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xBA64;&amp;#xBC84;&amp;#xB85C;&amp;#xC11C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xB2E4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBC94;&amp;#xC6A9; &amp;#xB300;&amp;#xD68C;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC790;&amp;#xCCB4; &amp;#xD589;&amp;#xC0AC;&amp;#xB97C; &amp;#xAE30;&amp;#xD68D;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&amp;#x1F60A;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xD574;&amp;#xD0B9;&amp;#xBC29;&amp;#xC5B4;&amp;#xB300;&amp;#xD68C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;strong&gt;&amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8;&amp;#xC2DC;&amp;#xD2F0; &amp;#xC778;&amp;#xD504;&amp;#xB77C; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&lt;/strong&gt;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904; &amp;#xB2E4;&amp;#xB978; &amp;#xB300;&amp;#xD68C;&amp;#xC640; &amp;#xCC28;&amp;#xBCC4;&amp;#xC131;&amp;#xC744; &amp;#xB454;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xB610;&amp;#xD55C;, &amp;#xC11C;&amp;#xC6B8;&amp;#xC2DC;&amp;#xAC00; &amp;#xBCF4;&amp;#xC720;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xD65C;&amp;#xB3D9;, &amp;#xBCF4;&amp;#xC548;&amp;#xAD00;&amp;#xC81C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC6B4;&amp;#xC601; &amp;#xAD00;&amp;#xB9AC; &amp;#xB4F1; &amp;#xC804;&amp;#xBC18;&amp;#xC744; &amp;#xB2E4;&amp;#xB8F0; &amp;#xC804;&amp;#xB9DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xC810;&amp;#xC810; &amp;#xAD50;&amp;#xBB18;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#x5317;&amp;#xD574;&amp;#xD0B9;&amp;#xAE30;&amp;#xC220;&amp;#x2026;&amp;#x201D;MS &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.28 | &amp;#xC774;&amp;#xB370;&amp;#xC77C;&amp;#xB9AC; | &lt;a href=&#34;https://m.edaily.co.kr/news/read?newsId=03047126638893512&amp;amp;mediaCodeNo=257&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD81;&amp;#xD55C;&amp;#xC758; Kimsuky APT &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC804;&amp;#xB7B5;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574; &amp;#xC774;&amp;#xC288;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F6A8;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC778;&amp;#xB4E4;&amp;#xC774; &amp;#xC798; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xAD00;&amp;#xB9AC; &amp;#xCF58;&amp;#xC194;(MSC)&lt;/a&gt; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;.&lt;br&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;1&amp;#xCC28; &amp;#xBC29;&amp;#xC5B4;&amp;#xC120;&amp;#xC778; &amp;#xBC31;&amp;#xC2E0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB97C; &amp;#xD53C;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC774;&amp;#xBC88; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B8;&amp;#xC2A4; &amp;#xC2DC;&amp;#xD050;&amp;#xB9AC;&amp;#xD2F0;&amp;#xB300;&amp;#xC751;&amp;#xC13C;&amp;#xD130;(GSC)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xBD81;&amp;#xD55C; &amp;#xD574;&amp;#xD0B9;&amp;#xC870;&amp;#xC9C1; &amp;#x2018;&amp;#xAE40;&amp;#xC218;&amp;#xD0A4;(Kimsuky)&amp;#x2019;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC758; &amp;#xBD81;&amp;#xD55C;&amp;#xC778;&amp;#xAD8C;&amp;#xAD6D;&amp;#xC81C;&amp;#xD611;&amp;#xB825;&amp;#xB300;&amp;#xC0AC;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD55C; &lt;strong&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xACC4;&amp;#xC815;&amp;#xACFC; MS &amp;#xAD00;&amp;#xB9AC;&amp;#xCF58;&amp;#xC194; &amp;#xBB38;&amp;#xC11C;&amp;#xB85C; &amp;#xAD6D;&amp;#xB0B4; &amp;#xB300;&amp;#xBD81;&amp;#xB7;&amp;#xC548;&amp;#xBCF4; &amp;#xC885;&amp;#xC0AC;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xD574;&amp;#xD0B9;&amp;#xD55C; &amp;#xAC83;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xB0B4; &amp;#xD2B9;&amp;#xC815; &amp;#xACF5;&amp;#xC9C1;&amp;#xC790; &amp;#xD504;&amp;#xB85C;&amp;#xD544;&amp;#xCC98;&amp;#xB7FC; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC00;&amp;#xC9DC; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD574; &amp;#xBE44;&amp;#xACF5;&amp;#xAC1C; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD574; &amp;#xC8FC;&amp;#xB294; &amp;#xCC99;&amp;#xD558;&amp;#xBA70; URL &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;(OneDrive) &amp;#xB9C1;&amp;#xD06C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD574; &amp;#xD30C;&amp;#xC77C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD654;&amp;#xBA74;&amp;#xC774; &amp;#xB098;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#x2018;My_Essay(prof).msc&amp;#x2019;&amp;#xC73C;&amp;#xB85C;, &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB294; [.msc] &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#x2018;Microsoft Management Console&amp;#x2019; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#x2018;Microsoft Common Console &amp;#xBB38;&amp;#xC11C;&amp;#x2019; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAD49;&amp;#xC7A5;&amp;#xD788; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC83;&amp;#xC740; &lt;strong&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD1A0;&amp;#xD0C8; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB2F9;&amp;#xC2DC; &amp;#xB2E4;&amp;#xAD6D;&amp;#xC801; 60&amp;#xAC1C; Anti-Malware &amp;#xC2A4;&amp;#xCE90;&amp;#xB108; &amp;#xC804;&amp;#xBD80; &amp;#xC704;&amp;#xD611; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xC810;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xBCF4;&amp;#xACE0;&amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://www.genians.co.kr/blog/threat_intelligence/facebook&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!!&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &lt;strong&gt;&amp;#xC911;&amp;#xAD6D; &amp;#xD574;&amp;#xCEE4; &amp;#xB2C8;&amp;#xC60C;, &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xB7;&amp;#xC81C;&amp;#xC8FC;&amp;#xB300; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4; &amp;#xD574;&amp;#xD0B9; &amp;#xC8FC;&amp;#xC7A5;&amp;#x2026; &amp;#xB610; &amp;#xC2DC;&amp;#xC791;&amp;#xB410;&amp;#xB098;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.27 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130077&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC62C;&amp;#xD574; &amp;#xCD08; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4; &amp;#xACF5;&amp;#xACA9;&amp;#xD55C; &amp;#xC911;&amp;#xAD6D; &amp;#xD574;&amp;#xCEE4; &amp;#xB2C8;&amp;#xC60C;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?  &lt;a href=&#34;https://news.nate.com/view/20240207n40464&#34;&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; 100&amp;#xC5EC;&amp;#xAC1C;&amp;#xC758; &amp;#xAD6D;&amp;#xB0B4; &amp;#xAE30;&amp;#xAD00;&amp;#xACFC; &amp;#xAD50;&amp;#xC721; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xD588;&amp;#xC8E0;.&amp;#x1F621;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; &amp;#xB2C8;&amp;#xC60C;&amp;#xC740; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50;&amp;#xC640; &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xC778; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC640; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2C8;&amp;#xC60C;&amp;#xC740; &amp;#xD574;&amp;#xD0B9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD55C; &amp;#xADFC;&amp;#xAC70;&amp;#xB85C; &amp;#xACC4;&amp;#xC815;&amp;#xC815;&amp;#xBCF4;&amp;#xB85C; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xAD11;&amp;#xC6B4;&amp;#xB300;&amp;#xD559;&amp;#xAD50;&amp;#xC758; &amp;#xBC1B;&amp;#xC740; &amp;#xBA54;&amp;#xC77C;&amp;#xD568; &amp;#xB0B4;&amp;#xBD80; &amp;#xD654;&amp;#xBA74;&amp;#xACFC; &amp;#xBA54;&amp;#xC77C; &amp;#xC4F0;&amp;#xAE30; &amp;#xD654;&amp;#xBA74;&amp;#xACFC; &amp;#xC81C;&amp;#xC8FC;&amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xBA54;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD654;&amp;#xBA74;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xACF5;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xBCF4;&amp;#xC548;&amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB4E4;&amp;#xC740; &amp;#xC8FC; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xC600;&amp;#xB358; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC6F9;&amp;#xC258;&lt;/a&gt; &amp;#xB4F1; &amp;#xC6F9;&amp;#xC11C;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB300;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&lt;/a&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xACC4;&amp;#xC815; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC720;&amp;#xCD9C;&amp;#xB41C; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC6F9;&amp;#xBA54;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xC778;&amp;#xC99D;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xD53C;&amp;#xC2F1;, &amp;#xD30C;&amp;#xC77C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xB4F1; &amp;#xD559;&amp;#xAD50; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xACBD;&amp;#xACE0;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&amp;#x1F6A8;&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC2A4;&amp;#xCEA0;&amp;#x2026; &amp;#x201C;&amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C; &amp;#xC548; &amp;#xAE54;&amp;#xC544;&amp;#xB3C4; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0; DM &amp;#xC720;&amp;#xC758;&amp;#xD574;&amp;#xC57C;&amp;#x201D;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.05.24 | &amp;#xC870;&amp;#xC120;&amp;#xBE44;&amp;#xC988; | &lt;a href=&#34;https://biz.chosun.com/it-science/ict/2024/05/24/3BEYQ5MNVVFXDN3AEKPHZGQRUE/&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/06/03/romi0x/newsletter0603/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC2A4;&amp;#xCEA0;(&amp;#xC0AC;&amp;#xAE30;)&amp;#xC774; &amp;#xB2E4;&amp;#xC591;&amp;#xD574;&amp;#xC9C0;&amp;#xACE0; &amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C;, &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8; &amp;#xB4F1; &amp;#xC18C;&amp;#xC15C;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4;(SNS)&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xAC00; &amp;#xB298;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4; &amp;#xC8FC;&amp;#xC758;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC2A4;&amp;#xCEA0; &amp;#xC218;&amp;#xBC95;&amp;#xC774; &amp;#xC810;&amp;#xC810; &amp;#xCE58;&amp;#xBC00;&amp;#xD574;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;, &amp;#xD2B9;&amp;#xD788; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&amp;#xACE0;&amp;#xC218;&amp;#xC775; &amp;#xBD80;&amp;#xC5C5;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB85C; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC720;&amp;#xC778;&amp;#xD574; &amp;#xBD88;&amp;#xBC95; &amp;#xCE74;&amp;#xC9C0;&amp;#xB178; &amp;#xBCA0;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC694;. &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xB294; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xACBD;&amp;#xC81C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5EC;&amp;#xC720;&amp;#xB85C;&amp;#xC6B4; &amp;#xC0DD;&amp;#xD65C;&amp;#xACFC; &amp;#xAC12;&amp;#xBE44;&amp;#xC2FC; &amp;#xBB3C;&amp;#xAC74; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBB34;&amp;#xB2E8;&amp;#xC73C;&amp;#xB85C; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD574; &amp;#xAD11;&amp;#xACE0;&amp;#xD558;&amp;#xACE0;, &amp;#xC8FC;&amp;#xB85C; &amp;#xC804;&amp;#xC5C5;&amp;#xC8FC;&amp;#xBD80;&amp;#xB098; &amp;#xC5EC;&amp;#xC131;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xC694;. &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBA3C;&amp;#xC800; &amp;#xC5F0;&amp;#xB77D;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;, &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xC218;&amp;#xC775;&amp;#xAE08;&amp;#xC744; &amp;#xC9C0;&amp;#xAE09;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD22C;&amp;#xC790;&amp;#xAE08;&amp;#xC774; &amp;#xCEE4;&amp;#xC9C0;&amp;#xBA74; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xAE08;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xBA70; &amp;#xB3C8;&amp;#xC744; &amp;#xB3CC;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC694;.&amp;#x1F911;&lt;/p&gt;
&lt;p&gt;&amp;#xBAB8;&amp;#xCEA0; &amp;#xD53C;&amp;#xC2F1;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xB3FC;&amp;#xC694;. &amp;#xC2A4;&amp;#xCE90;&amp;#xBA38;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xD30C;&amp;#xC77C; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xB97C; &amp;#xD611;&amp;#xBC15;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;strong&gt;&amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC9C0;&amp;#xC778; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xCEA1;&amp;#xCC98;&amp;#xD55C; &amp;#xD6C4;, &amp;#xC131;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xD654;&amp;#xB098; &amp;#xC601;&amp;#xC0C1; &amp;#xD1B5;&amp;#xD654;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC720;&amp;#xCD9C;&amp;#xD558;&amp;#xACA0;&amp;#xB2E4;&amp;#xACE0; &amp;#xD611;&amp;#xBC15;&amp;#xD574;&amp;#xC694;.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB7A9; &amp;#xC2DC;&amp;#xD050;&amp;#xB9AC;&amp;#xD2F0; &amp;#xC778;&amp;#xD154;&amp;#xB9AC;&amp;#xC804;&amp;#xC2A4; &amp;#xC13C;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://asec.ahnlab.com/ko/63616/&#34;&gt;&amp;#xAD00;&amp;#xB828; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&lt;/a&gt;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xAD00;&amp;#xB9AC; &amp;#xCF58;&amp;#xC194;(MSC)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;(OS)&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB85C;, &amp;#xC27D;&amp;#xAC8C; &amp;#xB9D0;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC27D;&amp;#xAC8C; &amp;#xC6B4;&amp;#xC601;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xBAA8;&amp;#xC544; &amp;#xB193;&amp;#xC740; &amp;#xD654;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;NFT&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xAD8C;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xD558;&amp;#xC5EC; &amp;#xC720;&amp;#xC77C;&amp;#xC131;&amp;#xACFC; &amp;#xD76C;&amp;#xC18C;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC6F9;&amp;#xC258;&lt;/strong&gt;(Web Shell)&lt;/p&gt;
&lt;p&gt;&amp;#xC6F9; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC545;&amp;#xC131; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB85C;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xACE0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB300;&amp;#xC785; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB098; &amp;#xC554;&amp;#xD638;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xD574;&amp;#xD0B9; &amp;#xAE30;&amp;#xBC95;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://news.zum.com/articles/90884865&#34;&gt;&amp;#x201C;&amp;#xC798;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC5C5; &amp;#xB354; &amp;#xC798;&amp;#xD558;&amp;#xC790;&amp;#x201D; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; &amp;#xBCF4;&amp;#xC548;&amp;#xAE30;&amp;#xC5C5; &amp;#xC778;&amp;#xC218;&amp;#xD569;&amp;#xBCD1; &amp;#xD589;&amp;#xB82C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130083&amp;amp;direct=mobile&#34;&gt;&amp;#xAC00;&amp;#xC9DC; &amp;#xBC31;&amp;#xC2E0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;, &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD615; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC720;&amp;#xD3EC;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130074&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xC911;&amp;#xAD6D; &amp;#xBC30;&amp;#xD6C4; &amp;#xD574;&amp;#xCEE4;&amp;#xC870;&amp;#xC9C1;, &amp;#xACF5;&amp;#xACA9; &amp;#xD0D0;&amp;#xC9C0;&amp;#xB7;&amp;#xCD94;&amp;#xC801; &amp;#xD53C;&amp;#xD558;&amp;#xB294; ORB &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC2A4;&amp;#xD30C;&amp;#xC774; &amp;#xD65C;&amp;#xB3D9;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.dt.co.kr/contents.html?article_no=2024052802109931065006&amp;amp;ref=naver&#34;&gt;&amp;#x65E5; 20&amp;#xB300; &amp;#xB0A8;&amp;#xC131;, AI &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xC545;&amp;#xC6A9;&amp;#x2026;&amp;#x201D;&amp;#xB3C8; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xB2E4;&amp;#x201D;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;5&amp;#xC6D4;-&amp;#xBCF4;&amp;#xC548;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#5&amp;#xC6D4;-&amp;#xBCF4;&amp;#xC548;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;5&amp;#xC6D4; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;5&amp;#xC6D4; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.pisfair.org/2024/index.html&#34;&gt;&lt;strong&gt;&amp;#xC81C;13&amp;#xD68C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD398;&amp;#xC5B4; &amp;amp; CPO&amp;#xC6CC;&amp;#xD06C;&amp;#xC20D;&lt;/strong&gt;&lt;/a&gt; | &lt;strong&gt;6&amp;#xC6D4; 4&amp;#xC77C;(&amp;#xD654;) ~ 5&amp;#xC77C;(&amp;#xC218;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/NewsletterBanner.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/06/03/romi0x/newsletter0603/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] ì ì  ì»¤ì§€ëŠ” åŒ— í•´í‚¹ê¸°ìˆ ðŸ¤¦â€ - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-06-03 17:00" pubdate>
      2024ë…„ 6ì›” 3ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.6k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      52
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] ì ì  ì»¤ì§€ëŠ” åŒ— í•´í‚¹ê¸°ìˆ ðŸ¤¦â€</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! romi0x&#xC785;&#xB2C8;&#xB2E4; &#x1F600;</p>
<p>&#xC5EC;&#xB984;&#xC758; &#xC2DC;&#xC791;&#xC744; &#xC54C;&#xB9AC;&#xB294; 6&#xC6D4;&#xC774;&#xC5D0;&#xC694;.<br>&#xD587;&#xC0B4; &#xAC00;&#xB4DD;&#xD55C; &#xB0A0;&#xC528;&#x2600;&#xFE0F;&#xC640; &#xD568;&#xAED8; &#xD589;&#xC6B4;&#x1F340;&#xC774; &#xAC00;&#xB4DD;&#xAC00;&#xB4DD;&#xD55C; &#xD55C; &#xB2EC;&#xC774; &#xB418;&#xBA74; &#xC88B;&#xACA0;&#xC5B4;&#xC694;!<br>&#xC774;&#xBC88;&#xC8FC;&#xB3C4; &#xC18C;&#xC2DD;&#xC744; &#xAC00;&#xB4DD;&#xAC00;&#xB4DD; &#xB2F4;&#xC544; &#xC654;&#xC5B4;&#xC694; &#x1F44B;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#x7F8E; &#xBD88;&#xBC95;&#xAE08;&#xC735; &#xB9AC;&#xC2A4;&#xD06C; &#xBCF4;&#xACE0;&#xC11C; &#x201C;&#x5317;, &#xC7AC;&#xC791;&#xB144; &#xC57D;1&#xC870;&#xC6D0; &#xAC00;&#xC0C1;&#xC790;&#xC0B0; &#xC808;&#xCDE8;&#x201D;</strong></p>
</blockquote>
<p>2024.05.30 | &#xC5F0;&#xD569;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.yna.co.kr/view/AKR20240530008000071?input=1195m">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/06/03/romi0x/newsletter0603/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"><br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://home.treasury.gov/news/press-releases/jy2382">&#xCD9C;&#xCC98;</a></p>
<p>&#xBBF8;&#xAD6D; &#xC7AC;&#xBB34;&#xBD80;&#xC5D0;&#xC11C; &#x2018;2024 &#xB300;&#xCCB4;&#xBD88;&#xAC00;&#xD1A0;&#xD070;(<a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">NFT</a>) &#xAD00;&#xB828; &#xBD88;&#xBC95; &#xAE08;&#xC735; &#xB9AC;&#xC2A4;&#xD06C; &#xD3C9;&#xAC00;&#xBCF4;&#xACE0;&#xC11C;&#x2019;&#xB97C; &#xBC1C;&#xD45C;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xBCF4;&#xACE0;&#xC11C;&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xBD81;&#xD55C;&#xC740; 2022&#xB144;&#xC5D0; &#xAC00;&#xC0C1; &#xC790;&#xC0B0; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xD68C;&#xC0AC;&#xB4E4;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD55C; &#xAC00;&#xC0C1; &#xC790;&#xC0B0; &#xC808;&#xB3C4;&#xB85C; <strong>7&#xC5B5; 2&#xCC9C;&#xB9CC; &#xB2EC;&#xB7EC;(9,860&#xC5B5; &#xC6D0;) &#xC774;&#xC0C1;</strong>&#xC744; &#xBAA8;&#xC558;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#x1FAE2;</p>
<p>&#x201C;&#xC774;&#xB294; &#xBD81;&#xD55C;&#xC774; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xB97C; &#xD1B5;&#xD574; &#xCDA9;&#xB2F9;&#xD558;&#xB294; &#xC218;&#xC785;&#xC758; &#xD070; &#xBD80;&#xBD84;&#xC744; &#xCC28;&#xC9C0;&#xD55C;&#xB2E4;&#x201D;&#xACE0; &#xC5B8;&#xAE09;&#xD558;&#xAE30;&#xB3C4; &#xD588;&#xC5B4;&#xC694;.<br>&#xB610;&#xD55C;, &#xC7AC;&#xBB34;&#xBD80;&#xB294; &#x201C;&#xAC15;&#xB825;&#xD55C; &#xBBF8;&#xAD6D; &#xBC0F; &#xC720;&#xC5D4; &#xC81C;&#xC7AC;&#xC758; &#xC555;&#xBC15; &#xC544;&#xB798;, &#xBD81;&#xD55C;&#xC740; &#xAC00;&#xC0C1;&#xC790;&#xC0B0;&#xC0AC;&#xC5C5;&#xC790;(VASP) &#xBC0F; &#xB2E4;&#xB978; &#xAE08;&#xC735; &#xAE30;&#xAD00;&#xB4E4;&#xC744; &#xC0C1;&#xB300;&#xB85C; &#xD55C; &#xC0AC;&#xC774;&#xBC84; &#xC808;&#xB3C4; &#xD589;&#xC704;&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xBD88;&#xBC95; &#xD65C;&#xB3D9;&#xC5D0; &#xC758;&#xC9C0;&#xD574; &#xBD88;&#xBC95;&#xC801;&#xC778; &#xB300;&#xB7C9;&#xC0B4;&#xC0C1;&#xBB34;&#xAE30;(WMD)&#xC640; &#xD0C4;&#xB3C4;&#xBBF8;&#xC0AC;&#xC77C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC4F8; &#xC7AC;&#xC6D0;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;&#x201D;&#xACE0; &#xC9C0;&#xC801;&#xD588;&#xC5B4;&#xC694;.&#x1F4B0;</p>
<p>&#xBBF8;&#xAD6D; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xC5C5;&#xCCB4;&#xAC00; &#xD30C;&#xC545;&#xD55C; &#xBC14;&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xBD81;&#xD55C;&#xC758; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4; &#xD589;&#xC704;&#xC790;&#xB4E4;&#xC740; <strong>&#xC57D; 500&#xAC1C;&#xC758; &#x2018;&#xBBF8;&#xB07C; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#x2019;&#x1F3A3;</strong>&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xAC00;&#xC0C1; &#xC790;&#xC0B0; &#xC808;&#xB3C4;&#xB97C; &#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.<br>&#xAC00;&#xC0C1;&#xC790;&#xC0B0; &#xBCF4;&#xC720;&#xC790;&#xB4E4;&#xC774;  <strong>&#xC545;&#xC131; &#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xBC29;&#xBB38;&#xD558;&#xAC8C; &#xD574;&#xC11C; &#xBE44;&#xBC00;&#xBC88;&#xD638; &#x1FAAA;&#xB4F1;&#xC744; &#xB178;&#xCD9C;</strong>&#xD558;&#xAC8C; &#xB9CC;&#xB4E0; &#xB4A4; &#xAC00;&#xC0C1;&#xC790;&#xC0B0;&#xC744; &#xD0C8;&#xCDE8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xB098;&#xD0C0;&#xB0AC;&#xC5B4;&#xC694;.</p>
<p>&#xBCF4;&#xACE0;&#xC11C;&#xC5D0;&#xB294; &#x201C;&#xBD81;&#xD55C;&#xC740; &#xC804;&#xBB38; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB4E4;&#xC744; &#xB300;&#xB7C9;&#xC73C;&#xB85C; &#xC591;&#xC131;&#xD55C; &#xB4A4; &#xC138;&#xACC4; &#xAC01;&#xC9C0;&#xB85C; &#xD30C;&#xACAC;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xB97C; &#xC800;&#xC9C0;&#xB974;&#xB3C4;&#xB85D; &#xB3C5;&#xB824;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xC774;&#xB4E4;&#xC740; &#xC9C0;&#xB09C; &#xBA87; &#xB144; &#xAC04; &#xC218;&#xC775; &#xCC3D;&#xCD9C;&#xACFC; &#xB3C8;&#xC138;&#xD0C1;&#xC744; &#xC704;&#xD574; &#xADDC;&#xC81C; &#xC0AC;&#xAC01;&#xC9C0;&#xB300;&#xC5D0; &#xB193;&#xC778; &#xAC00;&#xC0C1;&#xC790;&#xC0B0; &#xC2DC;&#xC7A5;&#xC744; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xB178;&#xB824;&#xC654;&#xB2E4;. &#xC774;&#xB294; &#xB9E4;&#xC6B0; &#xC2EC;&#xAC01;&#xD55C; &#xC218;&#xC900;&#x201D;&#xC774;&#xB77C;&#xACE0; &#xBC1D;&#xD614;&#xC5B4;&#xC694;.&#x1F4C8;</p>
<p>&#x2018;2024 &#xB300;&#xCCB4;&#xBD88;&#xAC00;&#xD1A0;&#xD070;(NFT) &#xAD00;&#xB828; &#xBD88;&#xBC95; &#xAE08;&#xC735; &#xB9AC;&#xC2A4;&#xD06C; &#xD3C9;&#xAC00;&#xBCF4;&#xACE0;&#xC11C;&#x2019;&#xB97C; &#xBCF4;&#xACE0;&#xC2F6;&#xB2E4;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://home.treasury.gov/news/press-releases/jy2382">&#xB9C1;&#xD06C;</a>&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xC138;&#xC694;!</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3; <strong>&#xC11C;&#xC6B8;&#xC2DC;, &#xC9C0;&#xC790;&#xCCB4;&#xB7;&#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xCD5C;&#xCD08; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xD574;&#xD0B9;&#xBC29;&#xC5B4;&#xB300;&#xD68C; &#xAC1C;&#xCD5C;&#xD55C;&#xB2E4;</strong></p>
</blockquote>
<p>2024.05.28 | &#xC804;&#xC790;&#xC2E0;&#xBB38; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.etnews.com/20240528000233">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/06/03/romi0x/newsletter0603/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC11C;&#xC6B8;&#xC2DC;&#xAC00; &#xB0B4;&#xB144;&#xC5D0; &#xC9C0;&#xC790;&#xCCB4;&#xB7;&#xACF5;&#xACF5;&#xAE30;&#xAD00; <strong>&#xCD5C;!&#xCD08;!&#xB85C;!&#x1F60E;</strong> &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xD574;&#xD0B9;&#xBC29;&#xC5B4;&#xB300;&#xD68C;&#xB97C; &#xAC1C;&#xCD5C;&#xD55C;&#xB2E4;&#xACE0; &#xC804;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xC77C;&#xBC18;&#xC778;, &#xD559;&#xC0DD; &#xB4F1;&#xC774; &#xCC38;&#xAC00;&#xD558;&#xC9C0; &#xC54A;&#xACE0; <strong>&#xACF5;&#xBB34;&#xC6D0;, &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xC7AC;&#xC9C1;&#xC790;&#xB9CC;&#xC744; &#xB300;&#xC0C1;</strong>&#xC73C;&#xB85C; &#xD558;&#xB294; &#xD574;&#xD0B9;&#xBC29;&#xC5B4;&#xB300;&#xD68C;&#xB294; &#xC774;&#xBC88;&#xC774; &#xCC98;&#xC74C;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB098;&#xC544;&#xAC00; 2026&#xB144;&#xC5D0;&#xB294; &#xD574;&#xC678;&#xB85C; &#xB300;&#xC0C1;&#xC744; &#xB113;&#xD600; &#xC804;&#xAD6D; &#xACF5;&#xBB34;&#xC6D0;, &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xC7AC;&#xC9C1;&#xC790;&#xC5D0; &#xD574;&#xC678;&#xB3C4;&#xC2DC; &#xACF5;&#xBB34;&#xC6D0;&#xAE4C;&#xC9C0; &#xD3EC;&#xD568;&#xD55C; <strong>&#xAD6D;&#xC81C;&#xD574;&#xD0B9;&#xBC29;&#xC5B4;&#xB300;&#xD68C;&#xB97C; &#xAC1C;&#xCD5C;&#xB97C; &#xCD94;&#xC9C4;</strong>&#xD55C;&#xB2E4;&#xACE0; &#xBC1D;&#xD614;&#xC5B4;&#xC694;.</p>
<p>&#xC11C;&#xC6B8;&#xC2DC;&#xB294; &#xAD6D;&#xB0B4; &#xC9C0;&#xC790;&#xCCB4;&#xB098; &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xACF5;&#xBB34;&#xC6D0;, &#xC7AC;&#xC9C1;&#xC790;&#xC758; &#xACBD;&#xC6B0; &#xADF8;&#xB3D9;&#xC548; &#xBBFC;&#xAC04;&#xC5D0; &#xBE44;&#xD574; &#xC804;&#xBB38;&#xC131;&#xC744; &#xC313;&#xC744; &#xAE30;&#xD68C;&#xAC00; &#xC801;&#xC5B4; &#xD574;&#xD0B9;&#xBC29;&#xC5B4; &#xAD00;&#xB828; &#xC8FC;&#xB85C; &#xC678;&#xBD80; &#xC6A9;&#xC5ED;&#xC774;&#xB098; &#xC5C5;&#xCCB4; &#xC758;&#xC874;&#xB3C4;&#xAC00; &#xB192;&#xC558;&#xB2E4;&#xACE0; &#xBD84;&#xC11D;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xC774;&#xC5D0; &#xACF5;&#xBB34;&#xC6D0;, &#xACF5;&#xACF5;&#xAE30;&#xAD00; &#xC7AC;&#xC9C1;&#xC790;&#xC758; &#xC5C5;&#xBB34; &#xAD00;&#xB828; &#xB0B4;&#xC7AC; &#xB2A5;&#xB825;&#xC744; &#xD5A5;&#xC0C1;&#xD558;&#xACE0; &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548;&#xC758; &#xD575;&#xC2EC;&#xBA64;&#xBC84;&#xB85C;&#xC11C; &#xC5ED;&#xD560;&#xC744; &#xB2E4; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBC94;&#xC6A9; &#xB300;&#xD68C;&#xBCF4;&#xB2E4; &#xC790;&#xCCB4; &#xD589;&#xC0AC;&#xB97C; &#xAE30;&#xD68D;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;.&#x1F60A;</p>
<p>&#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xD574;&#xD0B9;&#xBC29;&#xC5B4;&#xB300;&#xD68C; &#xB0B4;&#xC6A9;&#xC740; <strong>&#xC548;&#xC804;&#xD55C; &#xC2A4;&#xB9C8;&#xD2B8;&#xC2DC;&#xD2F0; &#xC778;&#xD504;&#xB77C; &#xBCF4;&#xD638;&#xC640; &#xC6B4;&#xC601;</strong>&#xC744; &#xC704;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xC8FC;&#xB85C; &#xB2E4;&#xB904; &#xB2E4;&#xB978; &#xB300;&#xD68C;&#xC640; &#xCC28;&#xBCC4;&#xC131;&#xC744; &#xB454;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.<br>&#xB610;&#xD55C;, &#xC11C;&#xC6B8;&#xC2DC;&#xAC00; &#xBCF4;&#xC720;&#xD558;&#xACE0; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xC640; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xBCF4;&#xD638; &#xD65C;&#xB3D9;, &#xBCF4;&#xC548;&#xAD00;&#xC81C; &#xC2DC;&#xC2A4;&#xD15C; &#xC6B4;&#xC601; &#xAD00;&#xB9AC; &#xB4F1; &#xC804;&#xBC18;&#xC744; &#xB2E4;&#xB8F0; &#xC804;&#xB9DD;&#xC774;&#xB77C;&#xACE0; &#xBC1D;&#xD614;&#xC5B4;&#xC694;.</p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xC810;&#xC810; &#xAD50;&#xBB18;&#xD574;&#xC9C0;&#xB294; &#x5317;&#xD574;&#xD0B9;&#xAE30;&#xC220;&#x2026;&#x201D;MS &#xAD00;&#xB9AC;&#xC790; &#xD398;&#xC774;&#xC9C0;&#xB85C; &#xC704;&#xC7A5;&#x201D;</strong></p>
</blockquote>
<p>2024.05.28 | &#xC774;&#xB370;&#xC77C;&#xB9AC; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.edaily.co.kr/news/read?newsId=03047126638893512&amp;mediaCodeNo=257">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xBD81;&#xD55C;&#xC758; Kimsuky APT &#xADF8;&#xB8F9;&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xACF5;&#xACA9; &#xC804;&#xB7B5;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xC744; &#xC9C4;&#xD589;&#xD574; &#xC774;&#xC288;&#xC785;&#xB2C8;&#xB2E4;.&#x1F6A8;</p>
<p>&#xC77C;&#xBC18;&#xC778;&#xB4E4;&#xC774; &#xC798; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xAD00;&#xB9AC; &#xCF58;&#xC194;(MSC)</a> &#xBB38;&#xC11C;&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xAC83;&#xC778;&#xB370;&#xC694;.<br>&#xC774; &#xBC29;&#xBC95;&#xC73C;&#xB85C; <strong>1&#xCC28; &#xBC29;&#xC5B4;&#xC120;&#xC778; &#xBC31;&#xC2E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD0D0;&#xC9C0;&#xB97C; &#xD53C;&#xD55C; &#xAC83;&#xC774; &#xC774;&#xBC88; &#xACF5;&#xACA9;&#xC758; &#xD2B9;&#xC9D5;</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/06/03/romi0x/newsletter0603/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC9C0;&#xB2C8;&#xC5B8;&#xC2A4; &#xC2DC;&#xD050;&#xB9AC;&#xD2F0;&#xB300;&#xC751;&#xC13C;&#xD130;(GSC)&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xBD81;&#xD55C; &#xD574;&#xD0B9;&#xC870;&#xC9C1; &#x2018;&#xAE40;&#xC218;&#xD0A4;(Kimsuky)&#x2019;&#xB294; &#xD55C;&#xAD6D;&#xC758; &#xBD81;&#xD55C;&#xC778;&#xAD8C;&#xAD6D;&#xC81C;&#xD611;&#xB825;&#xB300;&#xC0AC;&#xB85C; &#xC704;&#xC7A5;&#xD55C; <strong>&#xAC00;&#xC9DC; &#xD398;&#xC774;&#xC2A4;&#xBD81; &#xACC4;&#xC815;&#xACFC; MS &#xAD00;&#xB9AC;&#xCF58;&#xC194; &#xBB38;&#xC11C;&#xB85C; &#xAD6D;&#xB0B4; &#xB300;&#xBD81;&#xB7;&#xC548;&#xBCF4; &#xC885;&#xC0AC;&#xC790;&#xB4E4;&#xC744; &#xD574;&#xD0B9;&#xD55C; &#xAC83;</strong>&#xC73C;&#xB85C; &#xBC1D;&#xD600;&#xC84C;&#xC5B4;&#xC694;.</p>
<p>&#xACF5;&#xACA9;&#xC790;&#xB294; &#xD55C;&#xAD6D;&#xB0B4; &#xD2B9;&#xC815; &#xACF5;&#xC9C1;&#xC790; &#xD504;&#xB85C;&#xD544;&#xCC98;&#xB7FC; &#xB9CC;&#xB4E0; &#xAC00;&#xC9DC; &#xD398;&#xC774;&#xC2A4;&#xBD81; &#xACC4;&#xC815;&#xC73C;&#xB85C; &#xC704;&#xC7A5;&#xD574; &#xBE44;&#xACF5;&#xAC1C; &#xBB38;&#xC11C;&#xB97C; &#xACF5;&#xC720;&#xD574; &#xC8FC;&#xB294; &#xCC99;&#xD558;&#xBA70; URL &#xB9C1;&#xD06C;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xC600;&#xACE0;, &#xB9C1;&#xD06C;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xC6D0;&#xB4DC;&#xB77C;&#xC774;&#xBE0C;(OneDrive) &#xB9C1;&#xD06C;&#xB85C; &#xC774;&#xB3D9;&#xD574; &#xD30C;&#xC77C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xD654;&#xBA74;&#xC774; &#xB098;&#xC635;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC740; &#x2018;My_Essay(prof).msc&#x2019;&#xC73C;&#xB85C;, &#xD655;&#xC7A5;&#xC790;&#xB294; [.msc] &#xC720;&#xD615;&#xC740; &#x2018;Microsoft Management Console&#x2019; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC2E4;&#xD589;&#xB418;&#xB294; &#x2018;Microsoft Common Console &#xBB38;&#xC11C;&#x2019; &#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xAD49;&#xC7A5;&#xD788; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xAC83;&#xC740; <strong>&#xD574;&#xB2F9; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xC774; &#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xD1A0;&#xD0C8; &#xC5C5;&#xB85C;&#xB4DC; &#xB2F9;&#xC2DC; &#xB2E4;&#xAD6D;&#xC801; 60&#xAC1C; Anti-Malware &#xC2A4;&#xCE90;&#xB108; &#xC804;&#xBD80; &#xC704;&#xD611; &#xC694;&#xC18C;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xC9C0; &#xBABB;&#xD55C; &#xC810;</strong>&#xC785;&#xB2C8;&#xB2E4;!!</p>
<p>&#xD574;&#xB2F9; &#xACF5;&#xACA9;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xBCF4;&#xACE0;&#xC2F6;&#xB2E4;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.genians.co.kr/blog/threat_intelligence/facebook">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xC138;&#xC694;!!</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; <strong>&#xC911;&#xAD6D; &#xD574;&#xCEE4; &#xB2C8;&#xC60C;, &#xAD11;&#xC6B4;&#xB300;&#xB7;&#xC81C;&#xC8FC;&#xB300; &#xACC4;&#xC815;&#xC815;&#xBCF4; &#xD574;&#xD0B9; &#xC8FC;&#xC7A5;&#x2026; &#xB610; &#xC2DC;&#xC791;&#xB410;&#xB098;</strong></p>
</blockquote>
<p>2024.05.27 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130077&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xC62C;&#xD574; &#xCD08; &#xAD6D;&#xB0B4; &#xC0AC;&#xC774;&#xD2B8; &#xBB34;&#xCC28;&#xBCC4; &#xACF5;&#xACA9;&#xD55C; &#xC911;&#xAD6D; &#xD574;&#xCEE4; &#xB2C8;&#xC60C;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xB098;&#xC694;?  <a target="_blank" rel="external nofollow noopener noreferrer" href="https://news.nate.com/view/20240207n40464">&#xB2F9;&#xC2DC; &#xAE30;&#xC0AC;</a></p>
<p>&#xB2F9;&#xC2DC; 100&#xC5EC;&#xAC1C;&#xC758; &#xAD6D;&#xB0B4; &#xAE30;&#xAD00;&#xACFC; &#xAD50;&#xC721; &#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xBB34;&#xCC28;&#xBCC4;&#xC801;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xD588;&#xC8E0;.&#x1F621;</p>
<p><img src="/2024/06/03/romi0x/newsletter0603/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC774;&#xBC88;&#xC5D4; &#xB2C8;&#xC60C;&#xC740; &#xD154;&#xB808;&#xADF8;&#xB7A8;&#xC744; &#xD1B5;&#xD574; &#xC81C;&#xC8FC;&#xB300;&#xD559;&#xAD50;&#xC640; &#xAD11;&#xC6B4;&#xB300;&#xD559;&#xAD50; &#xACC4;&#xC815;&#xC815;&#xBCF4;&#xB97C; &#xD0C8;&#xCDE8;&#xD588;&#xB2E4;&#xACE0; &#xC8FC;&#xC7A5;&#xD558;&#xBA74;&#xC11C; &#xC774;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC815;&#xBCF4;&#xC778; &#xC544;&#xC774;&#xB514;&#xC640; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xD154;&#xB808;&#xADF8;&#xB7A8;&#xC5D0; &#xACF5;&#xC720;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xB2C8;&#xC60C;&#xC740; &#xD574;&#xD0B9;&#xD588;&#xB2E4;&#xACE0; &#xC8FC;&#xC7A5;&#xD55C; &#xADFC;&#xAC70;&#xB85C; &#xACC4;&#xC815;&#xC815;&#xBCF4;&#xB85C; &#xB85C;&#xADF8;&#xC778;&#xD55C; &#xAD11;&#xC6B4;&#xB300;&#xD559;&#xAD50;&#xC758; &#xBC1B;&#xC740; &#xBA54;&#xC77C;&#xD568; &#xB0B4;&#xBD80; &#xD654;&#xBA74;&#xACFC; &#xBA54;&#xC77C; &#xC4F0;&#xAE30; &#xD654;&#xBA74;&#xACFC; &#xC81C;&#xC8FC;&#xB300;&#xD559;&#xAD50; &#xBA54;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xD654;&#xBA74;&#xB3C4; &#xD568;&#xAED8; &#xACF5;&#xAC1C;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xC5EC;&#xB7EC; &#xBCF4;&#xC548;&#xC804;&#xBB38;&#xAC00;&#xB4E4;&#xC740; &#xC8FC; &#xACF5;&#xACA9; &#xBC29;&#xBC95;&#xC774;&#xC600;&#xB358; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xC6F9;&#xC258;</a> &#xB4F1; &#xC6F9;&#xC11C;&#xBC84; &#xACF5;&#xACA9; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xBB34;&#xC791;&#xC704; &#xB300;&#xC785; &#xACF5;&#xACA9;</a>&#xC744; &#xD1B5;&#xD55C; &#xACC4;&#xC815; &#xD0C8;&#xCDE8; &#xC2DC;&#xB3C4;&#xB85C; &#xC608;&#xC0C1;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xB610;&#xD55C;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC720;&#xCD9C;&#xB41C; &#xACC4;&#xC815;&#xC73C;&#xB85C; &#xC6F9;&#xBA54;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB85C;&#xADF8;&#xC778;&#xD55C; &#xAC83;&#xC744; &#xC778;&#xC99D;&#xD588;&#xB294;&#xB370;, &#xC774;&#xB7EC;&#xD55C; &#xACBD;&#xC6B0; &#xB85C;&#xADF8;&#xC778; &#xAD8C;&#xD55C;&#xC744; &#xD1B5;&#xD574; &#xC774;&#xBA54;&#xC77C; &#xD53C;&#xC2F1;, &#xD30C;&#xC77C; &#xC5C5;&#xB85C;&#xB4DC; &#xB4F1; &#xD559;&#xAD50; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xCD94;&#xAC00; &#xACF5;&#xACA9;&#xC744; &#xC2DC;&#xB3C4;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xACBD;&#xACE0;&#xD588;&#xC5B4;&#xC694;.&#x1F6A8;</p>
<h2 id="-3"><a href="#-3" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; <strong>&#xCE58;&#xBC00;&#xD574;&#xC9C0;&#xB294; &#xC628;&#xB77C;&#xC778; &#xC2A4;&#xCEA0;&#x2026; &#x201C;&#xC545;&#xC131;&#xD30C;&#xC77C; &#xC548; &#xAE54;&#xC544;&#xB3C4; &#xC778;&#xC2A4;&#xD0C0; DM &#xC720;&#xC758;&#xD574;&#xC57C;&#x201D;</strong></p>
</blockquote>
<p>2024.05.24 | &#xC870;&#xC120;&#xBE44;&#xC988; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://biz.chosun.com/it-science/ict/2024/05/24/3BEYQ5MNVVFXDN3AEKPHZGQRUE/">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/06/03/romi0x/newsletter0603/image5.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xCD5C;&#xADFC; &#xC628;&#xB77C;&#xC778; &#xC2A4;&#xCEA0;(&#xC0AC;&#xAE30;)&#xC774; &#xB2E4;&#xC591;&#xD574;&#xC9C0;&#xACE0; &#xCE58;&#xBC00;&#xD574;&#xC9C0;&#xBA74;&#xC11C;, &#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8; &#xB4F1; &#xC18C;&#xC15C;&#xBBF8;&#xB514;&#xC5B4;(SNS)&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xBC94;&#xC8C4;&#xAC00; &#xB298;&#xACE0; &#xC788;&#xC5B4; &#xC8FC;&#xC758;&#xAC00; &#xD544;&#xC694;&#xD574;&#xC694;.</p>
<p>&#xBB38;&#xC81C;&#xB294; &#xC2A4;&#xCEA0; &#xC218;&#xBC95;&#xC774; &#xC810;&#xC810; &#xCE58;&#xBC00;&#xD574;&#xC9C4;&#xB2E4;&#xB294; &#xAC83;&#xC778;&#xB370;, &#xD2B9;&#xD788; &#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8; &#xB4F1;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xBC94;&#xC8C4;&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;.</p>
<p>&#x2018;&#xACE0;&#xC218;&#xC775; &#xBD80;&#xC5C5;&#x2019;&#xC774;&#xB77C;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xB85C; &#xC774;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xC720;&#xC778;&#xD574; &#xBD88;&#xBC95; &#xCE74;&#xC9C0;&#xB178; &#xBCA0;&#xD305;&#xC744; &#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC694;. &#xC2A4;&#xCE90;&#xBA38;&#xB294; &#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8;&#xC744; &#xD1B5;&#xD574; &#xACBD;&#xC81C;&#xC801;&#xC73C;&#xB85C; &#xC5EC;&#xC720;&#xB85C;&#xC6B4; &#xC0DD;&#xD65C;&#xACFC; &#xAC12;&#xBE44;&#xC2FC; &#xBB3C;&#xAC74; &#xC0AC;&#xC9C4;&#xC744; &#xBB34;&#xB2E8;&#xC73C;&#xB85C; &#xB3C4;&#xC6A9;&#xD574; &#xAD11;&#xACE0;&#xD558;&#xACE0;, &#xC8FC;&#xB85C; &#xC804;&#xC5C5;&#xC8FC;&#xBD80;&#xB098; &#xC5EC;&#xC131;&#xB4E4;&#xC5D0;&#xAC8C; &#xC811;&#xADFC;&#xD574;&#xC694;. &#xD53C;&#xD574;&#xC790;&#xB4E4;&#xC774; &#xC2A4;&#xCE90;&#xBA38;&#xC5D0;&#xAC8C; &#xBA3C;&#xC800; &#xC5F0;&#xB77D;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;, &#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xC2E4;&#xC81C; &#xC218;&#xC775;&#xAE08;&#xC744; &#xC9C0;&#xAE09;&#xD558;&#xC9C0;&#xB9CC; &#xD22C;&#xC790;&#xAE08;&#xC774; &#xCEE4;&#xC9C0;&#xBA74; &#xCD94;&#xAC00; &#xC785;&#xAE08;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xBA70; &#xB3C8;&#xC744; &#xB3CC;&#xB824;&#xC8FC;&#xC9C0; &#xC54A;&#xC544;&#xC694;.&#x1F911;</p>
<p>&#xBAB8;&#xCEA0; &#xD53C;&#xC2F1;&#xC5D0;&#xB3C4; &#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8;&#xC774; &#xD65C;&#xC6A9;&#xB3FC;&#xC694;. &#xC2A4;&#xCE90;&#xBA38;&#xB294; &#xC545;&#xC131; &#xD30C;&#xC77C; &#xC5C6;&#xC774;&#xB3C4; &#xD53C;&#xD574;&#xC790;&#xB97C; &#xD611;&#xBC15;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;. <strong>&#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8;&#xC758; &#xBA54;&#xC2DC;&#xC9C0; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD53C;&#xD574;&#xC790;&#xC758; &#xC9C0;&#xC778; &#xBAA9;&#xB85D;&#xC744; &#xCEA1;&#xCC98;&#xD55C; &#xD6C4;, &#xC131;&#xC801;&#xC778; &#xB300;&#xD654;&#xB098; &#xC601;&#xC0C1; &#xD1B5;&#xD654;&#xB97C; &#xC720;&#xB3C4;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC720;&#xCD9C;&#xD558;&#xACA0;&#xB2E4;&#xACE0; &#xD611;&#xBC15;&#xD574;&#xC694;.</strong></p>
<p>&#xC548;&#xB7A9; &#xC2DC;&#xD050;&#xB9AC;&#xD2F0; &#xC778;&#xD154;&#xB9AC;&#xC804;&#xC2A4; &#xC13C;&#xD130;&#xC5D0;&#xC11C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://asec.ahnlab.com/ko/63616/">&#xAD00;&#xB828; &#xBE14;&#xB85C;&#xADF8;</a>&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xC138;&#xC694;!</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xAD00;&#xB9AC; &#xCF58;&#xC194;(MSC)</strong></p>
<p>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xC708;&#xB3C4;&#xC6B0; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;(OS)&#xC758; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB85C;, &#xC27D;&#xAC8C; &#xB9D0;&#xD558;&#xBA74; &#xC2DC;&#xC2A4;&#xD15C; &#xAD00;&#xB9AC;&#xC790;&#xB4E4;&#xC774; &#xC27D;&#xAC8C; &#xC6B4;&#xC601;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xAE30;&#xB2A5;&#xC744; &#xBAA8;&#xC544; &#xB193;&#xC740; &#xD654;&#xBA74;</p>
<p><strong>NFT</strong></p>
<p>&#xB514;&#xC9C0;&#xD138; &#xC790;&#xC0B0;&#xC758; &#xC18C;&#xC720;&#xAD8C;&#xC744; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xAE30;&#xB85D;&#xD558;&#xC5EC; &#xC720;&#xC77C;&#xC131;&#xACFC; &#xD76C;&#xC18C;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xB294; &#xAE30;&#xC220;</p>
<p><strong>&#xC6F9;&#xC258;</strong>(Web Shell)</p>
<p>&#xC6F9; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC545;&#xC131; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB85C;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC11C;&#xBC84;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xACE0; &#xBBFC;&#xAC10;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;</p>
<p><strong>&#xBB34;&#xC791;&#xC704; &#xB300;&#xC785; &#xACF5;&#xACA9;</strong></p>
<p>&#xBAA8;&#xB4E0; &#xAC00;&#xB2A5;&#xD55C; &#xC870;&#xD569;&#xC744; &#xC2DC;&#xB3C4;&#xD574; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB098; &#xC554;&#xD638;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xB294; &#xD574;&#xD0B9; &#xAE30;&#xBC95;</p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://news.zum.com/articles/90884865">&#x201C;&#xC798;&#xD558;&#xB294; &#xC0AC;&#xC5C5; &#xB354; &#xC798;&#xD558;&#xC790;&#x201D; &#xAE00;&#xB85C;&#xBC8C; &#xBCF4;&#xC548;&#xAE30;&#xC5C5; &#xC778;&#xC218;&#xD569;&#xBCD1; &#xD589;&#xB82C;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130083&amp;direct=mobile">&#xAC00;&#xC9DC; &#xBC31;&#xC2E0; &#xC0AC;&#xC774;&#xD2B8; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xB4E4;, &#xC815;&#xBCF4; &#xD0C8;&#xCDE8;&#xD615; &#xBA40;&#xC6E8;&#xC5B4; &#xC720;&#xD3EC;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130074&amp;kind=&amp;sub_kind=">&#xC911;&#xAD6D; &#xBC30;&#xD6C4; &#xD574;&#xCEE4;&#xC870;&#xC9C1;, &#xACF5;&#xACA9; &#xD0D0;&#xC9C0;&#xB7;&#xCD94;&#xC801; &#xD53C;&#xD558;&#xB294; ORB &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD65C;&#xC6A9;&#xD574; &#xC2A4;&#xD30C;&#xC774; &#xD65C;&#xB3D9;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dt.co.kr/contents.html?article_no=2024052802109931065006&amp;ref=naver">&#x65E5; 20&#xB300; &#xB0A8;&#xC131;, AI &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC5D0; &#xC545;&#xC6A9;&#x2026;&#x201D;&#xB3C8; &#xBC8C;&#xACE0; &#xC2F6;&#xC5C8;&#xB2E4;&#x201D;</a></li>
</ul>
<h2 id="5&#xC6D4;-&#xBCF4;&#xC548;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;"><a href="#5&#xC6D4;-&#xBCF4;&#xC548;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;" class="headerlink" title="5&#xC6D4; &#xBCF4;&#xC548; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#x1F425;"></a><strong>5&#xC6D4; &#xBCF4;&#xC548; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</strong> &#x1F425;</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.pisfair.org/2024/index.html"><strong>&#xC81C;13&#xD68C; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xD398;&#xC5B4; &amp; CPO&#xC6CC;&#xD06C;&#xC20D;</strong></a> | <strong>6&#xC6D4; 4&#xC77C;(&#xD654;) ~ 5&#xC77C;(&#xC218;)</strong></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                  <a class="hover-with-bg" href="/tags/romi0x/">romi0x</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_romi0x.jpg" srcset="/img/loading.gif" alt="romi0x">
                  </div>

                  <div class="link-text">
                    <div class="link-title">romi0x</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/romi0x">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/06/05/pwndorei/2024-06-05/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-36801 : Semcmsì˜ sql injection ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/06/01/j0ker/2024-06-01/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-24919: Check Pointì‚¬ ì œí’ˆë“¤ì—ì„œ ë°œê²¬ëœ Path Traversal ì·¨ì•½ì ìœ¼ë¡œ ì¸í•œ Sensitive Information Disclosure</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/06/03/romi0x/newsletter0603/';
        this.page.identifier = '/2024/06/03/romi0x/newsletter0603/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] ì ì  ì»¤ì§€ëŠ” åŒ— í•´í‚¹ê¸°ìˆ ðŸ¤¦â€&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
