

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;Microsoft Windows Graphics Device Interface+, &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; GDI+&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD504;&amp;#xB9B0;&amp;#xD130;&amp;#xB098; &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xB514;&amp;#xC2A4;&amp;#xD50C;&amp;#xB798;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC7A5;&amp;#xCE58; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; GDI&amp;#xC640; &amp;#xC0C1;&amp;#xD638; &amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC7A5;&amp;#xCE58; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Windows &amp;#xC751;&amp;#xC6A9;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35;&amp;#xACFC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xD1B5; API &amp;#xC9D1;&amp;#xD569;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;GDI+&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC5ED;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. McAfee&amp;#xB294; Windows GDI+&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD074;&amp;#xB85C;&amp;#xC988;&amp;#xB4DC; &amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87;&amp;#xB144; &amp;#xB3D9;&amp;#xC548; GDI+&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; Microsoft&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; CVE&amp;#xB97C; &amp;#xC81C;&amp;#xACF5; &amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; CVE-2021-1665: GDI+ &amp;#xC6D0;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; root cause &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2021&amp;#xB144; 1&amp;#xC6D4;&amp;#xC5D0; Microsoft &amp;#xD328;&amp;#xCE58;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-WinAFL&#34;&gt;&lt;a href=&#34;#What-is-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;What is WinAFL?&#34;&gt;&lt;/a&gt;What is WinAFL?&lt;/h1&gt;&lt;p&gt;WinAFL&amp;#xC740; &amp;#xB110;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Linux AFL &amp;#xD37C;&amp;#xC800;&amp;#xC758; Windows &amp;#xD3EC;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xBA70; Google Project Zero&amp;#xC758; Ivan Fratric&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC720;&amp;#xC9C0; &amp;#xAD00;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; DynamoRIO&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; Instrumentation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; Harness&amp;#xB77C; &amp;#xBD88;&amp;#xB9AC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xBD88;&amp;#xACFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; Harness&amp;#xB294; WinAFL&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC81C;&amp;#xACF5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xC11D; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#x201C;Image&amp;#x2192;GetThumbnailImage&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; GDI+ &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; harness &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; GetThumbnailImage API&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC774; &amp;#xC791;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC785;&amp;#xB825; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C8; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB2E4;&amp;#xC74C; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xCD95;&amp;#xC18C;&amp;#xB41C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows &amp;#xC751;&amp;#xC6A9;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC378;&amp;#xB124;&amp;#xC77C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xD6CC;&amp;#xC735;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xBC31;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC0C1;&amp;#xD638; &amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xAC70;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; GDI+&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; GetThumbnailImage API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Collecting-Corpus&#34;&gt;&lt;a href=&#34;#Collecting-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Collecting Corpus:&#34;&gt;&lt;/a&gt;Collecting Corpus:&lt;/h1&gt;&lt;p&gt;&amp;#xC88B;&amp;#xC740; corpus&amp;#xB294; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD0C4;&amp;#xD0C4;&amp;#xD55C; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Google&amp;#xB610;&amp;#xB294; Github&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4; &amp;#xB41C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xC6A9; EMP &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCD94;&amp;#xAC00; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC5EC; &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; EMFPlusDrawString &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xAC83; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Ref: &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57&#34;&gt;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Minimizing-Corpus&#34;&gt;&lt;a href=&#34;#Minimizing-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Minimizing Corpus:&#34;&gt;&lt;/a&gt;Minimizing Corpus:&lt;/h1&gt;&lt;p&gt;&amp;#xCD08;&amp;#xAE30; corpus &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; winafl-cmin.py&amp;#xB77C;&amp;#xB294; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;winafl-cmin.py -D D:\\\\work\\\\winafl\\\\DynamoRIO\\\\bin32 -t 10000 -i inCorpus -o minCorpus -covtype edge -coverage_module gdiplus.dll -target_module gdiplus_hardik.exe -target_method fuzzMe -nargs 2 &amp;#x2014; gdiplus_hardik.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;How-does-WinAFL-work&#34;&gt;&lt;a href=&#34;#How-does-WinAFL-work&#34; class=&#34;headerlink&#34; title=&#34;How does WinAFL work?&#34;&gt;&lt;/a&gt;How does WinAFL work?&lt;/h1&gt;&lt;p&gt;WinAFL&amp;#xC740; in-memory &amp;#xD37C;&amp;#xC9D5;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; WinAFL&amp;#xC5D0; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; corpus&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC785;&amp;#xB825; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCC0;&amp;#xD615;(mutate)&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xACF5;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC0C8; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;(path)&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; path&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xC0C8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0AC;&amp;#xB840;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00; mutate &amp;#xBD80;&amp;#xD638;&amp;#xB85C; &amp;#xB300;&amp;#xAE30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xC313;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. crash&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xBA74; crashes &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB984;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/3.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-with-WinAFL&#34;&gt;&lt;a href=&#34;#Fuzzing-with-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing with WinAFL:&#34;&gt;&lt;/a&gt;Fuzzing with WinAFL:&lt;/h1&gt;&lt;p&gt;Harness &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xACE0;, corpus&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; WinAFL&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz.exe -i minCorpus -o out -D D:\\work\\winafl\\DynamoRIO\\bin32 -t 20000 &amp;#x2014;coverage_module gdiplus.dll -fuzz_iterations 5000 -target_module gdiplus_hardik.exe -target_offset 0x16e0 -nargs 2 &amp;#x2014; gdiplus_hardik.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Results&#34;&gt;&lt;a href=&#34;#Results&#34; class=&#34;headerlink&#34; title=&#34;Results:&#34;&gt;&lt;/a&gt;Results:&lt;/h1&gt;&lt;p&gt;&amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xCDA9;&amp;#xB3CC;&amp;#xACFC; &amp;#xB3C5;&amp;#xD2B9;&amp;#xD55C; &amp;#xCDA9;&amp;#xB3CC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC70;&amp;#xCE5C; &amp;#xD6C4; &amp;#x201C;gdiplus!BuiltLine::GetBaselineOffset&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; carsh&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. callstack&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; edx+8&amp;#xB85C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A8; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ebx, ecx &amp;#xBC0F; edx&amp;#xC5D0; c0c0c0c0&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD799;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; c0c0c0c0&amp;#xC774; &amp;#x201C;gdiplus!FullTextImager::RenderLine&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause&#34;&gt;&lt;a href=&#34;#Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause&#34; class=&#34;headerlink&#34; title=&#34;Patch Diffing to See If We Can Find the Root Cause&#34;&gt;&lt;/a&gt;Patch Diffing to See If We Can Find the Root Cause&lt;/h1&gt;&lt;p&gt;Root cause&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; IDA BinDiff &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD328;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;&amp;#xBA74; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD10;&amp;#xB3C4; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; gdiplus.dll &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xACFC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC84;&amp;#xC804;&amp;#xC758; IDB &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; IDA BinDiff &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC774;&amp;#xB294; BuildLine Object&amp;#xC758; &amp;#xC18C;&amp;#xBA78;&amp;#xC790;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xC131; &amp;#xC810;&amp;#xC218;&amp;#xAC00; &amp;lt; 1 &amp;#xC778;&amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xADF8;&amp;#xC911;&amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; FullTextImager::BuildAllLines &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; POC&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; break point&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. break point&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC544; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xB9CC; &amp;#xBCF4;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC67C;&amp;#xCABD;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC84;&amp;#xC804;, &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; dll&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB179;&amp;#xC0C9;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD568;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB178;&amp;#xB780;&amp;#xC0C9; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xB450; &amp;#xBC84;&amp;#xC804; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC18C;&amp;#xD55C; &amp;#xBCC0;&amp;#xACBD;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; dll &amp;#xAC04;&amp;#xC5D0; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB178;&amp;#xB780;&amp;#xC0C9; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC880;&amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC81C;&amp;#xAC70; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; patch diffing&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; root cause&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDA9;&amp;#xBD84;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; windbg&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xADC0;&amp;#xC911;&amp;#xD55C; &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; BinDiff &amp;#xCD9C;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xAD00;&amp;#xCC30; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; DLL&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xC758; &amp;#xAE4A;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#x201C;GetuntrimmedCharacterCount&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#x201C;SetSpan::SpanVector&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0;&amp;#xC11C; EAX &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#x201C;GetuntrimmedCharacterCount&amp;#x201D; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 0&amp;#xC774;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xC704;&amp;#xCE58;(BuiltLine Object&amp;#xC758; &amp;#xC18C;&amp;#xBA78;&amp;#xC790;)&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC0AC;&amp;#xD56D;&amp;#xB4E4;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; POC &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBB54;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xAC12;&amp;#xC774; &amp;#xBB54;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xC774; crash&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBCF4;&amp;#xC644;&amp;#xB418;&amp;#xC5C8;&amp;#xB098;?&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;EMF-File-Format&#34;&gt;&lt;a href=&#34;#EMF-File-Format&#34; class=&#34;headerlink&#34; title=&#34;EMF File Format:&#34;&gt;&lt;/a&gt;EMF File Format:&lt;/h1&gt;&lt;p&gt;EMF&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xC7A5;&amp;#xCE58;&amp;#xB97C; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB41C; &amp;#xBA54;&amp;#xD0C0; &amp;#xD30C;&amp;#xC77C; &amp;#xD615;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;&amp;#xC758; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC815;&amp;#xC758;, &amp;#xB3C4;&amp;#xBA74; &amp;#xBA85;&amp;#xB839; &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xADF8;&amp;#xB798;&amp;#xCE59; &amp;#xD2B9;&amp;#xC131;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB3C4;&amp;#xB9AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;EMF &amp;#xD5E4;&amp;#xB354; - EMF &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMF &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; - &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xD2B9;&amp;#xC815;, &amp;#xB3C4;&amp;#xBA74; &amp;#xC21C;&amp;#xC11C; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMFEOF &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; - EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMF &amp;#xD30C;&amp;#xC77C; &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC0AC;&amp;#xC591;&amp;#xC740; Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; URL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca&#34;&gt;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Locating-the-Vulnerable-Record-in-the-EMF-File&#34;&gt;&lt;a href=&#34;#Locating-the-Vulnerable-Record-in-the-EMF-File&#34; class=&#34;headerlink&#34; title=&#34;Locating the Vulnerable Record in the EMF File:&#34;&gt;&lt;/a&gt;Locating the Vulnerable Record in the EMF File:&lt;/h1&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; EMF&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC774; crash&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xCF30;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; Call stack&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;gdiplus!GdiPlayMetafileRecordCallback&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EDX&amp;#xC5D0; &amp;#xC77C;&amp;#xBD80; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; 00x00401c,0x00000000, 0x00000044 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; EDX&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;POC EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B; 0x15c&amp;#xC5D0; &amp;#xC18D;&amp;#xD568;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EMF &amp;#xADDC;&amp;#xACA9;&amp;#xC744; &amp;#xAC80;&amp;#xD1A0;&amp;#xD558;&amp;#xACE0; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#x201C;EmfPlusDrawString&amp;#x201D; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC784;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD615;&amp;#xC2DD;&amp;#xC740; &amp;#xB2E4;&amp;#xBBD5;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD615; = 0xeccEmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&lt;/p&gt;
&lt;p&gt;flag = 0x0000&lt;/p&gt;
&lt;p&gt;Size = 0x50&lt;/p&gt;
&lt;p&gt;Data size = 0x44&lt;/p&gt;
&lt;p&gt;Brushid = 0x02&lt;/p&gt;
&lt;p&gt;Format id = 0x01&lt;/p&gt;
&lt;p&gt;Length = 0x14&lt;/p&gt;
&lt;p&gt;Layoutrect = 00 00 00 00 00 00 00 00 FC FF C7 42 00 00 80 FF&lt;/p&gt;
&lt;p&gt;String data =&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB2E4;&amp;#xC74C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC65C; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; crash&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB514;&amp;#xBC84;&amp;#xADF8; &amp;#xD558;&amp;#xACE0; &amp;#xD559;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#x201C;gdiplus!FullTextImager::BuildAlllines&amp;#x201D;&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xB2E4;&amp;#xC774;&amp;#xC5B4;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; hierarchy&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/20.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;The-execution-flow-in-summary&#34;&gt;&lt;a href=&#34;#The-execution-flow-in-summary&#34; class=&#34;headerlink&#34; title=&#34;The execution flow in summary:&#34;&gt;&lt;/a&gt;The execution flow in summary:&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x201C;Builtline::BuildAllLines&amp;#x201D; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; 0x60 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;Buildline::BuildLine&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;Buildline::Buildline&amp;#x201D;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE30;&amp;#xACE0; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC740; &amp;#xB8E8;&amp;#xD504; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xB85C; ECX&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB8E8;&amp;#xD504;&amp;#xB294; &amp;#xB3CC;&amp;#xBA70; ECX&amp;#xAC00; string length(EAX) == 0x14&amp;#xAC00; &amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB8E8;&amp;#xD504; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; 0&amp;#xC77C; &amp;#xB54C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; 0x13&amp;#xC77C; &amp;#xB54C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#x201C;GetUntrimmedCharacterCount&amp;#x201D;&amp;#xAC00; 0&amp;#xC77C; &amp;#xB54C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;DLL&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xAC00; 0&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0; &amp;#xB8E8;&amp;#xD504;&amp;#xCE74;&amp;#xC6B4;&amp;#xD130;(ECX)&amp;#xC5D0; &amp;#xB354;&amp;#xD574;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB294; ECX&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 0x60 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. 20&amp;#xBC88; &amp;#xB3CC;&amp;#xC544;&amp;#xC57C;&amp;#xD560; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xCD1D; 21&amp;#xBC88; &amp;#xB3CC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;In-detail&#34;&gt;&lt;a href=&#34;#In-detail&#34; class=&#34;headerlink&#34; title=&#34;In detail:&#34;&gt;&lt;/a&gt;In detail:&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x201C;Builtline::BuildAllLines&amp;#x201D; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; 0x60(90) &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/21.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;BuiltLine::BuiltLine&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/22.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB294; while &amp;#xB8E8;&amp;#xD504; &amp;#xC548;&amp;#xC5D0; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC740; 0x12ff2ec&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; 1&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/23.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; ECX&amp;#xC5D0; &amp;#xB354;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/24.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;ecx&amp;#xAC00; eax&amp;#xBCF4;&amp;#xB2E4; &amp;#xC791;&amp;#xC740;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xCC38;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xACE0;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xC9C0;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/25.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC774; 0&amp;#xC77C; &amp;#xB54C; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; ECX&amp;#xC5D0; 0&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xACE0; ECX&amp;#xAC12;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; 20&amp;#xBC88; &amp;#xB3CC;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xCD1D; 21&amp;#xBC88; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xAC83;&amp;#xC774; root cause&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; POC &amp;#xD30C;&amp;#xC77C;&amp;#xC758; 0x174&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB9BC;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/26.png&#34; alt&gt;&lt;em&gt;**&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD574;&amp;#xB2F9; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC740; EmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xACE0; 0x14&amp;#xB294; &amp;#xC555;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xAE38;&amp;#xC774;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#x201C;FullTextImager::Render&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5EC; EAX &amp;#xAC12;&amp;#xC744; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#x201C;FullTextImager::RenderLine&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824; &amp;#xD560; &amp;#xB54C; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EMF file&amp;#xC18D; EmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xB54C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xB860;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAC12;&amp;#xC774; &amp;#xC624;&amp;#xC5FC;&amp;#xB418;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; path&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;How-this-issue-was-fixed&#34;&gt;&lt;a href=&#34;#How-this-issue-was-fixed&#34; class=&#34;headerlink&#34; title=&#34;How this issue was fixed?&#34;&gt;&lt;/a&gt;How this issue was fixed?&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xD328;&amp;#xCE58; diff&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xBC14;&amp;#xC640; &amp;#xAC19;&amp;#xC774;, &amp;#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xADF8; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; EBX&amp;#xC640; xor&amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xC5EC; Built object&amp;#xC758; destructor &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; destructor&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/32.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion:&#34;&gt;&lt;/a&gt;Conclusion:&lt;/h1&gt;&lt;p&gt;GDI+&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Windows &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xC218;&amp;#xC2ED;&amp;#xC5B5; &amp;#xAC1C;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE6D; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; Windows &amp;#xBC30;&amp;#xD3EC;&amp;#xB97C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;McAfee&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD074;&amp;#xB85C;&amp;#xC988;&amp;#xB4DC; &amp;#xC18C;&amp;#xC2A4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC640; &amp;#xD611;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xCC45;&amp;#xC784;&amp;#xAC10; &amp;#xC788;&amp;#xAC8C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; Microsoft&amp;#xC5D0; &amp;#xAC11;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Analyzing CVE-2021-1665 - Remote Code Execution Vulnerability in Windows GDI+ - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;Microsoft Windows Graphics Device Interface+, &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; GDI+&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD504;&amp;#xB9B0;&amp;#xD130;&amp;#xB098; &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xB514;&amp;#xC2A4;&amp;#xD50C;&amp;#xB798;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC7A5;&amp;#xCE58; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; GDI&amp;#xC640; &amp;#xC0C1;&amp;#xD638; &amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC7A5;&amp;#xCE58; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Windows &amp;#xC751;&amp;#xC6A9;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xC0C1;&amp;#xD654; &amp;#xACC4;&amp;#xCE35;&amp;#xACFC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACF5;&amp;#xD1B5; API &amp;#xC9D1;&amp;#xD569;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;GDI+&amp;#xB294; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xC5ED;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. McAfee&amp;#xB294; Windows GDI+&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD074;&amp;#xB85C;&amp;#xC988;&amp;#xB4DC; &amp;#xC18C;&amp;#xC2A4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C0;&amp;#xB09C; &amp;#xBA87;&amp;#xB144; &amp;#xB3D9;&amp;#xC548; GDI+&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; Microsoft&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; CVE&amp;#xB97C; &amp;#xC81C;&amp;#xACF5; &amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xBB3C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WinAFL&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; CVE-2021-1665: GDI+ &amp;#xC6D0;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; root cause &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2021&amp;#xB144; 1&amp;#xC6D4;&amp;#xC5D0; Microsoft &amp;#xD328;&amp;#xCE58;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;What-is-WinAFL&#34;&gt;&lt;a href=&#34;#What-is-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;What is WinAFL?&#34;&gt;&lt;/a&gt;What is WinAFL?&lt;/h1&gt;&lt;p&gt;WinAFL&amp;#xC740; &amp;#xB110;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Linux AFL &amp;#xD37C;&amp;#xC800;&amp;#xC758; Windows &amp;#xD3EC;&amp;#xB4DC; &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xBA70; Google Project Zero&amp;#xC758; Ivan Fratric&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#xC720;&amp;#xC9C0; &amp;#xAD00;&amp;#xB9AC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; DynamoRIO&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; Instrumentation&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; Harness&amp;#xB77C; &amp;#xBD88;&amp;#xB9AC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Harness&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xBD88;&amp;#xACFC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; Harness&amp;#xB294; WinAFL&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC81C;&amp;#xACF5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xC11D; &amp;#xCC98;&amp;#xB9AC;&amp;#xB41C; &amp;#x201C;Image&amp;#x2192;GetThumbnailImage&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC740; GDI+ &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xB294; harness &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; GetThumbnailImage API&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC774; &amp;#xC791;&amp;#xC740; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC785;&amp;#xB825; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C8; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB2E4;&amp;#xC74C; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC; &amp;#xCD95;&amp;#xC18C;&amp;#xB41C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows &amp;#xC751;&amp;#xC6A9;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC378;&amp;#xB124;&amp;#xC77C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xD6CC;&amp;#xC735;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xBC31;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC0C1;&amp;#xD638; &amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xAC70;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; GDI+&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; GetThumbnailImage API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Collecting-Corpus&#34;&gt;&lt;a href=&#34;#Collecting-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Collecting Corpus:&#34;&gt;&lt;/a&gt;Collecting Corpus:&lt;/h1&gt;&lt;p&gt;&amp;#xC88B;&amp;#xC740; corpus&amp;#xB294; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD0C4;&amp;#xD0C4;&amp;#xD55C; &amp;#xAE30;&amp;#xBC18;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Google&amp;#xB610;&amp;#xB294; Github&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC218;&amp;#xC9D1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4; &amp;#xB41C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xC6A9; EMP &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCD94;&amp;#xAC00; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; corpus&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xC0D8;&amp;#xD50C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xC5EC; &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; EMFPlusDrawString &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xAC83; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Ref: &lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57&#34;&gt;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Minimizing-Corpus&#34;&gt;&lt;a href=&#34;#Minimizing-Corpus&#34; class=&#34;headerlink&#34; title=&#34;Minimizing Corpus:&#34;&gt;&lt;/a&gt;Minimizing Corpus:&lt;/h1&gt;&lt;p&gt;&amp;#xCD08;&amp;#xAE30; corpus &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; winafl-cmin.py&amp;#xB77C;&amp;#xB294; &amp;#xC720;&amp;#xD2F8;&amp;#xB9AC;&amp;#xD2F0;&amp;#xB97C; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;winafl-cmin.py -D D:\\\\work\\\\winafl\\\\DynamoRIO\\\\bin32 -t 10000 -i inCorpus -o minCorpus -covtype edge -coverage_module gdiplus.dll -target_module gdiplus_hardik.exe -target_method fuzzMe -nargs 2 &amp;#x2014; gdiplus_hardik.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;How-does-WinAFL-work&#34;&gt;&lt;a href=&#34;#How-does-WinAFL-work&#34; class=&#34;headerlink&#34; title=&#34;How does WinAFL work?&#34;&gt;&lt;/a&gt;How does WinAFL work?&lt;/h1&gt;&lt;p&gt;WinAFL&amp;#xC740; in-memory &amp;#xD37C;&amp;#xC9D5;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; WinAFL&amp;#xC5D0; &amp;#xD568;&amp;#xC218;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. WinAFL&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; corpus&amp;#xC5D0;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC785;&amp;#xB825; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640; &amp;#xBCC0;&amp;#xD615;(mutate)&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xACF5;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC0C8; &amp;#xCF54;&amp;#xB4DC; &amp;#xACBD;&amp;#xB85C;(path)&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; path&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xC0C8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0AC;&amp;#xB840;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xAC00; mutate &amp;#xBD80;&amp;#xD638;&amp;#xB85C; &amp;#xB300;&amp;#xAE30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xC313;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. crash&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xBA74; crashes &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xD37C;&amp;#xC9D5; &amp;#xD504;&amp;#xB984;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/3.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Fuzzing-with-WinAFL&#34;&gt;&lt;a href=&#34;#Fuzzing-with-WinAFL&#34; class=&#34;headerlink&#34; title=&#34;Fuzzing with WinAFL:&#34;&gt;&lt;/a&gt;Fuzzing with WinAFL:&lt;/h1&gt;&lt;p&gt;Harness &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xACE0;, corpus&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0;, &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD55C; &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; WinAFL&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;afl-fuzz.exe -i minCorpus -o out -D D:\\work\\winafl\\DynamoRIO\\bin32 -t 20000 &amp;#x2014;coverage_module gdiplus.dll -fuzz_iterations 5000 -target_module gdiplus_hardik.exe -target_offset 0x16e0 -nargs 2 &amp;#x2014; gdiplus_hardik.exe @@&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;Results&#34;&gt;&lt;a href=&#34;#Results&#34; class=&#34;headerlink&#34; title=&#34;Results:&#34;&gt;&lt;/a&gt;Results:&lt;/h1&gt;&lt;p&gt;&amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xCDA9;&amp;#xB3CC;&amp;#xACFC; &amp;#xB3C5;&amp;#xD2B9;&amp;#xD55C; &amp;#xCDA9;&amp;#xB3CC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC70;&amp;#xCE5C; &amp;#xD6C4; &amp;#x201C;gdiplus!BuiltLine::GetBaselineOffset&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; carsh&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. callstack&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; edx+8&amp;#xB85C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A8; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xB824; &amp;#xD560; &amp;#xB54C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ebx, ecx &amp;#xBC0F; edx&amp;#xC5D0; c0c0c0c0&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD799;&amp;#xC774; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; c0c0c0c0&amp;#xC774; &amp;#x201C;gdiplus!FullTextImager::RenderLine&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause&#34;&gt;&lt;a href=&#34;#Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause&#34; class=&#34;headerlink&#34; title=&#34;Patch Diffing to See If We Can Find the Root Cause&#34;&gt;&lt;/a&gt;Patch Diffing to See If We Can Find the Root Cause&lt;/h1&gt;&lt;p&gt;Root cause&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; IDA BinDiff &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD328;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xB2E4;&amp;#xBA74; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD10;&amp;#xB3C4; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; gdiplus.dll &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xACFC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC84;&amp;#xC804;&amp;#xC758; IDB &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; IDA BinDiff &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xBCC0;&amp;#xACBD; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC774;&amp;#xB294; BuildLine Object&amp;#xC758; &amp;#xC18C;&amp;#xBA78;&amp;#xC790;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87;&amp;#xBA87; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; &amp;#xC720;&amp;#xC0AC;&amp;#xC131; &amp;#xC810;&amp;#xC218;&amp;#xAC00; &amp;lt; 1 &amp;#xC778;&amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xADF8;&amp;#xC911;&amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; FullTextImager::BuildAllLines &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; windbg&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xACFC; POC&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; break point&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. break point&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB354;&amp;#xC774;&amp;#xC0C1; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC548;&amp;#xD0C0;&amp;#xAE5D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC544; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xB9CC; &amp;#xBCF4;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC67C;&amp;#xCABD;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC84;&amp;#xC804;, &amp;#xC624;&amp;#xB978;&amp;#xCABD;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBC84;&amp;#xC804;&amp;#xC758; dll&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB179;&amp;#xC0C9;&amp;#xC740; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB3D9;&amp;#xC77C;&amp;#xD568;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB178;&amp;#xB780;&amp;#xC0C9; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xB450; &amp;#xBC84;&amp;#xC804; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC18C;&amp;#xD55C; &amp;#xBCC0;&amp;#xACBD;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; dll &amp;#xAC04;&amp;#xC5D0; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB178;&amp;#xB780;&amp;#xC0C9; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC880;&amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBD80; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC81C;&amp;#xAC70; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; patch diffing&amp;#xB9CC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; root cause&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDA9;&amp;#xBD84;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; windbg&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB2E4;&amp;#xB978; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xADC0;&amp;#xC911;&amp;#xD55C; &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; BinDiff &amp;#xCD9C;&amp;#xB825;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xAD00;&amp;#xCC30; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; DLL&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xC758; &amp;#xAE4A;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#x201C;GetuntrimmedCharacterCount&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#x201C;SetSpan::SpanVector&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0;&amp;#xC11C; EAX &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xB0B4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xBC18;&amp;#xD658; &amp;#xAC12;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#x201C;GetuntrimmedCharacterCount&amp;#x201D; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 0&amp;#xC774;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xC704;&amp;#xCE58;(BuiltLine Object&amp;#xC758; &amp;#xC18C;&amp;#xBA78;&amp;#xC790;)&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD328;&amp;#xCE58;&amp;#xB41C; DLL&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC74C; &amp;#xC0AC;&amp;#xD56D;&amp;#xB4E4;&amp;#xC744; &amp;#xD30C;&amp;#xC545;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; POC &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC911;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBB54;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xAC12;&amp;#xC774; &amp;#xBB54;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xC774; crash&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBCF4;&amp;#xC644;&amp;#xB418;&amp;#xC5C8;&amp;#xB098;?&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;EMF-File-Format&#34;&gt;&lt;a href=&#34;#EMF-File-Format&#34; class=&#34;headerlink&#34; title=&#34;EMF File Format:&#34;&gt;&lt;/a&gt;EMF File Format:&lt;/h1&gt;&lt;p&gt;EMF&amp;#xB294; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xC7A5;&amp;#xCE58;&amp;#xB97C; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD5A5;&amp;#xC0C1;&amp;#xB41C; &amp;#xBA54;&amp;#xD0C0; &amp;#xD30C;&amp;#xC77C; &amp;#xD615;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774;&amp;#xC758; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xC815;&amp;#xC758;, &amp;#xB3C4;&amp;#xBA74; &amp;#xBA85;&amp;#xB839; &amp;#xBC0F; &amp;#xAE30;&amp;#xD0C0; &amp;#xADF8;&amp;#xB798;&amp;#xCE59; &amp;#xD2B9;&amp;#xC131;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB3C4;&amp;#xB9AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;EMF &amp;#xD5E4;&amp;#xB354; - EMF &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMF &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; - &amp;#xADF8;&amp;#xB798;&amp;#xD53D; &amp;#xD2B9;&amp;#xC815;, &amp;#xB3C4;&amp;#xBA74; &amp;#xC21C;&amp;#xC11C; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAC00;&amp;#xBCC0; &amp;#xAE38;&amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMFEOF &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; - EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;EMF &amp;#xD30C;&amp;#xC77C; &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC0AC;&amp;#xC591;&amp;#xC740; Microsoft &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; URL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;a href=&#34;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca&#34;&gt;https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;Locating-the-Vulnerable-Record-in-the-EMF-File&#34;&gt;&lt;a href=&#34;#Locating-the-Vulnerable-Record-in-the-EMF-File&#34; class=&#34;headerlink&#34; title=&#34;Locating the Vulnerable Record in the EMF File:&#34;&gt;&lt;/a&gt;Locating the Vulnerable Record in the EMF File:&lt;/h1&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; EMF&amp;#xC758; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xD615;&amp;#xC2DD;&amp;#xC758; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; &amp;#xC190;&amp;#xC0C1;&amp;#xB41C; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xB54C;&amp;#xBB38;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC774; crash&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xCF30;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; Call stack&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;gdiplus!GdiPlayMetafileRecordCallback&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EDX&amp;#xC5D0; &amp;#xC77C;&amp;#xBD80; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xC9C0;&amp;#xC815;&amp;#xB41C; &amp;#xB9E4;&amp;#xAC1C; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; 00x00401c,0x00000000, 0x00000044 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; EDX&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;POC EMF &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B; 0x15c&amp;#xC5D0; &amp;#xC18D;&amp;#xD568;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EMF &amp;#xADDC;&amp;#xACA9;&amp;#xC744; &amp;#xAC80;&amp;#xD1A0;&amp;#xD558;&amp;#xACE0; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#x201C;EmfPlusDrawString&amp;#x201D; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC784;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC758; &amp;#xD615;&amp;#xC2DD;&amp;#xC740; &amp;#xB2E4;&amp;#xBBD5;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD615; = 0xeccEmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&lt;/p&gt;
&lt;p&gt;flag = 0x0000&lt;/p&gt;
&lt;p&gt;Size = 0x50&lt;/p&gt;
&lt;p&gt;Data size = 0x44&lt;/p&gt;
&lt;p&gt;Brushid = 0x02&lt;/p&gt;
&lt;p&gt;Format id = 0x01&lt;/p&gt;
&lt;p&gt;Length = 0x14&lt;/p&gt;
&lt;p&gt;Layoutrect = 00 00 00 00 00 00 00 00 FC FF C7 42 00 00 80 FF&lt;/p&gt;
&lt;p&gt;String data =&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;, &amp;#xB2E4;&amp;#xC74C; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC65C; &amp;#xC6B0;&amp;#xB9AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; crash&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB514;&amp;#xBC84;&amp;#xADF8; &amp;#xD558;&amp;#xACE0; &amp;#xD559;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC774; &amp;#x201C;gdiplus!FullTextImager::BuildAlllines&amp;#x201D;&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xB2E4;&amp;#xC774;&amp;#xC5B4;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; hierarchy&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/20.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;The-execution-flow-in-summary&#34;&gt;&lt;a href=&#34;#The-execution-flow-in-summary&#34; class=&#34;headerlink&#34; title=&#34;The execution flow in summary:&#34;&gt;&lt;/a&gt;The execution flow in summary:&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x201C;Builtline::BuildAllLines&amp;#x201D; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; 0x60 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;Buildline::BuildLine&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;Buildline::Buildline&amp;#x201D;&amp;#xC740; &amp;#xC0C8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE30;&amp;#xACE0; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC740; &amp;#xB8E8;&amp;#xD504; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xB85C; ECX&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB8E8;&amp;#xD504;&amp;#xB294; &amp;#xB3CC;&amp;#xBA70; ECX&amp;#xAC00; string length(EAX) == 0x14&amp;#xAC00; &amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBC18;&amp;#xBCF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB8E8;&amp;#xD504; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; 0&amp;#xC77C; &amp;#xB54C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; 0x13&amp;#xC77C; &amp;#xB54C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#x201C;GetUntrimmedCharacterCount&amp;#x201D;&amp;#xAC00; 0&amp;#xC77C; &amp;#xB54C; &amp;#xC885;&amp;#xB8CC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;DLL&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xAC00; 0&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0; &amp;#xB8E8;&amp;#xD504;&amp;#xCE74;&amp;#xC6B4;&amp;#xD130;(ECX)&amp;#xC5D0; &amp;#xB354;&amp;#xD574;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB294; ECX&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC99D;&amp;#xAC00;&amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 0x60 &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC624;&amp;#xC5FC;&amp;#xC2DC;&amp;#xCF1C; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; crash&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. 20&amp;#xBC88; &amp;#xB3CC;&amp;#xC544;&amp;#xC57C;&amp;#xD560; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xCD1D; 21&amp;#xBC88; &amp;#xB3CC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;In-detail&#34;&gt;&lt;a href=&#34;#In-detail&#34; class=&#34;headerlink&#34; title=&#34;In detail:&#34;&gt;&lt;/a&gt;In detail:&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#x201C;Builtline::BuildAllLines&amp;#x201D; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; 0x60(90) &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/21.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;BuiltLine::BuiltLine&amp;#x201D;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/22.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC774;&amp;#xB294; while &amp;#xB8E8;&amp;#xD504; &amp;#xC548;&amp;#xC5D0; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC740; 0x12ff2ec&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; 1&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/23.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; ECX&amp;#xC5D0; &amp;#xB354;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/24.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;ecx&amp;#xAC00; eax&amp;#xBCF4;&amp;#xB2E4; &amp;#xC791;&amp;#xC740;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xCC38;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB8E8;&amp;#xD504;&amp;#xB97C; &amp;#xBC18;&amp;#xBCF5;&amp;#xD558;&amp;#xACE0;, &amp;#xAC70;&amp;#xC9D3;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xC9C0;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/25.png&#34; alt&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#x201C;BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC774; 0&amp;#xC77C; &amp;#xB54C; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; ECX&amp;#xC5D0; 0&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xACE0; ECX&amp;#xAC12;&amp;#xC774; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; 20&amp;#xBC88; &amp;#xB3CC;&amp;#xC544;&amp;#xC57C; &amp;#xD560; &amp;#xB8E8;&amp;#xD504;&amp;#xAC00; &amp;#xCD1D; 21&amp;#xBC88; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xAC83;&amp;#xC774; root cause&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC740; POC &amp;#xD30C;&amp;#xC77C;&amp;#xC758; 0x174&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4DC;&amp;#xB9BC;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/26.png&#34; alt&gt;&lt;em&gt;**&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD574;&amp;#xB2F9; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC740; EmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xACE0; 0x14&amp;#xB294; &amp;#xC555;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD55C; &amp;#xAE38;&amp;#xC774;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#x201C;FullTextImager::Render&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xBA74; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5EC; EAX &amp;#xAC12;&amp;#xC744; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; &amp;#x201C;FullTextImager::RenderLine&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB824; &amp;#xD560; &amp;#xB54C; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;EMF file&amp;#xC18D; EmfPlusDrawString &amp;#xB808;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xB54C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACB0;&amp;#xB860;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&amp;#x201D;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130; &amp;#xAC12;&amp;#xC774; &amp;#xC624;&amp;#xC5FC;&amp;#xB418;&amp;#xACE0; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; path&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;How-this-issue-was-fixed&#34;&gt;&lt;a href=&#34;#How-this-issue-was-fixed&#34; class=&#34;headerlink&#34; title=&#34;How this issue was fixed?&#34;&gt;&lt;/a&gt;How this issue was fixed?&lt;/h1&gt;&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xD328;&amp;#xCE58; diff&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xD30C;&amp;#xC545;&amp;#xD55C; &amp;#xBC14;&amp;#xC640; &amp;#xAC19;&amp;#xC774;, &amp;#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xADF8; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; EBX&amp;#xC640; xor&amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xC5EC; Built object&amp;#xC758; destructor &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; destructor&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/09/05/fabu1ous/gdi/32.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;Conclusion&#34;&gt;&lt;a href=&#34;#Conclusion&#34; class=&#34;headerlink&#34; title=&#34;Conclusion:&#34;&gt;&lt;/a&gt;Conclusion:&lt;/h1&gt;&lt;p&gt;GDI+&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Windows &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xC218;&amp;#xC2ED;&amp;#xC5B5; &amp;#xAC1C;&amp;#xC758; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCE6D; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; Windows &amp;#xBC30;&amp;#xD3EC;&amp;#xB97C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;McAfee&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xBC0F; &amp;#xD074;&amp;#xB85C;&amp;#xC988;&amp;#xB4DC; &amp;#xC18C;&amp;#xC2A4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xACF5;&amp;#xAE09;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC640; &amp;#xD611;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xCC45;&amp;#xC784;&amp;#xAC10; &amp;#xC788;&amp;#xAC8C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; Microsoft&amp;#xC5D0; &amp;#xAC11;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/09/05/fabu1ous/gdi/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/09/05/fabu1ous/gdi/">

  <title>[Translation] Analyzing CVE-2021-1665 - Remote Code Execution Vulnerability in Windows GDI+ - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-09-05 14:00" pubdate>
      2021 9 5 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      78
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Analyzing CVE-2021-1665 - Remote Code Execution Vulnerability in Windows GDI+</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>Microsoft Windows Graphics Device Interface+, &#xC904;&#xC5EC;&#xC11C; GDI+&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD504;&#xB9B0;&#xD130;&#xB098; &#xBE44;&#xB514;&#xC624; &#xB514;&#xC2A4;&#xD50C;&#xB798;&#xC774; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xADF8;&#xB798;&#xD53D; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. Windows &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC7A5;&#xCE58; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; &#xAC19;&#xC740; &#xADF8;&#xB798;&#xD53D; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC5D0; &#xC9C1;&#xC811; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; GDI&#xC640; &#xC0C1;&#xD638; &#xC791;&#xC6A9;&#xD558;&#xC5EC; &#xC7A5;&#xCE58; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; Windows &#xC751;&#xC6A9;&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB300;&#xD55C; &#xCD94;&#xC0C1;&#xD654; &#xACC4;&#xCE35;&#xACFC; &#xBAA8;&#xB4E0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xACF5;&#xD1B5; API &#xC9D1;&#xD569;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>GDI+&#xB294; &#xBCF5;&#xC7A1;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB2E4;&#xC591;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB41C; &#xC5ED;&#xC0AC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. McAfee&#xB294; Windows GDI+&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xBC0F; &#xD074;&#xB85C;&#xC988;&#xB4DC; &#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC9D5;&#xD569;&#xB2C8;&#xB2E4;. &#xC9C0;&#xB09C; &#xBA87;&#xB144; &#xB3D9;&#xC548; GDI+&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xB2E4;&#xC591;&#xD55C; Windows &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xC5D0;&#xC11C; Microsoft&#xC5D0; &#xB2E4;&#xC591;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xBCF4;&#xACE0;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC704;&#xD55C; CVE&#xB97C; &#xC81C;&#xACF5; &#xBC1B;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAC8C;&#xC2DC;&#xBB3C;&#xC5D0;&#xC11C;&#xB294; WinAFL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810; &#xC911; &#xD558;&#xB098;&#xC778; CVE-2021-1665: GDI+ &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; root cause &#xBD84;&#xC11D;&#xC5D0; &#xB300;&#xD574; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; 2021&#xB144; 1&#xC6D4;&#xC5D0; Microsoft &#xD328;&#xCE58;&#xB85C; &#xD574;&#xACB0;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="What-is-WinAFL"><a href="#What-is-WinAFL" class="headerlink" title="What is WinAFL?"></a>What is WinAFL?</h1><p>WinAFL&#xC740; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; Linux AFL &#xD37C;&#xC800;&#xC758; Windows &#xD3EC;&#xB4DC; &#xBC84;&#xC804;&#xC774;&#xBA70; Google Project Zero&#xC758; Ivan Fratric&#xC5D0; &#xC758;&#xD574; &#xC720;&#xC9C0; &#xAD00;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;. WinAFL&#xC740; DynamoRIO&#xB97C; &#xD1B5;&#xD55C; &#xBC14;&#xC774;&#xB108;&#xB9AC; Instrumentation&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; Harness&#xB77C; &#xBD88;&#xB9AC;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC694;&#xAD6C;&#xD569;&#xB2C8;&#xB2E4;. Harness&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xD37C;&#xC9D5;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xB2E8;&#xC21C;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xBD88;&#xACFC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xD76C;&#xAC00; &#xC0AC;&#xC6A9;&#xD560; Harness&#xB294; WinAFL&#xACFC; &#xD568;&#xAED8; &#xC81C;&#xACF5;&#xB429;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xC8FC;&#xC11D; &#xCC98;&#xB9AC;&#xB41C; &#x201C;Image&#x2192;GetThumbnailImage&#x201D; &#xCF54;&#xB4DC;&#xB97C; &#xD65C;&#xC131;&#xD654;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; GDI+ &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xB294; harness &#xCF54;&#xB4DC;&#xC640; GetThumbnailImage API&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xBCF4;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; &#xC774; &#xC791;&#xC740; &#xCF54;&#xB4DC;&#xB294; &#xC81C;&#xACF5;&#xB41C; &#xC785;&#xB825; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC0C8; &#xC774;&#xBBF8;&#xC9C0; &#xAC1D;&#xCCB4;&#xB97C; &#xB9CC;&#xB4E0; &#xB2E4;&#xC74C; &#xB610; &#xB2E4;&#xB978; &#xAE30;&#xB2A5;&#xC744; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xCD95;&#xC18C;&#xB41C; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC591;&#xD55C; Windows &#xC751;&#xC6A9;&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC378;&#xB124;&#xC77C; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB294; &#xC544;&#xC8FC; &#xD6CC;&#xC735;&#xD55C; &#xACF5;&#xACA9; &#xBC31;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC0AC;&#xC6A9;&#xC790; &#xC0C1;&#xD638; &#xC791;&#xC6A9;&#xC774; &#xAC70;&#xC758; &#xD544;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBBC0;&#xB85C; GDI+&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; GetThumbnailImage API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xCDE8;&#xC57D;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Collecting-Corpus"><a href="#Collecting-Corpus" class="headerlink" title="Collecting Corpus:"></a>Collecting Corpus:</h1><p>&#xC88B;&#xC740; corpus&#xB294; &#xD37C;&#xC9D5;&#xC744; &#xC704;&#xD55C; &#xD0C4;&#xD0C4;&#xD55C; &#xAE30;&#xBC18;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. Google&#xB610;&#xB294; Github&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC218;&#xC9D1;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xB2E4;&#xB978; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD574; &#xB9B4;&#xB9AC;&#xC2A4; &#xB41C; &#xB2E4;&#xC591;&#xD55C; &#xACF5;&#xC6A9; EMP &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xCD94;&#xAC00; &#xD14C;&#xC2A4;&#xD2B8; corpus&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Microsoft &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB41C; &#xC0D8;&#xD50C; &#xCF54;&#xB4DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xC5EC; &#xBA87; &#xAC1C;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xCF54;&#xB4DC;&#xB294; EMFPlusDrawString &#xBC0F; &#xAE30;&#xD0C0; &#xB808;&#xCF54;&#xB4DC;&#xB85C; EMF &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD55C; &#xAC83; &#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/2.png" srcset="/img/loading.gif" alt></p>
<p>Ref: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57">https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emfplus/07bda2af-7a5d-4c0b-b996-30326a41fa57</a></p>
<h1 id="Minimizing-Corpus"><a href="#Minimizing-Corpus" class="headerlink" title="Minimizing Corpus:"></a>Minimizing Corpus:</h1><p>&#xCD08;&#xAE30; corpus &#xD30C;&#xC77C;&#xC744; &#xC218;&#xC9D1;&#xD55C; &#xD6C4;&#xC5D0;&#xB294; &#xCD5C;&#xC18C;&#xD654;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574; winafl-cmin.py&#xB77C;&#xB294; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xB97C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">winafl-cmin.py -D D:\\\\work\\\\winafl\\\\DynamoRIO\\\\bin32 -t 10000 -i inCorpus -o minCorpus -covtype edge -coverage_module gdiplus.dll -target_module gdiplus_hardik.exe -target_method fuzzMe -nargs 2 &#x2014; gdiplus_hardik.exe @@</code></pre>
<h1 id="How-does-WinAFL-work"><a href="#How-does-WinAFL-work" class="headerlink" title="How does WinAFL work?"></a>How does WinAFL work?</h1><p>WinAFL&#xC740; in-memory &#xD37C;&#xC9D5;&#xC774;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; WinAFL&#xC5D0; &#xD568;&#xC218;&#xBA85;&#xC744; &#xC81C;&#xACF5;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. WinAFL&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0C1;&#xD0DC;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xACE0; corpus&#xC5D0;&#xC11C; &#xD558;&#xB098;&#xC758; &#xC785;&#xB825; &#xD30C;&#xC77C;&#xC744; &#xAC00;&#xC838;&#xC640; &#xBCC0;&#xD615;(mutate)&#xC2DC;&#xD0A4;&#xACE0; &#xD568;&#xC218;&#xC5D0; &#xACF5;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC0C8; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;(path)&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xAC70;&#xB098; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD569;&#xB2C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; path&#xB97C; &#xCC3E;&#xC73C;&#xBA74; &#xC0C8; &#xD30C;&#xC77C;&#xC744; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xC0AC;&#xB840;&#xB85C; &#xAC04;&#xC8FC;&#xD558;&#xACE0; &#xCD94;&#xAC00; mutate &#xBD80;&#xD638;&#xB85C; &#xB300;&#xAE30;&#xC5F4;&#xC5D0; &#xC313;&#xC2B5;&#xB2C8;&#xB2E4;. crash&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xBA74; crashes &#xD3F4;&#xB354;&#xC5D0; crash&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xADF8;&#xB9BC;&#xC740; &#xD37C;&#xC9D5; &#xD504;&#xB984;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/3.png" srcset="/img/loading.gif" alt></p>
<h1 id="Fuzzing-with-WinAFL"><a href="#Fuzzing-with-WinAFL" class="headerlink" title="Fuzzing with WinAFL:"></a>Fuzzing with WinAFL:</h1><p>Harness &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xACE0;, corpus&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xACE0;, &#xCD5C;&#xC18C;&#xD654;&#xD55C; &#xD6C4;&#xC5D0;&#xB294; &#xC544;&#xB798; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; WinAFL&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD37C;&#xC9D5; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">afl-fuzz.exe -i minCorpus -o out -D D:\\work\\winafl\\DynamoRIO\\bin32 -t 20000 &#x2014;coverage_module gdiplus.dll -fuzz_iterations 5000 -target_module gdiplus_hardik.exe -target_offset 0x16e0 -nargs 2 &#x2014; gdiplus_hardik.exe @@</code></pre>
<h1 id="Results"><a href="#Results" class="headerlink" title="Results:"></a>Results:</h1><p>&#xBA87; &#xBC88;&#xC758; &#xCDA9;&#xB3CC;&#xACFC; &#xB3C5;&#xD2B9;&#xD55C; &#xCDA9;&#xB3CC; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xAC70;&#xCE5C; &#xD6C4; &#x201C;gdiplus!BuiltLine::GetBaselineOffset&#x201D;&#xC5D0;&#xC11C; carsh&#xB97C; &#xBC1C;&#xACAC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. callstack&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704;&#xC758; &#xC774;&#xBBF8;&#xC9C0;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4EF;&#xC774; edx+8&#xB85C; &#xAC00;&#xB9AC;&#xD0A8; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC73C;&#xB824; &#xD560; &#xB54C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC911;&#xB2E8;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. ebx, ecx &#xBC0F; edx&#xC5D0; c0c0c0c0&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xD398;&#xC774;&#xC9C0; &#xD799;&#xC774; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; c0c0c0c0&#xC774; &#x201C;gdiplus!FullTextImager::RenderLine&#x201D; &#xD568;&#xC218;&#xC5D0; &#xB9E4;&#xAC1C; &#xBCC0;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause"><a href="#Patch-Diffing-to-See-If-We-Can-Find-the-Root-Cause" class="headerlink" title="Patch Diffing to See If We Can Find the Root Cause"></a>Patch Diffing to See If We Can Find the Root Cause</h1><p>Root cause&#xB97C; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC704;&#xD574; IDA BinDiff &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD328;&#xCE58; &#xD30C;&#xC77C;&#xC758; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B4;&#xC774; &#xC88B;&#xB2E4;&#xBA74; &#xBCC0;&#xACBD;&#xB41C; &#xCF54;&#xB4DC;&#xB9CC; &#xBD10;&#xB3C4; &#xC6D0;&#xC778;&#xC744; &#xC27D;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; gdiplus.dll &#xD328;&#xCE58;&#xB41C; &#xBC84;&#xC804;&#xACFC; &#xD328;&#xCE58;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBC84;&#xC804;&#xC758; IDB &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD55C; &#xB2E4;&#xC74C; IDA BinDiff &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xBCC0;&#xACBD; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD328;&#xCE58;&#xAC00; &#xC801;&#xC6A9;&#xB41C; &#xD30C;&#xC77C;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xB2A5;&#xC774; &#xD558;&#xB098; &#xCD94;&#xAC00;&#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xC774;&#xB294; BuildLine Object&#xC758; &#xC18C;&#xBA78;&#xC790;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA87;&#xBA87; &#xD568;&#xC218;&#xB4E4;&#xC758; &#xC720;&#xC0AC;&#xC131; &#xC810;&#xC218;&#xAC00; &lt; 1 &#xC778;&#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xACE0; &#xADF8;&#xC911;&#xD558;&#xB098;&#xAC00; &#xBC14;&#xB85C; FullTextImager::BuildAllLines &#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; &#xC774; &#xD568;&#xC218;&#xAC00; &#xD328;&#xCE58;&#xB41C; &#xD568;&#xC218;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574; windbg&#xC5D0;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; POC&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC774; &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD55C; break point&#xB97C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. break point&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xB354;&#xC774;&#xC0C1; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC74C;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/7.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBCC0;&#xACBD;&#xB41C; &#xD568;&#xC218;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xD568;&#xC218;&#xC758; &#xD750;&#xB984; &#xADF8;&#xB798;&#xD504;&#xB97C; &#xD655;&#xC778;&#xD574; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC548;&#xD0C0;&#xAE5D;&#xAC8C;&#xB3C4; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC774; &#xB108;&#xBB34; &#xB9CE;&#xC544; &#xCC28;&#xC774;&#xC810;&#xB9CC; &#xBCF4;&#xACE0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xC67C;&#xCABD;&#xC740; &#xD328;&#xCE58;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBC84;&#xC804;, &#xC624;&#xB978;&#xCABD;&#xC740; &#xD328;&#xCE58;&#xB41C; &#xBC84;&#xC804;&#xC758; dll&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xB179;&#xC0C9;&#xC740; &#xD328;&#xCE58;&#xB41C; &#xBE14;&#xB85D;&#xACFC; &#xD328;&#xCE58;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBE14;&#xB85D;&#xC774; &#xB3D9;&#xC77C;&#xD568;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB178;&#xB780;&#xC0C9; &#xBE14;&#xB85D;&#xC740; &#xB450; &#xBC84;&#xC804; &#xC0AC;&#xC774;&#xC5D0; &#xC0AC;&#xC18C;&#xD55C; &#xBCC0;&#xACBD;&#xC810;&#xC774; &#xC788;&#xC744;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xBE68;&#xAC04; &#xBE14;&#xB85D;&#xC740; dll &#xAC04;&#xC5D0; &#xCC28;&#xC774;&#xC810;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xB178;&#xB780;&#xC0C9; &#xBE14;&#xB85D;&#xC744; &#xC880;&#xB354; &#xC790;&#xC138;&#xD788; &#xB4E4;&#xC5EC;&#xB2E4; &#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA87; &#xAC00;&#xC9C0; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD328;&#xCE58;&#xB41C; DLL&#xC5D0;&#xC11C; &#xC77C;&#xBD80; &#xBE14;&#xB85D;&#xC774; &#xC81C;&#xAC70; &#xB418;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C; patch diffing&#xB9CC;&#xC73C;&#xB85C;&#xB294; &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC758; root cause&#xB97C; &#xC2DD;&#xBCC4;&#xD558;&#xAE30;&#xC5D0; &#xCDA9;&#xBD84;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; windbg&#xC640; &#xAC19;&#xC740; &#xB2E4;&#xB978; &#xB514;&#xBC84;&#xAE45; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xBB34;&#xC5C7;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xADC0;&#xC911;&#xD55C; &#xD78C;&#xD2B8;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC704;&#xC758; BinDiff &#xCD9C;&#xB825;&#xC5D0;&#xC11C; &#xBA87; &#xAC00;&#xC9C0; &#xAD00;&#xCC30; &#xACB0;&#xACFC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xD328;&#xCE58;&#xB418;&#xC9C0; &#xC54A;&#xC740; DLL&#xC5D0;&#xC11C; &#xC8FC;&#xC758; &#xAE4A;&#xAC8C; &#xD655;&#xC778;&#xD558;&#xBA74; &#x201C;GetuntrimmedCharacterCount&#x201D; &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD55C; &#xD638;&#xCD9C;&#xC774; &#xC788;&#xACE0; &#xB098;&#xC911;&#xC5D0; &#x201C;SetSpan::SpanVector&#x201D;&#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD328;&#xCE58;&#xB41C; DLL&#xC5D0;&#xC11C; EAX &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xB0B4;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xBC18;&#xD658; &#xAC12;&#xC744; &#xBCF4;&#xBA74; &#x201C;GetuntrimmedCharacterCount&#x201D; &#xD638;&#xCD9C;&#xC774; &#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. 0&#xC774;&#xBA74; &#xCEE8;&#xD2B8;&#xB864;&#xC774; &#xB2E4;&#xB978; &#xC704;&#xCE58;(BuiltLine Object&#xC758; &#xC18C;&#xBA78;&#xC790;)&#xB85C; &#xC810;&#xD504;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xCF54;&#xB4DC;&#xB294; &#xD328;&#xCE58;&#xB41C; DLL&#xC5D0; &#xC0C8;&#xB85C; &#xCD94;&#xAC00;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><img src="/2021/09/05/fabu1ous/gdi/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC5EC;&#xAE30;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xD574;&#xACB0;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xB2E4;&#xC74C; &#xC0AC;&#xD56D;&#xB4E4;&#xC744; &#xD30C;&#xC545;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xC81C;&#xACF5;&#xB41C; POC &#xD30C;&#xC77C;&#xACFC; &#xD568;&#xAED8; &#xC6B0;&#xB9AC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC911;&#xB2E8;&#xB418;&#xB294; &#xC774;&#xC720;&#xB294; &#xBB54;&#xAC00;?</li>
<li>&#xD30C;&#xC77C;&#xC758; &#xC5B4;&#xB5A4; &#xD544;&#xB4DC;&#xC5D0; &#xC758;&#xD574; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xAC00;?</li>
<li>&#xD544;&#xB4DC;&#xC758; &#xAC12;&#xC774; &#xBB54;&#xAC00;?</li>
<li>&#xC774; crash&#xB97C; &#xC77C;&#xC73C;&#xD0A4;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC870;&#xAC74;&#xC740; &#xBB34;&#xC5C7;&#xC778;&#xAC00;?</li>
<li>&#xC5B4;&#xB5BB;&#xAC8C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBCF4;&#xC644;&#xB418;&#xC5C8;&#xB098;?</li>
</ol>
<h1 id="EMF-File-Format"><a href="#EMF-File-Format" class="headerlink" title="EMF File Format:"></a>EMF File Format:</h1><p>EMF&#xB294; &#xADF8;&#xB798;&#xD53D; &#xC774;&#xBBF8;&#xC9C0; &#xC7A5;&#xCE58;&#xB97C; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD5A5;&#xC0C1;&#xB41C; &#xBA54;&#xD0C0; &#xD30C;&#xC77C; &#xD615;&#xC2DD;&#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. EMF &#xD30C;&#xC77C;&#xC740; &#xAC00;&#xBCC0; &#xAE38;&#xC774;&#xC758; &#xB2E4;&#xC591;&#xD55C; &#xB808;&#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xADF8;&#xB798;&#xD53D; &#xAC1D;&#xCCB4;&#xC758; &#xC815;&#xC758;, &#xB3C4;&#xBA74; &#xBA85;&#xB839; &#xBC0F; &#xAE30;&#xD0C0; &#xADF8;&#xB798;&#xCE59; &#xD2B9;&#xC131;&#xC774; &#xD3EC;&#xD568;&#xB3C4;&#xB9AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; EMF &#xD30C;&#xC77C;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xB808;&#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>EMF &#xD5E4;&#xB354; - EMF &#xAD6C;&#xC870;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>EMF &#xB808;&#xCF54;&#xB4DC; - &#xADF8;&#xB798;&#xD53D; &#xD2B9;&#xC815;, &#xB3C4;&#xBA74; &#xC21C;&#xC11C; &#xB4F1;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xAC00;&#xBCC0; &#xAE38;&#xC774; &#xB808;&#xCF54;&#xB4DC;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>EMFEOF &#xB808;&#xCF54;&#xB4DC; - EMF &#xD30C;&#xC77C;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xB808;&#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>EMF &#xD30C;&#xC77C; &#xD615;&#xC2DD;&#xC758; &#xC790;&#xC138;&#xD55C; &#xC0AC;&#xC591;&#xC740; Microsoft &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xB2E4;&#xC74C; URL&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca">https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-emf/91c257d7-c39d-4a36-9b1f-63e3f73d30ca</a></p>
<h1 id="Locating-the-Vulnerable-Record-in-the-EMF-File"><a href="#Locating-the-Vulnerable-Record-in-the-EMF-File" class="headerlink" title="Locating the Vulnerable Record in the EMF File:"></a>Locating the Vulnerable Record in the EMF File:</h1><p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; EMF&#xC758; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBB38;&#xC81C;&#xB294; &#xC798;&#xBABB;&#xB41C; &#xD615;&#xC2DD;&#xC758; &#xB808;&#xCF54;&#xB4DC;&#xB098; &#xC190;&#xC0C1;&#xB41C; &#xB808;&#xCF54;&#xB4DC; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xB808;&#xCF54;&#xB4DC; &#xD0C0;&#xC785;&#xC774; &#xC774; crash&#xB97C; &#xC77C;&#xC73C;&#xCF30;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xB0B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574; Call stack&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/12.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;gdiplus!GdiPlayMetafileRecordCallback&#x201D;&#xC5D0; &#xB300;&#xD55C; &#xD638;&#xCD9C;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/13.png" srcset="/img/loading.gif" alt></p>
<p>&#xD574;&#xB2F9; &#xD568;&#xC218;&#xC5D0; break point&#xB97C; &#xAC78;&#xACE0; &#xB9E4;&#xAC1C; &#xBCC0;&#xC218;&#xB97C; &#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC0AC;&#xC2E4;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/14.png" srcset="/img/loading.gif" alt></p>
<p>EDX&#xC5D0; &#xC77C;&#xBD80; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xC774; &#xAE30;&#xB2A5;&#xC5D0; &#xC9C0;&#xC815;&#xB41C; &#xB9E4;&#xAC1C; &#xBCC0;&#xC218;&#xB294; 00x00401c,0x00000000, 0x00000044 &#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C; EDX&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/15.png" srcset="/img/loading.gif" alt></p>
<p>POC EMF &#xD30C;&#xC77C;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74; &#xC774; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD30C;&#xC77C;&#xC758; &#xC624;&#xD504;&#xC14B; 0x15c&#xC5D0; &#xC18D;&#xD568;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/16.png" srcset="/img/loading.gif" alt></p>
<p>EMF &#xADDC;&#xACA9;&#xC744; &#xAC80;&#xD1A0;&#xD558;&#xACE0; &#xB808;&#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xC774; &#xB808;&#xCF54;&#xB4DC;&#xAC00; &#x201C;EmfPlusDrawString&#x201D; &#xB808;&#xCF54;&#xB4DC;&#xC784;&#xC744; &#xC27D;&#xAC8C; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB808;&#xCF54;&#xB4DC;&#xC758; &#xD615;&#xC2DD;&#xC740; &#xB2E4;&#xBBD5;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/17.png" srcset="/img/loading.gif" alt></p>
<p>&#xC6B0;&#xB9AC;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB808;&#xCF54;&#xB4DC; &#xC720;&#xD615; = 0xeccEmfPlusDrawString &#xB808;&#xCF54;&#xB4DC;</p>
<p>flag = 0x0000</p>
<p>Size = 0x50</p>
<p>Data size = 0x44</p>
<p>Brushid = 0x02</p>
<p>Format id = 0x01</p>
<p>Length = 0x14</p>
<p>Layoutrect = 00 00 00 00 00 00 00 00 FC FF C7 42 00 00 80 FF</p>
<p>String data =</p>
<p><img src="/2021/09/05/fabu1ous/gdi/18.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; crash&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xB808;&#xCF54;&#xB4DC;&#xB97C; &#xCC3E;&#xC558;&#xC73C;&#xB2C8;, &#xB2E4;&#xC74C; &#xBB38;&#xC81C;&#xB294; &#xC65C; &#xC6B0;&#xB9AC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; crash&#xB098;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xB0B4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xB97C; &#xB514;&#xBC84;&#xADF8; &#xD558;&#xACE0; &#xD559;&#xC778;&#xD558;&#xBA74; &#xCEE8;&#xD2B8;&#xB864;&#xC774; &#x201C;gdiplus!FullTextImager::BuildAlllines&#x201D;&#xC774; &#xB3C4;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/19.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C; &#xB2E4;&#xC774;&#xC5B4;&#xADF8;&#xB7A8;&#xC740; &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC758; hierarchy&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/20.png" srcset="/img/loading.gif" alt></p>
<h1 id="The-execution-flow-in-summary"><a href="#The-execution-flow-in-summary" class="headerlink" title="The execution flow in summary:"></a>The execution flow in summary:</h1><ol>
<li>&#x201C;Builtline::BuildAllLines&#x201D; &#xD568;&#xC218; &#xB0B4;&#xBD80;&#xC5D0; 0x60 &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xB294; &#xB8E8;&#xD504;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xB2E4;&#xC74C; &#x201C;Buildline::BuildLine&#x201D;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#x201C;Buildline::Buildline&#x201D;&#xC740; &#xC0C8;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC62E;&#xAE30;&#xACE0; &#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xC758; &#xB9AC;&#xD134; &#xAC12;&#xC740; &#xB8E8;&#xD504; &#xCE74;&#xC6B4;&#xD2B8;&#xB85C; ECX&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xB8E8;&#xD504;&#xB294; &#xB3CC;&#xBA70; ECX&#xAC00; string length(EAX) == 0x14&#xAC00; &#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB8E8;&#xD504; &#xCE74;&#xC6B4;&#xD2B8;&#xAC00; 0&#xC77C; &#xB54C; &#xC2DC;&#xC791;&#xD574; 0x13&#xC77C; &#xB54C; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#x201C;GetUntrimmedCharacterCount&#x201D;&#xAC00; 0&#xC77C; &#xB54C; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>DLL&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xD574;&#xB2F9; &#xB8E8;&#xD504;&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC885;&#xB8CC;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xAC00; 0&#xC744; &#xBC18;&#xD658;&#xD558;&#xACE0; &#xB8E8;&#xD504;&#xCE74;&#xC6B4;&#xD130;(ECX)&#xC5D0; &#xB354;&#xD574;&#xC9C0;&#xB294;&#xB370;, &#xC774;&#xB294; ECX&#xC758; &#xAC12;&#xC744; &#xC99D;&#xAC00;&#xC2DC;&#xD0A4;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. 0x60 &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xACE0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC624;&#xC5FC;&#xC2DC;&#xCF1C; &#xB098;&#xC911;&#xC5D0; crash&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. 20&#xBC88; &#xB3CC;&#xC544;&#xC57C;&#xD560; &#xB8E8;&#xD504;&#xAC00; &#xCD1D; 21&#xBC88; &#xB3CC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
<h1 id="In-detail"><a href="#In-detail" class="headerlink" title="In detail:"></a>In detail:</h1><ol>
<li>&#x201C;Builtline::BuildAllLines&#x201D; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; 0x60(90) &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/09/05/fabu1ous/gdi/21.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>&#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#x201C;BuiltLine::BuiltLine&#x201D;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xC0C8;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC62E;&#xAE41;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/09/05/fabu1ous/gdi/22.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>&#xC774;&#xB294; while &#xB8E8;&#xD504; &#xC548;&#xC5D0; &#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC740; 0x12ff2ec&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4DC;&#xC2DC; &#xD574;&#xB2F9; &#xAC12;&#xC740; 1&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/09/05/fabu1ous/gdi/23.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>&#xD574;&#xB2F9; &#xAC12;&#xC740; ECX&#xC5D0; &#xB354;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/09/05/fabu1ous/gdi/24.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>ecx&#xAC00; eax&#xBCF4;&#xB2E4; &#xC791;&#xC740;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC0AC;&#xAC00; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xCC38;&#xC774;&#xB77C;&#xBA74; &#xB8E8;&#xD504;&#xB97C; &#xBC18;&#xBCF5;&#xD558;&#xACE0;, &#xAC70;&#xC9D3;&#xC774;&#xB77C;&#xBA74; &#xB2E4;&#xB978; &#xC9C0;&#xC810;&#xC73C;&#xB85C; &#xC810;&#xD504;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2021/09/05/fabu1ous/gdi/25.png" srcset="/img/loading.gif" alt></p>
<ol>
<li>&#xCDE8;&#xC57D;&#xC810; &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; &#x201C;BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC774; 0&#xC77C; &#xB54C; &#xB8E8;&#xD504;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; ECX&#xC5D0; 0&#xC774; &#xCD94;&#xAC00;&#xB418;&#xACE0; ECX&#xAC12;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xC9C0; &#xC54A;&#xC74C;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; 20&#xBC88; &#xB3CC;&#xC544;&#xC57C; &#xD560; &#xB8E8;&#xD504;&#xAC00; &#xCD1D; 21&#xBC88; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC774;&#xAC83;&#xC774; root cause&#xC785;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xB610;&#xD55C; &#xC57D;&#xAC04;&#xC758; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD558;&#xBA74; &#xD574;&#xB2F9; &#xAC12;&#xC740; POC &#xD30C;&#xC77C;&#xC758; 0x174&#xB85C; &#xBD80;&#xD130; &#xC77D;&#xC5B4;&#xB4DC;&#xB9BC;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/26.png" srcset="/img/loading.gif" alt><em>**</em></p>
<p>&#xC804;&#xC5D0;&#xB3C4; &#xD655;&#xC778;&#xD588;&#xB4DC;&#xC2DC; &#xD574;&#xB2F9; &#xC624;&#xD504;&#xC14B;&#xC740; EmfPlusDrawString &#xB808;&#xCF54;&#xB4DC;&#xC774;&#xACE0; 0x14&#xB294; &#xC555;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xAE38;&#xC774;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB098;&#xC911;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#x201C;FullTextImager::Render&#x201D;&#xD568;&#xC218;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xBD80;&#xD130; &#xAC12;&#xC744; &#xC77D;&#xC5B4;&#xB4E4;&#xC5EC; EAX &#xAC12;&#xC744; &#xC190;&#xC0C1;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/27.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB294; &#x201C;FullTextImager::RenderLine&#x201D;&#xD568;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xACE0;</p>
<p><img src="/2021/09/05/fabu1ous/gdi/28.png" srcset="/img/loading.gif" alt></p>
<p>&#xB098;&#xC911;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB97C; &#xC811;&#xADFC;&#xD558;&#xB824; &#xD560; &#xB54C; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/29.png" srcset="/img/loading.gif" alt></p>
<p>EMF file&#xC18D; EmfPlusDrawString &#xB808;&#xCF54;&#xB4DC;&#xB97C; &#xCC98;&#xB9AC;&#xD560;&#xB54C; &#xC798;&#xBABB;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xC811;&#xADFC;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xBA74;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xACB0;&#xB860;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&#x201D;&#xD568;&#xC218;&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xB808;&#xC9C0;&#xC2A4;&#xD130; &#xAC12;&#xC774; &#xC624;&#xC5FC;&#xB418;&#xACE0; &#xC798;&#xBABB;&#xB41C; path&#xB85C; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC774; &#xB3C4;&#xB2EC;&#xD558;&#xAC8C; &#xB418;&#xC5B4; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="How-this-issue-was-fixed"><a href="#How-this-issue-was-fixed" class="headerlink" title="How this issue was fixed?"></a>How this issue was fixed?</h1><p>&#xC704;&#xC758; &#xD328;&#xCE58; diff&#xB97C; &#xBCF4;&#xACE0; &#xD30C;&#xC545;&#xD55C; &#xBC14;&#xC640; &#xAC19;&#xC774;, &#x201C;gdiplus!BuiltLine::GetUntrimmedCharacterCount&#x201D; &#xD568;&#xC218;&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC744; &#xACB0;&#xC815;&#xD558;&#xB294; &#xB8E8;&#xD2F4;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/30.png" srcset="/img/loading.gif" alt></p>
<p>&#xB9CC;&#xC57D; &#xADF8; &#xAC12;&#xC774; 0&#xC774;&#xB77C;&#xBA74; EBX&#xC640; xor&#xC5F0;&#xC0B0;&#xC744; &#xD558;&#xC5EC; Built object&#xC758; destructor &#xC8FC;&#xC18C;&#xB85C; &#xC810;&#xD504;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/31.png" srcset="/img/loading.gif" alt></p>
<p>&#xC544;&#xB798;&#xB294; destructor&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/09/05/fabu1ous/gdi/32.png" srcset="/img/loading.gif" alt></p>
<h1 id="Conclusion"><a href="#Conclusion" class="headerlink" title="Conclusion:"></a>Conclusion:</h1><p>GDI+&#xB294; &#xB9E4;&#xC6B0; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; Windows &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC774;&#xBA70;, &#xC774;&#xC640; &#xAC19;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC804; &#xC138;&#xACC4; &#xC218;&#xC2ED;&#xC5B5; &#xAC1C;&#xC758; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE6D; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC801;&#xC808;&#xD55C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xACE0; Windows &#xBC30;&#xD3EC;&#xB97C; &#xCD5C;&#xC2E0; &#xC0C1;&#xD0DC;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>McAfee&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xBC0F; &#xD074;&#xB85C;&#xC988;&#xB4DC; &#xC18C;&#xC2A4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC9D5;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xACF5;&#xAE09;&#xC5C5;&#xCCB4;&#xC640; &#xD611;&#xB825;&#xD558;&#xC5EC; &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xCC45;&#xC784;&#xAC10; &#xC788;&#xAC8C; &#xACF5;&#xAC1C;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xACE0; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xB9B4;&#xB9AC;&#xC2A4;&#xD560; &#xC218; &#xC788;&#xB294; &#xC801;&#xC808;&#xD55C; &#xC2DC;&#xAC04;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xACE0; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xB9B4;&#xB9AC;&#xC2A4;&#xD574;&#xC8FC;&#xC2E0; Microsoft&#xC5D0; &#xAC11;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/cve/">cve</a>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/fuzzing/">fuzzing</a>
                  
                  <a class="hover-with-bg" href="/tags/winafl/">winafl</a>
                  
                  <a class="hover-with-bg" href="/tags/harness/">harness</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-bounty/">bug bounty</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/09/07/fabu1ous/2021-09-07/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] NetGear D7000 Authentication bypass</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/09/04/j0ker/2021-09-04/">
                    <span class="hidden-mobile">[] A deep-dive into the SolarWinds Serv-U SSH vulnerability</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/09/05/fabu1ous/gdi/';
        this.page.identifier = '/2021/09/05/fabu1ous/gdi/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Analyzing CVE-2021-1665 - Remote Code Execution Vulnerability in Windows GDI+&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
