

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/security/blog/2022/04/05/new-security-features-for-windows-11-will-help-protect-hybrid-work/&#34;&gt;New security features for Windows 11 will help protect hybrid work&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Windows 11&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;&amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC778; &amp;#xD32C;&amp;#xB370;&amp;#xBBF9; &amp;#xC18D; &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC740; &amp;#xD45C;&amp;#xC801;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2021&amp;#xB144; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; Windows, Azure, Microsoft 365, Microsoft Defender&amp;#xC5D0;&amp;#xC11C; 96&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;, 357&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xD53C;&amp;#xC2F1; &amp;#xBC0F; &amp;#xC545;&amp;#xC131; &amp;#xBA54;&amp;#xC77C;, 256&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xC7AC;&amp;#xD0B9;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBCC0;&amp;#xD654;&amp;#xB97C; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windows 11&amp;#xC758; &amp;#xD5A5;&amp;#xD6C4; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xACB0;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &amp;#xCE69;&amp;#xBD80;&amp;#xD130; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB420; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAE30;&amp;#xBC18; &amp;#xC81C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBCF4;&amp;#xC548;: Microsoft Pluton&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TPM 2.0, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; ID &amp;#xBCF4;&amp;#xD638;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; Windows 11&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC2E4;&amp;#xB9AC;&amp;#xCF58; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778; &lt;a href=&#34;https://www.microsoft.com/ko-kr/security/business/zero-trust?rtc=1&#34;&gt;Zero Trust&lt;/a&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; OS&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Microsoft Pluton&lt;/em&gt;&amp;#xC740; CPU&amp;#xC640; OS&amp;#xB97C; &amp;#xD1B5;&amp;#xD569;&amp;#xD568;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Windows &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; Windows Update&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xBCF4;&amp;#xC548; &amp;#xBC0F; &amp;#xAE30;&amp;#xB2A5; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC720;&amp;#xC9C0; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xB4F1;&amp;#xC758; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Windows Hello&amp;#xC640; Bitlocker&amp;#xB97C; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xD300;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC5EC; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC5D0; &amp;#xC790;&amp;#xBD80;&amp;#xC2EC;&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xADF8; &amp;#xC774;&amp;#xC0C1;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA70; CPU&amp;#xC5D0; &amp;#xD1B5;&amp;#xD569;&amp;#xB418;&amp;#xC5B4; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xACA9; &amp;#xB610;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC571; &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xC5C6;&amp;#xB294; &amp;#xC571; &amp;#xBCF4;&amp;#xC548;: Smart App Control&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; Windows &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; Windows 11 &amp;#xBCF4;&amp;#xC548; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xAC1C;&amp;#xC120; &amp;#xC0AC;&amp;#xD56D; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Smart App Control&lt;/em&gt;&amp;#xC740; &amp;#xC774;&amp;#xC804;&amp;#xC758; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5; &amp;#xC774;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; OS&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AI&amp;#xC640; &amp;#xD568;&amp;#xAED8; Code Signing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &lt;em&gt;Smart App Control&lt;/em&gt;&amp;#xC740; Microsoft Cloud &amp;#xB0B4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xC2E0;&amp;#xB8B0; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xACC4;&amp;#xC815; &amp;#xBC0F; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;Microsoft Defender SmartScreen&lt;/em&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xD53C;&amp;#xC2F1; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5; &amp;#xD5A5;&amp;#xC0C1;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;Microsoft Defender SmartScreen&lt;/em&gt;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; Windows&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xD53C;&amp;#xC2F1; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774;&amp;#xB098; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xB54C; &amp;#xACBD;&amp;#xACE0;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;Credential Guard&lt;/em&gt; &amp;#xAE30;&amp;#xBCF8; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Windows 11&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xAE30;&amp;#xBC18; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;em&gt;pass-the-hash&lt;/em&gt;&amp;#xB098; &lt;em&gt;pass-the-ticket&lt;/em&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xC220;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;LSA(Local Security Authority)&lt;/em&gt; &amp;#xAE30;&amp;#xBCF8; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;LSA&lt;/em&gt;&amp;#xB294; Windows &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0; &amp;#xAC00;&amp;#xC785;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Windows 11 &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00; LSA &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xCEE4;&amp;#xC758; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85; &amp;#xB3C4;&amp;#xC6A9;&amp;#xC774; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xACC4;&amp;#xCE35; &amp;#xCD94;&amp;#xAC00;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Windows 11&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC1C;&amp;#xC778; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4;&amp;#xC6A9; Windows Hello&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Config Lock&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBCF4;&amp;#xD638;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&amp;#xD574;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; MDM(Mobile Device Management) &amp;#xC815;&amp;#xCC45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC900;&amp;#xC744; &amp;#xC9C0;&amp;#xD0A4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Config Lock&lt;/em&gt;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;HVCI&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCC28;&amp;#xB2E8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;HVCI(Hypervisor-Protected Code Integrity)&lt;/em&gt;&amp;#xAC00; &amp;#xAC1C;&amp;#xC120;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Windows 11&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; OS&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xBA70; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCC28;&amp;#xB2E8; &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; WDAC(Windows Defender Application Control)&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; APT &amp;#xBC0F; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] New security features for Windows 11 will help protect hybrid work - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/security/blog/2022/04/05/new-security-features-for-windows-11-will-help-protect-hybrid-work/&#34;&gt;New security features for Windows 11 will help protect hybrid work&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Windows 11&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;&amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC778; &amp;#xD32C;&amp;#xB370;&amp;#xBBF9; &amp;#xC18D; &amp;#xC0AC;&amp;#xBB34;&amp;#xC2E4;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB0A8;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC218;&amp;#xB9CE;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC740; &amp;#xD45C;&amp;#xC801;&amp;#xC744; &amp;#xBC14;&amp;#xAFE8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 2021&amp;#xB144; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; Windows, Azure, Microsoft 365, Microsoft Defender&amp;#xC5D0;&amp;#xC11C; 96&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;, 357&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xD53C;&amp;#xC2F1; &amp;#xBC0F; &amp;#xC545;&amp;#xC131; &amp;#xBA54;&amp;#xC77C;, 256&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xD558;&amp;#xC774;&amp;#xC7AC;&amp;#xD0B9;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBCC0;&amp;#xD654;&amp;#xB97C; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Windows 11&amp;#xC758; &amp;#xD5A5;&amp;#xD6C4; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC640; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xACB0;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &amp;#xCE69;&amp;#xBD80;&amp;#xD130; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB420; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xBA70;, &amp;#xC774;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAE30;&amp;#xBC18; &amp;#xC81C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB7EC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xBCF4;&amp;#xC548;: Microsoft Pluton&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TPM 2.0, &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; ID &amp;#xBCF4;&amp;#xD638;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC9C1;&amp;#xC811; &amp;#xC811;&amp;#xADFC;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xBE44;&amp;#xB86F;&amp;#xD55C; Windows 11&amp;#xC758; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBC0F; &amp;#xC2E4;&amp;#xB9AC;&amp;#xCF58; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778; &lt;a href=&#34;https://www.microsoft.com/ko-kr/security/business/zero-trust?rtc=1&#34;&gt;Zero Trust&lt;/a&gt;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; OS&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Microsoft Pluton&lt;/em&gt;&amp;#xC740; CPU&amp;#xC640; OS&amp;#xB97C; &amp;#xD1B5;&amp;#xD569;&amp;#xD568;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Windows &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; Windows Update&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xC8FC;&amp;#xC694; &amp;#xBCF4;&amp;#xC548; &amp;#xBC0F; &amp;#xAE30;&amp;#xB2A5; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;. &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC720;&amp;#xC9C0; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xC678;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xB4F1;&amp;#xC758; &amp;#xCE68;&amp;#xD22C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; Windows Hello&amp;#xC640; Bitlocker&amp;#xB97C; &amp;#xC791;&amp;#xC5C5;&amp;#xD55C; &amp;#xD300;&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xC5EC; &amp;#xC131;&amp;#xB2A5;&amp;#xACFC; &amp;#xC548;&amp;#xC815;&amp;#xC131;&amp;#xC5D0; &amp;#xC790;&amp;#xBD80;&amp;#xC2EC;&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xC801;&amp;#xD654;&amp;#xB41C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xADF8; &amp;#xC774;&amp;#xC0C1;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA70; CPU&amp;#xC5D0; &amp;#xD1B5;&amp;#xD569;&amp;#xB418;&amp;#xC5B4; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xACA9; &amp;#xB610;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC571; &amp;#xC2A4;&amp;#xD1A0;&amp;#xC5B4; &amp;#xC5C6;&amp;#xB294; &amp;#xC571; &amp;#xBCF4;&amp;#xC548;: Smart App Control&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xC11C;&amp;#xBA85;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; Windows &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; Windows 11 &amp;#xBCF4;&amp;#xC548; &amp;#xBAA8;&amp;#xB378;&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xAC1C;&amp;#xC120; &amp;#xC0AC;&amp;#xD56D; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Smart App Control&lt;/em&gt;&amp;#xC740; &amp;#xC774;&amp;#xC804;&amp;#xC758; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5; &amp;#xC774;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; OS&amp;#xC758; &amp;#xC8FC;&amp;#xC694; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AI&amp;#xC640; &amp;#xD568;&amp;#xAED8; Code Signing&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &lt;em&gt;Smart App Control&lt;/em&gt;&amp;#xC740; Microsoft Cloud &amp;#xB0B4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xC2E0;&amp;#xB8B0; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xB418;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xACC4;&amp;#xC815; &amp;#xBC0F; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;Microsoft Defender SmartScreen&lt;/em&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xD53C;&amp;#xC2F1; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5; &amp;#xD5A5;&amp;#xC0C1;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;Microsoft Defender SmartScreen&lt;/em&gt;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; Windows&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xD53C;&amp;#xC2F1; &amp;#xD0D0;&amp;#xC9C0; &amp;#xBC0F; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774;&amp;#xB098; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xB54C; &amp;#xACBD;&amp;#xACE0;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;Credential Guard&lt;/em&gt; &amp;#xAE30;&amp;#xBCF8; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Windows 11&amp;#xC740; &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654; &amp;#xAE30;&amp;#xBC18; &amp;#xBCF4;&amp;#xC548;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &lt;em&gt;pass-the-hash&lt;/em&gt;&amp;#xB098; &lt;em&gt;pass-the-ticket&lt;/em&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xC220;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xBCF4;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB9C9;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;em&gt;LSA(Local Security Authority)&lt;/em&gt; &amp;#xAE30;&amp;#xBCF8; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC548;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;LSA&lt;/em&gt;&amp;#xB294; Windows &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xCEE4;&amp;#xAC00; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xB3C4;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0; &amp;#xAC00;&amp;#xC785;&amp;#xB41C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Windows 11 &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00; LSA &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xCEE4;&amp;#xC758; &amp;#xC790;&amp;#xACA9; &amp;#xC99D;&amp;#xBA85; &amp;#xB3C4;&amp;#xC6A9;&amp;#xC774; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xACC4;&amp;#xCE35; &amp;#xCD94;&amp;#xAC00;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Windows 11&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAC1C;&amp;#xC778; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB85C;&amp;#xADF8;&amp;#xC778;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4;&amp;#xC6A9; Windows Hello&amp;#xB85C; &amp;#xC778;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Config Lock&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xBCF4;&amp;#xD638;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC548; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC744; &amp;#xAD6C;&amp;#xCD95;&amp;#xD574;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; MDM(Mobile Device Management) &amp;#xC815;&amp;#xCC45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAE30;&amp;#xC900;&amp;#xC744; &amp;#xC9C0;&amp;#xD0A4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Config Lock&lt;/em&gt;&amp;#xC774; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC124;&amp;#xC815;&amp;#xC744; &amp;#xAE30;&amp;#xC5C5;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;HVCI&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCC28;&amp;#xB2E8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;HVCI(Hypervisor-Protected Code Integrity)&lt;/em&gt;&amp;#xAC00; &amp;#xAC1C;&amp;#xC120;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Windows 11&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; OS&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xBA70; &amp;#xBCF4;&amp;#xC548; &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCC28;&amp;#xB2E8; &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; WDAC(Windows Defender Application Control)&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; APT &amp;#xBC0F; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2022/04/24/idioth/2022-04-24/">

  <title>[하루한줄] New security features for Windows 11 will help protect hybrid work - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2022-04-24 18:00" pubdate>
      2022년 4월 24일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.3k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      26
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] New security features for Windows 11 will help protect hybrid work</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.microsoft.com/security/blog/2022/04/05/new-security-features-for-windows-11-will-help-protect-hybrid-work/">New security features for Windows 11 will help protect hybrid work</a></p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>Windows 11</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xC138;&#xACC4;&#xC801;&#xC778; &#xD32C;&#xB370;&#xBBF9; &#xC18D; &#xC0AC;&#xBB34;&#xC2E4;&#xC774; &#xC544;&#xB2CC; &#xACF5;&#xAC04;&#xC5D0;&#xC11C; &#xC77C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC77C;&#xC5B4;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xC218;&#xB9CE;&#xC740; &#xD574;&#xCEE4;&#xB4E4;&#xC740; &#xD45C;&#xC801;&#xC744; &#xBC14;&#xAFE8;&#xC2B5;&#xB2C8;&#xB2E4;. 2021&#xB144; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xB294; Windows, Azure, Microsoft 365, Microsoft Defender&#xC5D0;&#xC11C; 96&#xC5B5; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xC545;&#xC131;&#xCF54;&#xB4DC;, 357&#xC5B5; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xD53C;&#xC2F1; &#xBC0F; &#xC545;&#xC131; &#xBA54;&#xC77C;, 256&#xC5B5; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xD558;&#xC774;&#xC7AC;&#xD0B9;&#xC744; &#xCC28;&#xB2E8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xD654;&#xB97C; &#xB9C9;&#xAE30; &#xC704;&#xD574; Windows 11&#xC758; &#xD5A5;&#xD6C4; &#xB9B4;&#xB9AC;&#xC2A4;&#xC5D0;&#xC11C; &#xCD5C;&#xC2E0; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC640; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xACB0;&#xD569;&#xD558;&#xC5EC; &#xCE69;&#xBD80;&#xD130; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xAE4C;&#xC9C0; &#xB9CE;&#xC740; &#xBCF4;&#xD638; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xBCF4;&#xC548; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xAC00; &#xC9C4;&#xD589;&#xB420; &#xC608;&#xC815;&#xC774;&#xBA70;, &#xC774;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xAE30;&#xBC18; &#xC81C;&#xB85C; &#xD2B8;&#xB7EC;&#xC2A4;&#xD2B8; &#xBCF4;&#xC548;: Microsoft Pluton</strong></p>
<p>TPM 2.0, &#xD38C;&#xC6E8;&#xC5B4; &#xBC0F; ID &#xBCF4;&#xD638;, &#xBA54;&#xBAA8;&#xB9AC; &#xC9C1;&#xC811; &#xC811;&#xADFC;, &#xBA54;&#xBAA8;&#xB9AC; &#xBB34;&#xACB0;&#xC131; &#xBCF4;&#xD638;&#xB97C; &#xBE44;&#xB86F;&#xD55C; Windows 11&#xC758; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xBC0F; &#xC2E4;&#xB9AC;&#xCF58; &#xC9C0;&#xC6D0; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC778; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.microsoft.com/ko-kr/security/business/zero-trust?rtc=1">Zero Trust</a>&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; OS&#xC758; &#xD575;&#xC2EC; &#xC601;&#xC5ED;&#xC744; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><em>Microsoft Pluton</em>&#xC740; CPU&#xC640; OS&#xB97C; &#xD1B5;&#xD569;&#xD568;&#xC5D0; &#xB530;&#xB978; &#xC8FC;&#xC694; &#xAE30;&#xB2A5;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>Windows &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; Windows Update&#xB97C; &#xD1B5;&#xD574; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xC8FC;&#xC694; &#xBCF4;&#xC548; &#xBC0F; &#xAE30;&#xB2A5; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xAC00; &#xAC00;&#xB2A5;&#xD55C; &#xBCF4;&#xC548; &#xD504;&#xB85C;&#xC138;&#xC11C;. &#xD38C;&#xC6E8;&#xC5B4; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xC704;&#xD55C; &#xC791;&#xC5C5; &#xD544;&#xC694; &#xC5C6;&#xC774; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xCD5C;&#xC2E0; &#xBCF4;&#xC548; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC720;&#xC9C0; &#xAC00;&#xB2A5;</li>
<li>&#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; &#xB4F1;&#xC758; &#xCE68;&#xD22C; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xACE0; Windows Hello&#xC640; Bitlocker&#xB97C; &#xC791;&#xC5C5;&#xD55C; &#xD300;&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xD558;&#xC5EC; &#xC131;&#xB2A5;&#xACFC; &#xC548;&#xC815;&#xC131;&#xC5D0; &#xC790;&#xBD80;&#xC2EC;</li>
<li>&#xCD5C;&#xC801;&#xD654;&#xB41C; &#xD38C;&#xC6E8;&#xC5B4; &#xADF8; &#xC774;&#xC0C1;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xBA70; CPU&#xC5D0; &#xD1B5;&#xD569;&#xB418;&#xC5B4; &#xBB3C;&#xB9AC;&#xC801;&#xC778; &#xACF5;&#xACA9; &#xB610;&#xD55C; &#xBCF4;&#xD638;</li>
</ol>
<p><strong>&#xC571; &#xC2A4;&#xD1A0;&#xC5B4; &#xC5C6;&#xB294; &#xC571; &#xBCF4;&#xC548;: Smart App Control</strong></p>
<p>&#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xAC70;&#xB098; &#xC11C;&#xBA85;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xCC28;&#xB2E8;&#xD558;&#xB294; Windows &#xC7A5;&#xCE58;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC545;&#xC131; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xD558;&#xB294; Windows 11 &#xBCF4;&#xC548; &#xBAA8;&#xB378;&#xC758; &#xC8FC;&#xC694; &#xAC1C;&#xC120; &#xC0AC;&#xD56D; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><em>Smart App Control</em>&#xC740; &#xC774;&#xC804;&#xC758; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xBCF4;&#xD638; &#xAE30;&#xB2A5; &#xC774;&#xC0C1;&#xC73C;&#xB85C; OS&#xC758; &#xC8FC;&#xC694; &#xBD80;&#xBD84;&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. AI&#xC640; &#xD568;&#xAED8; Code Signing&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; <em>Smart App Control</em>&#xC740; Microsoft Cloud &#xB0B4; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xC2E0;&#xB8B0; AI &#xBAA8;&#xB378;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC548;&#xC804;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xB418;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB9CC; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xACC4;&#xC815; &#xBC0F; &#xC790;&#xACA9; &#xC99D;&#xBA85; &#xBCF4;&#xC548; &#xAC15;&#xD654;</strong></p>
<ul>
<li><em>Microsoft Defender SmartScreen</em>&#xC744; &#xD1B5;&#xD55C; &#xD53C;&#xC2F1; &#xD0D0;&#xC9C0; &#xBC0F; &#xBCF4;&#xD638; &#xAE30;&#xB2A5; &#xD5A5;&#xC0C1;</li>
</ul>
<p><em>Microsoft Defender SmartScreen</em>&#xACFC; &#xD568;&#xAED8; Windows&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; &#xD53C;&#xC2F1; &#xD0D0;&#xC9C0; &#xBC0F; &#xBCF4;&#xD638; &#xAE30;&#xB2A5;&#xC774; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC545;&#xC131; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774;&#xB098; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xC790;&#xACA9; &#xC99D;&#xBA85;&#xC744; &#xC785;&#xB825;&#xD560; &#xB54C; &#xACBD;&#xACE0;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xD53C;&#xC2F1; &#xACF5;&#xACA9;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><em>Credential Guard</em> &#xAE30;&#xBCF8; &#xD65C;&#xC131;&#xD654;</li>
</ul>
<p>Windows 11&#xC740; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xAC00;&#xC0C1;&#xD654; &#xAE30;&#xBC18; &#xBCF4;&#xC548;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; <em>pass-the-hash</em>&#xB098; <em>pass-the-ticket</em> &#xAC19;&#xC740; &#xC790;&#xACA9; &#xC99D;&#xBA85;&#xC744; &#xD0C8;&#xCDE8;&#xD558;&#xB294; &#xACF5;&#xACA9; &#xAE30;&#xC220;&#xB85C;&#xBD80;&#xD130; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xD575;&#xC2EC; &#xC601;&#xC5ED;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB9C9;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><em>LSA(Local Security Authority)</em> &#xAE30;&#xBCF8; &#xD65C;&#xC131;&#xD654;&#xB97C; &#xD1B5;&#xD55C; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xBCF4;&#xC548;</li>
</ul>
<p><em>LSA</em>&#xB294; Windows &#xB85C;&#xADF8;&#xC778;&#xACFC; &#xC0AC;&#xC6A9;&#xC790; &#xC778;&#xC99D;&#xC744; &#xB2F4;&#xB2F9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xCEE4;&#xAC00; &#xC790;&#xACA9; &#xC99D;&#xBA85;&#xC744; &#xB3C4;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xAE30;&#xC5C5;&#xC5D0; &#xAC00;&#xC785;&#xB41C; &#xC0C8;&#xB85C;&#xC6B4; Windows 11 &#xC7A5;&#xCE58;&#xC5D0; &#xCD94;&#xAC00; LSA &#xBCF4;&#xD638;&#xAC00; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC11C;&#xBA85;&#xB41C; &#xCF54;&#xB4DC;&#xB9CC; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xC5EC; &#xD574;&#xCEE4;&#xC758; &#xC790;&#xACA9; &#xC99D;&#xBA85; &#xB3C4;&#xC6A9;&#xC774; &#xC5B4;&#xB835;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xBCF4;&#xC548; &#xACC4;&#xCE35; &#xCD94;&#xAC00;&#xB97C; &#xD1B5;&#xD55C; &#xAC1C;&#xC778; &#xB370;&#xC774;&#xD130; &#xC554;&#xD638;&#xD654;</strong></p>
<p>Windows 11&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xAC1C;&#xC778; &#xB370;&#xC774;&#xD130; &#xC554;&#xD638;&#xD654;&#xB294; &#xC7A5;&#xCE58;&#xC5D0; &#xB85C;&#xADF8;&#xC778;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC744; &#xB54C; &#xD30C;&#xC77C;&#xACFC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBE44;&#xC988;&#xB2C8;&#xC2A4;&#xC6A9; Windows Hello&#xB85C; &#xC778;&#xC99D;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>Config Lock&#xC744; &#xD1B5;&#xD55C; &#xAC1C;&#xC778; &#xC0AC;&#xC6A9;&#xC790; &#xBCF4;&#xD638;</strong></p>
<p>&#xBCF4;&#xC548; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xAD6C;&#xCD95;&#xD574;&#xB3C4; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBCF4;&#xC548; &#xC124;&#xC815;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; MDM(Mobile Device Management) &#xC815;&#xCC45;&#xC744; &#xD1B5;&#xD574; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xC5EC; &#xAE30;&#xC5C5;&#xC774; &#xC124;&#xC815;&#xD55C; &#xBCF4;&#xC548; &#xAE30;&#xC900;&#xC744; &#xC9C0;&#xD0A4;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><em>Config Lock</em>&#xC774; &#xBCF4;&#xC548; &#xC124;&#xC815; &#xBCC0;&#xACBD;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xBCF4;&#xC548; &#xC124;&#xC815;&#xC744; &#xAE30;&#xC5C5;&#xC774; &#xC124;&#xC815;&#xD55C; &#xAC12;&#xC73C;&#xB85C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBCF5;&#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>HVCI&#xB97C; &#xD1B5;&#xD55C; &#xCDE8;&#xC57D;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCC28;&#xB2E8;</strong></p>
<p><em>HVCI(Hypervisor-Protected Code Integrity)</em>&#xAC00; &#xAC1C;&#xC120;&#xB429;&#xB2C8;&#xB2E4;. Windows 11&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC7A5;&#xCE58;&#xC5D0;&#xC11C; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xB2F9; &#xAE30;&#xB2A5;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB429;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xAE30;&#xB2A5;&#xC744; &#xD1B5;&#xD574; &#xBAA8;&#xB4E0; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; OS&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xBA70; &#xBCF4;&#xC548; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xC54C;&#xB824;&#xC9C4; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xCC28;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCC28;&#xB2E8; &#xBAA9;&#xB85D;&#xC740; WDAC(Windows Defender Application Control)&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xD1B5;&#xD55C; APT &#xBC0F; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xCC28;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/microsoft/">microsoft</a>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/security/">security</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2022/05/15/syru/cve-2022-27608/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2022-27608: DLP 보안 솔루션 강제 비활성화 및 권한 상승 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2022/04/03/l0ch/2022-04-03/">
                    <span class="hidden-mobile">[하루한줄] CVE-2022-22965: Spring 프레임워크의 Spring4Shell 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2022/04/24/idioth/2022-04-24/';
        this.page.identifier = '/2022/04/24/idioth/2022-04-24/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] New security features for Windows 11 will help protect hybrid work&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
