

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;br&gt;&amp;#xC644;&amp;#xC5F0;&amp;#xD55C; &amp;#xBD04;&amp;#xC774; &amp;#xBC9A;&amp;#xAF43;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC800;&amp;#xBB3C;&amp;#xACE0; &amp;#xD478;&amp;#xB987;&amp;#xD478;&amp;#xB987;&amp;#xD55C;.. &amp;#xC2DC;&amp;#xD5D8;&amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xB124;&amp;#xC694; &amp;#x1F979;&lt;br&gt;&amp;#xC2DC;&amp;#xD5D8; &amp;#xACF5;&amp;#xBD80;&amp;#xC5D0; &amp;#xC9C0;&amp;#xCE60; &amp;#xB54C;! &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC74; &amp;#xC5B4;&amp;#xB5A4;&amp;#xAC00;&amp;#xC694;? &amp;#x1F9D0;&lt;br&gt;&amp;#xC2DC;&amp;#xD5D8;&amp;#xAE30;&amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8;&amp;#xD574;&amp;#xC694;!&amp;#x1F423;&amp;#x1F425;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/strong&gt;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x2708;&amp;#xFE0F; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.15 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128844&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;?! &amp;#x1F440; &lt;del&gt;&amp;#xC800;&amp;#xC694; &amp;#x270B;&amp;#x1F3FB;&lt;/del&gt;&lt;br&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC6A9; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!! &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xB454; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;(exe, bin &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xCC3D;&amp;#xC774; &amp;#xB728;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#x26A0;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2018;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;pyzw&lt;/a&gt;&amp;#x2019;&lt;/strong&gt; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xAC00; &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xCCA0;&amp;#xC790; &amp;#xC624;&amp;#xB958;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#x2018;&lt;strong&gt;pywz&amp;#x2019;&lt;/strong&gt;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xCC3D; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1F631; &amp;#xB610;, pyzw &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;strong&gt;&amp;#x2018;video/mp4&amp;#x2019; MIME &amp;#xC720;&amp;#xD615;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC;, &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xD55C; &amp;#xC21C;&amp;#xAC04;.. &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026;&amp;#x1FAE0; &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xD604;&amp;#xC7AC;&amp;#xB294; pyzw &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#x2018;.untrusted&amp;#x2019; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC;, &amp;#xC5F4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;&amp;#x1F60E; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD655;&amp;#xC7A5;&amp;#xC790; &amp;#xD655;&amp;#xC778;&amp;#xACFC; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC778; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&lt;/a&gt;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/security/telegram-fixes-windows-app-zero-day-used-to-launch-python-scripts/?&amp;amp;web_view=true#google_vignette&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &amp;#xC138;&amp;#xACC4;&amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xAE30;&amp;#xC220;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;(WDTA), &amp;#xAD6D;&amp;#xC81C; AI &amp;#xBCF4;&amp;#xC548; &amp;#xD45C;&amp;#xC900; &amp;#xBC1C;&amp;#xD45C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.17 | Zdnet Korea | &lt;a href=&#34;https://zdnet.co.kr/view/?no=20240418015506&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;4&amp;#xC6D4; 17&amp;#xC77C; &amp;#xC2A4;&amp;#xC704;&amp;#xC2A4; &amp;#xC81C;&amp;#xB124;&amp;#xBC14;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB9B0; &amp;#xC81C;27&amp;#xCC28; &amp;#xC720;&amp;#xC5D4;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xD68C;&amp;#xC758;&amp;#xC5D0;&amp;#xC11C; &amp;#xC138;&amp;#xACC4;&amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xAE30;&amp;#xC220;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;(WDTA)&amp;#xB294; &amp;#x2018;&amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#x2019;&amp;#xC640; &amp;#x2018;LLM &amp;#xBAA8;&amp;#xB378; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#x2019; &amp;#xB4F1; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAD6D;&amp;#xC81C; &amp;#xD45C;&amp;#xC900;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1F632; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xD45C;&amp;#xC900;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;LLM &amp;#xBAA8;&amp;#xB378;&lt;/a&gt; &amp;#xBC0F; &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; AI &amp;#xBCF4;&amp;#xC548; &amp;#xD3C9;&amp;#xAC00; &amp;#xBC0F; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC18C;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D;&amp;#xACFC; &amp;#xC911;&amp;#xAD6D; &amp;#xAE30;&amp;#xC5C5;&amp;#xC778; &amp;#xC624;&amp;#xD508;AI, &amp;#xAD6C;&amp;#xAE00;, &amp;#xBA54;&amp;#xD0C0;, &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;, &amp;#xC5D4;&amp;#xBE44;&amp;#xB514;&amp;#xC544;, &amp;#xC544;&amp;#xB9C8;&amp;#xC874;, &amp;#xC54C;&amp;#xB9AC;&amp;#xBC14;&amp;#xBC14;&amp;#xADF8;&amp;#xB8F9;&amp;#xC758; &amp;#xC564;&amp;#xD2B8;&amp;#xADF8;&amp;#xB8F9;, &amp;#xC544;&amp;#xC774;&amp;#xD50C;&amp;#xB77C;&amp;#xC774;&amp;#xD14D;, &amp;#xBC14;&amp;#xC774;&amp;#xB450;, &amp;#xD150;&amp;#xC13C;&amp;#xD2B8;, &amp;#xC624;&amp;#xD3EC;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC84;&amp;#xD074;&amp;#xB9AC;&amp;#xB300; &amp;#xB4F1; &amp;#xC218;&amp;#xC2ED; &amp;#xAC1C; &amp;#xAE30;&amp;#xC5C5; &amp;#xBC0F; &amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xAC00; &amp;#xACF5;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.wdtacademy.org/&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; GitHub&amp;#xC758; &amp;#xAC80;&amp;#xC0C9; &amp;#xAE30;&amp;#xB2A5; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xD37C;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.13 | SecurityAffairs | &lt;a href=&#34;https://securityaffairs.com/161792/cyber-crime/githubs-search-results-distribute-malware.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;GitHub&amp;#xC5D0;&amp;#xC11C; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xB8CC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;? &amp;#x1F9D0;&lt;br&gt;&amp;#xB9CC;&amp;#xC57D;.. &amp;#xC774; &amp;#xAC80;&amp;#xC0C9; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xBA74;..?! &amp;#x1F631;&amp;#x1FAE0;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; GitHub Actions&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xB0A0;&amp;#xC9DC;&amp;#xC640; &amp;#xC2DC;&amp;#xAC04; &amp;#xB610;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC791;&amp;#xC740; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xC5EC;, &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC790;&amp;#xC8FC; Repository&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, Star&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xB839; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xB294; &amp;#xB4F1; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC18D;&amp;#xC600;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x2026;&amp;#x1F627;&lt;br&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC18D;&amp;#xC778; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C;  Repository&amp;#xC758; &amp;#x2019;&lt;strong&gt;.csproj&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;.vcxproj&amp;#x2019;&lt;/strong&gt; &amp;#xD30C;&amp;#xC77C;(Visual Studio &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;) &amp;#xB0B4;&amp;#xC5D0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC228;&amp;#xACBC;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; Repository&amp;#xC778;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC758;&amp;#xB97C; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;&amp;#x1F630;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &amp;#xC815;&amp;#xBD80;, S-BOM &amp;#xBCF4;&amp;#xC548; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778; &amp;#xBC1C;&amp;#xD45C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.18 | Zdnet Korea | &lt;a href=&#34;https://zdnet.co.kr/view/?no=20240418174503&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;SBOM!&amp;#x1F330; &amp;#xB2E4;&amp;#xB4E4; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;SBOM&amp;#xC740; &lt;strong&gt;S&lt;/strong&gt;oftware &lt;strong&gt;B&lt;/strong&gt;ill &lt;strong&gt;O&lt;/strong&gt;f &lt;strong&gt;M&lt;/strong&gt;aterials&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &lt;strong&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/strong&gt;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD574;&amp;#xC694;!&lt;br&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2019;&amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xD45C;&amp;#x2019;&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C;&amp;#xB370;&amp;#xC694;.&lt;br&gt;&amp;#xD310;&amp;#xB9E4;&amp;#xC790;(&amp;#xACF5;&amp;#xAE09;&amp;#xC790;)&amp;#xB294; &amp;#xC798; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xC744; &amp;#xB0B4;&amp;#xC138;&amp;#xC6CC; &amp;#xD64D;&amp;#xBCF4;&amp;#xB97C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xBCF8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC131;&amp;#xBD84;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xB9E4;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD639;&amp;#xC740; &amp;#xAD6C;&amp;#xB9E4; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;! &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; SBOM&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC704;&amp;#xD611; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC27D;&amp;#xAC8C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574;&amp;#xC694; &amp;#x1F36F;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xCD1D; 4&amp;#xAC1C;&amp;#xC758; &amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xC815;&amp;#xCC45;&amp;#xBC29;&amp;#xD5A5;, &amp;#xAD6D;&amp;#xB0B4; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xACB0;&amp;#xACFC;, &amp;#xAD6D;&amp;#xC0B0; SW&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; SBOM &amp;#xC2E4;&amp;#xC99D; &amp;#xBC0F; SW &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xD3EC;&amp;#xB7FC; &amp;#xB17C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;, SW &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xBCA0;&amp;#xB4DC; &amp;#xC2DC;&amp;#xBC94;&amp;#xC6B4;&amp;#xC601; &amp;#xBC0F; &amp;#xBBFC;&amp;#xAD00; &amp;#xC815;&amp;#xCC45;&amp;#xD611;&amp;#xC758;&amp;#xCCB4; &amp;#xB17C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; WEB 3.0 &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xD45C;&amp;#xC801;&amp;#xC774; &amp;#xB418;&amp;#xACE0;&amp;#xC788;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.16 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128918&amp;amp;kind=1&amp;amp;sub_kind=&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image6.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;WEB 3.0&lt;/a&gt; &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xAD00;&amp;#xACC4; &amp;#xC5C6;&amp;#xC774; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC778;&amp;#xD3EC;&amp;#xC2A4;&amp;#xD2F8;&amp;#xB7EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&lt;/a&gt;&amp;#xB97C; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F628;&lt;br&gt;&amp;#xC790;&amp;#xC5F0;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD3EC;&amp;#xB97C; &amp;#xC704;&amp;#xD574;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026;&amp;#x1FAE2;&lt;br&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&lt;/a&gt;&amp;#xC744; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0; &amp;#xACF5;&amp;#xC2DD; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD53C;&amp;#xC2F1; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC18D;&amp;#xC5EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; WEB 3.0&amp;#xC758; &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xCC44;&amp;#xC6A9; &amp;#xACF5;&amp;#xACE0;&amp;#xC640; &amp;#xAC8C;&amp;#xC784;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD55C;&amp;#xAE00;&amp;#xC790;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; SNS&amp;#xC640; Discord&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC18D;&amp;#xAE30; &amp;#xC27D;&amp;#xB3C4;&amp;#xB85D; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x2026;&amp;#x1F627;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC758; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC778; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xC9C0;&amp;#xAC11;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xD6D4;&amp;#xCE58;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;!&amp;#x1F4B0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305; (Source Code Auditing)&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC80;&amp;#xD1A0;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC624;&amp;#xB958;&amp;#xB098; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.pyzw &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;Python &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;, &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WEB 3.0&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;&amp;#xACFC; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9DE;&amp;#xCDA4;&amp;#xD615; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC720;&amp;#xB97C; &amp;#xAC1C;&amp;#xC778;&amp;#xD654;&amp;#xD558;&amp;#xB294; 3&amp;#xC138;&amp;#xB300; &amp;#xC778;&amp;#xD130;&amp;#xB137;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC778;&amp;#xD3EC;&amp;#xC2A4;&amp;#xD2F8;&amp;#xB7EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD615; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;, &amp;#xC6F9; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB098; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD3D0; &amp;#xC9C0;&amp;#xAC11; &amp;#xC8FC;&amp;#xC18C;, &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;, &amp;#xC791;&amp;#xAC00;(&amp;#xC544;&amp;#xD2F0;&amp;#xC2A4;&amp;#xD2B8;, &amp;#xC720;&amp;#xBA85;&amp;#xC778;&amp;#xC0AC; &amp;#xB4F1;) &amp;#xB610;&amp;#xB294; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xCEE8;&amp;#xD150;&amp;#xCE20; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; NFT&amp;#xB97C; &amp;#xBB36;&amp;#xC740; &amp;#xB2E8;&amp;#xC704;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LLM (Large Language Models)&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128934&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;LG CNS, &amp;#x2018;DAP GenAI &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#x2019;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xD574;&amp;#xB2F5; &amp;#xC81C;&amp;#xC2DC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128924&amp;amp;kind=2&amp;amp;sub_kind=&#34;&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;, 4&amp;#xBC30; &amp;#xC774;&amp;#xC0C1; &amp;#xBE60;&amp;#xB978; &amp;#xC640;&amp;#xC774;&amp;#xD30C;&amp;#xC774;7 &amp;#xAD6D;&amp;#xB0B4; &amp;#xC0C1;&amp;#xC6A9;&amp;#xD654; &amp;#xBB38; &amp;#xC5F0;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128941&amp;amp;kind=3&amp;amp;sub_kind=&#34;&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xCEA0;&amp;#xD504;-&amp;#xC5D0;&amp;#xC4F0;&amp;#xD540;&amp;#xD14C;&amp;#xD06C;&amp;#xB180;&amp;#xB85C;&amp;#xC9C0;, &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xBCF4;&amp;#xC548; &amp;#xBD84;&amp;#xC57C; &amp;#xC0AC;&amp;#xC5C5; &amp;#xC5C5;&amp;#xBB34;&amp;#xD611;&amp;#xC57D;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128901&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xC2A4;&amp;#xB0C5;&amp;#xD0DC;&amp;#xADF8;, &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xBE0C;&amp;#xB808;&amp;#xC778; &amp;#xCE7C;&amp;#xB85C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xCD9C;&amp;#xCC98; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128902&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C8; &amp;#xB0C8;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; &amp;#xD611;&amp;#xBC15;&amp;#xC774; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ddaily.co.kr/page/view/2024041714491720474&#34;&gt;&amp;#xBC94;&amp;#xB78C;&amp;#xD558;&amp;#xB294; AI &amp;#xADDC;&amp;#xC81C;&amp;#xB7;&amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#x2026;KISA, &amp;#x2018;AI &amp;#xBCF4;&amp;#xC548; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778;&amp;#x2019; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-CTF-amp-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-CTF-amp-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; CTF &amp;amp; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; CTF &amp;amp; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&amp;#x1F6A9; &lt;a href=&#34;https://dreamhack.io/ctf/518&#34;&gt;.HACK CTF&lt;/a&gt; | 24.04.27 ~ 2024.04.28 09:00 (24h)&lt;/p&gt;
&lt;p&gt;&amp;#x2B50;&amp;#xFE0F; &lt;a href=&#34;https://dothack.io/&#34;&gt;.HACK Conference&lt;/a&gt; | 2024.05.27 ~ 2024.05.28 &lt;/p&gt;
&lt;p&gt;&amp;#x1F6A9; &lt;a href=&#34;https://hacktheon.org/info.php&#34;&gt;2024 HackTheon Sejong &amp;#xAD6D;&amp;#xC81C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;(CTF)&lt;/a&gt; |  2024.04.27 09:00 (9h)&lt;/p&gt;
&lt;p&gt;&amp;#x2B50;&amp;#xFE0F; &lt;a href=&#34;https://hacktheon.org/i_info.php&#34;&gt;2024 HackTheon Sejong &amp;#xAD6D;&amp;#xC81C; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; |  2024.06.19 ~ 2024.06.20 &lt;/p&gt;
&lt;h2 id=&#34;4&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#4&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;4&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&#34;&gt;&lt;/a&gt;4&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://upside.center/&#34;&gt;Upside &amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;&lt;/a&gt; | theori, &amp;#xB450;&amp;#xB098;&amp;#xBB34; | 2024.04.26 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.kshieldjr.org/&#34;&gt;K-Shield Jr. 12&amp;#xAE30;&lt;/a&gt; | KISA, &amp;#xCEEC;&amp;#xCC98;&amp;#xBA54;&amp;#xC774;&amp;#xCEE4;&amp;#xC2A4; | 2024.04.25 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.sktaifellowship.com/&#34;&gt;AI Fellowship 6&amp;#xAE30;&lt;/a&gt; | SKT | 2024.05.06 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] í…”ë ˆê·¸ëž¨ ì‚¬ìš©í•˜ì‹œëŠ” ë¶„~~?? - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;br&gt;&amp;#xC644;&amp;#xC5F0;&amp;#xD55C; &amp;#xBD04;&amp;#xC774; &amp;#xBC9A;&amp;#xAF43;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xC800;&amp;#xBB3C;&amp;#xACE0; &amp;#xD478;&amp;#xB987;&amp;#xD478;&amp;#xB987;&amp;#xD55C;.. &amp;#xC2DC;&amp;#xD5D8;&amp;#xAE30;&amp;#xAC04;&amp;#xC774; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xB124;&amp;#xC694; &amp;#x1F979;&lt;br&gt;&amp;#xC2DC;&amp;#xD5D8; &amp;#xACF5;&amp;#xBD80;&amp;#xC5D0; &amp;#xC9C0;&amp;#xCE60; &amp;#xB54C;! &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB294; &amp;#xAC74; &amp;#xC5B4;&amp;#xB5A4;&amp;#xAC00;&amp;#xC694;? &amp;#x1F9D0;&lt;br&gt;&amp;#xC2DC;&amp;#xD5D8;&amp;#xAE30;&amp;#xAC04;&amp;#xC5D0;&amp;#xB3C4; &amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8;&amp;#xD574;&amp;#xC694;!&amp;#x1F423;&amp;#x1F425;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/strong&gt;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x2708;&amp;#xFE0F; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC545;&amp;#xC131;&amp;#xD30C;&amp;#xC77C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.15 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128844&amp;amp;direct=mobile&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;?! &amp;#x1F440; &lt;del&gt;&amp;#xC800;&amp;#xC694; &amp;#x270B;&amp;#x1F3FB;&lt;/del&gt;&lt;br&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC6A9; &amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!! &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD154;&amp;#xB808;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xB454; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;(exe, bin &amp;#xB4F1;)&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xCC3D;&amp;#xC774; &amp;#xB728;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#x26A0;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x2018;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;pyzw&lt;/a&gt;&amp;#x2019;&lt;/strong&gt; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xAC00; &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; &amp;#xCCA0;&amp;#xC790; &amp;#xC624;&amp;#xB958;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#x2018;&lt;strong&gt;pywz&amp;#x2019;&lt;/strong&gt;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACE0;&amp;#xCC3D; &amp;#xC5C6;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Python&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1F631; &amp;#xB610;, pyzw &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &lt;strong&gt;&amp;#x2018;video/mp4&amp;#x2019; MIME &amp;#xC720;&amp;#xD615;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC;, &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#xC601;&amp;#xC0C1;&amp;#xC744; &amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xD55C; &amp;#xC21C;&amp;#xAC04;.. &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026;&amp;#x1FAE0; &lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xD589;&amp;#xD788; &amp;#xD604;&amp;#xC7AC;&amp;#xB294; pyzw &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xC1A1;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#x2018;.untrusted&amp;#x2019; &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC;, &amp;#xC5F4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC218;&amp;#xC815;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;&amp;#x1F60E; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD655;&amp;#xC7A5;&amp;#xC790; &amp;#xD655;&amp;#xC778;&amp;#xACFC; &amp;#xC8FC;&amp;#xAE30;&amp;#xC801;&amp;#xC778; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&lt;/a&gt;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bleepingcomputer.com/news/security/telegram-fixes-windows-app-zero-day-used-to-launch-python-scripts/?&amp;amp;web_view=true#google_vignette&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &amp;#xC138;&amp;#xACC4;&amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xAE30;&amp;#xC220;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;(WDTA), &amp;#xAD6D;&amp;#xC81C; AI &amp;#xBCF4;&amp;#xC548; &amp;#xD45C;&amp;#xC900; &amp;#xBC1C;&amp;#xD45C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.17 | Zdnet Korea | &lt;a href=&#34;https://zdnet.co.kr/view/?no=20240418015506&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;4&amp;#xC6D4; 17&amp;#xC77C; &amp;#xC2A4;&amp;#xC704;&amp;#xC2A4; &amp;#xC81C;&amp;#xB124;&amp;#xBC14;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F4;&amp;#xB9B0; &amp;#xC81C;27&amp;#xCC28; &amp;#xC720;&amp;#xC5D4;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xD68C;&amp;#xC758;&amp;#xC5D0;&amp;#xC11C; &amp;#xC138;&amp;#xACC4;&amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xAE30;&amp;#xC220;&amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;(WDTA)&amp;#xB294; &amp;#x2018;&amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#x2019;&amp;#xC640; &amp;#x2018;LLM &amp;#xBAA8;&amp;#xB378; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#x2019; &amp;#xB4F1; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAD6D;&amp;#xC81C; &amp;#xD45C;&amp;#xC900;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x1F632; &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xD45C;&amp;#xC900;&amp;#xC740; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;LLM &amp;#xBAA8;&amp;#xB378;&lt;/a&gt; &amp;#xBC0F; &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xAE00;&amp;#xB85C;&amp;#xBC8C; AI &amp;#xBCF4;&amp;#xC548; &amp;#xD3C9;&amp;#xAC00; &amp;#xBC0F; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xC900;&amp;#xC774; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC18C;&amp;#xAC1C;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D;&amp;#xACFC; &amp;#xC911;&amp;#xAD6D; &amp;#xAE30;&amp;#xC5C5;&amp;#xC778; &amp;#xC624;&amp;#xD508;AI, &amp;#xAD6C;&amp;#xAE00;, &amp;#xBA54;&amp;#xD0C0;, &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;, &amp;#xC5D4;&amp;#xBE44;&amp;#xB514;&amp;#xC544;, &amp;#xC544;&amp;#xB9C8;&amp;#xC874;, &amp;#xC54C;&amp;#xB9AC;&amp;#xBC14;&amp;#xBC14;&amp;#xADF8;&amp;#xB8F9;&amp;#xC758; &amp;#xC564;&amp;#xD2B8;&amp;#xADF8;&amp;#xB8F9;, &amp;#xC544;&amp;#xC774;&amp;#xD50C;&amp;#xB77C;&amp;#xC774;&amp;#xD14D;, &amp;#xBC14;&amp;#xC774;&amp;#xB450;, &amp;#xD150;&amp;#xC13C;&amp;#xD2B8;, &amp;#xC624;&amp;#xD3EC;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC84;&amp;#xD074;&amp;#xB9AC;&amp;#xB300; &amp;#xB4F1; &amp;#xC218;&amp;#xC2ED; &amp;#xAC1C; &amp;#xAE30;&amp;#xC5C5; &amp;#xBC0F; &amp;#xAE30;&amp;#xAD00;&amp;#xC758; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xAC00; &amp;#xACF5;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC5EC;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.wdtacademy.org/&#34;&gt;&amp;#xCC38;&amp;#xACE0;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; GitHub&amp;#xC758; &amp;#xAC80;&amp;#xC0C9; &amp;#xAE30;&amp;#xB2A5; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xD37C;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB4E4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.13 | SecurityAffairs | &lt;a href=&#34;https://securityaffairs.com/161792/cyber-crime/githubs-search-results-distribute-malware.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;GitHub&amp;#xC5D0;&amp;#xC11C; &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xB8CC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xACBD;&amp;#xD5D8; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;? &amp;#x1F9D0;&lt;br&gt;&amp;#xB9CC;&amp;#xC57D;.. &amp;#xC774; &amp;#xAC80;&amp;#xC0C9; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC870;&amp;#xC791;&amp;#xB41C; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xBA74;..?! &amp;#x1F631;&amp;#x1FAE0;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; GitHub Actions&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD604;&amp;#xC7AC; &amp;#xB0A0;&amp;#xC9DC;&amp;#xC640; &amp;#xC2DC;&amp;#xAC04; &amp;#xB610;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC791;&amp;#xC740; &amp;#xBCC0;&amp;#xACBD; &amp;#xC0AC;&amp;#xD56D;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xC5EC;, &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xC790;&amp;#xC8FC; Repository&amp;#xB97C; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, Star&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xB839; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xC5EC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xB294; &amp;#xB4F1; &amp;#xAD50;&amp;#xBB18;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC18D;&amp;#xC600;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x2026;&amp;#x1F627;&lt;br&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC18D;&amp;#xC778; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C;  Repository&amp;#xC758; &amp;#x2019;&lt;strong&gt;.csproj&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;.vcxproj&amp;#x2019;&lt;/strong&gt; &amp;#xD30C;&amp;#xC77C;(Visual Studio &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;) &amp;#xB0B4;&amp;#xC5D0; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xD55C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC228;&amp;#xACBC;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; Repository&amp;#xC778;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC758;&amp;#xB97C; &amp;#xAE30;&amp;#xC6B8;&amp;#xC5EC;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;&amp;#x1F630;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3; &amp;#xC815;&amp;#xBD80;, S-BOM &amp;#xBCF4;&amp;#xC548; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778; &amp;#xBC1C;&amp;#xD45C;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.18 | Zdnet Korea | &lt;a href=&#34;https://zdnet.co.kr/view/?no=20240418174503&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;SBOM!&amp;#x1F330; &amp;#xB2E4;&amp;#xB4E4; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;SBOM&amp;#xC740; &lt;strong&gt;S&lt;/strong&gt;oftware &lt;strong&gt;B&lt;/strong&gt;ill &lt;strong&gt;O&lt;/strong&gt;f &lt;strong&gt;M&lt;/strong&gt;aterials&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &lt;strong&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/strong&gt;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD574;&amp;#xC694;!&lt;br&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x2019;&amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xD45C;&amp;#x2019;&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C;&amp;#xB370;&amp;#xC694;.&lt;br&gt;&amp;#xD310;&amp;#xB9E4;&amp;#xC790;(&amp;#xACF5;&amp;#xAE09;&amp;#xC790;)&amp;#xB294; &amp;#xC798; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xC744; &amp;#xB0B4;&amp;#xC138;&amp;#xC6CC; &amp;#xD64D;&amp;#xBCF4;&amp;#xB97C; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xBCF8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC131;&amp;#xBD84;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xB9E4;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xD639;&amp;#xC740; &amp;#xAD6C;&amp;#xB9E4; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC601;&amp;#xC591; &amp;#xC131;&amp;#xBD84;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0;! &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; SBOM&amp;#xC740; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xC704;&amp;#xD611; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC27D;&amp;#xAC8C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD574;&amp;#xC694; &amp;#x1F36F;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778;&amp;#xC740; &amp;#xCD1D; 4&amp;#xAC1C;&amp;#xC758; &amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xC815;&amp;#xCC45;&amp;#xBC29;&amp;#xD5A5;, &amp;#xAD6D;&amp;#xB0B4; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F0;&amp;#xAD6C;&amp;#xACB0;&amp;#xACFC;, &amp;#xAD6D;&amp;#xC0B0; SW&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; SBOM &amp;#xC2E4;&amp;#xC99D; &amp;#xBC0F; SW &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xD3EC;&amp;#xB7FC; &amp;#xB17C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;, SW &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD; &amp;#xBCF4;&amp;#xC548; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xBCA0;&amp;#xB4DC; &amp;#xC2DC;&amp;#xBC94;&amp;#xC6B4;&amp;#xC601; &amp;#xBC0F; &amp;#xBBFC;&amp;#xAD00; &amp;#xC815;&amp;#xCC45;&amp;#xD611;&amp;#xC758;&amp;#xCCB4; &amp;#xB17C;&amp;#xC758; &amp;#xACB0;&amp;#xACFC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; WEB 3.0 &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB4E4;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xD45C;&amp;#xC801;&amp;#xC774; &amp;#xB418;&amp;#xACE0;&amp;#xC788;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.04.16 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128918&amp;amp;kind=1&amp;amp;sub_kind=&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/04/22/clalxk/newsletter0422/image6.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#xC758; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;WEB 3.0&lt;/a&gt; &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C;, &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xAD00;&amp;#xACC4; &amp;#xC5C6;&amp;#xC774; &lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&amp;#xC778;&amp;#xD3EC;&amp;#xC2A4;&amp;#xD2F8;&amp;#xB7EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&lt;/a&gt;&amp;#xB97C; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F628;&lt;br&gt;&amp;#xC790;&amp;#xC5F0;&amp;#xC2A4;&amp;#xB7EC;&amp;#xC6B4; &amp;#xD53C;&amp;#xC2F1; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD3EC;&amp;#xB97C; &amp;#xC704;&amp;#xD574;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0; &amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026;&amp;#x1FAE2;&lt;br&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&lt;/a&gt;&amp;#xC744; &amp;#xBC1C;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC5D0; &amp;#xACF5;&amp;#xC2DD; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD53C;&amp;#xC2F1; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xC704;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC744; &amp;#xC18D;&amp;#xC5EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xB3C4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; WEB 3.0&amp;#xC758; &amp;#xAC8C;&amp;#xC784; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790; &amp;#xCC44;&amp;#xC6A9; &amp;#xACF5;&amp;#xACE0;&amp;#xC640; &amp;#xAC8C;&amp;#xC784;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD55C;&amp;#xAE00;&amp;#xC790;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; SNS&amp;#xC640; Discord&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xBA70; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC18D;&amp;#xAE30; &amp;#xC27D;&amp;#xB3C4;&amp;#xB85D; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;&amp;#x2026;&amp;#x1F627;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC758; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC778; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD3D0; &amp;#xC9C0;&amp;#xAC11;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC790;&amp;#xAE08;&amp;#xC744; &amp;#xD6D4;&amp;#xCE58;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;!&amp;#x1F4B0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305; (Source Code Auditing)&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC80;&amp;#xD1A0;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; &amp;#xC624;&amp;#xB958;&amp;#xB098; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.pyzw &amp;#xD655;&amp;#xC7A5;&amp;#xC790;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;Python &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;, &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WEB 3.0&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5;&amp;#xACFC; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB9DE;&amp;#xCDA4;&amp;#xD615; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC720;&amp;#xB97C; &amp;#xAC1C;&amp;#xC778;&amp;#xD654;&amp;#xD558;&amp;#xB294; 3&amp;#xC138;&amp;#xB300; &amp;#xC778;&amp;#xD130;&amp;#xB137;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC778;&amp;#xD3EC;&amp;#xC2A4;&amp;#xD2F8;&amp;#xB7EC; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD615; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;, &amp;#xC6F9; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB098; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815; &amp;#xC815;&amp;#xBCF4;&amp;#xB098; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD3D0; &amp;#xC9C0;&amp;#xAC11; &amp;#xC8FC;&amp;#xC18C;, &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;NFT &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB799;&amp;#xD2B8;, &amp;#xC791;&amp;#xAC00;(&amp;#xC544;&amp;#xD2F0;&amp;#xC2A4;&amp;#xD2B8;, &amp;#xC720;&amp;#xBA85;&amp;#xC778;&amp;#xC0AC; &amp;#xB4F1;) &amp;#xB610;&amp;#xB294; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xCEE8;&amp;#xD150;&amp;#xCE20; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; NFT&amp;#xB97C; &amp;#xBB36;&amp;#xC740; &amp;#xB2E8;&amp;#xC704;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LLM (Large Language Models)&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC14B;&amp;#xC73C;&amp;#xB85C; &amp;#xD559;&amp;#xC2B5;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xB300;&amp;#xADDC;&amp;#xBAA8; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128934&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;LG CNS, &amp;#x2018;DAP GenAI &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#x2019;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xD574;&amp;#xB2F5; &amp;#xC81C;&amp;#xC2DC;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128924&amp;amp;kind=2&amp;amp;sub_kind=&#34;&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;, 4&amp;#xBC30; &amp;#xC774;&amp;#xC0C1; &amp;#xBE60;&amp;#xB978; &amp;#xC640;&amp;#xC774;&amp;#xD30C;&amp;#xC774;7 &amp;#xAD6D;&amp;#xB0B4; &amp;#xC0C1;&amp;#xC6A9;&amp;#xD654; &amp;#xBB38; &amp;#xC5F0;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128941&amp;amp;kind=3&amp;amp;sub_kind=&#34;&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xCEA0;&amp;#xD504;-&amp;#xC5D0;&amp;#xC4F0;&amp;#xD540;&amp;#xD14C;&amp;#xD06C;&amp;#xB180;&amp;#xB85C;&amp;#xC9C0;, &amp;#xC0DD;&amp;#xC131;&amp;#xD615; AI &amp;#xBCF4;&amp;#xC548; &amp;#xBD84;&amp;#xC57C; &amp;#xC0AC;&amp;#xC5C5; &amp;#xC5C5;&amp;#xBB34;&amp;#xD611;&amp;#xC57D;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128901&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xC2A4;&amp;#xB0C5;&amp;#xD0DC;&amp;#xADF8;, &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xBE0C;&amp;#xB808;&amp;#xC778; &amp;#xCE7C;&amp;#xB85C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xCD9C;&amp;#xCC98; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=128902&amp;amp;kind=&amp;amp;sub_kind=&#34;&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C8; &amp;#xB0C8;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; &amp;#xD611;&amp;#xBC15;&amp;#xC774; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ddaily.co.kr/page/view/2024041714491720474&#34;&gt;&amp;#xBC94;&amp;#xB78C;&amp;#xD558;&amp;#xB294; AI &amp;#xADDC;&amp;#xC81C;&amp;#xB7;&amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#x2026;KISA, &amp;#x2018;AI &amp;#xBCF4;&amp;#xC548; &amp;#xAC00;&amp;#xC774;&amp;#xB4DC;&amp;#xB77C;&amp;#xC778;&amp;#x2019; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-CTF-amp-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-CTF-amp-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; CTF &amp;amp; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; CTF &amp;amp; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&amp;#x1F6A9; &lt;a href=&#34;https://dreamhack.io/ctf/518&#34;&gt;.HACK CTF&lt;/a&gt; | 24.04.27 ~ 2024.04.28 09:00 (24h)&lt;/p&gt;
&lt;p&gt;&amp;#x2B50;&amp;#xFE0F; &lt;a href=&#34;https://dothack.io/&#34;&gt;.HACK Conference&lt;/a&gt; | 2024.05.27 ~ 2024.05.28 &lt;/p&gt;
&lt;p&gt;&amp;#x1F6A9; &lt;a href=&#34;https://hacktheon.org/info.php&#34;&gt;2024 HackTheon Sejong &amp;#xAD6D;&amp;#xC81C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;(CTF)&lt;/a&gt; |  2024.04.27 09:00 (9h)&lt;/p&gt;
&lt;p&gt;&amp;#x2B50;&amp;#xFE0F; &lt;a href=&#34;https://hacktheon.org/i_info.php&#34;&gt;2024 HackTheon Sejong &amp;#xAD6D;&amp;#xC81C; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt; |  2024.06.19 ~ 2024.06.20 &lt;/p&gt;
&lt;h2 id=&#34;4&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#4&amp;#xC6D4;-&amp;#xAD50;&amp;#xC721;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;4&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&#34;&gt;&lt;/a&gt;4&amp;#xC6D4; &amp;#xAD50;&amp;#xC721; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://upside.center/&#34;&gt;Upside &amp;#xC544;&amp;#xCE74;&amp;#xB370;&amp;#xBBF8;&lt;/a&gt; | theori, &amp;#xB450;&amp;#xB098;&amp;#xBB34; | 2024.04.26 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.kshieldjr.org/&#34;&gt;K-Shield Jr. 12&amp;#xAE30;&lt;/a&gt; | KISA, &amp;#xCEEC;&amp;#xCC98;&amp;#xBA54;&amp;#xC774;&amp;#xCEE4;&amp;#xC2A4; | 2024.04.25 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.sktaifellowship.com/&#34;&gt;AI Fellowship 6&amp;#xAE30;&lt;/a&gt; | SKT | 2024.05.06 &amp;#xAE4C;&amp;#xC9C0; &amp;#xC811;&amp;#xC218;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/Newsletter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/04/22/clalxk/newsletter0422/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] í…”ë ˆê·¸ëž¨ ì‚¬ìš©í•˜ì‹œëŠ” ë¶„~~?? - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-04-22 17:00" pubdate>
      2024ë…„ 4ì›” 22ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.1k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      41
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] í…”ë ˆê·¸ëž¨ ì‚¬ìš©í•˜ì‹œëŠ” ë¶„~~??</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! clalxk &#xC785;&#xB2C8;&#xB2E4; &#x1F600;<br>&#xC644;&#xC5F0;&#xD55C; &#xBD04;&#xC774; &#xBC9A;&#xAF43;&#xACFC; &#xD568;&#xAED8; &#xC800;&#xBB3C;&#xACE0; &#xD478;&#xB987;&#xD478;&#xB987;&#xD55C;.. &#xC2DC;&#xD5D8;&#xAE30;&#xAC04;&#xC774; &#xB3CC;&#xC544;&#xC654;&#xB124;&#xC694; &#x1F979;<br>&#xC2DC;&#xD5D8; &#xACF5;&#xBD80;&#xC5D0; &#xC9C0;&#xCE60; &#xB54C;! &#xD574;&#xD0B9;&#xC9F9;&#xC9F9;&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xB294; &#xAC74; &#xC5B4;&#xB5A4;&#xAC00;&#xC694;? &#x1F9D0;<br>&#xC2DC;&#xD5D8;&#xAE30;&#xAC04;&#xC5D0;&#xB3C4; &#xD574;&#xD0B9;&#xC9F9;&#xC9F9;&#xACFC; &#xD568;&#xAED8;&#xD574;&#xC694;!&#x1F423;&#x1F425;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a><strong>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</strong></h2><blockquote>
<p>&#x2708;&#xFE0F; &#xD154;&#xB808;&#xADF8;&#xB7A8;, &#xC545;&#xC131;&#xD30C;&#xC77C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC81C;&#xB85C;&#xB370;&#xC774; &#xCDE8;&#xC57D;&#xC810; &#xBC1C;&#xACAC;&#x2026;</p>
</blockquote>
<p>2024.04.15 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128844&amp;direct=mobile">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xD154;&#xB808;&#xADF8;&#xB7A8; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xB294; &#xBD84;?! &#x1F440; <del>&#xC800;&#xC694; &#x270B;&#x1F3FB;</del><br>&#xC708;&#xB3C4;&#xC6B0;&#xC6A9; &#xD154;&#xB808;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC5B4;&#xC694;!! &#xC5B4;&#xB5A4; &#xCDE8;&#xC57D;&#xC810;&#xC77C;&#xAE4C;&#xC694;? &#x1F914;</p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xD154;&#xB808;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBBF8;&#xB9AC; &#xC9C0;&#xC815;&#xD574;&#xB454; &#xD655;&#xC7A5;&#xC790;(exe, bin &#xB4F1;)&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xACBD;&#xC6B0; &#xBCF4;&#xC548; &#xACBD;&#xACE0;&#xCC3D;&#xC774; &#xB728;&#xB294;&#xB370;&#xC694;. &#x26A0;&#xFE0F;</p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p><strong>&#x2018;<a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">pyzw</a>&#x2019;</strong> &#xD655;&#xC7A5;&#xC790;&#xAC00; &#xC704; &#xC0AC;&#xC9C4;&#xCC98;&#xB7FC; &#xCCA0;&#xC790; &#xC624;&#xB958;&#xB85C; &#xC778;&#xD574; &#x2018;<strong>pywz&#x2019;</strong>&#xB85C; &#xB418;&#xC5B4;&#xC788;&#xC5B4;&#xC11C; &#xBCF4;&#xC548; &#xACBD;&#xACE0;&#xCC3D; &#xC5C6;&#xC774; &#xBC14;&#xB85C; Python&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;&#x1F631; &#xB610;, pyzw &#xD30C;&#xC77C;&#xC744; <strong>&#x2018;video/mp4&#x2019; MIME &#xC720;&#xD615;</strong>&#xC73C;&#xB85C; &#xC704;&#xC7A5;&#xD558;&#xC5EC;, &#xBE44;&#xB514;&#xC624; &#xD30C;&#xC77C;&#xB85C; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#xC601;&#xC0C1;&#xC744; &#xBCF4;&#xB824;&#xACE0; &#xD074;&#xB9AD;&#xD55C; &#xC21C;&#xAC04;.. &#xD30C;&#xC774;&#xC36C; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB2E4;&#xB2C8;&#x2026;&#x1FAE0; </p>
<p>&#xB2E4;&#xD589;&#xD788; &#xD604;&#xC7AC;&#xB294; pyzw &#xD30C;&#xC77C;&#xC744; &#xC804;&#xC1A1;&#xD560; &#xACBD;&#xC6B0; &#x2018;.untrusted&#x2019; &#xD655;&#xC7A5;&#xC790;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xC5EC;, &#xC5F4;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD560; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB3C4;&#xB85D; &#xC218;&#xC815;&#xB418;&#xC5C8;&#xC5B4;&#xC694;&#x1F60E; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC804; &#xD655;&#xC7A5;&#xC790; &#xD655;&#xC778;&#xACFC; &#xC8FC;&#xAE30;&#xC801;&#xC778; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xC624;&#xB514;&#xD305;</a>&#xC774; &#xD544;&#xC694;&#xD560; &#xAC83; &#xAC19;&#xB124;&#xC694;!</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bleepingcomputer.com/news/security/telegram-fixes-windows-app-zero-day-used-to-launch-python-scripts/?&amp;web_view=true#google_vignette">&#xCC38;&#xACE0;</a></p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3; &#xC138;&#xACC4;&#xB514;&#xC9C0;&#xD138;&#xAE30;&#xC220;&#xC544;&#xCE74;&#xB370;&#xBBF8;(WDTA), &#xAD6D;&#xC81C; AI &#xBCF4;&#xC548; &#xD45C;&#xC900; &#xBC1C;&#xD45C;</p>
</blockquote>
<p>2024.04.17 | Zdnet Korea | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://zdnet.co.kr/view/?no=20240418015506">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>4&#xC6D4; 17&#xC77C; &#xC2A4;&#xC704;&#xC2A4; &#xC81C;&#xB124;&#xBC14;&#xC5D0;&#xC11C; &#xC5F4;&#xB9B0; &#xC81C;27&#xCC28; &#xC720;&#xC5D4;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xD68C;&#xC758;&#xC5D0;&#xC11C; &#xC138;&#xACC4;&#xB514;&#xC9C0;&#xD138;&#xAE30;&#xC220;&#xC544;&#xCE74;&#xB370;&#xBBF8;(WDTA)&#xB294; &#x2018;&#xC0DD;&#xC131;&#xD615; AI &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xBCF4;&#xC548; &#xD14C;&#xC2A4;&#xD2B8;&#x2019;&#xC640; &#x2018;LLM &#xBAA8;&#xB378; &#xBCF4;&#xC548; &#xD14C;&#xC2A4;&#xD2B8;&#x2019; &#xB4F1; &#xB450; &#xAC00;&#xC9C0; &#xAD6D;&#xC81C; &#xD45C;&#xC900;&#xC744; &#xBC1C;&#xD45C;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;&#x1F632; </p>
<p>&#xC774; &#xB450; &#xAC00;&#xC9C0; &#xD45C;&#xC900;&#xC740; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">LLM &#xBAA8;&#xB378;</a> &#xBC0F; &#xC0DD;&#xC131;&#xD615; AI &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xAE00;&#xB85C;&#xBC8C; AI &#xBCF4;&#xC548; &#xD3C9;&#xAC00; &#xBC0F; &#xD14C;&#xC2A4;&#xD2B8;&#xC758; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC900;&#xC774; &#xB420; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC18C;&#xAC1C;&#xD588;&#xC5B4;&#xC694;. </p>
<p>&#xBBF8;&#xAD6D;&#xACFC; &#xC911;&#xAD6D; &#xAE30;&#xC5C5;&#xC778; &#xC624;&#xD508;AI, &#xAD6C;&#xAE00;, &#xBA54;&#xD0C0;, &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;, &#xC5D4;&#xBE44;&#xB514;&#xC544;, &#xC544;&#xB9C8;&#xC874;, &#xC54C;&#xB9AC;&#xBC14;&#xBC14;&#xADF8;&#xB8F9;&#xC758; &#xC564;&#xD2B8;&#xADF8;&#xB8F9;, &#xC544;&#xC774;&#xD50C;&#xB77C;&#xC774;&#xD14D;, &#xBC14;&#xC774;&#xB450;, &#xD150;&#xC13C;&#xD2B8;, &#xC624;&#xD3EC;, &#xADF8;&#xB9AC;&#xACE0; &#xBC84;&#xD074;&#xB9AC;&#xB300; &#xB4F1; &#xC218;&#xC2ED; &#xAC1C; &#xAE30;&#xC5C5; &#xBC0F; &#xAE30;&#xAD00;&#xC758; &#xC804;&#xBB38;&#xAC00;&#xAC00; &#xACF5;&#xB3D9;&#xC73C;&#xB85C; &#xCC38;&#xC5EC;&#xD588;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;! </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.wdtacademy.org/">&#xCC38;&#xACE0;</a></p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; GitHub&#xC758; &#xAC80;&#xC0C9; &#xAE30;&#xB2A5; &#xC545;&#xC6A9;&#xD574; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xD37C;&#xD2B8;&#xB9AC;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xB4E4;</p>
</blockquote>
<p>2024.04.13 | SecurityAffairs | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://securityaffairs.com/161792/cyber-crime/githubs-search-results-distribute-malware.html">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>GitHub&#xC5D0;&#xC11C; &#xAC80;&#xC0C9;&#xC744; &#xD1B5;&#xD574; &#xC790;&#xB8CC;&#xB97C; &#xCC3E;&#xC544;&#xBCF8; &#xACBD;&#xD5D8; &#xC788;&#xC73C;&#xC2E0;&#xAC00;&#xC694;? &#x1F9D0;<br>&#xB9CC;&#xC57D;.. &#xC774; &#xAC80;&#xC0C9; &#xACB0;&#xACFC;&#xAC00; &#xC870;&#xC791;&#xB41C; &#xAC83;&#xC774;&#xB77C;&#xBA74;..?! &#x1F631;&#x1FAE0;</p>
<p>&#xC2E4;&#xC81C;&#xB85C; GitHub Actions&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xD604;&#xC7AC; &#xB0A0;&#xC9DC;&#xC640; &#xC2DC;&#xAC04; &#xB610;&#xB294; &#xC784;&#xC758;&#xC758; &#xC791;&#xC740; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC73C;&#xB85C; &#xC218;&#xC815;&#xD558;&#xC5EC;, &#xBE44;&#xAD50;&#xC801; &#xC790;&#xC8FC; Repository&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C;, Star&#xB97C; &#xC5BB;&#xAE30; &#xC704;&#xD574; &#xC720;&#xB839; &#xACC4;&#xC815;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xC5EC; &#xC2E0;&#xB8B0;&#xC131;&#xC744; &#xB192;&#xC774;&#xB294; &#xB4F1; &#xAD50;&#xBB18;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xC18D;&#xC600;&#xB2E4;&#xACE0; &#xD574;&#xC694;&#x2026;&#x1F627;<br>&#xC774;&#xB807;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC18D;&#xC778; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC8FC;&#xB85C;  Repository&#xC758; &#x2019;<strong>.csproj</strong> &#xB610;&#xB294; <strong>.vcxproj&#x2019;</strong> &#xD30C;&#xC77C;(Visual Studio &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD30C;&#xC77C;) &#xB0B4;&#xC5D0; &#xB09C;&#xB3C5;&#xD654;&#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xC228;&#xACBC;&#xB2E4;&#xACE0; &#xD574;&#xC694;.</p>
<p>&#xC55E;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC758;&#xB3C4;&#xD55C; Repository&#xC778;&#xC9C0; &#xC8FC;&#xC758;&#xB97C; &#xAE30;&#xC6B8;&#xC5EC;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xB124;&#xC694;&#x1F630;</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3; &#xC815;&#xBD80;, S-BOM &#xBCF4;&#xC548; &#xAC00;&#xC774;&#xB4DC;&#xB77C;&#xC778; &#xBC1C;&#xD45C;</p>
</blockquote>
<p>2024.04.18 | Zdnet Korea | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://zdnet.co.kr/view/?no=20240418174503">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image5.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>SBOM!&#x1F330; &#xB2E4;&#xB4E4; &#xB4E4;&#xC5B4;&#xBCF4;&#xC168;&#xB098;&#xC694;?</p>
<p>SBOM&#xC740; <strong>S</strong>oftware <strong>B</strong>ill <strong>O</strong>f <strong>M</strong>aterials&#xC758; &#xC57D;&#xC790;&#xB85C;, <strong>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;</strong>&#xB97C; &#xC758;&#xBBF8;&#xD574;&#xC694;!<br>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC124;&#xBA85;&#xD558;&#xC790;&#xBA74; &#x2019;&#xC601;&#xC591; &#xC131;&#xBD84;&#xD45C;&#x2019;&#xC640; &#xBE44;&#xC2B7;&#xD55C;&#xB370;&#xC694;.<br>&#xD310;&#xB9E4;&#xC790;(&#xACF5;&#xAE09;&#xC790;)&#xB294; &#xC798; &#xAD6C;&#xC131;&#xD55C; &#xC601;&#xC591; &#xC131;&#xBD84;&#xC744; &#xB0B4;&#xC138;&#xC6CC; &#xD64D;&#xBCF4;&#xB97C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0;, &#xC774;&#xB97C; &#xBCF8; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC131;&#xBD84;&#xC5D0; &#xB530;&#xB77C; &#xAD6C;&#xB9E4;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xAC70;&#xB098; &#xD639;&#xC740; &#xAD6C;&#xB9E4; &#xD6C4;&#xC5D0; &#xC5B4;&#xB5A0;&#xD55C; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xC601;&#xC591; &#xC131;&#xBD84;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xAE30;&#xB3C4; &#xD558;&#xC8E0;! &#xC774;&#xCC98;&#xB7FC; SBOM&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xACE0;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xC704;&#xD611; &#xC694;&#xC18C;&#xB97C; &#xBCF4;&#xB2E4; &#xC27D;&#xAC8C; &#xCD94;&#xC801;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC8FC;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD574;&#xC694; &#x1F36F;</p>
<p>&#xD574;&#xB2F9; &#xAC00;&#xC774;&#xB4DC;&#xB77C;&#xC778;&#xC740; &#xCD1D; 4&#xAC1C;&#xC758; &#xC7A5;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xACF5;&#xAE09;&#xB9DD; &#xBCF4;&#xC548; &#xC815;&#xCC45;&#xBC29;&#xD5A5;, &#xAD6D;&#xB0B4; &#xC804;&#xBB38;&#xAC00;&#xB4E4;&#xC758; &#xC5F0;&#xAD6C;&#xACB0;&#xACFC;, &#xAD6D;&#xC0B0; SW&#xC5D0; &#xB300;&#xD55C; SBOM &#xC2E4;&#xC99D; &#xBC0F; SW &#xACF5;&#xAE09;&#xB9DD; &#xBCF4;&#xC548; &#xD3EC;&#xB7FC; &#xB17C;&#xC758; &#xACB0;&#xACFC;, SW &#xACF5;&#xAE09;&#xB9DD; &#xBCF4;&#xC548; &#xD14C;&#xC2A4;&#xD2B8;&#xBCA0;&#xB4DC; &#xC2DC;&#xBC94;&#xC6B4;&#xC601; &#xBC0F; &#xBBFC;&#xAD00; &#xC815;&#xCC45;&#xD611;&#xC758;&#xCCB4; &#xB17C;&#xC758; &#xACB0;&#xACFC; &#xB4F1;&#xC5D0; &#xB300;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; &#xB2F4;&#xACA8;&#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;! </p>
<h2 id="-3"><a href="#-3" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; WEB 3.0 &#xAC8C;&#xC784; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;, &#xC554;&#xD638;&#xD654;&#xD3D0; &#xB178;&#xB9AC;&#xB294; &#xD53C;&#xC2F1; &#xACF5;&#xACA9;&#xC758; &#xD45C;&#xC801;&#xC774; &#xB418;&#xACE0;&#xC788;&#xC5B4;</p>
</blockquote>
<p>2024.04.16 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128918&amp;kind=1&amp;sub_kind=">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/04/22/clalxk/newsletter0422/image6.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xB7EC;&#xC2DC;&#xC544;&#xC758; &#xACF5;&#xACA9;&#xC790;&#xAC00; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">WEB 3.0</a> &#xAC8C;&#xC784; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C;, &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xAD00;&#xACC4; &#xC5C6;&#xC774; <a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">&#xC778;&#xD3EC;&#xC2A4;&#xD2F8;&#xB7EC; &#xC545;&#xC131;&#xCF54;&#xB4DC;</a>&#xB97C; &#xC720;&#xD3EC;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F628;<br>&#xC790;&#xC5F0;&#xC2A4;&#xB7EC;&#xC6B4; &#xD53C;&#xC2F1; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC131;&#xACF5;&#xC801;&#xC778; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC720;&#xD3EC;&#xB97C; &#xC704;&#xD574;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xC900;&#xBE44;&#xB97C; &#xD588;&#xB2E4;&#xACE0; &#xD558;&#xB294;&#xB370;&#xC694;&#x2026;&#x1FAE2;<br><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">NFT &#xCEEC;&#xB809;&#xC158;</a>&#xC744; &#xBC1C;&#xD589;&#xD558;&#xACE0;, &#xD574;&#xB2F9; &#xCEEC;&#xB809;&#xC158;&#xC5D0; &#xACF5;&#xC2DD; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xD53C;&#xC2F1; &#xC0AC;&#xC774;&#xD2B8;&#xB85C; &#xC704;&#xC7A5;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xC18D;&#xC5EC; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xD558;&#xB3C4;&#xB85D; &#xC720;&#xB3C4;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;. </p>
<p>NFT &#xCEEC;&#xB809;&#xC158; &#xC678;&#xC5D0;&#xB3C4; WEB 3.0&#xC758; &#xAC8C;&#xC784; &#xAC1C;&#xBC1C;&#xC790; &#xCC44;&#xC6A9; &#xACF5;&#xACE0;&#xC640; &#xAC8C;&#xC784;&#xC758; &#xC774;&#xB984;&#xC744; &#xD55C;&#xAE00;&#xC790;&#xB9CC; &#xBC14;&#xAFB8;&#xC5B4; SNS&#xC640; Discord&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xBA70; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC774; &#xC18D;&#xAE30; &#xC27D;&#xB3C4;&#xB85D; &#xC900;&#xBE44;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;&#x2026;&#x1F627;</p>
<p>&#xC774;&#xB4E4;&#xC758; &#xCD5C;&#xC885;&#xC801;&#xC778; &#xBAA9;&#xC801;&#xC740; &#xC5BB;&#xC5B4;&#xB0B8; &#xC815;&#xBCF4;&#xB97C; &#xD1B5;&#xD574; &#xC554;&#xD638;&#xD654;&#xD3D0; &#xC9C0;&#xAC11;&#xC5D0; &#xB4E4;&#xC5B4;&#xC788;&#xB294; &#xC790;&#xAE08;&#xC744; &#xD6D4;&#xCE58;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xD558;&#xB124;&#xC694;!&#x1F4B0;</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>&#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xC624;&#xB514;&#xD305; (Source Code Auditing)</strong> </p>
<p>&#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xAC80;&#xD1A0;&#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD558;&#xC5EC; &#xC624;&#xB958;&#xB098; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD0D0;&#xC0C9;&#xD558;&#xB294; &#xAE30;&#xBC95;</p>
<p><strong>.pyzw &#xD655;&#xC7A5;&#xC790;</strong> </p>
<p>Python &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;, &#xD30C;&#xC774;&#xC36C; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xD30C;&#xC77C;</p>
<p><strong>WEB 3.0</strong></p>
<p>&#xC778;&#xACF5;&#xC9C0;&#xB2A5;&#xACFC; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB9DE;&#xCDA4;&#xD615; &#xC815;&#xBCF4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC720;&#xB97C; &#xAC1C;&#xC778;&#xD654;&#xD558;&#xB294; 3&#xC138;&#xB300; &#xC778;&#xD130;&#xB137;</p>
<p><strong>&#xC778;&#xD3EC;&#xC2A4;&#xD2F8;&#xB7EC; &#xC545;&#xC131;&#xCF54;&#xB4DC;</strong> </p>
<p>&#xC815;&#xBCF4; &#xD0C8;&#xCDE8;&#xD615; &#xC545;&#xC131;&#xCF54;&#xB4DC;, &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB098; &#xC774;&#xBA54;&#xC77C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815; &#xC815;&#xBCF4;&#xB098; &#xAC00;&#xC0C1;&#xD654;&#xD3D0; &#xC9C0;&#xAC11; &#xC8FC;&#xC18C;, &#xD30C;&#xC77C;&#xACFC; &#xAC19;&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xD0C8;&#xCDE8;</p>
<p><strong>NFT &#xCEEC;&#xB809;&#xC158;</strong> </p>
<p>&#xB3D9;&#xC77C;&#xD55C; &#xC2A4;&#xB9C8;&#xD2B8; &#xCEE8;&#xD2B8;&#xB799;&#xD2B8;, &#xC791;&#xAC00;(&#xC544;&#xD2F0;&#xC2A4;&#xD2B8;, &#xC720;&#xBA85;&#xC778;&#xC0AC; &#xB4F1;) &#xB610;&#xB294; &#xC720;&#xC0AC;&#xD55C; &#xCEE8;&#xD150;&#xCE20; &#xAE30;&#xC900;&#xC73C;&#xB85C; NFT&#xB97C; &#xBB36;&#xC740; &#xB2E8;&#xC704;</p>
<p><strong>LLM (Large Language Models)</strong> </p>
<p>&#xB300;&#xADDC;&#xBAA8; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC73C;&#xB85C; &#xD559;&#xC2B5;&#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xB300;&#xADDC;&#xBAA8; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xAC00;&#xC9C4; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;</p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128934&amp;kind=&amp;sub_kind=">LG CNS, &#x2018;DAP GenAI &#xD50C;&#xB7AB;&#xD3FC;&#x2019;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xD615; AI &#xD574;&#xB2F5; &#xC81C;&#xC2DC;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128924&amp;kind=2&amp;sub_kind=">&#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;, 4&#xBC30; &#xC774;&#xC0C1; &#xBE60;&#xB978; &#xC640;&#xC774;&#xD30C;&#xC774;7 &#xAD6D;&#xB0B4; &#xC0C1;&#xC6A9;&#xD654; &#xBB38; &#xC5F0;&#xB2E4;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128941&amp;kind=3&amp;sub_kind=">&#xC18C;&#xD504;&#xD2B8;&#xCEA0;&#xD504;-&#xC5D0;&#xC4F0;&#xD540;&#xD14C;&#xD06C;&#xB180;&#xB85C;&#xC9C0;, &#xC0DD;&#xC131;&#xD615; AI &#xBCF4;&#xC548; &#xBD84;&#xC57C; &#xC0AC;&#xC5C5; &#xC5C5;&#xBB34;&#xD611;&#xC57D;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128901&amp;kind=&amp;sub_kind=">&#xC2A4;&#xB0C5;&#xD0DC;&#xADF8;, &#xCE74;&#xCE74;&#xC624;&#xBE0C;&#xB808;&#xC778; &#xCE7C;&#xB85C; &#xD1B5;&#xD574; &#xC0DD;&#xC131;&#xD55C; &#xC774;&#xBBF8;&#xC9C0; &#xCD9C;&#xCC98; &#xD655;&#xC778; &#xAC00;&#xB2A5;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=128902&amp;kind=&amp;sub_kind=">&#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xACF5;&#xACA9;&#xC790;&#xC5D0;&#xAC8C; &#xB3C8; &#xB0C8;&#xB294;&#xB370;&#xB3C4; &#xD611;&#xBC15;&#xC774; &#xC774;&#xC5B4;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ddaily.co.kr/page/view/2024041714491720474">&#xBC94;&#xB78C;&#xD558;&#xB294; AI &#xADDC;&#xC81C;&#xB7;&#xAC00;&#xC774;&#xB4DC;&#x2026;KISA, &#x2018;AI &#xBCF4;&#xC548; &#xAC00;&#xC774;&#xB4DC;&#xB77C;&#xC778;&#x2019; &#xB9CC;&#xB4E0;&#xB2E4;</a></p>
<h2 id="&#xC774;&#xBC88;&#xC8FC;-&#xC9F9;&#xC9F9;-CTF-amp-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;"><a href="#&#xC774;&#xBC88;&#xC8FC;-&#xC9F9;&#xC9F9;-CTF-amp-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#x1F425;" class="headerlink" title="&#xC774;&#xBC88;&#xC8FC; &#xC9F9;&#xC9F9; CTF &amp; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#x1F425;"></a>&#xC774;&#xBC88;&#xC8FC; &#xC9F9;&#xC9F9; CTF &amp; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; &#x1F425;</h2><p>&#x1F6A9; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dreamhack.io/ctf/518">.HACK CTF</a> | 24.04.27 ~ 2024.04.28 09:00 (24h)</p>
<p>&#x2B50;&#xFE0F; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dothack.io/">.HACK Conference</a> | 2024.05.27 ~ 2024.05.28 </p>
<p>&#x1F6A9; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://hacktheon.org/info.php">2024 HackTheon Sejong &#xAD6D;&#xC81C; &#xB300;&#xD559;&#xC0DD; &#xC0AC;&#xC774;&#xBC84;&#xBCF4;&#xC548; &#xACBD;&#xC9C4;&#xB300;&#xD68C;(CTF)</a> |  2024.04.27 09:00 (9h)</p>
<p>&#x2B50;&#xFE0F; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://hacktheon.org/i_info.php">2024 HackTheon Sejong &#xAD6D;&#xC81C; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</a> |  2024.06.19 ~ 2024.06.20 </p>
<h2 id="4&#xC6D4;-&#xAD50;&#xC721;-&#x1F425;"><a href="#4&#xC6D4;-&#xAD50;&#xC721;-&#x1F425;" class="headerlink" title="4&#xC6D4; &#xAD50;&#xC721; &#x1F425;"></a>4&#xC6D4; &#xAD50;&#xC721; &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://upside.center/">Upside &#xC544;&#xCE74;&#xB370;&#xBBF8;</a> | theori, &#xB450;&#xB098;&#xBB34; | 2024.04.26 &#xAE4C;&#xC9C0; &#xC811;&#xC218;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.kshieldjr.org/">K-Shield Jr. 12&#xAE30;</a> | KISA, &#xCEEC;&#xCC98;&#xBA54;&#xC774;&#xCEE4;&#xC2A4; | 2024.04.25 &#xAE4C;&#xC9C0; &#xC811;&#xC218;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.sktaifellowship.com/">AI Fellowship 6&#xAE30;</a> | SKT | 2024.05.06 &#xAE4C;&#xC9C0; &#xC811;&#xC218;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/clalxk/">clalxk</a>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_clalxk.jpg" srcset="/img/loading.gif" alt="clalxk">
                  </div>

                  <div class="link-text">
                    <div class="link-title">clalxk</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/clalxk">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/04/24/ogu123/cve-2024-3116/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-3116: PGAdminì˜ íŒŒì¼ ê²½ë¡œ ê²€ì¦ ë¶€ì¡±ìœ¼ë¡œ ì¸í•œ RCE ì·¨ì•½ì </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/04/21/l0ch/2024-04-21/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] BatBadBut: ì—¬ëŸ¬ í”„ë¡œê·¸ëž˜ë° ì–¸ì–´ì—ì„œ ë°œê²¬ëœ Windows bat íŒŒì¼ ëª…ë ¹ì¤„ ì¸ìˆ˜ë¥¼ í†µí•œ Command Injection ì·¨ì•½ì </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/04/22/clalxk/newsletter0422/';
        this.page.identifier = '/2024/04/22/clalxk/newsletter0422/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] í…”ë ˆê·¸ëž¨ ì‚¬ìš©í•˜ì‹œëŠ” ë¶„~~??&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
