

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC; &amp;#xB4DC;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB41C; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F647;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image1.jpeg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IoT / &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC774;&amp;#xC790;, &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBCA1;&amp;#xD130;&amp;#xC640; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB4F1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD328;&amp;#xD0B7; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD551;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD3EC;&amp;#xD2B8;(UART, JTAG &amp;#xB4F1;) &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB364;&amp;#xD504;&lt;/li&gt;
&lt;li&gt;Flash Memory&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB364;&amp;#xD504;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Flash memory&amp;#xB294; &amp;#xC800;&amp;#xC7A5; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Chip&amp;#xC73C;&amp;#xB85C; IoT &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; 8 pin &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xACB0;&amp;#xAD6D; &amp;#xC774; Flash Memory&amp;#xB77C;&amp;#xB294; Chip&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; flashrom &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC190;&amp;#xC27D;&amp;#xAC8C; Flash Memory &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC190;&amp;#xC0C1;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC758;&amp;#xD558;&amp;#xC5EC; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x26A0;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xB450;&amp;#xAE30;&amp;#xB098; &amp;#xC5F4;&amp;#xD48D;&amp;#xAE30; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F4;&amp;#xC744; &amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCE69;&amp;#xC774;&amp;#xB098; &amp;#xBCF4;&amp;#xB4DC;&amp;#xAC00; &amp;#xD0C8; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xD569;&amp;#xC120;&amp;#xC758; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xAD6C;&amp;#xC785;&amp;#xD55C; IoT/ &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xB9DD;&amp;#xAC00;&amp;#xB728;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xCE58; &amp;#xD669;&amp;#xAE08;&amp;#xC54C;&amp;#xC744; &amp;#xAEBC;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAC70;&amp;#xC704; &amp;#xBC30;&amp;#xB97C; &amp;#xAC08;&amp;#xB790;&amp;#xB2E4;&amp;#xAC00;, &amp;#xB3C4;&amp;#xB9AC;&amp;#xC5B4; &amp;#xAC70;&amp;#xC704;&amp;#xB9CC; &amp;#xC8FD;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC77C;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#x1FAA6;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9B0; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; Flash memory dump&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB78C;&amp;#xC9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flashrom&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Flash memory dump&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4DD;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Raspberry Pi&amp;#xC5D0; flashrom &amp;#xC124;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;Flash Memory Chip Off&lt;/li&gt;
&lt;li&gt;Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;Flash memory dump&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4B8;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Raspberry Pi (64 Bit)&lt;/li&gt;
&lt;li&gt;IC Test Hook Clip (SDK08)&lt;/li&gt;
&lt;li&gt;Heat Gun (&amp;#xC5F4;&amp;#xD48D;&amp;#xAE30;)&lt;/li&gt;
&lt;li&gt;&amp;#xC810;&amp;#xD37C; &amp;#xCF00;&amp;#xC774;&amp;#xBE14; &amp;#xBC0F; &amp;#xBE0C;&amp;#xB808;&amp;#xB4DC;&amp;#xBCF4;&amp;#xB4DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;1-flashrom-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#1-flashrom-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;1. flashrom &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;1. flashrom &amp;#xC124;&amp;#xCE58;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://www.flashrom.org/&#34;&gt;https://www.flashrom.org/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Flashrom&amp;#xC740; flash chip&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD50C;&amp;#xB798;&amp;#xC2DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;detecting, reading, writing, verifying, erasing&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;,&lt;/p&gt;
&lt;p&gt;&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; flash memory &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5ED;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD00;&amp;#xB828; Dependency&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0;, meson&amp;#xC73C;&amp;#xB85C; Raspberry Pi&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F352;&lt;/p&gt;
&lt;p&gt;Raspberry Pi&amp;#xB294; 64 Bit&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; &amp;#xC900;&amp;#xBE44;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;sudo apt-get install -y gcc meson ninja-build pkg-config python3-sphinx libcmocka-dev libpci-dev libusb-1.0-0-dev libftdi1-dev libjaylink-dev libssl-dev
git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; https://github.com/flashrom/flashrom
meson setup builddir
meson compile -C builddir
meson &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt; -C builddir
meson install -C builddir&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;2-Flash-Memory-Chip-Off&#34;&gt;&lt;a href=&#34;#2-Flash-Memory-Chip-Off&#34; class=&#34;headerlink&#34; title=&#34;2. Flash Memory Chip Off&#34;&gt;&lt;/a&gt;2. Flash Memory Chip Off&lt;/h2&gt;&lt;p&gt;flashrom&amp;#xC73C;&amp;#xB85C; Chip&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C;, Chip&amp;#xC774; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; Dump&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;, &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xC6D0;&amp;#xD65C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F47B;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, Raspberry Pi&amp;#xAC00; Chip&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xAE09; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD560; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xBCF4;&amp;#xB4DC; &amp;#xC804;&amp;#xCCB4;&amp;#xB85C; &amp;#xACF5;&amp;#xAE09;&amp;#xB418;&amp;#xC5B4; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB178;&amp;#xC774;&amp;#xC988; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; Raspberry Pi&amp;#xC758; VCC, GND &amp;#xD540;&amp;#xC744; Flash Memory Chip&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD540;&amp;#xC744; &amp;#xC811;&amp;#xCD09;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Chip Off&amp;#xB97C; &amp;#xD558;&amp;#xC5EC; Chip&amp;#xB9CC;&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5F4;&amp;#xD48D;&amp;#xAE30;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB55C;&amp;#xB0A9;&amp;#xC744; &amp;#xB179;&amp;#xC774;&amp;#xACE0; Chip Off&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9DD;&amp;#xAC00;&amp;#xC9C8; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xAE30;&amp;#xC5D0;, &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; Chip Off&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-Flash-memory-chip&amp;#xACFC;-Raspberry-Pi-&amp;#xC5F0;&amp;#xACB0;&#34;&gt;&lt;a href=&#34;#3-Flash-memory-chip&amp;#xACFC;-Raspberry-Pi-&amp;#xC5F0;&amp;#xACB0;&#34; class=&#34;headerlink&#34; title=&#34;3. Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&#34;&gt;&lt;/a&gt;3. Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&lt;/h2&gt;&lt;p&gt;&amp;#xBCF4;&amp;#xD1B5; &amp;#xC800;&amp;#xC804;&amp;#xB825; IoT &amp;#xBC0F; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; Flash memory&amp;#xB294; SPI &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; 8 pin chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;chip &amp;#xBAA8;&amp;#xB378;&amp;#xACFC; vendor&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC01; pin&amp;#xC758; &amp;#xC138;&amp;#xBD80; &amp;#xC5ED;&amp;#xD560;&amp;#xC5D0; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB294; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84; 8 pin&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xAC19;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xCE69;&amp;#xC758; Datasheet&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xC5EC; Pin out&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Datasheet&amp;#xC5D0;&amp;#xB294; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; Chip&amp;#xC758; &amp;#xC124;&amp;#xBA85;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC801;&amp;#xC5B4; &amp;#xB1A8;&amp;#xC73C;&amp;#xB2C8; &amp;#xAF2D; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Flash Memory&amp;#xC758; &amp;#xAC01; 8 pin&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4CC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;VCC: &amp;#xC804;&amp;#xC6D0;&amp;#xC744; &amp;#xACF5;&amp;#xAE09;&lt;/li&gt;
&lt;li&gt;GND: &amp;#xC811;&amp;#xC9C0;, &amp;#xAE30;&amp;#xC900; &amp;#xC804;&amp;#xC555;&amp;#xC744; &amp;#xACF5;&amp;#xAE09;&lt;/li&gt;
&lt;li&gt;Sclk(SCK, CLK): &amp;#xC9C1;&amp;#xB82C; &amp;#xD074;&amp;#xB7ED;, &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xC2E0;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;CS(SS): Chip Select, &amp;#xC7A5;&amp;#xCE58; &amp;#xBC0F; Chip &amp;#xC120;&amp;#xD0DD;&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC778; MCU&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; Chip &amp;#xC911; &amp;#xD2B9;&amp;#xC815; Chip&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; pin&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;DI(SI): Data Input&lt;ul&gt;
&lt;li&gt;Flash Memory&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC785;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;DO(SO): Data Output&lt;ul&gt;
&lt;li&gt;Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;WP: Write Protect, &amp;#xC4F0;&amp;#xAE30; &amp;#xBCF4;&amp;#xD638;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD540; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; Flash memory&amp;#xB85C; &amp;#xC4F0;&amp;#xAE30; &amp;#xBD88;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hold: Chip &amp;#xC77C;&amp;#xC2DC; &amp;#xC815;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD540; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; Flash memory &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xBA48;&amp;#xCDA4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Raspberry Pi&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; GPIO &amp;#xD540;&amp;#xACFC; Flash Memory&amp;#xC758; Pin&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; VCC, Hold, WP &amp;#xD540;&amp;#xC740; VCC &amp;#xC804;&amp;#xC6D0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD540;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Raspberry Pi GPIO &amp;#xD540;&amp;#xC5D0;&amp;#xB294; VCC &amp;#xD540;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xBE0C;&amp;#xB808;&amp;#xB4DC; &amp;#xBCF4;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; VCC &amp;#xC2E0;&amp;#xD638;&amp;#xB97C; &amp;#xACF5;&amp;#xAE09;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image6.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IC Test Hook Chip &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xAC01; &amp;#xD540;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC587;&amp;#xC740; Clip&amp;#xC77C;&amp;#xC218;&amp;#xB85D; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC27D;&amp;#xAE30;&amp;#xC5D0; &amp;#xC587;&amp;#xC740; Test Clip&amp;#xC73C;&amp;#xB85C; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;4-Flash-memory-dump&#34;&gt;&lt;a href=&#34;#4-Flash-memory-dump&#34; class=&#34;headerlink&#34; title=&#34;4. Flash memory dump&#34;&gt;&lt;/a&gt;4. Flash memory dump&lt;/h2&gt;&lt;p&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; Raspberry Pi &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F489;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xC5F0;&amp;#xACB0; &amp;#xD655;&amp;#xC778; &amp;#xBC0F; Chip &amp;#xBA85; &amp;#xD655;&amp;#xC778;&lt;/span&gt;
sudo flashrom -p linux_spi:dev=/dev/spidev0.0,spispeed=2000 -V

&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xCD94;&amp;#xCD9C;&lt;/span&gt;
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -r [&amp;#xC800;&amp;#xC7A5;&amp;#xD30C;&amp;#xC77C;&amp;#xBA85;]
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -c [Chip&amp;#xBA85;] -r [&amp;#xC800;&amp;#xC7A5;&amp;#xD30C;&amp;#xC77C;&amp;#xBA85;]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;flashrom&amp;#xC740; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; Chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xBC14;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; Chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;flashchips.h&lt;/code&gt;, &lt;code&gt;flashchips.c&lt;/code&gt;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC9C1;&amp;#xC811; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Datasheet&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &amp;#xC544;&amp;#xB798; flashchips.c &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB824;&amp;#xB294; Chip&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;flashchip&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;flashchips&lt;/span&gt;[] = {&lt;/span&gt;

	&lt;span class=&#34;hljs-comment&#34;&gt;/*&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .vendor		= Vendor name&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .name		= Chip name&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .bustype		= Supported flash bus types (Parallel, LPC...)&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .manufacture_id	= Manufacturer chip ID&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .model_id		= Model chip ID&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .total_size		= Total size in (binary) kbytes&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .page_size		= Page or eraseblock(?) size in bytes&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .tested		= Test status&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .probe		= Probe function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .probe_timing	= Probe function delay&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .block_erasers[]	= Array of erase layouts and erase functions&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * {&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 *	.eraseblocks[]	= Array of { blocksize, blockcount }&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 *	.block_erase	= Block erase function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * }&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .printlock		= Chip lock status function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .unlock		= Chip unlock function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .write		= Chip write function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .read		= Chip read function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .voltage		= Voltage range in millivolt&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 */&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; Flash memory dump&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xD558;&amp;#xC5EC; Chip &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; Firmware&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Flash Memory Chip off &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; Chip&amp;#xC774; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC4F0;&amp;#xC9C0; &amp;#xBABB;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &amp;#xC870;&amp;#xB9BD;&amp;#xC740; &amp;#xBD84;&amp;#xD574;&amp;#xC758; &amp;#xC5ED;&amp;#xC21C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Flash Memory Chip&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC798;(!) Resoldering&amp;#xD558;&amp;#xBA74; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xACE0; &amp;#xC7A5;&amp;#xBE44;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB450; &amp;#xB9C8;&amp;#xB9AC; &amp;#xD1A0;&amp;#xB07C;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC7A1;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;! &amp;#x1F925;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; UART/JTAG &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC5F0;&amp;#xACB0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F64F;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Flashrom으로 Flash Memory Dump하기 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC; &amp;#xB4DC;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB41C; &lt;code&gt;newp1ayer48&lt;/code&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F647;&amp;#x1F3FB;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image1.jpeg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IoT / &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC758; &amp;#xC2DC;&amp;#xC791;&amp;#xC774;&amp;#xC790;, &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xBCA1;&amp;#xD130;&amp;#xC640; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC;&amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xC815;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC2DD; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xB4F1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD328;&amp;#xD0B7; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD551;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD3EC;&amp;#xD2B8;(UART, JTAG &amp;#xB4F1;) &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB364;&amp;#xD504;&lt;/li&gt;
&lt;li&gt;Flash Memory&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB364;&amp;#xD504;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Flash memory&amp;#xB294; &amp;#xC800;&amp;#xC7A5; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Chip&amp;#xC73C;&amp;#xB85C; IoT &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBCF4;&amp;#xD1B5; 8 pin &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xACB0;&amp;#xAD6D; &amp;#xC774; Flash Memory&amp;#xB77C;&amp;#xB294; Chip&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD655;&amp;#xC2E4;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; flashrom &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC190;&amp;#xC27D;&amp;#xAC8C; Flash Memory &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC190;&amp;#xC0C1;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC758;&amp;#xD558;&amp;#xC5EC; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x26A0;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xB450;&amp;#xAE30;&amp;#xB098; &amp;#xC5F4;&amp;#xD48D;&amp;#xAE30; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F4;&amp;#xC744; &amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCE69;&amp;#xC774;&amp;#xB098; &amp;#xBCF4;&amp;#xB4DC;&amp;#xAC00; &amp;#xD0C8; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xD569;&amp;#xC120;&amp;#xC758; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC704;&amp;#xD574; &amp;#xAD6C;&amp;#xC785;&amp;#xD55C; IoT/ &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xB9DD;&amp;#xAC00;&amp;#xB728;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xCE58; &amp;#xD669;&amp;#xAE08;&amp;#xC54C;&amp;#xC744; &amp;#xAEBC;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xAC70;&amp;#xC704; &amp;#xBC30;&amp;#xB97C; &amp;#xAC08;&amp;#xB790;&amp;#xB2E4;&amp;#xAC00;, &amp;#xB3C4;&amp;#xB9AC;&amp;#xC5B4; &amp;#xAC70;&amp;#xC704;&amp;#xB9CC; &amp;#xC8FD;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC77C;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#x1FAA6;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9B0; &amp;#xB2E4;&amp;#xB978; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; Flash memory dump&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBC14;&amp;#xB78C;&amp;#xC9C1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;flashrom&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Flash memory dump&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4DD;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Raspberry Pi&amp;#xC5D0; flashrom &amp;#xC124;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;Flash Memory Chip Off&lt;/li&gt;
&lt;li&gt;Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&lt;/li&gt;
&lt;li&gt;Flash memory dump&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4B8;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Raspberry Pi (64 Bit)&lt;/li&gt;
&lt;li&gt;IC Test Hook Clip (SDK08)&lt;/li&gt;
&lt;li&gt;Heat Gun (&amp;#xC5F4;&amp;#xD48D;&amp;#xAE30;)&lt;/li&gt;
&lt;li&gt;&amp;#xC810;&amp;#xD37C; &amp;#xCF00;&amp;#xC774;&amp;#xBE14; &amp;#xBC0F; &amp;#xBE0C;&amp;#xB808;&amp;#xB4DC;&amp;#xBCF4;&amp;#xB4DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;1-flashrom-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#1-flashrom-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;1. flashrom &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;1. flashrom &amp;#xC124;&amp;#xCE58;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://www.flashrom.org/&#34;&gt;https://www.flashrom.org/&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Flashrom&amp;#xC740; flash chip&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD50C;&amp;#xB798;&amp;#xC2DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;detecting, reading, writing, verifying, erasing&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;,&lt;/p&gt;
&lt;p&gt;&amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; flash memory &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC5ED;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAD00;&amp;#xB828; Dependency&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0;, meson&amp;#xC73C;&amp;#xB85C; Raspberry Pi&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F352;&lt;/p&gt;
&lt;p&gt;Raspberry Pi&amp;#xB294; 64 Bit&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; &amp;#xC900;&amp;#xBE44;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;sudo apt-get install -y gcc meson ninja-build pkg-config python3-sphinx libcmocka-dev libpci-dev libusb-1.0-0-dev libftdi1-dev libjaylink-dev libssl-dev
git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; https://github.com/flashrom/flashrom
meson setup builddir
meson compile -C builddir
meson &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt; -C builddir
meson install -C builddir&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;2-Flash-Memory-Chip-Off&#34;&gt;&lt;a href=&#34;#2-Flash-Memory-Chip-Off&#34; class=&#34;headerlink&#34; title=&#34;2. Flash Memory Chip Off&#34;&gt;&lt;/a&gt;2. Flash Memory Chip Off&lt;/h2&gt;&lt;p&gt;flashrom&amp;#xC73C;&amp;#xB85C; Chip&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C;, Chip&amp;#xC774; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; Dump&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;, &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xC6D0;&amp;#xD65C;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F47B;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC7A5;&amp;#xBE44;&amp;#xC640; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, Raspberry Pi&amp;#xAC00; Chip&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xAE09; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD560; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xBCF4;&amp;#xB4DC; &amp;#xC804;&amp;#xCCB4;&amp;#xB85C; &amp;#xACF5;&amp;#xAE09;&amp;#xB418;&amp;#xC5B4; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB178;&amp;#xC774;&amp;#xC988; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xBC29;&amp;#xD574;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB420; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; Raspberry Pi&amp;#xC758; VCC, GND &amp;#xD540;&amp;#xC744; Flash Memory Chip&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xD540;&amp;#xC744; &amp;#xC811;&amp;#xCD09;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xB9CC;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC804;&amp;#xC6D0;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; Chip Off&amp;#xB97C; &amp;#xD558;&amp;#xC5EC; Chip&amp;#xB9CC;&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5F4;&amp;#xD48D;&amp;#xAE30;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB55C;&amp;#xB0A9;&amp;#xC744; &amp;#xB179;&amp;#xC774;&amp;#xACE0; Chip Off&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9DD;&amp;#xAC00;&amp;#xC9C8; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xB9E4;&amp;#xC6B0; &amp;#xB192;&amp;#xAE30;&amp;#xC5D0;, &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC11C; Chip Off&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;3-Flash-memory-chip&amp;#xACFC;-Raspberry-Pi-&amp;#xC5F0;&amp;#xACB0;&#34;&gt;&lt;a href=&#34;#3-Flash-memory-chip&amp;#xACFC;-Raspberry-Pi-&amp;#xC5F0;&amp;#xACB0;&#34; class=&#34;headerlink&#34; title=&#34;3. Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&#34;&gt;&lt;/a&gt;3. Flash memory chip&amp;#xACFC; Raspberry Pi &amp;#xC5F0;&amp;#xACB0;&lt;/h2&gt;&lt;p&gt;&amp;#xBCF4;&amp;#xD1B5; &amp;#xC800;&amp;#xC804;&amp;#xB825; IoT &amp;#xBC0F; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; Flash memory&amp;#xB294; SPI &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; 8 pin chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;chip &amp;#xBAA8;&amp;#xB378;&amp;#xACFC; vendor&amp;#xB9C8;&amp;#xB2E4; &amp;#xAC01; pin&amp;#xC758; &amp;#xC138;&amp;#xBD80; &amp;#xC5ED;&amp;#xD560;&amp;#xC5D0; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB294; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB300;&amp;#xBD80;&amp;#xBD84; 8 pin&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xAC19;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xCE69;&amp;#xC758; Datasheet&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xC5EC; Pin out&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Datasheet&amp;#xC5D0;&amp;#xB294; &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; Chip&amp;#xC758; &amp;#xC124;&amp;#xBA85;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC801;&amp;#xC5B4; &amp;#xB1A8;&amp;#xC73C;&amp;#xB2C8; &amp;#xAF2D; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Flash Memory&amp;#xC758; &amp;#xAC01; 8 pin&amp;#xC758; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F4CC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;VCC: &amp;#xC804;&amp;#xC6D0;&amp;#xC744; &amp;#xACF5;&amp;#xAE09;&lt;/li&gt;
&lt;li&gt;GND: &amp;#xC811;&amp;#xC9C0;, &amp;#xAE30;&amp;#xC900; &amp;#xC804;&amp;#xC555;&amp;#xC744; &amp;#xACF5;&amp;#xAE09;&lt;/li&gt;
&lt;li&gt;Sclk(SCK, CLK): &amp;#xC9C1;&amp;#xB82C; &amp;#xD074;&amp;#xB7ED;, &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xC2E0;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;CS(SS): Chip Select, &amp;#xC7A5;&amp;#xCE58; &amp;#xBC0F; Chip &amp;#xC120;&amp;#xD0DD;&lt;ul&gt;
&lt;li&gt;&amp;#xBA54;&amp;#xC778; MCU&amp;#xC5D0;&amp;#xC11C; &amp;#xC5EC;&amp;#xB7EC; Chip &amp;#xC911; &amp;#xD2B9;&amp;#xC815; Chip&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; pin&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;DI(SI): Data Input&lt;ul&gt;
&lt;li&gt;Flash Memory&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC785;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;DO(SO): Data Output&lt;ul&gt;
&lt;li&gt;Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;WP: Write Protect, &amp;#xC4F0;&amp;#xAE30; &amp;#xBCF4;&amp;#xD638;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD540; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; Flash memory&amp;#xB85C; &amp;#xC4F0;&amp;#xAE30; &amp;#xBD88;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Hold: Chip &amp;#xC77C;&amp;#xC2DC; &amp;#xC815;&amp;#xC9C0;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD540; &amp;#xC2E0;&amp;#xD638;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; Flash memory &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xBA48;&amp;#xCDA4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Raspberry Pi&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; GPIO &amp;#xD540;&amp;#xACFC; Flash Memory&amp;#xC758; Pin&amp;#xC744; &amp;#xC5F0;&amp;#xACB0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Flash Memory&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; VCC, Hold, WP &amp;#xD540;&amp;#xC740; VCC &amp;#xC804;&amp;#xC6D0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD540;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Raspberry Pi GPIO &amp;#xD540;&amp;#xC5D0;&amp;#xB294; VCC &amp;#xD540;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xBE0C;&amp;#xB808;&amp;#xB4DC; &amp;#xBCF4;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; VCC &amp;#xC2E0;&amp;#xD638;&amp;#xB97C; &amp;#xACF5;&amp;#xAE09;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image6.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IC Test Hook Chip &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xAC01; &amp;#xD540;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC587;&amp;#xC740; Clip&amp;#xC77C;&amp;#xC218;&amp;#xB85D; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC27D;&amp;#xAE30;&amp;#xC5D0; &amp;#xC587;&amp;#xC740; Test Clip&amp;#xC73C;&amp;#xB85C; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xBA74; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;4-Flash-memory-dump&#34;&gt;&lt;a href=&#34;#4-Flash-memory-dump&#34; class=&#34;headerlink&#34; title=&#34;4. Flash memory dump&#34;&gt;&lt;/a&gt;4. Flash memory dump&lt;/h2&gt;&lt;p&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74; Raspberry Pi &amp;#xD130;&amp;#xBBF8;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F489;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xC5F0;&amp;#xACB0; &amp;#xD655;&amp;#xC778; &amp;#xBC0F; Chip &amp;#xBA85; &amp;#xD655;&amp;#xC778;&lt;/span&gt;
sudo flashrom -p linux_spi:dev=/dev/spidev0.0,spispeed=2000 -V

&lt;span class=&#34;hljs-comment&#34;&gt;# &amp;#xCD94;&amp;#xCD9C;&lt;/span&gt;
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -r [&amp;#xC800;&amp;#xC7A5;&amp;#xD30C;&amp;#xC77C;&amp;#xBA85;]
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -c [Chip&amp;#xBA85;] -r [&amp;#xC800;&amp;#xC7A5;&amp;#xD30C;&amp;#xC77C;&amp;#xBA85;]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;flashrom&amp;#xC740; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; Chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xBC14;&amp;#xB85C; &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; Chip&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;flashchips.h&lt;/code&gt;, &lt;code&gt;flashchips.c&lt;/code&gt;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC9C1;&amp;#xC811; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xCD94;&amp;#xCD9C;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Datasheet&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &amp;#xC544;&amp;#xB798; flashchips.c &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB824;&amp;#xB294; Chip&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xC785;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;flashchip&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;flashchips&lt;/span&gt;[] = {&lt;/span&gt;

	&lt;span class=&#34;hljs-comment&#34;&gt;/*&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .vendor		= Vendor name&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .name		= Chip name&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .bustype		= Supported flash bus types (Parallel, LPC...)&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .manufacture_id	= Manufacturer chip ID&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .model_id		= Model chip ID&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .total_size		= Total size in (binary) kbytes&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .page_size		= Page or eraseblock(?) size in bytes&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .tested		= Test status&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .probe		= Probe function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .probe_timing	= Probe function delay&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .block_erasers[]	= Array of erase layouts and erase functions&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * {&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 *	.eraseblocks[]	= Array of { blocksize, blockcount }&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 *	.block_erase	= Block erase function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * }&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .printlock		= Chip lock status function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .unlock		= Chip unlock function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .write		= Chip write function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .read		= Chip read function&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 * .voltage		= Voltage range in millivolt&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;	 */&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; Flash memory dump&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xD558;&amp;#xC5EC; Chip &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; Firmware&amp;#xB97C; &amp;#xCD94;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Flash Memory Chip off &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; Chip&amp;#xC774; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC838; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xC4F0;&amp;#xC9C0; &amp;#xBABB;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;! &amp;#xC870;&amp;#xB9BD;&amp;#xC740; &amp;#xBD84;&amp;#xD574;&amp;#xC758; &amp;#xC5ED;&amp;#xC21C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Flash Memory Chip&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC798;(!) Resoldering&amp;#xD558;&amp;#xBA74; &amp;#xC7A5;&amp;#xBE44;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD68D;&amp;#xB4DD;&amp;#xD558;&amp;#xACE0; &amp;#xC7A5;&amp;#xBE44;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB450; &amp;#xB9C8;&amp;#xB9AC; &amp;#xD1A0;&amp;#xB07C;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC7A1;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;! &amp;#x1F925;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/03/09/newp1ayer48/flashrom/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC784;&amp;#xBCA0;&amp;#xB514;&amp;#xB4DC; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC8FC; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; UART/JTAG &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD3EC;&amp;#xD2B8; &amp;#xC5F0;&amp;#xACB0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#x1F64F;&amp;#x1F3FB;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/03/09/newp1ayer48/flashrom/ko/image2.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/03/09/newp1ayer48/flashrom/ko/">

  <title>[Research] Flashrom으로 Flash Memory Dump하기 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-03-09 12:00" pubdate>
      2025년 3월 9일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.9k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      38
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Flashrom으로 Flash Memory Dump하기</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xC774;&#xBC88;&#xC5D0; &#xC0C8;&#xB85C; &#xC778;&#xC0AC; &#xB4DC;&#xB9AC;&#xAC8C; &#xB41C; <code>newp1ayer48</code> &#xC785;&#xB2C8;&#xB2E4;! &#x1F647;&#x1F3FB;</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image1.jpeg" srcset="/img/loading.gif" alt></p>
<p>IoT / &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xD574;&#xD0B9;&#xC758; &#xC2DC;&#xC791;&#xC774;&#xC790;, &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xBD80;&#xBD84;&#xC740; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xD68D;&#xB4DD;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD38C;&#xC6E8;&#xC5B4;&#xAC00; &#xC788;&#xC5B4;&#xC57C; &#xC7A5;&#xBE44;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBCA1;&#xD130;&#xC640; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xD68D;&#xB4DD;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0;&#xB9CC; &#xB300;&#xD45C;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xB4E4;&#xC744; &#xC544;&#xB798;&#xCC98;&#xB7FC; &#xC815;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xACF5;&#xC2DD; &#xD648;&#xD398;&#xC774;&#xC9C0; &#xB4F1;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xD38C;&#xC6E8;&#xC5B4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;</li>
<li>&#xD38C;&#xC6E8;&#xC5B4; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD328;&#xD0B7; &#xC2A4;&#xB2C8;&#xD551;</li>
<li>&#xB514;&#xBC84;&#xAE45; &#xD3EC;&#xD2B8;(UART, JTAG &#xB4F1;) &#xC5F0;&#xACB0;&#xC744; &#xD1B5;&#xD55C; &#xD38C;&#xC6E8;&#xC5B4; &#xB364;&#xD504;</li>
<li>Flash Memory&#xC5D0; &#xC9C1;&#xC811; &#xC5F0;&#xACB0;&#xD558;&#xC5EC; &#xD38C;&#xC6E8;&#xC5B4; &#xB364;&#xD504;</li>
</ul>
<p>Flash memory&#xB294; &#xC800;&#xC7A5; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; Chip&#xC73C;&#xB85C; IoT &#xAE30;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xBCF4;&#xD1B5; 8 pin &#xD615;&#xD0DC;&#xB85C; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD38C;&#xC6E8;&#xC5B4;&#xB294; &#xACB0;&#xAD6D; &#xC774; Flash Memory&#xB77C;&#xB294; Chip&#xC5D0; &#xB4E4;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, Flash Memory&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD655;&#xC2E4;&#xD558;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; flashrom &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xC190;&#xC27D;&#xAC8C; Flash Memory &#xB0B4;&#xBD80;&#xC758; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC774; &#xBC29;&#xBC95;&#xC740; &#xC7A5;&#xBE44;&#xC640; &#xBCF4;&#xB4DC;&#xC5D0; &#xC190;&#xC0C1;&#xC744; &#xC720;&#xBC1C;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC774;&#xAE30;&#xC5D0; &#xC8FC;&#xC758;&#xD558;&#xC5EC; &#xC2DC;&#xB3C4;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#x26A0;&#xFE0F;</p>
<p>&#xC778;&#xB450;&#xAE30;&#xB098; &#xC5F4;&#xD48D;&#xAE30; &#xB4F1;&#xC73C;&#xB85C; &#xBCF4;&#xB4DC;&#xC5D0; &#xC9C1;&#xC811; &#xC5F4;&#xC744; &#xAC00;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCE69;&#xC774;&#xB098; &#xBCF4;&#xB4DC;&#xAC00; &#xD0C8; &#xC218;&#xB3C4; &#xC788;&#xACE0;, &#xC798;&#xBABB;&#xB41C; &#xC5F0;&#xACB0;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xBA74; &#xD569;&#xC120;&#xC758; &#xC704;&#xD5D8;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xBB38;&#xC81C;&#xB85C; &#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC704;&#xD574; &#xAD6C;&#xC785;&#xD55C; IoT/ &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC7A5;&#xBE44;&#xB97C; &#xB9DD;&#xAC00;&#xB728;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xCE58; &#xD669;&#xAE08;&#xC54C;&#xC744; &#xAEBC;&#xB0B4;&#xAE30; &#xC704;&#xD574; &#xAC70;&#xC704; &#xBC30;&#xB97C; &#xAC08;&#xB790;&#xB2E4;&#xAC00;, &#xB3C4;&#xB9AC;&#xC5B4; &#xAC70;&#xC704;&#xB9CC; &#xC8FD;&#xAC8C; &#xB418;&#xC5B4;&#xBC84;&#xB9AC;&#xB294; &#xC77C;&#xACFC; &#xBE44;&#xC2B7;&#xD569;&#xB2C8;&#xB2E4;&#x2026; &#x1FAA6;</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCD9C;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xBA74;, &#xC704;&#xC5D0;&#xC11C; &#xC18C;&#xAC1C;&#xD574;&#xB4DC;&#xB9B0; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xB4E4;&#xC740; &#xBA3C;&#xC800; &#xC2DC;&#xB3C4;&#xD574;&#xBCF4;&#xACE0; Flash memory dump&#xB97C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xBC14;&#xB78C;&#xC9C1;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>flashrom&#xC744; &#xC774;&#xC6A9;&#xD55C; Flash memory dump&#xC758; &#xD750;&#xB984;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F4DD;</p>
<ol>
<li>Raspberry Pi&#xC5D0; flashrom &#xC124;&#xCE58;</li>
<li>Flash Memory Chip Off</li>
<li>Flash memory chip&#xACFC; Raspberry Pi &#xC5F0;&#xACB0;</li>
<li>Flash memory dump</li>
</ol>
<p>&#xD544;&#xC694;&#xD55C; &#xC7A5;&#xBE44;&#xC640; &#xB3C4;&#xAD6C;&#xC758; &#xBAA9;&#xB85D;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F4B8;</p>
<ul>
<li>Raspberry Pi (64 Bit)</li>
<li>IC Test Hook Clip (SDK08)</li>
<li>Heat Gun (&#xC5F4;&#xD48D;&#xAE30;)</li>
<li>&#xC810;&#xD37C; &#xCF00;&#xC774;&#xBE14; &#xBC0F; &#xBE0C;&#xB808;&#xB4DC;&#xBCF4;&#xB4DC;</li>
</ul>
<h2 id="1-flashrom-&#xC124;&#xCE58;"><a href="#1-flashrom-&#xC124;&#xCE58;" class="headerlink" title="1. flashrom &#xC124;&#xCE58;"></a>1. flashrom &#xC124;&#xCE58;</h2><blockquote>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.flashrom.org/">https://www.flashrom.org/</a></p>
</blockquote>
<p>Flashrom&#xC740; flash chip&#xC5D0; &#xB370;&#xC774;&#xD130;&#xC640; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xD50C;&#xB798;&#xC2DC;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC1C;&#xBC1C; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>detecting, reading, writing, verifying, erasing&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;,</p>
<p>&#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xD574;&#xD0B9;&#xC5D0;&#xC11C;&#xB294; &#xC774; &#xB3C4;&#xAD6C;&#xB97C; &#xD1B5;&#xD574; flash memory &#xC548;&#xC5D0; &#xC788;&#xB294; &#xD38C;&#xC6E8;&#xC5B4;&#xB97C; &#xC5ED;&#xC73C;&#xB85C; &#xCD94;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAD00;&#xB828; Dependency&#xB97C; &#xC124;&#xCE58;&#xD558;&#xACE0;, meson&#xC73C;&#xB85C; Raspberry Pi&#xC5D0;&#xC11C; &#xC124;&#xCE58;&#xB97C; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#x1F352;</p>
<p>Raspberry Pi&#xB294; 64 Bit&#xB85C; &#xC124;&#xCE58;&#xD558;&#xC5EC; &#xC900;&#xBE44;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">sudo apt-get install -y gcc meson ninja-build pkg-config python3-sphinx libcmocka-dev libpci-dev libusb-1.0-0-dev libftdi1-dev libjaylink-dev libssl-dev
git <span class="hljs-built_in">clone</span> https://github.com/flashrom/flashrom
meson setup builddir
meson compile -C builddir
meson <span class="hljs-built_in">test</span> -C builddir
meson install -C builddir</code></pre>
<h2 id="2-Flash-Memory-Chip-Off"><a href="#2-Flash-Memory-Chip-Off" class="headerlink" title="2. Flash Memory Chip Off"></a>2. Flash Memory Chip Off</h2><p>flashrom&#xC73C;&#xB85C; Chip&#xC744; &#xCD94;&#xCD9C;&#xD560; &#xB54C;, Chip&#xC774; &#xBCF4;&#xB4DC;&#xC5D0; &#xC5F0;&#xACB0;&#xB41C; &#xC0C1;&#xD0DC;&#xB85C; Dump&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA74;, &#xCD94;&#xCD9C;&#xC774; &#xC6D0;&#xD65C;&#xD558;&#xAC8C; &#xB418;&#xC9C0; &#xC54A;&#xC744; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F47B;</p>
<p>&#xC774;&#xC720;&#xB294; &#xC7A5;&#xBE44;&#xC640; &#xBCF4;&#xB4DC;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB974;&#xACA0;&#xC9C0;&#xB9CC;, Raspberry Pi&#xAC00; Chip&#xC73C;&#xB85C; &#xACF5;&#xAE09; &#xB418;&#xC5B4;&#xC57C; &#xD560; &#xC804;&#xC6D0;&#xC774; &#xBCF4;&#xB4DC; &#xC804;&#xCCB4;&#xB85C; &#xACF5;&#xAE09;&#xB418;&#xC5B4; &#xBCF4;&#xB4DC;&#xC5D0; &#xB178;&#xC774;&#xC988; &#xC2E0;&#xD638;&#xAC00; &#xCD94;&#xCD9C;&#xC744; &#xBC29;&#xD574;&#xD558;&#xAC70;&#xB098; &#xBB38;&#xC81C;&#xAC00; &#xB420; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xB294; Raspberry Pi&#xC758; VCC, GND &#xD540;&#xC744; Flash Memory Chip&#xC5D0; &#xD574;&#xB2F9; &#xD540;&#xC744; &#xC811;&#xCD09;&#xD558;&#xB294; &#xAC83; &#xB9CC;&#xC73C;&#xB85C; &#xBCF4;&#xB4DC;&#xC5D0; &#xC804;&#xC6D0;&#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0AC;&#xC9C4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBCF4;&#xB4DC;&#xC5D0;&#xC11C; Chip Off&#xB97C; &#xD558;&#xC5EC; Chip&#xB9CC;&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5F4;&#xD48D;&#xAE30;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xB55C;&#xB0A9;&#xC744; &#xB179;&#xC774;&#xACE0; Chip Off&#xB97C; &#xC2E4;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBCF4;&#xB4DC;&#xAC00; &#xB9DD;&#xAC00;&#xC9C8; &#xC704;&#xD5D8;&#xC774; &#xB9E4;&#xC6B0; &#xB192;&#xAE30;&#xC5D0;, &#xC8FC;&#xC758;&#xD574;&#xC11C; Chip Off&#xB97C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image4.png" srcset="/img/loading.gif" alt></p>
<h2 id="3-Flash-memory-chip&#xACFC;-Raspberry-Pi-&#xC5F0;&#xACB0;"><a href="#3-Flash-memory-chip&#xACFC;-Raspberry-Pi-&#xC5F0;&#xACB0;" class="headerlink" title="3. Flash memory chip&#xACFC; Raspberry Pi &#xC5F0;&#xACB0;"></a>3. Flash memory chip&#xACFC; Raspberry Pi &#xC5F0;&#xACB0;</h2><p>&#xBCF4;&#xD1B5; &#xC800;&#xC804;&#xB825; IoT &#xBC0F; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xC7A5;&#xBE44;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xB294; Flash memory&#xB294; SPI &#xD1B5;&#xC2E0;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; 8 pin chip&#xC778; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>chip &#xBAA8;&#xB378;&#xACFC; vendor&#xB9C8;&#xB2E4; &#xAC01; pin&#xC758; &#xC138;&#xBD80; &#xC5ED;&#xD560;&#xC5D0; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC744; &#xC218;&#xB294; &#xC788;&#xC9C0;&#xB9CC;, &#xB300;&#xBD80;&#xBD84; 8 pin&#xC758; &#xC5ED;&#xD560;&#xC740; &#xAC19;&#xC73C;&#xBBC0;&#xB85C; &#xD574;&#xB2F9; &#xCE69;&#xC758; Datasheet&#xB97C; &#xD655;&#xBCF4;&#xD558;&#xC5EC; Pin out&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Datasheet&#xC5D0;&#xB294; &#xC81C;&#xC870;&#xC0AC;&#xAC00; &#xD574;&#xB2F9; Chip&#xC758; &#xC124;&#xBA85;&#xACFC; &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD55C; &#xBAA8;&#xB4E0; &#xC815;&#xBCF4;&#xB97C; &#xC801;&#xC5B4; &#xB1A8;&#xC73C;&#xB2C8; &#xAF2D; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image5.png" srcset="/img/loading.gif" alt></p>
<p>Flash Memory&#xC758; &#xAC01; 8 pin&#xC758; &#xC5ED;&#xD560;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F4CC;</p>
<ul>
<li>VCC: &#xC804;&#xC6D0;&#xC744; &#xACF5;&#xAE09;</li>
<li>GND: &#xC811;&#xC9C0;, &#xAE30;&#xC900; &#xC804;&#xC555;&#xC744; &#xACF5;&#xAE09;</li>
<li>Sclk(SCK, CLK): &#xC9C1;&#xB82C; &#xD074;&#xB7ED;, &#xB3D9;&#xAE30;&#xD654; &#xC2E0;&#xD638;</li>
<li>CS(SS): Chip Select, &#xC7A5;&#xCE58; &#xBC0F; Chip &#xC120;&#xD0DD;<ul>
<li>&#xBA54;&#xC778; MCU&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; Chip &#xC911; &#xD2B9;&#xC815; Chip&#xC744; &#xC120;&#xD0DD;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; pin</li>
</ul>
</li>
<li>DI(SI): Data Input<ul>
<li>Flash Memory&#xB85C; &#xB370;&#xC774;&#xD130; &#xC785;&#xB825;</li>
</ul>
</li>
<li>DO(SO): Data Output<ul>
<li>Flash Memory&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130; &#xCD9C;&#xB825;</li>
</ul>
</li>
<li>WP: Write Protect, &#xC4F0;&#xAE30; &#xBCF4;&#xD638;<ul>
<li>&#xC774; &#xD540; &#xC2E0;&#xD638;&#xAC00; &#xD65C;&#xC131;&#xD654; &#xB41C; &#xACBD;&#xC6B0; Flash memory&#xB85C; &#xC4F0;&#xAE30; &#xBD88;&#xAC00;</li>
</ul>
</li>
<li>Hold: Chip &#xC77C;&#xC2DC; &#xC815;&#xC9C0;<ul>
<li>&#xC774; &#xD540; &#xC2E0;&#xD638;&#xAC00; &#xD65C;&#xC131;&#xD654; &#xB41C; &#xACBD;&#xC6B0; Flash memory &#xB3D9;&#xC791;&#xC774; &#xBA48;&#xCDA4;</li>
</ul>
</li>
</ul>
<p>Raspberry Pi&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; GPIO &#xD540;&#xACFC; Flash Memory&#xC758; Pin&#xC744; &#xC5F0;&#xACB0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Flash Memory&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; VCC, Hold, WP &#xD540;&#xC740; VCC &#xC804;&#xC6D0;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD540;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Raspberry Pi GPIO &#xD540;&#xC5D0;&#xB294; VCC &#xD540;&#xC774; &#xBD80;&#xC871;&#xD558;&#xBBC0;&#xB85C; &#xBE0C;&#xB808;&#xB4DC; &#xBCF4;&#xB4DC; &#xB4F1;&#xC73C;&#xB85C; VCC &#xC2E0;&#xD638;&#xB97C; &#xACF5;&#xAE09;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image6.jpg" srcset="/img/loading.gif" alt></p>
<p>IC Test Hook Chip &#xC7A5;&#xBE44;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xAC01; &#xD540;&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xCD94;&#xCD9C;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC587;&#xC740; Clip&#xC77C;&#xC218;&#xB85D; &#xC5F0;&#xACB0;&#xC774; &#xC27D;&#xAE30;&#xC5D0; &#xC587;&#xC740; Test Clip&#xC73C;&#xB85C; &#xC900;&#xBE44;&#xD558;&#xBA74; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image7.png" srcset="/img/loading.gif" alt></p>
<h2 id="4-Flash-memory-dump"><a href="#4-Flash-memory-dump" class="headerlink" title="4. Flash memory dump"></a>4. Flash memory dump</h2><p>&#xC5F0;&#xACB0;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xBA74; Raspberry Pi &#xD130;&#xBBF8;&#xB110;&#xC5D0;&#xC11C; &#xC544;&#xB798; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xCD94;&#xCD9C;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#x1F489;</p>
<pre><code class="hljs bash"><span class="hljs-comment"># &#xC5F0;&#xACB0; &#xD655;&#xC778; &#xBC0F; Chip &#xBA85; &#xD655;&#xC778;</span>
sudo flashrom -p linux_spi:dev=/dev/spidev0.0,spispeed=2000 -V

<span class="hljs-comment"># &#xCD94;&#xCD9C;</span>
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -r [&#xC800;&#xC7A5;&#xD30C;&#xC77C;&#xBA85;]
sudo flashrom -p linux_spi:dev=/dev/spidev0.0 -c [Chip&#xBA85;] -r [&#xC800;&#xC7A5;&#xD30C;&#xC77C;&#xBA85;]</code></pre>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image8.png" srcset="/img/loading.gif" alt></p>
<p>flashrom&#xC740; &#xC9C0;&#xC6D0;&#xD558;&#xB294; Chip&#xC778; &#xACBD;&#xC6B0; &#xBC14;&#xB85C; &#xCD94;&#xCD9C;&#xC774; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; Chip&#xC778; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; <code>flashchips.h</code>, <code>flashchips.c</code>&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0;, &#xC9C1;&#xC811; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xBE4C;&#xB4DC;&#xD558;&#xBA74; &#xCD94;&#xCD9C;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Datasheet&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC5EC; &#xC544;&#xB798; flashchips.c &#xD30C;&#xC77C;&#xC5D0; &#xCD94;&#xAC00;&#xD558;&#xB824;&#xB294; Chip&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xAE30;&#xC785;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">const</span> <span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">flashchip</span> <span class="hljs-title">flashchips</span>[] = {</span>

	<span class="hljs-comment">/*</span>
<span class="hljs-comment">	 * .vendor		= Vendor name</span>
<span class="hljs-comment">	 * .name		= Chip name</span>
<span class="hljs-comment">	 * .bustype		= Supported flash bus types (Parallel, LPC...)</span>
<span class="hljs-comment">	 * .manufacture_id	= Manufacturer chip ID</span>
<span class="hljs-comment">	 * .model_id		= Model chip ID</span>
<span class="hljs-comment">	 * .total_size		= Total size in (binary) kbytes</span>
<span class="hljs-comment">	 * .page_size		= Page or eraseblock(?) size in bytes</span>
<span class="hljs-comment">	 * .tested		= Test status</span>
<span class="hljs-comment">	 * .probe		= Probe function</span>
<span class="hljs-comment">	 * .probe_timing	= Probe function delay</span>
<span class="hljs-comment">	 * .block_erasers[]	= Array of erase layouts and erase functions</span>
<span class="hljs-comment">	 * {</span>
<span class="hljs-comment">	 *	.eraseblocks[]	= Array of { blocksize, blockcount }</span>
<span class="hljs-comment">	 *	.block_erase	= Block erase function</span>
<span class="hljs-comment">	 * }</span>
<span class="hljs-comment">	 * .printlock		= Chip lock status function</span>
<span class="hljs-comment">	 * .unlock		= Chip unlock function</span>
<span class="hljs-comment">	 * .write		= Chip write function</span>
<span class="hljs-comment">	 * .read		= Chip read function</span>
<span class="hljs-comment">	 * .voltage		= Voltage range in millivolt</span>
<span class="hljs-comment">	 */</span>
</code></pre>
<p>&#xC704; &#xACFC;&#xC815;&#xC73C;&#xB85C; Flash memory dump&#xB97C; &#xC2E4;&#xC2DC;&#xD558;&#xC5EC; Chip &#xB0B4;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; Firmware&#xB97C; &#xCD94;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>Flash Memory Chip off &#xC774;&#xD6C4;&#xC5D0;&#xB294; Chip&#xC774; &#xB5A8;&#xC5B4;&#xC838; &#xC788;&#xAE30;&#xC5D0; &#xC7A5;&#xBE44;&#xB97C; &#xC4F0;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xD558;&#xC9C0;&#xB9CC;! &#xC870;&#xB9BD;&#xC740; &#xBD84;&#xD574;&#xC758; &#xC5ED;&#xC21C;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>Flash Memory Chip&#xC744; &#xB2E4;&#xC2DC; &#xC798;(!) Resoldering&#xD558;&#xBA74; &#xC7A5;&#xBE44;&#xB97C; &#xB2E4;&#xC2DC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xD38C;&#xC6E8;&#xC5B4;&#xB3C4; &#xD68D;&#xB4DD;&#xD558;&#xACE0; &#xC7A5;&#xBE44;&#xB3C4; &#xB2E4;&#xC2DC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xB450; &#xB9C8;&#xB9AC; &#xD1A0;&#xB07C;&#xB97C; &#xBAA8;&#xB450; &#xC7A1;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;! &#x1F925;</p>
<p><img src="/2025/03/09/newp1ayer48/flashrom/ko/image9.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xC784;&#xBCA0;&#xB514;&#xB4DC; &#xD574;&#xD0B9;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xC2DC;&#xB3C4;&#xB418;&#xB294; UART/JTAG &#xB514;&#xBC84;&#xAE45; &#xD3EC;&#xD2B8; &#xC5F0;&#xACB0;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;! &#x1F64F;&#x1F3FB;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/firmware/">firmware</a>
                  
                  <a class="hover-with-bg" href="/tags/newp1ayer48/">newp1ayer48</a>
                  
                  <a class="hover-with-bg" href="/tags/IoT/">IoT</a>
                  
                  <a class="hover-with-bg" href="/tags/Embedded/">Embedded</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_newp1ayer48.jpg" srcset="/img/loading.gif" alt="newp1ayer48">
                  </div>

                  <div class="link-text">
                    <div class="link-title">newp1ayer48</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/newp1ayer48">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/03/09/bekim/consensus_algorithm/ko/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Five Consensus Algorithms in Blockchain [ko]</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/03/09/newp1ayer48/flashrom/en/">
                    <span class="hidden-mobile">[Research] Flash Memory Dump with Flashrom</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/03/09/newp1ayer48/flashrom/ko/';
        this.page.identifier = '/2025/03/09/newp1ayer48/flashrom/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Flashrom으로 Flash Memory Dump하기&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
