

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko) &amp;#x2190; Now&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338&lt;/a&gt; &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6D0;&amp;#xB798; &amp;#xACC4;&amp;#xD68D;&amp;#xC740; I/O Ring exploit&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9; &amp;#xC911; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xD30C;&amp;#xACE0;&amp;#xB4E4;&amp;#xB9CC;&amp;#xD55C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC678;&amp;#xC804;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; &amp;#xB118;&amp;#xBC84;&amp;#xB9C1;&amp;#xB3C4; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD588;&amp;#xAD6C;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows 11&amp;#xACFC; Windows Server 24H2&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; KASLR &amp;#xAD00;&amp;#xB828; mitigation &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xB098; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xB610; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xAE50;, &amp;#xADF8; &amp;#xC804;&amp;#xC5D0; &lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kASLR-Kernel-Address-Layout-Rnadomization&#34;&gt;Windows Kernel Mitigation &amp;#xD30C;&amp;#xD2B8; 1&lt;/a&gt;&amp;#xC758; kASLR(Kernel Address Layout Rnadomization) &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74; &amp;#xB354; &amp;#xC88B;&amp;#xC544;&amp;#xC694;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;KASLR-bypass&#34;&gt;&lt;a href=&#34;#KASLR-bypass&#34; class=&#34;headerlink&#34; title=&#34;KASLR bypass&#34;&gt;&lt;/a&gt;KASLR bypass&lt;/h2&gt;&lt;p&gt;24H2 &amp;#xC774;&amp;#xC804;, &amp;#xAE30;&amp;#xC874;&amp;#xC5D0;&amp;#xB294; Medium Integrity Level &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;, &lt;code&gt;ntoskrnl.exe&lt;/code&gt; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1; &amp;#xCEE4;&amp;#xB110; exploit&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD55C;&amp;#xBC29;&amp;#xC5D0; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; leak&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;PreviousMode&lt;/code&gt;, &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &lt;code&gt;ntoskrnl.exe&lt;/code&gt;&amp;#xC758; gadget&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Analysis-of-KASLR-Mitigation-in-24H2&#34;&gt;&lt;a href=&#34;#Analysis-of-KASLR-Mitigation-in-24H2&#34; class=&#34;headerlink&#34; title=&#34;Analysis of KASLR Mitigation in 24H2&#34;&gt;&lt;/a&gt;&lt;strong&gt;Analysis of KASLR Mitigation in 24H2&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; export&amp;#xD558;&amp;#xB294; &lt;code&gt;ntdll.dll&lt;/code&gt;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;GetProcAddress&lt;/code&gt;&amp;#xB85C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD55C; &amp;#xB4A4; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;(ntdll) NtQuerySystemInformation&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;(ntoskrnl) NtQuerySystemInformation(EX)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;(ntoskrnl) ExpQuerySytemInformation&lt;/code&gt; &lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD638;&amp;#xCD9C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0; &lt;code&gt;ExpQuerySytemInformation&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2.png&#34;&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; ExpQuerySytemInformation &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xC8E0;.&lt;br&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xC5D0;&amp;#xC11C; ExIsRestrictedCaller &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; xrefs viewer&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExIsRestrictedCaller&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Feature_RestrictKernelAddressLeaks_private_IsEnabeldDeviceUsageNoInline()&lt;/code&gt; &amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370;, &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; 24H2&amp;#xBD80;&amp;#xD130; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; Feature flag&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; flag&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74;, &lt;code&gt;SeSinglePrivilegeCheck(SeDebugPrivilege, a1)&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;ExIsRestrictedCaller&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD574; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; Caller&amp;#xC784;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xC8E0;.&lt;br&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;&amp;#xC740; SystemModuleInformation &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xC778;&amp;#xB370;&amp;#xC694;,  ExIsREstrictedCaller &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; Caller&amp;#xC784;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74; ExQueryModuleInformation&amp;#xC73C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Error &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; Medium Integrity Level &amp;#xC720;&amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; Leak &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xB3C4; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xBC18;&amp;#xD658; &amp;#xACB0;&amp;#xACFC;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; Windows&amp;#xC5D0;&amp;#xC11C; LPE &amp;#xC775;&amp;#xC2A4;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110;&amp;#xC8FC;&amp;#xC18C; leak &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xB418;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;..? &amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; KASLR&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h2 id=&#34;EntryBleed-CVE-2022-4543-and-prefetch-sidechannel&#34;&gt;&lt;a href=&#34;#EntryBleed-CVE-2022-4543-and-prefetch-sidechannel&#34; class=&#34;headerlink&#34; title=&#34;EntryBleed(CVE-2022-4543) and prefetch sidechannel&#34;&gt;&lt;/a&gt;EntryBleed(CVE-2022-4543) and prefetch sidechannel&lt;/h2&gt;&lt;p&gt;&amp;#xADF8; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800;, Linux&amp;#xC758; KPTI(Kernel Page Table Isolation) &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xACFC; &lt;strong&gt;EntryBleed(CVE-2022-4543&lt;/strong&gt;)&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;KPTI&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC778;&amp;#xB370;&amp;#xC694;, exception&amp;#xC774;&amp;#xB098; syscall &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xB4F1; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD560; &amp;#xB54C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB9CC; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xC9C0;&amp;#xD574; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xACA9;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; KPTI &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; 2018&amp;#xB144;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &amp;#xADF8; &amp;#xC720;&amp;#xBA85;&amp;#xD55C; Meltdown&amp;#xACFC; Spectre &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; KASLR&amp;#xC774; &amp;#xBB34;&amp;#xC6A9;&amp;#xC9C0;&amp;#xBB3C;&amp;#xC774; &amp;#xB418;&amp;#xC790; OS &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC81C;&amp;#xAC70;&amp;#xD574; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB2F4;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8;&amp;#xB54C; CPU &amp;#xC81C;&amp;#xC870;&amp;#xC5C5;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xB9DD;&amp;#xD55C;&amp;#xB2E4; &amp;#xC5B4;&amp;#xCA50;&amp;#xB2E4; &amp;#xD558;&amp;#xB294; &amp;#xC598;&amp;#xAE30;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB9CE;&amp;#xC558;&amp;#xC5C8;&amp;#xC8E0;&amp;#x314B;&amp;#x314B;&amp;#x314B; &lt;del&gt;&amp;#xC778;&amp;#xD154;&amp;#xC740; &amp;#xC9C0;&amp;#xAE08; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB9DD;&amp;#xD574;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;&lt;/del&gt;&lt;br&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;KPTI&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xB294; syscall&amp;#xACFC; interrupt &amp;#xB4F1;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB9CC; &amp;#xB0A8;&amp;#xC74C;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://en.wikipedia.org/wiki/Kernel_page-table_isolation&#34;&gt;https://en.wikipedia.org/wiki/Kernel_page-table_isolation&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2022-4543&amp;#xC740; prefetch sidechannel &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; syscall &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; KPTI &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &lt;code&gt;syscall_init&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; syscall&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xB54C; handler&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;-&amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC804;&amp;#xD658;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; KPTI&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;x86_64 &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCCD0;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C; &amp;#x2194; &amp;#xAC00;&amp;#xC0C1;&amp;#xC8FC;&amp;#xC18C; &amp;#xB9E4;&amp;#xD551; &amp;#xC2DC; &amp;#xC790;&amp;#xC8FC; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; TLB(Translation Lookaside Buffer) &amp;#xCE90;&amp;#xC2DC;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, CPU &amp;#xCE90;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBBF8;&amp;#xB9AC; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB294; prefetch instruction &amp;#xB610;&amp;#xD55C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; prefetch &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC774;&amp;#xBBF8; TLB&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;? &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC778; page table walk&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; TLB&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xBE68;&amp;#xB77C;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image9.png&#34; alt=&#34;image9.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xCE90;&amp;#xC2F1; &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC2E4;&amp;#xD589;&amp;#xC18D;&amp;#xB3C4; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://gruss.cc/files/prefetch.pdf&#34;&gt;https://gruss.cc/files/prefetch.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; exploit&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;syscall&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4EC;&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC0C1; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; prefetch instruction&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD568;&lt;ol&gt;
&lt;li&gt;0xffffffff80000000 - 0xffffffffc0000000&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB290;&amp;#xB9AC;&amp;#xB2E4;&amp;#xBA74;, TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xBC18;&amp;#xBCF5;&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74;, &amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; KASLR &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;image10.png&#34; alt=&#34;image10.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; prefetch &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; KASLR Leak &amp;#xACFC;&amp;#xC815;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://gruss.cc/files/prefetch.pdf&#34;&gt;https://gruss.cc/files/prefetch.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Bypassing-KASLR-mitigation-in-24H2&#34;&gt;&lt;a href=&#34;#Bypassing-KASLR-mitigation-in-24H2&#34; class=&#34;headerlink&#34; title=&#34;Bypassing KASLR mitigation in 24H2&#34;&gt;&lt;/a&gt;Bypassing KASLR mitigation in 24H2&lt;/h3&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC11C; EntryBleed&amp;#xC758; prefetch sidechannel &amp;#xAE30;&amp;#xBC95;&amp;#xC744; Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xB3C4; KPTI&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC758; mitigation&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Meltdown, Spectre &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAE30; MS&amp;#xB3C4; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC644;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;-&amp;#xC720;&amp;#xC800; &amp;#xAC04; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACA9;&amp;#xB9AC; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C;  &lt;strong&gt;KVA(Kernel Virtual Address) Shadow&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; KVAS&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; Windows &amp;#xBE4C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image11.png&#34; alt=&#34;image11.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;KVAS&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC720;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &lt;code&gt;KPROCESS.userdirectorytablebase&lt;/code&gt; &amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C; &amp;#xAC12;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, 0&amp;#xC778; &amp;#xAC78; &amp;#xBCF4;&amp;#xC544; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xCD5C;&amp;#xADFC; Windows &amp;#xC758; &amp;#xCD5C;&amp;#xC18C; &amp;#xC694;&amp;#xAD6C;&amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xB294; Meltdown&amp;#xACFC; Spectre&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xB294; KVAS&amp;#xB97C; &amp;#xAD73;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC8C; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;! KVAS&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB7FC; EntryBleed&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; prefetch &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. exploits-forsale&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; PoC &amp;#xC911; sidechannel Procedure&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image12.png&#34; alt=&#34;image12.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm&#34;&gt;https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC8FC;&amp;#xD669;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;prefetch&amp;#xD560; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; argument(rcx) &amp;#xBC1B;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;prefetchnta&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&lt;/strong&gt; non-temporal&amp;#xC784;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;prefetcht2&lt;/strong&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD53C;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; Level 2 &amp;#xCE90;&amp;#xC2DC;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xC704; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xACE0; TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; lfence/mfence &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;instruction &amp;#xC9C1;&amp;#xB82C;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04; &amp;#xCE21;&amp;#xC815;(lfence, mfence)&lt;ul&gt;
&lt;li&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;Instruction &amp;#xC2E4;&amp;#xD589; &amp;#xC21C;&amp;#xC11C; &amp;#xAC15;&amp;#xC81C;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC81C;&amp;#xAC70;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image13.png&#34; alt=&#34;image13.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC81C; &amp;#xD658;&amp;#xACBD;&amp;#xC778; 13&amp;#xC138;&amp;#xB300; Intel &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E8; &amp;#xBA87; &amp;#xCD08; &amp;#xB9CC;&amp;#xC5D0; ntoskrnl.exe &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xCD5C;&amp;#xC2E0; intel&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; reliable&amp;#xD558;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; AMD &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC774; &amp;#xADF8;&amp;#xB2E5; &amp;#xB192;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCEE4;&amp;#xB110; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;(KTHRED, Pool) &amp;#xC8FC;&amp;#xC18C;&amp;#xB3C4; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB9CC; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB3C4;&amp;#xAC00; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; 24H2&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xD55C;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &lt;del&gt;+ &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110;&amp;#xD558;&amp;#xB824;&amp;#xBA74; CPU &amp;#xB9E4;&amp;#xB274;&amp;#xC5BC;&amp;#xC744; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD10;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;..&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows Kernel Exploit&amp;#xC758; &amp;#xAD6D;&amp;#xBC25;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xC640;, &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; KASLR bypass &amp;#xD14C;&amp;#xD06C;&amp;#xB2C9;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; sidechannel&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; Kernel Leak &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC758;&amp;#xACAC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; Windows&amp;#xC758; KASLR &amp;#xC6B0;&amp;#xD68C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD65C;&amp;#xBC1C;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBC88; 24H2&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xAE38; &amp;#xAE30;&amp;#xB300;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; I/O Ring exploit&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h2 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;https://windows-internals.com/kaslr-leaks-restriction/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;https://exploits.forsale/24h2-nt-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;https://github.com/exploits-forsale/prefetch-tool&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko) &amp;#x2190; Now&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338&lt;/a&gt; &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; &amp;#xC6D0;&amp;#xB798; &amp;#xACC4;&amp;#xD68D;&amp;#xC740; I/O Ring exploit&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xD30C;&amp;#xD2B8; 1&amp;#xC5D0;&amp;#xC11C; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9; &amp;#xC911; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xD30C;&amp;#xACE0;&amp;#xB4E4;&amp;#xB9CC;&amp;#xD55C; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC678;&amp;#xC804;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; &amp;#xB118;&amp;#xBC84;&amp;#xB9C1;&amp;#xB3C4; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD588;&amp;#xAD6C;&amp;#xC694;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows 11&amp;#xACFC; Windows Server 24H2&amp;#xBD80;&amp;#xD130; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; KASLR &amp;#xAD00;&amp;#xB828; mitigation &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xB098; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xB610; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xAE50;, &amp;#xADF8; &amp;#xC804;&amp;#xC5D0; &lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kASLR-Kernel-Address-Layout-Rnadomization&#34;&gt;Windows Kernel Mitigation &amp;#xD30C;&amp;#xD2B8; 1&lt;/a&gt;&amp;#xC758; kASLR(Kernel Address Layout Rnadomization) &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC77D;&amp;#xC73C;&amp;#xBA74; &amp;#xB354; &amp;#xC88B;&amp;#xC544;&amp;#xC694;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;KASLR-bypass&#34;&gt;&lt;a href=&#34;#KASLR-bypass&#34; class=&#34;headerlink&#34; title=&#34;KASLR bypass&#34;&gt;&lt;/a&gt;KASLR bypass&lt;/h2&gt;&lt;p&gt;24H2 &amp;#xC774;&amp;#xC804;, &amp;#xAE30;&amp;#xC874;&amp;#xC5D0;&amp;#xB294; Medium Integrity Level &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xCC98;&amp;#xB7FC; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;, &lt;code&gt;ntoskrnl.exe&lt;/code&gt; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC8FC;&amp;#xC18C; &amp;#xB4F1; &amp;#xCEE4;&amp;#xB110; exploit&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xD55C;&amp;#xBC29;&amp;#xC5D0; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image.png&#34; alt=&#34;image.png&#34;&gt;&lt;img src=&#34;image1.png&#34; alt=&#34;image1.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; leak&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;PreviousMode&lt;/code&gt;, &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &lt;code&gt;ntoskrnl.exe&lt;/code&gt;&amp;#xC758; gadget&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Analysis-of-KASLR-Mitigation-in-24H2&#34;&gt;&lt;a href=&#34;#Analysis-of-KASLR-Mitigation-in-24H2&#34; class=&#34;headerlink&#34; title=&#34;Analysis of KASLR Mitigation in 24H2&#34;&gt;&lt;/a&gt;&lt;strong&gt;Analysis of KASLR Mitigation in 24H2&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; export&amp;#xD558;&amp;#xB294; &lt;code&gt;ntdll.dll&lt;/code&gt;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;GetProcAddress&lt;/code&gt;&amp;#xB85C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD55C; &amp;#xB4A4; &amp;#xD638;&amp;#xCD9C;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC9C8;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;(ntdll) NtQuerySystemInformation&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;(ntoskrnl) NtQuerySystemInformation(EX)&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;(ntoskrnl) ExpQuerySytemInformation&lt;/code&gt; &lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD638;&amp;#xCD9C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0; &lt;code&gt;ExpQuerySytemInformation&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image2.png&#34; alt=&#34;image2.png&#34;&gt;&lt;img src=&#34;image3.png&#34; alt=&#34;image3.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; ExpQuerySytemInformation &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xC8E0;.&lt;br&gt;&lt;img src=&#34;image4.png&#34; alt=&#34;image4.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xC5D0;&amp;#xC11C; ExIsRestrictedCaller &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; xrefs viewer&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;image5.png&#34; alt=&#34;image5.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExIsRestrictedCaller&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Feature_RestrictKernelAddressLeaks_private_IsEnabeldDeviceUsageNoInline()&lt;/code&gt; &amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370;, &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; 24H2&amp;#xBD80;&amp;#xD130; &amp;#xC0C8;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; Feature flag&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; flag&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74;, &lt;code&gt;SeSinglePrivilegeCheck(SeDebugPrivilege, a1)&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;ExIsRestrictedCaller&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; true&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD574; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; Caller&amp;#xC784;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xC8E0;.&lt;br&gt;&lt;img src=&#34;image6.png&#34; alt=&#34;image6.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC; &amp;#xC2A4;&amp;#xB2C8;&amp;#xD3AB;&amp;#xC740; SystemModuleInformation &amp;#xC5F4;&amp;#xAC70;&amp;#xD615; &amp;#xAC12;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC11C;&amp;#xBE0C;&amp;#xB8E8;&amp;#xD2F4;&amp;#xC778;&amp;#xB370;&amp;#xC694;,  ExIsREstrictedCaller &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC758; &amp;#xBC18;&amp;#xD658;&amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; Caller&amp;#xC784;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74; ExQueryModuleInformation&amp;#xC73C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; &amp;#xBAA8;&amp;#xB4C8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; Error &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;image7.png&#34; alt=&#34;image7.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &lt;code&gt;SeDebugPrivilege&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; Medium Integrity Level &amp;#xC720;&amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; Leak &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xB3C4; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xBC18;&amp;#xD658; &amp;#xACB0;&amp;#xACFC;&amp;#xB3C4; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; Windows&amp;#xC5D0;&amp;#xC11C; LPE &amp;#xC775;&amp;#xC2A4;&amp;#xD560; &amp;#xB54C; &amp;#xCEE4;&amp;#xB110;&amp;#xC8FC;&amp;#xC18C; leak &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xB418;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;..? &amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; KASLR&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h2 id=&#34;EntryBleed-CVE-2022-4543-and-prefetch-sidechannel&#34;&gt;&lt;a href=&#34;#EntryBleed-CVE-2022-4543-and-prefetch-sidechannel&#34; class=&#34;headerlink&#34; title=&#34;EntryBleed(CVE-2022-4543) and prefetch sidechannel&#34;&gt;&lt;/a&gt;EntryBleed(CVE-2022-4543) and prefetch sidechannel&lt;/h2&gt;&lt;p&gt;&amp;#xADF8; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800;, Linux&amp;#xC758; KPTI(Kernel Page Table Isolation) &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xACFC; &lt;strong&gt;EntryBleed(CVE-2022-4543&lt;/strong&gt;)&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;KPTI&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC778;&amp;#xB370;&amp;#xC694;, exception&amp;#xC774;&amp;#xB098; syscall &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xB4F1; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD560; &amp;#xB54C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB9CC; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC720;&amp;#xC9C0;&amp;#xD574; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xACA9;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; KPTI &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBC14;&amp;#xB85C; 2018&amp;#xB144;&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &amp;#xADF8; &amp;#xC720;&amp;#xBA85;&amp;#xD55C; Meltdown&amp;#xACFC; Spectre &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; KASLR&amp;#xC774; &amp;#xBB34;&amp;#xC6A9;&amp;#xC9C0;&amp;#xBB3C;&amp;#xC774; &amp;#xB418;&amp;#xC790; OS &amp;#xB808;&amp;#xBCA8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC81C;&amp;#xAC70;&amp;#xD574; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xCD5C;&amp;#xC18C;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB2F4;&amp;#xC73C;&amp;#xB85C; &amp;#xADF8;&amp;#xB54C; CPU &amp;#xC81C;&amp;#xC870;&amp;#xC5C5;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xB9DD;&amp;#xD55C;&amp;#xB2E4; &amp;#xC5B4;&amp;#xCA50;&amp;#xB2E4; &amp;#xD558;&amp;#xB294; &amp;#xC598;&amp;#xAE30;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB9CE;&amp;#xC558;&amp;#xC5C8;&amp;#xC8E0;&amp;#x314B;&amp;#x314B;&amp;#x314B; &lt;del&gt;&amp;#xC778;&amp;#xD154;&amp;#xC740; &amp;#xC9C0;&amp;#xAE08; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB9DD;&amp;#xD574;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;&lt;/del&gt;&lt;br&gt;&lt;img src=&#34;image8.png&#34; alt=&#34;image8.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;KPTI&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xB294; syscall&amp;#xACFC; interrupt &amp;#xB4F1;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB9CC; &amp;#xB0A8;&amp;#xC74C;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98; : &lt;a href=&#34;https://en.wikipedia.org/wiki/Kernel_page-table_isolation&#34;&gt;https://en.wikipedia.org/wiki/Kernel_page-table_isolation&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2022-4543&amp;#xC740; prefetch sidechannel &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; syscall &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCC3E;&amp;#xACE0; KPTI &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &lt;code&gt;syscall_init&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; syscall&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xB54C; handler&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;-&amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC804;&amp;#xD658;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; KPTI&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xCD5C;&amp;#xC18C;&amp;#xD55C;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;x86_64 &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCCD0;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C; &amp;#x2194; &amp;#xAC00;&amp;#xC0C1;&amp;#xC8FC;&amp;#xC18C; &amp;#xB9E4;&amp;#xD551; &amp;#xC2DC; &amp;#xC790;&amp;#xC8FC; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; TLB(Translation Lookaside Buffer) &amp;#xCE90;&amp;#xC2DC;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, CPU &amp;#xCE90;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xBBF8;&amp;#xB9AC; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB294; prefetch instruction &amp;#xB610;&amp;#xD55C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; prefetch &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC774;&amp;#xBBF8; TLB&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;? &amp;#xD398;&amp;#xC774;&amp;#xC9C0; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC778; page table walk&amp;#xB97C; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xACE0; TLB&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xBE68;&amp;#xB77C;&amp;#xC9C0;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image9.png&#34; alt=&#34;image9.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC758; &amp;#xCE90;&amp;#xC2F1; &amp;#xC5EC;&amp;#xBD80;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xC2E4;&amp;#xD589;&amp;#xC18D;&amp;#xB3C4; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B8; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://gruss.cc/files/prefetch.pdf&#34;&gt;https://gruss.cc/files/prefetch.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; exploit&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;syscall&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4EC;&lt;/li&gt;
&lt;li&gt;&amp;#xC608;&amp;#xC0C1; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; prefetch instruction&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD568;&lt;ol&gt;
&lt;li&gt;0xffffffff80000000 - 0xffffffffc0000000&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB290;&amp;#xB9AC;&amp;#xB2E4;&amp;#xBA74;, TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00; &amp;#xBC18;&amp;#xBCF5;&lt;/li&gt;
&lt;li&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB974;&amp;#xB2E4;&amp;#xBA74;, &amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778; &lt;code&gt;entry_SYSCALL_64&lt;/code&gt; &amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; KASLR &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD568;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;image10.png&#34; alt=&#34;image10.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; prefetch &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589; &amp;#xC18D;&amp;#xB3C4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; KASLR Leak &amp;#xACFC;&amp;#xC815;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://gruss.cc/files/prefetch.pdf&#34;&gt;https://gruss.cc/files/prefetch.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Bypassing-KASLR-mitigation-in-24H2&#34;&gt;&lt;a href=&#34;#Bypassing-KASLR-mitigation-in-24H2&#34; class=&#34;headerlink&#34; title=&#34;Bypassing KASLR mitigation in 24H2&#34;&gt;&lt;/a&gt;Bypassing KASLR mitigation in 24H2&lt;/h3&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC11C; EntryBleed&amp;#xC758; prefetch sidechannel &amp;#xAE30;&amp;#xBC95;&amp;#xC744; Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xB3C4; KPTI&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC758; mitigation&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Meltdown, Spectre &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC2DC;&amp;#xAE30; MS&amp;#xB3C4; &amp;#xC5ED;&amp;#xC2DC; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC644;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;-&amp;#xC720;&amp;#xC800; &amp;#xAC04; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACA9;&amp;#xB9AC; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C;  &lt;strong&gt;KVA(Kernel Virtual Address) Shadow&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; KVAS&amp;#xB294; &amp;#xCD5C;&amp;#xADFC; Windows &amp;#xBE4C;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image11.png&#34; alt=&#34;image11.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;KVAS&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC720;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &lt;code&gt;KPROCESS.userdirectorytablebase&lt;/code&gt; &amp;#xC5D0; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C; &amp;#xAC12;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, 0&amp;#xC778; &amp;#xAC78; &amp;#xBCF4;&amp;#xC544; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xCD5C;&amp;#xADFC; Windows &amp;#xC758; &amp;#xCD5C;&amp;#xC18C; &amp;#xC694;&amp;#xAD6C;&amp;#xC0AC;&amp;#xD56D;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xB294; Meltdown&amp;#xACFC; Spectre&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xB294; KVAS&amp;#xB97C; &amp;#xAD73;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC8C; &amp;#xC544;&amp;#xB2D0;&amp;#xAE4C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC;! KVAS&amp;#xAC00; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB7FC; EntryBleed&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; prefetch &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. exploits-forsale&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; PoC &amp;#xC911; sidechannel Procedure&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;image12.png&#34; alt=&#34;image12.png&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm&#34;&gt;https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC8FC;&amp;#xD669;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;prefetch&amp;#xD560; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; argument(rcx) &amp;#xBC1B;&amp;#xC74C;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;prefetchnta&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&lt;/strong&gt; non-temporal&amp;#xC784;&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;, &lt;strong&gt;prefetcht2&lt;/strong&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD53C;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; Level 2 &amp;#xCE90;&amp;#xC2DC;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;&amp;#xC704; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xACE0; TLB&amp;#xC5D0; &amp;#xCE90;&amp;#xC2DC;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC778;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD568;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&lt;ul&gt;
&lt;li&gt;&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;&amp;#xC758; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xCE21;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; lfence/mfence &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD568;&lt;/li&gt;
&lt;li&gt;instruction &amp;#xC9C1;&amp;#xB82C;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xC2DC;&amp;#xAC04; &amp;#xCE21;&amp;#xC815;(lfence, mfence)&lt;ul&gt;
&lt;li&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;li&gt;Instruction &amp;#xC2E4;&amp;#xD589; &amp;#xC21C;&amp;#xC11C; &amp;#xAC15;&amp;#xC81C;, &amp;#xCD5C;&amp;#xC801;&amp;#xD654; &amp;#xC81C;&amp;#xAC70;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;image13.png&#34; alt=&#34;image13.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC81C; &amp;#xD658;&amp;#xACBD;&amp;#xC778; 13&amp;#xC138;&amp;#xB300; Intel &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E8; &amp;#xBA87; &amp;#xCD08; &amp;#xB9CC;&amp;#xC5D0; ntoskrnl.exe &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; &amp;#xCD5C;&amp;#xC2E0; intel&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB9CC; reliable&amp;#xD558;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; AMD &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC774; &amp;#xADF8;&amp;#xB2E5; &amp;#xB192;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCEE4;&amp;#xB110; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;(KTHRED, Pool) &amp;#xC8FC;&amp;#xC18C;&amp;#xB3C4; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xBE44;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB9CC; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xC0C1;&amp;#xB300;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB3C4;&amp;#xAC00; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C4;&amp;#xB2E4;&amp;#xB294; &amp;#xB2E8;&amp;#xC810;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; 24H2&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB41C; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C; &amp;#xC81C;&amp;#xD55C;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &lt;del&gt;+ &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110;&amp;#xD558;&amp;#xB824;&amp;#xBA74; CPU &amp;#xB9E4;&amp;#xB274;&amp;#xC5BC;&amp;#xC744; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBD10;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xAC74;&amp;#xAC00;..&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Windows Kernel Exploit&amp;#xC758; &amp;#xAD6D;&amp;#xBC25;&amp;#xC774;&amp;#xC5C8;&amp;#xB358; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xAD8C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xC640;, &amp;#xADF8;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; KASLR bypass &amp;#xD14C;&amp;#xD06C;&amp;#xB2C9;&amp;#xC758; &amp;#xD544;&amp;#xC694;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD55C; sidechannel&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C; Kernel Leak &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC758;&amp;#xACAC;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xADF8;&amp;#xB3D9;&amp;#xC548; Windows&amp;#xC758; KASLR &amp;#xC6B0;&amp;#xD68C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAC00; &lt;code&gt;NtQuerySystemInformaton&lt;/code&gt; &amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD65C;&amp;#xBC1C;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xBC88; 24H2&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xD328;&amp;#xCE58;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC6B0;&amp;#xD68C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xAE38; &amp;#xAE30;&amp;#xB300;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; I/O Ring exploit&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;h2 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://windows-internals.com/kaslr-leaks-restriction/&#34;&gt;https://windows-internals.com/kaslr-leaks-restriction/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://exploits.forsale/24h2-nt-exploit/&#34;&gt;https://exploits.forsale/24h2-nt-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/exploits-forsale/prefetch-tool&#34;&gt;https://github.com/exploits-forsale/prefetch-tool&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2025/04/13/l0ch/bypassing-kernel-mitigation-part0/ko/thumbnail.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/04/13/l0ch/bypassing-kernel-mitigation-part0/ko/">

  <title>[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-04-13 19:00" pubdate>
      2025 4 13 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.5k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      50
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko) &#x2190; Now</p>
<p><a href="https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/">Bypassing Windows Kernel Mitigations: Part1 - Overview</a></p>
<p><a href="https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/">Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338</a> </p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, L0ch&#xC785;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; &#xC6D0;&#xB798; &#xACC4;&#xD68D;&#xC740; I/O Ring exploit&#xC5D0; &#xB300;&#xD574; &#xC815;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD588;&#xB294;&#xB370;, &#xD30C;&#xD2B8; 1&#xC5D0;&#xC11C; &#xC18C;&#xAC1C;&#xD55C; &#xB0B4;&#xC6A9; &#xC911; &#xB354; &#xAE4A;&#xAC8C; &#xD30C;&#xACE0;&#xB4E4;&#xB9CC;&#xD55C; &#xC8FC;&#xC81C;&#xB97C; &#xC678;&#xC804;&#xACA9;&#xC73C;&#xB85C; &#xC4F0;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E; &#xADF8;&#xB798;&#xC11C; &#xD30C;&#xD2B8; &#xB118;&#xBC84;&#xB9C1;&#xB3C4; 0&#xC73C;&#xB85C; &#xC815;&#xD588;&#xAD6C;&#xC694;</p>
<p>&#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; Windows 11&#xACFC; Windows Server 24H2&#xBD80;&#xD130; &#xCD94;&#xAC00;&#xB41C; KASLR &#xAD00;&#xB828; mitigation &#xD328;&#xCE58;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xB098; &#xC880; &#xB354; &#xC790;&#xC138;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0; &#xB610; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<blockquote>
<p>&#xC7A0;&#xAE50;, &#xADF8; &#xC804;&#xC5D0; <a href="https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kASLR-Kernel-Address-Layout-Rnadomization">Windows Kernel Mitigation &#xD30C;&#xD2B8; 1</a>&#xC758; kASLR(Kernel Address Layout Rnadomization) &#xD30C;&#xD2B8;&#xB97C; &#xBA3C;&#xC800; &#xC77D;&#xC73C;&#xBA74; &#xB354; &#xC88B;&#xC544;&#xC694;</p>
</blockquote>
<h2 id="KASLR-bypass"><a href="#KASLR-bypass" class="headerlink" title="KASLR bypass"></a>KASLR bypass</h2><p>24H2 &#xC774;&#xC804;, &#xAE30;&#xC874;&#xC5D0;&#xB294; Medium Integrity Level &#xAD8C;&#xD55C;&#xC73C;&#xB85C; <code>NtQuerySystemInformation</code>&#xC744; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xC544;&#xB798;&#xCC98;&#xB7FC; &#xCEE4;&#xB110;&#xC758; &#xC5EC;&#xB7EC; &#xC624;&#xBE0C;&#xC81D;&#xD2B8; &#xC8FC;&#xC18C;, <code>ntoskrnl.exe</code> &#xC774;&#xBBF8;&#xC9C0; &#xBCA0;&#xC774;&#xC2A4;&#xC8FC;&#xC18C; &#xB4F1; &#xCEE4;&#xB110; exploit&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xC720;&#xC6A9;&#xD55C; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xD55C;&#xBC29;&#xC5D0; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image.png" srcset="/img/loading.gif" alt="image.png"><img src="image1.png" srcset="/img/loading.gif" alt="image1.png"></p>
<p>&#xC774;&#xB807;&#xAC8C; leak&#xD55C; &#xC8FC;&#xC18C;&#xB4E4;&#xC744; &#xC774;&#xC6A9;&#xD574; <code>PreviousMode</code>, <code>SeDebugPrivilege</code> &#xD544;&#xB4DC;&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xAC70;&#xB098; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xD544;&#xC694;&#xD55C; <code>ntoskrnl.exe</code>&#xC758; gadget&#xC744; &#xAD6C;&#xD558;&#xB294; &#xB4F1; &#xC720;&#xC6A9;&#xD558;&#xAC8C; &#xD65C;&#xC6A9; &#xAC00;&#xB2A5;&#xD588;&#xC5C8;&#xC8E0;.</p>
<h2 id="Analysis-of-KASLR-Mitigation-in-24H2"><a href="#Analysis-of-KASLR-Mitigation-in-24H2" class="headerlink" title="Analysis of KASLR Mitigation in 24H2"></a><strong>Analysis of KASLR Mitigation in 24H2</strong></h2><p><code>NtQuerySystemInformation</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB97C; export&#xD558;&#xB294; <code>ntdll.dll</code>&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xACE0;, <code>GetProcAddress</code>&#xB85C; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD55C; &#xB4A4; &#xD638;&#xCD9C;&#xD574;&#xC57C; &#xD558;&#xB294;&#xB370;&#xC694;. </p>
<p>&#xC2E4;&#xC9C8;&#xC801;&#xC778; &#xAE30;&#xB2A5;&#xC740; </p>
<ol>
<li><code>(ntdll) NtQuerySystemInformation</code></li>
<li><code>(ntoskrnl) NtQuerySystemInformation(EX)</code></li>
<li><code>(ntoskrnl) ExpQuerySytemInformation</code> </li>
</ol>
<p>&#xD638;&#xCD9C; &#xCCB4;&#xC778;&#xC744; &#xAC70;&#xCCD0; <code>ExpQuerySytemInformation</code> &#xD568;&#xC218;&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image2.png" srcset="/img/loading.gif" alt="image2.png"><img src="image3.png" srcset="/img/loading.gif" alt="image3.png"></p>
<p>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; ExpQuerySytemInformation &#xD568;&#xC218;&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xC5F4;&#xAC70;&#xD615; &#xAC12;&#xC5D0; &#xB530;&#xB77C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC11C;&#xBE0C;&#xB8E8;&#xD2F4;&#xB4E4;&#xC5D0;&#xC11C; &#xC801;&#xC808;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C; &#xC815;&#xBCF4;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xC8E0;.<br><img src="image4.png" srcset="/img/loading.gif" alt="image4.png"></p>
<p>&#xC774; &#xB54C; &#xCEE4;&#xB110;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294; &#xB9CE;&#xC740; &#xC11C;&#xBE0C;&#xB8E8;&#xD2F4;&#xC5D0;&#xC11C; ExIsRestrictedCaller &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC744; xrefs viewer&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="image5.png" srcset="/img/loading.gif" alt="image5.png"></p>
<p><code>ExIsRestrictedCaller</code> &#xD568;&#xC218;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. <code>Feature_RestrictKernelAddressLeaks_private_IsEnabeldDeviceUsageNoInline()</code> &#xAC00; &#xBCF4;&#xC774;&#xB294;&#xB370;, &#xD574;&#xB2F9; &#xD568;&#xC218;&#xAC00; &#xBC14;&#xB85C; 24H2&#xBD80;&#xD130; &#xC0C8;&#xB85C; &#xCD94;&#xAC00;&#xB41C; Feature flag&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xD574;&#xB2F9; flag&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; true&#xB97C; &#xBC18;&#xD658;&#xD558;&#xBA74;, <code>SeSinglePrivilegeCheck(SeDebugPrivilege, a1)</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD638;&#xCD9C;&#xC790; &#xAD8C;&#xD55C;&#xC5D0; <code>SeDebugPrivilege</code> &#xAD8C;&#xD55C;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xAD8C;&#xD55C;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; <code>ExIsRestrictedCaller</code> &#xD568;&#xC218;&#xB294; true&#xB97C; &#xBC18;&#xD658;&#xD574; &#xC81C;&#xD55C;&#xB41C; &#xAD8C;&#xD55C;&#xC758; Caller&#xC784;&#xC744; &#xC54C;&#xB9AC;&#xC8E0;.<br><img src="image6.png" srcset="/img/loading.gif" alt="image6.png"></p>
<p>&#xC704; &#xCF54;&#xB4DC; &#xC2A4;&#xB2C8;&#xD3AB;&#xC740; SystemModuleInformation &#xC5F4;&#xAC70;&#xD615; &#xAC12;&#xC744; &#xC804;&#xB2EC;&#xD588;&#xC744; &#xB54C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC11C;&#xBE0C;&#xB8E8;&#xD2F4;&#xC778;&#xB370;&#xC694;,  ExIsREstrictedCaller &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC81C;&#xD55C;&#xB41C; &#xAD8C;&#xD55C;&#xC758; Caller&#xC784;&#xC774; &#xD655;&#xC778;&#xB418;&#xBA74; ExQueryModuleInformation&#xC73C;&#xB85C; &#xCEE4;&#xB110; &#xBAA8;&#xB4C8; &#xC815;&#xBCF4;&#xB97C; &#xAD6C;&#xD558;&#xC9C0; &#xC54A;&#xACE0; Error &#xCF54;&#xB4DC;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.<br><img src="image7.png" srcset="/img/loading.gif" alt="image7.png"></p>
<p>&#xACB0;&#xAD6D; <code>SeDebugPrivilege</code> &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; Medium Integrity Level &#xC720;&#xC800;&#xB294; &#xAE30;&#xC874;&#xC758; <code>NtQuerySystemInformation</code> &#xB97C; &#xC0AC;&#xC6A9;&#xD55C; Leak &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xB3C4; &#xC544;&#xBB34;&#xB7F0; &#xBC18;&#xD658; &#xACB0;&#xACFC;&#xB3C4; &#xC5BB;&#xC744; &#xC218; &#xC5C6;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; Windows&#xC5D0;&#xC11C; LPE &#xC775;&#xC2A4;&#xD560; &#xB54C; &#xCEE4;&#xB110;&#xC8FC;&#xC18C; leak &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCD94;&#xAC00;&#xB85C; &#xCC3E;&#xC544;&#xC57C; &#xB418;&#xB294;&#xAC74;&#xAC00;..? &#xC2F6;&#xC9C0;&#xB9CC; &#xC81C;&#xD55C;&#xC801;&#xC73C;&#xB85C; KASLR&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<h2 id="EntryBleed-CVE-2022-4543-and-prefetch-sidechannel"><a href="#EntryBleed-CVE-2022-4543-and-prefetch-sidechannel" class="headerlink" title="EntryBleed(CVE-2022-4543) and prefetch sidechannel"></a>EntryBleed(CVE-2022-4543) and prefetch sidechannel</h2><p>&#xADF8; &#xC804;&#xC5D0; &#xBA3C;&#xC800;, Linux&#xC758; KPTI(Kernel Page Table Isolation) &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xACFC; <strong>EntryBleed(CVE-2022-4543</strong>)&#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>KPTI&#xB294; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xBAA8;&#xB4E0; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xB294; &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xC778;&#xB370;&#xC694;, exception&#xC774;&#xB098; syscall &#xD578;&#xB4E4;&#xB7EC; &#xB4F1; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xCEE4;&#xB110;&#xB85C; &#xC804;&#xD658;&#xD560; &#xB54C; &#xD544;&#xC694;&#xD55C; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xCEE4;&#xB110; &#xAC00;&#xC0C1; &#xBA54;&#xBAA8;&#xB9AC;&#xB9CC; &#xB9E4;&#xD551;&#xB418;&#xB3C4;&#xB85D; &#xC720;&#xC9C0;&#xD574; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC640; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC;&#xC758; &#xD398;&#xC774;&#xC9C0; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xACA9;&#xB9AC;&#xD558;&#xACE0; &#xC720;&#xC800;&#xAC00; &#xCEE4;&#xB110;&#xC758; &#xD2B9;&#xC815; &#xC8FC;&#xC18C;&#xB97C; &#xC54C;&#xC544;&#xB0BC; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; KPTI &#xB4F1;&#xC7A5;&#xD55C; &#xC774;&#xC720;&#xB294; &#xBC14;&#xB85C; 2018&#xB144;&#xC5D0; &#xBC1C;&#xD45C;&#xB41C; &#xADF8; &#xC720;&#xBA85;&#xD55C; Meltdown&#xACFC; Spectre &#xB54C;&#xBB38;&#xC774;&#xC8E0;. &#xD504;&#xB85C;&#xC138;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC778;&#xD574; KASLR&#xC774; &#xBB34;&#xC6A9;&#xC9C0;&#xBB3C;&#xC774; &#xB418;&#xC790; OS &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xB9E4;&#xD551;&#xB418;&#xB294; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xB97C; &#xB300;&#xBD80;&#xBD84; &#xC81C;&#xAC70;&#xD574; &#xC601;&#xD5A5;&#xC744; &#xCD5C;&#xC18C;&#xD654;&#xD558;&#xB824;&#xB294; &#xBAA9;&#xC801;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC5EC;&#xB2F4;&#xC73C;&#xB85C; &#xADF8;&#xB54C; CPU &#xC81C;&#xC870;&#xC5C5;&#xCCB4;&#xB4E4;&#xC774; &#xB9DD;&#xD55C;&#xB2E4; &#xC5B4;&#xCA50;&#xB2E4; &#xD558;&#xB294; &#xC598;&#xAE30;&#xAC00; &#xC5C4;&#xCCAD; &#xB9CE;&#xC558;&#xC5C8;&#xC8E0;&#x314B;&#x314B;&#x314B; <del>&#xC778;&#xD154;&#xC740; &#xC9C0;&#xAE08; &#xC9C4;&#xC9DC; &#xB9DD;&#xD574;&#xAC00;&#xACE0; &#xC788;&#xC9C0;&#xB9CC;</del><br><img src="image8.png" srcset="/img/loading.gif" alt="image8.png"></p>
<blockquote>
<p>KPTI&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xBA74; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xB294; syscall&#xACFC; interrupt &#xB4F1;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xB9CC; &#xB0A8;&#xC74C;<br>&#xCD9C;&#xCC98; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Kernel_page-table_isolation">https://en.wikipedia.org/wiki/Kernel_page-table_isolation</a></p>
</blockquote>
<p>CVE-2022-4543&#xC740; prefetch sidechannel &#xAE30;&#xBC95;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; syscall &#xD578;&#xB4E4;&#xB7EC; &#xC8FC;&#xC18C;&#xB97C; &#xCC3E;&#xACE0; KPTI &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xB370;&#xC694;, &#xCEE4;&#xB110;&#xC758; <code>syscall_init</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; <code>entry_SYSCALL_64</code> &#xD568;&#xC218; &#xC8FC;&#xC18C;&#xB294; 64&#xBE44;&#xD2B8; syscall&#xC774; &#xD638;&#xCD9C;&#xB420; &#xB54C; handler&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC740; <code>entry_SYSCALL_64</code>&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC;-&#xCEE4;&#xB110;&#xBAA8;&#xB4DC; &#xC804;&#xD658;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xBBC0;&#xB85C; KPTI&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xB9E4;&#xD551;&#xB418;&#xB294; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; &#xC911; &#xD558;&#xB098;&#xB77C;&#xB294; &#xC810;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC70;&#xC8E0;.</p>
<p>x86_64 &#xC544;&#xD0A4;&#xD14D;&#xCCD0;&#xB294; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C; &#x2194; &#xAC00;&#xC0C1;&#xC8FC;&#xC18C; &#xB9E4;&#xD551; &#xC2DC; &#xC790;&#xC8FC; &#xC811;&#xADFC;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; TLB(Translation Lookaside Buffer) &#xCE90;&#xC2DC;&#xAC00; &#xC788;&#xC73C;&#xBA70;, CPU &#xCE90;&#xC2DC;&#xC5D0; &#xC8FC;&#xC18C;&#xB97C; &#xBBF8;&#xB9AC; &#xAC00;&#xC838;&#xC624;&#xB294; prefetch instruction &#xB610;&#xD55C; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xD2B9;&#xC815; &#xC8FC;&#xC18C;&#xC5D0; &#xB300;&#xD574; prefetch &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294;&#xB370; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xAC00; &#xC774;&#xBBF8; TLB&#xC5D0; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xBA74;? &#xD398;&#xC774;&#xC9C0; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xAC80;&#xC0C9;&#xD574; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC778; page table walk&#xB97C; &#xC0DD;&#xB7B5;&#xD558;&#xACE0; TLB&#xC5D0;&#xC11C; &#xAC00;&#xC838;&#xC624;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB418;&#xB2C8; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC774; &#xBE68;&#xB77C;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="image9.png" srcset="/img/loading.gif" alt="image9.png"></p>
<blockquote>
<p>&#xD398;&#xC774;&#xC9C0;&#xC758; &#xCE90;&#xC2F1; &#xC5EC;&#xBD80;&#xC5D0; &#xB530;&#xB978; &#xC2E4;&#xD589;&#xC18D;&#xB3C4; &#xCC28;&#xC774;&#xB97C; &#xB098;&#xD0C0;&#xB0B8; &#xADF8;&#xB798;&#xD504;<br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://gruss.cc/files/prefetch.pdf">https://gruss.cc/files/prefetch.pdf</a></p>
</blockquote>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xC758; &#xCC28;&#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; exploit&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>syscall&#xC744; &#xC5EC;&#xB7EC; &#xBC88; &#xC218;&#xD589;&#xD558;&#xC5EC; <code>entry_SYSCALL_64</code> &#xC8FC;&#xC18C;&#xAC00; TLB&#xC5D0; &#xCE90;&#xC2DC;&#xB418;&#xB3C4;&#xB85D; &#xB9CC;&#xB4EC;</li>
<li>&#xC608;&#xC0C1; &#xAC00;&#xB2A5;&#xD55C; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; &#xBC94;&#xC704;&#xC5D0; &#xB300;&#xD574; prefetch instruction&#xC744; &#xD638;&#xCD9C;&#xD568;<ol>
<li>0xffffffff80000000 - 0xffffffffc0000000</li>
</ol>
</li>
<li>&#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xAC00; &#xB290;&#xB9AC;&#xB2E4;&#xBA74;, TLB&#xC5D0; &#xCE90;&#xC2DC;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC73C;&#xBBC0;&#xB85C; 2&#xB85C; &#xB3CC;&#xC544;&#xAC00; &#xBC18;&#xBCF5;</li>
<li>&#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xAC00; &#xBE60;&#xB974;&#xB2E4;&#xBA74;, &#xCE90;&#xC2DC;&#xB41C; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xC778; <code>entry_SYSCALL_64</code> &#xC774;&#xBBC0;&#xB85C; &#xC624;&#xD504;&#xC14B; &#xACC4;&#xC0B0;&#xC744; &#xD1B5;&#xD574; KASLR &#xBCA0;&#xC774;&#xC2A4; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD568;</li>
</ol>
<p><img src="image10.png" srcset="/img/loading.gif" alt="image10.png"></p>
<blockquote>
<p>&#xCE90;&#xC2DC;&#xB41C; &#xC8FC;&#xC18C;&#xC758; prefetch &#xBA85;&#xB839;&#xC5B4; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xC774;&#xC6A9;&#xD55C; KASLR Leak &#xACFC;&#xC815;<br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://gruss.cc/files/prefetch.pdf">https://gruss.cc/files/prefetch.pdf</a></p>
</blockquote>
<h3 id="Bypassing-KASLR-mitigation-in-24H2"><a href="#Bypassing-KASLR-mitigation-in-24H2" class="headerlink" title="Bypassing KASLR mitigation in 24H2"></a>Bypassing KASLR mitigation in 24H2</h3><p>&#xC55E;&#xC11C; EntryBleed&#xC758; prefetch sidechannel &#xAE30;&#xBC95;&#xC744; Windows&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;!</p>
<p>Windows&#xC5D0;&#xB3C4; KPTI&#xC640; &#xC720;&#xC0AC;&#xD55C; &#xAC1C;&#xB150;&#xC758; mitigation&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Meltdown, Spectre &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xACF5;&#xAC1C;&#xB41C; &#xC2DC;&#xAE30; MS&#xB3C4; &#xC5ED;&#xC2DC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC801;&#xC73C;&#xB85C; &#xC644;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCEE4;&#xB110;-&#xC720;&#xC800; &#xAC04; &#xBA54;&#xBAA8;&#xB9AC; &#xACA9;&#xB9AC; &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xC744; &#xCD94;&#xAC00;&#xD588;&#xB294;&#xB370;, &#xADF8;&#xAC8C; &#xBC14;&#xB85C;  <strong>KVA(Kernel Virtual Address) Shadow</strong>&#xB77C;&#xB294; &#xB140;&#xC11D;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; KVAS&#xB294; &#xCD5C;&#xADFC; Windows &#xBE4C;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p><img src="image11.png" srcset="/img/loading.gif" alt="image11.png"></p>
<p>KVAS&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0; &#xC720;&#xC800; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; <code>KPROCESS.userdirectorytablebase</code> &#xC5D0; &#xC720;&#xD6A8;&#xD55C; &#xC8FC;&#xC18C; &#xAC12;&#xC774; &#xB4E4;&#xC5B4;&#xAC00;&#xC57C; &#xD558;&#xC9C0;&#xB9CC;, 0&#xC778; &#xAC78; &#xBCF4;&#xC544; &#xBE44;&#xD65C;&#xC131;&#xD654; &#xB41C; &#xAC78; &#xC54C; &#xC218; &#xC788;&#xB124;&#xC694;. &#xCD5C;&#xADFC; Windows &#xC758; &#xCD5C;&#xC18C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xCDA9;&#xC871;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xB294; Meltdown&#xACFC; Spectre&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC9C0; &#xC54A;&#xC73C;&#xB2C8; &#xC131;&#xB2A5; &#xC800;&#xD558;&#xB97C; &#xC77C;&#xC73C;&#xD0A4;&#xB294; KVAS&#xB97C; &#xAD73;&#xC774; &#xC801;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB41C;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD55C; &#xAC8C; &#xC544;&#xB2D0;&#xAE4C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xBB34;&#xD2BC;! KVAS&#xAC00; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xB294; &#xAC74; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC774;&#xACA0;&#xC8E0;? &#xADF8;&#xB7FC; EntryBleed&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C; prefetch &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. exploits-forsale&#xC5D0;&#xC11C; &#xACF5;&#xAC1C;&#xD55C; PoC &#xC911; sidechannel Procedure&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="image12.png" srcset="/img/loading.gif" alt="image12.png"></p>
<blockquote>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm">https://github.com/exploits-forsale/prefetch-tool/blob/main/prefetch_tool/prefetch_asm.asm</a></p>
</blockquote>
<ul>
<li>&#xC8FC;&#xD669;&#xC0C9; &#xBC15;&#xC2A4;<ul>
<li>prefetch&#xD560; &#xCCAB; &#xBC88;&#xC9F8; argument(rcx) &#xBC1B;&#xC74C;</li>
</ul>
</li>
<li>&#xBE68;&#xAC04;&#xC0C9; &#xBC15;&#xC2A4;<ul>
<li><strong>prefetchnta&#xC744; &#xD1B5;&#xD574;</strong> non-temporal&#xC784;&#xC744; &#xBA85;&#xC2DC;&#xD558;&#xACE0;, <strong>prefetcht2</strong>&#xC744; &#xD1B5;&#xD574; &#xD53C;&#xC5F0;&#xC0B0;&#xC790; &#xC8FC;&#xC18C;&#xB97C; Level 2 &#xCE90;&#xC2DC;&#xB85C; &#xB85C;&#xB4DC;&#xD568;</li>
<li>&#xC704; &#xB450; &#xAC00;&#xC9C0; &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC744; &#xCE21;&#xC815;&#xD558;&#xACE0; TLB&#xC5D0; &#xCE90;&#xC2DC;&#xB41C; &#xC8FC;&#xC18C;&#xC778;&#xC9C0; &#xD310;&#xB2E8;&#xD568;</li>
</ul>
</li>
<li>&#xD30C;&#xB780;&#xC0C9; &#xBC15;&#xC2A4;<ul>
<li>&#xBE68;&#xAC04;&#xC0C9; &#xBC15;&#xC2A4;&#xC758; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC744; &#xCE21;&#xC815;&#xD558;&#xAE30; &#xC704;&#xD574; lfence/mfence &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD65C;&#xC6A9;&#xD568;</li>
<li>instruction &#xC9C1;&#xB82C;&#xD654; &#xC791;&#xC5C5;&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589; &#xC2DC;&#xAC04; &#xCE21;&#xC815;(lfence, mfence)<ul>
<li>&#xC774;&#xC804;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xBAA8;&#xB450; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC9C4;&#xC785;</li>
<li>Instruction &#xC2E4;&#xD589; &#xC21C;&#xC11C; &#xAC15;&#xC81C;, &#xCD5C;&#xC801;&#xD654; &#xC81C;&#xAC70;</li>
</ul>
</li>
</ul>
</li>
</ul>
<p><img src="image13.png" srcset="/img/loading.gif" alt="image13.png"></p>
<p>&#xC81C; &#xD658;&#xACBD;&#xC778; 13&#xC138;&#xB300; Intel &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C;&#xB294; &#xB2E8; &#xBA87; &#xCD08; &#xB9CC;&#xC5D0; ntoskrnl.exe &#xBCA0;&#xC774;&#xC2A4; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC; &#xC774; &#xBC29;&#xBC95;&#xB3C4; &#xBA87; &#xAC00;&#xC9C0; &#xC81C;&#xC57D;&#xC0AC;&#xD56D;&#xC774; &#xC788;&#xB294;&#xB370;&#xC694;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB294; &#xCD5C;&#xC2E0; intel&#xC758; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C;&#xB9CC; reliable&#xD558;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xACE0; AMD &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C;&#xB294; &#xC2E0;&#xB8B0;&#xC131;&#xC774; &#xADF8;&#xB2E5; &#xB192;&#xC9C0; &#xC54A;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC73C;&#xBA70;, &#xB450; &#xBC88;&#xC9F8;&#xB85C;&#xB294; &#xC5EC;&#xB7EC; &#xCEE4;&#xB110; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;(KTHRED, Pool) &#xC8FC;&#xC18C;&#xB3C4; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xAE30;&#xC874;&#xC758; <code>NtQuerySystemInformation</code> &#xBC29;&#xBC95;&#xC5D0; &#xBE44;&#xD574; &#xCEE4;&#xB110; &#xC774;&#xBBF8;&#xC9C0; &#xBCA0;&#xC774;&#xC2A4; &#xC8FC;&#xC18C;&#xB9CC; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xC0C1;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB3C4;&#xAC00; &#xB5A8;&#xC5B4;&#xC9C4;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xB3C4; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xACB0;&#xAD6D; 24H2&#xC5D0; &#xCD94;&#xAC00;&#xB41C; <code>NtQuerySystemInformaton</code> &#xAD8C;&#xD55C; &#xC81C;&#xD55C;&#xC740; &#xCEE4;&#xB110; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC5D0; &#xC0C1;&#xB2F9;&#xD55C; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC5C8;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. <del>+ &#xC55E;&#xC73C;&#xB85C; &#xCEE4;&#xB110;&#xD558;&#xB824;&#xBA74; CPU &#xB9E4;&#xB274;&#xC5BC;&#xC744; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBD10;&#xC57C;&#xD558;&#xB294;&#xAC74;&#xAC00;..</del></p>
<h2 id="&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;"></a>&#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xBA70;</h2><p>&#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; Windows Kernel Exploit&#xC758; &#xAD6D;&#xBC25;&#xC774;&#xC5C8;&#xB358; <code>NtQuerySystemInformaton</code> &#xAD8C;&#xD55C; &#xD328;&#xCE58;&#xC640;, &#xADF8;&#xB85C; &#xC778;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; KASLR bypass &#xD14C;&#xD06C;&#xB2C9;&#xC758; &#xD544;&#xC694;&#xC131;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xB4F1;&#xC7A5;&#xD55C; sidechannel&#xC744; &#xD65C;&#xC6A9;&#xD55C; Kernel Leak &#xAE30;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC1C;&#xC778;&#xC801;&#xC778; &#xC758;&#xACAC;&#xC73C;&#xB85C;&#xB294; &#xADF8;&#xB3D9;&#xC548; Windows&#xC758; KASLR &#xC6B0;&#xD68C; &#xC5F0;&#xAD6C;&#xAC00; <code>NtQuerySystemInformaton</code> &#xC758; &#xC874;&#xC7AC; &#xB54C;&#xBB38;&#xC5D0; &#xD65C;&#xBC1C;&#xD558;&#xAC8C; &#xC5F0;&#xAD6C;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC9C0;&#xB9CC;, &#xC774;&#xBC88; 24H2&#xB85C; &#xAD8C;&#xD55C; &#xD328;&#xCE58;&#xAC00; &#xC0DD;&#xAE30;&#xBA74;&#xC11C; &#xC55E;&#xC73C;&#xB85C; &#xC0C8;&#xB85C;&#xC6B4; &#xC6B0;&#xD68C; &#xBC29;&#xBC95;&#xC774; &#xC5F0;&#xAD6C;&#xB418;&#xAE38; &#xAE30;&#xB300;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xB2E4;&#xC74C; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C; &#xB2E4;&#xC2DC; I/O Ring exploit&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<h2 id="References"><a href="#References" class="headerlink" title="References"></a>References</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://windows-internals.com/kaslr-leaks-restriction/">https://windows-internals.com/kaslr-leaks-restriction/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://exploits.forsale/24h2-nt-exploit/">https://exploits.forsale/24h2-nt-exploit/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/exploits-forsale/prefetch-tool">https://github.com/exploits-forsale/prefetch-tool</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/mitigation/">mitigation</a>
                  
                  <a class="hover-with-bg" href="/tags/kaslr/">kaslr</a>
                  
                  <a class="hover-with-bg" href="/tags/entrybleed/">entrybleed</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/04/16/OUYA77/2025-04-16/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-0411 : 7-Zip Mark-of-the-Web (MotW)    </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/04/13/l0ch/bypassing-kernel-mitigation-part0/en/">
                    <span class="hidden-mobile">[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (En)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/04/13/l0ch/bypassing-kernel-mitigation-part0/ko/';
        this.page.identifier = '/2025/04/13/l0ch/bypassing-kernel-mitigation-part0/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Bypassing Windows Kernel Mitigations: Part0 - Deep Dive into KASLR Leaks Restriction (Ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
