

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Windows Authentication Series &amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Part1 NTLM &amp;#xB54C;&amp;#xB294; Part2 &amp;#xB54C; NTLM &amp;#xAD00;&amp;#xB828; CVE &amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. NTLM &amp;#xAD00;&amp;#xB828; CVE&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; Windows &amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xB2E4;&amp;#xB904;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kerberos &amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xBD80;&amp;#xD130; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604; &amp;#xBC29;&amp;#xC2DD;, Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; CVE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xC885;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xC778;&amp;#xC99D;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xC778;&amp;#xC99D;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xB294; &amp;#xD2F0;&amp;#xCF13; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; KDC &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0C1;&amp;#xD638; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC778;&amp;#xC99D; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;KDC (Key Distribution Center): &amp;#xD0A4; &amp;#xBC30;&amp;#xD3EC; &amp;#xC13C;&amp;#xD130;, AS &amp;#xC640; TGS &amp;#xB97C; &amp;#xBB36;&amp;#xC740; &amp;#xC694;&amp;#xC18C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5; &amp;#xBC0F; &amp;#xC138;&amp;#xC158;&amp;#xD0A4; &amp;#xC0DD;&amp;#xC131;, &amp;#xBD84;&amp;#xBC30;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS (Authentication Server): &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBC84;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; TGS&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; TGT&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGS (Ticket Granting Server): &amp;#xD2F0;&amp;#xCF13; &amp;#xBD80;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; TGT&amp;#xB97C; TGS &amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBA74; ST &amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGT (Ticket Granting Ticket): &amp;#xD2F0;&amp;#xCF13; &amp;#xBD80;&amp;#xC5EC; &amp;#xD2F0;&amp;#xCF13;, TGS &amp;#xC5D0;&amp;#xC11C; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;ST (Service Ticket): &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SS (Service Server): &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; AS &amp;#xC5D0; &amp;#xC778;&amp;#xC99D; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS &amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; TGT &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C;, TGT&amp;#xB294; TGS &amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS, TGS &amp;#xB294; KDC&amp;#xB85C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC19;&amp;#xC740; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00;  TGT &amp;#xC640; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; ID &amp;#xB97C; TGS &amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGS &amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; ST &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC811;&amp;#xADFC; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; SPN (Service Principal Name) &amp;#xC73C;&amp;#xB85C; TGS&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; ST&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB3C4;&amp;#xC2DD;&amp;#xD654;&amp;#xD55C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/1.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-Kerberos-&amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;a href=&#34;#Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-Kerberos-&amp;#xC778;&amp;#xC99D;&#34; class=&#34;headerlink&#34; title=&#34;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;/a&gt;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&lt;/h2&gt;&lt;p&gt;Windows Kerberos &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; PAC (Privilege Attribute Certificate) &amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. PAC &amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xADF8;&amp;#xB8F9; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xAD8C;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. KDC&amp;#xAC00; &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC11C;&amp;#xBA85;&amp;#xD558;&amp;#xC5EC; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; &amp;#xC624;&amp;#xBA74; PAC&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xBD80;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790;, Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xB9AC;&amp;#xAC00; &amp;#xC544;&amp;#xD504;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1) AS-REQ&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;AS-REQ &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; KDC &amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; ID&amp;#xB85C; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815; &amp;#xC0C1;, &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD604;&amp;#xC7AC; &amp;#xC2DC;&amp;#xAC01;&amp;#xC744; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; (NTLM hash) &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; DC(Domain Controller) &amp;#xC5D0; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash &amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC778;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2) AS-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;AS-REQ &amp;#xC5D0;&amp;#xC11C; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; AS-REP &amp;#xC751;&amp;#xB2F5;&amp;#xC73C;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &lt;strong&gt;TGT&amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-TGS)&lt;/strong&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xBA70; TGT&amp;#xB294; &lt;strong&gt;KDC&amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130; &amp;#xD0A4; (krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash)&lt;/strong&gt; &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; TGT&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3) TGS-REQ&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C; TGT &amp;#xB97C; TGS-REQ &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC5B4;&amp;#xC11C; KDC&amp;#xC758; TGS &amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0;&amp;#xB294; &amp;#xB300;&amp;#xC0C1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; SPN &amp;#xACFC; &amp;#xC55E;&amp;#xC11C; &amp;#xBC1C;&amp;#xAE09;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-TGS&amp;#xAC04; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB3C4; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;4) TGS-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;KDC&amp;#xB294; TGS-REQ&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; TGT&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TGT &amp;#xB294; KDC &amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; KDC&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xC5EC; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; TGS-REP &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xC138;&amp;#xC158; &amp;#xD0A4;&lt;/strong&gt;(&lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;)&amp;#xC640; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;(ST)&lt;/strong&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;(&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash)&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB9CC;&lt;/strong&gt; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xC5EC; &amp;#xC5F4;&amp;#xB78C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; ST&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xB450;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;5) AP-REQ&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; AP-REQ &amp;#xB97C; &amp;#xB300;&amp;#xC0C1; &amp;#xC11C;&amp;#xBC84;(&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;)&amp;#xC5D0; &amp;#xC81C;&amp;#xC2DC;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC55E;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC138;&amp;#xC158; &amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xC778;&amp;#xC99D;&amp;#xC790;(Authenticator, &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504; &amp;#xB4F1;)&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC5D0; KERB_VERIFY_PAC &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xB0B4; PAC &amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; PAC&amp;#xB294; KDC&amp;#xC758; &amp;#xC11C;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xBA70;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; PAC&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xB0B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;6) AP-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC758; PAC&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; AP-REP &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; &amp;#xC138;&amp;#xC158; &amp;#xD0A4; &amp;#xD611;&amp;#xC0C1;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC124;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774;, Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xC11C;&amp;#xB85C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD0A4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash &amp;#xC774;&amp;#xBA70; PAC &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xACE0; PAC&amp;#xB294; KDC&amp;#xAC00; &amp;#xC11C;&amp;#xBA85;&amp;#xD558;&amp;#xC5EC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xACF5;&amp;#xACA9;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xACF5;&amp;#xACA9;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xAD6C;&amp;#xD604;&amp;#xC0C1; &amp;#xC124;&amp;#xC815;&amp;#xC774;&amp;#xB098; &amp;#xC6B4;&amp;#xC601; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows Kerberos &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xC9C0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Kerberoasting&#34;&gt;&lt;a href=&#34;#Kerberoasting&#34; class=&#34;headerlink&#34; title=&#34;Kerberoasting&#34;&gt;&lt;/a&gt;Kerberoasting&lt;/h2&gt;&lt;p&gt;Kerberoasting &amp;#xC740; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&lt;/strong&gt;&amp;#xC758; Kerberos &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xD6C4;, &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD06C;&amp;#xB799;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AD &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB77C;&amp;#xBA74; SPN &amp;#xC18D;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; TGS-REQ &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC989;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xB0B4;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8; &amp;#xCE68;&amp;#xD22C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; NTLM hash &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD06C;&amp;#xB799;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; NTLM hash &amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xBA70; &amp;#xC774; hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AS-REP-Roasting&#34;&gt;&lt;a href=&#34;#AS-REP-Roasting&#34; class=&#34;headerlink&#34; title=&#34;AS-REP Roasting&#34;&gt;&lt;/a&gt;AS-REP Roasting&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;AS-REP Roasting&lt;/strong&gt;&amp;#xC740; Kerberoasting&amp;#xACFC; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &lt;strong&gt;Kerberos Pre-Authentication&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC740; TGT &amp;#xAC00; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; key &amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AD &amp;#xACC4;&amp;#xC815; &amp;#xC18D;&amp;#xC131; &amp;#xC911; &amp;#x201C;Do not require Kerberos pre authentication&amp;#x201D; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; &amp;#xC5C6;&amp;#xC774; TGT &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8;&amp;#xAE4C;, &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; TGT&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;TGT &amp;#xB294; KDC&amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130;&amp;#xD0A4; &amp;#xC989;, krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; TGT &amp;#xD06C;&amp;#xB799;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xC148;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;Silver-Ticket&#34;&gt;&lt;a href=&#34;#Silver-Ticket&#34; class=&#34;headerlink&#34; title=&#34;Silver Ticket&#34;&gt;&lt;/a&gt;Silver Ticket&lt;/h2&gt;&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD2B9;&amp;#xC815; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; &amp;#xC6D0;&amp;#xB798; TGS &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xAE09;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC; TGS &amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xB0B4; PAC &amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xC640; krbtgt &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; 2&amp;#xAC1C;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; &amp;#xC11C;&amp;#xBA85;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SeTcbPrivilege &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xADF8;&amp;#xB7EC;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC815;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; &amp;#xC11C;&amp;#xBA85;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Silver Ticket &amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Golden-Ticket&#34;&gt;&lt;a href=&#34;#Golden-Ticket&#34; class=&#34;headerlink&#34; title=&#34;Golden Ticket&#34;&gt;&lt;/a&gt;Golden Ticket&lt;/h2&gt;&lt;p&gt;krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0C8;&amp;#xB2E4;&amp;#xBA74; TGT &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; TGT &amp;#xC5D0;&amp;#xB3C4; PAC &amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC55E;&amp;#xC11C; Silver Ticket &amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC758; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; Golden Ticket &amp;#xC740; TGT &amp;#xC758; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xC791;&amp;#xB41C; PAC&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; TGT&amp;#xAC00; TGS &amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC5B4;&amp;#xB4DC;&amp;#xBBFC; &amp;#xB4F1; &amp;#xB354; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xBC29;&amp;#xB300;&amp;#xD558;&amp;#xACE0; Windows &amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xAD00;&amp;#xB828; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; CVE &amp;#xBA87; &amp;#xC885;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC138;&amp;#xBD80; &amp;#xC0AC;&amp;#xD56D;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC640; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC16;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2020-17049&#34;&gt;&lt;a href=&#34;#CVE-2020-17049&#34; class=&#34;headerlink&#34; title=&#34;CVE-2020-17049&#34;&gt;&lt;/a&gt;CVE-2020-17049&lt;/h2&gt;&lt;p&gt;CVE-2020-17049&amp;#xB294; Kerberos Delegation &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#x201C;Bronze Bit&amp;#x201D; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Delegtation &amp;#xC740; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC784;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD558;&amp;#xACE0;, &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xB54C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#x201C;&amp;#xC704;&amp;#xC784;&amp;#x201D; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; Kerberos Delegation &amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC885; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (Unconstrained Delegation, Constrained Delegation, &amp;#xC704;&amp;#xC784; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C; &amp;#xB4F1;) &lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294; AllowedToDelegateTo &amp;#xD504;&amp;#xB85C;&amp;#xD37C;&amp;#xD2F0;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;A&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;B&amp;#xC5D0; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Forwardable Flag &amp;#xB294; &amp;#xC774; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; Relay &amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB290;&amp;#xB0D0;&amp;#xB97C; &amp;#xD45C;&amp;#xAE30;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xC778;&amp;#xB370;&amp;#xC694;. Forwardable &amp;#xC774; 1&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC55E;&amp;#xC11C; Kerberos Delegation &amp;#xC635;&amp;#xC158; &amp;#xC911; &amp;#xC704;&amp;#xC784; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C; &amp;#xC635;&amp;#xC158;&amp;#xC774;&amp;#xB098;, AllowedToDelegateTo &amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; Forwardable&amp;#xC774; 0&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; Forwardable bit &amp;#xB294; KDC&amp;#xC758; &amp;#xC11C;&amp;#xBA85;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xBCC0;&amp;#xC870;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCBE4; &amp;#xC624;&amp;#xBA74; &amp;#xC774; CVE&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;Forwardable Flag &amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBA74; &amp;#xADF8; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kerberos Contrained Delegation (MS-SFU) &amp;#xB294; S4U2proxy &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB9CC;&amp;#xC57D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; A&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; B&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xB420; &amp;#xB54C; A &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xB9CC; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; B&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. S4U2proxy &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; KDC&amp;#xC5D0; A &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; B &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; Forwardable flag&amp;#xB97C; 1&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xAC15;&amp;#xC81C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2022-33647-amp-CVE-2022-33679&#34;&gt;&lt;a href=&#34;#CVE-2022-33647-amp-CVE-2022-33679&#34; class=&#34;headerlink&#34; title=&#34;CVE-2022-33647 &amp;amp; CVE-2022-33679&#34;&gt;&lt;/a&gt;CVE-2022-33647 &amp;amp; CVE-2022-33679&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;CVE-2022-33647&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;CVE-2022-33679&lt;/strong&gt;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00; Project Zero &amp;#xC758; James Forshaw &amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815; &amp;#xC911; RC4 &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC5EC; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Kerberos &amp;#xAC00; &amp;#xC6D0;&amp;#xB798;&amp;#xB294; AES &amp;#xAE30;&amp;#xBC18; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC131; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; RC4-HMAC(MD4) &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; RC4 &amp;#xB97C; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; AS-REQ &amp;#xB97C; KDC&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xB54C; etype &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC815;&amp;#xC218;&amp;#xD615; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xBC1B;&amp;#xACE0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;CVE-2022-33647 &amp;#xB97C; Exploit &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Forshaw &amp;#xD615;&amp;#xB2D8;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xB180;&amp;#xB77C;&amp;#xC6B4;&amp;#xB370;&amp;#xC694;. &amp;#xD55C; &amp;#xBC88; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC778;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; KDC&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; KDC_ERR_PREAUTH_REQUIRED &amp;#xB77C;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC624;&amp;#xB958; &amp;#xC751;&amp;#xB2F5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBAA9;&amp;#xB85D; &amp;#xB4F1;&amp;#xC744; &amp;#xC2E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. MITM &amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; AS-REQ &amp;#xB97C; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC5D0; RC4-MD4 &amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB123;&amp;#xC5B4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; RC4-MD4 &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RC4&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AS-REQ &amp;#xB97C; &amp;#xB9B4;&amp;#xB808;&amp;#xC774;&amp;#xD558;&amp;#xC5EC; KDC&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC5B4; AS-REP &amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; RC4&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AS-REQ &amp;#xC640; AS-REP &amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xC640; TGT&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AS-REQ &amp;#xC5D0;&amp;#xB294; PA-ENC-TS-ENC &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; AS-REP &amp;#xB294; EncASRepPart &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC751;&amp;#xB2F5; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xB904;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RC4 &amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD0A4;&amp;#xB85C; XOR &amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;, &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xACFC; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD0A4;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591; &amp;#xCABD;&amp;#xC774; &amp;#xB178;&amp;#xB780;&amp;#xC0C9;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC0B0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;RC4-MD4 &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC55E; 5&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB9CC; &amp;#xB79C;&amp;#xB364;&amp;#xC774;&amp;#xACE0; 11&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; 0xAB&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xB85D;&amp;#xC0C9; &amp;#xD45C;&amp;#xC2DC;&amp;#xB294; ASN.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xC758; 4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; overlap &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB294; KDC&amp;#xC5D0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; 256&amp;#xBC88; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xC0C1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B4;&amp;#xACE0; &amp;#xD2F0;&amp;#xCF13; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CVE-2022-33679&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; Keberos &amp;#xC758; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; (pre-authentication) &amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACC4;&amp;#xC815;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; KDC&amp;#xC5D0; AS-REQ &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; RC4-MD4 &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; TGT&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xAEBC;&amp;#xC838; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; KDC&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; KDC&amp;#xB294; AS-REP&amp;#xB97C; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; RC4 &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; TGT &amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; Exploit &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xD328;&amp;#xB529;&amp;#xCC98;&amp;#xB7FC; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504; &amp;#xB4A4;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xB110; &amp;#xAC12;&amp;#xC744; &amp;#xBD99;&amp;#xC5EC; &amp;#xB098;&amp;#xAC00; KDC&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD0A4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2022-37966&#34;&gt;&lt;a href=&#34;#CVE-2022-37966&#34; class=&#34;headerlink&#34; title=&#34;CVE-2022-37966&#34;&gt;&lt;/a&gt;CVE-2022-37966&lt;/h2&gt;&lt;p&gt;CVE-2022-37966 &amp;#xC740; 2022 &amp;#xBE14;&amp;#xB799;&amp;#xD587; &amp;#xC720;&amp;#xB7FD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB54C; &amp;#xB2F9;&amp;#xC2DC; Kerberos &amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB358; RC4_HMAC_MD5 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; PAC &amp;#xBCC0;&amp;#xC870; &amp;#xD6C4; MD5 &amp;#xCF5C;&amp;#xB9AC;&amp;#xC83C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PAC &amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC5F4;&amp;#xC744; &amp;#xB123;&amp;#xC744;&amp;#xB9CC;&amp;#xD55C;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; LogonScript &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC4F0;&amp;#xBA74; &amp;#xAE34; &amp;#xAE38;&amp;#xC774;&amp;#xC758; UTF-16 &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; MD5 &amp;#xCF5C;&amp;#xB9AC;&amp;#xC804;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; Exploit &amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; MD5 hash &amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; PAC&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC2E4;&amp;#xC81C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; HashClash&amp;#xB85C; &amp;#xC57D; 7 &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xC18C;&amp;#xC694;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xBC88; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0B4;&amp;#xBA74; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xD22C;&amp;#xC790;&amp;#xD560;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;h2 id=&#34;CVE-2024-43639&#34;&gt;&lt;a href=&#34;#CVE-2024-43639&#34; class=&#34;headerlink&#34; title=&#34;CVE-2024-43639&#34;&gt;&lt;/a&gt;CVE-2024-43639&lt;/h2&gt;&lt;p&gt;CVE-2024-43639 &amp;#xB294; ZDI &amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, KDC Proxy (kdcsvc) &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Integer Overflow &amp;#xC5D0; &amp;#xC758;&amp;#xD55C; Heap Overflow &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows KDC Proxy &amp;#xB294; Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; HTTP&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85D;&amp;#xC2DC; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; Windows Server &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. kdcsvc &amp;#xB77C;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; kpssvc.dll &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xACC4;&amp;#xC18D; Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xB85C;&amp;#xC9C0;&amp;#xCEEC; &amp;#xBC84;&amp;#xADF8;&amp;#xB9CC; &amp;#xBCF4;&amp;#xB2E4;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC18;&amp;#xAC11;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; Windows &amp;#xAD6C;&amp;#xD604;, &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kerberos &amp;#xB294; &amp;#xAC15;&amp;#xD55C; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC124;&amp;#xC815;&amp;#xC0C1;&amp;#xC758; &amp;#xC624;&amp;#xB958;&amp;#xB098; &amp;#xAD6C;&amp;#xD604;&amp;#xC0C1;&amp;#xC758; &amp;#xBBF8;&amp;#xBE44;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBBF8;&amp;#xC815;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h1 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/Kerberos_(protocol&#34;&gt;https://en.wikipedia.org/wiki/Kerberos_(protocol)&lt;/a&gt;)&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication&#34;&gt;https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.varonis.com/blog/kerberos-attack-silver-ticket&#34;&gt;https://www.varonis.com/blog/kerberos-attack-silver-ticket&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8&#34;&gt;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/&#34;&gt;https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.hackthebox.com/blog/as-rep-roasting-detection&#34;&gt;https://www.hackthebox.com/blog/as-rep-roasting-detection&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/&#34;&gt;https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html&#34;&gt;https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://syfuhs.net/a-bit-about-kerberos&#34;&gt;https://syfuhs.net/a-bit-about-kerberos&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf&#34;&gt;https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.thehacker.recipes/ad/movement/kerberos/&#34;&gt;https://www.thehacker.recipes/ad/movement/kerberos/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://en.hackndo.com/kerberos-silver-golden-tickets/&#34;&gt;https://en.hackndo.com/kerberos-silver-golden-tickets/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/&#34;&gt;https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview&#34;&gt;https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/&#34;&gt;https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639&#34;&gt;https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Windows Authentication Series (Part2. Kerberos)(KR) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. Windows Authentication Series &amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Part1 NTLM &amp;#xB54C;&amp;#xB294; Part2 &amp;#xB54C; NTLM &amp;#xAD00;&amp;#xB828; CVE &amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. NTLM &amp;#xAD00;&amp;#xB828; CVE&amp;#xB97C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC88B;&amp;#xC9C0;&amp;#xB9CC; Windows &amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xB2E4;&amp;#xB904;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kerberos &amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xBD80;&amp;#xD130; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604; &amp;#xBC29;&amp;#xC2DD;, Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xAD00;&amp;#xB828; CVE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBA87; &amp;#xC885;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xC778;&amp;#xC99D;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xC778;&amp;#xC99D;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xB294; &amp;#xD2F0;&amp;#xCF13; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; KDC &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC0C1;&amp;#xD638; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC778;&amp;#xC99D; &amp;#xAD6C;&amp;#xC870;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;KDC (Key Distribution Center): &amp;#xD0A4; &amp;#xBC30;&amp;#xD3EC; &amp;#xC13C;&amp;#xD130;, AS &amp;#xC640; TGS &amp;#xB97C; &amp;#xBB36;&amp;#xC740; &amp;#xC694;&amp;#xC18C;&amp;#xB85C; &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5; &amp;#xBC0F; &amp;#xC138;&amp;#xC158;&amp;#xD0A4; &amp;#xC0DD;&amp;#xC131;, &amp;#xBD84;&amp;#xBC30;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS (Authentication Server): &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBC84;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; TGS&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; TGT&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGS (Ticket Granting Server): &amp;#xD2F0;&amp;#xCF13; &amp;#xBD80;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; TGT&amp;#xB97C; TGS &amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBA74; ST &amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGT (Ticket Granting Ticket): &amp;#xD2F0;&amp;#xCF13; &amp;#xBD80;&amp;#xC5EC; &amp;#xD2F0;&amp;#xCF13;, TGS &amp;#xC5D0;&amp;#xC11C; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;ST (Service Ticket): &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;SS (Service Server): &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; AS &amp;#xC5D0; &amp;#xC778;&amp;#xC99D; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS &amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; TGT &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C;, TGT&amp;#xB294; TGS &amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;AS, TGS &amp;#xB294; KDC&amp;#xB85C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC19;&amp;#xC740; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00;  TGT &amp;#xC640; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; ID &amp;#xB97C; TGS &amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;TGS &amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; ST &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC811;&amp;#xADFC; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; SPN (Service Principal Name) &amp;#xC73C;&amp;#xB85C; TGS&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; ST&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB3C4;&amp;#xC2DD;&amp;#xD654;&amp;#xD55C; &amp;#xADF8;&amp;#xB9BC;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/1.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-Kerberos-&amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;a href=&#34;#Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758;-Kerberos-&amp;#xC778;&amp;#xC99D;&#34; class=&#34;headerlink&#34; title=&#34;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&#34;&gt;&lt;/a&gt;Windows&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&lt;/h2&gt;&lt;p&gt;Windows Kerberos &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; PAC (Privilege Attribute Certificate) &amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. PAC &amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xADF8;&amp;#xB8F9; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xAD8C;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. KDC&amp;#xAC00; &amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC11C;&amp;#xBA85;&amp;#xD558;&amp;#xC5EC; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; &amp;#xC624;&amp;#xBA74; PAC&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xBD80;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790;, Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xB2E4;&amp;#xC74C; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xB9AC;&amp;#xAC00; &amp;#xC544;&amp;#xD504;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1) AS-REQ&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;AS-REQ &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; KDC &amp;#xC758; &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; ID&amp;#xB85C; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815; &amp;#xC0C1;, &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD604;&amp;#xC7AC; &amp;#xC2DC;&amp;#xAC01;&amp;#xC744; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; (NTLM hash) &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; DC(Domain Controller) &amp;#xC5D0; &amp;#xBCF4;&amp;#xAD00;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash &amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xC5EC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC778;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2) AS-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;AS-REQ &amp;#xC5D0;&amp;#xC11C; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; AS-REP &amp;#xC751;&amp;#xB2F5;&amp;#xC73C;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &lt;strong&gt;TGT&amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;(&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-TGS)&lt;/strong&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xBA70; TGT&amp;#xB294; &lt;strong&gt;KDC&amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130; &amp;#xD0A4; (krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash)&lt;/strong&gt; &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; TGT&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3) TGS-REQ&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C; TGT &amp;#xB97C; TGS-REQ &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC5B4;&amp;#xC11C; KDC&amp;#xC758; TGS &amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0;&amp;#xB294; &amp;#xB300;&amp;#xC0C1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; SPN &amp;#xACFC; &amp;#xC55E;&amp;#xC11C; &amp;#xBC1C;&amp;#xAE09;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-TGS&amp;#xAC04; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB3C4; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;4) TGS-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;KDC&amp;#xB294; TGS-REQ&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; TGT&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. TGT &amp;#xB294; KDC &amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; KDC&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xC5EC; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; TGS-REP &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &lt;strong&gt;&amp;#xC138;&amp;#xC158; &amp;#xD0A4;&lt;/strong&gt;(&lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;-&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;)&amp;#xC640; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;(ST)&lt;/strong&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;(&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash)&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB9CC;&lt;/strong&gt; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xC5EC; &amp;#xC5F4;&amp;#xB78C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC774; ST&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xB450;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;5) AP-REQ&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xB4E4;&amp;#xACE0; AP-REQ &amp;#xB97C; &amp;#xB300;&amp;#xC0C1; &amp;#xC11C;&amp;#xBC84;(&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;)&amp;#xC5D0; &amp;#xC81C;&amp;#xC2DC;&amp;#xD558;&amp;#xC5EC; &amp;#xC811;&amp;#xC18D;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC55E;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC138;&amp;#xC158; &amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C; &amp;#xC778;&amp;#xC99D;&amp;#xC790;(Authenticator, &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504; &amp;#xB4F1;)&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xB7EC;&amp;#xC5D0; KERB_VERIFY_PAC &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xB0B4; PAC &amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; PAC&amp;#xB294; KDC&amp;#xC758; &amp;#xC11C;&amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xBA70;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; PAC&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xB0B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;6) AP-REP&lt;/strong&gt; &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC758; PAC&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; AP-REP &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB85C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; &amp;#xC138;&amp;#xC158; &amp;#xD0A4; &amp;#xD611;&amp;#xC0C1;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC124;&amp;#xBA85;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774;, Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xC758; Kerberos &amp;#xC778;&amp;#xC99D;&amp;#xC740; &amp;#xC11C;&amp;#xB85C; &amp;#xACF5;&amp;#xC720;&amp;#xB418;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD0A4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; NTLM hash &amp;#xC774;&amp;#xBA70; PAC &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xACE0; PAC&amp;#xB294; KDC&amp;#xAC00; &amp;#xC11C;&amp;#xBA85;&amp;#xD558;&amp;#xC5EC; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xACF5;&amp;#xACA9;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xACF5;&amp;#xACA9;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xAD6C;&amp;#xD604;&amp;#xC0C1; &amp;#xC124;&amp;#xC815;&amp;#xC774;&amp;#xB098; &amp;#xC6B4;&amp;#xC601; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xB418;&amp;#xC5B4; &amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows Kerberos &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC8FC;&amp;#xB85C; &amp;#xB2E4;&amp;#xB904;&amp;#xC9C0;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Kerberoasting&#34;&gt;&lt;a href=&#34;#Kerberoasting&#34; class=&#34;headerlink&#34; title=&#34;Kerberoasting&#34;&gt;&lt;/a&gt;Kerberoasting&lt;/h2&gt;&lt;p&gt;Kerberoasting &amp;#xC740; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC778; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&lt;/strong&gt;&amp;#xC758; Kerberos &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xD6C4;, &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD06C;&amp;#xB799;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AD &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB77C;&amp;#xBA74; SPN &amp;#xC18D;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; TGS-REQ &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC989;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xB0B4;&amp;#xB85C; &amp;#xC774;&amp;#xBBF8; &amp;#xCE68;&amp;#xD22C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; NTLM hash &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD06C;&amp;#xB799;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; NTLM hash &amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xBA70; &amp;#xC774; hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC740; Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;AS-REP-Roasting&#34;&gt;&lt;a href=&#34;#AS-REP-Roasting&#34; class=&#34;headerlink&#34; title=&#34;AS-REP Roasting&#34;&gt;&lt;/a&gt;AS-REP Roasting&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;AS-REP Roasting&lt;/strong&gt;&amp;#xC740; Kerberoasting&amp;#xACFC; &amp;#xC720;&amp;#xC0AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &lt;strong&gt;Kerberos Pre-Authentication&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&lt;/strong&gt;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC740; TGT &amp;#xAC00; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xACF5;&amp;#xC720;&amp;#xB41C; key &amp;#xB97C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AD &amp;#xACC4;&amp;#xC815; &amp;#xC18D;&amp;#xC131; &amp;#xC911; &amp;#x201C;Do not require Kerberos pre authentication&amp;#x201D; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC635;&amp;#xC158;&amp;#xC774; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; &amp;#xC5C6;&amp;#xC774; TGT &amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8;&amp;#xAE4C;, &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; TGT&amp;#xB97C; &amp;#xBC1C;&amp;#xAE09;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;TGT &amp;#xB294; KDC&amp;#xC758; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD130;&amp;#xD0A4; &amp;#xC989;, krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; TGT &amp;#xD06C;&amp;#xB799;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xC148;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;Silver-Ticket&#34;&gt;&lt;a href=&#34;#Silver-Ticket&#34; class=&#34;headerlink&#34; title=&#34;Silver Ticket&#34;&gt;&lt;/a&gt;Silver Ticket&lt;/h2&gt;&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD2B9;&amp;#xC815; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B8; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC740; &amp;#xC6D0;&amp;#xB798; TGS &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xAE09;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xC9C0;&amp;#xB9CC; TGS &amp;#xB97C; &amp;#xD1B5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xB3C4; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13; &amp;#xB0B4; PAC &amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4;&amp;#xC640; krbtgt &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; 2&amp;#xAC1C;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; &amp;#xC11C;&amp;#xBA85;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; SeTcbPrivilege &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xADF8;&amp;#xB7EC;&amp;#xD55C;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xACC4;&amp;#xC815;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACC4;&amp;#xC815; &amp;#xBE44;&amp;#xBC00;&amp;#xD0A4; &amp;#xC11C;&amp;#xBA85;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Silver Ticket &amp;#xC758; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Golden-Ticket&#34;&gt;&lt;a href=&#34;#Golden-Ticket&#34; class=&#34;headerlink&#34; title=&#34;Golden Ticket&#34;&gt;&lt;/a&gt;Golden Ticket&lt;/h2&gt;&lt;p&gt;krbtgt &amp;#xACC4;&amp;#xC815;&amp;#xC758; NTLM hash &amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0C8;&amp;#xB2E4;&amp;#xBA74; TGT &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; TGT &amp;#xC5D0;&amp;#xB3C4; PAC &amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC55E;&amp;#xC11C; Silver Ticket &amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC758; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; Golden Ticket &amp;#xC740; TGT &amp;#xC758; PAC&amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xC791;&amp;#xB41C; PAC&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; TGT&amp;#xAC00; TGS &amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; &amp;#xBC1C;&amp;#xAE09;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xC5B4;&amp;#xB4DC;&amp;#xBBFC; &amp;#xB4F1; &amp;#xB354; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;a href=&#34;#Kerberos-&amp;#xAD00;&amp;#xB828;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34; class=&#34;headerlink&#34; title=&#34;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&#34;&gt;&lt;/a&gt;Kerberos &amp;#xAD00;&amp;#xB828; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC740; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xBC29;&amp;#xB300;&amp;#xD558;&amp;#xACE0; Windows &amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; &amp;#xAC01;&amp;#xC885; &amp;#xAD00;&amp;#xB828; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC5B4;&amp;#xB835;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30;&amp;#xC5D0; CVE &amp;#xBA87; &amp;#xC885;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC138;&amp;#xBD80; &amp;#xC0AC;&amp;#xD56D;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC640; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xAC16;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2020-17049&#34;&gt;&lt;a href=&#34;#CVE-2020-17049&#34; class=&#34;headerlink&#34; title=&#34;CVE-2020-17049&#34;&gt;&lt;/a&gt;CVE-2020-17049&lt;/h2&gt;&lt;p&gt;CVE-2020-17049&amp;#xB294; Kerberos Delegation &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, &amp;#x201C;Bronze Bit&amp;#x201D; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Delegtation &amp;#xC740; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC784;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0; &amp;#xC778;&amp;#xC99D;&amp;#xC744; &amp;#xD558;&amp;#xACE0;, &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xB54C;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xC6F9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#x201C;&amp;#xC704;&amp;#xC784;&amp;#x201D; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; Kerberos Delegation &amp;#xC774; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC885; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (Unconstrained Delegation, Constrained Delegation, &amp;#xC704;&amp;#xC784; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C; &amp;#xB4F1;) &lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294; AllowedToDelegateTo &amp;#xD504;&amp;#xB85C;&amp;#xD37C;&amp;#xD2F0;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;A&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;B&amp;#xC5D0; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Forwardable Flag &amp;#xB294; &amp;#xC774; &amp;#xD2F0;&amp;#xCF13;&amp;#xC774; Relay &amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB290;&amp;#xB0D0;&amp;#xB97C; &amp;#xD45C;&amp;#xAE30;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xC778;&amp;#xB370;&amp;#xC694;. Forwardable &amp;#xC774; 1&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC55E;&amp;#xC11C; Kerberos Delegation &amp;#xC635;&amp;#xC158; &amp;#xC911; &amp;#xC704;&amp;#xC784; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C; &amp;#xC635;&amp;#xC158;&amp;#xC774;&amp;#xB098;, AllowedToDelegateTo &amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; Forwardable&amp;#xC774; 0&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; Forwardable bit &amp;#xB294; KDC&amp;#xC758; &amp;#xC11C;&amp;#xBA85;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xBCC0;&amp;#xC870;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCBE4; &amp;#xC624;&amp;#xBA74; &amp;#xC774; CVE&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;Forwardable Flag &amp;#xB97C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBA74; &amp;#xADF8; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5B4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows &amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kerberos Contrained Delegation (MS-SFU) &amp;#xB294; S4U2proxy &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB9CC;&amp;#xC57D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; A&amp;#xAC00; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; B&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC774; &amp;#xB420; &amp;#xB54C; A &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xB9CC; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; B&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. S4U2proxy &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; KDC&amp;#xC5D0; A &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; B &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; Forwardable flag&amp;#xB97C; 1&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xAC15;&amp;#xC81C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC704;&amp;#xC784;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2022-33647-amp-CVE-2022-33679&#34;&gt;&lt;a href=&#34;#CVE-2022-33647-amp-CVE-2022-33679&#34; class=&#34;headerlink&#34; title=&#34;CVE-2022-33647 &amp;amp; CVE-2022-33679&#34;&gt;&lt;/a&gt;CVE-2022-33647 &amp;amp; CVE-2022-33679&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;CVE-2022-33647&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;CVE-2022-33679&lt;/strong&gt;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00; Project Zero &amp;#xC758; James Forshaw &amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, Kerberos &amp;#xC778;&amp;#xC99D; &amp;#xACFC;&amp;#xC815; &amp;#xC911; RC4 &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC5EC; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Kerberos &amp;#xAC00; &amp;#xC6D0;&amp;#xB798;&amp;#xB294; AES &amp;#xAE30;&amp;#xBC18; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC120;&amp;#xD638;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD558;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC131; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; RC4-HMAC(MD4) &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; RC4 &amp;#xB97C; &amp;#xAC15;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; AS-REQ &amp;#xB97C; KDC&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD560; &amp;#xB54C; etype &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC815;&amp;#xC218;&amp;#xD615; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xBC1B;&amp;#xACE0;&amp;#xC11C; &amp;#xC9C0;&amp;#xC6D0; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC81C;&amp;#xC2DC;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;CVE-2022-33647 &amp;#xB97C; Exploit &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; Forshaw &amp;#xD615;&amp;#xB2D8;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4;&amp;#xAC00; &amp;#xB180;&amp;#xB77C;&amp;#xC6B4;&amp;#xB370;&amp;#xC694;. &amp;#xD55C; &amp;#xBC88; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC778;&amp;#xC99D;&amp;#xD560; &amp;#xB54C; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; KDC&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. KDC&amp;#xB294; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; KDC_ERR_PREAUTH_REQUIRED &amp;#xB77C;&amp;#xB294; &amp;#xC5D0;&amp;#xB7EC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC624;&amp;#xB958; &amp;#xC751;&amp;#xB2F5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBAA9;&amp;#xB85D; &amp;#xB4F1;&amp;#xC744; &amp;#xC2E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC801;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. MITM &amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; AS-REQ &amp;#xB97C; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC5D0;&amp;#xB7EC;&amp;#xC5D0; RC4-MD4 &amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB123;&amp;#xC5B4; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; RC4-MD4 &amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. RC4&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AS-REQ &amp;#xB97C; &amp;#xB9B4;&amp;#xB808;&amp;#xC774;&amp;#xD558;&amp;#xC5EC; KDC&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC5B4; AS-REP &amp;#xB97C; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790; &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; RC4&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; AS-REQ &amp;#xC640; AS-REP &amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xC640; TGT&amp;#xB97C; &amp;#xC5BB;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. AS-REQ &amp;#xC5D0;&amp;#xB294; PA-ENC-TS-ENC &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC788;&amp;#xACE0; AS-REP &amp;#xB294; EncASRepPart &amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC751;&amp;#xB2F5; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xB904;&amp;#xC838; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/04/21/mungsul/NTLM_Part2/ko/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;RC4 &amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD0A4;&amp;#xB85C; XOR &amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8;, &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xACFC; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xD0A4;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591; &amp;#xCABD;&amp;#xC774; &amp;#xB178;&amp;#xB780;&amp;#xC0C9;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC0B0;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;RC4-MD4 &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xC55E; 5&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB9CC; &amp;#xB79C;&amp;#xB364;&amp;#xC774;&amp;#xACE0; 11&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; 0xAB&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD08;&amp;#xB85D;&amp;#xC0C9; &amp;#xD45C;&amp;#xC2DC;&amp;#xB294; ASN.1 &amp;#xAD6C;&amp;#xC870;&amp;#xC774;&amp;#xAE30;&amp;#xC5D0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B4;&amp;#xC774; &amp;#xC88B;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xC758; 4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; overlap &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAE30;&amp;#xC5D0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB8E8;&amp;#xD2B8;&amp;#xD3EC;&amp;#xC2A4;&amp;#xB294; KDC&amp;#xC5D0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; 256&amp;#xBC88; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xC5EC; &amp;#xC815;&amp;#xC0C1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD2F0;&amp;#xCF13;&amp;#xC744; &amp;#xBC1C;&amp;#xAE09; &amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B4;&amp;#xACE0; &amp;#xD2F0;&amp;#xCF13; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;CVE-2022-33679&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; Keberos &amp;#xC758; &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D; (pre-authentication) &amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xB41C; &amp;#xACC4;&amp;#xC815;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xACC4;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC9C1;&amp;#xC811; KDC&amp;#xC5D0; AS-REQ &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; RC4-MD4 &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; TGT&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC804; &amp;#xC778;&amp;#xC99D;&amp;#xC774; &amp;#xAEBC;&amp;#xC838; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; KDC&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB97C; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xB3C4; KDC&amp;#xB294; AS-REP&amp;#xB97C; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; RC4 &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; TGT &amp;#xC640; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; Exploit &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xC138;&amp;#xC158;&amp;#xD0A4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xB294; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xC624;&amp;#xB77C;&amp;#xD074; &amp;#xD328;&amp;#xB529;&amp;#xCC98;&amp;#xB7FC; &amp;#xD0C0;&amp;#xC784;&amp;#xC2A4;&amp;#xD0EC;&amp;#xD504; &amp;#xB4A4;&amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xB110; &amp;#xAC12;&amp;#xC744; &amp;#xBD99;&amp;#xC5EC; &amp;#xB098;&amp;#xAC00; KDC&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD0A4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0B4;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;CVE-2022-37966&#34;&gt;&lt;a href=&#34;#CVE-2022-37966&#34; class=&#34;headerlink&#34; title=&#34;CVE-2022-37966&#34;&gt;&lt;/a&gt;CVE-2022-37966&lt;/h2&gt;&lt;p&gt;CVE-2022-37966 &amp;#xC740; 2022 &amp;#xBE14;&amp;#xB799;&amp;#xD587; &amp;#xC720;&amp;#xB7FD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB54C; &amp;#xB2F9;&amp;#xC2DC; Kerberos &amp;#xC5D0;&amp;#xC11C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB358; RC4_HMAC_MD5 &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; PAC &amp;#xBCC0;&amp;#xC870; &amp;#xD6C4; MD5 &amp;#xCF5C;&amp;#xB9AC;&amp;#xC83C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;PAC &amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC5F4;&amp;#xC744; &amp;#xB123;&amp;#xC744;&amp;#xB9CC;&amp;#xD55C;, &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; LogonScript &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xC4F0;&amp;#xBA74; &amp;#xAE34; &amp;#xAE38;&amp;#xC774;&amp;#xC758; UTF-16 &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; MD5 &amp;#xCF5C;&amp;#xB9AC;&amp;#xC804;&amp;#xC744; &amp;#xC720;&amp;#xBC1C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; Exploit &amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; MD5 hash &amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; PAC&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC2E4;&amp;#xC81C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; HashClash&amp;#xB85C; &amp;#xC57D; 7 &amp;#xC2DC;&amp;#xAC04; &amp;#xB3D9;&amp;#xC548; &amp;#xC18C;&amp;#xC694;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C; &amp;#xBC88; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xB0B4;&amp;#xBA74; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xD22C;&amp;#xC790;&amp;#xD560;&amp;#xB9CC; &amp;#xD55C; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;h2 id=&#34;CVE-2024-43639&#34;&gt;&lt;a href=&#34;#CVE-2024-43639&#34; class=&#34;headerlink&#34; title=&#34;CVE-2024-43639&#34;&gt;&lt;/a&gt;CVE-2024-43639&lt;/h2&gt;&lt;p&gt;CVE-2024-43639 &amp;#xB294; ZDI &amp;#xC5D0; &amp;#xC81C;&amp;#xBCF4;&amp;#xB41C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C;, KDC Proxy (kdcsvc) &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; Integer Overflow &amp;#xC5D0; &amp;#xC758;&amp;#xD55C; Heap Overflow &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows KDC Proxy &amp;#xB294; Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; HTTP&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85D;&amp;#xC2DC; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; Windows Server &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. kdcsvc &amp;#xB77C;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; kpssvc.dll &amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xACC4;&amp;#xC18D; Kerberos &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xB85C;&amp;#xC9C0;&amp;#xCEEC; &amp;#xBC84;&amp;#xADF8;&amp;#xB9CC; &amp;#xBCF4;&amp;#xB2E4;&amp;#xAC00; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC18;&amp;#xAC11;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;Kerberos &amp;#xC791;&amp;#xB3D9; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; Windows &amp;#xAD6C;&amp;#xD604;, &amp;#xAD00;&amp;#xB828; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Kerberos &amp;#xB294; &amp;#xAC15;&amp;#xD55C; &amp;#xC778;&amp;#xC99D; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC124;&amp;#xC815;&amp;#xC0C1;&amp;#xC758; &amp;#xC624;&amp;#xB958;&amp;#xB098; &amp;#xAD6C;&amp;#xD604;&amp;#xC0C1;&amp;#xC758; &amp;#xBBF8;&amp;#xBE44;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xACFC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; &amp;#xBBF8;&amp;#xC815;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC7AC;&amp;#xBC0C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F642;&lt;/p&gt;
&lt;h1 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://en.wikipedia.org/wiki/Kerberos_(protocol&#34;&gt;https://en.wikipedia.org/wiki/Kerberos_(protocol)&lt;/a&gt;)&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication&#34;&gt;https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.varonis.com/blog/kerberos-attack-silver-ticket&#34;&gt;https://www.varonis.com/blog/kerberos-attack-silver-ticket&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8&#34;&gt;https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos&#34;&gt;https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/&#34;&gt;https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.hackthebox.com/blog/as-rep-roasting-detection&#34;&gt;https://www.hackthebox.com/blog/as-rep-roasting-detection&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/&#34;&gt;https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html&#34;&gt;https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://syfuhs.net/a-bit-about-kerberos&#34;&gt;https://syfuhs.net/a-bit-about-kerberos&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf&#34;&gt;https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.thehacker.recipes/ad/movement/kerberos/&#34;&gt;https://www.thehacker.recipes/ad/movement/kerberos/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://en.hackndo.com/kerberos-silver-golden-tickets/&#34;&gt;https://en.hackndo.com/kerberos-silver-golden-tickets/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/&#34;&gt;https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview&#34;&gt;https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/&#34;&gt;https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926&#34;&gt;https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639&#34;&gt;https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/04/21/mungsul/NTLM_Part2/ko/thumbnail.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/04/21/mungsul/ntlm_part2/ko/">

  <title>[Research] Windows Authentication Series (Part2. Kerberos)(KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-04-21 23:00" pubdate>
      2025 4 21 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      98
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Windows Authentication Series (Part2. Kerberos)(KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. Windows Authentication Series &#xB85C; &#xB2E4;&#xC2DC; &#xCC3E;&#xC544;&#xBD59;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Part1 NTLM &#xB54C;&#xB294; Part2 &#xB54C; NTLM &#xAD00;&#xB828; CVE &#xB97C; &#xC0B4;&#xD3B4;&#xBCFC; &#xC608;&#xC815;&#xC774;&#xB77C;&#xACE0; &#xD588;&#xC5C8;&#xB294;&#xB370;&#xC694;. NTLM &#xAD00;&#xB828; CVE&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC9C0;&#xB9CC; Windows &#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; Kerberos &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xBA3C;&#xC800; &#xB2E4;&#xB904;&#xBD10;&#xC57C;&#xACA0;&#xB2E4; &#xC2F6;&#xC5B4;&#xC11C; &#xB0B4;&#xC6A9;&#xC744; &#xC900;&#xBE44;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAE00;&#xC5D0;&#xC11C;&#xB294; Kerberos &#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC791;&#xB3D9; &#xC6D0;&#xB9AC;&#xBD80;&#xD130; Windows &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xAD6C;&#xD604; &#xBC29;&#xC2DD;, Kerberos &#xAD00;&#xB828; &#xACF5;&#xACA9;&#xACFC; &#xAD00;&#xB828; CVE &#xCDE8;&#xC57D;&#xC810; &#xBA87; &#xC885;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xAC00;&#xC838;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Kerberos-&#xC778;&#xC99D;"><a href="#Kerberos-&#xC778;&#xC99D;" class="headerlink" title="Kerberos &#xC778;&#xC99D;"></a>Kerberos &#xC778;&#xC99D;</h1><p>Kerberos &#xB294; &#xD2F0;&#xCF13; &#xAE30;&#xBC18;&#xC758; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; KDC &#xB97C; &#xD1B5;&#xD574; &#xB300;&#xCE6D; &#xD0A4; &#xC554;&#xD638;&#xD654; &#xAE30;&#xBC18;&#xC758; &#xD2F0;&#xCF13;&#xC744; &#xBC1C;&#xAE09;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC; &#xC790;&#xCCB4;&#xB97C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB178;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xC0AC;&#xC6A9;&#xC790;&#xC640; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC0C1;&#xD638; &#xC778;&#xC99D;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC778;&#xC99D; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC694;&#xC18C;&#xAC00; &#xB4F1;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>KDC (Key Distribution Center): &#xD0A4; &#xBC30;&#xD3EC; &#xC13C;&#xD130;, AS &#xC640; TGS &#xB97C; &#xBB36;&#xC740; &#xC694;&#xC18C;&#xB85C; &#xC778;&#xC99D; &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5; &#xBC0F; &#xC138;&#xC158;&#xD0A4; &#xC0DD;&#xC131;, &#xBD84;&#xBC30;&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>AS (Authentication Server): &#xC778;&#xC99D; &#xC11C;&#xBC84;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC778;&#xC99D;&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; TGS&#xC758; &#xBE44;&#xBC00;&#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654;&#xB41C; TGT&#xB97C; &#xBC1C;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>TGS (Ticket Granting Server): &#xD2F0;&#xCF13; &#xBD80;&#xC5EC; &#xC11C;&#xBC84;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; TGT&#xB97C; TGS &#xC5D0; &#xBCF4;&#xB0B4;&#xBA74; ST &#xC640; &#xC138;&#xC158;&#xD0A4;&#xB97C; &#xBC1C;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>TGT (Ticket Granting Ticket): &#xD2F0;&#xCF13; &#xBD80;&#xC5EC; &#xD2F0;&#xCF13;, TGS &#xC5D0;&#xC11C; &#xD2F0;&#xCF13;&#xC744; &#xBC1C;&#xAE09;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xD2F0;&#xCF13;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>ST (Service Ticket): &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xD2F0;&#xCF13;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>SS (Service Server): &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>Kerberos &#xC778;&#xC99D; &#xC808;&#xCC28;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; AS &#xC5D0; &#xC778;&#xC99D; &#xC694;&#xCCAD;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>AS &#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; TGT &#xB97C; &#xBC1C;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.<ol>
<li>&#xC774; &#xB54C;, TGT&#xB294; TGS &#xC758; &#xBE44;&#xBC00;&#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li>AS, TGS &#xB294; KDC&#xB85C; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xAC19;&#xC740; &#xD638;&#xC2A4;&#xD2B8;&#xB97C; &#xACF5;&#xC720;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00;  TGT &#xC640; &#xC694;&#xCCAD;&#xD560; &#xC11C;&#xBE44;&#xC2A4;&#xC758; ID &#xB97C; TGS &#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>TGS &#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; ST &#xB97C; &#xBC1C;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.<ol>
<li>&#xC774; &#xB54C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC811;&#xADFC; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB294; SPN (Service Principal Name) &#xC73C;&#xB85C; TGS&#xC5D0; &#xB4F1;&#xB85D;&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; ST&#xB97C; &#xC11C;&#xBC84;&#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD1B5;&#xC2E0;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xC704; &#xACFC;&#xC815;&#xC744; &#xB3C4;&#xC2DD;&#xD654;&#xD55C; &#xADF8;&#xB9BC;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/21/mungsul/NTLM_Part2/ko/1.png" srcset="/img/loading.gif" alt></p>
<h2 id="Windows&#xC5D0;&#xC11C;&#xC758;-Kerberos-&#xC778;&#xC99D;"><a href="#Windows&#xC5D0;&#xC11C;&#xC758;-Kerberos-&#xC778;&#xC99D;" class="headerlink" title="Windows&#xC5D0;&#xC11C;&#xC758; Kerberos &#xC778;&#xC99D;"></a>Windows&#xC5D0;&#xC11C;&#xC758; Kerberos &#xC778;&#xC99D;</h2><p>Windows Kerberos &#xAD6C;&#xD604;&#xC5D0;&#xC11C;&#xB294; &#xD2F0;&#xCF13;&#xC5D0; PAC (Privilege Attribute Certificate) &#xB77C;&#xB294;&#xAC8C; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;. PAC &#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xADF8;&#xB8F9; &#xC815;&#xBCF4;&#xC640; &#xAD8C;&#xD55C; &#xB370;&#xC774;&#xD130; &#xB4F1;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294;&#xB370;&#xC694;. KDC&#xAC00; &#xC774; &#xC815;&#xBCF4;&#xB97C; &#xC11C;&#xBA85;&#xD558;&#xC5EC; &#xD2F0;&#xCF13;&#xC744; &#xBC1C;&#xAE09;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xB294; &#xD2F0;&#xCF13;&#xC774; &#xC624;&#xBA74; PAC&#xB97C; &#xBCF4;&#xACE0; &#xAD8C;&#xD55C;&#xC744; &#xD655;&#xC778;&#xD558;&#xC5EC; &#xC811;&#xADFC;&#xC744; &#xD5C8;&#xC6A9;&#xD558;&#xAC70;&#xB098; &#xAC70;&#xBD80;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC790;, Windows &#xC5D0;&#xC11C;&#xB294; &#xC704;&#xC5D0;&#xC11C; &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xBA85;&#xD55C; Kerberos &#xC778;&#xC99D; &#xACFC;&#xC815;&#xC744; &#xB2E4;&#xC74C; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; &#xC9C4;&#xD589;&#xD558;&#xB294;&#xB370;&#xC694;. </p>
<p>&#xBA38;&#xB9AC;&#xAC00; &#xC544;&#xD504;&#xC9C0;&#xB9CC; &#xD558;&#xB098;&#xD558;&#xB098; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/21/mungsul/NTLM_Part2/ko/2.png" srcset="/img/loading.gif" alt></p>
<p><strong>1) AS-REQ</strong></p>
<p>AS-REQ &#xC5D0;&#xC11C;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; KDC &#xC758; &#xC778;&#xC99D; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC790;&#xC2E0;&#xC758; ID&#xB85C; &#xD2F0;&#xCF13;&#xC744; &#xC694;&#xCCAD;&#xD569;&#xB2C8;&#xB2E4;. Windows &#xAE30;&#xBCF8; &#xC124;&#xC815; &#xC0C1;, &#xC0AC;&#xC804; &#xC778;&#xC99D;&#xC744; &#xD1B5;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD604;&#xC7AC; &#xC2DC;&#xAC01;&#xC744; &#xC790;&#xC2E0;&#xC758; &#xBE44;&#xBC00;&#xD0A4; (NTLM hash) &#xB85C; &#xC554;&#xD638;&#xD654;&#xD558;&#xC5EC; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. KDC&#xB294; DC(Domain Controller) &#xC5D0; &#xBCF4;&#xAD00;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; NTLM hash &#xB85C; &#xC774;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC778;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>2) AS-REP</strong> </p>
<p>AS-REQ &#xC5D0;&#xC11C; &#xAC80;&#xC99D;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74; AS-REP &#xC751;&#xB2F5;&#xC73C;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; <strong>TGT&#xC640; &#xC138;&#xC158;&#xD0A4;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-TGS)</strong> &#xB97C; &#xBC1C;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;. &#xC138;&#xC158;&#xD0A4;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC758; NTLM hash&#xB85C; &#xC554;&#xD638;&#xD654;&#xB418;&#xBA70; TGT&#xB294; <strong>KDC&#xC758; &#xB9C8;&#xC2A4;&#xD130; &#xD0A4; (krbtgt &#xACC4;&#xC815;&#xC758; NTLM hash)</strong> &#xB85C; &#xC554;&#xD638;&#xD654; &#xB418;&#xC5B4; &#xC788;&#xAE30;&#xC5D0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; TGT&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>3) TGS-REQ</strong> </p>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xC5D0; &#xC811;&#xADFC;&#xC774; &#xD544;&#xC694;&#xD560; &#xB54C; TGT &#xB97C; TGS-REQ &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0; &#xC2E4;&#xC5B4;&#xC11C; KDC&#xC758; TGS &#xC5D0; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774; &#xC694;&#xCCAD;&#xC5D0;&#xB294; &#xB300;&#xC0C1; &#xC11C;&#xBE44;&#xC2A4;&#xC758; SPN &#xACFC; &#xC55E;&#xC11C; &#xBC1C;&#xAE09;&#xB41C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-TGS&#xAC04; &#xC138;&#xC158;&#xD0A4;&#xB3C4; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>4) TGS-REP</strong> </p>
<p>KDC&#xB294; TGS-REQ&#xB97C; &#xBC1B;&#xC544;&#xC11C; TGT&#xAC00; &#xC720;&#xD6A8;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. TGT &#xB294; KDC &#xC758; &#xB9C8;&#xC2A4;&#xD130;&#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654; &#xB418;&#xC5B4; &#xC788;&#xAE30;&#xC5D0; KDC&#xAC00; &#xBCF5;&#xD638;&#xD654; &#xD558;&#xC5EC; &#xAC80;&#xC99D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xD574;&#xB2F9; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC694;&#xCCAD;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC811;&#xADFC; &#xAD8C;&#xD55C;&#xC774; &#xD655;&#xC778;&#xD558;&#xACE0; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xC73C;&#xBA74; TGS-REP &#xC751;&#xB2F5;&#xC744; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC5EC;&#xAE30;&#xC5D0;&#xB294; <strong>&#xC138;&#xC158; &#xD0A4;</strong>(<strong>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;</strong>)&#xC640; <strong>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;(ST)</strong>&#xC774; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC740; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815;&#xC758; &#xBE44;&#xBC00; &#xD0A4;(&#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815;&#xC758; NTLM hash)&#xB85C; &#xC554;&#xD638;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBBC0;&#xB85C; <strong>&#xC11C;&#xBE44;&#xC2A4;&#xB9CC;</strong> &#xBCF5;&#xD638;&#xD654; &#xD558;&#xC5EC; &#xC5F4;&#xB78C;&#xD560; &#xC218; &#xC788;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xC54C; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC774; ST&#xB97C; &#xBC1B;&#xC544;&#xB450;&#xC5C8;&#xB2E4;&#xAC00; &#xC2E4;&#xC81C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><strong>5) AP-REQ</strong></p>
<p>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xB4E4;&#xACE0; AP-REQ &#xB97C; &#xB300;&#xC0C1; &#xC11C;&#xBC84;(&#xC11C;&#xBE44;&#xC2A4;)&#xC5D0; &#xC81C;&#xC2DC;&#xD558;&#xC5EC; &#xC811;&#xC18D;&#xC744; &#xC2DC;&#xB3C4;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC790;&#xC2E0;&#xC758; &#xC2E0;&#xC6D0;&#xC744; &#xC99D;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC55E;&#xC11C; &#xBC1B;&#xC740; &#xC11C;&#xBE44;&#xC2A4; &#xC138;&#xC158; &#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654;&#xD55C; &#xC778;&#xC99D;&#xC790;(Authenticator, &#xD0C0;&#xC784;&#xC2A4;&#xD0EC;&#xD504; &#xB4F1;)&#xB3C4; &#xD568;&#xAED8; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC11C;&#xBC84;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC5D0; KERB_VERIFY_PAC &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xC5EC; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13; &#xB0B4; PAC &#xC758; &#xC11C;&#xBA85; &#xAC80;&#xC99D;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; PAC&#xB294; KDC&#xC758; &#xC11C;&#xBA85;&#xC73C;&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xBA70;, &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xD2F0;&#xCF13;&#xC744; &#xAC80;&#xC99D;&#xD560; &#xB54C; PAC&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xD655;&#xC778;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xB3C4;&#xBA54;&#xC778; &#xB0B4; &#xAD8C;&#xD55C;&#xC744; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/21/mungsul/NTLM_Part2/ko/3.png" srcset="/img/loading.gif" alt></p>
<p><strong>6) AP-REP</strong> </p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xC5D0;&#xC11C;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC81C;&#xC2DC;&#xD55C; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC758; PAC&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xAC80;&#xC99D;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74; &#xC11C;&#xBC84;&#xB294; AP-REP &#xBA54;&#xC2DC;&#xC9C0;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC751;&#xB2F5;&#xC744; &#xBCF4;&#xB0B4; &#xC138;&#xC158; &#xD0A4; &#xD611;&#xC0C1;&#xC744; &#xC644;&#xB8CC;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xC774; &#xD5C8;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. </p>
<hr>
<p>&#xC124;&#xBA85;&#xC5D0;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774;, Windows &#xC5D0;&#xC11C;&#xC758; Kerberos &#xC778;&#xC99D;&#xC740; &#xC11C;&#xB85C; &#xACF5;&#xC720;&#xB418;&#xB294; &#xC554;&#xD638;&#xD0A4;&#xAC00; &#xC0AC;&#xC6A9;&#xC790;&#xC758; NTLM hash &#xC774;&#xBA70; PAC &#xB77C;&#xACE0; &#xD558;&#xB294; &#xAD8C;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD2F0;&#xCF13;&#xC5D0; &#xB2F4;&#xACA8;&#xC788;&#xACE0; PAC&#xB294; KDC&#xAC00; &#xC11C;&#xBA85;&#xD558;&#xC5EC; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xD655;&#xBCF4;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Kerberos-&#xAD00;&#xB828;-&#xACF5;&#xACA9;"><a href="#Kerberos-&#xAD00;&#xB828;-&#xACF5;&#xACA9;" class="headerlink" title="Kerberos &#xAD00;&#xB828; &#xACF5;&#xACA9;"></a>Kerberos &#xAD00;&#xB828; &#xACF5;&#xACA9;</h1><p>Kerberos &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC790;&#xCCB4;&#xB294; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xB098;, &#xAD6C;&#xD604;&#xC0C1; &#xC124;&#xC815;&#xC774;&#xB098; &#xC6B4;&#xC601; &#xD658;&#xACBD;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xC591;&#xD55C; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xC774; &#xC5F0;&#xAD6C;&#xB418;&#xC5B4; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. Windows Kerberos &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xB2E4;&#xB904;&#xC9C0;&#xB294; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h2 id="Kerberoasting"><a href="#Kerberoasting" class="headerlink" title="Kerberoasting"></a>Kerberoasting</h2><p>Kerberoasting &#xC740; &#xD569;&#xBC95;&#xC801;&#xC778; &#xB3C4;&#xBA54;&#xC778; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC73C;&#xB85C; <strong>&#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815;</strong>&#xC758; Kerberos &#xD2F0;&#xCF13;&#xC744; &#xC694;&#xCCAD;&#xD55C; &#xD6C4;, &#xD2F0;&#xCF13;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xC554;&#xD638;&#xD654;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xD06C;&#xB799;&#xD558;&#xC5EC; &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815;&#xC758; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xB294; &#xACF5;&#xACA9; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>AD &#xB3C4;&#xBA54;&#xC778; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB77C;&#xBA74; SPN &#xC18D;&#xC131;&#xC774; &#xC788;&#xB294; &#xACC4;&#xC815;&#xC5D0; &#xB300;&#xD574;&#xC11C; TGS-REQ &#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xC694;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xC989;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB3C4;&#xBA54;&#xC778; &#xB0B4;&#xB85C; &#xC774;&#xBBF8; &#xCE68;&#xD22C;&#xD55C; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xBC95;&#xC774;&#xC8E0;.</p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC740; NTLM hash &#xB85C; &#xC554;&#xD638;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD06C;&#xB799;&#xC774; &#xC131;&#xACF5;&#xD55C;&#xB2E4;&#xBA74; NTLM hash &#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xB294; &#xAC83;&#xC774;&#xBA70; &#xC774; hash &#xB97C; &#xC5BB;&#xC5C8;&#xB2E4;&#xB294; &#xAC83;&#xC740; Windows &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC5BB;&#xC5B4;&#xB0B8; &#xAC83;&#xACFC; &#xB2E4;&#xB984;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="AS-REP-Roasting"><a href="#AS-REP-Roasting" class="headerlink" title="AS-REP Roasting"></a>AS-REP Roasting</h2><p><strong>AS-REP Roasting</strong>&#xC740; Kerberoasting&#xACFC; &#xC720;&#xC0AC;&#xD558;&#xC9C0;&#xB9CC;, <strong>Kerberos Pre-Authentication&#xC774; &#xBE44;&#xD65C;&#xC131;&#xD654;</strong>&#xB41C; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xD45C;&#xC801;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC804; &#xC778;&#xC99D;&#xC740; TGT &#xAC00; &#xBC1C;&#xAE09;&#xB418;&#xAE30; &#xC804;&#xC5D0; &#xC0AC;&#xC804;&#xC5D0; &#xACF5;&#xC720;&#xB41C; key &#xB97C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC54C;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>AD &#xACC4;&#xC815; &#xC18D;&#xC131; &#xC911; &#x201C;Do not require Kerberos pre authentication&#x201D; &#xC774;&#xB77C;&#xB294; &#xC635;&#xC158;&#xC774; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC0AC;&#xC804; &#xC778;&#xC99D; &#xC5C6;&#xC774; TGT &#xB97C; &#xBC1C;&#xAE09;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB2C8;&#xAE4C;, &#xD328;&#xC2A4;&#xC6CC;&#xB4DC; &#xC5C6;&#xC774;&#xB3C4; TGT&#xB97C; &#xBC1C;&#xAE09;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB9D0;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>TGT &#xB294; KDC&#xC758; &#xB9C8;&#xC2A4;&#xD130;&#xD0A4; &#xC989;, krbtgt &#xACC4;&#xC815;&#xC758; NTLM hash &#xB85C; &#xC554;&#xD638;&#xD654;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; TGT &#xD06C;&#xB799;&#xC5D0; &#xC131;&#xACF5;&#xD55C;&#xB2E4;&#xBA74; krbtgt &#xACC4;&#xC815;&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xD0C8;&#xCDE8;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB294; &#xC148;&#xC785;&#xB2C8;&#xB2E4;. </p>
<h2 id="Silver-Ticket"><a href="#Silver-Ticket" class="headerlink" title="Silver Ticket"></a>Silver Ticket</h2><p>&#xB9CC;&#xC57D; &#xD2B9;&#xC815; &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815;&#xC758; NTLM hash &#xB97C; &#xC5BB;&#xC5B4;&#xB0B8; &#xC0C1;&#xD669;&#xC774;&#xB77C;&#xBA74; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; PAC&#xB97C; &#xC870;&#xC791;&#xD55C; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC740; &#xC6D0;&#xB798; TGS &#xC5D0;&#xC11C; &#xBC1C;&#xAE09;&#xC744; &#xD574;&#xC8FC;&#xC9C0;&#xB9CC; TGS &#xB97C; &#xD1B5;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13; &#xC0DD;&#xC131;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13; &#xB0B4; PAC &#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815; &#xBE44;&#xBC00;&#xD0A4;&#xC640; krbtgt &#xACC4;&#xC815; &#xBE44;&#xBC00;&#xD0A4; 2&#xAC1C;&#xB85C; &#xC11C;&#xBA85;&#xC774; &#xB418;&#xB294;&#xB370;, &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815; &#xBE44;&#xBC00;&#xD0A4; &#xC11C;&#xBA85;&#xB9CC; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; SeTcbPrivilege &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xADF8;&#xB7EC;&#xD55C;&#xB370;&#xC694;. &#xC774; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xACC4;&#xC815;&#xC740; &#xC11C;&#xBE44;&#xC2A4; &#xACC4;&#xC815; &#xBE44;&#xBC00;&#xD0A4; &#xC11C;&#xBA85;&#xB9CC; &#xAC80;&#xC99D;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Silver Ticket &#xC758; &#xB300;&#xC0C1;&#xC774; &#xB41C;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Golden-Ticket"><a href="#Golden-Ticket" class="headerlink" title="Golden Ticket"></a>Golden Ticket</h2><p>krbtgt &#xACC4;&#xC815;&#xC758; NTLM hash &#xB97C; &#xC5BB;&#xC5B4;&#xB0C8;&#xB2E4;&#xBA74; TGT &#xC0DD;&#xC131;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; TGT &#xC5D0;&#xB3C4; PAC &#xAC00; &#xD3EC;&#xD568;&#xB418;&#xB294;&#xB370;&#xC694;. &#xC55E;&#xC11C; Silver Ticket &#xC740; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC758; PAC&#xB97C; &#xC870;&#xC791;&#xD588;&#xB2E4;&#xBA74; Golden Ticket &#xC740; TGT &#xC758; PAC&#xB97C; &#xC870;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC870;&#xC791;&#xB41C; PAC&#xB97C; &#xAC00;&#xC9C4; TGT&#xAC00; TGS &#xC5D0; &#xC804;&#xB2EC;&#xC774; &#xB418;&#xBA74; &#xD574;&#xB2F9; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC774; &#xBC1C;&#xAE09;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xB3C4;&#xBA54;&#xC778; &#xC5B4;&#xB4DC;&#xBBFC; &#xB4F1; &#xB354; &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC0C1;&#xC2B9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Kerberos-&#xAD00;&#xB828;-&#xCDE8;&#xC57D;&#xC810;"><a href="#Kerberos-&#xAD00;&#xB828;-&#xCDE8;&#xC57D;&#xC810;" class="headerlink" title="Kerberos &#xAD00;&#xB828; &#xCDE8;&#xC57D;&#xC810;"></a>Kerberos &#xAD00;&#xB828; &#xCDE8;&#xC57D;&#xC810;</h1><p>Kerberos &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; &#xB0B4;&#xC6A9;&#xC774; &#xBC29;&#xB300;&#xD558;&#xACE0; Windows &#xC5D0;&#xC11C; &#xAD6C;&#xD604;&#xD55C; &#xAC01;&#xC885; &#xAD00;&#xB828; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xC18C;&#xAC1C;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30;&#xC5D0; CVE &#xBA87; &#xC885;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;&#xC11C; &#xC5B4;&#xB5A4; &#xC138;&#xBD80; &#xC0AC;&#xD56D;&#xB4E4;&#xC774; &#xC788;&#xB294;&#xC9C0;&#xC640; &#xBC1C;&#xC0DD;&#xD588;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xAC16;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="CVE-2020-17049"><a href="#CVE-2020-17049" class="headerlink" title="CVE-2020-17049"></a>CVE-2020-17049</h2><p>CVE-2020-17049&#xB294; Kerberos Delegation &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, &#x201C;Bronze Bit&#x201D; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC54C;&#xB824;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Delegtation &#xC740; &#xC9C1;&#xC5ED;&#xD558;&#xBA74; &#xC704;&#xC784;&#xC778;&#xB370;&#xC694;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0; &#xC778;&#xC99D;&#xC744; &#xD558;&#xACE0;, &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC0AC;&#xC6A9;&#xC790; &#xAD8C;&#xD55C;&#xC5D0; &#xB530;&#xB77C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD574;&#xC57C;&#xD560; &#xB54C;&#xAC00; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xC2DC;&#xB2E4;. &#xC774; &#xB54C; &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC0AC;&#xC6A9;&#xC790; &#xAD8C;&#xD55C;&#xC744; &#x201C;&#xC704;&#xC784;&#x201D; &#xBC1B;&#xC544;&#xC11C; &#xC694;&#xCCAD;&#xC744; &#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xAE30; &#xC704;&#xD55C; Kerberos Delegation &#xC774; &#xC5EC;&#xB7EC; &#xC885; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (Unconstrained Delegation, Constrained Delegation, &#xC704;&#xC784; &#xD558;&#xC9C0; &#xC54A;&#xC74C; &#xB4F1;) </p>
<p>&#xC704;&#xC784;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB4E4;&#xC744; &#xC9C0;&#xC815;&#xD558;&#xB294; AllowedToDelegateTo &#xD504;&#xB85C;&#xD37C;&#xD2F0;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD2B9;&#xC815; &#xC11C;&#xBE44;&#xC2A4;A&#xAC00; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4;B&#xC5D0; &#xC704;&#xC784;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC5D0; &#xC788;&#xB294; Forwardable Flag &#xB294; &#xC774; &#xD2F0;&#xCF13;&#xC774; Relay &#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB290;&#xB0D0;&#xB97C; &#xD45C;&#xAE30;&#xD558;&#xB294; &#xBE44;&#xD2B8;&#xC778;&#xB370;&#xC694;. Forwardable &#xC774; 1&#xC774;&#xB77C;&#xBA74; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xB9D0;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC55E;&#xC11C; Kerberos Delegation &#xC635;&#xC158; &#xC911; &#xC704;&#xC784; &#xD558;&#xC9C0; &#xC54A;&#xC74C; &#xC635;&#xC158;&#xC774;&#xB098;, AllowedToDelegateTo &#xB85C; &#xC815;&#xC758;&#xAC00; &#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC744; &#xACBD;&#xC6B0; Forwardable&#xC774; 0&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; Forwardable bit &#xB294; KDC&#xC758; &#xC11C;&#xBA85;, &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC11C;&#xBA85; &#xB4F1;&#xC73C;&#xB85C; &#xBCF4;&#xD638;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC544;&#xC11C; &#xBCC0;&#xC870;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xCBE4; &#xC624;&#xBA74; &#xC774; CVE&#xAC00; &#xC5B4;&#xB5A4; &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xC9C0; &#xAC10;&#xC774; &#xC624;&#xC2DC;&#xB098;&#xC694;?</p>
<p>&#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC5D0; &#xC788;&#xB294;Forwardable Flag &#xB97C; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xBCF4;&#xB0B4;&#xBA74; &#xADF8; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC744; &#xD558;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xB354;&#xB77C;&#xB3C4; &#xAC15;&#xC81C;&#xB85C; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC744; &#xD558;&#xAC8C; &#xB418;&#xC5B4; &#xAD8C;&#xD55C;&#xC744; &#xD0C8;&#xCDE8;&#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Windows &#xC5D0;&#xC11C;&#xB294; Kerberos Contrained Delegation (MS-SFU) &#xB294; S4U2proxy &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB85C; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC744; &#xAD6C;&#xD604;&#xD588;&#xB294;&#xB370;&#xC694;. &#xB9CC;&#xC57D; &#xC11C;&#xBE44;&#xC2A4; A&#xAC00; &#xC11C;&#xBE44;&#xC2A4; B&#xB85C; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC774; &#xB420; &#xB54C; A &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xB9CC; &#xAC00;&#xC9C0;&#xACE0;&#xC11C;&#xB294; &#xC11C;&#xBE44;&#xC2A4; B&#xC5D0; &#xC694;&#xCCAD;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. S4U2proxy &#xB97C; &#xD1B5;&#xD574; KDC&#xC5D0; A &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xC81C;&#xC2DC;&#xD558;&#xACE0; B &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; Forwardable flag&#xB97C; 1&#xB85C; &#xC124;&#xC815;&#xD558;&#xC5EC; &#xAC15;&#xC81C;&#xC801;&#xC73C;&#xB85C; &#xAD8C;&#xD55C; &#xC704;&#xC784;&#xC744; &#xC720;&#xBC1C;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="CVE-2022-33647-amp-CVE-2022-33679"><a href="#CVE-2022-33647-amp-CVE-2022-33679" class="headerlink" title="CVE-2022-33647 &amp; CVE-2022-33679"></a>CVE-2022-33647 &amp; CVE-2022-33679</h2><p><strong>CVE-2022-33647</strong>&#xACFC; <strong>CVE-2022-33679</strong>&#xB294; &#xAD6C;&#xAE00; Project Zero &#xC758; James Forshaw &#xAC00; &#xBC1C;&#xACAC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, Kerberos &#xC778;&#xC99D; &#xACFC;&#xC815; &#xC911; RC4 &#xC554;&#xD638;&#xD654; &#xC0AC;&#xC6A9;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xC5EC; &#xBE0C;&#xB8E8;&#xD2B8;&#xD3EC;&#xC2A4; &#xB4F1;&#xC758; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC138;&#xC158;&#xD0A4;&#xB97C; &#xBCF5;&#xD638;&#xD654; &#xD558;&#xACE0; &#xAD8C;&#xD55C;&#xC744; &#xD0C8;&#xCDE8;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;. Kerberos &#xAC00; &#xC6D0;&#xB798;&#xB294; AES &#xAE30;&#xBC18; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC120;&#xD638;&#xD558;&#xC9C0;&#xB9CC; &#xD558;&#xC704; &#xD638;&#xD658;&#xC131; &#xB54C;&#xBB38;&#xC5D0; RC4-HMAC(MD4) &#xBC29;&#xC2DD;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xAE30;&#xC5D0; &#xCDE8;&#xC57D;&#xC810; &#xD2B8;&#xB9AC;&#xAC70;&#xC5D0;&#xC11C;&#xB294; RC4 &#xB97C; &#xAC15;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; AS-REQ &#xB97C; KDC&#xC5D0; &#xC804;&#xB2EC;&#xD560; &#xB54C; etype &#xC774;&#xB77C;&#xB294; &#xC815;&#xC218;&#xD615; &#xD544;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC9C0;&#xC6D0; &#xAC00;&#xB2A5;&#xD55C; &#xC554;&#xD638;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC11C;&#xBC84;&#xB294; &#xC774;&#xB97C; &#xBC1B;&#xACE0;&#xC11C; &#xC9C0;&#xC6D0; &#xAC00;&#xB2A5;&#xD55C; &#xC554;&#xD638;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC81C;&#xC2DC;&#xD55C; &#xC554;&#xD638;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p>CVE-2022-33647 &#xB97C; Exploit &#xD558;&#xAE30; &#xC704;&#xD574; Forshaw &#xD615;&#xB2D8;&#xC774; &#xC0AC;&#xC6A9;&#xD55C; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xAC00; &#xB180;&#xB77C;&#xC6B4;&#xB370;&#xC694;. &#xD55C; &#xBC88; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC778;&#xC99D;&#xD560; &#xB54C; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC804; &#xC778;&#xC99D; &#xD0C0;&#xC784;&#xC2A4;&#xD0EC;&#xD504;&#xAC00; &#xC5C6;&#xB294; &#xC694;&#xCCAD;&#xC744; KDC&#xC5D0; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. KDC&#xB294; &#xADF8;&#xB7EC;&#xBA74; KDC_ERR_PREAUTH_REQUIRED &#xB77C;&#xB294; &#xC5D0;&#xB7EC; &#xCF54;&#xB4DC;&#xB97C; &#xD3EC;&#xD568;&#xD574;&#xC11C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC624;&#xB958; &#xC751;&#xB2F5;&#xC5D0;&#xC11C;&#xB294; &#xD544;&#xC694;&#xD55C; &#xC554;&#xD638;&#xD654; &#xBAA9;&#xB85D; &#xB4F1;&#xC744; &#xC2E4;&#xC5B4;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC801;&#xC808;&#xD558;&#xAC8C; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xB294;&#xB370;&#xC694;. MITM &#xC744; &#xD1B5;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; AS-REQ &#xB97C; &#xAC00;&#xB85C;&#xCC44;&#xACE0; &#xC5D0;&#xB7EC;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xBA74;&#xC11C; &#xC5D0;&#xB7EC;&#xC5D0; RC4-MD4 &#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xB123;&#xC5B4; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; RC4-MD4 &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. RC4&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; AS-REQ &#xB97C; &#xB9B4;&#xB808;&#xC774;&#xD558;&#xC5EC; KDC&#xC5D0; &#xBCF4;&#xB0B4;&#xC5B4; AS-REP &#xB97C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC790; &#xADF8;&#xB7EC;&#xBA74;, &#xACF5;&#xACA9;&#xC790;&#xB294; RC4&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; AS-REQ &#xC640; AS-REP &#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xC554;&#xD638;&#xD654;&#xB41C; &#xC138;&#xC158;&#xD0A4;&#xC640; TGT&#xB97C; &#xC5BB;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. AS-REQ &#xC5D0;&#xB294; PA-ENC-TS-ENC &#xB77C;&#xACE0; &#xD558;&#xB294; &#xD0C0;&#xC784;&#xC2A4;&#xD0EC;&#xD504;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xAC00; &#xC788;&#xACE0; AS-REP &#xB294; EncASRepPart &#xB77C;&#xACE0; &#xD558;&#xB294; &#xC554;&#xD638;&#xD654; &#xC751;&#xB2F5; &#xAD6C;&#xC870;&#xB85C; &#xC774;&#xB904;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/04/21/mungsul/NTLM_Part2/ko/4.png" srcset="/img/loading.gif" alt></p>
<p>RC4 &#xB294; &#xC0DD;&#xC131;&#xB41C; &#xC2A4;&#xD2B8;&#xB9BC; &#xD0A4;&#xB85C; XOR &#xC744; &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4; &#xBCF4;&#xB2C8;, &#xC554;&#xD638;&#xBB38;&#xACFC; &#xD3C9;&#xBB38;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xC73C;&#xBA74; &#xC2A4;&#xD2B8;&#xB9BC; &#xD0A4;&#xB97C; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xC591; &#xCABD;&#xC774; &#xB178;&#xB780;&#xC0C9;&#xC778; &#xACBD;&#xC6B0; &#xC81C;&#xC678;&#xD558;&#xACE0; &#xACC4;&#xC0B0;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC774;&#xC8E0;.</p>
<ul>
<li>RC4-MD4 &#xBC29;&#xC2DD;&#xC740; 16&#xBC14;&#xC774;&#xD2B8;&#xC758; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;, &#xC55E; 5&#xBC14;&#xC774;&#xD2B8;&#xB9CC; &#xB79C;&#xB364;&#xC774;&#xACE0; 11&#xBC14;&#xC774;&#xD2B8;&#xB294; 0xAB&#xB85C; &#xACE0;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xCD08;&#xB85D;&#xC0C9; &#xD45C;&#xC2DC;&#xB294; ASN.1 &#xAD6C;&#xC870;&#xC774;&#xAE30;&#xC5D0; &#xC54C;&#xACE0; &#xC788;&#xAC70;&#xB098; &#xACC4;&#xC0B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;. &#xC6B4;&#xC774; &#xC88B;&#xAC8C;&#xB3C4; &#xC138;&#xC158;&#xD0A4;&#xC758; 4&#xBC14;&#xC774;&#xD2B8; &#xC815;&#xB3C4;&#xAC00; overlap &#xB418;&#xC5B4; &#xC788;&#xAE30;&#xC5D0; &#xBCF5;&#xD638;&#xD654;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xACE0; 1&#xBC14;&#xC774;&#xD2B8;&#xB294; &#xBE0C;&#xB8E8;&#xD2B8;&#xD3EC;&#xC2A4;&#xB97C; &#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB8E8;&#xD2B8;&#xD3EC;&#xC2A4;&#xB294; KDC&#xC5D0; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; 256&#xBC88; &#xC694;&#xCCAD;&#xD558;&#xC5EC; &#xC815;&#xC0C1; &#xC11C;&#xBE44;&#xC2A4; &#xD2F0;&#xCF13;&#xC744; &#xBC1C;&#xAE09; &#xBC1B;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xC774;&#xB807;&#xAC8C; &#xC138;&#xC158;&#xD0A4;&#xB97C; &#xC5BB;&#xC5B4;&#xB0B4;&#xACE0; &#xD2F0;&#xCF13; &#xBCF5;&#xD638;&#xD654;&#xAE4C;&#xC9C0; &#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xD0C8;&#xCDE8;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>CVE-2022-33679&#xC758; &#xACBD;&#xC6B0;&#xB294; Keberos &#xC758; &#xC0AC;&#xC804; &#xC778;&#xC99D; (pre-authentication) &#xC774; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0;&#xC5D0; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC804; &#xC778;&#xC99D;&#xC774; &#xBE44;&#xD65C;&#xC131;&#xD654; &#xB41C; &#xACC4;&#xC815;&#xC774; &#xC788;&#xC73C;&#xBA74;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD574;&#xB2F9; &#xACC4;&#xC815;&#xC5D0; &#xB300;&#xD574; &#xC9C1;&#xC811; KDC&#xC5D0; AS-REQ &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4; RC4-MD4 &#xBC29;&#xC2DD;&#xC758; TGT&#xB97C; &#xC694;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC804; &#xC778;&#xC99D;&#xC774; &#xAEBC;&#xC838; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; KDC&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB97C; &#xC99D;&#xBA85;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB294;&#xB370;&#xB3C4; KDC&#xB294; AS-REP&#xB97C; &#xB97C; &#xD1B5;&#xD574; RC4 &#xC554;&#xD638;&#xD654;&#xB41C; TGT &#xC640; &#xC138;&#xC158;&#xD0A4;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; Exploit &#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC138;&#xC158;&#xD0A4;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xB294; &#xB300;&#xC2E0;&#xC5D0; &#xC624;&#xB77C;&#xD074; &#xD328;&#xB529;&#xCC98;&#xB7FC; &#xD0C0;&#xC784;&#xC2A4;&#xD0EC;&#xD504; &#xB4A4;&#xCABD;&#xC73C;&#xB85C; &#xB110; &#xAC12;&#xC744; &#xBD99;&#xC5EC; &#xB098;&#xAC00; KDC&#xC5D0;&#xC11C; &#xC815;&#xC0C1; &#xC751;&#xB2F5;&#xC744; &#xD558;&#xBA74; &#xD0A4;&#xB97C; &#xC5BB;&#xC5B4;&#xB0B4;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="CVE-2022-37966"><a href="#CVE-2022-37966" class="headerlink" title="CVE-2022-37966"></a>CVE-2022-37966</h2><p>CVE-2022-37966 &#xC740; 2022 &#xBE14;&#xB799;&#xD587; &#xC720;&#xB7FD;&#xC5D0;&#xC11C; &#xBC1C;&#xD45C;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC774;&#xB54C; &#xB2F9;&#xC2DC; Kerberos &#xC5D0;&#xC11C; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC9C0;&#xC6D0;&#xB418;&#xB358; RC4_HMAC_MD5 &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xC0AC;&#xC6A9; &#xC2DC; PAC &#xBCC0;&#xC870; &#xD6C4; MD5 &#xCF5C;&#xB9AC;&#xC83C;&#xC744; &#xD1B5;&#xD574; &#xAC80;&#xC99D;&#xC744; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>PAC &#xB0B4;&#xC5D0;&#xB294; &#xC784;&#xC758;&#xC758; &#xBC14;&#xC774;&#xD2B8;&#xC5F4;&#xC744; &#xB123;&#xC744;&#xB9CC;&#xD55C;, &#xCEE8;&#xD2B8;&#xB864; &#xAC00;&#xB2A5;&#xD55C; &#xD544;&#xB4DC;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; LogonScript &#xD544;&#xB4DC;&#xB97C; &#xC4F0;&#xBA74; &#xAE34; &#xAE38;&#xC774;&#xC758; UTF-16 &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xB123;&#xC744; &#xC218; &#xC788;&#xC5B4;&#xC11C; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; MD5 &#xCF5C;&#xB9AC;&#xC804;&#xC744; &#xC720;&#xBC1C;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; Exploit &#xD558;&#xB824;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; MD5 hash &#xB97C; &#xAC00;&#xC9C0;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC774; &#xD3EC;&#xD568;&#xB41C; PAC&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370;&#xC694;. &#xC2E4;&#xC81C; &#xC5F0;&#xAD6C;&#xC5D0;&#xC11C;&#xB3C4; HashClash&#xB85C; &#xC57D; 7 &#xC2DC;&#xAC04; &#xB3D9;&#xC548; &#xC18C;&#xC694;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD55C; &#xBC88; &#xB9CC;&#xB4E4;&#xC5B4;&#xB0B4;&#xBA74; &#xB3C4;&#xBA54;&#xC778; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC73C;&#xB2C8; &#xC2DC;&#xAC04;&#xC744; &#xD22C;&#xC790;&#xD560;&#xB9CC; &#xD55C; &#xAC83; &#xAC19;&#xB124;&#xC694;. </p>
<h2 id="CVE-2024-43639"><a href="#CVE-2024-43639" class="headerlink" title="CVE-2024-43639"></a>CVE-2024-43639</h2><p>CVE-2024-43639 &#xB294; ZDI &#xC5D0; &#xC81C;&#xBCF4;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;, KDC Proxy (kdcsvc) &#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; Integer Overflow &#xC5D0; &#xC758;&#xD55C; Heap Overflow &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Windows KDC Proxy &#xB294; Kerberos &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; HTTP&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85D;&#xC2DC; &#xD574;&#xC8FC;&#xB294; Windows Server &#xAD6C;&#xC131;&#xC694;&#xC18C; &#xC785;&#xB2C8;&#xB2E4;. kdcsvc &#xB77C;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xB294; kpssvc.dll &#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xACC4;&#xC18D; Kerberos &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xB85C;&#xC9C0;&#xCEEC; &#xBC84;&#xADF8;&#xB9CC; &#xBCF4;&#xB2E4;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xBC84;&#xADF8;&#xB97C; &#xBCF4;&#xB2C8; &#xBC18;&#xAC11;&#xAE30;&#xB3C4; &#xD558;&#xACE0; &#xC2E0;&#xAE30;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xB124;&#xC694;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>Kerberos &#xC791;&#xB3D9; &#xC6D0;&#xB9AC;&#xC640; Windows &#xAD6C;&#xD604;, &#xAD00;&#xB828; &#xACF5;&#xACA9;&#xACFC; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xAE4C;&#xC9C0; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. Kerberos &#xB294; &#xAC15;&#xD55C; &#xC778;&#xC99D; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774;&#xC9C0;&#xB9CC; &#xC124;&#xC815;&#xC0C1;&#xC758; &#xC624;&#xB958;&#xB098; &#xAD6C;&#xD604;&#xC0C1;&#xC758; &#xBBF8;&#xBE44;&#xB85C; &#xC778;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xACF5;&#xACA9;&#xACFC; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB178;&#xCD9C;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xC11C;&#xC758; &#xC8FC;&#xC81C;&#xB294; &#xC544;&#xC9C1; &#xBBF8;&#xC815;&#xC774;&#xC9C0;&#xB9CC; &#xC7AC;&#xBC0C;&#xB294; &#xC8FC;&#xC81C;&#xB85C; &#xB2E4;&#xC2DC; &#xCC3E;&#xC544;&#xBD59;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4; &#x1F642;</p>
<h1 id="References"><a href="#References" class="headerlink" title="References"></a>References</h1><ul>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Kerberos_(protocol">https://en.wikipedia.org/wiki/Kerberos_(protocol)</a>)</p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication">https://www.ibm.com/docs/ko/db2/11.5?topic=details-kerberos-authentication</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.varonis.com/blog/kerberos-attack-silver-ticket">https://www.varonis.com/blog/kerberos-attack-silver-ticket</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-apds/1d1f2b0c-8e8a-4d2a-8665-508d04976f84</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8">https://learn.microsoft.com/ko-kr/openspecs/windows_protocols/ms-apds/a00d0b83-97e3-44ad-ba2d-1221d4f51a35#gt_26456104-0afb-4afe-a92e-ac160a9efdf8</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos">https://learn.microsoft.com/ko-kr/windows-server/security/credentials-protection-and-management/authentication-policies-and-authentication-policy-silos</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/">https://blog.sunggwanchoi.com/kor-keobeoroseuting-kerberoasting/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.hackthebox.com/blog/as-rep-roasting-detection">https://www.hackthebox.com/blog/as-rep-roasting-detection</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/">https://www.microsoft.com/en-us/security/blog/2024/10/11/microsofts-guidance-to-help-mitigate-kerberoasting/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html">https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://syfuhs.net/a-bit-about-kerberos">https://syfuhs.net/a-bit-about-kerberos</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf">https://i.blackhat.com/EU-22/Thursday-Briefings/EU-22-Tervoort-Breaking-Kerberos-RC4-Cipher-and-Spoofing-Windows-PACs-wp.pdf</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.thehacker.recipes/ad/movement/kerberos/">https://www.thehacker.recipes/ad/movement/kerberos/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.hackndo.com/kerberos-silver-golden-tickets/">https://en.hackndo.com/kerberos-silver-golden-tickets/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/">https://www.netspi.com/blog/technical-blog/network-pentesting/cve-2020-17049-kerberos-bronze-bit-theory/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/3bff5864-8135-400e-bdd9-33b552051d94</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview">https://learn.microsoft.com/en-us/windows-server/security/kerberos/kerberos-constrained-delegation-overview</a></p>
</li>
<li><p><a href="https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/">https://hackyboiz.github.io/2020/12/11/l0ch/2020-12-11/</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926">https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926</a></p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639">https://www.zerodayinitiative.com/blog/2025/3/3/cve-2024-43639</a></p>
</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/mungsul/">mungsul</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/Authentication/">Authentication</a>
                  
                  <a class="hover-with-bg" href="/tags/Kerberos/">Kerberos</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_mungsul.jpg" srcset="/img/loading.gif" alt="mungsul">
                  </div>

                  <div class="link-text">
                    <div class="link-title">mungsul</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/mungsul">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/04/23/ogu123/cve-2025-27158/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-27158: Adobe Acrobat Reader Uninitialized Pointer  RCE </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/04/21/mungsul/NTLM_Part2/en/">
                    <span class="hidden-mobile">[Research] Windows Authentication Series (Part2. Kerberos)(EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/04/21/mungsul/NTLM_Part2/ko/';
        this.page.identifier = '/2025/04/21/mungsul/NTLM_Part2/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Windows Authentication Series (Part2. Kerberos)(KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
