

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Prologue&#34;&gt;&lt;a href=&#34;#Prologue&#34; class=&#34;headerlink&#34; title=&#34;Prologue&#34;&gt;&lt;/a&gt;Prologue&lt;/h2&gt;&lt;p&gt; &amp;#xC9C1;&amp;#xC7A5;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC18C;&amp;#xC911;&amp;#xD55C; &amp;#xC8FC;&amp;#xB9D0;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC694;&amp;#xC998;&amp;#xC5D0; CTF&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E0; SQL injection &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC654;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xC2DD;&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB0B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Libreria&#34;&gt;&lt;a href=&#34;#Libreria&#34; class=&#34;headerlink&#34; title=&#34;Libreria&#34;&gt;&lt;/a&gt;Libreria&lt;/h2&gt;&lt;h3 id=&#34;Description&#34;&gt;&lt;a href=&#34;#Description&#34; class=&#34;headerlink&#34; title=&#34;Description&#34;&gt;&lt;/a&gt;Description&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs markdown&#34;&gt;Welcome to Hacker&amp;apos;s Libreria! 

http://libreria.sstf.site 

If you feel hard to solve this challenge, please check out Web tutorials. 

Download: Libreria.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xB144; &amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xC6F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xACAC;&amp;#xC774; &amp;#xC8FC;&amp;#xB958;&amp;#xAC00; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC774; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Audit&#34;&gt;&lt;a href=&#34;#Audit&#34; class=&#34;headerlink&#34; title=&#34;Audit&#34;&gt;&lt;/a&gt;Audit&lt;/h3&gt;&lt;p&gt; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; PHP &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC81C;&amp;#xC77C; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;pg_*&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; DBMS&amp;#xAC00; PostgreSQL&amp;#xB77C;&amp;#xB294; &amp;#xAC78; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC774; &amp;#xCFFC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC785;&amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; index.php &amp;#xB0B4;&amp;#xC5D0; title&amp;#xB85C; &amp;#xAC80;&amp;#xC0C9;, rest.php&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; isbn&amp;#xC73C;&amp;#xB85C; &amp;#xAC80;&amp;#xC0C9;&amp;#xACFC; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC138; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xADF8;&amp;#xC911; &amp;#xD63C;&amp;#xC790;&amp;#xB9CC; prepared statement&amp;#xB97C; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC218;&amp;#xC0C1;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;(&amp;#xC6F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xC77C; &amp;#xB54C;&amp;#xAC00; &amp;#xAF64; &amp;#xC788;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xBB3C;&amp;#xB860; &amp;#xC694;&amp;#xC998;&amp;#xCC98;&amp;#xB7FC; 1day&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB9CE;&amp;#xC744; &amp;#xB550; &amp;#xC598;&amp;#xAE30;&amp;#xAC00; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.)&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs php&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:32~49&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;requestbook&amp;apos;&lt;/span&gt;:
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ((&lt;span class=&#34;hljs-keyword&#34;&gt;isset&lt;/span&gt;($_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;]) &amp;amp;&amp;amp; strlen($_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;]) &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;)) {
        $res = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;{&amp;quot;res&amp;quot;: &amp;quot;Sorry, but our budget is not enough to buy &amp;lt;a href=\&amp;apos;https://isbnsearch.org/isbn/&amp;apos;&lt;/span&gt;.$_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\&amp;apos;&amp;gt;this book&amp;lt;/a&amp;gt;.&amp;quot;}&amp;apos;&lt;/span&gt;;
        $db = dbconnect();
        $result = pg_query($db, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;SELECT ISBN FROM books WHERE isbn=&amp;apos;&amp;quot;&lt;/span&gt;.$_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;apos;&amp;quot;&lt;/span&gt;);
        pg_close($db);
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($result) {
            $rows = pg_fetch_assoc($result);
            &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($rows) {
                $isbn = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)$rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;];
                &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (($isbn &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;1000000000&lt;/span&gt;) &amp;amp;&amp;amp; ((&lt;span class=&#34;hljs-keyword&#34;&gt;string&lt;/span&gt;)$isbn === $rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;]))
                {
                    $res = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;{&amp;quot;res&amp;quot;: &amp;quot;We already have this book(&amp;apos;&lt;/span&gt;.$rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;).&amp;quot;}&amp;apos;&lt;/span&gt;;
                }
            }
        }
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;&lt;br&gt; &amp;#xC704;&amp;#xB294; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD; &amp;#xC2DC; &amp;#xC774;&amp;#xBBF8; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; ISBN &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC7A0;&amp;#xAE50; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC6D0;&amp;#xB798;&amp;#xB294; 10&amp;#xC790;&amp;#xB9AC;&amp;#xB97C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC804;&amp;#xC790;&amp;#xCC45;&amp;#xC758; &amp;#xB4F1;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xD310;&amp;#xB7C9;&amp;#xC774; &amp;#xAE09;&amp;#xC99D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; 13&amp;#xC790;&amp;#xB9AC; ISBN&amp;#xC774; &amp;#xADDC;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBE44;&amp;#xD558;&amp;#xC778;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;&amp;gt;=10&lt;/code&gt;&amp;#xC774; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC548; &amp;#xAC00;&amp;#xB294; &amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB77C;&amp;#xBA74; &amp;#xAE30;&amp;#xBCF8;&amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xB450;&amp;#xACE0; db&amp;#xB098; env&amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD588;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;br&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC88B;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. payload&amp;#xB97C; &amp;#xB354; &amp;#xAE38;&amp;#xAC8C; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC8C; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;br&gt;&lt;code&gt;SELECT ISBN FROM books WHERE isbn=&amp;apos;{&amp;#xC785;&amp;#xB825;&amp;#xAC12;}&amp;apos;&lt;/code&gt; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD0F;&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; int&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD588;&amp;#xC744; &amp;#xB54C; 1_000_000_000 &amp;#xC774;&amp;#xC0C1;&amp;#xC774;&amp;#xACE0; int &amp;#xBCC0;&amp;#xD658; &amp;#xC804;&amp;#xC758; &amp;#xAC12;&amp;#xACFC; &amp;#xBCC0;&amp;#xD658; &amp;#xD6C4; &amp;#xAC12;&amp;#xC774; &amp;#xAC19;&amp;#xC73C;&amp;#xBA74; (&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xB9DE;&amp;#xC73C;&amp;#xBA74;) &amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; sanitizing&amp;#xC774; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC88B;&amp;#xC744; &amp;#xC21C; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D4; &amp;#xD2B9;&amp;#xC774;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs php&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:10~12&lt;/span&gt;
$resp_time = &lt;span class=&#34;hljs-number&#34;&gt;3.0&lt;/span&gt;;

$start = microtime(&lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:54~58&lt;/span&gt;
$now = microtime(&lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt;);

&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($now - $start &amp;lt; $resp_time) {
	usleep((&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)(($resp_time + $start - $now) * &lt;span class=&#34;hljs-number&#34;&gt;1000000&lt;/span&gt;));
}&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xBC1B;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; 3&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB9AC;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/response_time_exceed_3s.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC740; &amp;#xB3D9;&amp;#xC2DC; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC801;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9E8; &amp;#xC55E;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC; 10&amp;#xC790;&amp;#xB9AC; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC22B;&amp;#xC790;&amp;#xC774;&amp;#xBA74; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC900;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; PostgreSQL &amp;#xB0B4;&amp;#xBD80; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;bytes_to_long&lt;/code&gt;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0; union select&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; leak&amp;#xD558;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;(&amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBA40;&amp;#xD2F0;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD55C; &amp;#xAE00;&amp;#xC790;&amp;#xC529; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCEE4;&amp;#xBC84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC591;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;bytes_to_long &amp;#xAD6C;&amp;#xD604;&lt;ol&gt;
&lt;li&gt;string to string token(8byte split)&lt;br&gt; hex to bigint&amp;#xC5D0;&amp;#xC11C; 8byte &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xD544;&amp;#xC694;&amp;#xD55C; step&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. substring&amp;#xACFC; generate_series &amp;#xD568;&amp;#xC218; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; with &amp;#xC808;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; leak&amp;#xD560; &amp;#xB54C; &amp;#xC8FC;&amp;#xB85C; string_agg&amp;#xB85C; concat&amp;#xD6C4; &amp;#xAE01;&amp;#xAE30;&amp;#xC5D0; string_agg&amp;#xB97C; &amp;#xCEEC;&amp;#xB7FC; &amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;string to hex&lt;br&gt; &amp;#xCC98;&amp;#xC74C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xB54C;&amp;#xB294; regexp_split_to_array &amp;#xC640; unnest&amp;#xB97C; &amp;#xC5EE;&amp;#xC5B4;&amp;#xC11C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &lt;code&gt;encode(col_name::bytea, &amp;apos;hex&amp;apos;)&lt;/code&gt; &amp;#xC774;&amp;#xB7F0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;hex to bigint&lt;br&gt; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; PostgreSQL&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD615; &amp;#xBCC0;&amp;#xD658;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. bigint(int8)&amp;#xB3C4; 8byte &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; decimal&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xC120; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;concat(&amp;apos;x&amp;apos;,encode(substring::bytea, &amp;apos;hex&amp;apos;))::bit(64)::bigint&lt;/code&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;leak&lt;br&gt;  db&amp;#xC5D0; flag&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC804;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xBA85;, &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xBA85;, &amp;#xCEEC;&amp;#xB7FC; &amp;#xBA85;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; pg_database&amp;#xC640; information_schema&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xADF8; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC720;&amp;#xD2F8; &amp;#xD568;&amp;#xC218;&amp;#xB85C; long_to_bytes, extract_int&amp;#xB4F1;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xB193;&amp;#xC740; &amp;#xCD5C;&amp;#xC885; PoC&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xD55C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; leak&amp;#xD558;&amp;#xB294;&amp;#xB370; 4&amp;#xCD08;&amp;#xC529;&amp;#xC774;&amp;#xBA74; &amp;#xCDA9;&amp;#xBD84;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;PoC&#34;&gt;&lt;a href=&#34;#PoC&#34; class=&#34;headerlink&#34; title=&#34;PoC&#34;&gt;&lt;/a&gt;PoC&lt;/h3&gt;&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xBB38;&amp;#xC81C; gist &amp;#xCC38;&amp;#xACE0;&lt;/p&gt;
&lt;h2 id=&#34;Libreria-Pro&#34;&gt;&lt;a href=&#34;#Libreria-Pro&#34; class=&#34;headerlink&#34; title=&#34;Libreria Pro&#34;&gt;&lt;/a&gt;Libreria Pro&lt;/h2&gt;&lt;h3 id=&#34;Description-1&#34;&gt;&lt;a href=&#34;#Description-1&#34; class=&#34;headerlink&#34; title=&#34;Description&#34;&gt;&lt;/a&gt;Description&lt;/h3&gt;&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; Pro &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC548;&amp;#xC8FC;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;Audit-1&#34;&gt;&lt;a href=&#34;#Audit-1&#34; class=&#34;headerlink&#34; title=&#34;Audit&#34;&gt;&lt;/a&gt;Audit&lt;/h3&gt;&lt;p&gt;&amp;#xC55E; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; classic&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC6B0;&amp;#xC120; &lt;code&gt;/robots.txt&lt;/code&gt; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xC6EC;&amp;#xAC78; Django 404 Page&amp;#xB97C; &amp;#xC751;&amp;#xB2F5;&amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/error_page_give_info.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB85C; Django&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; Debug&amp;#xBAA8;&amp;#xB4DC;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xC77C;&amp;#xBD80;&amp;#xB7EC; &amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xB0B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/request_info.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC45; &amp;#xAC80;&amp;#xC0C9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC120; &amp;#xC800; 3&amp;#xAC1C;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. PostgreSQL&amp;#xB294; type&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &lt;code&gt;search_with&lt;/code&gt;&amp;#xB97C; int&amp;#xD615;&amp;#xC744; &amp;#xC4F8; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; year&amp;#xB610;&amp;#xB294; month&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &lt;code&gt;key&lt;/code&gt;&amp;#xB97C; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC918;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/raise_error_using_type_mismatch.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Error&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xB294; Django&amp;#xC758; &amp;#xBC84;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Traceback&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xBCF4;&amp;#xBA74; ORM&amp;#xC744; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &lt;a href=&#34;https://docs.djangoproject.com/en/4.2/ref/models/database-functions/#extract&#34;&gt;Extract&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; datetime&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBF51;&amp;#xC544; &amp;#xBE44;&amp;#xAD50;&amp;#xC870;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/leak_code.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Django &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xC73C;&amp;#xB2C8; cve&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB2C8; Extract&amp;#xB098; Trunc &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; SQL injection&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&lt;a href=&#34;https://www.cve.org/CVERecord?id=CVE-2022-34265&#34;&gt;CVE-2022-34265&lt;/a&gt;)&lt;br&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; Django 4.0.5&amp;#xC758; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA70; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ORM &amp;#xB3D9;&amp;#xC791; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C; Extract&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/models/functions/datetime.py#L41-L75&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Extract&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;TimezoneMixin, Transform&lt;/span&gt;):&lt;/span&gt;
    ...
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;__init__&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, expression, lookup_name=None, tzinfo=None, **extra&lt;/span&gt;):&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; self.lookup_name &lt;span class=&#34;hljs-keyword&#34;&gt;is&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;:
            self.lookup_name = lookup_name
        ...
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;as_sql&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, compiler, connection&lt;/span&gt;):&lt;/span&gt;
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; isinstance(lhs_output_field, DateField):
            sql = connection.ops.date_extract_sql(self.lookup_name, sql)
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; sql, params

&lt;span class=&#34;hljs-comment&#34;&gt;# https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/backends/postgresql/operations.py#L49-L59&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;date_extract_sql&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, lookup_type, field_name&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-comment&#34;&gt;# https://www.postgresql.org/docs/current/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;week_day&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-comment&#34;&gt;# For consistency across backends, we return Sunday=1, Saturday=7.&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;dow&amp;apos; FROM %s) + 1&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;iso_week_day&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;isodow&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;iso_year&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;isoyear&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;%s&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % (lookup_type, field_name)&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&lt;code&gt;Extract(&amp;apos;pubdate&amp;apos;, {search_with})&lt;/code&gt; &amp;#xB294; &lt;code&gt;EXTRACT(&amp;apos;{search_with}&amp;apos; FROM {field_name})&lt;/code&gt;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; SQL query&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;%&lt;/code&gt; operator&amp;#xB294; quote&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; escape &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; sql injection&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;Exploit&amp;#xC740; EXTRACT &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC644;&amp;#xC131; &amp;#xD6C4; &amp;#xC774;&amp;#xC804; &amp;#xBB38;&amp;#xC81C;&amp;#xC640; &amp;#xAC19;&amp;#xC774; union select&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; data leak&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;PoC-1&#34;&gt;&lt;a href=&#34;#PoC-1&#34; class=&#34;headerlink&#34; title=&#34;PoC&#34;&gt;&lt;/a&gt;PoC&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://gist.github.com/l0vey0u/055f1abd080c1c26d51fd5b373f5d13a&#34;&gt;PoC Gist&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Epilogue&#34;&gt;&lt;a href=&#34;#Epilogue&#34; class=&#34;headerlink&#34; title=&#34;Epilogue&#34;&gt;&lt;/a&gt;Epilogue&lt;/h2&gt;&lt;p&gt; &amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD560; &amp;#xB54C; ORM&amp;#xC744; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xBD84;&amp;#xBA85; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0; &amp;#xACC4;&amp;#xC18D; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; exploit&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC7AC;&amp;#xBC0C;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Write-Up] SSTF : libreria &amp; libreria pro - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Prologue&#34;&gt;&lt;a href=&#34;#Prologue&#34; class=&#34;headerlink&#34; title=&#34;Prologue&#34;&gt;&lt;/a&gt;Prologue&lt;/h2&gt;&lt;p&gt; &amp;#xC9C1;&amp;#xC7A5;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC18C;&amp;#xC911;&amp;#xD55C; &amp;#xC8FC;&amp;#xB9D0;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC694;&amp;#xC998;&amp;#xC5D0; CTF&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E0; SQL injection &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC654;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xC2DD;&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xB0B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Libreria&#34;&gt;&lt;a href=&#34;#Libreria&#34; class=&#34;headerlink&#34; title=&#34;Libreria&#34;&gt;&lt;/a&gt;Libreria&lt;/h2&gt;&lt;h3 id=&#34;Description&#34;&gt;&lt;a href=&#34;#Description&#34; class=&#34;headerlink&#34; title=&#34;Description&#34;&gt;&lt;/a&gt;Description&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs markdown&#34;&gt;Welcome to Hacker&amp;apos;s Libreria! 

http://libreria.sstf.site 

If you feel hard to solve this challenge, please check out Web tutorials. 

Download: Libreria.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA87; &amp;#xB144; &amp;#xC804;&amp;#xBD80;&amp;#xD130; &amp;#xC6F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xD5A5;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xACAC;&amp;#xC774; &amp;#xC8FC;&amp;#xB958;&amp;#xAC00; &amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xBD88;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC8C;&amp;#xC2F1;&amp;#xC774; &amp;#xC904;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Audit&#34;&gt;&lt;a href=&#34;#Audit&#34; class=&#34;headerlink&#34; title=&#34;Audit&#34;&gt;&lt;/a&gt;Audit&lt;/h3&gt;&lt;p&gt; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; PHP &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC81C;&amp;#xC77C; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;pg_*&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; DBMS&amp;#xAC00; PostgreSQL&amp;#xB77C;&amp;#xB294; &amp;#xAC78; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC774; &amp;#xCFFC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC785;&amp;#xB418;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; index.php &amp;#xB0B4;&amp;#xC5D0; title&amp;#xB85C; &amp;#xAC80;&amp;#xC0C9;, rest.php&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; isbn&amp;#xC73C;&amp;#xB85C; &amp;#xAC80;&amp;#xC0C9;&amp;#xACFC; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC138; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xADF8;&amp;#xC911; &amp;#xD63C;&amp;#xC790;&amp;#xB9CC; prepared statement&amp;#xB97C; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC218;&amp;#xC0C1;&amp;#xD574; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;(&amp;#xC6F9; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC5B4;&amp;#xC0C9;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xACF5;&amp;#xACA9; &amp;#xBCA1;&amp;#xD130;&amp;#xC77C; &amp;#xB54C;&amp;#xAC00; &amp;#xAF64; &amp;#xC788;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xBB3C;&amp;#xB860; &amp;#xC694;&amp;#xC998;&amp;#xCC98;&amp;#xB7FC; 1day&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB9CE;&amp;#xC744; &amp;#xB550; &amp;#xC598;&amp;#xAE30;&amp;#xAC00; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.)&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs php&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:32~49&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;case&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;requestbook&amp;apos;&lt;/span&gt;:
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ((&lt;span class=&#34;hljs-keyword&#34;&gt;isset&lt;/span&gt;($_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;]) &amp;amp;&amp;amp; strlen($_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;]) &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt;)) {
        $res = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;{&amp;quot;res&amp;quot;: &amp;quot;Sorry, but our budget is not enough to buy &amp;lt;a href=\&amp;apos;https://isbnsearch.org/isbn/&amp;apos;&lt;/span&gt;.$_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;\&amp;apos;&amp;gt;this book&amp;lt;/a&amp;gt;.&amp;quot;}&amp;apos;&lt;/span&gt;;
        $db = dbconnect();
        $result = pg_query($db, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;SELECT ISBN FROM books WHERE isbn=&amp;apos;&amp;quot;&lt;/span&gt;.$_GET[&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;isbn&amp;apos;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;apos;&amp;quot;&lt;/span&gt;);
        pg_close($db);
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($result) {
            $rows = pg_fetch_assoc($result);
            &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($rows) {
                $isbn = (&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)$rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;];
                &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (($isbn &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;1000000000&lt;/span&gt;) &amp;amp;&amp;amp; ((&lt;span class=&#34;hljs-keyword&#34;&gt;string&lt;/span&gt;)$isbn === $rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;]))
                {
                    $res = &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;{&amp;quot;res&amp;quot;: &amp;quot;We already have this book(&amp;apos;&lt;/span&gt;.$rows[&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;isbn&amp;quot;&lt;/span&gt;].&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;).&amp;quot;}&amp;apos;&lt;/span&gt;;
                }
            }
        }
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;&lt;br&gt; &amp;#xC704;&amp;#xB294; &amp;#xCC45; &amp;#xAD6C;&amp;#xB9E4; &amp;#xC694;&amp;#xCCAD; &amp;#xC2DC; &amp;#xC774;&amp;#xBBF8; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xBA74;&amp;#xC11C; ISBN &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC7A0;&amp;#xAE50; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC6D0;&amp;#xB798;&amp;#xB294; 10&amp;#xC790;&amp;#xB9AC;&amp;#xB97C; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC804;&amp;#xC790;&amp;#xCC45;&amp;#xC758; &amp;#xB4F1;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xD310;&amp;#xB7C9;&amp;#xC774; &amp;#xAE09;&amp;#xC99D;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; 13&amp;#xC790;&amp;#xB9AC; ISBN&amp;#xC774; &amp;#xADDC;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xBE44;&amp;#xD558;&amp;#xC778;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;&amp;gt;=10&lt;/code&gt;&amp;#xC774; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xC548; &amp;#xAC00;&amp;#xB294; &amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB77C;&amp;#xBA74; &amp;#xAE30;&amp;#xBCF8;&amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD574;&amp;#xB450;&amp;#xACE0; db&amp;#xB098; env&amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFC0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD588;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;br&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xC740; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC785;&amp;#xC7A5;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC88B;&amp;#xC740; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. payload&amp;#xB97C; &amp;#xB354; &amp;#xAE38;&amp;#xAC8C; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC74; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC8C; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;br&gt;&lt;code&gt;SELECT ISBN FROM books WHERE isbn=&amp;apos;{&amp;#xC785;&amp;#xB825;&amp;#xAC12;}&amp;apos;&lt;/code&gt; &amp;#xCFFC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xACB0;&amp;#xAD0F;&amp;#xAC12;&amp;#xC774; &amp;#xC788;&amp;#xACE0; &amp;#xADF8; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; int&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xD588;&amp;#xC744; &amp;#xB54C; 1_000_000_000 &amp;#xC774;&amp;#xC0C1;&amp;#xC774;&amp;#xACE0; int &amp;#xBCC0;&amp;#xD658; &amp;#xC804;&amp;#xC758; &amp;#xAC12;&amp;#xACFC; &amp;#xBCC0;&amp;#xD658; &amp;#xD6C4; &amp;#xAC12;&amp;#xC774; &amp;#xAC19;&amp;#xC73C;&amp;#xBA74; (&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xB9DE;&amp;#xC73C;&amp;#xBA74;) &amp;#xADF8; &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; sanitizing&amp;#xC774; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xBCF4;&amp;#xB2E4; &amp;#xC88B;&amp;#xC744; &amp;#xC21C; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D4; &amp;#xD2B9;&amp;#xC774;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs php&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:10~12&lt;/span&gt;
$resp_time = &lt;span class=&#34;hljs-number&#34;&gt;3.0&lt;/span&gt;;

$start = microtime(&lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;#rest.php:54~58&lt;/span&gt;
$now = microtime(&lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt;);

&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ($now - $start &amp;lt; $resp_time) {
	usleep((&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt;)(($resp_time + $start - $now) * &lt;span class=&#34;hljs-number&#34;&gt;1000000&lt;/span&gt;));
}&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xBC1B;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; 3&amp;#xCD08; &amp;#xC774;&amp;#xC0C1; &amp;#xAC78;&amp;#xB9AC;&amp;#xAC8C; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/response_time_exceed_3s.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC740; &amp;#xB3D9;&amp;#xC2DC; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xB9CC;&amp;#xB4E0; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC801;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9E8; &amp;#xC55E;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC; 10&amp;#xC790;&amp;#xB9AC; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xC22B;&amp;#xC790;&amp;#xC774;&amp;#xBA74; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC900;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; PostgreSQL &amp;#xB0B4;&amp;#xBD80; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &lt;code&gt;bytes_to_long&lt;/code&gt;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD558;&amp;#xACE0; union select&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; leak&amp;#xD558;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;(&amp;#xD574;&amp;#xB2F9; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBA40;&amp;#xD2F0;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xD55C; &amp;#xAE00;&amp;#xC790;&amp;#xC529; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xCEE4;&amp;#xBC84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC591;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC600;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;bytes_to_long &amp;#xAD6C;&amp;#xD604;&lt;ol&gt;
&lt;li&gt;string to string token(8byte split)&lt;br&gt; hex to bigint&amp;#xC5D0;&amp;#xC11C; 8byte &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC788;&amp;#xC5B4; &amp;#xD544;&amp;#xC694;&amp;#xD55C; step&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. substring&amp;#xACFC; generate_series &amp;#xD568;&amp;#xC218; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; with &amp;#xC808;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; leak&amp;#xD560; &amp;#xB54C; &amp;#xC8FC;&amp;#xB85C; string_agg&amp;#xB85C; concat&amp;#xD6C4; &amp;#xAE01;&amp;#xAE30;&amp;#xC5D0; string_agg&amp;#xB97C; &amp;#xCEEC;&amp;#xB7FC; &amp;#xBA85;&amp;#xC73C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;string to hex&lt;br&gt; &amp;#xCC98;&amp;#xC74C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xB54C;&amp;#xB294; regexp_split_to_array &amp;#xC640; unnest&amp;#xB97C; &amp;#xC5EE;&amp;#xC5B4;&amp;#xC11C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB098; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &lt;code&gt;encode(col_name::bytea, &amp;apos;hex&amp;apos;)&lt;/code&gt; &amp;#xC774;&amp;#xB7F0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;hex to bigint&lt;br&gt; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; PostgreSQL&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD615; &amp;#xBCC0;&amp;#xD658;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. bigint(int8)&amp;#xB3C4; 8byte &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; decimal&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;&amp;#xC120; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;concat(&amp;apos;x&amp;apos;,encode(substring::bytea, &amp;apos;hex&amp;apos;))::bit(64)::bigint&lt;/code&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;leak&lt;br&gt;  db&amp;#xC5D0; flag&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC804;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xBA85;, &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xBA85;, &amp;#xCEEC;&amp;#xB7FC; &amp;#xBA85;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; pg_database&amp;#xC640; information_schema&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC870;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xADF8; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC720;&amp;#xD2F8; &amp;#xD568;&amp;#xC218;&amp;#xB85C; long_to_bytes, extract_int&amp;#xB4F1;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xB193;&amp;#xC740; &amp;#xCD5C;&amp;#xC885; PoC&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC544;&amp;#xC11C; &amp;#xD55C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; leak&amp;#xD558;&amp;#xB294;&amp;#xB370; 4&amp;#xCD08;&amp;#xC529;&amp;#xC774;&amp;#xBA74; &amp;#xCDA9;&amp;#xBD84;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;PoC&#34;&gt;&lt;a href=&#34;#PoC&#34; class=&#34;headerlink&#34; title=&#34;PoC&#34;&gt;&lt;/a&gt;PoC&lt;/h3&gt;&lt;p&gt;&amp;#xC544;&amp;#xB798; &amp;#xBB38;&amp;#xC81C; gist &amp;#xCC38;&amp;#xACE0;&lt;/p&gt;
&lt;h2 id=&#34;Libreria-Pro&#34;&gt;&lt;a href=&#34;#Libreria-Pro&#34; class=&#34;headerlink&#34; title=&#34;Libreria Pro&#34;&gt;&lt;/a&gt;Libreria Pro&lt;/h2&gt;&lt;h3 id=&#34;Description-1&#34;&gt;&lt;a href=&#34;#Description-1&#34; class=&#34;headerlink&#34; title=&#34;Description&#34;&gt;&lt;/a&gt;Description&lt;/h3&gt;&lt;p&gt;&amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; Pro &amp;#xBB38;&amp;#xC81C;&amp;#xB77C;&amp;#xACE0; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC548;&amp;#xC8FC;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;h3 id=&#34;Audit-1&#34;&gt;&lt;a href=&#34;#Audit-1&#34; class=&#34;headerlink&#34; title=&#34;Audit&#34;&gt;&lt;/a&gt;Audit&lt;/h3&gt;&lt;p&gt;&amp;#xC55E; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; classic&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC6B0;&amp;#xC120; &lt;code&gt;/robots.txt&lt;/code&gt; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC8C; &amp;#xC6EC;&amp;#xAC78; Django 404 Page&amp;#xB97C; &amp;#xC751;&amp;#xB2F5;&amp;#xBC1B;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/error_page_give_info.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xB85C; Django&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; Debug&amp;#xBAA8;&amp;#xB4DC;&amp;#xAC00; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xB824;&amp;#xACE0; &amp;#xC77C;&amp;#xBD80;&amp;#xB7EC; &amp;#xC5D0;&amp;#xB7EC;&amp;#xB97C; &amp;#xB0B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/request_info.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC45; &amp;#xAC80;&amp;#xC0C9; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC120; &amp;#xC800; 3&amp;#xAC1C;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. PostgreSQL&amp;#xB294; type&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &lt;code&gt;search_with&lt;/code&gt;&amp;#xB97C; int&amp;#xD615;&amp;#xC744; &amp;#xC4F8; &amp;#xAC83; &amp;#xAC19;&amp;#xC740; year&amp;#xB610;&amp;#xB294; month&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0; &lt;code&gt;key&lt;/code&gt;&amp;#xB97C; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC918;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/raise_error_using_type_mismatch.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xD55C; &amp;#xB300;&amp;#xB85C; Error&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xB294; Django&amp;#xC758; &amp;#xBC84;&amp;#xC804; &amp;#xC815;&amp;#xBCF4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD68D;&amp;#xB4DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; Traceback&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xBCF4;&amp;#xBA74; ORM&amp;#xC744; &amp;#xC4F0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &lt;a href=&#34;https://docs.djangoproject.com/en/4.2/ref/models/database-functions/#extract&#34;&gt;Extract&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; datetime&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBF51;&amp;#xC544; &amp;#xBE44;&amp;#xAD50;&amp;#xC870;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2023/09/01/syru/sstf-web-libreria/leak_code.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Django &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xC73C;&amp;#xB2C8; cve&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB2C8; Extract&amp;#xB098; Trunc &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; SQL injection&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&lt;a href=&#34;https://www.cve.org/CVERecord?id=CVE-2022-34265&#34;&gt;CVE-2022-34265&lt;/a&gt;)&lt;br&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; Django 4.0.5&amp;#xC758; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA70; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ORM &amp;#xB3D9;&amp;#xC791; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC804;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xB294; &amp;#xC5C6;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C; Extract&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/models/functions/datetime.py#L41-L75&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;class&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Extract&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;TimezoneMixin, Transform&lt;/span&gt;):&lt;/span&gt;
    ...
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;__init__&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, expression, lookup_name=None, tzinfo=None, **extra&lt;/span&gt;):&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; self.lookup_name &lt;span class=&#34;hljs-keyword&#34;&gt;is&lt;/span&gt; &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;:
            self.lookup_name = lookup_name
        ...
    &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;as_sql&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, compiler, connection&lt;/span&gt;):&lt;/span&gt;
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; isinstance(lhs_output_field, DateField):
            sql = connection.ops.date_extract_sql(self.lookup_name, sql)
        ...
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; sql, params

&lt;span class=&#34;hljs-comment&#34;&gt;# https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/backends/postgresql/operations.py#L49-L59&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;date_extract_sql&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;self, lookup_type, field_name&lt;/span&gt;):&lt;/span&gt;
    &lt;span class=&#34;hljs-comment&#34;&gt;# https://www.postgresql.org/docs/current/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;week_day&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-comment&#34;&gt;# For consistency across backends, we return Sunday=1, Saturday=7.&lt;/span&gt;
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;dow&amp;apos; FROM %s) + 1&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;iso_week_day&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;isodow&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;elif&lt;/span&gt; lookup_type == &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;iso_year&amp;quot;&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;isoyear&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % field_name
    &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt;:
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;EXTRACT(&amp;apos;%s&amp;apos; FROM %s)&amp;quot;&lt;/span&gt; % (lookup_type, field_name)&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&lt;code&gt;Extract(&amp;apos;pubdate&amp;apos;, {search_with})&lt;/code&gt; &amp;#xB294; &lt;code&gt;EXTRACT(&amp;apos;{search_with}&amp;apos; FROM {field_name})&lt;/code&gt;&amp;#xC758; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; SQL query&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xB418;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &lt;code&gt;%&lt;/code&gt; operator&amp;#xB294; quote&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; escape &amp;#xC808;&amp;#xCC28;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC5D0; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; sql injection&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;Exploit&amp;#xC740; EXTRACT &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC644;&amp;#xC131; &amp;#xD6C4; &amp;#xC774;&amp;#xC804; &amp;#xBB38;&amp;#xC81C;&amp;#xC640; &amp;#xAC19;&amp;#xC774; union select&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; data leak&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;PoC-1&#34;&gt;&lt;a href=&#34;#PoC-1&#34; class=&#34;headerlink&#34; title=&#34;PoC&#34;&gt;&lt;/a&gt;PoC&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://gist.github.com/l0vey0u/055f1abd080c1c26d51fd5b373f5d13a&#34;&gt;PoC Gist&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Epilogue&#34;&gt;&lt;a href=&#34;#Epilogue&#34; class=&#34;headerlink&#34; title=&#34;Epilogue&#34;&gt;&lt;/a&gt;Epilogue&lt;/h2&gt;&lt;p&gt; &amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD560; &amp;#xB54C; ORM&amp;#xC744; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xBD84;&amp;#xBA85; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0; &amp;#xACC4;&amp;#xC18D; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; exploit&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC7AC;&amp;#xBC0C;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="/img/default.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2023/09/01/syru/sstf-web-libreria/">

  <title>[Write-Up] SSTF : libreria &amp; libreria pro - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2023-09-01 20:00" pubdate>
      2023 9 1 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      40
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Write-Up] SSTF : libreria &amp; libreria pro</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h2 id="Prologue"><a href="#Prologue" class="headerlink" title="Prologue"></a>Prologue</h2><p> &#xC9C1;&#xC7A5;&#xC778;&#xC5D0;&#xAC8C; &#xC18C;&#xC911;&#xD55C; &#xC8FC;&#xB9D0;&#xC774;&#xC9C0;&#xB9CC; &#xC694;&#xC998;&#xC5D0; CTF&#xC5D0;&#xC11C; &#xBCF4;&#xAE30; &#xD798;&#xB4E0; SQL injection &#xBB38;&#xC81C;&#xAC00; &#xB098;&#xC654;&#xB2E4;&#xB294; &#xC18C;&#xC2DD;&#xC5D0; &#xC2DC;&#xAC04;&#xC744; &#xB0B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Libreria"><a href="#Libreria" class="headerlink" title="Libreria"></a>Libreria</h2><h3 id="Description"><a href="#Description" class="headerlink" title="Description"></a>Description</h3><pre><code class="hljs markdown">Welcome to Hacker&apos;s Libreria! 

http://libreria.sstf.site 

If you feel hard to solve this challenge, please check out Web tutorials. 

Download: Libreria.zip</code></pre>
<p>&#xBA87; &#xB144; &#xC804;&#xBD80;&#xD130; &#xC6F9; &#xBB38;&#xC81C;&#xB3C4; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xAC00; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xAC00;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC758;&#xACAC;&#xC774; &#xC8FC;&#xB958;&#xAC00; &#xB418;&#xBA74;&#xC11C; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xAC8C;&#xC2F1;&#xC774; &#xC904;&#xC5B4;&#xB4E4;&#xC5B4; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Audit"><a href="#Audit" class="headerlink" title="Audit"></a>Audit</h3><p> &#xC81C;&#xACF5;&#xB41C; PHP &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74; &#xC81C;&#xC77C; &#xBA3C;&#xC800; <code>pg_*</code>&#xD568;&#xC218;&#xB4E4;&#xB85C; DBMS&#xAC00; PostgreSQL&#xB77C;&#xB294; &#xAC78; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC785;&#xB825;&#xC774; &#xCFFC;&#xB9AC;&#xC5D0; &#xC8FC;&#xC785;&#xB418;&#xB294; &#xBD80;&#xBD84;&#xC740; index.php &#xB0B4;&#xC5D0; title&#xB85C; &#xAC80;&#xC0C9;, rest.php&#xC5D0; &#xAD6C;&#xD604;&#xB41C; isbn&#xC73C;&#xB85C; &#xAC80;&#xC0C9;&#xACFC; &#xCC45; &#xAD6C;&#xB9E4; &#xC694;&#xCCAD;&#xAE4C;&#xC9C0; &#xC138; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xB294;&#xB370;&#xC694;. &#xADF8;&#xC911; &#xD63C;&#xC790;&#xB9CC; prepared statement&#xB97C; &#xC4F0;&#xC9C0; &#xC54A;&#xB294; &#xCC45; &#xAD6C;&#xB9E4; &#xC694;&#xCCAD;&#xC774; &#xC218;&#xC0C1;&#xD574; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.<br>(&#xC6F9; &#xBB38;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xC5B4;&#xC0C9;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xB418;&#xC5B4;&#xC788;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xACF5;&#xACA9; &#xBCA1;&#xD130;&#xC77C; &#xB54C;&#xAC00; &#xAF64; &#xC788;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xBB3C;&#xB860; &#xC694;&#xC998;&#xCC98;&#xB7FC; 1day&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xB9CE;&#xC744; &#xB550; &#xC598;&#xAE30;&#xAC00; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.)<br><pre><code class="hljs php"><span class="hljs-comment">#rest.php:32~49</span>
<span class="hljs-keyword">case</span> <span class="hljs-string">&apos;requestbook&apos;</span>:
    <span class="hljs-keyword">if</span> ((<span class="hljs-keyword">isset</span>($_GET[<span class="hljs-string">&apos;isbn&apos;</span>]) &amp;&amp; strlen($_GET[<span class="hljs-string">&apos;isbn&apos;</span>]) &gt;= <span class="hljs-number">10</span>)) {
        $res = <span class="hljs-string">&apos;{&quot;res&quot;: &quot;Sorry, but our budget is not enough to buy &lt;a href=\&apos;https://isbnsearch.org/isbn/&apos;</span>.$_GET[<span class="hljs-string">&apos;isbn&apos;</span>].<span class="hljs-string">&apos;\&apos;&gt;this book&lt;/a&gt;.&quot;}&apos;</span>;
        $db = dbconnect();
        $result = pg_query($db, <span class="hljs-string">&quot;SELECT ISBN FROM books WHERE isbn=&apos;&quot;</span>.$_GET[<span class="hljs-string">&apos;isbn&apos;</span>].<span class="hljs-string">&quot;&apos;&quot;</span>);
        pg_close($db);
        <span class="hljs-keyword">if</span> ($result) {
            $rows = pg_fetch_assoc($result);
            <span class="hljs-keyword">if</span> ($rows) {
                $isbn = (<span class="hljs-keyword">int</span>)$rows[<span class="hljs-string">&quot;isbn&quot;</span>];
                <span class="hljs-keyword">if</span> (($isbn &gt;= <span class="hljs-number">1000000000</span>) &amp;&amp; ((<span class="hljs-keyword">string</span>)$isbn === $rows[<span class="hljs-string">&quot;isbn&quot;</span>]))
                {
                    $res = <span class="hljs-string">&apos;{&quot;res&quot;: &quot;We already have this book(&apos;</span>.$rows[<span class="hljs-string">&quot;isbn&quot;</span>].<span class="hljs-string">&apos;).&quot;}&apos;</span>;
                }
            }
        }
    }
    <span class="hljs-keyword">break</span>;</code></pre><br> &#xC704;&#xB294; &#xCC45; &#xAD6C;&#xB9E4; &#xC694;&#xCCAD; &#xC2DC; &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xC774; &#xAE00;&#xC744; &#xC4F0;&#xBA74;&#xC11C; ISBN &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD574; &#xC7A0;&#xAE50; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xB2C8; &#xC6D0;&#xB798;&#xB294; 10&#xC790;&#xB9AC;&#xB97C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD588;&#xB294;&#xB370; &#xC804;&#xC790;&#xCC45;&#xC758; &#xB4F1;&#xC7A5;&#xC73C;&#xB85C; &#xCD9C;&#xD310;&#xB7C9;&#xC774; &#xAE09;&#xC99D;&#xD558;&#xBA74;&#xC11C; 13&#xC790;&#xB9AC; ISBN&#xC774; &#xADDC;&#xACA9;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.<br>&#xC774;&#xB7F0; &#xBE44;&#xD558;&#xC778;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74; <code>&gt;=10</code>&#xC774; &#xC774;&#xD574;&#xAC00; &#xC548; &#xAC00;&#xB294; &#xAC74; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC800;&#xB77C;&#xBA74; &#xAE30;&#xBCF8;&#xAC12;&#xC744; &#xC124;&#xC815;&#xD574;&#xB450;&#xACE0; db&#xB098; env&#xB4F1;&#xC73C;&#xB85C; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xAC8C; &#xD588;&#xC744; &#xAC83; &#xAC19;&#xB124;&#xC694;.<br>&#xC9C0;&#xAE08;&#xC740; &#xACF5;&#xACA9;&#xC790;&#xC758; &#xC785;&#xC7A5;&#xC73C;&#xB85C; &#xBCF4;&#xACE0; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xB2F9;&#xC5F0;&#xD788; &#xC88B;&#xC740; &#xC0C1;&#xD669;&#xC785;&#xB2C8;&#xB2E4;. payload&#xB97C; &#xB354; &#xAE38;&#xAC8C; &#xC4F8; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC74; &#xD560; &#xC218; &#xC788;&#xB294; &#xAC8C; &#xB9CE;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;.<br><code>SELECT ISBN FROM books WHERE isbn=&apos;{&#xC785;&#xB825;&#xAC12;}&apos;</code> &#xCFFC;&#xB9AC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xACB0;&#xAD0F;&#xAC12;&#xC774; &#xC788;&#xACE0; &#xADF8; &#xACB0;&#xACFC;&#xB97C; int&#xB85C; &#xBCC0;&#xD658;&#xD588;&#xC744; &#xB54C; 1_000_000_000 &#xC774;&#xC0C1;&#xC774;&#xACE0; int &#xBCC0;&#xD658; &#xC804;&#xC758; &#xAC12;&#xACFC; &#xBCC0;&#xD658; &#xD6C4; &#xAC12;&#xC774; &#xAC19;&#xC73C;&#xBA74; (&#xC815;&#xC0C1;&#xC801;&#xC778; &#xC22B;&#xC790;&#xAC00; &#xB9DE;&#xC73C;&#xBA74;) &#xADF8; &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.<br>&#xC785;&#xB825;&#xAC12;&#xC5D0; &#xB300;&#xD55C; sanitizing&#xC774; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC5C6;&#xB2E4;&#xB294; &#xAC83;&#xC5D0;&#xC11C; &#xC774;&#xBCF4;&#xB2E4; &#xC88B;&#xC744; &#xC21C; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xC5D4; &#xD2B9;&#xC774;&#xC0AC;&#xD56D;&#xC774; &#xD558;&#xB098; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><pre><code class="hljs php"><span class="hljs-comment">#rest.php:10~12</span>
$resp_time = <span class="hljs-number">3.0</span>;

$start = microtime(<span class="hljs-literal">true</span>);
<span class="hljs-comment">#rest.php:54~58</span>
$now = microtime(<span class="hljs-literal">true</span>);

<span class="hljs-keyword">if</span> ($now - $start &lt; $resp_time) {
	usleep((<span class="hljs-keyword">int</span>)(($resp_time + $start - $now) * <span class="hljs-number">1000000</span>));
}</code></pre><br>&#xC5D0;&#xB7EC;&#xB97C; &#xC81C;&#xC678;&#xD55C; &#xBAA8;&#xB4E0; &#xC694;&#xCCAD;&#xC774; &#xC751;&#xB2F5;&#xC744; &#xBC1B;&#xAE30;&#xAE4C;&#xC9C0; 3&#xCD08; &#xC774;&#xC0C1; &#xAC78;&#xB9AC;&#xAC8C; &#xC124;&#xACC4;&#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="/2023/09/01/syru/sstf-web-libreria/response_time_exceed_3s.png" srcset="/img/loading.gif" alt></p>
<p>&#xC544;&#xB9C8; &#xB108;&#xBB34; &#xB9CE;&#xC740; &#xB3D9;&#xC2DC; &#xC694;&#xCCAD;&#xC774; &#xC11C;&#xBC84;&#xC5D0; &#xBD80;&#xD558;&#xB97C; &#xC904; &#xC218; &#xC788;&#xC5B4; &#xB9CC;&#xB4E0; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBD80;&#xBD84;&#xC744; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC120; &#xC694;&#xCCAD;&#xC744; &#xC801;&#xAC8C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9E8; &#xC55E;&#xC774; 0&#xC774; &#xC544;&#xB2CC; 10&#xC790;&#xB9AC; &#xC774;&#xC0C1;&#xC758; &#xC22B;&#xC790;&#xC774;&#xBA74; &#xCD9C;&#xB825;&#xD574;&#xC900;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xC5EC; PostgreSQL &#xB0B4;&#xBD80; &#xD568;&#xC218;&#xB85C; <code>bytes_to_long</code>&#xC744; &#xAD6C;&#xD604;&#xD558;&#xACE0; union select&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; leak&#xD558;&#xBA74; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.<br>(&#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xB294; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB2E8;&#xC21C;&#xD788; &#xD55C; &#xAE00;&#xC790;&#xC529; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C;&#xB3C4; &#xCEE4;&#xBC84;&#xD560; &#xC218; &#xC788;&#xB294; &#xC591;&#xC758; &#xB370;&#xC774;&#xD130;&#xC600;&#xC9C0;&#xB9CC; &#xC81C;&#xC57D;&#xC774; &#xC5C6;&#xB294; &#xC0C1;&#xD669;&#xC744; &#xCDA9;&#xBD84;&#xD788; &#xD65C;&#xC6A9;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.)</p>
<ul>
<li>bytes_to_long &#xAD6C;&#xD604;<ol>
<li>string to string token(8byte split)<br> hex to bigint&#xC5D0;&#xC11C; 8byte &#xC81C;&#xD55C;&#xC774; &#xC788;&#xC5B4; &#xD544;&#xC694;&#xD55C; step&#xC785;&#xB2C8;&#xB2E4;. substring&#xACFC; generate_series &#xD568;&#xC218; &#xADF8;&#xB9AC;&#xACE0; with &#xC808;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; leak&#xD560; &#xB54C; &#xC8FC;&#xB85C; string_agg&#xB85C; concat&#xD6C4; &#xAE01;&#xAE30;&#xC5D0; string_agg&#xB97C; &#xCEEC;&#xB7FC; &#xBA85;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>string to hex<br> &#xCC98;&#xC74C; &#xAD6C;&#xD604;&#xD560; &#xB54C;&#xB294; regexp_split_to_array &#xC640; unnest&#xB97C; &#xC5EE;&#xC5B4;&#xC11C; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xD574;&#xC57C; &#xD558;&#xB098; &#xBCF4;&#xACE0; &#xC788;&#xC5C8;&#xB294;&#xB370; <code>encode(col_name::bytea, &apos;hex&apos;)</code> &#xC774;&#xB7F0; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>hex to bigint<br> &#xC774;&#xAC83;&#xB3C4; PostgreSQL&#xAC00; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xD615; &#xBCC0;&#xD658;&#xC744; &#xD65C;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. bigint(int8)&#xB3C4; 8byte &#xC81C;&#xC57D;&#xC774; &#xC788;&#xC5B4;&#xC11C; decimal&#xC744; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xC5C8;&#xB098; &#xCC3E;&#xC544;&#xBD24;&#xB294;&#xB370; &#xC544;&#xC27D;&#xAC8C;&#xB3C4; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xD568;&#xC218;&#xB97C; &#xB9CC;&#xB4E4;&#xC9C0; &#xC54A;&#xACE0;&#xC120; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC774; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <code>concat(&apos;x&apos;,encode(substring::bytea, &apos;hex&apos;))::bit(64)::bigint</code></li>
</ol>
</li>
<li>leak<br>  db&#xC5D0; flag&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xC804;&#xC81C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xBA85;, &#xD14C;&#xC774;&#xBE14; &#xBA85;, &#xCEEC;&#xB7FC; &#xBA85;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; pg_database&#xC640; information_schema&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC870;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xADF8; &#xC678;&#xC5D0;&#xB3C4; &#xC720;&#xD2F8; &#xD568;&#xC218;&#xB85C; long_to_bytes, extract_int&#xB4F1;&#xC744; &#xAD6C;&#xD604;&#xD574;&#xB193;&#xC740; &#xCD5C;&#xC885; PoC&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xAC00; &#xB9CE;&#xC9C0;&#xB294; &#xC54A;&#xC544;&#xC11C; &#xD55C; &#xD14C;&#xC774;&#xBE14;&#xC744; leak&#xD558;&#xB294;&#xB370; 4&#xCD08;&#xC529;&#xC774;&#xBA74; &#xCDA9;&#xBD84;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<h3 id="PoC"><a href="#PoC" class="headerlink" title="PoC"></a>PoC</h3><p>&#xC544;&#xB798; &#xBB38;&#xC81C; gist &#xCC38;&#xACE0;</p>
<h2 id="Libreria-Pro"><a href="#Libreria-Pro" class="headerlink" title="Libreria Pro"></a>Libreria Pro</h2><h3 id="Description-1"><a href="#Description-1" class="headerlink" title="Description"></a>Description</h3><p>&#xC544;&#xC27D;&#xAC8C;&#xB3C4; Pro &#xBB38;&#xC81C;&#xB77C;&#xACE0; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC548;&#xC8FC;&#xB124;&#xC694;.</p>
<h3 id="Audit-1"><a href="#Audit-1" class="headerlink" title="Audit"></a>Audit</h3><p>&#xC55E; &#xBB38;&#xC81C;&#xB3C4; classic&#xD588;&#xC73C;&#xB2C8; &#xC6B0;&#xC120; <code>/robots.txt</code> &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xBD24;&#xB294;&#xB370; &#xC774;&#xAC8C; &#xC6EC;&#xAC78; Django 404 Page&#xB97C; &#xC751;&#xB2F5;&#xBC1B;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="/2023/09/01/syru/sstf-web-libreria/error_page_give_info.png" srcset="/img/loading.gif" alt></p>
<p>&#xC11C;&#xBC84; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB85C; Django&#xB97C; &#xC4F0;&#xACE0; Debug&#xBAA8;&#xB4DC;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xC544;&#xB0C8;&#xC73C;&#xB2C8; &#xB354; &#xB9CE;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC73C;&#xB824;&#xACE0; &#xC77C;&#xBD80;&#xB7EC; &#xC5D0;&#xB7EC;&#xB97C; &#xB0B4;&#xBD05;&#xC2DC;&#xB2E4;.<br><img src="/2023/09/01/syru/sstf-web-libreria/request_info.png" srcset="/img/loading.gif" alt></p>
<p>&#xCC45; &#xAC80;&#xC0C9; &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC120; &#xC800; 3&#xAC1C;&#xC758; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB124;&#xC694;. PostgreSQL&#xB294; type&#xC5D0; &#xBBFC;&#xAC10;&#xD558;&#xB2C8;&#xAE4C; <code>search_with</code>&#xB97C; int&#xD615;&#xC744; &#xC4F8; &#xAC83; &#xAC19;&#xC740; year&#xB610;&#xB294; month&#xB97C; &#xC4F0;&#xACE0; <code>key</code>&#xB97C; &#xC22B;&#xC790;&#xAC00; &#xC544;&#xB2CC; &#xAC12;&#xC73C;&#xB85C; &#xC918;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="/2023/09/01/syru/sstf-web-libreria/raise_error_using_type_mismatch.png" srcset="/img/loading.gif" alt></p>
<p>&#xC608;&#xC0C1;&#xD55C; &#xB300;&#xB85C; Error&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC800;&#xD76C;&#xB294; Django&#xC758; &#xBC84;&#xC804; &#xC815;&#xBCF4;&#xAE4C;&#xC9C0; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; Traceback&#xC744; &#xC790;&#xC138;&#xD788; &#xBCF4;&#xBA74; ORM&#xC744; &#xC4F0;&#xACE0; &#xC788;&#xACE0;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.djangoproject.com/en/4.2/ref/models/database-functions/#extract">Extract</a>&#xB97C; &#xD1B5;&#xD574;&#xC11C; datetime&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB9CC; &#xBF51;&#xC544; &#xBE44;&#xAD50;&#xC870;&#xAC74;&#xC73C;&#xB85C; &#xC4F0;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="/2023/09/01/syru/sstf-web-libreria/leak_code.png" srcset="/img/loading.gif" alt></p>
<p>Django &#xBC84;&#xC804;&#xC744; &#xC54C;&#xC544;&#xB0C8;&#xC73C;&#xB2C8; cve&#xAC00; &#xC788;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xCC3E;&#xC544;&#xBCF4;&#xB2C8; Extract&#xB098; Trunc &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9; &#xC2DC; SQL injection&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.(<a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cve.org/CVERecord?id=CVE-2022-34265">CVE-2022-34265</a>)<br>&#xC5B4;&#xB5A4; &#xC774;&#xC720;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC778;&#xC9C0; &#xD55C;&#xBC88; Django 4.0.5&#xC758; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA70; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. ORM &#xB3D9;&#xC791; &#xAD6C;&#xC870;&#xB97C; &#xC804;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xD574;&#xD560; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xACE0; &#xC800;&#xD76C;&#xAC00; &#xAD81;&#xAE08;&#xD55C; Extract&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xB9CC; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.<br><pre><code class="hljs python"><span class="hljs-comment"># https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/models/functions/datetime.py#L41-L75</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Extract</span>(<span class="hljs-params">TimezoneMixin, Transform</span>):</span>
    ...
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span>(<span class="hljs-params">self, expression, lookup_name=None, tzinfo=None, **extra</span>):</span>
        <span class="hljs-keyword">if</span> self.lookup_name <span class="hljs-keyword">is</span> <span class="hljs-literal">None</span>:
            self.lookup_name = lookup_name
        ...
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">as_sql</span>(<span class="hljs-params">self, compiler, connection</span>):</span>
        ...
        <span class="hljs-keyword">elif</span> isinstance(lhs_output_field, DateField):
            sql = connection.ops.date_extract_sql(self.lookup_name, sql)
        ...
        <span class="hljs-keyword">return</span> sql, params

<span class="hljs-comment"># https://github.com/django/django/blob/9736596bce4f711ccf2914284938d85748838c94/django/db/backends/postgresql/operations.py#L49-L59</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">date_extract_sql</span>(<span class="hljs-params">self, lookup_type, field_name</span>):</span>
    <span class="hljs-comment"># https://www.postgresql.org/docs/current/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT</span>
    <span class="hljs-keyword">if</span> lookup_type == <span class="hljs-string">&quot;week_day&quot;</span>:
        <span class="hljs-comment"># For consistency across backends, we return Sunday=1, Saturday=7.</span>
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;EXTRACT(&apos;dow&apos; FROM %s) + 1&quot;</span> % field_name
    <span class="hljs-keyword">elif</span> lookup_type == <span class="hljs-string">&quot;iso_week_day&quot;</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;EXTRACT(&apos;isodow&apos; FROM %s)&quot;</span> % field_name
    <span class="hljs-keyword">elif</span> lookup_type == <span class="hljs-string">&quot;iso_year&quot;</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;EXTRACT(&apos;isoyear&apos; FROM %s)&quot;</span> % field_name
    <span class="hljs-keyword">else</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;EXTRACT(&apos;%s&apos; FROM %s)&quot;</span> % (lookup_type, field_name)</code></pre><br><code>Extract(&apos;pubdate&apos;, {search_with})</code> &#xB294; <code>EXTRACT(&apos;{search_with}&apos; FROM {field_name})</code>&#xC758; &#xD615;&#xD0DC;&#xB85C; SQL query&#xC5D0; &#xC0BD;&#xC785;&#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; <code>%</code> operator&#xB294; quote&#xC5D0; &#xB300;&#xD574; &#xBCC4;&#xB3C4;&#xC758; escape &#xC808;&#xCC28;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xBB38;&#xC790;&#xC5F4;&#xC5D0; &#xC0BD;&#xC785;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; sql injection&#xC5D0; &#xCDE8;&#xC57D;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.<br>Exploit&#xC740; EXTRACT &#xD568;&#xC218;&#xB97C; &#xC644;&#xC131; &#xD6C4; &#xC774;&#xC804; &#xBB38;&#xC81C;&#xC640; &#xAC19;&#xC774; union select&#xB97C; &#xD1B5;&#xD574; data leak&#xC744; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="PoC-1"><a href="#PoC-1" class="headerlink" title="PoC"></a>PoC</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://gist.github.com/l0vey0u/055f1abd080c1c26d51fd5b373f5d13a">PoC Gist</a></p>
<h2 id="Epilogue"><a href="#Epilogue" class="headerlink" title="Epilogue"></a>Epilogue</h2><p> &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAC1C;&#xBC1C;&#xD560; &#xB54C; ORM&#xC744; &#xB300;&#xBD80;&#xBD84; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xBD84;&#xBA85; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD560; &#xAC70;&#xB77C;&#xACE0; &#xACC4;&#xC18D; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xB294;&#xB370; &#xC2E4;&#xC81C;&#xB85C; &#xBC1C;&#xC0DD;&#xD588;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; exploit&#xC744; &#xD574;&#xBCF4;&#xB2C8; &#xC7AC;&#xBC0C;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Write-Up/">Write-Up</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/web/">web</a>
                  
                  <a class="hover-with-bg" href="/tags/php/">php</a>
                  
                  <a class="hover-with-bg" href="/tags/ctf/">ctf</a>
                  
                  <a class="hover-with-bg" href="/tags/sstf/">sstf</a>
                  
                  <a class="hover-with-bg" href="/tags/syru/">syru</a>
                  
                  <a class="hover-with-bg" href="/tags/sqli/">sqli</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_syru.jpg" srcset="/img/loading.gif" alt="syru">
                  </div>

                  <div class="link-text">
                    <div class="link-title">syru</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/syru">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2023/09/03/l0ch/hackingcamp_review/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Daily-Life] 27  Review&Write-Up</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2023/09/01/pwndorei/sstf-heapster/">
                    <span class="hidden-mobile">[Write-Up] SSTF heapster</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2023/09/01/syru/sstf-web-libreria/';
        this.page.identifier = '/2023/09/01/syru/sstf-web-libreria/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Write-Up] SSTF : libreria & libreria pro&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
