

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xACE0;&amp;#xB97C; 1&amp;#xB144; &amp;#xB3D9;&amp;#xC548; &amp;#xC228;&amp;#xAE34; &amp;#xAE30;&amp;#xC5C5; &amp;#xB274;&amp;#xC2A4;&amp;#xBD80;&amp;#xD130; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD0C8;&amp;#xD0C8; &amp;#xD138;&amp;#xB9B0; &amp;#xB274;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xBC88; &amp;#xC8FC;&amp;#xB3C4; &amp;#xAF49;&amp;#xAF49; &amp;#xB2F4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt; &lt;strong&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xC624;&amp;#xD508;AI&amp;#xC5D0;&amp;#xC11C; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xACE0;, 1&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#xC228;&amp;#xACA8;&amp;#xC84C;&amp;#xB2E4;?&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.09 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131190&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144; &amp;#xCD08; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xB2F9;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC2E4;&amp;#x1F92F;&amp;#xC774; &lt;a href=&#34;https://www.nytimes.com/2024/07/04/technology/openai-hack.html&#34;&gt;&amp;#xB274;&amp;#xC695;&amp;#xD0C0;&amp;#xC784;&amp;#xC988;&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; &amp;#xC0AC;&amp;#xB0B4; &amp;#xBA54;&amp;#xC2E0;&amp;#xC800;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC758; &amp;#xB300;&amp;#xD654; &amp;#xB0B4;&amp;#xC6A9;&amp;#x1F4AC;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAD00;&amp;#xB828; &amp;#xAE30;&amp;#xC220;&amp;#x1F916;&amp;#xB3C4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xC0DD;&amp;#xD0DC;&amp;#xACC4;&amp;#xC758; &amp;#xBD88;&amp;#xC548;&amp;#xC804;&amp;#xC131;&amp;#xACFC; &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB4DC;&amp;#xB7EC;&amp;#xB0C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBB38;&amp;#xC81C; 1: &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCE68;&amp;#xD574;&amp;#xC640; &amp;#xC815;&amp;#xBCF4; &amp;#xC740;&amp;#xD3D0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xD6C8;&amp;#xB828;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC624;&amp;#xD508;AI&amp;#xB294; &amp;#xC774; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xAD6D;&amp;#xAC00; &amp;#xC548;&amp;#xBCF4;&amp;#xC5D0; &amp;#xC704;&amp;#xD611;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xC5EC; &amp;#xACF5;&amp;#xAC1C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xBA85;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC98;&amp;#xB9AC;&amp;#xC640; &amp;#xC218;&amp;#xAE09;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD88;&amp;#xD22C;&amp;#xBA85;&amp;#xC131;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xB2F5;&amp;#xBCC0;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xD3C9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xCC57;GPT&amp;#xC5D0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD6C8;&amp;#xB828; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xBC1D;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC740; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F937;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBB38;&amp;#xC81C; 2: &lt;a href=&#34;https://m.news.nate.com/view/20240518n07932&#34;&gt;&amp;#xB0B4;&amp;#xBD80; &amp;#xAC08;&amp;#xB4F1;&amp;#xACFC; &amp;#xBCF4;&amp;#xC548; &amp;#xAD00;&amp;#xB9AC;&lt;/a&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC600;&amp;#xB358; &amp;#xB808;&amp;#xC624;&amp;#xD3F4;&amp;#xB4DC; &amp;#xC544;&amp;#xC174;&amp;#xBE0C;&amp;#xB808;&amp;#xB108;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&amp;#xB97C; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC81C;&amp;#xC548;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xCD9C;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xC81C;&amp;#xC548;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; , &amp;#xC62C;&amp;#xD574; &amp;#xCD08; &amp;#xD574;&amp;#xACE0;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC174;&amp;#xBE0C;&amp;#xB808;&amp;#xB108;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC9C0;&amp;#xC801;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xD574;&amp;#xACE0; &amp;#xC774;&amp;#xC720;&amp;#xB77C;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC624;&amp;#xD508;AI&amp;#xB294; &amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC744; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC624;&amp;#xD508;AI &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD63C;&amp;#xB780;&amp;#xACFC; &amp;#xAC08;&amp;#xB4F1;&amp;#xC774; &amp;#xB4DC;&amp;#xB7EC;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144; 11&amp;#xC6D4;, &amp;#xC624;&amp;#xD508;AI&amp;#xC758; CEO &amp;#xC0D8; &amp;#xC62C;&amp;#xD2B8;&amp;#xB9CC;&amp;#xC774; &amp;#xD574;&amp;#xACE0;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xC9C1;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC758; &amp;#xBC18;&amp;#xBC1C;&amp;#xB85C; &amp;#xC77C;&amp;#xC8FC;&amp;#xC77C; &amp;#xB9CC;&amp;#xC5D0; &amp;#xBCF5;&amp;#xADC0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC62C;&amp;#xD2B8;&amp;#xB9CC;&amp;#xC758; &amp;#xD574;&amp;#xACE0; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC784;&amp;#xC6D0;&amp;#xC9C4;&amp;#xB4E4;&amp;#xACFC;&amp;#xC758; &amp;#xBD88;&amp;#xD654;&amp;#xC640; &amp;#xC18C;&amp;#xD1B5; &amp;#xBD80;&amp;#xC7AC;&amp;#xC600;&amp;#xC73C;&amp;#xB098;, &amp;#xC774;&amp;#xB294; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAC1C;&amp;#xBC1C; &amp;#xCCA0;&amp;#xD559;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xB86F;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC624;&amp;#xD508;AI &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB354;&amp;#xC6B1; &amp;#xBD80;&amp;#xAC01;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F926;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC0DD;&amp;#xD65C;&amp;#xC5D0; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD568;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC228;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F635;&amp;#x200D;&amp;#x1F4AB;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; APT &amp;#xADF8;&amp;#xB8F9; &amp;#x2018;CloudSorcerer&amp;#x2019; &amp;#xB4F1;&amp;#xC7A5;: &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.08 | The Hacker News | &lt;a href=&#34;https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html&#34;&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB274;&amp;#xC2A4;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xCD5C;&amp;#xADFC; &amp;#x2018;CloudSorcerer&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; APT(Advanced Persistent Threat) &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#x1F1F7;&amp;#x1F1FA;&amp;#xC758; &amp;#xB2E8;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;C&amp;amp;C(Command and Control&lt;/a&gt;) &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC758; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; CloudWizard&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC73C;&amp;#xB098;, &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC77C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB85C;&amp;#xC120; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xCE68;&amp;#xD22C;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC54C;&amp;#xB824;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCD08;&amp;#xAE30; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xB9CC; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB294; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xD3F4;&amp;#xB354; &amp;#xC5F4;&amp;#xAC70;, &amp;#xC178; &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;, &amp;#xD30C;&amp;#xC77C; &amp;#xC791;&amp;#xC5C5; &amp;#xC218;&amp;#xD589;, &amp;#xCD94;&amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F608;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xAC1C;&amp;#xC778; &amp;#xC2E4;&amp;#xBB3C;&amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;&amp;#xB7;&amp;#xC5EC;&amp;#xAD8C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB178;&amp;#xCD9C;&amp;#x2026;&amp;#xC0AC;&amp;#xAC01;&amp;#xC9C0;&amp;#xB300; &amp;#xB193;&amp;#xC778; &amp;#xAC1C;&amp;#xBC1C; &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.09 | &amp;#xC804;&amp;#xC790;&amp;#xC2E0;&amp;#xBB38;  | &lt;a href=&#34;https://www.etnews.com/20240708000171&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.criminalip.io/2024/07/05/kyc-system/&#34;&gt;Criminal IP&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xC57D; 1&amp;#xB9CC;&amp;#xC5EC; &amp;#xAC74;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D;&amp;#xD655;&amp;#xC778;(&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;KYC&lt;/a&gt;) &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;KYC &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;, &amp;#xC5EC;&amp;#xAD8C;, &amp;#xC2E0;&amp;#xBD84; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD604;&amp;#xC7AC; &amp;#xBCF8;&amp;#xC778; &amp;#xC0AC;&amp;#xC9C4; &amp;#xB4F1; &amp;#xB9CE;&amp;#xC740; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC; &amp;#xBBF8;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; KYC &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB34;&amp;#xBC29;&amp;#xBE44;&amp;#xB85C; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;2024&amp;#xB144; 7&amp;#xC6D4; 2&amp;#xC77C;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; KYC &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xACE0;&amp;#xAC1D;&amp;#xC758; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;, &amp;#xC5EC;&amp;#xAD8C;&amp;#xC0AC;&amp;#xC9C4;, &amp;#xC774;&amp;#xB984;, &amp;#xC0DD;&amp;#xB144;&amp;#xC6D4;&amp;#xC77C; &amp;#xB4F1;&amp;#xC774; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xB294; &amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &amp;#xC57D; 1&amp;#xB9CC; &amp;#xAC74;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC720;&amp;#xC800; &amp;#xC218;&amp;#xB3C4; 684&amp;#xBA85;&amp;#xC5D0; &amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xC804;&amp;#xD600; &amp;#xC5C6;&amp;#xC5B4; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5F4;&amp;#xB78C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD655;&amp;#xC778; &amp;#xACB0;&amp;#xACFC; &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xAC00;&amp;#xB3D9; &amp;#xC911;&amp;#xC778; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC6A9; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB418;&amp;#xBA70;, &amp;#xBC29;&amp;#xD654;&amp;#xBCBD; &amp;#xC124;&amp;#xC815; &amp;#xBBF8;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F633;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;KYC(Know Your Customer)&lt;ul&gt;
&lt;li&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C;&amp;#xACFC; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD3D0; &amp;#xAC70;&amp;#xB798;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC774; &amp;#xBCF8;&amp;#xC778; &amp;#xACC4;&amp;#xC815;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xC808;&amp;#xCC28;&amp;#xB85C;, &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xC5EC;&amp;#xAD8C; &amp;#xB4F1;&amp;#xC744; &amp;#xAE08;&amp;#xC735;&amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC81C;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;C&amp;amp;C(Command and Control)&lt;ul&gt;
&lt;li&gt;&amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xAE30;&amp;#xACC4; &amp;#xB610;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131161&amp;amp;direct=mobile&#34;&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC218;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548;&amp;#xAE30;&amp;#xC5C5;&amp;#xC740;? &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131200&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC5ED;&amp;#xC0AC;&amp;#xC0C1; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; DB, &amp;#xB85D;&amp;#xC720;2024&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131174&#34;&gt;&amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBD07;&amp;#xB137; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC800;&amp;#xADF8;&amp;#xC5D0;&amp;#xCE74;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xD0D1;&amp;#xC7AC;&amp;#xD55C; &amp;#xCC44; &amp;#xD65C;&amp;#xB3D9; &amp;#xC911;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Ransomware-as-a-Service (RaaS)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image4.png&#34; alt=&#34;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB294; &lt;strong&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB378;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC220; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB3C4; &amp;#xC27D;&amp;#xAC8C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; RaaS &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xACC4;&amp;#xD68D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790;&amp;#xB294; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC; &amp;#xC218;&amp;#xC775;&amp;#xC744; &amp;#xB098;&amp;#xB220; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, GandCrab&amp;#xACFC; &lt;a href=&#34;https://www.nomios.com/resources/what-is-revil-ransomware/&#34;&gt;REvil&lt;/a&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; RaaS &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCE5C;&amp;#xD654;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xC2DC;&amp;#xBCF4;&amp;#xB4DC;&amp;#xC640; 24&amp;#xC2DC;&amp;#xAC04; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC5EC;, &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC27D;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. GandCrab&amp;#xC740; 2018&amp;#xB144;&amp;#xC5D0; &amp;#xCC98;&amp;#xC74C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD655;&amp;#xC0B0;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xC790;&amp;#xCDE8;&amp;#xB97C; &amp;#xAC10;&amp;#xCD98; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. REvil&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xD06C; &amp;#xC6F9;&amp;#xC5D0;&amp;#xC11C; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xC5EC; &amp;#xD070; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC785;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB294; &amp;#xB0AE;&amp;#xC740; &amp;#xC9C4;&amp;#xC785; &amp;#xC7A5;&amp;#xBCBD;&amp;#xACFC; &amp;#xC218;&amp;#xC775; &amp;#xACF5;&amp;#xC720; &amp;#xBAA8;&amp;#xB378; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xCD09;&amp;#xC9C4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788;, &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC9C0;&amp;#xC2DD; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xBE48;&amp;#xB3C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RaaS&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB354; &amp;#xC870;&amp;#xC9C1;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xC5EC;, &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xAC1C;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD070; &amp;#xC704;&amp;#xD611;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[í•´í‚¹ì§¹ì§¹ðŸ£] 1ë…„ë™ì•ˆ í•´í‚¹ ì‚¬ê³ ë¥¼ ìˆ¨ê¸´ ì—…ê³„ 1ìœ„ ê¸°ì—…?! - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xACE0;&amp;#xB97C; 1&amp;#xB144; &amp;#xB3D9;&amp;#xC548; &amp;#xC228;&amp;#xAE34; &amp;#xAE30;&amp;#xC5C5; &amp;#xB274;&amp;#xC2A4;&amp;#xBD80;&amp;#xD130; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD0C8;&amp;#xD0C8; &amp;#xD138;&amp;#xB9B0; &amp;#xB274;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC774;&amp;#xBC88; &amp;#xC8FC;&amp;#xB3C4; &amp;#xAF49;&amp;#xAF49; &amp;#xB2F4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt; &lt;strong&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xC624;&amp;#xD508;AI&amp;#xC5D0;&amp;#xC11C; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xD574;&amp;#xD0B9; &amp;#xC0AC;&amp;#xACE0;, 1&amp;#xB144; &amp;#xB118;&amp;#xAC8C; &amp;#xC228;&amp;#xACA8;&amp;#xC84C;&amp;#xB2E4;?&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.09 | &amp;#xBCF4;&amp;#xC548;&amp;#xB274;&amp;#xC2A4; | &lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131190&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144; &amp;#xCD08; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xB2F9;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xCDA9;&amp;#xACA9;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC2E4;&amp;#x1F92F;&amp;#xC774; &lt;a href=&#34;https://www.nytimes.com/2024/07/04/technology/openai-hack.html&#34;&gt;&amp;#xB274;&amp;#xC695;&amp;#xD0C0;&amp;#xC784;&amp;#xC988;&lt;/a&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; &amp;#xC0AC;&amp;#xB0B4; &amp;#xBA54;&amp;#xC2E0;&amp;#xC800;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC9C1;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC758; &amp;#xB300;&amp;#xD654; &amp;#xB0B4;&amp;#xC6A9;&amp;#x1F4AC;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD588;&amp;#xC73C;&amp;#xBA70;, &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAD00;&amp;#xB828; &amp;#xAE30;&amp;#xC220;&amp;#x1F916;&amp;#xB3C4; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xC0DD;&amp;#xD0DC;&amp;#xACC4;&amp;#xC758; &amp;#xBD88;&amp;#xC548;&amp;#xC804;&amp;#xC131;&amp;#xACFC; &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB4DC;&amp;#xB7EC;&amp;#xB0C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBB38;&amp;#xC81C; 1: &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCE68;&amp;#xD574;&amp;#xC640; &amp;#xC815;&amp;#xBCF4; &amp;#xC740;&amp;#xD3D0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB294; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xD6C8;&amp;#xB828;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0;&amp;#xB294; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC624;&amp;#xD508;AI&amp;#xB294; &amp;#xC774; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xAD6D;&amp;#xAC00; &amp;#xC548;&amp;#xBCF4;&amp;#xC5D0; &amp;#xC704;&amp;#xD611;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD558;&amp;#xC5EC; &amp;#xACF5;&amp;#xAC1C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xBA85;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xCC98;&amp;#xB9AC;&amp;#xC640; &amp;#xC218;&amp;#xAE09;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD88;&amp;#xD22C;&amp;#xBA85;&amp;#xC131;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &amp;#xB2F5;&amp;#xBCC0;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xD3C9;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xCC57;GPT&amp;#xC5D0; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xD6C8;&amp;#xB828; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xBC1D;&amp;#xD788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC83;&amp;#xC740; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F937;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &lt;strong&gt;&amp;#xBB38;&amp;#xC81C; 2: &lt;a href=&#34;https://m.news.nate.com/view/20240518n07932&#34;&gt;&amp;#xB0B4;&amp;#xBD80; &amp;#xAC08;&amp;#xB4F1;&amp;#xACFC; &amp;#xBCF4;&amp;#xC548; &amp;#xAD00;&amp;#xB9AC;&lt;/a&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC624;&amp;#xD508;AI&amp;#xC758; &amp;#xAE30;&amp;#xC220; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC600;&amp;#xB358; &amp;#xB808;&amp;#xC624;&amp;#xD3F4;&amp;#xB4DC; &amp;#xC544;&amp;#xC174;&amp;#xBE0C;&amp;#xB808;&amp;#xB108;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xAC15;&amp;#xD654;&amp;#xB97C; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xC81C;&amp;#xC548;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xCD9C;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xC81C;&amp;#xC548;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0; , &amp;#xC62C;&amp;#xD574; &amp;#xCD08; &amp;#xD574;&amp;#xACE0;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC174;&amp;#xBE0C;&amp;#xB808;&amp;#xB108;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC9C0;&amp;#xC801;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xD574;&amp;#xACE0; &amp;#xC774;&amp;#xC720;&amp;#xB77C;&amp;#xACE0; &amp;#xC8FC;&amp;#xC7A5;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC624;&amp;#xD508;AI&amp;#xB294; &amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC744; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC624;&amp;#xD508;AI &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD63C;&amp;#xB780;&amp;#xACFC; &amp;#xAC08;&amp;#xB4F1;&amp;#xC774; &amp;#xB4DC;&amp;#xB7EC;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC791;&amp;#xB144; 11&amp;#xC6D4;, &amp;#xC624;&amp;#xD508;AI&amp;#xC758; CEO &amp;#xC0D8; &amp;#xC62C;&amp;#xD2B8;&amp;#xB9CC;&amp;#xC774; &amp;#xD574;&amp;#xACE0;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB098;, &amp;#xC9C1;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC758; &amp;#xBC18;&amp;#xBC1C;&amp;#xB85C; &amp;#xC77C;&amp;#xC8FC;&amp;#xC77C; &amp;#xB9CC;&amp;#xC5D0; &amp;#xBCF5;&amp;#xADC0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC62C;&amp;#xD2B8;&amp;#xB9CC;&amp;#xC758; &amp;#xD574;&amp;#xACE0; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xC784;&amp;#xC6D0;&amp;#xC9C4;&amp;#xB4E4;&amp;#xACFC;&amp;#xC758; &amp;#xBD88;&amp;#xD654;&amp;#xC640; &amp;#xC18C;&amp;#xD1B5; &amp;#xBD80;&amp;#xC7AC;&amp;#xC600;&amp;#xC73C;&amp;#xB098;, &amp;#xC774;&amp;#xB294; &amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAC1C;&amp;#xBC1C; &amp;#xCCA0;&amp;#xD559;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xB86F;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC624;&amp;#xD508;AI &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xB354;&amp;#xC6B1; &amp;#xBD80;&amp;#xAC01;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F926;&amp;#x200D;&amp;#x2642;&amp;#xFE0F;&lt;/p&gt;
&lt;p&gt;&amp;#xC778;&amp;#xACF5;&amp;#xC9C0;&amp;#xB2A5; &amp;#xAE30;&amp;#xC220;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; &amp;#xC0DD;&amp;#xD65C;&amp;#xC5D0; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD568;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xADF8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC228;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F635;&amp;#x200D;&amp;#x1F4AB;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; APT &amp;#xADF8;&amp;#xB8F9; &amp;#x2018;CloudSorcerer&amp;#x2019; &amp;#xB4F1;&amp;#xC7A5;: &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.08 | The Hacker News | &lt;a href=&#34;https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html&#34;&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB274;&amp;#xC2A4;&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xCD5C;&amp;#xADFC; &amp;#x2018;CloudSorcerer&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; APT(Advanced Persistent Threat) &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB4E4;&amp;#xC740; &amp;#xC8FC;&amp;#xB85C; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#x1F1F7;&amp;#x1F1FA;&amp;#xC758; &amp;#xB2E8;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;C&amp;amp;C(Command and Control&lt;/a&gt;) &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB4E4;&amp;#xC758; &amp;#xACF5;&amp;#xACA9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; CloudWizard&amp;#xB77C;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xACF5;&amp;#xACA9; &amp;#xB2E8;&amp;#xCCB4;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC73C;&amp;#xB098;, &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC77C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F914;&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB85C;&amp;#xC120; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC5D0; &amp;#xCE68;&amp;#xD22C;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC54C;&amp;#xB824;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCD08;&amp;#xAE30; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xB9CC; &amp;#xBC1D;&amp;#xD600;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC31;&amp;#xB3C4;&amp;#xC5B4;&amp;#xB294; &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xD3F4;&amp;#xB354; &amp;#xC5F4;&amp;#xAC70;, &amp;#xC178; &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;, &amp;#xD30C;&amp;#xC77C; &amp;#xC791;&amp;#xC5C5; &amp;#xC218;&amp;#xD589;, &amp;#xCD94;&amp;#xAC00; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F608;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xAC1C;&amp;#xC778; &amp;#xC2E4;&amp;#xBB3C;&amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;&amp;#xB7;&amp;#xC5EC;&amp;#xAD8C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB178;&amp;#xCD9C;&amp;#x2026;&amp;#xC0AC;&amp;#xAC01;&amp;#xC9C0;&amp;#xB300; &amp;#xB193;&amp;#xC778; &amp;#xAC1C;&amp;#xBC1C; &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.07.09 | &amp;#xC804;&amp;#xC790;&amp;#xC2E0;&amp;#xBB38;  | &lt;a href=&#34;https://www.etnews.com/20240708000171&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;br&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.criminalip.io/2024/07/05/kyc-system/&#34;&gt;Criminal IP&lt;/a&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74;, &amp;#xC57D; 1&amp;#xB9CC;&amp;#xC5EC; &amp;#xAC74;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xD55C; &amp;#xACE0;&amp;#xAC1D;&amp;#xD655;&amp;#xC778;(&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;KYC&lt;/a&gt;) &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;KYC &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;, &amp;#xC5EC;&amp;#xAD8C;, &amp;#xC2E0;&amp;#xBD84; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD604;&amp;#xC7AC; &amp;#xBCF8;&amp;#xC778; &amp;#xC0AC;&amp;#xC9C4; &amp;#xB4F1; &amp;#xB9CE;&amp;#xC740; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC; &amp;#xBBF8;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; KYC &amp;#xC778;&amp;#xC99D; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xBB34;&amp;#xBC29;&amp;#xBE44;&amp;#xB85C; &amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F631;&lt;/p&gt;
&lt;p&gt;2024&amp;#xB144; 7&amp;#xC6D4; 2&amp;#xC77C;&amp;#xC5D0; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; KYC &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xACE0;&amp;#xAC1D;&amp;#xC758; &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;, &amp;#xC5EC;&amp;#xAD8C;&amp;#xC0AC;&amp;#xC9C4;, &amp;#xC774;&amp;#xB984;, &amp;#xC0DD;&amp;#xB144;&amp;#xC6D4;&amp;#xC77C; &amp;#xB4F1;&amp;#xC774; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xB294; &amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &amp;#xC57D; 1&amp;#xB9CC; &amp;#xAC74;&amp;#xC758; &amp;#xC720;&amp;#xC800; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70;, &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC720;&amp;#xC800; &amp;#xC218;&amp;#xB3C4; 684&amp;#xBA85;&amp;#xC5D0; &amp;#xB2EC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xC804;&amp;#xD600; &amp;#xC5C6;&amp;#xC5B4; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC720;&amp;#xC800;&amp;#xC758; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5F4;&amp;#xB78C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD655;&amp;#xC778; &amp;#xACB0;&amp;#xACFC; &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xAC00;&amp;#xB3D9; &amp;#xC911;&amp;#xC778; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC6A9; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xCD94;&amp;#xC815;&amp;#xB418;&amp;#xBA70;, &amp;#xBC29;&amp;#xD654;&amp;#xBCBD; &amp;#xC124;&amp;#xC815; &amp;#xBBF8;&amp;#xD761;&amp;#xC73C;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC778;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F633;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;KYC(Know Your Customer)&lt;ul&gt;
&lt;li&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C;&amp;#xACFC; &amp;#xAC00;&amp;#xC0C1;&amp;#xD654;&amp;#xD3D0; &amp;#xAC70;&amp;#xB798;&amp;#xC18C;&amp;#xC5D0;&amp;#xC11C; &amp;#xACE0;&amp;#xAC1D;&amp;#xC774; &amp;#xBCF8;&amp;#xC778; &amp;#xACC4;&amp;#xC815;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xC808;&amp;#xCC28;&amp;#xB85C;, &amp;#xC2E0;&amp;#xBD84;&amp;#xC99D;&amp;#xC774;&amp;#xB098; &amp;#xC5EC;&amp;#xAD8C; &amp;#xB4F1;&amp;#xC744; &amp;#xAE08;&amp;#xC735;&amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0; &amp;#xC81C;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;C&amp;amp;C(Command and Control)&lt;ul&gt;
&lt;li&gt;&amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xAE30;&amp;#xACC4; &amp;#xB610;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131161&amp;amp;direct=mobile&#34;&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xBCF4;&amp;#xC548;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC218;&amp;#xB97C; &amp;#xACF5;&amp;#xAC1C;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548;&amp;#xAE30;&amp;#xC5C5;&amp;#xC740;? &amp;#xD2B8;&amp;#xB80C;&amp;#xB4DC;&amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131200&#34;&gt;&amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC5D0; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xC5ED;&amp;#xC0AC;&amp;#xC0C1; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638; DB, &amp;#xB85D;&amp;#xC720;2024&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=131174&#34;&gt;&amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBD07;&amp;#xB137; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC800;&amp;#xADF8;&amp;#xC5D0;&amp;#xCE74;, &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xD0D1;&amp;#xC7AC;&amp;#xD55C; &amp;#xCC44; &amp;#xD65C;&amp;#xB3D9; &amp;#xC911;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;&amp;#xC8FC;-&amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC8FC; &amp;#xBCF4;&amp;#xC548;&amp;#xC6A9;&amp;#xC5B4;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Ransomware-as-a-Service (RaaS)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/15/romi0x/newsletter0715/image4.png&#34; alt=&#34;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB294; &lt;strong&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBE44;&amp;#xC988;&amp;#xB2C8;&amp;#xC2A4; &amp;#xBAA8;&amp;#xB378;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAE30;&amp;#xC220; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB3C4; &amp;#xC27D;&amp;#xAC8C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; RaaS &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xACC4;&amp;#xD68D;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790;&amp;#xB294; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC778; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC; &amp;#xC218;&amp;#xC775;&amp;#xC744; &amp;#xB098;&amp;#xB220; &amp;#xAC16;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, GandCrab&amp;#xACFC; &lt;a href=&#34;https://www.nomios.com/resources/what-is-revil-ransomware/&#34;&gt;REvil&lt;/a&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; RaaS &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCE5C;&amp;#xD654;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xC2DC;&amp;#xBCF4;&amp;#xB4DC;&amp;#xC640; 24&amp;#xC2DC;&amp;#xAC04; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC5EC;, &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC27D;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. GandCrab&amp;#xC740; 2018&amp;#xB144;&amp;#xC5D0; &amp;#xCC98;&amp;#xC74C; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xC5EC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD655;&amp;#xC0B0;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xD604;&amp;#xC7AC;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xC790;&amp;#xCDE8;&amp;#xB97C; &amp;#xAC10;&amp;#xCD98; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. REvil&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xACE0; &amp;#xB2E4;&amp;#xD06C; &amp;#xC6F9;&amp;#xC5D0;&amp;#xC11C; &amp;#xD310;&amp;#xB9E4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xAE09;&amp;#xB9DD;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xD558;&amp;#xC5EC; &amp;#xD070; &amp;#xD53C;&amp;#xD574;&amp;#xB97C; &amp;#xC785;&amp;#xD614;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;RaaS&amp;#xB294; &amp;#xB0AE;&amp;#xC740; &amp;#xC9C4;&amp;#xC785; &amp;#xC7A5;&amp;#xBCBD;&amp;#xACFC; &amp;#xC218;&amp;#xC775; &amp;#xACF5;&amp;#xC720; &amp;#xBAA8;&amp;#xB378; &amp;#xB355;&amp;#xBD84;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBC94;&amp;#xC8C4;&amp;#xB97C; &amp;#xCD09;&amp;#xC9C4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788;, &amp;#xBC94;&amp;#xC8C4;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC801; &amp;#xC9C0;&amp;#xC2DD; &amp;#xC5C6;&amp;#xC774;&amp;#xB3C4; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9;&amp;#xC758; &amp;#xBE48;&amp;#xB3C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. RaaS&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB354; &amp;#xC870;&amp;#xC9C1;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xC5EC;, &amp;#xAE30;&amp;#xC5C5;&amp;#xACFC; &amp;#xAC1C;&amp;#xC778;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD070; &amp;#xC704;&amp;#xD611;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/NewsletterBanner.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/07/15/romi0x/newsletter0715/">

  <title>[í•´í‚¹ì§¹ì§¹ðŸ£] 1ë…„ë™ì•ˆ í•´í‚¹ ì‚¬ê³ ë¥¼ ìˆ¨ê¸´ ì—…ê³„ 1ìœ„ ê¸°ì—…?! - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-07-15 17:00" pubdate>
      2024ë…„ 7ì›” 15ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.9k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      38
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[í•´í‚¹ì§¹ì§¹ðŸ£] 1ë…„ë™ì•ˆ í•´í‚¹ ì‚¬ê³ ë¥¼ ìˆ¨ê¸´ ì—…ê³„ 1ìœ„ ê¸°ì—…?!</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! romi0x&#xC785;&#xB2C8;&#xB2E4; &#x1F600;</p>
<p>&#xD574;&#xD0B9; &#xC0AC;&#xACE0;&#xB97C; 1&#xB144; &#xB3D9;&#xC548; &#xC228;&#xAE34; &#xAE30;&#xC5C5; &#xB274;&#xC2A4;&#xBD80;&#xD130; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xD0C8;&#xD0C8; &#xD138;&#xB9B0; &#xB274;&#xC2A4;&#xAE4C;&#xC9C0; &#xC774;&#xBC88; &#xC8FC;&#xB3C4; &#xAF49;&#xAF49; &#xB2F4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;!!</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p> <strong>&#x1F5E3;&#xFE0F; &#xC624;&#xD508;AI&#xC5D0;&#xC11C; &#xC788;&#xC5C8;&#xB358; &#xD574;&#xD0B9; &#xC0AC;&#xACE0;, 1&#xB144; &#xB118;&#xAC8C; &#xC228;&#xACA8;&#xC84C;&#xB2E4;?</strong></p>
</blockquote>
<p>2024.07.09 | &#xBCF4;&#xC548;&#xB274;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=131190">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/07/15/romi0x/newsletter0715/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC791;&#xB144; &#xCD08; &#xC624;&#xD508;AI&#xAC00; &#xD574;&#xD0B9;&#xC744; &#xB2F9;&#xD588;&#xB2E4;&#xB294; &#xCDA9;&#xACA9;&#xC801;&#xC778; &#xC0AC;&#xC2E4;&#x1F92F;&#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.nytimes.com/2024/07/04/technology/openai-hack.html">&#xB274;&#xC695;&#xD0C0;&#xC784;&#xC988;</a>&#xB97C; &#xD1B5;&#xD574; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xCEE4;&#xB294; &#xC0AC;&#xB0B4; &#xBA54;&#xC2E0;&#xC800;&#xB97C; &#xD1B5;&#xD574; &#xC9C1;&#xC6D0;&#xB4E4;&#xC758; &#xB300;&#xD654; &#xB0B4;&#xC6A9;&#x1F4AC;&#xC744; &#xC218;&#xC9D1;&#xD588;&#xC73C;&#xBA70;, &#xC624;&#xD508;AI&#xC758; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAD00;&#xB828; &#xAE30;&#xC220;&#x1F916;&#xB3C4; &#xD0C8;&#xCDE8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xC0AC;&#xAC74;&#xC740; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC0DD;&#xD0DC;&#xACC4;&#xC758; &#xBD88;&#xC548;&#xC804;&#xC131;&#xACFC; &#xC624;&#xD508;AI&#xC758; &#xB0B4;&#xBD80; &#xAD00;&#xB9AC; &#xBB38;&#xC81C;&#xB97C; &#xB4DC;&#xB7EC;&#xB0C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#x26A0;&#xFE0F; <strong>&#xBB38;&#xC81C; 1: &#xB370;&#xC774;&#xD130; &#xCE68;&#xD574;&#xC640; &#xC815;&#xBCF4; &#xC740;&#xD3D0;</strong></p>
<p>&#xD574;&#xCEE4;&#xB294; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xD6C8;&#xB828;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBBFC;&#xAC10;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC5D0;&#xB294; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xC624;&#xD508;AI&#xB294; &#xC774; &#xC0AC;&#xAC74;&#xC774; &#xAD6D;&#xAC00; &#xC548;&#xBCF4;&#xC5D0; &#xC704;&#xD611;&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD558;&#xC5EC; &#xACF5;&#xAC1C;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xACE0; &#xD574;&#xBA85;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xB370;&#xC774;&#xD130; &#xCC98;&#xB9AC;&#xC640; &#xC218;&#xAE09;&#xC5D0; &#xB300;&#xD55C; &#xBD88;&#xD22C;&#xBA85;&#xC131;&#xC744; &#xD574;&#xACB0;&#xD558;&#xB294; &#xB2F5;&#xBCC0;&#xC73C;&#xB85C;&#xB294; &#xBD80;&#xC871;&#xD558;&#xB2E4;&#xB294; &#xD3C9;&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC774; &#xCC57;GPT&#xC5D0; &#xC785;&#xB825;&#xD558;&#xB294; &#xBBFC;&#xAC10;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC640; &#xD6C8;&#xB828; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xB418;&#xB294;&#xC9C0; &#xBC1D;&#xD788;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xC740; &#xD070; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;.&#x1F937;&#x200D;&#x2642;&#xFE0F;</p>
<p>&#x26A0;&#xFE0F; <strong>&#xBB38;&#xC81C; 2: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.news.nate.com/view/20240518n07932">&#xB0B4;&#xBD80; &#xAC08;&#xB4F1;&#xACFC; &#xBCF4;&#xC548; &#xAD00;&#xB9AC;</a></strong></p>
<p>&#xB2F9;&#xC2DC; &#xC624;&#xD508;AI&#xC758; &#xAE30;&#xC220; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xAD00;&#xB9AC;&#xC790;&#xC600;&#xB358; &#xB808;&#xC624;&#xD3F4;&#xB4DC; &#xC544;&#xC174;&#xBE0C;&#xB808;&#xB108;&#xB294; &#xBCF4;&#xC548; &#xAC15;&#xD654;&#xB97C; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xC81C;&#xC548;&#xC11C;&#xB97C; &#xC81C;&#xCD9C;&#xD588;&#xC73C;&#xB098;, &#xC81C;&#xC548;&#xC740; &#xBB34;&#xC2DC;&#xB418;&#xC5C8;&#xACE0; , &#xC62C;&#xD574; &#xCD08; &#xD574;&#xACE0;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xC174;&#xBE0C;&#xB808;&#xB108;&#xB294; &#xD68C;&#xC0AC;&#xC758; &#xBCF4;&#xC548; &#xBB38;&#xC81C;&#xB97C; &#xC9C0;&#xC801;&#xD55C; &#xAC83;&#xC774; &#xD574;&#xACE0; &#xC774;&#xC720;&#xB77C;&#xACE0; &#xC8FC;&#xC7A5;&#xD588;&#xC9C0;&#xB9CC;, &#xC624;&#xD508;AI&#xB294; &#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xC744; &#xC774;&#xC720;&#xB85C; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xC624;&#xD508;AI &#xB0B4;&#xBD80;&#xC758; &#xD63C;&#xB780;&#xACFC; &#xAC08;&#xB4F1;&#xC774; &#xB4DC;&#xB7EC;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC791;&#xB144; 11&#xC6D4;, &#xC624;&#xD508;AI&#xC758; CEO &#xC0D8; &#xC62C;&#xD2B8;&#xB9CC;&#xC774; &#xD574;&#xACE0;&#xB418;&#xC5C8;&#xC73C;&#xB098;, &#xC9C1;&#xC6D0;&#xB4E4;&#xC758; &#xBC18;&#xBC1C;&#xB85C; &#xC77C;&#xC8FC;&#xC77C; &#xB9CC;&#xC5D0; &#xBCF5;&#xADC0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC62C;&#xD2B8;&#xB9CC;&#xC758; &#xD574;&#xACE0; &#xC774;&#xC720;&#xB294; &#xC784;&#xC6D0;&#xC9C4;&#xB4E4;&#xACFC;&#xC758; &#xBD88;&#xD654;&#xC640; &#xC18C;&#xD1B5; &#xBD80;&#xC7AC;&#xC600;&#xC73C;&#xB098;, &#xC774;&#xB294; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAC1C;&#xBC1C; &#xCCA0;&#xD559;&#xC758; &#xCC28;&#xC774;&#xC5D0;&#xC11C; &#xBE44;&#xB86F;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC0AC;&#xAC74;&#xC740; &#xC624;&#xD508;AI &#xB0B4;&#xBD80;&#xC758; &#xC2E0;&#xB8B0; &#xBB38;&#xC81C;&#xB97C; &#xB354;&#xC6B1; &#xBD80;&#xAC01;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F926;&#x200D;&#x2642;&#xFE0F;</p>
<p>&#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xAE30;&#xC220;&#xC740; &#xC6B0;&#xB9AC;&#xC758; &#xC0DD;&#xD65C;&#xC5D0; &#xD3B8;&#xB9AC;&#xD568;&#xC744; &#xAC00;&#xC838;&#xC624;&#xC9C0;&#xB9CC;, &#xADF8; &#xB4A4;&#xC5D0; &#xC228;&#xC740; &#xBCF4;&#xC548; &#xBB38;&#xC81C;&#xB294; &#xC5EC;&#xC804;&#xD788; &#xD574;&#xACB0;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC0C1;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. &#x1F635;&#x200D;&#x1F4AB;</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p><strong>&#x26A0;&#xFE0F; &#xC0C8;&#xB85C;&#xC6B4; APT &#xADF8;&#xB8F9; &#x2018;CloudSorcerer&#x2019; &#xB4F1;&#xC7A5;: &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xAE30;&#xBC18;&#xC758; &#xC815;&#xAD50;&#xD55C; &#xACF5;&#xACA9;</strong></p>
</blockquote>
<p>2024.07.08 | The Hacker News | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/07/15/romi0x/newsletter0715/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://thehackernews.com/2024/07/new-apt-group-cloudsorcerer-targets.html">&#xD574;&#xCEE4;&#xB274;&#xC2A4;</a>&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xCD5C;&#xADFC; &#x2018;CloudSorcerer&#x2019;&#xB77C;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; APT(Advanced Persistent Threat) &#xADF8;&#xB8F9;&#xC774; &#xB4F1;&#xC7A5;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB4E4;&#xC740; &#xC8FC;&#xB85C; &#xB7EC;&#xC2DC;&#xC544;&#x1F1F7;&#x1F1FA;&#xC758; &#xB2E8;&#xCCB4;&#xB4E4;&#xC744; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C; &#xACF5;&#xACA9;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4;&#xB97C;<a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">C&amp;C(Command and Control</a>) &#xC11C;&#xBC84;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD2B9;&#xC9D5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB4E4;&#xC758; &#xACF5;&#xACA9; &#xBC29;&#xC2DD;&#xC740; CloudWizard&#xB77C;&#xB294; &#xB2E4;&#xB978; &#xACF5;&#xACA9; &#xB2E8;&#xCCB4;&#xC640; &#xC720;&#xC0AC;&#xC810;&#xC774; &#xB9CE;&#xC73C;&#xB098;, &#xBA40;&#xC6E8;&#xC5B4; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xC5D0; &#xC0C1;&#xB2F9;&#xD55C; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC5B4; &#xB3D9;&#xC77C; &#xADF8;&#xB8F9;&#xC73C;&#xB85C; &#xBCF4;&#xAE30;&#xB294; &#xC5B4;&#xB835;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#x1F914;</p>
<p>&#xD604;&#xC7AC;&#xB85C;&#xC120; &#xD0C0;&#xAC9F;&#xC5D0; &#xCE68;&#xD22C;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB41C; &#xC815;&#xD655;&#xD55C; &#xBC29;&#xBC95;&#xC740; &#xC54C;&#xB824;&#xC9C0;&#xC9C0; &#xC54A;&#xC558;&#xC9C0;&#xB9CC;, &#xCD08;&#xAE30; &#xC811;&#xADFC;&#xC740; &#xBC31;&#xB3C4;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xB9CC; &#xBC1D;&#xD600;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC31;&#xB3C4;&#xC5B4;&#xB294; &#xD53C;&#xD574;&#xC790;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD558;&#xACE0; &#xD30C;&#xC77C; &#xBC0F; &#xD3F4;&#xB354; &#xC5F4;&#xAC70;, &#xC178; &#xBA85;&#xB839; &#xC2E4;&#xD589;, &#xD30C;&#xC77C; &#xC791;&#xC5C5; &#xC218;&#xD589;, &#xCD94;&#xAC00; &#xD398;&#xC774;&#xB85C;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.&#x1F608;</p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p><strong>&#x1F5E3;&#xFE0F; &#xAC1C;&#xC778; &#xC2E4;&#xBB3C;&#xC0AC;&#xC9C4;&#xC5D0; &#xC2E0;&#xBD84;&#xC99D;&#xB7;&#xC5EC;&#xAD8C;&#xAE4C;&#xC9C0; &#xB178;&#xCD9C;&#x2026;&#xC0AC;&#xAC01;&#xC9C0;&#xB300; &#xB193;&#xC778; &#xAC1C;&#xBC1C; &#xC11C;&#xBC84;</strong></p>
</blockquote>
<p>2024.07.09 | &#xC804;&#xC790;&#xC2E0;&#xBB38;  | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.etnews.com/20240708000171">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a><br><img src="/2024/07/15/romi0x/newsletter0715/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.criminalip.io/2024/07/05/kyc-system/">Criminal IP</a>&#xC5D0; &#xB530;&#xB974;&#xBA74;, &#xC57D; 1&#xB9CC;&#xC5EC; &#xAC74;&#xC758; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xB178;&#xCD9C;&#xD55C; &#xACE0;&#xAC1D;&#xD655;&#xC778;(<a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;">KYC</a>) &#xC11C;&#xBC84;&#xAC00; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>KYC &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC218;&#xC9D1;&#xB41C; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xB294; &#xC2E0;&#xBD84;&#xC99D;, &#xC5EC;&#xAD8C;, &#xC2E0;&#xBD84; &#xD655;&#xC778;&#xC744; &#xC704;&#xD55C; &#xD604;&#xC7AC; &#xBCF8;&#xC778; &#xC0AC;&#xC9C4; &#xB4F1; &#xB9CE;&#xC740; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xAC00; &#xAD00;&#xB9AC; &#xBBF8;&#xD761;&#xC73C;&#xB85C; &#xC778;&#xD574; KYC &#xC778;&#xC99D; &#xC11C;&#xBC84;&#xC640; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBB34;&#xBC29;&#xBE44;&#xB85C; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xB178;&#xCD9C;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F631;</p>
<p>2024&#xB144; 7&#xC6D4; 2&#xC77C;&#xC5D0; &#xBC1C;&#xACAC;&#xB41C; KYC &#xC11C;&#xBC84;&#xB294; &#xACE0;&#xAC1D;&#xC758; &#xC2E0;&#xBD84;&#xC99D;, &#xC5EC;&#xAD8C;&#xC0AC;&#xC9C4;, &#xC774;&#xB984;, &#xC0DD;&#xB144;&#xC6D4;&#xC77C; &#xB4F1;&#xC774; &#xB178;&#xCD9C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC11C;&#xBC84;&#xC5D0;&#xB294; &#xC804; &#xC138;&#xACC4;&#xC5D0;&#xC11C; &#xC218;&#xC9D1;&#xB41C; &#xC57D; 1&#xB9CC; &#xAC74;&#xC758; &#xC720;&#xC800; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xC73C;&#xBA70;, &#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xC720;&#xC800; &#xC218;&#xB3C4; 684&#xBA85;&#xC5D0; &#xB2EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xC11C;&#xBC84;&#xB294; &#xC811;&#xADFC; &#xC81C;&#xC5B4;&#xAC00; &#xC804;&#xD600; &#xC5C6;&#xC5B4; &#xB204;&#xAD6C;&#xB098; &#xC720;&#xC800;&#xC758; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xB97C; &#xC5F4;&#xB78C;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD0DC;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD655;&#xC778; &#xACB0;&#xACFC; &#xC774; &#xC11C;&#xBC84;&#xB294; &#xC2E4;&#xC81C; &#xAC00;&#xB3D9; &#xC911;&#xC778; &#xB77C;&#xC774;&#xBE0C; &#xC11C;&#xBC84;&#xAC00; &#xC544;&#xB2CC; &#xAC1C;&#xBC1C;&#xC6A9; &#xC11C;&#xBC84;&#xB85C; &#xCD94;&#xC815;&#xB418;&#xBA70;, &#xBC29;&#xD654;&#xBCBD; &#xC124;&#xC815; &#xBBF8;&#xD761;&#xC73C;&#xB85C; &#xB178;&#xCD9C;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC778;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#x1F633;</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><ul>
<li>KYC(Know Your Customer)<ul>
<li>&#xAE08;&#xC735;&#xAD8C;&#xACFC; &#xAC00;&#xC0C1;&#xD654;&#xD3D0; &#xAC70;&#xB798;&#xC18C;&#xC5D0;&#xC11C; &#xACE0;&#xAC1D;&#xC774; &#xBCF8;&#xC778; &#xACC4;&#xC815;&#xC784;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xC808;&#xCC28;&#xB85C;, &#xC2E0;&#xBD84;&#xC99D;&#xC774;&#xB098; &#xC5EC;&#xAD8C; &#xB4F1;&#xC744; &#xAE08;&#xC735;&#xD68C;&#xC0AC;&#xC5D0; &#xC81C;&#xCD9C;&#xD558;&#xB294; &#xBC29;&#xC2DD;</li>
</ul>
</li>
<li>C&amp;C(Command and Control)<ul>
<li>&#xAC10;&#xC5FC;&#xB41C; &#xAE30;&#xACC4; &#xB610;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xACE0; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xB3C4;&#xAD6C;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xACF5;&#xACA9; &#xC720;&#xD615;</li>
</ul>
</li>
</ul>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=131161&amp;direct=mobile">&#xC804; &#xC138;&#xACC4; &#xAC00;&#xC7A5; &#xB9CE;&#xC740; &#xBCF4;&#xC548;&#xCDE8;&#xC57D;&#xC810; &#xC218;&#xB97C; &#xACF5;&#xAC1C;&#xD55C; &#xBCF4;&#xC548;&#xAE30;&#xC5C5;&#xC740;? &#xD2B8;&#xB80C;&#xB4DC;&#xB9C8;&#xC774;&#xD06C;&#xB85C;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=131200">&#xB2E4;&#xD06C;&#xC6F9;&#xC5D0; &#xACF5;&#xAC1C;&#xB41C; &#xC5ED;&#xC0AC;&#xC0C1; &#xAC00;&#xC7A5; &#xD070; &#xBE44;&#xBC00;&#xBC88;&#xD638; DB, &#xB85D;&#xC720;2024</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=131174">&#xC0C8;&#xB85C;&#xC6B4; &#xBD07;&#xB137; &#xBA40;&#xC6E8;&#xC5B4; &#xC800;&#xADF8;&#xC5D0;&#xCE74;, &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xB2A5; &#xD0D1;&#xC7AC;&#xD55C; &#xCC44; &#xD65C;&#xB3D9; &#xC911;</a></li>
</ul>
<h2 id="&#xC774;&#xBC88;&#xC8FC;-&#xBCF4;&#xC548;&#xC6A9;&#xC5B4;-&#x1F425;"><a href="#&#xC774;&#xBC88;&#xC8FC;-&#xBCF4;&#xC548;&#xC6A9;&#xC5B4;-&#x1F425;" class="headerlink" title="&#xC774;&#xBC88;&#xC8FC; &#xBCF4;&#xC548;&#xC6A9;&#xC5B4; &#x1F425;"></a><strong>&#xC774;&#xBC88;&#xC8FC; &#xBCF4;&#xC548;&#xC6A9;&#xC5B4;</strong> &#x1F425;</h2><blockquote>
<p><strong>Ransomware-as-a-Service (RaaS)</strong></p>
</blockquote>
<p><img src="/2024/07/15/romi0x/newsletter0715/image4.png" srcset="/img/loading.gif" alt="&#xC0AC;&#xC9C4;"></p>
<p>RaaS&#xB294; <strong>&#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xACF5;&#xACA9;&#xC744; &#xC11C;&#xBE44;&#xC2A4; &#xD615;&#xD0DC;&#xB85C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xBAA8;&#xB378;</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>RaaS&#xB97C; &#xD1B5;&#xD574; &#xAE30;&#xC220; &#xC9C0;&#xC2DD;&#xC774; &#xBD80;&#xC871;&#xD55C; &#xBC94;&#xC8C4;&#xC790;&#xB3C4; &#xC27D;&#xAC8C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xBC30;&#xD3EC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; RaaS &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xACF5;&#xACA9;&#xC744; &#xACC4;&#xD68D;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xBA70;, &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC790;&#xB294; &#xC131;&#xACF5;&#xC801;&#xC778; &#xACF5;&#xACA9; &#xC2DC; &#xC218;&#xC775;&#xC744; &#xB098;&#xB220; &#xAC16;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, GandCrab&#xACFC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.nomios.com/resources/what-is-revil-ransomware/">REvil</a> &#xAC19;&#xC740; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; RaaS &#xD615;&#xD0DC;&#xB85C; &#xC81C;&#xACF5;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xCE5C;&#xD654;&#xC801;&#xC778; &#xB300;&#xC2DC;&#xBCF4;&#xB4DC;&#xC640; 24&#xC2DC;&#xAC04; &#xC9C0;&#xC6D0;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC5EC;, &#xB204;&#xAD6C;&#xB098; &#xC27D;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. GandCrab&#xC740; 2018&#xB144;&#xC5D0; &#xCC98;&#xC74C; &#xB4F1;&#xC7A5;&#xD558;&#xC5EC; &#xBE60;&#xB974;&#xAC8C; &#xD655;&#xC0B0;&#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xD604;&#xC7AC;&#xB294; &#xC0AC;&#xC2E4;&#xC0C1; &#xC790;&#xCDE8;&#xB97C; &#xAC10;&#xCD98; &#xC0C1;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. REvil&#xC740; &#xAC15;&#xB825;&#xD55C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xAC1C;&#xBC1C;&#xD558;&#xACE0; &#xB2E4;&#xD06C; &#xC6F9;&#xC5D0;&#xC11C; &#xD310;&#xB9E4;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xACF5;&#xAE09;&#xB9DD;&#xC744; &#xACF5;&#xACA9;&#xD558;&#xC5EC; &#xD070; &#xD53C;&#xD574;&#xB97C; &#xC785;&#xD614;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>RaaS&#xB294; &#xB0AE;&#xC740; &#xC9C4;&#xC785; &#xC7A5;&#xBCBD;&#xACFC; &#xC218;&#xC775; &#xACF5;&#xC720; &#xBAA8;&#xB378; &#xB355;&#xBD84;&#xC5D0; &#xC0AC;&#xC774;&#xBC84; &#xBC94;&#xC8C4;&#xB97C; &#xCD09;&#xC9C4;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788;, &#xBC94;&#xC8C4;&#xC790;&#xB4E4;&#xC774; &#xAE30;&#xC220;&#xC801; &#xC9C0;&#xC2DD; &#xC5C6;&#xC774;&#xB3C4; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4;, &#xC0AC;&#xC774;&#xBC84; &#xACF5;&#xACA9;&#xC758; &#xBE48;&#xB3C4;&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. RaaS&#xB294; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xACF5;&#xACA9;&#xC744; &#xB354; &#xC870;&#xC9C1;&#xC801;&#xC774;&#xACE0; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xC5EC;, &#xAE30;&#xC5C5;&#xACFC; &#xAC1C;&#xC778;&#xC5D0;&#xAC8C; &#xD070; &#xC704;&#xD611;&#xC774; &#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                  <a class="hover-with-bg" href="/tags/romi0x/">romi0x</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_romi0x.jpg" srcset="/img/loading.gif" alt="romi0x">
                  </div>

                  <div class="link-text">
                    <div class="link-title">romi0x</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/romi0x">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/07/17/l0ch/2024-07-17/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-38519 : youtube-dl ë° yt-dlpì˜ Path Traversalë¡œ ì¸í•œ RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/07/10/pwndorei/2024-07-10/">
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2024-36991 : Splunk Enterpriseì˜ Path Traversalë¡œ ì¸í•œ ìž„ì˜ íŒŒì¼ ì½ê¸° ì·¨ì•½ì </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/07/15/romi0x/newsletter0715/';
        this.page.identifier = '/2024/07/15/romi0x/newsletter0715/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[í•´í‚¹ì§¹ì§¹ðŸ£] 1ë…„ë™ì•ˆ í•´í‚¹ ì‚¬ê³ ë¥¼ ìˆ¨ê¸´ ì—…ê³„ 1ìœ„ ê¸°ì—…?!&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
