

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC; &amp;#xB4DC;&amp;#xB9AC;&amp;#xB294; bekim&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC790;&amp;#xB8CC;&amp;#xC758; &amp;#xC591;&amp;#xC774; &amp;#xB9CE;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC881;&amp;#xD600;&amp;#xAC08;&amp;#xC9C0; &amp;#xACE0;&amp;#xBBFC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image.png&#34; alt&gt;&lt;br&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD758;&amp;#xB7EC;&amp;#xAC08;&amp;#xC9C0;&amp;#xB294; &amp;#xBBF8;&amp;#xB798;&amp;#xC758; &amp;#xC81C;&amp;#xAC00; &amp;#xACB0;&amp;#xC815;&amp;#xD560;&amp;#xD14C;&amp;#xB2C8;, &amp;#xAC70;&amp;#xB450;&amp;#xC808;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xC791;&amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System&#34;&gt;&lt;a href=&#34;#1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System&#34; class=&#34;headerlink&#34; title=&#34;1. Bitcoin: A Peer-to-Peer Electronic Cash System&#34;&gt;&lt;/a&gt;1. Bitcoin: A Peer-to-Peer Electronic Cash System&lt;/h1&gt;&lt;p&gt;2008&amp;#xB144; 10&amp;#xC6D4;, &amp;#x201C;&amp;#xC0AC;&amp;#xD1A0;&amp;#xC2DC; &amp;#xB098;&amp;#xCE74;&amp;#xBAA8;&amp;#xD1A0;&amp;#x201D; &amp;#xB77C;&amp;#xB294; &amp;#xAC00;&amp;#xBA85;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC6D0; &amp;#xBBF8;&amp;#xC0C1;&amp;#xC758; &amp;#xC778;&amp;#xBB3C;&amp;#xC774; Bitcoin: A Peer-to-Peer Electronic Cash System&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; The Cryptography Mailing List&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB17C;&amp;#xBB38;&amp;#xC740; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC81C; 3&amp;#xC790;(ex. &amp;#xC740;&amp;#xD589;)&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC874; &amp;#xBC29;&amp;#xC2DD; &amp;#xB300;&amp;#xC2E0;, &amp;#xAC1C;&amp;#xC778; &amp;#xAC04;(P2P) &amp;#xC9C1;&amp;#xC811; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC804;&amp;#xC790; &amp;#xD654;&amp;#xD3D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xC81C;&amp;#xC548;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;2-The-limitations-of-existing-trust-based-systems&#34;&gt;&lt;a href=&#34;#2-The-limitations-of-existing-trust-based-systems&#34; class=&#34;headerlink&#34; title=&#34;2. The limitations of existing trust-based systems&#34;&gt;&lt;/a&gt;2. The limitations of existing trust-based systems&lt;/h1&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xC874; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD654;&amp;#xD3D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xC774;&amp;#xC911; &amp;#xC9C0;&amp;#xBD88; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD654;&amp;#xD3D0;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801;&amp;#xC778; &amp;#xD654;&amp;#xD3D0;&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC790;&amp;#xC0B0;&amp;#xC744; &amp;#xC911;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC911;&amp;#xC559; &amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xC911;&amp;#xC559; &amp;#xC9D1;&amp;#xC911;&amp;#xC2DD; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC81C; 3&amp;#xC790;&amp;#xAC00; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xC911;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB798; &amp;#xC218;&amp;#xC218;&amp;#xB8CC;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCD94;&amp;#xAC00; &amp;#xBE44;&amp;#xC6A9;&amp;#xC740;, &amp;#xC18C;&amp;#xC561; &amp;#xAC70;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xD788; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC70;&amp;#xB798;&amp;#xAC00; &amp;#xC911;&amp;#xC559; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCC98;&amp;#xB9AC; &amp;#xC18D;&amp;#xB3C4; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC774; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC911;&amp;#xC559; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xAC70;&amp;#xB098; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC804;&amp;#xCCB4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xC704;&amp;#xD5D8;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; Single Point of Failure &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F47B;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC740; Hashchain&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC758; &amp;#x2018;Transaction(&amp;#xAC70;&amp;#xB798;)&amp;#xC740; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; Hashchain&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xBA70;, &amp;#xC11C;&amp;#xB85C; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD615;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xC124;&amp;#xACC4;&amp;#xB294; &amp;#xC774;&amp;#xC911; &amp;#xC9C0;&amp;#xBD88; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC911;&amp;#xC559; &amp;#xAE30;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774; &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAC80;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;3-HashChain&#34;&gt;&lt;a href=&#34;#3-HashChain&#34; class=&#34;headerlink&#34; title=&#34;3. HashChain&#34;&gt;&lt;/a&gt;3. HashChain&lt;/h1&gt;&lt;p&gt;Hashchain&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xD574;&amp;#xC2DC; &amp;#xD568;&amp;#xC218; h&amp;#xB97C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; x&amp;#xC5D0; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC12;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs lisp&#34;&gt;h(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;x&lt;/span&gt;))))&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xC2DC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; 4&amp;#xBC88; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xAE38;&amp;#xC774;&amp;#xAC00; 4&amp;#xC778; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &lt;script type=&#34;math/tex&#34;&gt;h^4(x)&lt;/script&gt;&amp;#xB85C; &amp;#xD45C;&amp;#xAE30;&amp;#xD558;&amp;#xBA70;, &amp;#xAC01; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC12;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xAC80;&amp;#xC99D; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB610;&amp;#xD55C; &amp;#xC774;&amp;#xB7F0; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574;&amp;#xC11C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC774;&amp;#xC804; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image1.png&#34; alt&gt;&lt;br&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#x1F576;&amp;#xFE0F;&lt;br&gt;&lt;strong&gt;Block 100&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC804; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12; Hash(Block 99), &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Payload 100) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Nonce (&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC12;)&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Block 100&amp;#xC758; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;strong&gt;Block 101&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Block 101&amp;#xC758; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; Block 100&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; Payload 101&amp;#xACFC; Nonce&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; Block 101&amp;#xB9CC;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;strong&gt;Block 102&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Block 102&amp;#xB294; Block 101&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xC5F0;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xCCB4;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD615;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Block 100&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Payload 100)&amp;#xAC00; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, Block 101&amp;#xC774; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; Block 100&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC838; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xACB0;&amp;#xAD6D; Block 101 &amp;#xC774;&amp;#xD6C4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB420; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-1-Transaction&#34;&gt;&lt;a href=&#34;#3-1-Transaction&#34; class=&#34;headerlink&#34; title=&#34;3.1. Transaction&#34;&gt;&lt;/a&gt;3.1. Transaction&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;image source: Bitcoin: A Peer-to-Peer Electronic Cash System&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;, &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC758; Transaction&amp;#xB3C4; HashChain&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Transaction&amp;#xC740; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xC1A1;&amp;#xAE08;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC774;&amp;#xB3D9;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xB2E8;&amp;#xC704;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC70;&amp;#xB798; &amp;#xAE30;&amp;#xB85D;&amp;#xB4E4;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBA70;, &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xBD84;&amp;#xC0B0; &amp;#xC6D0;&amp;#xC7A5;(ledger)&lt;/strong&gt;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; Transaction&amp;#xC740; &lt;strong&gt;&amp;#xC774;&amp;#xC804; Transaction&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&lt;/strong&gt;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC;, Owner 1&amp;#xC758; Transaction&amp;#xC5D0;&amp;#xB294; Owner 0&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4;, Owner 1&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xAD8C;&amp;#xC744; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC804; &amp;#xBC1B;&amp;#xC558;&amp;#xC74C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; Transaction&amp;#xC5D0;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; Owner&amp;#xC758; &lt;strong&gt;&amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;(Public key)&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;(Digital Signature)&lt;/strong&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC5EC;, Transaction&amp;#xC774; &amp;#xC704;&amp;#xC870;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; Owner 2&amp;#xB294; Owner 1&amp;#xC758; Transaction&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0;, &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Transaction&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; Transaction&amp;#xB4E4;&amp;#xC740; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC774;&amp;#xB8E8;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC778;&amp;#xD574;, &amp;#xD558;&amp;#xB098;&amp;#xC758; Transaction&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xBA74;, &amp;#xC774;&amp;#xD6C4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;4-Proof-of-Work-PoW-&amp;#xC791;&amp;#xC5C5;-&amp;#xC99D;&amp;#xBA85;&#34;&gt;&lt;a href=&#34;#4-Proof-of-Work-PoW-&amp;#xC791;&amp;#xC5C5;-&amp;#xC99D;&amp;#xBA85;&#34; class=&#34;headerlink&#34; title=&#34;4. Proof of Work (PoW, &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&#34;&gt;&lt;/a&gt;4. Proof of Work (PoW, &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&lt;/h1&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xBE14;&amp;#xB85D; &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC1A1;&amp;#xAE08;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Proof of Work (&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image3.png&#34; alt&gt;&lt;br&gt;&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#x201C;&amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC74C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#x201D;&lt;/strong&gt;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xACB0;&amp;#xD55C; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xACB0;&amp;#xD55C; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xAD8C;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xBA70;, &amp;#xBCF4;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xC559; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image4.png&#34; alt&gt;&lt;br&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; Nonce&amp;#xB77C;&amp;#xB294; &amp;#xAC12;(&amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xAC00; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;)&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xAC00;&amp;#xC11C; &amp;#xD574;&amp;#xC2DC; &amp;#xD37C;&amp;#xC990;(Hash Puzzle)&amp;#xC744; &amp;#xD480;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC2DC; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC774; 8&amp;#xAC1C;&amp;#xC758; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC815;&amp;#xB2F9;&amp;#xD558;&amp;#xAC8C; &amp;#xCC44;&amp;#xAD74;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD3C9;&amp;#xADE0; 10&amp;#xBD84;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88;&amp;#xC529; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB294; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;(Difficulty)&amp;#xB97C; &amp;#xC870;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xB294; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC5D0;&amp;#xC11C; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; 0&amp;#xC758; &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294;&amp;#xB370;, 0&amp;#xC758; &amp;#xAC1C;&amp;#xC218;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C8;&amp;#xC218;&amp;#xB85D; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xACC4;&amp;#xC0B0;&amp;#xB7C9;&amp;#xC774; &amp;#xB354; &amp;#xB298;&amp;#xAC8C; &amp;#xB3FC;&amp;#xC694;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC2DC;&amp;#xC758; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC774; 8&amp;#xAC1C;&amp;#xC758; 0&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD604;&amp;#xC7AC;(2024&amp;#xB144; &amp;#xAE30;&amp;#xC900;) &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xB294; &amp;#xB354; &amp;#xB192;&amp;#xC544;&amp;#xC838;&amp;#xC11C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC5D0; 19&amp;#xAC1C;&amp;#xC758; 0&amp;#xC774; &amp;#xC694;&amp;#xAD6C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB9C9;&amp;#xB300;&amp;#xD55C; &amp;#xACC4;&amp;#xC0B0; &amp;#xC790;&amp;#xC6D0;&amp;#xACFC; &amp;#xC804;&amp;#xB825;&amp;#xC774; &amp;#xD544;&amp;#xC694; &amp;#xBA70;, &amp;#xC624;&amp;#xB298;&amp;#xB0A0;&amp;#xC5D0;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB85C;&amp;#xB294; &amp;#xCC44;&amp;#xAD74; &amp;#xACBD;&amp;#xC7C1;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, Longest chain rule (&amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778; &amp;#xC6D0;&amp;#xCE59;)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xD569;&amp;#xC758;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3D5;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Image Source: The longest chain accounts for the greatest PoW effort and is admitted as the main chain, ResearchGate.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB450; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; fork&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xD3EC;&amp;#xD06C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xACBD;&amp;#xC6B0; longest chain rule&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;(PoW)&amp;#xC774; &amp;#xD22C;&amp;#xC785;&amp;#xB41C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xBA54;&amp;#xC778; &amp;#xCCB4;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xACC4;&amp;#xC0B0; &amp;#xC790;&amp;#xC6D0;&amp;#xC744; &amp;#xC18C;&amp;#xBAA8;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xCCB4;&amp;#xC778;&amp;#xC784;&amp;#xC744; &amp;#xC778;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;, &amp;#xACBD;&amp;#xC7C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0C8;&amp;#xB77D;&amp;#xD55C; &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC740; Stale Block(&amp;#xBC84;&amp;#xB824;&amp;#xC9C4; &amp;#xBE14;&amp;#xB85D;)&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB418;&amp;#xC5B4; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xC774;&amp;#xD6C4; main chain&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xACFC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xD569;&amp;#xC758;&amp;#xB97C; &amp;#xC774;&amp;#xB8F0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F646;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xB97C; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xD575;&amp;#xC2EC; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xAE00;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB113;&amp;#xC740; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB918;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;(Proof of Work) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD569;&amp;#xC758; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC811;&amp;#xD558;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xAE00;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xAE30;&amp;#xB97C; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F600;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34;&gt;&lt;a href=&#34;#&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34;&gt;&lt;/a&gt;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC0B0; &amp;#xC6D0;&amp;#xC7A5;(ledger): &amp;#xBAA8;&amp;#xB4E0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xB098;&amp;#xB220; &amp;#xAC00;&amp;#xC9C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC70;&amp;#xB798; &amp;#xAE30;&amp;#xB85D;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;: &amp;#xAC1C;&amp;#xC778; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC804;&amp;#xC790; &amp;#xC11C;&amp;#xBA85;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://bitaps.com/&#34;&gt;https://bitaps.com/&lt;/a&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Blockchain Basics: Bitcoin and Beyond (ko) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC0C8;&amp;#xB85C; &amp;#xC778;&amp;#xC0AC; &amp;#xB4DC;&amp;#xB9AC;&amp;#xB294; bekim&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC790;&amp;#xB8CC;&amp;#xC758; &amp;#xC591;&amp;#xC774; &amp;#xB9CE;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, &amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC881;&amp;#xD600;&amp;#xAC08;&amp;#xC9C0; &amp;#xACE0;&amp;#xBBFC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image.png&#34; alt&gt;&lt;br&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC218;&amp;#xC801;&amp;#xC778; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBA3C;&amp;#xC800; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD758;&amp;#xB7EC;&amp;#xAC08;&amp;#xC9C0;&amp;#xB294; &amp;#xBBF8;&amp;#xB798;&amp;#xC758; &amp;#xC81C;&amp;#xAC00; &amp;#xACB0;&amp;#xC815;&amp;#xD560;&amp;#xD14C;&amp;#xB2C8;, &amp;#xAC70;&amp;#xB450;&amp;#xC808;&amp;#xBBF8;&amp;#xD558;&amp;#xACE0; &amp;#xC2DC;&amp;#xC791;&amp;#xD560;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System&#34;&gt;&lt;a href=&#34;#1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System&#34; class=&#34;headerlink&#34; title=&#34;1. Bitcoin: A Peer-to-Peer Electronic Cash System&#34;&gt;&lt;/a&gt;1. Bitcoin: A Peer-to-Peer Electronic Cash System&lt;/h1&gt;&lt;p&gt;2008&amp;#xB144; 10&amp;#xC6D4;, &amp;#x201C;&amp;#xC0AC;&amp;#xD1A0;&amp;#xC2DC; &amp;#xB098;&amp;#xCE74;&amp;#xBAA8;&amp;#xD1A0;&amp;#x201D; &amp;#xB77C;&amp;#xB294; &amp;#xAC00;&amp;#xBA85;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC6D0; &amp;#xBBF8;&amp;#xC0C1;&amp;#xC758; &amp;#xC778;&amp;#xBB3C;&amp;#xC774; Bitcoin: A Peer-to-Peer Electronic Cash System&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; The Cryptography Mailing List&amp;#xC5D0; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB17C;&amp;#xBB38;&amp;#xC740; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC81C; 3&amp;#xC790;(ex. &amp;#xC740;&amp;#xD589;)&amp;#xC5D0; &amp;#xC758;&amp;#xC874;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC874; &amp;#xBC29;&amp;#xC2DD; &amp;#xB300;&amp;#xC2E0;, &amp;#xAC1C;&amp;#xC778; &amp;#xAC04;(P2P) &amp;#xC9C1;&amp;#xC811; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC804;&amp;#xC790; &amp;#xD654;&amp;#xD3D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xC81C;&amp;#xC548;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h1 id=&#34;2-The-limitations-of-existing-trust-based-systems&#34;&gt;&lt;a href=&#34;#2-The-limitations-of-existing-trust-based-systems&#34; class=&#34;headerlink&#34; title=&#34;2. The limitations of existing trust-based systems&#34;&gt;&lt;/a&gt;2. The limitations of existing trust-based systems&lt;/h1&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xC874; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD654;&amp;#xD3D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB85C; &amp;#xC774;&amp;#xC911; &amp;#xC9C0;&amp;#xBD88; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD654;&amp;#xD3D0;&amp;#xB294; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC801;&amp;#xC778; &amp;#xD654;&amp;#xD3D0;&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC790;&amp;#xC0B0;&amp;#xC744; &amp;#xC911;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC774;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC911;&amp;#xC559; &amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB7F0; &amp;#xC911;&amp;#xC559; &amp;#xC9D1;&amp;#xC911;&amp;#xC2DD; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC81C; 3&amp;#xC790;&amp;#xAC00; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xC911;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB798; &amp;#xC218;&amp;#xC218;&amp;#xB8CC;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xCD94;&amp;#xAC00; &amp;#xBE44;&amp;#xC6A9;&amp;#xC740;, &amp;#xC18C;&amp;#xC561; &amp;#xAC70;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xD788; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC70;&amp;#xB798;&amp;#xAC00; &amp;#xC911;&amp;#xC559; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xAC70;&amp;#xCE58;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCC98;&amp;#xB9AC; &amp;#xC18D;&amp;#xB3C4; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC774; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC5B4;&amp;#xC694;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC911;&amp;#xC559; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xAC70;&amp;#xB098; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC804;&amp;#xCCB4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xC704;&amp;#xD5D8;&amp;#xC5D0; &amp;#xBE60;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; Single Point of Failure &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F47B;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC740; Hashchain&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC758; &amp;#x2018;Transaction(&amp;#xAC70;&amp;#xB798;)&amp;#xC740; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; Hashchain&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xBA70;, &amp;#xC11C;&amp;#xB85C; &amp;#xAC15;&amp;#xB825;&amp;#xD558;&amp;#xAC8C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD615;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xC124;&amp;#xACC4;&amp;#xB294; &amp;#xC774;&amp;#xC911; &amp;#xC9C0;&amp;#xBD88; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC911;&amp;#xC559; &amp;#xAE30;&amp;#xAD00; &amp;#xC5C6;&amp;#xC774; &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xAC80;&amp;#xC99D; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;3-HashChain&#34;&gt;&lt;a href=&#34;#3-HashChain&#34; class=&#34;headerlink&#34; title=&#34;3. HashChain&#34;&gt;&lt;/a&gt;3. HashChain&lt;/h1&gt;&lt;p&gt;Hashchain&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xD574;&amp;#xC2DC; &amp;#xD568;&amp;#xC218; h&amp;#xB97C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; x&amp;#xC5D0; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC12;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&lt;br&gt;&lt;pre&gt;&lt;code class=&#34;hljs lisp&#34;&gt;h(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;h&lt;/span&gt;(&lt;span class=&#34;hljs-name&#34;&gt;x&lt;/span&gt;))))&lt;/code&gt;&lt;/pre&gt;&lt;br&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD574;&amp;#xC2DC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; 4&amp;#xBC88; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74;, &amp;#xAE38;&amp;#xC774;&amp;#xAC00; 4&amp;#xC778; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &lt;script type=&#34;math/tex&#34;&gt;h^4(x)&lt;/script&gt;&amp;#xB85C; &amp;#xD45C;&amp;#xAE30;&amp;#xD558;&amp;#xBA70;, &amp;#xAC01; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xAC12;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xB2E8;&amp;#xACC4;&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801; &amp;#xAC80;&amp;#xC99D; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB610;&amp;#xD55C; &amp;#xC774;&amp;#xB7F0; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574;&amp;#xC11C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC774;&amp;#xC804; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image1.png&#34; alt&gt;&lt;br&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;. &amp;#x1F576;&amp;#xFE0F;&lt;br&gt;&lt;strong&gt;Block 100&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xC804; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12; Hash(Block 99), &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Payload 100) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Nonce (&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC5D0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC12;)&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Block 100&amp;#xC758; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;strong&gt;Block 101&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Block 101&amp;#xC758; &amp;#xD5E4;&amp;#xB354;&amp;#xC5D0;&amp;#xB294; Block 100&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; Payload 101&amp;#xACFC; Nonce&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; Block 101&amp;#xB9CC;&amp;#xC758; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;strong&gt;Block 102&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; Block 102&amp;#xB294; Block 101&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xC5EC; &amp;#xC5F0;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD559;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xCCB4;&amp;#xC778; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD615;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, Block 100&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;(Payload 100)&amp;#xAC00; &amp;#xBCC0;&amp;#xACBD;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, Block 101&amp;#xC774; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; Block 100&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC838; &amp;#xC720;&amp;#xD6A8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xB418;&amp;#xACE0;, &amp;#xACB0;&amp;#xAD6D; Block 101 &amp;#xC774;&amp;#xD6C4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB420; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;3-1-Transaction&#34;&gt;&lt;a href=&#34;#3-1-Transaction&#34; class=&#34;headerlink&#34; title=&#34;3.1. Transaction&#34;&gt;&lt;/a&gt;3.1. Transaction&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;image source: Bitcoin: A Peer-to-Peer Electronic Cash System&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;, &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC758; Transaction&amp;#xB3C4; HashChain&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB530;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Transaction&amp;#xC740; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xC1A1;&amp;#xAE08;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC774;&amp;#xB3D9;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xB2E8;&amp;#xC704;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC70;&amp;#xB798; &amp;#xAE30;&amp;#xB85D;&amp;#xB4E4;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBA70;, &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xBD84;&amp;#xC0B0; &amp;#xC6D0;&amp;#xC7A5;(ledger)&lt;/strong&gt;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; Transaction&amp;#xC740; &lt;strong&gt;&amp;#xC774;&amp;#xC804; Transaction&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&lt;/strong&gt;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC;, Owner 1&amp;#xC758; Transaction&amp;#xC5D0;&amp;#xB294; Owner 0&amp;#xC758; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4;, Owner 1&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC790;&amp;#xC0B0;&amp;#xC758; &amp;#xC18C;&amp;#xC720;&amp;#xAD8C;&amp;#xC744; &amp;#xD569;&amp;#xBC95;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC804; &amp;#xBC1B;&amp;#xC558;&amp;#xC74C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; Transaction&amp;#xC5D0;&amp;#xB294; &amp;#xD604;&amp;#xC7AC; Owner&amp;#xC758; &lt;strong&gt;&amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;(Public key)&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;(Digital Signature)&lt;/strong&gt;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC5EC;, Transaction&amp;#xC774; &amp;#xC704;&amp;#xC870;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; Owner 2&amp;#xB294; Owner 1&amp;#xC758; Transaction&amp;#xC744; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0;, &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Transaction&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; Transaction&amp;#xB4E4;&amp;#xC740; &amp;#xC5F0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xC2DC; &amp;#xCCB4;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xC774;&amp;#xB8E8;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC778;&amp;#xD574;, &amp;#xD558;&amp;#xB098;&amp;#xC758; Transaction&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xBA74;, &amp;#xC774;&amp;#xD6C4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC774; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB418;&amp;#xC5B4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;4-Proof-of-Work-PoW-&amp;#xC791;&amp;#xC5C5;-&amp;#xC99D;&amp;#xBA85;&#34;&gt;&lt;a href=&#34;#4-Proof-of-Work-PoW-&amp;#xC791;&amp;#xC5C5;-&amp;#xC99D;&amp;#xBA85;&#34; class=&#34;headerlink&#34; title=&#34;4. Proof of Work (PoW, &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&#34;&gt;&lt;/a&gt;4. Proof of Work (PoW, &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&lt;/h1&gt;&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xBE14;&amp;#xB85D; &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD654;&amp;#xD3D0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC1A1;&amp;#xAE08;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD575;&amp;#xC2EC; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC774; &amp;#xBC14;&amp;#xB85C; Proof of Work (&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image3.png&#34; alt&gt;&lt;br&gt;&amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC744; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC218;&amp;#xD559;&amp;#xC801; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#x201C;&amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD588;&amp;#xC74C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#x201D;&lt;/strong&gt;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xACB0;&amp;#xD55C; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBA3C;&amp;#xC800; &amp;#xD574;&amp;#xACB0;&amp;#xD55C; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB294; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xAD8C;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC73C;&amp;#xBA70;, &amp;#xBCF4;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&amp;#xC744; &amp;#xBC1B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC70;&amp;#xB798;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xC559; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &amp;#xB3D9;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image4.png&#34; alt&gt;&lt;br&gt;&amp;#xC704; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; Nonce&amp;#xB77C;&amp;#xB294; &amp;#xAC12;(&amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xAC00; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;)&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xBCC0;&amp;#xACBD;&amp;#xD574;&amp;#xAC00;&amp;#xC11C; &amp;#xD574;&amp;#xC2DC; &amp;#xD37C;&amp;#xC990;(Hash Puzzle)&amp;#xC744; &amp;#xD480;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC2DC; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC774; 8&amp;#xAC1C;&amp;#xC758; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC815;&amp;#xB2F9;&amp;#xD558;&amp;#xAC8C; &amp;#xCC44;&amp;#xAD74;&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD3C9;&amp;#xADE0; 10&amp;#xBD84;&amp;#xC5D0; &amp;#xD55C; &amp;#xBC88;&amp;#xC529; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB294; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;(Difficulty)&amp;#xB97C; &amp;#xC870;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xB294; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC5D0;&amp;#xC11C; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xB294; 0&amp;#xC758; &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294;&amp;#xB370;, 0&amp;#xC758; &amp;#xAC1C;&amp;#xC218;&amp;#xAC00; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C8;&amp;#xC218;&amp;#xB85D; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xACC4;&amp;#xC0B0;&amp;#xB7C9;&amp;#xC774; &amp;#xB354; &amp;#xB298;&amp;#xAC8C; &amp;#xB3FC;&amp;#xC694;. &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD574;&amp;#xC2DC;&amp;#xC758; &amp;#xCD9C;&amp;#xB825; &amp;#xAC12;&amp;#xC774; 8&amp;#xAC1C;&amp;#xC758; 0&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD604;&amp;#xC7AC;(2024&amp;#xB144; &amp;#xAE30;&amp;#xC900;) &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xB294; &amp;#xB354; &amp;#xB192;&amp;#xC544;&amp;#xC838;&amp;#xC11C; &amp;#xD574;&amp;#xC2DC; &amp;#xAC12;&amp;#xC5D0; 19&amp;#xAC1C;&amp;#xC758; 0&amp;#xC774; &amp;#xC694;&amp;#xAD6C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xB9C9;&amp;#xB300;&amp;#xD55C; &amp;#xACC4;&amp;#xC0B0; &amp;#xC790;&amp;#xC6D0;&amp;#xACFC; &amp;#xC804;&amp;#xB825;&amp;#xC774; &amp;#xD544;&amp;#xC694; &amp;#xBA70;, &amp;#xC624;&amp;#xB298;&amp;#xB0A0;&amp;#xC5D0;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB85C;&amp;#xB294; &amp;#xCC44;&amp;#xAD74; &amp;#xACBD;&amp;#xC7C1;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB824;&amp;#xC6CC;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xCCB4;&amp;#xC778; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0;, Longest chain rule (&amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778; &amp;#xC6D0;&amp;#xCE59;)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xD569;&amp;#xC758;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3D5;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;img src=&#34;/2025/01/26/bekim/blockchain/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Image Source: The longest chain accounts for the greatest PoW effort and is admitted as the main chain, ResearchGate.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCC44;&amp;#xAD74;&amp;#xC790;&amp;#xAC00; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB450; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; fork&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;, &amp;#xD3EC;&amp;#xD06C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB4E4;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xACBD;&amp;#xC6B0; longest chain rule&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;(PoW)&amp;#xC774; &amp;#xD22C;&amp;#xC785;&amp;#xB41C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xBA54;&amp;#xC778; &amp;#xCCB4;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC740; &amp;#xACC4;&amp;#xC0B0; &amp;#xC790;&amp;#xC6D0;&amp;#xC744; &amp;#xC18C;&amp;#xBAA8;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xCCB4;&amp;#xC778;&amp;#xC784;&amp;#xC744; &amp;#xC778;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;, &amp;#xACBD;&amp;#xC7C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0C8;&amp;#xB77D;&amp;#xD55C; &amp;#xCCB4;&amp;#xC778;&amp;#xC5D0; &amp;#xC18D;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC740; Stale Block(&amp;#xBC84;&amp;#xB824;&amp;#xC9C4; &amp;#xBE14;&amp;#xB85D;)&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB418;&amp;#xC5B4; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xD6A8;&amp;#xD654; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xD2B8;&amp;#xB79C;&amp;#xC7AD;&amp;#xC158;&amp;#xC740; &amp;#xC774;&amp;#xD6C4; main chain&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD3EC;&amp;#xD568;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xAE34; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xACFC; &amp;#xC2E0;&amp;#xB8B0;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0;, &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xB41C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xD569;&amp;#xC758;&amp;#xB97C; &amp;#xC774;&amp;#xB8F0; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F646;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBC31;&amp;#xC11C;&amp;#xB97C; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xC6D0;&amp;#xB9AC;&amp;#xC640; &amp;#xD575;&amp;#xC2EC; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD0C8;&amp;#xC911;&amp;#xC559;&amp;#xD654;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xAE00;&amp;#xC740; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB97C; &amp;#xB113;&amp;#xC740; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB918;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xB2E4;&amp;#xC74C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC791;&amp;#xC5C5; &amp;#xC99D;&amp;#xBA85;(Proof of Work) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xD569;&amp;#xC758; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &amp;#xBE14;&amp;#xB85D;&amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC811;&amp;#xD558;&amp;#xB294; &amp;#xB3C5;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xAE00;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xAE30;&amp;#xB97C; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F600;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34;&gt;&lt;a href=&#34;#&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&#34;&gt;&lt;/a&gt;&amp;#xCD08;&amp;#xC2EC;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778;&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC0B0; &amp;#xC6D0;&amp;#xC7A5;(ledger): &amp;#xBAA8;&amp;#xB4E0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xAC00; &amp;#xB098;&amp;#xB220; &amp;#xAC00;&amp;#xC9C4; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAC70;&amp;#xB798; &amp;#xAE30;&amp;#xB85D;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xC11C;&amp;#xBA85;: &amp;#xAC1C;&amp;#xC778; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xC804;&amp;#xC790; &amp;#xC11C;&amp;#xBA85;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://bitaps.com/&#34;&gt;https://bitaps.com/&lt;/a&gt;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xCF54;&amp;#xC778; &amp;#xBE14;&amp;#xB85D; &amp;#xC0DD;&amp;#xC131;&amp;#xC744; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/01/26/bekim/blockchain/ko/bitcoin.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/01/26/bekim/blockchain/ko/">

  <title>[Research] Blockchain Basics: Bitcoin and Beyond (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-01-26 17:00" pubdate>
      2025 1 26 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.8k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      56
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Blockchain Basics: Bitcoin and Beyond (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xC0C8;&#xB85C; &#xC778;&#xC0AC; &#xB4DC;&#xB9AC;&#xB294; bekim&#xC785;&#xB2C8;&#xB2E4;. &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xC8FC;&#xC81C;&#xB85C; &#xCC98;&#xC74C; &#xC5F0;&#xAD6C;&#xAE00;&#xC744; &#xC791;&#xC131;&#xD574;&#xBCF4;&#xB294;&#xB370;&#xC694;. &#xC790;&#xB8CC;&#xC758; &#xC591;&#xC774; &#xB9CE;&#xAE30;&#xB3C4; &#xD558;&#xACE0;, &#xC774; &#xC8FC;&#xC81C;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC881;&#xD600;&#xAC08;&#xC9C0; &#xACE0;&#xBBFC;&#xC774; &#xB9CE;&#xC558;&#xC5B4;&#xC694;.<br><img src="/2025/01/26/bekim/blockchain/ko/image.png" srcset="/img/loading.gif" alt><br>&#xADF8;&#xB798;&#xC11C; &#xC800;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xC774;&#xD574;&#xD558;&#xB294;&#xB370; &#xD544;&#xC218;&#xC801;&#xC778; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xBC31;&#xC11C;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xAD6C;&#xC870;&#xB97C; &#xBA3C;&#xC800; &#xC124;&#xBA85;&#xD574;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; &#xC5F0;&#xAD6C;&#xAE00;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xD758;&#xB7EC;&#xAC08;&#xC9C0;&#xB294; &#xBBF8;&#xB798;&#xC758; &#xC81C;&#xAC00; &#xACB0;&#xC815;&#xD560;&#xD14C;&#xB2C8;, &#xAC70;&#xB450;&#xC808;&#xBBF8;&#xD558;&#xACE0; &#xC2DC;&#xC791;&#xD560;&#xAC8C;&#xC694;.</p>
<h1 id="1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System"><a href="#1-Bitcoin-A-Peer-to-Peer-Electronic-Cash-System" class="headerlink" title="1. Bitcoin: A Peer-to-Peer Electronic Cash System"></a>1. Bitcoin: A Peer-to-Peer Electronic Cash System</h1><p>2008&#xB144; 10&#xC6D4;, &#x201C;&#xC0AC;&#xD1A0;&#xC2DC; &#xB098;&#xCE74;&#xBAA8;&#xD1A0;&#x201D; &#xB77C;&#xB294; &#xAC00;&#xBA85;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC2E0;&#xC6D0; &#xBBF8;&#xC0C1;&#xC758; &#xC778;&#xBB3C;&#xC774; Bitcoin: A Peer-to-Peer Electronic Cash System&#xC774;&#xB77C;&#xB294; &#xB17C;&#xBB38;&#xC744; The Cryptography Mailing List&#xC5D0; &#xBC1C;&#xD45C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB17C;&#xBB38;&#xC740; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xC81C; 3&#xC790;(ex. &#xC740;&#xD589;)&#xC5D0; &#xC758;&#xC874;&#xD558;&#xB294; &#xAE30;&#xC874; &#xBC29;&#xC2DD; &#xB300;&#xC2E0;, &#xAC1C;&#xC778; &#xAC04;(P2P) &#xC9C1;&#xC811; &#xAC70;&#xB798;&#xB97C; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xC804;&#xC790; &#xD654;&#xD3D0; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xC81C;&#xC548;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<h1 id="2-The-limitations-of-existing-trust-based-systems"><a href="#2-The-limitations-of-existing-trust-based-systems" class="headerlink" title="2. The limitations of existing trust-based systems"></a>2. The limitations of existing trust-based systems</h1><p>&#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xBC31;&#xC11C;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xC874; &#xB514;&#xC9C0;&#xD138; &#xD654;&#xD3D0; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xAC00;&#xC7A5; &#xD070; &#xBB38;&#xC81C;&#xB85C; &#xC774;&#xC911; &#xC9C0;&#xBD88; &#xBB38;&#xC81C;&#xB97C; &#xC5B8;&#xAE09;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xB514;&#xC9C0;&#xD138; &#xD654;&#xD3D0;&#xB294; &#xBB3C;&#xB9AC;&#xC801;&#xC778; &#xD654;&#xD3D0;&#xC640; &#xB2EC;&#xB9AC; &#xB3D9;&#xC77C;&#xD55C; &#xC790;&#xC0B0;&#xC744; &#xC911;&#xBCF5;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC774;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC911;&#xC559; &#xAE30;&#xAD00;&#xC774; &#xBAA8;&#xB4E0; &#xAC70;&#xB798;&#xB97C; &#xAC80;&#xC99D;&#xD574;&#xC57C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xB7F0; &#xC911;&#xC559; &#xC9D1;&#xC911;&#xC2DD; &#xBC29;&#xC2DD;&#xC5D0;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC5B4;&#xC694;. &#xC81C; 3&#xC790;&#xAC00; &#xAC70;&#xB798;&#xB97C; &#xC911;&#xC7AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC70;&#xB798; &#xC218;&#xC218;&#xB8CC;&#xC640; &#xAC19;&#xC740; &#xCD94;&#xAC00; &#xBE44;&#xC6A9;&#xC740;, &#xC18C;&#xC561; &#xAC70;&#xB798;&#xC5D0;&#xC11C; &#xD2B9;&#xD788; &#xBE44;&#xD6A8;&#xC728;&#xC801;&#xC774;&#xC5C8;&#xC5B4;&#xC694;. &#xB610;&#xD55C; &#xBAA8;&#xB4E0; &#xAC70;&#xB798;&#xAC00; &#xC911;&#xC559; &#xC11C;&#xBC84;&#xB97C; &#xAC70;&#xCE58;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2DC;&#xC2A4;&#xD15C; &#xCC98;&#xB9AC; &#xC18D;&#xB3C4; &#xCE21;&#xBA74;&#xC5D0;&#xC11C;&#xB3C4; &#xD6A8;&#xC728;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC84C;&#xC5B4;&#xC694;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC911;&#xC559; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xBB38;&#xC81C;&#xAC00; &#xC0DD;&#xAE30;&#xAC70;&#xB098; &#xC545;&#xC758;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD560; &#xACBD;&#xC6B0;, &#xC804;&#xCCB4; &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xC704;&#xD5D8;&#xC5D0; &#xBE60;&#xC9C8; &#xC218; &#xC788;&#xB294; Single Point of Failure &#xBB38;&#xC81C;&#xB3C4; &#xC874;&#xC7AC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#x1F47B;</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xBE44;&#xD2B8;&#xCF54;&#xC778;&#xC740; Hashchain&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C; &#xAD6C;&#xC870;&#xB97C; &#xB3C4;&#xC785;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE44;&#xD2B8;&#xCF54;&#xC778;&#xC758; &#x2018;Transaction(&#xAC70;&#xB798;)&#xC740; &#xC2E4;&#xC81C;&#xB85C; Hashchain&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD558;&#xBA70;, &#xC11C;&#xB85C; &#xAC15;&#xB825;&#xD558;&#xAC8C; &#xC5F0;&#xACB0;&#xB41C; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xD615;&#xC131;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xC774; &#xC124;&#xACC4;&#xB294; &#xC774;&#xC911; &#xC9C0;&#xBD88; &#xBB38;&#xC81C;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xBA74;&#xC11C;, &#xC911;&#xC559; &#xAE30;&#xAD00; &#xC5C6;&#xC774; &#xD0C8;&#xC911;&#xC559;&#xD654;&#xB41C; &#xAC80;&#xC99D; &#xACFC;&#xC815;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<h1 id="3-HashChain"><a href="#3-HashChain" class="headerlink" title="3. HashChain"></a>3. HashChain</h1><p>Hashchain&#xC740; &#xC554;&#xD638;&#xD559;&#xC801; &#xD574;&#xC2DC; &#xD568;&#xC218; h&#xB97C; &#xBB38;&#xC790;&#xC5F4; x&#xC5D0; &#xC5F0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC801;&#xC6A9;&#xD574;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xAC12;&#xC774;&#xC5D0;&#xC694;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;<br><pre><code class="hljs lisp">h(<span class="hljs-name">h</span>(<span class="hljs-name">h</span>(<span class="hljs-name">h</span>(<span class="hljs-name">x</span>))))</code></pre><br>&#xC640; &#xAC19;&#xC774; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB97C; 4&#xBC88; &#xC801;&#xC6A9;&#xD558;&#xBA74;, &#xAE38;&#xC774;&#xAC00; 4&#xC778; &#xD574;&#xC2DC; &#xCCB4;&#xC778;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <script type="math/tex">h^4(x)</script>&#xB85C; &#xD45C;&#xAE30;&#xD558;&#xBA70;, &#xAC01; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB41C; &#xAC12;&#xC740; &#xC774;&#xC804; &#xB2E8;&#xACC4;&#xC758; &#xD574;&#xC2DC; &#xACB0;&#xACFC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xAD6C;&#xC870;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xACE0;, &#xC554;&#xD638;&#xD559;&#xC801; &#xAC80;&#xC99D; &#xB9E4;&#xCEE4;&#xB2C8;&#xC998;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xB41C; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xB610;&#xD55C; &#xC774;&#xB7F0; &#xD574;&#xC2DC; &#xCCB4;&#xC778;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5F0;&#xACB0;&#xD574;&#xC11C;, &#xBAA8;&#xB4E0; &#xBE14;&#xB85D;&#xC774; &#xC774;&#xC804; &#xBE14;&#xB85D;&#xACFC; &#xC554;&#xD638;&#xD559;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB41C; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC694;.<br><img src="/2025/01/26/bekim/blockchain/ko/image1.png" srcset="/img/loading.gif" alt><br>&#xC704; &#xADF8;&#xB9BC;&#xC744; &#xC608;&#xC2DC;&#xB85C; &#xB4E4;&#xC5B4;&#xC11C; &#xC27D;&#xAC8C; &#xC124;&#xBA85;&#xD574;&#xBCFC;&#xAC8C;&#xC694;. &#x1F576;&#xFE0F;<br><strong>Block 100</strong></p>
<ul>
<li>&#xD5E4;&#xB354;&#xC5D0;&#xB294; &#xC774;&#xC804; &#xBE14;&#xB85D;&#xC758; &#xD574;&#xC2DC; &#xAC12; Hash(Block 99), &#xBE14;&#xB85D;&#xC758; &#xB370;&#xC774;&#xD130;(Payload 100) &#xADF8;&#xB9AC;&#xACE0; Nonce (&#xC791;&#xC5C5; &#xC99D;&#xBA85;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xAC12;)&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC694;.</li>
<li>&#xC774; &#xC815;&#xBCF4;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; Block 100&#xC758; &#xACE0;&#xC720;&#xD55C; &#xD574;&#xC2DC; &#xAC12;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.<br><strong>Block 101</strong></li>
<li>Block 101&#xC758; &#xD5E4;&#xB354;&#xC5D0;&#xB294; Block 100&#xC758; &#xD574;&#xC2DC; &#xAC12;&#xC774; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC5EC;&#xAE30;&#xC5D0; Payload 101&#xACFC; Nonce&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xC5EC; Block 101&#xB9CC;&#xC758; &#xC0C8;&#xB85C;&#xC6B4; &#xD574;&#xC2DC; &#xAC12;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.<br><strong>Block 102</strong></li>
<li>&#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; Block 102&#xB294; Block 101&#xC758; &#xD574;&#xC2DC; &#xAC12;&#xC744; &#xCC38;&#xC870;&#xD558;&#xC5EC; &#xC5F0;&#xACB0;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC704;&#xC640; &#xAC19;&#xC740; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xBAA8;&#xB4E0; &#xBE14;&#xB85D;&#xC774; &#xC554;&#xD638;&#xD559;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB41C; &#xCCB4;&#xC778; &#xAD6C;&#xC870;&#xB97C; &#xD615;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC774;&#xB7F0; &#xAD6C;&#xC870;&#xB294; &#xB370;&#xC774;&#xD130; &#xBCC0;&#xC870;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xB294;&#xB370; &#xC911;&#xC694;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, Block 100&#xC758; &#xB370;&#xC774;&#xD130;(Payload 100)&#xAC00; &#xBCC0;&#xACBD;&#xB41C;&#xB2E4;&#xBA74;, Block 101&#xC774; &#xCC38;&#xC870;&#xD558;&#xB294; Block 100&#xC758; &#xD574;&#xC2DC; &#xAC12;&#xC774; &#xB2EC;&#xB77C;&#xC838; &#xC720;&#xD6A8;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xB418;&#xACE0;, &#xACB0;&#xAD6D; Block 101 &#xC774;&#xD6C4;&#xC758; &#xBAA8;&#xB4E0; &#xBE14;&#xB85D;&#xC774; &#xBB34;&#xD6A8;&#xD654; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; &#xB370;&#xC774;&#xD130;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-1-Transaction"><a href="#3-1-Transaction" class="headerlink" title="3.1. Transaction"></a>3.1. Transaction</h2><p><img src="/2025/01/26/bekim/blockchain/ko/image2.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>image source: Bitcoin: A Peer-to-Peer Electronic Cash System</p>
</blockquote>
<p>&#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774;, &#xBE44;&#xD2B8;&#xCF54;&#xC778;&#xC758; Transaction&#xB3C4; HashChain&#xC758; &#xC6D0;&#xB9AC;&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; Transaction&#xC740; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xBE44;&#xD2B8;&#xCF54;&#xC778;&#xC744; &#xC1A1;&#xAE08;&#xD558;&#xAC70;&#xB098; &#xC774;&#xB3D9;&#xC2DC;&#xD0A4;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xB2E8;&#xC704;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xAC70;&#xB798; &#xAE30;&#xB85D;&#xB4E4;&#xC740; &#xBAA8;&#xB450; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA70;, &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xCC38;&#xC5EC;&#xC790;&#xAC00; &#xACF5;&#xC720;&#xD558;&#xB294; <strong>&#xBD84;&#xC0B0; &#xC6D0;&#xC7A5;(ledger)</strong>&#xC5D0; &#xAE30;&#xB85D;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC01; Transaction&#xC740; <strong>&#xC774;&#xC804; Transaction&#xC758; &#xD574;&#xC2DC; &#xAC12;</strong>&#xC744; &#xD3EC;&#xD568;&#xD574;&#xC11C; &#xC11C;&#xB85C; &#xC5F0;&#xACB0;&#xB429;&#xB2C8;&#xB2E4;. &#xC704; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC;, Owner 1&#xC758; Transaction&#xC5D0;&#xB294; Owner 0&#xC758; &#xD574;&#xC2DC; &#xAC12;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4;, Owner 1&#xC774; &#xD574;&#xB2F9; &#xC790;&#xC0B0;&#xC758; &#xC18C;&#xC720;&#xAD8C;&#xC744; &#xD569;&#xBC95;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xC804; &#xBC1B;&#xC558;&#xC74C;&#xC744; &#xC99D;&#xBA85;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB610;&#xD55C; Transaction&#xC5D0;&#xB294; &#xD604;&#xC7AC; Owner&#xC758; <strong>&#xACF5;&#xAC1C; &#xD0A4;(Public key)</strong>&#xC640; <strong>&#xB514;&#xC9C0;&#xD138; &#xC11C;&#xBA85;(Digital Signature)</strong>&#xC774; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xADF8;&#xB798;&#xC11C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB294; &#xACF5;&#xAC1C; &#xD0A4;&#xB97C; &#xD1B5;&#xD574; &#xB514;&#xC9C0;&#xD138; &#xC11C;&#xBA85;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xC5EC;, Transaction&#xC774; &#xC704;&#xC870;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; Owner 2&#xB294; Owner 1&#xC758; Transaction&#xC744; &#xCC38;&#xC870;&#xD558;&#xACE0;, &#xC790;&#xC2E0;&#xC758; &#xB514;&#xC9C0;&#xD138; &#xC11C;&#xBA85;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xC0C8;&#xB85C;&#xC6B4; Transaction&#xC744; &#xC0DD;&#xC131;&#xD574;&#xC694;. &#xC774;&#xB7EC;&#xD55C; &#xACFC;&#xC815;&#xC774; &#xBC18;&#xBCF5;&#xB418;&#xBA74;&#xC11C; Transaction&#xB4E4;&#xC740; &#xC5F0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xD574;&#xC2DC; &#xCCB4;&#xC778; &#xD615;&#xD0DC;&#xB97C; &#xC774;&#xB8E8;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xAD6C;&#xC870;&#xB85C; &#xC778;&#xD574;, &#xD558;&#xB098;&#xC758; Transaction&#xC774;&#xB77C;&#xB3C4; &#xBCC0;&#xACBD;&#xB418;&#xBA74;, &#xC774;&#xD6C4; &#xBAA8;&#xB4E0; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; &#xBB34;&#xD6A8;&#xD654; &#xB418;&#xC5B4; &#xB370;&#xC774;&#xD130; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="4-Proof-of-Work-PoW-&#xC791;&#xC5C5;-&#xC99D;&#xBA85;"><a href="#4-Proof-of-Work-PoW-&#xC791;&#xC5C5;-&#xC99D;&#xBA85;" class="headerlink" title="4. Proof of Work (PoW, &#xC791;&#xC5C5; &#xC99D;&#xBA85;)"></a>4. Proof of Work (PoW, &#xC791;&#xC5C5; &#xC99D;&#xBA85;)</h1><p>&#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D;&#xC744; &#xBE14;&#xB85D; &#xCCB4;&#xC778;&#xC5D0; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC0C8;&#xB85C;&#xC6B4; &#xD654;&#xD3D0;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC1A1;&#xAE08;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD575;&#xC2EC; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC774; &#xBC14;&#xB85C; Proof of Work (&#xC791;&#xC5C5; &#xC99D;&#xBA85;)&#xC785;&#xB2C8;&#xB2E4;.<br><img src="/2025/01/26/bekim/blockchain/ko/image3.png" srcset="/img/loading.gif" alt><br>&#xC791;&#xC5C5; &#xC99D;&#xBA85;&#xC744; &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xD574;&#xD558;&#xC790;&#xBA74;, &#xCC44;&#xAD74;&#xC790;&#xB4E4;&#xC774; &#xBCF5;&#xC7A1;&#xD55C; &#xC218;&#xD559;&#xC801; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294; <strong>&#x201C;&#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD588;&#xC74C;&#xC744; &#xC99D;&#xBA85;&#x201D;</strong>&#xD558;&#xB3C4;&#xB85D; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB97C; &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xD574;&#xACB0;&#xD55C; &#xCC44;&#xAD74;&#xC790;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xAC00;&#xC7A5; &#xBA3C;&#xC800; &#xD574;&#xACB0;&#xD55C; &#xCC44;&#xAD74;&#xC790;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D;&#xC744; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xCD94;&#xAC00;&#xD560; &#xAD8C;&#xB9AC;&#xB97C; &#xC5BB;&#xC73C;&#xBA70;, &#xBCF4;&#xC0C1;&#xC73C;&#xB85C; &#xBE44;&#xD2B8;&#xCF54;&#xC778;&#xC744; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xD0C8;&#xC911;&#xC559;&#xD654; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C;&#xB294; &#xAC70;&#xB798;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xC911;&#xC559; &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xBAA8;&#xB4E0; &#xCC38;&#xC5EC;&#xC790;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC2E0;&#xB8B0;&#xD558;&#xACE0; &#xB3D9;&#xC758;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC791;&#xC5C5; &#xC99D;&#xBA85;&#xC740; &#xC774;&#xB97C; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.<br><img src="/2025/01/26/bekim/blockchain/ko/image4.png" srcset="/img/loading.gif" alt><br>&#xC704; &#xACFC;&#xC815;&#xC744; &#xC880; &#xB354; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xCC44;&#xAD74;&#xC790;&#xB4E4;&#xC740; Nonce&#xB77C;&#xB294; &#xAC12;(&#xCC44;&#xAD74;&#xC790;&#xAC00; &#xC784;&#xC758;&#xB85C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC12;)&#xC744; &#xACC4;&#xC18D; &#xBCC0;&#xACBD;&#xD574;&#xAC00;&#xC11C; &#xD574;&#xC2DC; &#xD37C;&#xC990;(Hash Puzzle)&#xC744; &#xD480;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xD574;&#xC2DC; &#xCD9C;&#xB825; &#xAC12;&#xC774; 8&#xAC1C;&#xC758; 0&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xB418;&#xC5B4;&#xC57C; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D;&#xC774; &#xC815;&#xB2F9;&#xD558;&#xAC8C; &#xCC44;&#xAD74;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xC778;&#xC815;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>&#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C;&#xB294; &#xD3C9;&#xADE0; 10&#xBD84;&#xC5D0; &#xD55C; &#xBC88;&#xC529; &#xBE14;&#xB85D;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xB370;, &#xC774;&#xB97C; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB294; &#xB09C;&#xC774;&#xB3C4;(Difficulty)&#xB97C; &#xC870;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xB09C;&#xC774;&#xB3C4;&#xB294; &#xD574;&#xC2DC; &#xAC12;&#xC5D0;&#xC11C; &#xC694;&#xAD6C;&#xD558;&#xB294; 0&#xC758; &#xAC1C;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xACB0;&#xC815;&#xB418;&#xB294;&#xB370;, 0&#xC758; &#xAC1C;&#xC218;&#xAC00; &#xB9CE;&#xC544;&#xC9C8;&#xC218;&#xB85D; &#xC720;&#xD6A8;&#xD55C; &#xD574;&#xC2DC; &#xAC12;&#xC744; &#xCC3E;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xACC4;&#xC0B0;&#xB7C9;&#xC774; &#xB354; &#xB298;&#xAC8C; &#xB3FC;&#xC694;. &#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xD574;&#xC2DC;&#xC758; &#xCD9C;&#xB825; &#xAC12;&#xC774; 8&#xAC1C;&#xC758; 0&#xC774; &#xD544;&#xC694;&#xD588;&#xC9C0;&#xB9CC;, &#xD604;&#xC7AC;(2024&#xB144; &#xAE30;&#xC900;) &#xB09C;&#xC774;&#xB3C4;&#xB294; &#xB354; &#xB192;&#xC544;&#xC838;&#xC11C; &#xD574;&#xC2DC; &#xAC12;&#xC5D0; 19&#xAC1C;&#xC758; 0&#xC774; &#xC694;&#xAD6C;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xB9C9;&#xB300;&#xD55C; &#xACC4;&#xC0B0; &#xC790;&#xC6D0;&#xACFC; &#xC804;&#xB825;&#xC774; &#xD544;&#xC694; &#xBA70;, &#xC624;&#xB298;&#xB0A0;&#xC5D0;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xCEF4;&#xD4E8;&#xD130;&#xB85C;&#xB294; &#xCC44;&#xAD74; &#xACBD;&#xC7C1;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6CC;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC791;&#xC5C5; &#xC99D;&#xBA85;&#xC740; &#xBE14;&#xB85D; &#xCCB4;&#xC778; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xB370;&#xC774;&#xD130; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xACE0;, Longest chain rule (&#xAC00;&#xC7A5; &#xAE34; &#xCCB4;&#xC778; &#xC6D0;&#xCE59;)&#xC744; &#xD1B5;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xCC38;&#xC5EC;&#xC790;&#xB4E4;&#xC774; &#xD569;&#xC758;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xB3C4;&#xB85D; &#xB3D5;&#xC2B5;&#xB2C8;&#xB2E4;.<br><img src="/2025/01/26/bekim/blockchain/ko/image5.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>Image Source: The longest chain accounts for the greatest PoW effort and is admitted as the main chain, ResearchGate.</p>
</blockquote>
<p>&#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC5EC;&#xB7EC; &#xCC44;&#xAD74;&#xC790;&#xAC00; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xBA74; &#xB450; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xCCB4;&#xC778;&#xC774; &#xC874;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0;&#xB97C; fork&#xB77C;&#xACE0; &#xD558;&#xB294;&#xB370;, &#xD3EC;&#xD06C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xCC38;&#xC5EC;&#xC790;&#xB4E4;&#xC740; &#xC5B4;&#xB5A4; &#xCCB4;&#xC778;&#xC744; &#xC2E0;&#xB8B0;&#xD574;&#xC57C; &#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.<br>&#xC774; &#xACBD;&#xC6B0; longest chain rule&#xC744; &#xB530;&#xB77C;&#xC11C; &#xAC00;&#xC7A5; &#xB9CE;&#xC740; &#xC791;&#xC5C5; &#xC99D;&#xBA85;(PoW)&#xC774; &#xD22C;&#xC785;&#xB41C; &#xCCB4;&#xC778;&#xC744; &#xBA54;&#xC778; &#xCCB4;&#xC778;&#xC73C;&#xB85C; &#xC778;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xAC00;&#xC7A5; &#xAE34; &#xCCB4;&#xC778;&#xC774; &#xAC00;&#xC7A5; &#xB9CE;&#xC740; &#xACC4;&#xC0B0; &#xC790;&#xC6D0;&#xC744; &#xC18C;&#xBAA8;&#xD574; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C;, &#xC720;&#xD6A8;&#xD55C; &#xCCB4;&#xC778;&#xC784;&#xC744; &#xC778;&#xC815;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4EF;, &#xACBD;&#xC7C1;&#xC5D0;&#xC11C; &#xD0C8;&#xB77D;&#xD55C; &#xCCB4;&#xC778;&#xC5D0; &#xC18D;&#xD55C; &#xBE14;&#xB85D;&#xB4E4;&#xC740; Stale Block(&#xBC84;&#xB824;&#xC9C4; &#xBE14;&#xB85D;)&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB418;&#xC5B4; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xBB34;&#xD6A8;&#xD654; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xBE14;&#xB85D;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC740; &#xC774;&#xD6C4; main chain&#xC5D0; &#xB2E4;&#xC2DC; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xBAA8;&#xB4E0; &#xCC38;&#xC5EC;&#xC790;&#xAC00; &#xAC00;&#xC7A5; &#xAE34; &#xCCB4;&#xC778;&#xC744; &#xACF5;&#xC720;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xB370;&#xC774;&#xD130;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xACFC; &#xC2E0;&#xB8B0;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xACE0;, &#xD0C8;&#xC911;&#xC559;&#xD654;&#xB41C; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xD569;&#xC758;&#xB97C; &#xC774;&#xB8F0; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#x1F646;</p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xBC31;&#xC11C;&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; &#xC6D0;&#xB9AC;&#xC640; &#xD575;&#xC2EC; &#xB9E4;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xD0C8;&#xC911;&#xC559;&#xD654;&#xC640; &#xB370;&#xC774;&#xD130; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xC131;&#xD574;&#xBCF4;&#xC558;&#xC5B4;&#xC694;. </p>
<p>&#xCCAB; &#xAE00;&#xC740; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; &#xAE30;&#xBCF8; &#xC6D0;&#xB9AC;&#xB97C; &#xB113;&#xC740; &#xBC94;&#xC704;&#xC5D0;&#xC11C; &#xB2E4;&#xB918;&#xC9C0;&#xB9CC;, &#xB2E4;&#xC74C; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xC791;&#xC5C5; &#xC99D;&#xBA85;(Proof of Work) &#xC678;&#xC5D0;&#xB3C4; &#xB2E4;&#xC591;&#xD55C; &#xD569;&#xC758; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0; &#xB300;&#xD574; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xB9AC;&#xD574;&#xBCFC; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xC774; &#xC5F0;&#xAD6C;&#xAE00;&#xC774; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xC811;&#xD558;&#xB294; &#xB3C5;&#xC790;&#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xC720;&#xC775;&#xD55C; &#xAE00;&#xC774; &#xB418;&#xC5C8;&#xAE30;&#xB97C; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;. &#x1F600;</p>
<h3 id="&#xCD08;&#xC2EC;&#xC790;&#xB97C;-&#xC704;&#xD55C;-&#xBE44;&#xD2B8;&#xCF54;&#xC778;"><a href="#&#xCD08;&#xC2EC;&#xC790;&#xB97C;-&#xC704;&#xD55C;-&#xBE44;&#xD2B8;&#xCF54;&#xC778;" class="headerlink" title="&#xCD08;&#xC2EC;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xBE44;&#xD2B8;&#xCF54;&#xC778;"></a>&#xCD08;&#xC2EC;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xBE44;&#xD2B8;&#xCF54;&#xC778;</h3><ul>
<li>&#xBD84;&#xC0B0; &#xC6D0;&#xC7A5;(ledger): &#xBAA8;&#xB4E0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xCC38;&#xC5EC;&#xC790;&#xAC00; &#xB098;&#xB220; &#xAC00;&#xC9C4; &#xB3D9;&#xC77C;&#xD55C; &#xAC70;&#xB798; &#xAE30;&#xB85D;</li>
<li>&#xB514;&#xC9C0;&#xD138; &#xC11C;&#xBA85;: &#xAC1C;&#xC778; &#xD0A4;&#xB85C; &#xC0DD;&#xC131;&#xB41C; &#xC804;&#xC790; &#xC11C;&#xBA85;</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://bitaps.com/">https://bitaps.com/</a>&#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xD2B8;&#xCF54;&#xC778; &#xBE14;&#xB85D; &#xC0DD;&#xC131;&#xC744; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/bekim/">bekim</a>
                  
                  <a class="hover-with-bg" href="/tags/bitcoin/">bitcoin</a>
                  
                  <a class="hover-with-bg" href="/tags/blockchain/">blockchain</a>
                  
                  <a class="hover-with-bg" href="/tags/PoW/">PoW</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_bekim.jpg" srcset="/img/loading.gif" alt="bekim">
                  </div>

                  <div class="link-text">
                    <div class="link-title">bekim</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/bekim">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/01/26/bekim/blockchain/en/">
                    <span class="hidden-mobile">[Research] Blockchain Basics: Bitcoin and Beyond (en)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/01/26/bekim/blockchain/ko/';
        this.page.identifier = '/2025/01/26/bekim/blockchain/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Blockchain Basics: Bitcoin and Beyond (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
