

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;1-Introduction&#34;&gt;&lt;a href=&#34;#1-Introduction&#34; class=&#34;headerlink&#34; title=&#34;1. Introduction&#34;&gt;&lt;/a&gt;1. Introduction&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/logo.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xC740; Windows &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC7A5;&amp;#xCE58;&amp;#xAC00; &amp;#xBD84;&amp;#xC2E4;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xB3C4;&amp;#xB09C;&amp;#xB418;&amp;#xC5B4; &amp;#xC624;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xB3C4; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC77D;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. BitLocker&amp;#xC740; XTS-AES&amp;#xC640; TPM&amp;#xC758; &amp;#xACB0;&amp;#xD569; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; AES-XTS &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;a href=&#34;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&#34;&gt;BitLocker CrashXTS&lt;/a&gt;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-&amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xC774;&amp;#xD574;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xC774;&amp;#xD574;&#34; class=&#34;headerlink&#34; title=&#34;1.1 &amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xD574;&#34;&gt;&lt;/a&gt;1.1 &amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xD574;&lt;/h3&gt;&lt;p&gt;UEFI &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; EFI System Partition(ESP)&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; bootmgfw.efi&amp;#xC640; BCD(&amp;#xBD80;&amp;#xD305; &amp;#xAD6C;&amp;#xC131; &amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xBA70;, &amp;#xC774; &amp;#xAD6C;&amp;#xAC04;&amp;#xC740; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Secure Boot&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xD305; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xCCB4;&amp;#xC778;&amp;#xC758; DBX&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD574; &amp;#xC2E0;&amp;#xB8B0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ESP &amp;#xBD80;&amp;#xD2B8; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xC77D;&amp;#xD788;&amp;#xB418;, &amp;#xC2E0;&amp;#xB8B0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; VMK unseal&amp;#xC774; &amp;#xAC70;&amp;#xBD80;&amp;#xB418;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TPM &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCE69;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. BitLocker&amp;#xB294; &amp;#xBCFC;&amp;#xB968; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xC790;(Key Protector)&amp;#xC640; &amp;#xD0A4; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xAE30;&amp;#xC220;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; VMK(Volume Master Key)&amp;#xC640; FVEK(Full Volume Encryption Key)&amp;#xC758; 2&amp;#xACC4;&amp;#xCE35; &amp;#xD0A4; &amp;#xC124;&amp;#xACC4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638;&amp;#xD654;/&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xAC83;&amp;#xC740; FVEK&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &lt;code&gt;manage-bde -protectors -get C:&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC73C;&amp;#xB85C; C: &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;(Key Protector)&amp;#xB97C; &amp;#xC870;&amp;#xD68C;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC22B;&amp;#xC790; &amp;#xC554;&amp;#xD638;&amp;#xB294; VMK&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xC815;&amp;#xC0C1; &amp;#xBD80;&amp;#xD305; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; TPM &amp;#xAE30;&amp;#xBC18; unseal&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF5;&amp;#xAD6C; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB420; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBCF5;&amp;#xAD6C; &amp;#xC218;&amp;#xB2E8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; BitLocker &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, VMK&amp;#xB97C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD0A4; &amp;#xACC4;&amp;#xCE35;(VMK &amp;#x2192; FVEK)&amp;#xC774; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xD568;&amp;#xAED8; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70;, &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; FVEK&amp;#xAC00; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; 2&amp;#xACC4;&amp;#xCE35; &amp;#xD0A4; &amp;#xC124;&amp;#xACC4;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xAC01; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC801;&amp;#xC778; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; TPM, VMK, FVEK&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TPM&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TPM&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;, &amp;#xCE74;&amp;#xC6B4;&amp;#xD130; &amp;#xB4F1;&amp;#xC744; &amp;#xCE69; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xACA9;&amp;#xB9AC;&amp;#xD574; &amp;#xBCF4;&amp;#xAD00;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#x2018;&amp;#xBBFF;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xBD80;&amp;#xD305;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#x2019; &amp;#xBD80;&amp;#xD305; &amp;#xC2E0;&amp;#xB8B0;&amp;#xB3C4; &amp;#xCE21;&amp;#xC815;&amp;#xAC12;(PCR - Platform Configuration Register)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;&amp;#xB97C; &amp;#xAEBC;&amp;#xB0B4; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; dTPM &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCE69;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xB294; VMK&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; PCR &amp;#xAC12;&amp;#xC5D0; seal&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PCR 7(Secure Boot &amp;#xC0C1;&amp;#xD0DC;, UEFI &amp;#xBCC0;&amp;#xC218;, Boot Manager &amp;#xCF54;&amp;#xB4DC;)&amp;#xACFC; PCR 11(BitLocker &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBD80;&amp;#xD305; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC774;&amp;#xBA74; TPM&amp;#xC740; VMK &amp;#xD574;&amp;#xC81C;(unseal)&amp;#xB97C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBD80;&amp;#xD305; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; PCR &amp;#xAC12;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC838; unseal&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C; &amp;#xD654;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;VMK (Volume Master Key)&lt;/strong&gt;&lt;br&gt;VMK&amp;#xB294; FVEK&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xC704; &amp;#xD0A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMK&amp;#xB97C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; FVEK&amp;#xB97C; &amp;#xD480; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC139;&amp;#xD130; &amp;#xD3C9;&amp;#xBB38;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMK&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBCF4;&amp;#xD638;&amp;#xC790;&amp;#xB85C; &amp;#xB798;&amp;#xD551;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TPM Protector: TPM PCR&amp;#xC5D0; &amp;#xBC14;&amp;#xC778;&amp;#xB529;&lt;/li&gt;
&lt;li&gt;Recovery Password Protector: 48&amp;#xC790;&amp;#xB9AC; &amp;#xC22B;&amp;#xC790; &amp;#xBCF5;&amp;#xAD6C; &amp;#xD0A4;&lt;/li&gt;
&lt;li&gt;Password Protector: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC554;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;TPM+PIN Protector: TPM&amp;#xACFC; PIN &amp;#xC870;&amp;#xD569;  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;FVEK (Full Volume Encryption Key)&lt;/strong&gt;&lt;br&gt;FVEK&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xBA70;, FVEK&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. FVEK&amp;#xB294; AES-256(&amp;#xB610;&amp;#xB294; AES-128) &amp;#xD0A4;&amp;#xC774;&amp;#xBA70;, XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; 512&amp;#xBE44;&amp;#xD2B8;(&amp;#xB610;&amp;#xB294; 256&amp;#xBE44;&amp;#xD2B8;)&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC808;&amp;#xBC18;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC6A9;(K1), &amp;#xC808;&amp;#xBC18;&amp;#xC740; tweak &amp;#xC0DD;&amp;#xC131;&amp;#xC6A9;(K2)&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!  &lt;br&gt;&lt;br&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;BitLocker &amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xB3D9;&amp;#xC791; &amp;#xC6D0;&amp;#xB9AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC624;&amp;#xBA74; BitLocker &amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC778; fvevol.sys&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; I/O&amp;#xB97C; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xAC78; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xB54C; &lt;code&gt;winload.efi&lt;/code&gt;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &lt;code&gt;BOOT_START(0)&lt;/code&gt; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xC801;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;fvevol.sys&lt;/code&gt;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xBA3C;&amp;#xC800; &amp;#xC62C;&amp;#xB77C;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xC740; NTFS&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xB9C8;&amp;#xC6B4;&amp;#xD2B8;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0A4;&amp;#xAC00; &amp;#xC900;&amp;#xBE44;&amp;#xB418;&amp;#xAE30; &amp;#xC804; &amp;#xBD80;&amp;#xD305; &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; TPM&amp;#xC758; PCR 7/11 &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC544;&amp;#xC9C1; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; VMK/FVEK&amp;#xC774; &amp;#xC900;&amp;#xBE44; &amp;#xC804; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC77C; &amp;#xB54C;, &lt;code&gt;fvevol.sys&lt;/code&gt;&amp;#xB294; locked &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; bootmgr&amp;#xB098; winload&amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xD2B8; &amp;#xD658;&amp;#xACBD;&amp;#xC774; FVE-FS(&amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; TPM &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, VMK&amp;#xB97C; unseal &amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0; FVEK&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;VMK&amp;#xAC00; unseal&amp;#xB418;&amp;#xACE0; FVEK&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xC77C; &amp;#xB54C;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C;&amp;#xC57C; fvevol&amp;#xC740; unlocked &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xB2F9; &amp;#xBCFC;&amp;#xB968;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; I/O&amp;#xB294; &amp;#xAC01; FVEK&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD22C;&amp;#xBA85; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC989;, &lt;code&gt;&amp;#xC571;/&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/code&gt; &amp;#x2192; &lt;code&gt;NTFS(ReFS)&lt;/code&gt; &amp;#x2192; &lt;code&gt;I/O Manager&lt;/code&gt; &amp;#x2192; &lt;code&gt;[fvevol]&lt;/code&gt; &amp;#x2192; &lt;code&gt;volmgr/&amp;#xC800;&amp;#xC7A5;&amp;#xC18C; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&lt;/code&gt; &amp;#x2192; &lt;code&gt;&amp;#xD3EC;&amp;#xD2B8;/&amp;#xBBF8;&amp;#xB2C8;&amp;#xD3EC;&amp;#xD2B8;(NVMe/SATA)&lt;/code&gt; &amp;#x2192; &lt;code&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&lt;/code&gt; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB824;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778; &lt;strong&gt;XTS-AES&lt;/strong&gt;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA70;, &amp;#xAC01; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &lt;strong&gt;tweak &amp;#xAC12;(&amp;#xC139;&amp;#xD130;/&amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xAE30;&amp;#xBC18;)&lt;/strong&gt;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD3C9;&amp;#xBB38;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC124;&amp;#xACC4;&amp;#xB294; CTR/CBC &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB358; &lt;strong&gt;malleability(&amp;#xBCC0;&amp;#xD615; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;)&lt;/strong&gt;, &amp;#xC989; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC644;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB3C4;&amp;#xC785;&amp;#xB41C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; XTS &amp;#xAD6C;&amp;#xC870;&amp;#xC870;&amp;#xCC28; &amp;#xC644;&amp;#xBCBD;&amp;#xD788; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC624;&amp;#xB298; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-Windows&amp;#xC758;-AES-CBC&amp;#xC640;-AES-XTS-&amp;#xC6B4;&amp;#xC6A9;-&amp;#xBAA8;&amp;#xB4DC;&#34;&gt;&lt;a href=&#34;#2-Windows&amp;#xC758;-AES-CBC&amp;#xC640;-AES-XTS-&amp;#xC6B4;&amp;#xC6A9;-&amp;#xBAA8;&amp;#xB4DC;&#34; class=&#34;headerlink&#34; title=&#34;2. Windows&amp;#xC758; AES-CBC&amp;#xC640; AES-XTS &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&#34;&gt;&lt;/a&gt;2. Windows&amp;#xC758; AES-CBC&amp;#xC640; AES-XTS &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&lt;/h2&gt;&lt;h3 id=&#34;2-1-XTS&amp;#xC758;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#2-1-XTS&amp;#xC758;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;2.1 XTS&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.1 XTS&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC11C; BitLocker&amp;#xAC00; FVEK&amp;#xB85C; &amp;#xC139;&amp;#xD130; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC624;&amp;#xB298; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;&amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB77C;&amp;#xB294; &amp;#xB9E4;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&amp;#x2019;&lt;/strong&gt;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB46C;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; &amp;#x2018;&amp;#xC139;&amp;#xD130;&amp;#xB77C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xB9E4;&amp;#xCCB4;&amp;#x2019;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; BitLocker&amp;#xB294; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638; &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5EC;&amp;#xC57C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows 11&amp;#xBD80;&amp;#xD130; BitLocker&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; AES-CBC &amp;#xB300;&amp;#xC2E0; AES-XTS&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xB294; attack surface&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;
C_i = E_K\!\left(P_i \oplus C_{i-1}\right)&lt;/script&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;
P_i = D_K\!\left(C_i\right) \oplus C_{i-1}&lt;/script&gt;&lt;p&gt;CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xC8E0;? CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638;&amp;#xC778; AES&amp;#xB97C; &amp;#xCCB4;&amp;#xC778;&amp;#xCC98;&amp;#xB7FC; &amp;#xC5EE;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778;&amp;#xB370;, CBC &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC5F0;&amp;#xC1C4; &amp;#xAD6C;&amp;#xC870; (Chaining Dependency)&lt;/strong&gt;&lt;br&gt;CBC&amp;#xB294; &amp;#xBCF8;&amp;#xC9C8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC55E; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB4A4; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC911;&amp;#xAC04; &amp;#xBE14;&amp;#xB85D;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFD4; &amp;#xC4F0;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xAC31;&amp;#xC2E0;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, OS&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xC139;&amp;#xD130;&amp;#xB9CC; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBE44;&amp;#xD2B8; &amp;#xD50C;&amp;#xB9BD; &amp;#xACF5;&amp;#xACA9; (Bit Flipping)&lt;/strong&gt;&lt;br&gt;CBC &amp;#xBCF5;&amp;#xD638; &amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB4EF;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC704;&amp;#xCE58; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xD799;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;IV(Initialization Vector) &amp;#xAD00;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&lt;br&gt;&amp;#xAC01; &amp;#xC139;&amp;#xD130;&amp;#xB9C8;&amp;#xB2E4; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; IV&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, IV&amp;#xB97C; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xACE0;, &amp;#xB79C;&amp;#xB364; IV&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xCD94;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5; &amp;#xACF5;&amp;#xAC04;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC; &amp;#xB54C;, &amp;#xACFC;&amp;#xAC70; CBC &amp;#xAE30;&amp;#xBC18; FDE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC0C1;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBE44;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD574; &amp;#xBD80;&amp;#xD2B8;&amp;#xB85C;&amp;#xB354;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC545;&amp;#xC131; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC774;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xAC04; CBC &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; &amp;#xAC00;&amp;#xB2E8;&amp;#xC131;(Malleability)&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBD80;&amp;#xD2B8; &amp;#xC139;&amp;#xD130;&amp;#xB098; OS &amp;#xC911;&amp;#xC694; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB420; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xC81C;&amp;#xAE30;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; 2008&amp;#xB144; TrueCrypt 5.0&amp;#xC774; &lt;strong&gt;XTS-AES&lt;/strong&gt;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xACE0;, &amp;#xC774;&amp;#xD6C4; Microsoft &amp;#xC5ED;&amp;#xC2DC; Windows 10&amp;#xBD80;&amp;#xD130; BitLocker&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD45C;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; XTS-AES&amp;#xB97C; &amp;#xCC44;&amp;#xD0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC704;&amp;#xD611;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; XTS &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; XTS&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xB9C8;&amp;#xB2E4; tweak&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC50C;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; tweak&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC740; &amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC704;&amp;#xCE58;&amp;#x2019;&amp;#xC5D0;&amp;#xC11C; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xB09C;&amp;#xC218; &amp;#xAC12;&amp;#xC774;&amp;#xBA70;, &amp;#xC774; &amp;#xAC12;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xC640; &amp;#xC139;&amp;#xD130; &amp;#xB0B4; &amp;#xBE14;&amp;#xB85D; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; 512B(4KB)&amp;#xAC19;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xC139;&amp;#xD130;&amp;#xB85C; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xACE0;, AES&amp;#xB294; 16B &amp;#xBE14;&amp;#xB85D;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; 512B &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; 32&amp;#xAC1C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB098;&amp;#xB258;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, XTS&amp;#xB294; &amp;#xC774; 16B &amp;#xBE14;&amp;#xB85D;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; tweak&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;
T_i = \mathrm{Tweak}_{K_2}(s, j)&lt;/script&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;
C_i = E_{K_1}\!\left(P_i \oplus T_i\right) \oplus T_i&lt;/script&gt;&lt;p&gt;XTS&amp;#xB294; Key&amp;#xB97C; &amp;#xB450; &amp;#xAC1C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Key1&lt;/code&gt;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &lt;code&gt;Key2&lt;/code&gt;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC704;&amp;#xCE58; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; tweak&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC19;&amp;#xC740; XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574;&amp;#xB3C4;, &lt;strong&gt;&lt;em&gt;&amp;#xBE44;&amp;#xC120;&amp;#xD615;&amp;#xC131;&lt;/em&gt;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC608;&amp;#xCE21; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xC190;&amp;#xC0C1;&amp;#xC774; &amp;#xC774;&amp;#xB904;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, CBC&amp;#xCC98;&amp;#xB7FC; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-XTS&amp;#xC758;-&amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACFC;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#2-2-XTS&amp;#xC758;-&amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACFC;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;2.2 XTS&amp;#xC758; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xACFC;&amp;#xC81C;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.2 XTS&amp;#xC758; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xACFC;&amp;#xC81C;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; XTS&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1. &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638; &amp;#xBD80;&amp;#xC7AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; &amp;#xC870;&amp;#xC791; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC870;&amp;#xC791; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xBA74;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xADF8; &amp;#xBCC0;&amp;#xC870; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xAC10;&amp;#xC9C0;&amp;#xD574;&amp;#xC11C; &amp;#xC911;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xADF8;&amp;#xB0E5; &amp;#xBCF5;&amp;#xD638;&amp;#xD574;&amp;#xC11C; &amp;#xAE68;&amp;#xC9C4; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2. &amp;#xC138;&amp;#xBD84;&amp;#xD654;&amp;#xB41C; &amp;#xBCC0;&amp;#xC870; &amp;#xD0D0;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC139;&amp;#xD130;&amp;#xB098; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xB97C; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xACA9;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; CBC&amp;#xBCF4;&amp;#xB2E4; &amp;#xC138;&amp;#xBD84;&amp;#xC131;&amp;#xC774; &amp;#xC88B;&amp;#xC544;&amp;#xC11C;, &amp;#xBCC0;&amp;#xD615;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD2B9;&amp;#xC815; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xC804;&amp;#xCCB4; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC27D;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3. Copy-Paste &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD3C9;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC139;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xD56D;&amp;#xC0C1; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC774;&amp;#xC804; &amp;#xBC84;&amp;#xC804; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xAC70;&amp;#xB098;, &amp;#xB2E4;&amp;#xB978; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; &amp;#xBD99;&amp;#xC5EC;&amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;4. &amp;#xC881;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xD06C;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD3C9;&amp;#xBB38; &amp;#xD328;&amp;#xD134;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xB418;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD328;&amp;#xD134;&amp;#xC774; &amp;#xAD00;&amp;#xCC30;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; BitLocker &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0;&amp;#xC11C; XTS-AES&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBD80;&amp;#xC7AC;&amp;#xB97C; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; BitLocker&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBCFC;&amp;#xB968; V:&amp;#xC5D0; 16MiB &amp;#xD06C;&amp;#xAE30; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC0DD;&amp;#xC131; &amp;#xC9C1;&amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; SHA-256 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xC7A0;&amp;#xADFC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC6D0;&amp;#xC2DC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD3B8;&amp;#xC9D1;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC77C;&amp;#xBD80; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xB4A4; &amp;#xB3D9;&amp;#xC77C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; SHA-256 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xC7AC;&amp;#xACC4;&amp;#xC0B0;&amp;#xD574; &amp;#xAE30;&amp;#xC900;&amp;#xAC12;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xC2DC;&amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xB531; 1&amp;#xBE44;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, XTS &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; 1&amp;#xBE44;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFE8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xB85C; randomizing&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;, &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6C3; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows&amp;#xAC00; AEAD&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/strong&gt;&lt;br&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Windows &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MAC&amp;#xC774;&amp;#xB098; AEAD &amp;#xAC19;&amp;#xC740; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBD99;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xAD50;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xCC28;&amp;#xC6D0;&amp;#xC744; &amp;#xB118;&amp;#xC5B4;, &amp;#xBD80;&amp;#xD305;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xB364;&amp;#xD504;&amp;#xC5D0; &amp;#xC774;&amp;#xB974;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; I/O &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xAC80;&amp;#xC99D; &amp;#xC2E4;&amp;#xD328;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xC9C0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC804;&amp;#xBA74; &amp;#xC7AC;&amp;#xC124;&amp;#xACC4;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB300;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xB3D9;&amp;#xBC18;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.. &amp;#xB610;&amp;#xD55C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC139;&amp;#xD130;&amp;#xC5D0; MAC &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xAC04; &amp;#xD6A8;&amp;#xC728;&amp;#xC131; &amp;#xC800;&amp;#xD558;, I/O &amp;#xC131;&amp;#xB2A5; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBB3C;&amp;#xB860;, &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBD80;&amp;#xBD84; &amp;#xC4F0;&amp;#xAE30; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC;&amp;#xC758; &amp;#xBD88;&amp;#xC77C;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB3C4; &amp;#xC791;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC190;&amp;#xC0C1;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5C4;&amp;#xACA9;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xC2E4;&amp;#xD328;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCFC;&amp;#xB968; &amp;#xC804;&amp;#xCCB4;&amp;#xC758; &amp;#xB9C8;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC70;&amp;#xBD80;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC6A9;&amp;#xC131; &amp;#xC800;&amp;#xD558; &amp;#xC6B0;&amp;#xB824;&amp;#xB85C; &amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xB300;&amp;#xCC45;&amp;#xC744; &amp;#xB9C8;&amp;#xB828;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-CASE-CVE-2025-21210-CrashXTS&#34;&gt;&lt;a href=&#34;#2-3-CASE-CVE-2025-21210-CrashXTS&#34; class=&#34;headerlink&#34; title=&#34;2.3 CASE: CVE-2025-21210 (CrashXTS)&#34;&gt;&lt;/a&gt;2.3 CASE: CVE-2025-21210 (CrashXTS)&lt;/h3&gt;&lt;p&gt;&amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130;&amp;#xB294; &amp;#xAC19;&amp;#xC740; tweak&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; XTS&amp;#xC758; &amp;#xC131;&amp;#xC9C8;&amp;#xC740;, &amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xC640; &amp;#xAC19;&amp;#xC740; FVEK&amp;#xAC00; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xAC19;&amp;#xC740; &amp;#xD3C9;&amp;#xBB38;&amp;#xC740; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xBA70;, &amp;#xBD80;&amp;#xD305;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC740; &amp;#xC77C;&amp;#xC815;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; XTS&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Write primitive&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0;&amp;#xB9CC; Corrupt&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB3D9;&amp;#xC791; &amp;#xACBD;&amp;#xB85C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &lt;a href=&#34;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&#34;&gt;CrashXTS&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C0;&amp;#xB294; CVE-2025-21210&lt;/a&gt;&amp;#xAC00; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC5D0;&amp;#xC11C; BitLocker&amp;#xAC00; &amp;#xC815;&amp;#xC0C1; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; I/O&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &lt;code&gt;fvevol.sys&lt;/code&gt; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; XTS-AES &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158;&amp;#xCC98;&amp;#xB7FC; &amp;#xC815;&amp;#xC0C1; &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xCD5C;&amp;#xC18C; &amp;#xB364;&amp;#xD504; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC4F0;&amp;#xB294; &amp;#xD2B9;&amp;#xC218; &amp;#xACBD;&amp;#xB85C;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294;, &amp;#xC77C;&amp;#xBC18; I/O &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD544;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; BitLocker&amp;#xB294; &lt;code&gt;dumpfve.sys&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB364;&amp;#xD504; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD574;, &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB420; &amp;#xB54C;&amp;#xB3C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC720;&amp;#xC9C0;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218;&amp;#xB294; &lt;code&gt;SYSTEM\CurrentControlSet\Control\CrashControl&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC758; DumpFilters&amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xACFC;&amp;#xC815; &lt;code&gt;FveGroupPolicyGetMultiSzValue()&lt;/code&gt;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xACE0;, &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC21C;&amp;#xD68C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;dumpfve.sys&lt;/code&gt;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &lt;code&gt;_wcsicmp()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;code&gt;dumpfve.sys&lt;/code&gt;&amp;#xAC00; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xD30C;&amp;#xC2F1;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xC989;&amp;#xC2DC; &amp;#xC911;&amp;#xB2E8;&amp;#xD558;&amp;#xACE0;, &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB364;&amp;#xD504; &amp;#xD544;&amp;#xD130;&amp;#xAC00; &amp;#xBE60;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; XTS&amp;#xAE30;&amp;#xBC18; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. XTS&amp;#xC758; &amp;#xC131;&amp;#xC9C8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC131; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xAE68;&amp;#xB728;&amp;#xB9AC;&amp;#xBA74;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD30C;&amp;#xC11C;&amp;#xAC00; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC774; Corrupt&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xAE30;&amp;#xB300;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD654;&amp;#xBA74;&amp;#xC740; SYSTEM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ControlSet&amp;#x2026;\Control\CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; Hex &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD; ASCII &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &lt;code&gt;CrashControl&lt;/code&gt;, &lt;code&gt;AutoReboot&lt;/code&gt;, &lt;code&gt;CrashDumpEnabled&lt;/code&gt;, &lt;code&gt;DumpFile&lt;/code&gt;, &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC74; &lt;strong&gt;&amp;#xD0A4;/&amp;#xAC12; &amp;#xC774;&amp;#xB984;&lt;/strong&gt;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;XTS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD3C9;&amp;#xBB38;&amp;#xC774; &amp;#xD1B5;&amp;#xC81C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC548;&amp;#xC758; 4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC9DC;&amp;#xB9AC; &amp;#xC774; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xB178;&amp;#xB824;&amp;#xC11C; &amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xD558;&amp;#xBA74;, &amp;#xCEE4;&amp;#xB110; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xAC12;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB85C;&amp;#xB354;&amp;#xAC00; &lt;strong&gt;&amp;#xAC12; &amp;#xBAA9;&amp;#xB85D; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xBABB; &amp;#xCC3E;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xAC78; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;DumpFilters&lt;/code&gt;&amp;#xB97C; &amp;#xAE68;&amp;#xB728;&amp;#xB9AC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC218;&amp;#xC2ED; GB &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8;, &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &lt;code&gt;0x13B330&lt;/code&gt; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;, &amp;#xADF8; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBA87;&amp;#xC2ED; &amp;#xAC1C; &amp;#xBE14;&amp;#xB85D;&amp;#xB9CC; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xAE68;&amp;#xB728;&amp;#xB824;&amp;#xBCF4;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xB7B5; 248&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &lt;code&gt;DumpFilter&lt;/code&gt; &amp;#xAD00;&amp;#xB828; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Hex &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0;, 248&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xB7B5; 15.5 &amp;#xBE14;&amp;#xB85D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;+0xF0&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;+0x100&lt;/code&gt; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xD6C4;&amp;#xBCF4; &amp;#xBE14;&amp;#xB85D;&amp;#xC73C;&amp;#xB85C; &amp;#xC7A1;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCFC;&amp;#xB968; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC788;&amp;#xACE0;, &amp;#xADF8; &amp;#xC911; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAC19;&amp;#xC740; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB9B0; &amp;#xC167;&amp;#xB2E4;&amp;#xC6B4;, &amp;#xAC15;&amp;#xC81C;&amp;#xC885;&amp;#xB8CC;, &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD6C4; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC2DC;&amp;#xC791; &amp;#xADFC;&amp;#xCC98;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; BSOD &amp;#xC774;&amp;#xD6C4; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &lt;code&gt;LastCrashDump&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xD718;&amp;#xBC1C;&amp;#xC131; &amp;#xC11C;&amp;#xBE0C;&amp;#xD0A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xB2E4;&amp;#xAC00; &amp;#xD074;&amp;#xB9B0; &amp;#xC885;&amp;#xB8CC; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xD544;&amp;#xB4DC; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xD6D1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB531; &amp;#xADF8; &amp;#xD328;&amp;#xD134;&amp;#xB300;&amp;#xB85C; &amp;#xBCC0;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC744; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC815;&amp;#xC0C1; &amp;#xBD80;&amp;#xD305; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 ad 71 01 42 ed f0 da 01    ....nk ..q.B....
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e300&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; e8 &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ................
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e310&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt; f4 a7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ({t........&lt;span class=&#34;hljs-number&#34;&gt;.8&lt;/span&gt;...
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e320&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ..F..... .......
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e330&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ,..&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;...........
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e340&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    CrashControl....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;/BSOD &amp;#xC9C1;&amp;#xD6C4; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 73 62 74 ab 14 f7 da 01    ....nk ..sbt.....
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e300&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; e8 &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ................
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e310&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; c8 &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt; f4 a7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ({t........&lt;span class=&#34;hljs-number&#34;&gt;.8&lt;/span&gt;...
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e320&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ..F..... .......
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e330&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ,..&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;...........
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e340&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    CrashControl....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB450; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xBA3C;&amp;#xC800; &amp;#xB208;&amp;#xC5D0; &amp;#xB744;&amp;#xB294; &amp;#xAC74;, &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC720;&amp;#xC9C0;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB450; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;0x0056e340&lt;/code&gt; &amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; &amp;#xC0AC;&amp;#xB77C;&amp;#xC838;&amp;#xC11C; &amp;#xBABB; &amp;#xCC3E;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC744; &amp;#xAE30;&amp;#xC220;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C;, &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xB4A4;&amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xD544;&amp;#xB4DC;&amp;#xB9CC; &amp;#xC120;&amp;#xD0DD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB294; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB364;&amp;#xD504;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC15;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x00000000  9c 1e d1 7a 39 39 d4 13 0c d4 40 c5 a8 6f c4 de    ...z99....@..o..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000010&lt;/span&gt;  e0 &lt;span class=&#34;hljs-number&#34;&gt;79&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d dd &lt;span class=&#34;hljs-number&#34;&gt;66&lt;/span&gt; e2 &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt; b0 &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;58&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;06&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;d    .y.-.f.%.H.XS/.]
&lt;span class=&#34;hljs-number&#34;&gt;0x00000020&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; ac c3 &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;86&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;64&lt;/span&gt; e2 d9 &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e d0 &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;11&lt;/span&gt; ee &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;d    t..Q..td..n....M
&lt;span class=&#34;hljs-number&#34;&gt;0x00000030&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;05&lt;/span&gt; e0 bc &lt;span class=&#34;hljs-number&#34;&gt;37&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;41&lt;/span&gt; c1 &lt;span class=&#34;hljs-number&#34;&gt;3f&lt;/span&gt; a2 &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;09&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt;    .@.R..&lt;span class=&#34;hljs-number&#34;&gt;.7&lt;/span&gt;A.?.~*..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; dc b8 &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; c8 &lt;span class=&#34;hljs-number&#34;&gt;81&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d c6 &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;39&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt;    $...j ..-.a09&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;Q
&lt;span class=&#34;hljs-number&#34;&gt;0x00000050&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;31&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;96&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;c f2 ad &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt; f9 ce &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;    &lt;span class=&#34;hljs-number&#34;&gt;1.&lt;/span&gt;.t......(&amp;amp;....
&lt;span class=&#34;hljs-number&#34;&gt;0x00000060&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;23&lt;/span&gt; fd d1 &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;45&lt;/span&gt; f0 c1 &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt; bb e5 &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt; bf b6 &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;17&lt;/span&gt;    .#...E........s.
&lt;span class=&#34;hljs-number&#34;&gt;0x00000070&lt;/span&gt;  f0 e3 &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt; f2 &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;91&lt;/span&gt; bd e5 &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;e b3 a7 &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;c bf    ..P.|&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;{...^..ML.
&lt;span class=&#34;hljs-number&#34;&gt;0x00000080&lt;/span&gt;  db f0 de &lt;span class=&#34;hljs-number&#34;&gt;96&lt;/span&gt; ba &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt; d9 &lt;span class=&#34;hljs-number&#34;&gt;09&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;83&lt;/span&gt; b2 fb &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;a f4 &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt; aa    .....P..=....&lt;span class=&#34;hljs-number&#34;&gt;.5&lt;/span&gt;.&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x00000000  48 49 42 52 09 00 00 00 33 c0 00 00 d8 04 00 00    HIBR....3.......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000010&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;04&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    .&amp;gt;..............
&lt;span class=&#34;hljs-number&#34;&gt;0x00000020&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; b2 &lt;span class=&#34;hljs-number&#34;&gt;1f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2b&lt;/span&gt; f7 da &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;07&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    &amp;gt;s..+...&amp;gt;..*....
&lt;span class=&#34;hljs-number&#34;&gt;0x00000030&lt;/span&gt;  ff bd &lt;span class=&#34;hljs-number&#34;&gt;9b&lt;/span&gt; bd &lt;span class=&#34;hljs-number&#34;&gt;7f&lt;/span&gt; a4 &lt;span class=&#34;hljs-number&#34;&gt;5f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;06&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; ca &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ......_.........
&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;44&lt;/span&gt; a8 &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; c2 ff ff &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    &lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;D.........N!..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000050&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; d7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;34&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;54&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    a......&lt;span class=&#34;hljs-number&#34;&gt;.4&lt;/span&gt;T......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000060&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ........,.......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000070&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; fc &lt;span class=&#34;hljs-number&#34;&gt;57&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    |........W......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000080&lt;/span&gt;  a7 bf &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;82&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;99&lt;/span&gt; a9 &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ...........h....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;exploit &amp;#xC804;&amp;#xD6C4;&amp;#xC758; raw &amp;#xC139;&amp;#xD130;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xBA74;, exploit &amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xD2B9;&amp;#xC131;&amp;#xC0C1; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC5F4;&amp;#xC774; &amp;#xAD00;&amp;#xCC30;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, exploit &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;HIBR&lt;/code&gt; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xAD00;&amp;#xCC30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC989;, &amp;#xD2B9;&amp;#xC218; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-4-Reliability-vs-Randomization&#34;&gt;&lt;a href=&#34;#2-4-Reliability-vs-Randomization&#34; class=&#34;headerlink&#34; title=&#34;2.4 Reliability vs. Randomization&#34;&gt;&lt;/a&gt;2.4 Reliability vs. Randomization&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; CrashXTS &amp;#xAC19;&amp;#xC740; &amp;#xD655;&amp;#xB960;&amp;#xC801; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC740; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBD80;&amp;#xC7AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; corrupt&amp;#xC778;&amp;#xB370;, &amp;#xC774; &amp;#xBC18;&amp;#xC751;&amp;#xC740; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB098; &amp;#xBC84;&amp;#xC804;, &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC27D;&amp;#xAC8C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xD2B9;&amp;#xC9D5; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC19;&amp;#xC740; Windows &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xC124;&amp;#xCE58; &amp;#xC774;&amp;#xB825;, &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC5ED;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC124;&amp;#xCE58;/&amp;#xC81C;&amp;#xAC70;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xD30C;&amp;#xC77C; &amp;#xBC30;&amp;#xCE58;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCC28;&amp;#xB4F1; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xAC00; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; BitLocker &amp;#xC815;&amp;#xCC45;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC7AC;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B4;&amp;#xC601; &amp;#xC774;&amp;#xB825;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xBBC0;&amp;#xB85C; &amp;#xD55C; &amp;#xBC88; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xC704;&amp;#xCE58;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC804;&amp;#xD600; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;3-Conclusion&#34;&gt;&lt;a href=&#34;#3-Conclusion&#34; class=&#34;headerlink&#34; title=&#34;3. Conclusion&#34;&gt;&lt;/a&gt;&lt;strong&gt;3. Conclusion&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; CrashXTS&amp;#xB294; XTS&amp;#xC758; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xC2E4;&amp;#xC99D;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC6A9;&amp;#xC131; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC18C; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; Part&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; BitLocker&amp;#xC758; &amp;#xC774;&amp;#xB7F0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBAA8;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC790;&amp;#xCCB4;&amp;#xC758; corrupt&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294;, &lt;strong&gt;WinRE &amp;#xAC80;&amp;#xC99D; &amp;#xB204;&amp;#xB77D;, &amp;#xBCF5;&amp;#xAD6C; &amp;#xACBD;&amp;#xB85C; &amp;#xACB0;&amp;#xD568;, &amp;#xD0A4; &amp;#xAD00;&amp;#xB9AC; &amp;#xC2E4;&amp;#xC218;&lt;/strong&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; exploit&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F604;&lt;/p&gt;
&lt;h2 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&#34;&gt;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf?utm_source=chatgpt.com&#34;&gt;https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&#34;&gt;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/&#34;&gt;https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Unlocking BitLocker: Windows Full-Disk Encryption Under Attack: Part 1 (KR) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;1-Introduction&#34;&gt;&lt;a href=&#34;#1-Introduction&#34; class=&#34;headerlink&#34; title=&#34;1. Introduction&#34;&gt;&lt;/a&gt;1. Introduction&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/logo.jpg&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xC740; Windows &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB0B4;&amp;#xC7A5;&amp;#xB41C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC73C;&amp;#xB85C;, &amp;#xC7A5;&amp;#xCE58;&amp;#xAC00; &amp;#xBD84;&amp;#xC2E4;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xB3C4;&amp;#xB09C;&amp;#xB418;&amp;#xC5B4; &amp;#xC624;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xB3C4; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC77D;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xC7A5;&amp;#xCE58;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. BitLocker&amp;#xC740; XTS-AES&amp;#xC640; TPM&amp;#xC758; &amp;#xACB0;&amp;#xD569; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xC790;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; AES-XTS &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBC1C;&amp;#xACAC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;a href=&#34;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&#34;&gt;BitLocker CrashXTS&lt;/a&gt;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-&amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xC774;&amp;#xD574;&#34;&gt;&lt;a href=&#34;#1-1-&amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xC774;&amp;#xD574;&#34; class=&#34;headerlink&#34; title=&#34;1.1 &amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xD574;&#34;&gt;&lt;/a&gt;1.1 &amp;#xBD80;&amp;#xD305;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC774;&amp;#xD574;&lt;/h3&gt;&lt;p&gt;UEFI &amp;#xD38C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; EFI System Partition(ESP)&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBA85;&amp;#xB41C; bootmgfw.efi&amp;#xC640; BCD(&amp;#xBD80;&amp;#xD305; &amp;#xAD6C;&amp;#xC131; &amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC774;&amp;#xBA70;, &amp;#xC774; &amp;#xAD6C;&amp;#xAC04;&amp;#xC740; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Secure Boot&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xD305; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xCCB4;&amp;#xC778;&amp;#xC758; DBX&amp;#xB97C; &amp;#xAC80;&amp;#xC0AC;&amp;#xD574; &amp;#xC2E0;&amp;#xB8B0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ESP &amp;#xBD80;&amp;#xD2B8; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xC77D;&amp;#xD788;&amp;#xB418;, &amp;#xC2E0;&amp;#xB8B0; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; VMK unseal&amp;#xC774; &amp;#xAC70;&amp;#xBD80;&amp;#xB418;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C; &amp;#xACBD;&amp;#xB85C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TPM &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCE69;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. BitLocker&amp;#xB294; &amp;#xBCFC;&amp;#xB968; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xC790;(Key Protector)&amp;#xC640; &amp;#xD0A4; &amp;#xACC4;&amp;#xCE35;&amp;#xC744; &amp;#xAE30;&amp;#xC220;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; VMK(Volume Master Key)&amp;#xC640; FVEK(Full Volume Encryption Key)&amp;#xC758; 2&amp;#xACC4;&amp;#xCE35; &amp;#xD0A4; &amp;#xC124;&amp;#xACC4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638;&amp;#xD654;/&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xAC83;&amp;#xC740; FVEK&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &lt;code&gt;manage-bde -protectors -get C:&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC73C;&amp;#xB85C; C: &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xD0A4; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;(Key Protector)&amp;#xB97C; &amp;#xC870;&amp;#xD68C;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xC22B;&amp;#xC790; &amp;#xC554;&amp;#xD638;&amp;#xB294; VMK&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;, &amp;#xC815;&amp;#xC0C1; &amp;#xBD80;&amp;#xD305; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; TPM &amp;#xAE30;&amp;#xBC18; unseal&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF5;&amp;#xAD6C; &amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB420; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xBCF5;&amp;#xAD6C; &amp;#xC218;&amp;#xB2E8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; BitLocker &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, VMK&amp;#xB97C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30; &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD0A4; &amp;#xACC4;&amp;#xCE35;(VMK &amp;#x2192; FVEK)&amp;#xC774; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xD568;&amp;#xAED8; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70;, &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; FVEK&amp;#xAC00; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; 2&amp;#xACC4;&amp;#xCE35; &amp;#xD0A4; &amp;#xC124;&amp;#xACC4;&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;, &amp;#xAC01; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC801;&amp;#xC778; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; TPM, VMK, FVEK&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TPM&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;TPM&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;, &amp;#xCE74;&amp;#xC6B4;&amp;#xD130; &amp;#xB4F1;&amp;#xC744; &amp;#xCE69; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xACA9;&amp;#xB9AC;&amp;#xD574; &amp;#xBCF4;&amp;#xAD00;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#x2018;&amp;#xBBFF;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xBD80;&amp;#xD305;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#x2019; &amp;#xBD80;&amp;#xD305; &amp;#xC2E0;&amp;#xB8B0;&amp;#xB3C4; &amp;#xCE21;&amp;#xC815;&amp;#xAC12;(PCR - Platform Configuration Register)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;&amp;#xB97C; &amp;#xAEBC;&amp;#xB0B4; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; dTPM &amp;#xD558;&amp;#xB4DC;&amp;#xC6E8;&amp;#xC5B4; &amp;#xCE69;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xB294; VMK&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; PCR &amp;#xAC12;&amp;#xC5D0; seal&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; PCR 7(Secure Boot &amp;#xC0C1;&amp;#xD0DC;, UEFI &amp;#xBCC0;&amp;#xC218;, Boot Manager &amp;#xCF54;&amp;#xB4DC;)&amp;#xACFC; PCR 11(BitLocker &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xBD80;&amp;#xD305; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC774;&amp;#xBA74; TPM&amp;#xC740; VMK &amp;#xD574;&amp;#xC81C;(unseal)&amp;#xB97C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBD80;&amp;#xD305; &amp;#xCCB4;&amp;#xC778;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; PCR &amp;#xAC12;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC838; unseal&amp;#xC774; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xACE0; &amp;#xBCF5;&amp;#xAD6C; &amp;#xD654;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;VMK (Volume Master Key)&lt;/strong&gt;&lt;br&gt;VMK&amp;#xB294; FVEK&amp;#xB97C; &amp;#xBCF4;&amp;#xD638;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xC704; &amp;#xD0A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. VMK&amp;#xB97C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; FVEK&amp;#xB97C; &amp;#xD480; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC139;&amp;#xD130; &amp;#xD3C9;&amp;#xBB38;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. VMK&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBCF4;&amp;#xD638;&amp;#xC790;&amp;#xB85C; &amp;#xB798;&amp;#xD551;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;TPM Protector: TPM PCR&amp;#xC5D0; &amp;#xBC14;&amp;#xC778;&amp;#xB529;&lt;/li&gt;
&lt;li&gt;Recovery Password Protector: 48&amp;#xC790;&amp;#xB9AC; &amp;#xC22B;&amp;#xC790; &amp;#xBCF5;&amp;#xAD6C; &amp;#xD0A4;&lt;/li&gt;
&lt;li&gt;Password Protector: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC554;&amp;#xD638;&lt;/li&gt;
&lt;li&gt;TPM+PIN Protector: TPM&amp;#xACFC; PIN &amp;#xC870;&amp;#xD569;  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;FVEK (Full Volume Encryption Key)&lt;/strong&gt;&lt;br&gt;FVEK&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC2E4;&amp;#xC81C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD558;&amp;#xBA70;, FVEK&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;, &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. FVEK&amp;#xB294; AES-256(&amp;#xB610;&amp;#xB294; AES-128) &amp;#xD0A4;&amp;#xC774;&amp;#xBA70;, XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; 512&amp;#xBE44;&amp;#xD2B8;(&amp;#xB610;&amp;#xB294; 256&amp;#xBE44;&amp;#xD2B8;)&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC808;&amp;#xBC18;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC6A9;(K1), &amp;#xC808;&amp;#xBC18;&amp;#xC740; tweak &amp;#xC0DD;&amp;#xC131;&amp;#xC6A9;(K2)&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!  &lt;br&gt;&lt;br&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;BitLocker &amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xB3D9;&amp;#xC791; &amp;#xC6D0;&amp;#xB9AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC624;&amp;#xBA74; BitLocker &amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC778; fvevol.sys&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; I/O&amp;#xB97C; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xAC78; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xB54C; &lt;code&gt;winload.efi&lt;/code&gt;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xACFC; &lt;code&gt;BOOT_START(0)&lt;/code&gt; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB4E4;&amp;#xC744; &amp;#xC801;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;fvevol.sys&lt;/code&gt;&amp;#xB3C4; &amp;#xD568;&amp;#xAED8; &amp;#xBA3C;&amp;#xC800; &amp;#xC62C;&amp;#xB77C;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xC740; NTFS&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xB9C8;&amp;#xC6B4;&amp;#xD2B8;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD0A4;&amp;#xAC00; &amp;#xC900;&amp;#xBE44;&amp;#xB418;&amp;#xAE30; &amp;#xC804; &amp;#xBD80;&amp;#xD305; &amp;#xCD08;&amp;#xAE30;&amp;#xC5D0; TPM&amp;#xC758; PCR 7/11 &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC544;&amp;#xC9C1; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; VMK/FVEK&amp;#xC774; &amp;#xC900;&amp;#xBE44; &amp;#xC804; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC77C; &amp;#xB54C;, &lt;code&gt;fvevol.sys&lt;/code&gt;&amp;#xB294; locked &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; bootmgr&amp;#xB098; winload&amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xD2B8; &amp;#xD658;&amp;#xACBD;&amp;#xC774; FVE-FS(&amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; TPM &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, VMK&amp;#xB97C; unseal &amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0; FVEK&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;VMK&amp;#xAC00; unseal&amp;#xB418;&amp;#xACE0; FVEK&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xB41C; &amp;#xC2DC;&amp;#xC810;&amp;#xC77C; &amp;#xB54C;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C;&amp;#xC57C; fvevol&amp;#xC740; unlocked &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD574;&amp;#xB2F9; &amp;#xBCFC;&amp;#xB968;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; I/O&amp;#xB294; &amp;#xAC01; FVEK&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD22C;&amp;#xBA85; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.  &lt;br&gt;&lt;br&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC989;, &lt;code&gt;&amp;#xC571;/&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&lt;/code&gt; &amp;#x2192; &lt;code&gt;NTFS(ReFS)&lt;/code&gt; &amp;#x2192; &lt;code&gt;I/O Manager&lt;/code&gt; &amp;#x2192; &lt;code&gt;[fvevol]&lt;/code&gt; &amp;#x2192; &lt;code&gt;volmgr/&amp;#xC800;&amp;#xC7A5;&amp;#xC18C; &amp;#xD074;&amp;#xB798;&amp;#xC2A4;&lt;/code&gt; &amp;#x2192; &lt;code&gt;&amp;#xD3EC;&amp;#xD2B8;/&amp;#xBBF8;&amp;#xB2C8;&amp;#xD3EC;&amp;#xD2B8;(NVMe/SATA)&lt;/code&gt; &amp;#x2192; &lt;code&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&lt;/code&gt; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB824;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;BitLocker&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778; &lt;strong&gt;XTS-AES&lt;/strong&gt;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA70;, &amp;#xAC01; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &lt;strong&gt;tweak &amp;#xAC12;(&amp;#xC139;&amp;#xD130;/&amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xAE30;&amp;#xBC18;)&lt;/strong&gt;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD3C9;&amp;#xBB38;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB978; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC124;&amp;#xACC4;&amp;#xB294; CTR/CBC &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB358; &lt;strong&gt;malleability(&amp;#xBCC0;&amp;#xD615; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;)&lt;/strong&gt;, &amp;#xC989; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC644;&amp;#xD654;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB3C4;&amp;#xC785;&amp;#xB41C; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; XTS &amp;#xAD6C;&amp;#xC870;&amp;#xC870;&amp;#xCC28; &amp;#xC644;&amp;#xBCBD;&amp;#xD788; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xC624;&amp;#xB298; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-Windows&amp;#xC758;-AES-CBC&amp;#xC640;-AES-XTS-&amp;#xC6B4;&amp;#xC6A9;-&amp;#xBAA8;&amp;#xB4DC;&#34;&gt;&lt;a href=&#34;#2-Windows&amp;#xC758;-AES-CBC&amp;#xC640;-AES-XTS-&amp;#xC6B4;&amp;#xC6A9;-&amp;#xBAA8;&amp;#xB4DC;&#34; class=&#34;headerlink&#34; title=&#34;2. Windows&amp;#xC758; AES-CBC&amp;#xC640; AES-XTS &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&#34;&gt;&lt;/a&gt;2. Windows&amp;#xC758; AES-CBC&amp;#xC640; AES-XTS &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&lt;/h2&gt;&lt;h3 id=&#34;2-1-XTS&amp;#xC758;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;a href=&#34;#2-1-XTS&amp;#xC758;-&amp;#xC554;&amp;#xD638;&amp;#xD654;-&amp;#xBC29;&amp;#xC2DD;&#34; class=&#34;headerlink&#34; title=&#34;2.1 XTS&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.1 XTS&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&amp;#xC55E;&amp;#xC11C; BitLocker&amp;#xAC00; FVEK&amp;#xB85C; &amp;#xC139;&amp;#xD130; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC624;&amp;#xB298; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;&amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB77C;&amp;#xB294; &amp;#xB9E4;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&amp;#x2019;&lt;/strong&gt;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB46C;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD78C;&amp;#xD2B8;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; &amp;#x2018;&amp;#xC139;&amp;#xD130;&amp;#xB77C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xB294; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xB9E4;&amp;#xCCB4;&amp;#x2019;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; BitLocker&amp;#xB294; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; &amp;#xC561;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638; &amp;#xC6B4;&amp;#xC6A9; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5EC;&amp;#xC57C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows 11&amp;#xBD80;&amp;#xD130; BitLocker&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC874;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB358; AES-CBC &amp;#xB300;&amp;#xC2E0; AES-XTS&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6C;&amp;#xC870;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xB294; attack surface&amp;#xB97C; &amp;#xC904;&amp;#xC774;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;
C_i = E_K\!\left(P_i \oplus C_{i-1}\right)&lt;/script&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;
P_i = D_K\!\left(C_i\right) \oplus C_{i-1}&lt;/script&gt;&lt;p&gt;CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xC8E0;? CBC &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xC554;&amp;#xD638;&amp;#xC778; AES&amp;#xB97C; &amp;#xCCB4;&amp;#xC778;&amp;#xCC98;&amp;#xB7FC; &amp;#xC5EE;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC778;&amp;#xB370;, CBC &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC5F0;&amp;#xC1C4; &amp;#xAD6C;&amp;#xC870; (Chaining Dependency)&lt;/strong&gt;&lt;br&gt;CBC&amp;#xB294; &amp;#xBCF8;&amp;#xC9C8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC55E; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB4A4; &amp;#xBE14;&amp;#xB85D;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xCC98;&amp;#xB7FC; &amp;#xC911;&amp;#xAC04; &amp;#xBE14;&amp;#xB85D;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFD4; &amp;#xC4F0;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xAE4C;&amp;#xB2E4;&amp;#xB86D;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xAC31;&amp;#xC2E0;&amp;#xB418;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0;, OS&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xC139;&amp;#xD130;&amp;#xB9CC; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#xC131;&amp;#xB2A5; &amp;#xC800;&amp;#xD558;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBE44;&amp;#xD2B8; &amp;#xD50C;&amp;#xB9BD; &amp;#xACF5;&amp;#xACA9; (Bit Flipping)&lt;/strong&gt;&lt;br&gt;CBC &amp;#xBCF5;&amp;#xD638; &amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB4EF;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC704;&amp;#xCE58; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xD799;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;IV(Initialization Vector) &amp;#xAD00;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&lt;br&gt;&amp;#xAC01; &amp;#xC139;&amp;#xD130;&amp;#xB9C8;&amp;#xB2E4; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; IV&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, IV&amp;#xB97C; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xACE0;, &amp;#xB79C;&amp;#xB364; IV&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xCD94;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5; &amp;#xACF5;&amp;#xAC04;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC; &amp;#xB54C;, &amp;#xACFC;&amp;#xAC70; CBC &amp;#xAE30;&amp;#xBC18; FDE&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC0C1;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBE44;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD574; &amp;#xBD80;&amp;#xD2B8;&amp;#xB85C;&amp;#xB354;&amp;#xB098; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC545;&amp;#xC131; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC774;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xADF8;&amp;#xAC04; CBC &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC801; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778; &amp;#xAC00;&amp;#xB2E8;&amp;#xC131;(Malleability)&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBD80;&amp;#xD2B8; &amp;#xC139;&amp;#xD130;&amp;#xB098; OS &amp;#xC911;&amp;#xC694; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB420; &amp;#xC704;&amp;#xD5D8;&amp;#xC774; &amp;#xC81C;&amp;#xAE30;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; 2008&amp;#xB144; TrueCrypt 5.0&amp;#xC774; &lt;strong&gt;XTS-AES&lt;/strong&gt;&amp;#xB97C; &amp;#xB3C4;&amp;#xC785;&amp;#xD588;&amp;#xACE0;, &amp;#xC774;&amp;#xD6C4; Microsoft &amp;#xC5ED;&amp;#xC2DC; Windows 10&amp;#xBD80;&amp;#xD130; BitLocker&amp;#xC758; &amp;#xAE30;&amp;#xBCF8; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD45C;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; XTS-AES&amp;#xB97C; &amp;#xCC44;&amp;#xD0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xC704;&amp;#xD611;&amp;#xC5D0; &amp;#xB300;&amp;#xC751;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; XTS &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC758; &amp;#xC758; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC744; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; XTS&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xB9C8;&amp;#xB2E4; tweak&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC50C;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; tweak&amp;#xB77C;&amp;#xB294; &amp;#xAC12;&amp;#xC740; &amp;#x2018;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC704;&amp;#xCE58;&amp;#x2019;&amp;#xC5D0;&amp;#xC11C; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xB09C;&amp;#xC218; &amp;#xAC12;&amp;#xC774;&amp;#xBA70;, &amp;#xC774; &amp;#xAC12;&amp;#xC740; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xC640; &amp;#xC139;&amp;#xD130; &amp;#xB0B4; &amp;#xBE14;&amp;#xB85D; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB294; 512B(4KB)&amp;#xAC19;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xC139;&amp;#xD130;&amp;#xB85C; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F0;&amp;#xACE0;, AES&amp;#xB294; 16B &amp;#xBE14;&amp;#xB85D;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; 512B &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; 32&amp;#xAC1C;&amp;#xB85C; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xB098;&amp;#xB258;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, XTS&amp;#xB294; &amp;#xC774; 16B &amp;#xBE14;&amp;#xB85D;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC11C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB978; tweak&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;
T_i = \mathrm{Tweak}_{K_2}(s, j)&lt;/script&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;
C_i = E_{K_1}\!\left(P_i \oplus T_i\right) \oplus T_i&lt;/script&gt;&lt;p&gt;XTS&amp;#xB294; Key&amp;#xB97C; &amp;#xB450; &amp;#xAC1C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Key1&lt;/code&gt;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC640; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &lt;code&gt;Key2&lt;/code&gt;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC704;&amp;#xCE58; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC740; tweak&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC19;&amp;#xC740; XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD2B9;&amp;#xC815; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574;&amp;#xB3C4;, &lt;strong&gt;&lt;em&gt;&amp;#xBE44;&amp;#xC120;&amp;#xD615;&amp;#xC131;&lt;/em&gt;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC00; &amp;#xC608;&amp;#xCE21; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xC5D0; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xC190;&amp;#xC0C1;&amp;#xC774; &amp;#xC774;&amp;#xB904;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, CBC&amp;#xCC98;&amp;#xB7FC; &amp;#xBC14;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD2B9;&amp;#xC815; &amp;#xBE44;&amp;#xD2B8;&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xAD50;&amp;#xD55C; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;h3 id=&#34;2-2-XTS&amp;#xC758;-&amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACFC;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#2-2-XTS&amp;#xC758;-&amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0;-&amp;#xBABB;&amp;#xD55C;-&amp;#xACFC;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;2.2 XTS&amp;#xC758; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xACFC;&amp;#xC81C;&#34;&gt;&lt;/a&gt;&lt;strong&gt;2.2 XTS&amp;#xC758; &amp;#xD574;&amp;#xACB0;&amp;#xB418;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xACFC;&amp;#xC81C;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; XTS&amp;#xB294; &amp;#xC5EC;&amp;#xC804;&amp;#xD788; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1. &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638; &amp;#xBD80;&amp;#xC7AC;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; &amp;#xC870;&amp;#xC791; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC870;&amp;#xC791; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC70;&amp;#xBD80;&amp;#xD558;&amp;#xB294; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBCF4;&amp;#xD638;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBC14;&amp;#xAFB8;&amp;#xBA74;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xADF8; &amp;#xBCC0;&amp;#xC870; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xAC10;&amp;#xC9C0;&amp;#xD574;&amp;#xC11C; &amp;#xC911;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC740; &amp;#xC774; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xADF8;&amp;#xB0E5; &amp;#xBCF5;&amp;#xD638;&amp;#xD574;&amp;#xC11C; &amp;#xAE68;&amp;#xC9C4; &amp;#xD3C9;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2. &amp;#xC138;&amp;#xBD84;&amp;#xD654;&amp;#xB41C; &amp;#xBCC0;&amp;#xC870; &amp;#xD0D0;&amp;#xC9C0;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC139;&amp;#xD130;&amp;#xB098; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xC758; &amp;#xBCC0;&amp;#xD654;&amp;#xB97C; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xACA9;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; CBC&amp;#xBCF4;&amp;#xB2E4; &amp;#xC138;&amp;#xBD84;&amp;#xC131;&amp;#xC774; &amp;#xC88B;&amp;#xC544;&amp;#xC11C;, &amp;#xBCC0;&amp;#xD615;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xD2B9;&amp;#xC815; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC720;&amp;#xC6A9;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xC804;&amp;#xCCB4; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC27D;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3. Copy-Paste &amp;#xACF5;&amp;#xACA9;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD3C9;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC139;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; &amp;#xD56D;&amp;#xC0C1; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC774;&amp;#xC804; &amp;#xBC84;&amp;#xC804; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xAC70;&amp;#xB098;, &amp;#xB2E4;&amp;#xB978; &amp;#xC139;&amp;#xD130;&amp;#xC758; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574; &amp;#xBD99;&amp;#xC5EC;&amp;#xB123;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;4. &amp;#xC881;&amp;#xC740; &amp;#xBE14;&amp;#xB85D; &amp;#xD06C;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;XTS&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD3C9;&amp;#xBB38; &amp;#xD328;&amp;#xD134;&amp;#xC774; &amp;#xBC18;&amp;#xBCF5;&amp;#xB418;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD328;&amp;#xD134;&amp;#xC774; &amp;#xAD00;&amp;#xCC30;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; BitLocker &amp;#xBCFC;&amp;#xB968;&amp;#xC5D0;&amp;#xC11C; XTS-AES&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBD80;&amp;#xC7AC;&amp;#xB97C; &amp;#xC9C1;&amp;#xAD00;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; BitLocker&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C; &amp;#xBCFC;&amp;#xB968; V:&amp;#xC5D0; 16MiB &amp;#xD06C;&amp;#xAE30; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xC0DD;&amp;#xC131; &amp;#xC9C1;&amp;#xD6C4; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; SHA-256 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xAE30;&amp;#xC900;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD6C4; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xC7A0;&amp;#xADFC; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC6D0;&amp;#xC2DC; &amp;#xC601;&amp;#xC5ED;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD3B8;&amp;#xC9D1;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC77C;&amp;#xBD80; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCFC;&amp;#xB968;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xB4A4; &amp;#xB3D9;&amp;#xC77C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; SHA-256 &amp;#xD574;&amp;#xC2DC;&amp;#xB97C; &amp;#xC7AC;&amp;#xACC4;&amp;#xC0B0;&amp;#xD574; &amp;#xAE30;&amp;#xC900;&amp;#xAC12;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xC2DC;&amp;#xAC12;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xB531; 1&amp;#xBE44;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBCC0;&amp;#xACBD;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, XTS &amp;#xACB0;&amp;#xACFC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; 1&amp;#xBE44;&amp;#xD2B8;&amp;#xB9CC; &amp;#xBC14;&amp;#xAFE8;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD574;&amp;#xB2F9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xB85C; randomizing&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;, &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6C3; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC5D0;&amp;#xB294; &amp;#xC601;&amp;#xD5A5;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows&amp;#xAC00; AEAD&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&lt;/strong&gt;&lt;br&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Windows &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MAC&amp;#xC774;&amp;#xB098; AEAD &amp;#xAC19;&amp;#xC740; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBD99;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&amp;#xC758; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xC644;&amp;#xC804;&amp;#xD788; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C;&amp;#xACC4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xB2E8;&amp;#xC21C;&amp;#xD788; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xAD50;&amp;#xCCB4;&amp;#xD558;&amp;#xB294; &amp;#xCC28;&amp;#xC6D0;&amp;#xC744; &amp;#xB118;&amp;#xC5B4;, &amp;#xBD80;&amp;#xD305;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xB364;&amp;#xD504;&amp;#xC5D0; &amp;#xC774;&amp;#xB974;&amp;#xB294; &amp;#xC804;&amp;#xCCB4; I/O &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xAC80;&amp;#xC99D; &amp;#xC2E4;&amp;#xD328;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xC9C0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB97C; &amp;#xC804;&amp;#xBA74; &amp;#xC7AC;&amp;#xC124;&amp;#xACC4;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB300;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC774; &amp;#xB3D9;&amp;#xBC18;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.. &amp;#xB610;&amp;#xD55C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC139;&amp;#xD130;&amp;#xC5D0; MAC &amp;#xD0DC;&amp;#xADF8;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACF5;&amp;#xAC04; &amp;#xD6A8;&amp;#xC728;&amp;#xC131; &amp;#xC800;&amp;#xD558;, I/O &amp;#xC131;&amp;#xB2A5; &amp;#xC624;&amp;#xBC84;&amp;#xD5E4;&amp;#xB4DC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBB3C;&amp;#xB860;, &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBD80;&amp;#xBD84; &amp;#xC4F0;&amp;#xAE30; &amp;#xB3D9;&amp;#xC791;&amp;#xACFC;&amp;#xC758; &amp;#xBD88;&amp;#xC77C;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC5C7;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB3C4; &amp;#xC791;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC190;&amp;#xC0C1;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC5C4;&amp;#xACA9;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D; &amp;#xC2E4;&amp;#xD328;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xBCFC;&amp;#xB968; &amp;#xC804;&amp;#xCCB4;&amp;#xC758; &amp;#xB9C8;&amp;#xC6B4;&amp;#xD2B8;&amp;#xAC00; &amp;#xAC70;&amp;#xBD80;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC00;&amp;#xC6A9;&amp;#xC131; &amp;#xC800;&amp;#xD558; &amp;#xC6B0;&amp;#xB824;&amp;#xB85C; &amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xB300;&amp;#xCC45;&amp;#xC744; &amp;#xB9C8;&amp;#xB828;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-CASE-CVE-2025-21210-CrashXTS&#34;&gt;&lt;a href=&#34;#2-3-CASE-CVE-2025-21210-CrashXTS&#34; class=&#34;headerlink&#34; title=&#34;2.3 CASE: CVE-2025-21210 (CrashXTS)&#34;&gt;&lt;/a&gt;2.3 CASE: CVE-2025-21210 (CrashXTS)&lt;/h3&gt;&lt;p&gt;&amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130;&amp;#xB294; &amp;#xAC19;&amp;#xC740; tweak&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; XTS&amp;#xC758; &amp;#xC131;&amp;#xC9C8;&amp;#xC740;, &amp;#xAC19;&amp;#xC740; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xC640; &amp;#xAC19;&amp;#xC740; FVEK&amp;#xAC00; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74; &amp;#xAC19;&amp;#xC740; &amp;#xD3C9;&amp;#xBB38;&amp;#xC740; &amp;#xD56D;&amp;#xC0C1; &amp;#xAC19;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658;&amp;#xB418;&amp;#xBA70;, &amp;#xBD80;&amp;#xD305;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC88; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC139;&amp;#xD130; &amp;#xBC88;&amp;#xD638;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC740; &amp;#xC77C;&amp;#xC815;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xC9C0;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; XTS&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Write primitive&amp;#xB97C; &amp;#xC5BB;&amp;#xAE30;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0;&amp;#xB9CC; Corrupt&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB3D9;&amp;#xC791; &amp;#xACBD;&amp;#xB85C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &lt;a href=&#34;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&#34;&gt;CrashXTS&amp;#xB85C; &amp;#xC54C;&amp;#xB824;&amp;#xC9C0;&amp;#xB294; CVE-2025-21210&lt;/a&gt;&amp;#xAC00; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC5D0;&amp;#xC11C; BitLocker&amp;#xAC00; &amp;#xC815;&amp;#xC0C1; &amp;#xB7F0;&amp;#xD0C0;&amp;#xC784; I/O&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;&amp;#xB294; &lt;code&gt;fvevol.sys&lt;/code&gt; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC139;&amp;#xD130; &amp;#xB2E8;&amp;#xC704;&amp;#xB85C; XTS-AES &amp;#xC554;&amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158;&amp;#xCC98;&amp;#xB7FC; &amp;#xC815;&amp;#xC0C1; &amp;#xD30C;&amp;#xC77C;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xCD5C;&amp;#xC18C; &amp;#xB364;&amp;#xD504; &amp;#xC2A4;&amp;#xD0DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC4F0;&amp;#xB294; &amp;#xD2B9;&amp;#xC218; &amp;#xACBD;&amp;#xB85C;&lt;/strong&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294;, &amp;#xC77C;&amp;#xBC18; I/O &amp;#xACBD;&amp;#xB85C;&amp;#xC758; &amp;#xD544;&amp;#xD130;&amp;#xB4E4;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; BitLocker&amp;#xB294; &lt;code&gt;dumpfve.sys&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB364;&amp;#xD504; &amp;#xD544;&amp;#xD130;&amp;#xB97C; &amp;#xBCC4;&amp;#xB3C4;&amp;#xB85C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD574;, &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xAE30;&amp;#xB85D;&amp;#xB420; &amp;#xB54C;&amp;#xB3C4; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xC720;&amp;#xC9C0;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218;&amp;#xB294; &lt;code&gt;SYSTEM\CurrentControlSet\Control\CrashControl&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC758; DumpFilters&amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xB294; &amp;#xACFC;&amp;#xC815; &lt;code&gt;FveGroupPolicyGetMultiSzValue()&lt;/code&gt;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xACE0;, &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC21C;&amp;#xD68C;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;dumpfve.sys&lt;/code&gt;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &lt;code&gt;_wcsicmp()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &lt;code&gt;dumpfve.sys&lt;/code&gt;&amp;#xAC00; &amp;#xC5C6;&amp;#xAC70;&amp;#xB098; &amp;#xD30C;&amp;#xC2F1;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xC989;&amp;#xC2DC; &amp;#xC911;&amp;#xB2E8;&amp;#xD558;&amp;#xACE0;, &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB364;&amp;#xD504; &amp;#xD544;&amp;#xD130;&amp;#xAC00; &amp;#xBE60;&amp;#xC9C4; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; XTS&amp;#xAE30;&amp;#xBC18; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. XTS&amp;#xC758; &amp;#xC131;&amp;#xC9C8;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC131; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD574; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xD3C9;&amp;#xBB38;&amp;#xC744; &amp;#xAE68;&amp;#xB728;&amp;#xB9AC;&amp;#xBA74;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xC190;&amp;#xC0C1;&amp;#xC2DC;&amp;#xCF1C; &amp;#xD30C;&amp;#xC11C;&amp;#xAC00; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xC5D4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC774; Corrupt&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xAE30;&amp;#xB300;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD654;&amp;#xBA74;&amp;#xC740; SYSTEM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ControlSet&amp;#x2026;\Control\CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; Hex &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB978;&amp;#xCABD; ASCII &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &lt;code&gt;CrashControl&lt;/code&gt;, &lt;code&gt;AutoReboot&lt;/code&gt;, &lt;code&gt;CrashDumpEnabled&lt;/code&gt;, &lt;code&gt;DumpFile&lt;/code&gt;, &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xAC74; &lt;strong&gt;&amp;#xD0A4;/&amp;#xAC12; &amp;#xC774;&amp;#xB984;&lt;/strong&gt;&amp;#xC774; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;XTS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD3C9;&amp;#xBB38;&amp;#xC774; &amp;#xD1B5;&amp;#xC81C; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC548;&amp;#xC758; 4&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC9DC;&amp;#xB9AC; &amp;#xC774; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xB178;&amp;#xB824;&amp;#xC11C; &amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xD558;&amp;#xBA74;, &amp;#xCEE4;&amp;#xB110; &amp;#xC785;&amp;#xC7A5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;DumpFilters&lt;/code&gt; &amp;#xAC12;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB85C;&amp;#xB354;&amp;#xAC00; &lt;strong&gt;&amp;#xAC12; &amp;#xBAA9;&amp;#xB85D; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xBABB; &amp;#xCC3E;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xAC78; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;DumpFilters&lt;/code&gt;&amp;#xB97C; &amp;#xAE68;&amp;#xB728;&amp;#xB9AC;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC218;&amp;#xC2ED; GB &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8;, &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &lt;code&gt;0x13B330&lt;/code&gt; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;, &amp;#xADF8; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBA87;&amp;#xC2ED; &amp;#xAC1C; &amp;#xBE14;&amp;#xB85D;&amp;#xB9CC; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB85C; &amp;#xB450;&amp;#xACE0; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xAE68;&amp;#xB728;&amp;#xB824;&amp;#xBCF4;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0;&amp;#xC11C; &amp;#xB300;&amp;#xB7B5; 248&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB5A8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &lt;code&gt;DumpFilter&lt;/code&gt; &amp;#xAD00;&amp;#xB828; &amp;#xAD6C;&amp;#xC870;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; Hex &amp;#xAC12;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0;, 248&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB294; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xBE14;&amp;#xB85D; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB300;&amp;#xB7B5; 15.5 &amp;#xBE14;&amp;#xB85D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;+0xF0&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;+0x100&lt;/code&gt; &amp;#xC8FC;&amp;#xBCC0; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xD6C4;&amp;#xBCF4; &amp;#xBE14;&amp;#xB85D;&amp;#xC73C;&amp;#xB85C; &amp;#xC7A1;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCFC;&amp;#xB968; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC788;&amp;#xACE0;, &amp;#xADF8; &amp;#xC911; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAC19;&amp;#xC740; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xD074;&amp;#xB9B0; &amp;#xC167;&amp;#xB2E4;&amp;#xC6B4;, &amp;#xAC15;&amp;#xC81C;&amp;#xC885;&amp;#xB8CC;, &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD6C4; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xAC19;&amp;#xC740; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xC720;&amp;#xBC1C;&amp;#xD558;&amp;#xBA74; &amp;#xD2B9;&amp;#xC815; &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; SYSTEM &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC2DC;&amp;#xC791; &amp;#xADFC;&amp;#xCC98;&amp;#xC784;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; BSOD &amp;#xC774;&amp;#xD6C4; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &lt;code&gt;LastCrashDump&lt;/code&gt;&amp;#xB77C;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; &amp;#xD718;&amp;#xBC1C;&amp;#xC131; &amp;#xC11C;&amp;#xBE0C;&amp;#xD0A4;&amp;#xAC00; &amp;#xC0DD;&amp;#xACBC;&amp;#xB2E4;&amp;#xAC00; &amp;#xD074;&amp;#xB9B0; &amp;#xC885;&amp;#xB8CC; &amp;#xD6C4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xD574;&amp;#xB2F9; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xD544;&amp;#xB4DC; &amp;#xC77C;&amp;#xBD80;&amp;#xB9CC; &amp;#xC608;&amp;#xCE21; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xB00C;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xC804;&amp;#xCCB4;&amp;#xB97C; &amp;#xD6D1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB531; &amp;#xADF8; &amp;#xD328;&amp;#xD134;&amp;#xB300;&amp;#xB85C; &amp;#xBCC0;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D;&amp;#xB4E4;&amp;#xC744; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xD0A4; &amp;#xB178;&amp;#xB4DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC815;&amp;#xC0C1; &amp;#xBD80;&amp;#xD305; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 ad 71 01 42 ed f0 da 01    ....nk ..q.B....
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e300&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; e8 &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ................
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e310&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt; f4 a7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ({t........&lt;span class=&#34;hljs-number&#34;&gt;.8&lt;/span&gt;...
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e320&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ..F..... .......
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e330&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ,..&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;...........
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e340&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    CrashControl....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xD06C;&amp;#xB798;&amp;#xC2DC;/BSOD &amp;#xC9C1;&amp;#xD6C4; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 73 62 74 ab 14 f7 da 01    ....nk ..sbt.....
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e300&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; e8 &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ................
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e310&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; c8 &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;38&lt;/span&gt; f4 a7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ({t........&lt;span class=&#34;hljs-number&#34;&gt;.8&lt;/span&gt;...
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e320&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;46&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; ff ff ff ff &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ..F..... .......
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e330&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ,..&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;...........
&lt;span class=&#34;hljs-number&#34;&gt;0x0056e340&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;43&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;72&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    CrashControl....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB450; &amp;#xB364;&amp;#xD504;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xBA3C;&amp;#xC800; &amp;#xB208;&amp;#xC5D0; &amp;#xB744;&amp;#xB294; &amp;#xAC74;, &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC720;&amp;#xC9C0;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB450; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;0x0056e340&lt;/code&gt; &amp;#xB77C;&amp;#xC778;&amp;#xC5D0; &lt;code&gt;CrashControl&lt;/code&gt; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xAC00; &amp;#xC0AC;&amp;#xB77C;&amp;#xC838;&amp;#xC11C; &amp;#xBABB; &amp;#xCC3E;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, &lt;code&gt;CrashControl&lt;/code&gt;&amp;#xC744; &amp;#xAE30;&amp;#xC220;&amp;#xD558;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C;, &amp;#xC804;&amp;#xCCB4;&amp;#xAC00; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xB4A4;&amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xC77C;&amp;#xBD80; &amp;#xD544;&amp;#xB4DC;&amp;#xB9CC; &amp;#xC120;&amp;#xD0DD;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB294; &amp;#xBB34;&amp;#xC791;&amp;#xC704; &amp;#xB364;&amp;#xD504;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC758;&amp;#xBBF8;&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC15;&amp;#xD55C; &amp;#xB2E8;&amp;#xC11C;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x00000000  9c 1e d1 7a 39 39 d4 13 0c d4 40 c5 a8 6f c4 de    ...z99....@..o..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000010&lt;/span&gt;  e0 &lt;span class=&#34;hljs-number&#34;&gt;79&lt;/span&gt; bc &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d dd &lt;span class=&#34;hljs-number&#34;&gt;66&lt;/span&gt; e2 &lt;span class=&#34;hljs-number&#34;&gt;25&lt;/span&gt; b0 &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;58&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;53&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;06&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;d    .y.-.f.%.H.XS/.]
&lt;span class=&#34;hljs-number&#34;&gt;0x00000020&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; ac c3 &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;86&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;64&lt;/span&gt; e2 d9 &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;e d0 &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;11&lt;/span&gt; ee &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;d    t..Q..td..n....M
&lt;span class=&#34;hljs-number&#34;&gt;0x00000030&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;03&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;05&lt;/span&gt; e0 bc &lt;span class=&#34;hljs-number&#34;&gt;37&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;41&lt;/span&gt; c1 &lt;span class=&#34;hljs-number&#34;&gt;3f&lt;/span&gt; a2 &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;09&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt;    .@.R..&lt;span class=&#34;hljs-number&#34;&gt;.7&lt;/span&gt;A.?.~*..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;24&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; dc b8 &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;20&lt;/span&gt; c8 &lt;span class=&#34;hljs-number&#34;&gt;81&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;d c6 &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;39&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;9f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;51&lt;/span&gt;    $...j ..-.a09&lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;Q
&lt;span class=&#34;hljs-number&#34;&gt;0x00000050&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;31&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;74&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;96&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;c f2 ad &lt;span class=&#34;hljs-number&#34;&gt;9&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;28&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;26&lt;/span&gt; f9 ce &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;    &lt;span class=&#34;hljs-number&#34;&gt;1.&lt;/span&gt;.t......(&amp;amp;....
&lt;span class=&#34;hljs-number&#34;&gt;0x00000060&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;23&lt;/span&gt; fd d1 &lt;span class=&#34;hljs-number&#34;&gt;08&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;45&lt;/span&gt; f0 c1 &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt; bb e5 &lt;span class=&#34;hljs-number&#34;&gt;84&lt;/span&gt; bf b6 &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;17&lt;/span&gt;    .#...E........s.
&lt;span class=&#34;hljs-number&#34;&gt;0x00000070&lt;/span&gt;  f0 e3 &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt; f2 &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;7b&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;91&lt;/span&gt; bd e5 &lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;e b3 a7 &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;c bf    ..P.|&lt;span class=&#34;hljs-number&#34;&gt;5&lt;/span&gt;{...^..ML.
&lt;span class=&#34;hljs-number&#34;&gt;0x00000080&lt;/span&gt;  db f0 de &lt;span class=&#34;hljs-number&#34;&gt;96&lt;/span&gt; ba &lt;span class=&#34;hljs-number&#34;&gt;50&lt;/span&gt; d9 &lt;span class=&#34;hljs-number&#34;&gt;09&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;83&lt;/span&gt; b2 fb &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;a f4 &lt;span class=&#34;hljs-number&#34;&gt;35&lt;/span&gt; aa    .....P..=....&lt;span class=&#34;hljs-number&#34;&gt;.5&lt;/span&gt;.&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;Offset      Hex &lt;span class=&#34;hljs-title&#34;&gt;bytes&lt;/span&gt; &lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-number&#34;&gt;16B&lt;/span&gt;)&lt;/span&gt;                                      ASCII&lt;/span&gt;
0x00000000  48 49 42 52 09 00 00 00 33 c0 00 00 d8 04 00 00    HIBR....3.......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000010&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;04&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;10&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    .&amp;gt;..............
&lt;span class=&#34;hljs-number&#34;&gt;0x00000020&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;73&lt;/span&gt; b2 &lt;span class=&#34;hljs-number&#34;&gt;1f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2b&lt;/span&gt; f7 da &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;d &lt;span class=&#34;hljs-number&#34;&gt;07&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    &amp;gt;s..+...&amp;gt;..*....
&lt;span class=&#34;hljs-number&#34;&gt;0x00000030&lt;/span&gt;  ff bd &lt;span class=&#34;hljs-number&#34;&gt;9b&lt;/span&gt; bd &lt;span class=&#34;hljs-number&#34;&gt;7f&lt;/span&gt; a4 &lt;span class=&#34;hljs-number&#34;&gt;5f&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;06&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;01&lt;/span&gt; ca &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;a &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ......_.........
&lt;span class=&#34;hljs-number&#34;&gt;0x00000040&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;30&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;44&lt;/span&gt; a8 &lt;span class=&#34;hljs-number&#34;&gt;80&lt;/span&gt; c2 ff ff &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;e &lt;span class=&#34;hljs-number&#34;&gt;21&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    &lt;span class=&#34;hljs-number&#34;&gt;.0&lt;/span&gt;D.........N!..
&lt;span class=&#34;hljs-number&#34;&gt;0x00000050&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;61&lt;/span&gt; d7 &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;34&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;54&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    a......&lt;span class=&#34;hljs-number&#34;&gt;.4&lt;/span&gt;T......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000060&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ........,.......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000070&lt;/span&gt;  &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt;c &lt;span class=&#34;hljs-number&#34;&gt;13&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; fc &lt;span class=&#34;hljs-number&#34;&gt;57&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    |........W......
&lt;span class=&#34;hljs-number&#34;&gt;0x00000080&lt;/span&gt;  a7 bf &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;82&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;99&lt;/span&gt; a9 &lt;span class=&#34;hljs-number&#34;&gt;68&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;02&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;00&lt;/span&gt;    ...........h....&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;exploit &amp;#xC804;&amp;#xD6C4;&amp;#xC758; raw &amp;#xC139;&amp;#xD130;&amp;#xB97C; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xBA74;, exploit &amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xC554;&amp;#xD638;&amp;#xBB38; &amp;#xD2B9;&amp;#xC131;&amp;#xC0C1; &amp;#xBB34;&amp;#xC791;&amp;#xC704;&amp;#xCC98;&amp;#xB7FC; &amp;#xBCF4;&amp;#xC774;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xC5F4;&amp;#xC774; &amp;#xAD00;&amp;#xCC30;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, exploit &amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;HIBR&lt;/code&gt; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xAD00;&amp;#xCC30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC989;, &amp;#xD2B9;&amp;#xC218; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB364;&amp;#xD504;/&amp;#xD558;&amp;#xC774;&amp;#xBC84;&amp;#xB124;&amp;#xC774;&amp;#xC158; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-4-Reliability-vs-Randomization&#34;&gt;&lt;a href=&#34;#2-4-Reliability-vs-Randomization&#34; class=&#34;headerlink&#34; title=&#34;2.4 Reliability vs. Randomization&#34;&gt;&lt;/a&gt;2.4 Reliability vs. Randomization&lt;/h3&gt;&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; CrashXTS &amp;#xAC19;&amp;#xC740; &amp;#xD655;&amp;#xB960;&amp;#xC801; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xD575;&amp;#xC2EC;&amp;#xC740; &amp;#xBB34;&amp;#xACB0;&amp;#xC131; &amp;#xBD80;&amp;#xC7AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; corrupt&amp;#xC778;&amp;#xB370;, &amp;#xC774; &amp;#xBC18;&amp;#xC751;&amp;#xC740; Windows &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB098; &amp;#xBC84;&amp;#xC804;, &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xC27D;&amp;#xAC8C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xD2B9;&amp;#xC9D5; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC720;&amp;#xB3C4;&amp;#xD558;&amp;#xAE30;&amp;#xAC00; &amp;#xC27D;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC19;&amp;#xC740; Windows &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xC124;&amp;#xCE58; &amp;#xC774;&amp;#xB825;, &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB0B4;&amp;#xC5ED;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC124;&amp;#xCE58;/&amp;#xC81C;&amp;#xAC70;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD558;&amp;#xC774;&amp;#xBE0C; &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xD30C;&amp;#xC77C; &amp;#xBC30;&amp;#xCE58;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9E4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCC28;&amp;#xB4F1; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xCC98;&amp;#xC74C;&amp;#xBD80;&amp;#xD130; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xBA70; &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC758; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xAC00; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; BitLocker &amp;#xC815;&amp;#xCC45;&amp;#xC774; &amp;#xBCC0;&amp;#xACBD;&amp;#xB418;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC7AC;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B4;&amp;#xC601; &amp;#xC774;&amp;#xB825;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xBBC0;&amp;#xB85C; &amp;#xD55C; &amp;#xBC88; &amp;#xC131;&amp;#xACF5;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9; &amp;#xC704;&amp;#xCE58;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC804;&amp;#xD600; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;h2 id=&#34;3-Conclusion&#34;&gt;&lt;a href=&#34;#3-Conclusion&#34; class=&#34;headerlink&#34; title=&#34;3. Conclusion&#34;&gt;&lt;/a&gt;&lt;strong&gt;3. Conclusion&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2026/01/22/banda/BitLocker_part1/ko/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; CrashXTS&amp;#xB294; XTS&amp;#xC758; &amp;#xADFC;&amp;#xBCF8;&amp;#xC801; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xC2E4;&amp;#xC99D;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC6A9;&amp;#xC131; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2E4;&amp;#xC18C; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C; Part&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; BitLocker&amp;#xC758; &amp;#xC774;&amp;#xB7F0; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xBAA8;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC790;&amp;#xCCB4;&amp;#xC758; corrupt&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A4;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294;, &lt;strong&gt;WinRE &amp;#xAC80;&amp;#xC99D; &amp;#xB204;&amp;#xB77D;, &amp;#xBCF5;&amp;#xAD6C; &amp;#xACBD;&amp;#xB85C; &amp;#xACB0;&amp;#xD568;, &amp;#xD0A4; &amp;#xAD00;&amp;#xB9AC; &amp;#xC2E4;&amp;#xC218;&lt;/strong&gt; &amp;#xAC19;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC;&amp;#xC801; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; exploit&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F604;&lt;/p&gt;
&lt;h2 id=&#34;References&#34;&gt;&lt;a href=&#34;#References&#34; class=&#34;headerlink&#34; title=&#34;References&#34;&gt;&lt;/a&gt;References&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&#34;&gt;https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf?utm_source=chatgpt.com&#34;&gt;https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&#34;&gt;https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210&#34;&gt;https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/&#34;&gt;https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2026/01/22/banda/BitLocker_part1/ko/logo.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2026/01/22/banda/bitlocker_part1/ko/">

  <title>[Research] Unlocking BitLocker: Windows Full-Disk Encryption Under Attack: Part 1 (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2026-01-22 17:00" pubdate>
      2026 1 22 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      6.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      127
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Unlocking BitLocker: Windows Full-Disk Encryption Under Attack: Part 1 (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="1-Introduction"><a href="#1-Introduction" class="headerlink" title="1. Introduction"></a>1. Introduction</h2><p><img src="/2026/01/22/banda/BitLocker_part1/ko/logo.jpg" srcset="/img/loading.gif" alt></p>
<p>BitLocker&#xC740; Windows &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; &#xB514;&#xC2A4;&#xD06C; &#xC554;&#xD638;&#xD654; &#xAE30;&#xB2A5;&#xC73C;&#xB85C;, &#xC7A5;&#xCE58;&#xAC00; &#xBD84;&#xC2E4;&#xB418;&#xAC70;&#xB098; &#xB3C4;&#xB09C;&#xB418;&#xC5B4; &#xC624;&#xD504;&#xB77C;&#xC778; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC811;&#xADFC;&#xD574;&#xB3C4; &#xB0B4;&#xC6A9;&#xC744; &#xC77D;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xC7A5;&#xCE58;&#xC785;&#xB2C8;&#xB2E4;. BitLocker&#xC740; XTS-AES&#xC640; TPM&#xC758; &#xACB0;&#xD569; &#xAD6C;&#xC870;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xAC15;&#xB825;&#xD55C; &#xD0A4; &#xBCF4;&#xD638;&#xC640; &#xB370;&#xC774;&#xD130; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC9C0;&#xB9CC;, &#xC554;&#xD638;&#xBB38; &#xC790;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xBB34;&#xACB0;&#xC131; &#xBCF4;&#xD638;&#xAC00; &#xC81C;&#xACF5;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB298;&#xC740; AES-XTS &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xD574;&#xD574;&#xBCF4;&#xBA70; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/">BitLocker CrashXTS</a>&#xC758; &#xBC29;&#xC2DD;&#xC744; &#xD568;&#xAED8; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-1-&#xBD80;&#xD305;&#xC2DC;&#xC2A4;&#xD15C;-&#xC774;&#xD574;"><a href="#1-1-&#xBD80;&#xD305;&#xC2DC;&#xC2A4;&#xD15C;-&#xC774;&#xD574;" class="headerlink" title="1.1 &#xBD80;&#xD305;&#xC2DC;&#xC2A4;&#xD15C; &#xC774;&#xD574;"></a>1.1 &#xBD80;&#xD305;&#xC2DC;&#xC2A4;&#xD15C; &#xC774;&#xD574;</h3><p>UEFI &#xD38C;&#xC6E8;&#xC5B4;&#xB294; EFI System Partition(ESP)&#xC5D0;&#xC11C; &#xC11C;&#xBA85;&#xB41C; bootmgfw.efi&#xC640; BCD(&#xBD80;&#xD305; &#xAD6C;&#xC131; &#xB370;&#xC774;&#xD130;)&#xB97C; &#xC77D;&#xC5B4;&#xB4E4;&#xC774;&#xBA70;, &#xC774; &#xAD6C;&#xAC04;&#xC740; &#xD3C9;&#xBB38;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Secure Boot&#xB294; &#xC774; &#xBD80;&#xD305; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xCCB4;&#xC778;&#xC758; DBX&#xB97C; &#xAC80;&#xC0AC;&#xD574; &#xC2E0;&#xB8B0; &#xACBD;&#xB85C;&#xB97C; &#xAD6C;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. ESP &#xBD80;&#xD2B8; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB294; &#xC77D;&#xD788;&#xB418;, &#xC2E0;&#xB8B0; &#xAC80;&#xC99D;&#xC774; &#xD1B5;&#xACFC;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; VMK unseal&#xC774; &#xAC70;&#xBD80;&#xB418;&#xACE0; &#xBCF5;&#xAD6C; &#xACBD;&#xB85C;&#xB85C; &#xC774;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image1.png" srcset="/img/loading.gif" alt></p>
<p>TPM &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xCE69;</p>
<p>&#xC554;&#xD638;&#xD654;&#xB41C; &#xC601;&#xC5ED;&#xC5D0;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xC0AC;&#xC6A9;&#xC790; &#xD30C;&#xC77C;&#xB9CC; &#xC788;&#xC744;&#xAE4C;&#xC694;? &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. BitLocker&#xB294; &#xBCFC;&#xB968; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xC5D0; &#xD0A4; &#xBCF4;&#xD638;&#xC790;(Key Protector)&#xC640; &#xD0A4; &#xACC4;&#xCE35;&#xC744; &#xAE30;&#xC220;&#xD574;&#xB450;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C;&#xB294; VMK(Volume Master Key)&#xC640; FVEK(Full Volume Encryption Key)&#xC758; 2&#xACC4;&#xCE35; &#xD0A4; &#xC124;&#xACC4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xACE0;, &#xC2E4;&#xC81C;&#xB85C; &#xBE14;&#xB85D; &#xC554;&#xD638;&#xD654;/&#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xC4F0;&#xC774;&#xB294; &#xAC83;&#xC740; FVEK&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xD654;&#xBA74;&#xC740; <code>manage-bde -protectors -get C:</code> &#xBA85;&#xB839;&#xC73C;&#xB85C; C: &#xBCFC;&#xB968;&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; &#xD0A4; &#xBCF4;&#xD638;&#xAE30;(Key Protector)&#xB97C; &#xC870;&#xD68C;&#xD55C; &#xACB0;&#xACFC;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBCF4;&#xC774;&#xB294; &#xC22B;&#xC790; &#xC554;&#xD638;&#xB294; VMK&#xB97C; &#xD574;&#xC81C;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBCF4;&#xD638;&#xAE30; &#xC911; &#xD558;&#xB098;&#xB85C;, &#xC815;&#xC0C1; &#xBD80;&#xD305; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; TPM &#xAE30;&#xBC18; unseal&#xC774; &#xC2E4;&#xD328;&#xD558;&#xAC70;&#xB098; &#xBCF5;&#xAD6C; &#xBAA8;&#xB4DC;&#xB85C; &#xC804;&#xD658;&#xB420; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBCF5;&#xAD6C; &#xC218;&#xB2E8;&#xC785;&#xB2C8;&#xB2E4;. &#xC989; BitLocker &#xBCFC;&#xB968;&#xC5D0;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xB370;&#xC774;&#xD130;&#xB9CC; &#xC554;&#xD638;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C;, VMK&#xB97C; &#xC5B4;&#xB5A4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBCF5;&#xC6D0;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xD638;&#xAE30; &#xC815;&#xBCF4;&#xC640; &#xD0A4; &#xACC4;&#xCE35;(VMK &#x2192; FVEK)&#xC774; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xD615;&#xD0DC;&#xB85C; &#xD568;&#xAED8; &#xC874;&#xC7AC;&#xD558;&#xBA70;, &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; FVEK&#xAC00; &#xC139;&#xD130; &#xB2E8;&#xC704; &#xC554;&#xBCF5;&#xD638;&#xD654;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAD6C;&#xC870;&#xB85C; &#xC774;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; 2&#xACC4;&#xCE35; &#xD0A4; &#xC124;&#xACC4;&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xC9C0; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574;, &#xAC01; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xD575;&#xC2EC;&#xC801;&#xC778; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; TPM, VMK, FVEK&#xC5D0; &#xB300;&#xD574; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.  <br><br></p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image17.png" srcset="/img/loading.gif" alt></p>
<p><strong>TPM</strong></p>
<p>TPM&#xC740; &#xC554;&#xD638;&#xD654; &#xD0A4;, &#xCE74;&#xC6B4;&#xD130; &#xB4F1;&#xC744; &#xCE69; &#xB0B4;&#xBD80;&#xC5D0; &#xACA9;&#xB9AC;&#xD574; &#xBCF4;&#xAD00;&#xD558;&#xB294; &#xBCF4;&#xC548; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#x2018;&#xBBFF;&#xC744; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD0DC;&#xB85C; &#xBD80;&#xD305;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#x2019; &#xBD80;&#xD305; &#xC2E0;&#xB8B0;&#xB3C4; &#xCE21;&#xC815;&#xAC12;(PCR - Platform Configuration Register)&#xC744; &#xD1B5;&#xD574; &#xBE44;&#xBC00; &#xD0A4;&#xB97C; &#xAEBC;&#xB0B4; &#xC4F8; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; dTPM &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xCE69;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>BitLocker&#xB294; VMK&#xB97C; &#xD2B9;&#xC815; PCR &#xAC12;&#xC5D0; seal&#xD569;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; PCR 7(Secure Boot &#xC0C1;&#xD0DC;, UEFI &#xBCC0;&#xC218;, Boot Manager &#xCF54;&#xB4DC;)&#xACFC; PCR 11(BitLocker &#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4;)&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBD80;&#xD305; &#xCCB4;&#xC778;&#xC774; &#xC815;&#xC0C1;&#xC774;&#xBA74; TPM&#xC740; VMK &#xD574;&#xC81C;(unseal)&#xB97C; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xBD80;&#xD305; &#xCCB4;&#xC778;&#xC774; &#xBCC0;&#xC870;&#xB418;&#xC5C8;&#xC744; &#xACBD;&#xC6B0; PCR &#xAC12;&#xC774; &#xB2EC;&#xB77C;&#xC838; unseal&#xC774; &#xC2E4;&#xD328;&#xD558;&#xACE0; &#xBCF5;&#xAD6C; &#xD654;&#xBA74;&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.  <br><br></li>
</ul>
<p><strong>VMK (Volume Master Key)</strong><br>VMK&#xB294; FVEK&#xB97C; &#xBCF4;&#xD638;&#xD558;&#xB294; &#xC0C1;&#xC704; &#xD0A4;&#xC785;&#xB2C8;&#xB2E4;. VMK&#xB97C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBCF5;&#xC6D0;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xBA74; FVEK&#xB97C; &#xD480; &#xC218;&#xAC00; &#xC5C6;&#xACE0; &#xB530;&#xB77C;&#xC11C; &#xC139;&#xD130; &#xD3C9;&#xBB38;&#xC5D0;&#xB3C4; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. VMK&#xB294; &#xC5EC;&#xB7EC; &#xBCF4;&#xD638;&#xC790;&#xB85C; &#xB798;&#xD551;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<ul>
<li>TPM Protector: TPM PCR&#xC5D0; &#xBC14;&#xC778;&#xB529;</li>
<li>Recovery Password Protector: 48&#xC790;&#xB9AC; &#xC22B;&#xC790; &#xBCF5;&#xAD6C; &#xD0A4;</li>
<li>Password Protector: &#xC0AC;&#xC6A9;&#xC790; &#xC554;&#xD638;</li>
<li>TPM+PIN Protector: TPM&#xACFC; PIN &#xC870;&#xD569;  <br><br></li>
</ul>
<p><strong>FVEK (Full Volume Encryption Key)</strong><br>FVEK&#xB294; &#xB514;&#xC2A4;&#xD06C; &#xC139;&#xD130;&#xC758; &#xC2E4;&#xC81C; &#xC554;&#xD638;&#xD654;&#xB97C; &#xB2F4;&#xB2F9;&#xD558;&#xBA70;, FVEK&#xAC00; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xB300;&#xC0C1;&#xC5D0;&#xB294; &#xCEE4;&#xB110;, &#xB4DC;&#xB77C;&#xC774;&#xBC84;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;, &#xC0AC;&#xC6A9;&#xC790; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBAA8;&#xB450; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. FVEK&#xB294; AES-256(&#xB610;&#xB294; AES-128) &#xD0A4;&#xC774;&#xBA70;, XTS &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; 512&#xBE44;&#xD2B8;(&#xB610;&#xB294; 256&#xBE44;&#xD2B8;)&#xAC00; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xC808;&#xBC18;&#xC740; &#xB370;&#xC774;&#xD130; &#xC554;&#xD638;&#xD654;&#xC6A9;(K1), &#xC808;&#xBC18;&#xC740; tweak &#xC0DD;&#xC131;&#xC6A9;(K2)&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;!  <br><br></p>
<p><strong>BitLocker &#xD544;&#xD130; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xCEE4;&#xB110;&#xC774; &#xC62C;&#xB77C;&#xC624;&#xBA74; BitLocker &#xD544;&#xD130; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC778; fvevol.sys&#xAC00; &#xB514;&#xC2A4;&#xD06C; I/O&#xB97C; &#xAC00;&#xB85C;&#xCC44;&#xC11C; &#xC554;&#xD638;&#xD654;, &#xBCF5;&#xD638;&#xD654;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294;&#xB370;&#xC694;. &#xC774;&#xAC78; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xD589;&#xD558;&#xB294;&#xC9C0; &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<ol>
<li>&#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xBD80;&#xD305;&#xD560; &#xB54C; <code>winload.efi</code>&#xAC00; &#xCEE4;&#xB110;&#xACFC; <code>BOOT_START(0)</code> &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB4E4;&#xC744; &#xC801;&#xC7AC;&#xD558;&#xBA70;, <code>fvevol.sys</code>&#xB3C4; &#xD568;&#xAED8; &#xBA3C;&#xC800; &#xC62C;&#xB77C;&#xAC11;&#xB2C8;&#xB2E4;. &#xC774; &#xC2DC;&#xC810;&#xC740; NTFS&#xAC00; &#xC2DC;&#xC2A4;&#xD15C; &#xBCFC;&#xB968;&#xC744; &#xB9C8;&#xC6B4;&#xD2B8;&#xD558;&#xAE30; &#xC804;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xD0A4;&#xAC00; &#xC900;&#xBE44;&#xB418;&#xAE30; &#xC804; &#xBD80;&#xD305; &#xCD08;&#xAE30;&#xC5D0; TPM&#xC758; PCR 7/11 &#xAC80;&#xC99D;&#xC774; &#xC544;&#xC9C1; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xC9C0; &#xC54A;&#xACE0; VMK/FVEK&#xC774; &#xC900;&#xBE44; &#xC804; &#xC0C1;&#xD0DC;&#xC77C; &#xB54C;, <code>fvevol.sys</code>&#xB294; locked &#xC0C1;&#xD0DC;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; bootmgr&#xB098; winload&#xAC19;&#xC740; &#xBD80;&#xD2B8; &#xD658;&#xACBD;&#xC774; FVE-FS(&#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;)&#xB97C; &#xC77D;&#xC5B4; TPM &#xAC80;&#xC99D;&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0;, VMK&#xB97C; unseal &#xD55C; &#xB4A4;&#xC5D0; FVEK&#xB97C; &#xBCF5;&#xD638;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>VMK&#xAC00; unseal&#xB418;&#xACE0; FVEK&#xAC00; &#xBCF5;&#xD638;&#xB41C; &#xC2DC;&#xC810;&#xC77C; &#xB54C;&#xAC00; &#xB418;&#xC5B4;&#xC11C;&#xC57C; fvevol&#xC740; unlocked &#xC0C1;&#xD0DC;&#xB85C; &#xC804;&#xD658;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xC2DC;&#xC810;&#xBD80;&#xD130; &#xD574;&#xB2F9; &#xBCFC;&#xB968;&#xC758; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130; I/O&#xB294; &#xAC01; FVEK&#xB97C; &#xD1B5;&#xD574; &#xD22C;&#xBA85; &#xC554;&#xD638;&#xD654;, &#xBCF5;&#xD638;&#xD654;&#xAC00; &#xC218;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.  <br><br></li>
</ol>
<p>&#xC989;, <code>&#xC571;/&#xC11C;&#xBE44;&#xC2A4;</code> &#x2192; <code>NTFS(ReFS)</code> &#x2192; <code>I/O Manager</code> &#x2192; <code>[fvevol]</code> &#x2192; <code>volmgr/&#xC800;&#xC7A5;&#xC18C; &#xD074;&#xB798;&#xC2A4;</code> &#x2192; <code>&#xD3EC;&#xD2B8;/&#xBBF8;&#xB2C8;&#xD3EC;&#xD2B8;(NVMe/SATA)</code> &#x2192; <code>&#xB514;&#xC2A4;&#xD06C;</code> &#xC21C;&#xC11C;&#xB85C; &#xB0B4;&#xB824;&#xAC11;&#xB2C8;&#xB2E4;. </p>
<p>BitLocker&#xC758; &#xD575;&#xC2EC; &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC778; <strong>XTS-AES</strong>&#xB294; &#xB514;&#xC2A4;&#xD06C; &#xC139;&#xD130; &#xB2E8;&#xC704;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD558;&#xBA70;, &#xAC01; &#xBE14;&#xB85D;&#xC5D0; <strong>tweak &#xAC12;(&#xC139;&#xD130;/&#xC624;&#xD504;&#xC14B; &#xAE30;&#xBC18;)</strong>&#xC744; &#xC801;&#xC6A9;&#xD574; &#xB3D9;&#xC77C;&#xD55C; &#xD3C9;&#xBB38;&#xC774;&#xB77C;&#xB3C4; &#xC704;&#xCE58;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978; &#xC554;&#xD638;&#xBB38;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC124;&#xACC4;&#xB294; CTR/CBC &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB358; <strong>malleability(&#xBCC0;&#xD615; &#xAC00;&#xB2A5;&#xC131;)</strong>, &#xC989; &#xC554;&#xD638;&#xBB38;&#xC744; &#xC9C1;&#xC811; &#xC870;&#xC791;&#xD574; &#xD3C9;&#xBB38;&#xC744; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xC644;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB3C4;&#xC785;&#xB41C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB7EC;&#xD55C; XTS &#xAD6C;&#xC870;&#xC870;&#xCC28; &#xC644;&#xBCBD;&#xD788; &#xC548;&#xC804;&#xD558;&#xC9C0; &#xC54A;&#xC74C;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xC0AC;&#xB840;&#xB97C; &#xC624;&#xB298; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="2-Windows&#xC758;-AES-CBC&#xC640;-AES-XTS-&#xC6B4;&#xC6A9;-&#xBAA8;&#xB4DC;"><a href="#2-Windows&#xC758;-AES-CBC&#xC640;-AES-XTS-&#xC6B4;&#xC6A9;-&#xBAA8;&#xB4DC;" class="headerlink" title="2. Windows&#xC758; AES-CBC&#xC640; AES-XTS &#xC6B4;&#xC6A9; &#xBAA8;&#xB4DC;"></a>2. Windows&#xC758; AES-CBC&#xC640; AES-XTS &#xC6B4;&#xC6A9; &#xBAA8;&#xB4DC;</h2><h3 id="2-1-XTS&#xC758;-&#xC554;&#xD638;&#xD654;-&#xBC29;&#xC2DD;"><a href="#2-1-XTS&#xC758;-&#xC554;&#xD638;&#xD654;-&#xBC29;&#xC2DD;" class="headerlink" title="2.1 XTS&#xC758; &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;"></a><strong>2.1 XTS&#xC758; &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;</strong></h3><p>&#xC55E;&#xC11C; BitLocker&#xAC00; FVEK&#xB85C; &#xC139;&#xD130; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xB294;&#xB370;&#xC694;. &#xC624;&#xB298; &#xC124;&#xBA85;&#xD560; &#xCDE8;&#xC57D;&#xC131;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; <strong>&#x2018;&#xB514;&#xC2A4;&#xD06C;&#xB77C;&#xB294; &#xB9E4;&#xCCB4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC6B4;&#xC6A9; &#xBAA8;&#xB4DC;&#x2019;</strong>&#xC5D0; &#xCD08;&#xC810;&#xC744; &#xB46C;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xD78C;&#xD2B8;&#xB97C; &#xD558;&#xB098; &#xB4DC;&#xB9AC;&#xC790;&#xBA74; &#xB514;&#xC2A4;&#xD06C;&#xB294; &#x2018;&#xC139;&#xD130;&#xB77C;&#xB294; &#xD2B9;&#xC815; &#xC704;&#xCE58;&#xB97C; &#xC784;&#xC758;&#xB85C; &#xC77D;&#xACE0; &#xC4F0;&#xB294; &#xC561;&#xC138;&#xC2A4; &#xB9E4;&#xCCB4;&#x2019;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; BitLocker&#xB294; &#xB79C;&#xB364;&#xD55C; &#xC561;&#xC138;&#xC2A4;&#xC5D0;&#xC11C;&#xB3C4; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBE14;&#xB85D; &#xC554;&#xD638; &#xC6B4;&#xC6A9; &#xBAA8;&#xB4DC;&#xC5EC;&#xC57C; &#xCDE8;&#xC57D;&#xC131;&#xC774; &#xB098;&#xD0C0;&#xB098;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>Windows 11&#xBD80;&#xD130; BitLocker&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAE30;&#xC874;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB358; AES-CBC &#xB300;&#xC2E0; AES-XTS&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CBC &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC5D0;&#xC11C; &#xAD6C;&#xC870;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xAE38; &#xC218; &#xC788;&#xB294; attack surface&#xB97C; &#xC904;&#xC774;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image4.png" srcset="/img/loading.gif" alt></p>
<script type="math/tex; mode=display">
C_i = E_K\!\left(P_i \oplus C_{i-1}\right)</script><script type="math/tex; mode=display">
P_i = D_K\!\left(C_i\right) \oplus C_{i-1}</script><p>CBC &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC740; &#xC6B0;&#xB9AC;&#xC5D0;&#xAC8C; &#xC775;&#xC219;&#xD55C; &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC774;&#xC8E0;? CBC &#xC554;&#xD638;&#xD654; &#xBC29;&#xC2DD;&#xC740; &#xBE14;&#xB85D; &#xC554;&#xD638;&#xC778; AES&#xB97C; &#xCCB4;&#xC778;&#xCC98;&#xB7FC; &#xC5EE;&#xB294; &#xBC29;&#xC2DD;&#xC778;&#xB370;, CBC &#xBC29;&#xC2DD;&#xC774; &#xB514;&#xC2A4;&#xD06C; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xB294; &#xD3EC;&#xC778;&#xD2B8;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xC5F0;&#xC1C4; &#xAD6C;&#xC870; (Chaining Dependency)</strong><br>CBC&#xB294; &#xBCF8;&#xC9C8;&#xC801;&#xC73C;&#xB85C; &#xC55E; &#xBE14;&#xB85D;&#xC774; &#xB4A4; &#xBE14;&#xB85D;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB514;&#xC2A4;&#xD06C;&#xCC98;&#xB7FC; &#xC911;&#xAC04; &#xBE14;&#xB85D;&#xB9CC; &#xBC14;&#xAFD4; &#xC4F0;&#xB294; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xAC00; &#xAE4C;&#xB2E4;&#xB86D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB514;&#xC2A4;&#xD06C;&#xB294; &#xD30C;&#xC77C; &#xC77C;&#xBD80;&#xB9CC; &#xAC31;&#xC2E0;&#xB418;&#xAE30;&#xB3C4; &#xD558;&#xACE0;, OS&#xAC00; &#xD2B9;&#xC815; &#xC139;&#xD130;&#xB9CC; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC139;&#xD130; &#xB2E8;&#xC704;&#xB85C; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xC554;&#xBCF5;&#xD638;&#xD654;&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD574; &#xC131;&#xB2A5; &#xC800;&#xD558;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBE44;&#xD2B8; &#xD50C;&#xB9BD; &#xACF5;&#xACA9; (Bit Flipping)</strong><br>CBC &#xBCF5;&#xD638; &#xC2DD;&#xC5D0;&#xC11C; &#xBCF4;&#xB4EF;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD2B9;&#xC815; &#xBE44;&#xD2B8;&#xB97C; &#xB4A4;&#xC9D1;&#xC73C;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xC704;&#xCE58; &#xBE44;&#xD2B8;&#xAC00; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB4A4;&#xC9D1;&#xD799;&#xB2C8;&#xB2E4;. &#xC989;, &#xC554;&#xD638;&#xBB38;&#xC744; &#xC870;&#xC791;&#xD574; &#xD3C9;&#xBB38;&#xC744; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>IV(Initialization Vector) &#xAD00;&#xB9AC; &#xBB38;&#xC81C;</strong><br>&#xAC01; &#xC139;&#xD130;&#xB9C8;&#xB2E4; &#xACE0;&#xC720;&#xD55C; IV&#xAC00; &#xD544;&#xC694;&#xD558;&#xC9C0;&#xB9CC;, IV&#xB97C; &#xC139;&#xD130; &#xBC88;&#xD638;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC0DD;&#xAE30;&#xACE0;, &#xB79C;&#xB364; IV&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xCD94;&#xAC00; &#xC800;&#xC7A5; &#xACF5;&#xAC04;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xC774;&#xC640; &#xAC19;&#xC740; &#xD750;&#xB984;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCFC; &#xB54C;, &#xACFC;&#xAC70; CBC &#xAE30;&#xBC18; FDE&#xC5D0;&#xC11C;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB514;&#xC2A4;&#xD06C; &#xC0C1;&#xC758; &#xC554;&#xD638;&#xBB38;&#xC744; &#xBE44;&#xD2B8; &#xB2E8;&#xC704;&#xB85C; &#xC218;&#xC815;&#xD574; &#xBD80;&#xD2B8;&#xB85C;&#xB354;&#xB098; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xCF54;&#xB4DC;&#xC5D0; &#xC545;&#xC131; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xB860;&#xC801;&#xC73C;&#xB85C; &#xAC00;&#xB2A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xB530;&#xB77C;&#xC11C; &#xADF8;&#xAC04; CBC &#xBAA8;&#xB4DC;&#xC758; &#xAD6C;&#xC870;&#xC801; &#xCDE8;&#xC57D;&#xC810;&#xC778; &#xAC00;&#xB2E8;&#xC131;(Malleability)&#xC73C;&#xB85C; &#xC778;&#xD574; &#xC554;&#xD638;&#xD654;&#xB41C; &#xBD80;&#xD2B8; &#xC139;&#xD130;&#xB098; OS &#xC911;&#xC694; &#xD30C;&#xC77C;&#xC774; &#xBCC0;&#xC870;&#xB420; &#xC704;&#xD5D8;&#xC774; &#xC81C;&#xAE30;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC5D0; &#xB530;&#xB77C; 2008&#xB144; TrueCrypt 5.0&#xC774; <strong>XTS-AES</strong>&#xB97C; &#xB3C4;&#xC785;&#xD588;&#xACE0;, &#xC774;&#xD6C4; Microsoft &#xC5ED;&#xC2DC; Windows 10&#xBD80;&#xD130; BitLocker&#xC758; &#xAE30;&#xBCF8; &#xC554;&#xD638;&#xD654; &#xD45C;&#xC900;&#xC73C;&#xB85C; XTS-AES&#xB97C; &#xCC44;&#xD0DD;&#xD558;&#xC5EC; &#xC774;&#xB7EC;&#xD55C; &#xC704;&#xD611;&#xC5D0; &#xB300;&#xC751;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC774;&#xB7EC;&#xD55C; XTS &#xC554;&#xD638;&#xBB38; &#xBAA8;&#xB4DC;&#xC758; &#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; XTS&#xB294; &#xBE14;&#xB85D;&#xB9C8;&#xB2E4; tweak&#xB77C;&#xB294; &#xAC12;&#xC744; &#xC50C;&#xC6C1;&#xB2C8;&#xB2E4;. &#xC774; tweak&#xB77C;&#xB294; &#xAC12;&#xC740; &#x2018;&#xB514;&#xC2A4;&#xD06C; &#xC704;&#xCE58;&#x2019;&#xC5D0;&#xC11C; &#xACB0;&#xC815;&#xB418;&#xB294; &#xB09C;&#xC218; &#xAC12;&#xC774;&#xBA70;, &#xC774; &#xAC12;&#xC740; &#xBCF4;&#xD1B5; &#xC139;&#xD130; &#xBC88;&#xD638;&#xC640; &#xC139;&#xD130; &#xB0B4; &#xBE14;&#xB85D; &#xC778;&#xB371;&#xC2A4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC815;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xB514;&#xC2A4;&#xD06C;&#xB294; 512B(4KB)&#xAC19;&#xC740; &#xD06C;&#xAE30;&#xC758; &#xC139;&#xD130;&#xB85C; &#xC77D;&#xACE0; &#xC4F0;&#xACE0;, AES&#xB294; 16B &#xBE14;&#xB85D;&#xC774;&#xBBC0;&#xB85C; &#xC608;&#xB97C;&#xB4E4;&#xBA74; 512B &#xAE30;&#xC900;&#xC73C;&#xB85C; 32&#xAC1C;&#xB85C; &#xBE14;&#xB85D;&#xC774; &#xB098;&#xB258;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC989;, XTS&#xB294; &#xC774; 16B &#xBE14;&#xB85D;&#xB9C8;&#xB2E4; &#xC11C;&#xB85C; &#xB2E4;&#xB978; tweak&#xAC00; &#xC801;&#xC6A9;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB429;&#xB2C8;&#xB2E4;.</p>
<script type="math/tex; mode=display">
T_i = \mathrm{Tweak}_{K_2}(s, j)</script><script type="math/tex; mode=display">
C_i = E_{K_1}\!\left(P_i \oplus T_i\right) \oplus T_i</script><p>XTS&#xB294; Key&#xB97C; &#xB450; &#xAC1C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. <code>Key1</code>&#xC740; &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC554;&#xD638;&#xD654;&#xC640; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xB294; &#xBAA9;&#xC801;&#xC73C;&#xB85C;, <code>Key2</code>&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC704;&#xCE58; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xC740; tweak&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xAC19;&#xC740; XTS &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD2B9;&#xC815; &#xC554;&#xD638;&#xBB38; &#xBE14;&#xB85D;&#xC744; &#xC870;&#xC791;&#xD574;&#xB3C4;, <strong><em>&#xBE44;&#xC120;&#xD615;&#xC131;</em></strong>&#xC73C;&#xB85C; &#xC778;&#xD574; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D; &#xB2E8;&#xC704;&#xB85C; &#xACB0;&#xACFC;&#xAC00; &#xC608;&#xCE21; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xBB34;&#xC791;&#xC704;&#xC5D0; &#xAC00;&#xAE4C;&#xC6B4; &#xC190;&#xC0C1;&#xC774; &#xC774;&#xB904;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC989;, CBC&#xCC98;&#xB7FC; &#xBC14;&#xB85C; &#xB2E4;&#xC74C; &#xBE14;&#xB85D;&#xC758; &#xD2B9;&#xC815; &#xBE44;&#xD2B8;&#xB97C; &#xC6D0;&#xD558;&#xB294; &#xAC12;&#xC73C;&#xB85C; &#xBC14;&#xAFB8;&#xAC70;&#xB098; &#xD558;&#xB294; &#xC815;&#xAD50;&#xD55C; &#xC870;&#xC791;&#xC774; &#xC0AC;&#xC2E4;&#xC0C1; &#xBD88;&#xAC00;&#xB2A5;&#xD574;&#xC9C0;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<h3 id="2-2-XTS&#xC758;-&#xD574;&#xACB0;&#xB418;&#xC9C0;-&#xBABB;&#xD55C;-&#xACFC;&#xC81C;"><a href="#2-2-XTS&#xC758;-&#xD574;&#xACB0;&#xB418;&#xC9C0;-&#xBABB;&#xD55C;-&#xACFC;&#xC81C;" class="headerlink" title="2.2 XTS&#xC758; &#xD574;&#xACB0;&#xB418;&#xC9C0; &#xBABB;&#xD55C; &#xACFC;&#xC81C;"></a><strong>2.2 XTS&#xC758; &#xD574;&#xACB0;&#xB418;&#xC9C0; &#xBABB;&#xD55C; &#xACFC;&#xC81C;</strong></h3><p><img src="/2026/01/22/banda/BitLocker_part1/ko/image6.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7EC;&#xB098; XTS&#xB294; &#xC5EC;&#xC804;&#xD788; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xADFC;&#xBCF8;&#xC801;&#xC778; &#xD55C;&#xACC4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>1. &#xBB34;&#xACB0;&#xC131; &#xBCF4;&#xD638; &#xBD80;&#xC7AC;</strong></p>
<p>XTS&#xB294; &#xC870;&#xC791; &#xACB0;&#xACFC;&#xB97C; &#xC608;&#xCE21;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4E4;&#xC9C0;&#xB9CC;, &#xC870;&#xC791; &#xC790;&#xCCB4;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xAC70;&#xB098; &#xAC70;&#xBD80;&#xD558;&#xB294; &#xBB34;&#xACB0;&#xC131; &#xBCF4;&#xD638;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC554;&#xD638;&#xBB38;&#xC744; &#xBC14;&#xAFB8;&#xBA74;, &#xC2DC;&#xC2A4;&#xD15C;&#xC740; &#xADF8; &#xBCC0;&#xC870; &#xC0AC;&#xC2E4;&#xC744; &#xAC10;&#xC9C0;&#xD574;&#xC11C; &#xC911;&#xB2E8;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2DC;&#xC2A4;&#xD15C;&#xC740; &#xC774; &#xBCC0;&#xC870;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xADF8;&#xB0E5; &#xBCF5;&#xD638;&#xD574;&#xC11C; &#xAE68;&#xC9C4; &#xD3C9;&#xBB38;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>2. &#xC138;&#xBD84;&#xD654;&#xB41C; &#xBCC0;&#xC870; &#xD0D0;&#xC9C0;</strong></p>
<p>XTS&#xB294; &#xC5B4;&#xB5A4; &#xC139;&#xD130;&#xB098; &#xBE14;&#xB85D;&#xC774; &#xBC14;&#xB00C;&#xC5C8;&#xB294;&#xC9C0;&#xC758; &#xBCC0;&#xD654;&#xB97C; &#xBE14;&#xB85D; &#xB2E8;&#xC704;&#xB85C; &#xC815;&#xD655;&#xD788; &#xACA9;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CBC&#xBCF4;&#xB2E4; &#xC138;&#xBD84;&#xC131;&#xC774; &#xC88B;&#xC544;&#xC11C;, &#xBCC0;&#xD615;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xD2B9;&#xC815; &#xC704;&#xCE58;&#xB97C; &#xD30C;&#xC545;&#xD558;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD55C; &#xB2E8;&#xC11C;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC5B4;&#xB5A4; &#xBE14;&#xB85D;&#xC774; &#xBCC0;&#xACBD;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xC804;&#xCCB4; &#xB514;&#xC2A4;&#xD06C; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC27D;&#xAC8C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>3. Copy-Paste &#xACF5;&#xACA9;</strong></p>
<p>XTS &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xB3D9;&#xC77C;&#xD55C; &#xD3C9;&#xBB38; &#xBE14;&#xB85D;&#xC740; &#xB3D9;&#xC77C;&#xD55C; &#xC139;&#xD130;&#xC5D0;&#xC11C; &#xD56D;&#xC0C1; &#xB3D9;&#xC77C;&#xD55C; &#xC554;&#xD638;&#xBB38;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xAC19;&#xC740; &#xC139;&#xD130;&#xC758; &#xC774;&#xC804; &#xBC84;&#xC804; &#xC554;&#xD638;&#xBB38;&#xC744; &#xBCF5;&#xC0AC;&#xD574; &#xD604;&#xC7AC; &#xBC84;&#xC804;&#xC744; &#xB36E;&#xC5B4;&#xC4F8; &#xC218; &#xC788;&#xAC70;&#xB098;, &#xB2E4;&#xB978; &#xC139;&#xD130;&#xC758; &#xC554;&#xD638;&#xBB38;&#xC744; &#xBCF5;&#xC0AC;&#xD574; &#xBD99;&#xC5EC;&#xB123;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>4. &#xC881;&#xC740; &#xBE14;&#xB85D; &#xD06C;&#xAE30;</strong></p>
<p>XTS&#xB294; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D; &#xB2E8;&#xC704;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xBBC0;&#xB85C;, &#xB3D9;&#xC77C;&#xD55C; 16&#xBC14;&#xC774;&#xD2B8; &#xD3C9;&#xBB38; &#xD328;&#xD134;&#xC774; &#xBC18;&#xBCF5;&#xB418;&#xBA74; &#xC554;&#xD638;&#xBB38;&#xC5D0;&#xC11C;&#xB3C4; &#xD328;&#xD134;&#xC774; &#xAD00;&#xCC30;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC554;&#xD638;&#xBB38; &#xBD84;&#xC11D;&#xC5D0; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image7.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB97C; &#xC9C1;&#xC811; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xAE30; &#xC704;&#xD574;&#xC11C; BitLocker &#xBCFC;&#xB968;&#xC5D0;&#xC11C; XTS-AES&#xC758; &#xBB34;&#xACB0;&#xC131; &#xBD80;&#xC7AC;&#xB97C; &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xB294; &#xC2E4;&#xC2B5;&#xC744; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; BitLocker&#xAC00; &#xC801;&#xC6A9;&#xB41C; &#xBCFC;&#xB968; V:&#xC5D0; 16MiB &#xD06C;&#xAE30; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xC0DD;&#xC131; &#xC9C1;&#xD6C4; &#xD30C;&#xC77C;&#xC758; SHA-256 &#xD574;&#xC2DC;&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACE0; &#xC774;&#xB97C; &#xAE30;&#xC900;&#xAC12;&#xC73C;&#xB85C; &#xAE30;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xBCFC;&#xB968;&#xC744; &#xC7A0;&#xADFC; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xB514;&#xC2A4;&#xD06C; &#xC6D0;&#xC2DC; &#xC601;&#xC5ED;&#xC744; &#xC9C1;&#xC811; &#xD3B8;&#xC9D1;&#xD574; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; &#xD3EC;&#xD568;&#xB41C; 16&#xBC14;&#xC774;&#xD2B8; &#xB2E8;&#xC704; &#xC554;&#xD638;&#xBB38; &#xBE14;&#xB85D;&#xC744; &#xC77C;&#xBD80; &#xBCC0;&#xC870;&#xD558;&#xACE0;, &#xB2E4;&#xC2DC; &#xBCFC;&#xB968;&#xC744; &#xD574;&#xC81C;&#xD55C; &#xB4A4; &#xB3D9;&#xC77C; &#xD30C;&#xC77C;&#xC758; SHA-256 &#xD574;&#xC2DC;&#xB97C; &#xC7AC;&#xACC4;&#xC0B0;&#xD574; &#xAE30;&#xC900;&#xAC12;&#xACFC; &#xBE44;&#xAD50;&#xD574;&#xBCF4;&#xBA74; &#xD574;&#xC2DC;&#xAC12;&#xC774; &#xBC14;&#xB00C;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image9.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC554;&#xD638;&#xBB38;&#xC5D0;&#xC11C; &#xB531; 1&#xBE44;&#xD2B8;&#xB9CC; &#xBCC0;&#xACBD;&#xD558;&#xB354;&#xB77C;&#xB3C4;, XTS &#xACB0;&#xACFC;&#xC5D0;&#xC11C; &#xC554;&#xD638;&#xBB38;&#xC744; 1&#xBE44;&#xD2B8;&#xB9CC; &#xBC14;&#xAFE8;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D; &#xC804;&#xCCB4;&#xAC00; &#xBB34;&#xC791;&#xC704;&#xB85C; randomizing&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB3D9;&#xC2DC;&#xC5D0; &#xC774;&#xB97C; &#xD1B5;&#xD574;, &#xB2E4;&#xB978; &#xC774;&#xC6C3; &#xBE14;&#xB85D;&#xB4E4;&#xC5D0;&#xB294; &#xC601;&#xD5A5;&#xC774; &#xC5C6;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>Windows&#xAC00; AEAD&#xB85C; &#xC804;&#xD658;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xC774;&#xC720;</strong><br>&#xD558;&#xC9C0;&#xB9CC; Windows &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; MAC&#xC774;&#xB098; AEAD &#xAC19;&#xC740; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBD99;&#xC778; &#xD615;&#xD0DC;&#xC758; &#xB514;&#xC2A4;&#xD06C; &#xC554;&#xD638;&#xD654;&#xB85C; &#xC644;&#xC804;&#xD788; &#xB118;&#xC5B4;&#xAC00;&#xAE30;&#xC5D0;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xC554;&#xD638;&#xD654; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xAD50;&#xCCB4;&#xD558;&#xB294; &#xCC28;&#xC6D0;&#xC744; &#xB118;&#xC5B4;, &#xBD80;&#xD305;&#xBD80;&#xD130; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;, &#xD06C;&#xB798;&#xC2DC; &#xB364;&#xD504;&#xC5D0; &#xC774;&#xB974;&#xB294; &#xC804;&#xCCB4; I/O &#xACBD;&#xB85C;&#xAC00; &#xBB34;&#xACB0;&#xC131; &#xAC80;&#xC99D; &#xC2E4;&#xD328;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xD560;&#xC9C0; &#xC2DC;&#xC2A4;&#xD15C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC804;&#xBA74; &#xC7AC;&#xC124;&#xACC4;&#xD574;&#xC57C; &#xD558;&#xB294; &#xAC70;&#xB300;&#xD55C; &#xC791;&#xC5C5;&#xC774; &#xB3D9;&#xBC18;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;.. &#xB610;&#xD55C;, &#xBAA8;&#xB4E0; &#xC139;&#xD130;&#xC5D0; MAC &#xD0DC;&#xADF8;&#xB97C; &#xC800;&#xC7A5;&#xD574;&#xC57C; &#xD558;&#xB294; &#xACF5;&#xAC04; &#xD6A8;&#xC728;&#xC131; &#xC800;&#xD558;, I/O &#xC131;&#xB2A5; &#xC624;&#xBC84;&#xD5E4;&#xB4DC; &#xBB38;&#xC81C;&#xB294; &#xBB3C;&#xB860;, &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xBD80;&#xBD84; &#xC4F0;&#xAE30; &#xB3D9;&#xC791;&#xACFC;&#xC758; &#xBD88;&#xC77C;&#xCE58;&#xB97C; &#xD574;&#xACB0;&#xD574;&#xC57C; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xB3C4; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4;&#xB3C4; &#xC791;&#xC740; &#xB370;&#xC774;&#xD130; &#xC190;&#xC0C1;&#xC5D0;&#xB3C4; &#xC5C4;&#xACA9;&#xD55C; &#xAC80;&#xC99D; &#xC2E4;&#xD328;&#xB85C; &#xC778;&#xD574; &#xBCFC;&#xB968; &#xC804;&#xCCB4;&#xC758; &#xB9C8;&#xC6B4;&#xD2B8;&#xAC00; &#xAC70;&#xBD80;&#xB420; &#xC218; &#xC788;&#xB294; &#xAC00;&#xC6A9;&#xC131; &#xC800;&#xD558; &#xC6B0;&#xB824;&#xB85C; &#xC778;&#xD574;&#xC11C; &#xC544;&#xC9C1;&#xAE4C;&#xC9C0;&#xB3C4; &#xC774;&#xC5D0; &#xB300;&#xD55C; &#xC644;&#xC804;&#xD55C; &#xB300;&#xCC45;&#xC744; &#xB9C8;&#xB828;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-3-CASE-CVE-2025-21210-CrashXTS"><a href="#2-3-CASE-CVE-2025-21210-CrashXTS" class="headerlink" title="2.3 CASE: CVE-2025-21210 (CrashXTS)"></a>2.3 CASE: CVE-2025-21210 (CrashXTS)</h3><p>&#xAC19;&#xC740; &#xC139;&#xD130;&#xB294; &#xAC19;&#xC740; tweak&#xB85C; &#xC554;&#xD638;&#xD654;&#xB41C;&#xB2E4;&#xB294; XTS&#xC758; &#xC131;&#xC9C8;&#xC740;, &#xAC19;&#xC740; &#xC139;&#xD130; &#xBC88;&#xD638;&#xC640; &#xAC19;&#xC740; FVEK&#xAC00; &#xC8FC;&#xC5B4;&#xC9C0;&#xBA74; &#xAC19;&#xC740; &#xD3C9;&#xBB38;&#xC740; &#xD56D;&#xC0C1; &#xAC19;&#xC740; &#xC554;&#xD638;&#xBB38;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xB418;&#xBA70;, &#xBD80;&#xD305;&#xC744; &#xC5EC;&#xB7EC; &#xBC88; &#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC139;&#xD130; &#xBC88;&#xD638;&#xAC00; &#xBC14;&#xB00C;&#xC9C0; &#xC54A;&#xB294; &#xD55C; &#xC554;&#xD638;&#xBB38;&#xC740; &#xC77C;&#xC815;&#xD558;&#xAC8C; &#xC720;&#xC9C0;&#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; XTS&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; Write primitive&#xB97C; &#xC5BB;&#xAE30;&#xB294; &#xC5B4;&#xB835;&#xC9C0;&#xB9CC; Corrupt&#xB97C; &#xD1B5;&#xD574; &#xC2DC;&#xC2A4;&#xD15C; &#xB3D9;&#xC791; &#xACBD;&#xB85C; &#xD750;&#xB984;&#xC744; &#xC2E4;&#xD328;&#xD558;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC810;&#xC744; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf">CrashXTS&#xB85C; &#xC54C;&#xB824;&#xC9C0;&#xB294; CVE-2025-21210</a>&#xAC00; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC708;&#xB3C4;&#xC6B0;&#xC5D0;&#xC11C; BitLocker&#xAC00; &#xC815;&#xC0C1; &#xB7F0;&#xD0C0;&#xC784; I/O&#xB97C; &#xCC98;&#xB9AC;&#xD560; &#xB54C;&#xB294; <code>fvevol.sys</code> &#xC2A4;&#xD0DD;&#xC744; &#xD1B5;&#xD574; &#xC139;&#xD130; &#xB2E8;&#xC704;&#xB85C; XTS-AES &#xC554;&#xBCF5;&#xD638;&#xD654;&#xAC00; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; <strong>&#xD06C;&#xB798;&#xC2DC; &#xB364;&#xD504;/&#xD558;&#xC774;&#xBC84;&#xB124;&#xC774;&#xC158;&#xCC98;&#xB7FC; &#xC815;&#xC0C1; &#xD30C;&#xC77C;&#xC2DC;&#xC2A4;&#xD15C; &#xACBD;&#xB85C;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xCD5C;&#xC18C; &#xB364;&#xD504; &#xC2A4;&#xD0DD;&#xC73C;&#xB85C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC9C1;&#xC811; &#xC4F0;&#xB294; &#xD2B9;&#xC218; &#xACBD;&#xB85C;</strong>&#xC5D0;&#xC11C;&#xB294;, &#xC77C;&#xBC18; I/O &#xACBD;&#xB85C;&#xC758; &#xD544;&#xD130;&#xB4E4;&#xC774; &#xBAA8;&#xB450; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C;&#xBB38;&#xC5D0; BitLocker&#xB294; <code>dumpfve.sys</code> &#xAC19;&#xC740; &#xB364;&#xD504; &#xD544;&#xD130;&#xB97C; &#xBCC4;&#xB3C4;&#xB85C; &#xB85C;&#xB4DC;&#xD574;, &#xB364;&#xD504;/&#xD558;&#xC774;&#xBC84;&#xB124;&#xC774;&#xC158; &#xB370;&#xC774;&#xD130;&#xAC00; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xAE30;&#xB85D;&#xB420; &#xB54C;&#xB3C4; &#xC554;&#xD638;&#xD654;&#xAC00; &#xC720;&#xC9C0;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image12.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xD750;&#xB984;&#xC740; &#xB514;&#xCEF4;&#xD30C;&#xC77C; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB3C4; &#xD655;&#xC778;&#xB429;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;&#xB294; <code>SYSTEM\CurrentControlSet\Control\CrashControl</code> &#xC544;&#xB798;&#xC758; DumpFilters&#xAC12;&#xC744; &#xC77D;&#xC5B4;&#xC624;&#xB294; &#xACFC;&#xC815; <code>FveGroupPolicyGetMultiSzValue()</code>&#xC744; &#xAC70;&#xCE58;&#xACE0;, &#xBAA9;&#xB85D;&#xC744; &#xC21C;&#xD68C;&#xD558;&#xBA74;&#xC11C; <code>dumpfve.sys</code>&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xC9C0; <code>_wcsicmp()</code>&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; <code>dumpfve.sys</code>&#xAC00; &#xC5C6;&#xAC70;&#xB098; &#xD30C;&#xC2F1;&#xC5D0; &#xC2E4;&#xD328;&#xD560; &#xACBD;&#xC6B0; &#xC989;&#xC2DC; &#xC911;&#xB2E8;&#xD558;&#xACE0;, &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xC554;&#xD638;&#xD654; &#xB364;&#xD504; &#xD544;&#xD130;&#xAC00; &#xBE60;&#xC9C4; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C;&#xB294; &#xB364;&#xD504;/&#xD558;&#xC774;&#xBC84;&#xB124;&#xC774;&#xC158;&#xC744; &#xACC4;&#xC18D; &#xC9C4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xD558;&#xB294; &#xD750;&#xB984;&#xC774; &#xB098;&#xD0C0;&#xB098;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xBB38;&#xC81C;&#xB294; XTS&#xAE30;&#xBC18; &#xB514;&#xC2A4;&#xD06C; &#xC554;&#xD638;&#xD654;&#xAC00; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xC5D0;&#xC694;. XTS&#xC758; &#xC131;&#xC9C8;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD2B9;&#xC131; &#xC554;&#xD638;&#xBB38; &#xBE14;&#xB85D;&#xC744; &#xC870;&#xC791;&#xD574; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D; &#xD3C9;&#xBB38;&#xC744; &#xAE68;&#xB728;&#xB9AC;&#xBA74;, &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; <code>DumpFilters</code> &#xC624;&#xD504;&#xC14B;&#xC774; &#xB4E4;&#xC5B4;&#xC788;&#xB294; &#xBE14;&#xB85D;&#xC744; &#xC190;&#xC0C1;&#xC2DC;&#xCF1C; &#xD30C;&#xC11C;&#xAC00; <code>DumpFilters</code> &#xC5D4;&#xD2B8;&#xB9AC;&#xB97C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xD0D0;&#xC0C9;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xC0C1;&#xD0DC;&#xB97C; &#xC720;&#xB3C4;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xC774; Corrupt&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xAE30;&#xB300;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC8C; &#xC720;&#xB3C4;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBAA9;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image13.png" srcset="/img/loading.gif" alt></p>
<p>&#xD654;&#xBA74;&#xC740; SYSTEM &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C; &#xC548;&#xC5D0;&#xC11C; <code>ControlSet&#x2026;\Control\CrashControl</code> &#xD0A4; &#xC8FC;&#xBCC0; &#xBC14;&#xC774;&#xD2B8;&#xB97C; Hex &#xAC12;&#xC73C;&#xB85C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC624;&#xB978;&#xCABD; ASCII &#xC601;&#xC5ED;&#xC5D0; <code>CrashControl</code>, <code>AutoReboot</code>, <code>CrashDumpEnabled</code>, <code>DumpFile</code>, <code>DumpFilters</code> &#xAC19;&#xC740; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xBCF4;&#xC774;&#xB294;&#xB370;, &#xC774;&#xAC74; <strong>&#xD0A4;/&#xAC12; &#xC774;&#xB984;</strong>&#xC774; &#xC2E4;&#xC81C; &#xD30C;&#xC77C; &#xB0B4;&#xBD80;&#xC5D0; &#xBB38;&#xC790;&#xC5F4; &#xD615;&#xD0DC;&#xB85C; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>XTS&#xC5D0;&#xC11C;&#xB294; &#xC554;&#xD638;&#xBB38;&#xC744; &#xC870;&#xC791;&#xD558;&#xBA74; &#xD574;&#xB2F9; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D;&#xC758; &#xD3C9;&#xBB38;&#xC774; &#xD1B5;&#xC81C; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB79C;&#xB364;&#xD654;&#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xB808;&#xC9C0;&#xC2A4;&#xD1A0;&#xB9AC; &#xD558;&#xC774;&#xBE0C; &#xAD6C;&#xC870;&#xCCB4; &#xC548;&#xC758; 4&#xBC14;&#xC774;&#xD2B8;&#xC9DC;&#xB9AC; &#xC774; &#xC624;&#xD504;&#xC14B;&#xC744; &#xB178;&#xB824;&#xC11C; &#xC774; &#xD544;&#xB4DC;&#xAC00; &#xB4E4;&#xC5B4;&#xC788;&#xB294; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D;&#xC744; &#xB79C;&#xB364;&#xD654;&#xD558;&#xBA74;, &#xCEE4;&#xB110; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; <code>DumpFilters</code> &#xAC12;&#xC774; &#xC5C6;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xBCF4;&#xC774;&#xBA74;&#xC11C; &#xD558;&#xC774;&#xBE0C; &#xB85C;&#xB354;&#xAC00; <strong>&#xAC12; &#xBAA9;&#xB85D; &#xC704;&#xCE58;&#xB97C; &#xBABB; &#xCC3E;&#xB294; &#xC0C1;&#xD0DC;</strong>&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC6B0;&#xB9AC;&#xB294; &#xC774;&#xAC78; &#xC720;&#xB3C4;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBAA9;&#xC801;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image14.png" srcset="/img/loading.gif" alt></p>
<p>&#xB514;&#xC2A4;&#xD06C; &#xC804;&#xCCB4;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D;&#xC740; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. <code>DumpFilters</code>&#xB97C; &#xAE68;&#xB728;&#xB9AC;&#xAE30; &#xC704;&#xD574; &#xC218;&#xC2ED; GB &#xB514;&#xC2A4;&#xD06C;&#xC5D0;&#xC11C; &#xBB34;&#xC791;&#xC704; &#xBE14;&#xB85D;&#xC744; &#xCC0D;&#xC5B4;&#xB0BC; &#xC218;&#xB294; &#xC5C6;&#xC73C;&#xB2C8;, <code>CrashControl</code> &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xD558;&#xC774;&#xBE0C; &#xD30C;&#xC77C; &#xC624;&#xD504;&#xC14B; <code>0x13B330</code> &#xADFC;&#xCC98;&#xC5D0; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xCC3E;&#xC740; &#xB2E4;&#xC74C;, &#xADF8; &#xC8FC;&#xBCC0; &#xBA87;&#xC2ED; &#xAC1C; &#xBE14;&#xB85D;&#xB9CC; &#xD6C4;&#xBCF4;&#xB85C; &#xB450;&#xACE0; &#xD558;&#xB098;&#xC529; &#xAE68;&#xB728;&#xB824;&#xBCF4;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC0DD;&#xAC01;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. <code>CrashControl</code>&#xC774; &#xB4E4;&#xC5B4;&#xC788;&#xB294; &#xC704;&#xCE58;&#xC5D0;&#xC11C; &#xB300;&#xB7B5; 248&#xBC14;&#xC774;&#xD2B8; &#xB5A8;&#xC5B4;&#xC9C4; &#xADFC;&#xCC98;&#xC5D0; <code>DumpFilter</code> &#xAD00;&#xB828; &#xAD6C;&#xC870;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; Hex &#xAC12;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD588;&#xACE0;, 248&#xBC14;&#xC774;&#xD2B8;&#xB294; 16&#xBC14;&#xC774;&#xD2B8; &#xBE14;&#xB85D; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xB300;&#xB7B5; 15.5 &#xBE14;&#xB85D;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>+0xF0</code> &#xB610;&#xB294; <code>+0x100</code> &#xC8FC;&#xBCC0; &#xBE14;&#xB85D;&#xC744; &#xD6C4;&#xBCF4; &#xBE14;&#xB85D;&#xC73C;&#xB85C; &#xC7A1;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2026/01/22/banda/BitLocker_part1/ko/image15.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7FC; &#xC554;&#xD638;&#xD654;&#xB41C; &#xBCFC;&#xB968; &#xC548;&#xC5D0;&#xC11C; SYSTEM &#xD558;&#xC774;&#xBE0C;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC788;&#xACE0;, &#xADF8; &#xC911; <code>CrashControl</code> &#xD0A4; &#xB178;&#xB4DC;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC704;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? SYSTEM &#xD558;&#xC774;&#xBE0C; &#xD30C;&#xC77C;&#xC758; &#xAC19;&#xC740; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xD074;&#xB9B0; &#xC167;&#xB2E4;&#xC6B4;, &#xAC15;&#xC81C;&#xC885;&#xB8CC;, &#xD06C;&#xB798;&#xC2DC; &#xD6C4; &#xC7AC;&#xBD80;&#xD305; &#xAC19;&#xC740; &#xC0C1;&#xD0DC;&#xB97C; &#xC720;&#xBC1C;&#xD558;&#xBA74; &#xD2B9;&#xC815; &#xBE14;&#xB85D;&#xC774; &#xBC14;&#xB00C;&#xB294;&#xB370;, &#xC774; &#xBD80;&#xBD84;&#xC744; SYSTEM &#xD558;&#xC774;&#xBE0C; &#xC2DC;&#xC791; &#xADFC;&#xCC98;&#xC784;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; BSOD &#xC774;&#xD6C4; &#xC7AC;&#xBD80;&#xD305;&#xC744; &#xAC70;&#xCE58;&#xBA74; <code>CrashControl</code> &#xC544;&#xB798;&#xC5D0; <code>LastCrashDump</code>&#xB77C;&#xB294; &#xD2B9;&#xC815; &#xD718;&#xBC1C;&#xC131; &#xC11C;&#xBE0C;&#xD0A4;&#xAC00; &#xC0DD;&#xACBC;&#xB2E4;&#xAC00; &#xD074;&#xB9B0; &#xC885;&#xB8CC; &#xD6C4;&#xC5D0; &#xC0AC;&#xB77C;&#xC9C0;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xD574;&#xB2F9; &#xD0A4; &#xB178;&#xB4DC; &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xD544;&#xB4DC; &#xC77C;&#xBD80;&#xB9CC; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBC14;&#xB00C;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xD558;&#xC774;&#xBE0C; &#xC804;&#xCCB4;&#xB97C; &#xD6D1;&#xC73C;&#xBA74;&#xC11C; &#xB531; &#xADF8; &#xD328;&#xD134;&#xB300;&#xB85C; &#xBCC0;&#xD55C; &#xBE14;&#xB85D;&#xB4E4;&#xC744; <code>CrashControl</code> &#xD0A4; &#xB178;&#xB4DC;&#xB85C; &#xC0DD;&#xAC01;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><strong>&#xC815;&#xC0C1; &#xBD80;&#xD305; &#xC0C1;&#xD0DC;</strong></p>
<pre><code class="hljs c"><span class="hljs-function">Offset      Hex <span class="hljs-title">bytes</span> <span class="hljs-params">(<span class="hljs-number">16B</span>)</span>                                      ASCII</span>
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 ad 71 01 42 ed f0 da 01    ....nk ..q.B....
<span class="hljs-number">0x0056e300</span>  <span class="hljs-number">03</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> e8 <span class="hljs-number">03</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">01</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ................
<span class="hljs-number">0x0056e310</span>  <span class="hljs-number">28</span> <span class="hljs-number">7b</span> <span class="hljs-number">74</span> <span class="hljs-number">00</span> ff ff ff ff <span class="hljs-number">0</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">38</span> f4 a7 <span class="hljs-number">00</span>    ({t........<span class="hljs-number">.8</span>...
<span class="hljs-number">0x0056e320</span>  <span class="hljs-number">08</span> bc <span class="hljs-number">46</span> <span class="hljs-number">00</span> ff ff ff ff <span class="hljs-number">20</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ..F..... .......
<span class="hljs-number">0x0056e330</span>  <span class="hljs-number">2</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">30</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">0</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ,..<span class="hljs-number">.0</span>...........
<span class="hljs-number">0x0056e340</span>  <span class="hljs-number">43</span> <span class="hljs-number">72</span> <span class="hljs-number">61</span> <span class="hljs-number">73</span> <span class="hljs-number">68</span> <span class="hljs-number">43</span> <span class="hljs-number">6f</span> <span class="hljs-number">6</span>e <span class="hljs-number">74</span> <span class="hljs-number">72</span> <span class="hljs-number">6f</span> <span class="hljs-number">6</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    CrashControl....</code></pre>
<p><strong>&#xD06C;&#xB798;&#xC2DC;/BSOD &#xC9C1;&#xD6C4; &#xC0C1;&#xD0DC;</strong></p>
<pre><code class="hljs c"><span class="hljs-function">Offset      Hex <span class="hljs-title">bytes</span> <span class="hljs-params">(<span class="hljs-number">16B</span>)</span>                                      ASCII</span>
0x0056e2f0  a0 ff ff ff 6e 6b 20 00 73 62 74 ab 14 f7 da 01    ....nk ..sbt.....
<span class="hljs-number">0x0056e300</span>  <span class="hljs-number">03</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> e8 <span class="hljs-number">03</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">01</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ................
<span class="hljs-number">0x0056e310</span>  <span class="hljs-number">28</span> <span class="hljs-number">7b</span> <span class="hljs-number">74</span> <span class="hljs-number">00</span> c8 <span class="hljs-number">8</span>e <span class="hljs-number">01</span> <span class="hljs-number">80</span> <span class="hljs-number">0</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">38</span> f4 a7 <span class="hljs-number">00</span>    ({t........<span class="hljs-number">.8</span>...
<span class="hljs-number">0x0056e320</span>  <span class="hljs-number">08</span> bc <span class="hljs-number">46</span> <span class="hljs-number">00</span> ff ff ff ff <span class="hljs-number">20</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ..F..... .......
<span class="hljs-number">0x0056e330</span>  <span class="hljs-number">2</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">30</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">0</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ,..<span class="hljs-number">.0</span>...........
<span class="hljs-number">0x0056e340</span>  <span class="hljs-number">43</span> <span class="hljs-number">72</span> <span class="hljs-number">61</span> <span class="hljs-number">73</span> <span class="hljs-number">68</span> <span class="hljs-number">43</span> <span class="hljs-number">6f</span> <span class="hljs-number">6</span>e <span class="hljs-number">74</span> <span class="hljs-number">72</span> <span class="hljs-number">6f</span> <span class="hljs-number">6</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    CrashControl....</code></pre>
<p>&#xB450; &#xB364;&#xD504;&#xB97C; &#xBCF4;&#xBA74; &#xBA3C;&#xC800; &#xB208;&#xC5D0; &#xB744;&#xB294; &#xAC74;, &#xBB38;&#xC790;&#xC5F4; &#xC790;&#xCCB4;&#xB294; &#xC720;&#xC9C0;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;. &#xB450; &#xC0C1;&#xD0DC; &#xBAA8;&#xB450; <code>0x0056e340</code> &#xB77C;&#xC778;&#xC5D0; <code>CrashControl</code> &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xADF8;&#xB300;&#xB85C; &#xB0A8;&#xC544; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, <code>CrashControl</code>&#xC774;&#xB77C;&#xB294; &#xD14D;&#xC2A4;&#xD2B8;&#xAC00; &#xC0AC;&#xB77C;&#xC838;&#xC11C; &#xBABB; &#xCC3E;&#xB294; &#xC0C1;&#xD669;&#xC774; &#xC544;&#xB2C8;&#xB77C;, <code>CrashControl</code>&#xC744; &#xAE30;&#xC220;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xCCB4; &#xB0B4;&#xBD80;&#xC758; &#xC77C;&#xBD80; &#xD544;&#xB4DC;&#xAC00; &#xBC14;&#xB00C;&#xB294; &#xD615;&#xD0DC;&#xB85C; &#xC0C1;&#xD0DC;&#xB85C;, &#xC804;&#xCCB4;&#xAC00; &#xD1B5;&#xC9F8;&#xB85C; &#xB4A4;&#xBC14;&#xB010; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xC77C;&#xBD80; &#xD544;&#xB4DC;&#xB9CC; &#xC120;&#xD0DD;&#xC801;&#xC73C;&#xB85C; &#xBCC0;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB294; &#xBB34;&#xC791;&#xC704; &#xB364;&#xD504;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xB97C; &#xAC16;&#xB294; &#xAD6C;&#xC870;&#xB97C; &#xBCF4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC15;&#xD55C; &#xB2E8;&#xC11C;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs c"><span class="hljs-function">Offset      Hex <span class="hljs-title">bytes</span> <span class="hljs-params">(<span class="hljs-number">16B</span>)</span>                                      ASCII</span>
0x00000000  9c 1e d1 7a 39 39 d4 13 0c d4 40 c5 a8 6f c4 de    ...z99....@..o..
<span class="hljs-number">0x00000010</span>  e0 <span class="hljs-number">79</span> bc <span class="hljs-number">2</span>d dd <span class="hljs-number">66</span> e2 <span class="hljs-number">25</span> b0 <span class="hljs-number">48</span> <span class="hljs-number">0f</span> <span class="hljs-number">58</span> <span class="hljs-number">53</span> <span class="hljs-number">2f</span> <span class="hljs-number">06</span> <span class="hljs-number">5</span>d    .y.-.f.%.H.XS/.]
<span class="hljs-number">0x00000020</span>  <span class="hljs-number">74</span> ac c3 <span class="hljs-number">51</span> <span class="hljs-number">86</span> <span class="hljs-number">9</span>e <span class="hljs-number">74</span> <span class="hljs-number">64</span> e2 d9 <span class="hljs-number">6</span>e d0 <span class="hljs-number">9</span>c <span class="hljs-number">11</span> ee <span class="hljs-number">4</span>d    t..Q..td..n....M
<span class="hljs-number">0x00000030</span>  <span class="hljs-number">03</span> <span class="hljs-number">40</span> <span class="hljs-number">03</span> <span class="hljs-number">52</span> <span class="hljs-number">05</span> e0 bc <span class="hljs-number">37</span> <span class="hljs-number">41</span> c1 <span class="hljs-number">3f</span> a2 <span class="hljs-number">7</span>e <span class="hljs-number">2</span>a <span class="hljs-number">09</span> <span class="hljs-number">84</span>    .@.R..<span class="hljs-number">.7</span>A.?.~*..
<span class="hljs-number">0x00000040</span>  <span class="hljs-number">24</span> <span class="hljs-number">80</span> dc b8 <span class="hljs-number">6</span>a <span class="hljs-number">20</span> c8 <span class="hljs-number">81</span> <span class="hljs-number">2</span>d c6 <span class="hljs-number">61</span> <span class="hljs-number">30</span> <span class="hljs-number">39</span> <span class="hljs-number">9f</span> <span class="hljs-number">30</span> <span class="hljs-number">51</span>    $...j ..-.a09<span class="hljs-number">.0</span>Q
<span class="hljs-number">0x00000050</span>  <span class="hljs-number">31</span> <span class="hljs-number">1b</span> <span class="hljs-number">0</span>c <span class="hljs-number">74</span> <span class="hljs-number">80</span> <span class="hljs-number">96</span> <span class="hljs-number">8</span>c f2 ad <span class="hljs-number">9</span>d <span class="hljs-number">28</span> <span class="hljs-number">26</span> f9 ce <span class="hljs-number">8</span>d <span class="hljs-number">16</span>    <span class="hljs-number">1.</span>.t......(&amp;....
<span class="hljs-number">0x00000060</span>  <span class="hljs-number">1</span>c <span class="hljs-number">23</span> fd d1 <span class="hljs-number">08</span> <span class="hljs-number">45</span> f0 c1 <span class="hljs-number">84</span> bb e5 <span class="hljs-number">84</span> bf b6 <span class="hljs-number">73</span> <span class="hljs-number">17</span>    .#...E........s.
<span class="hljs-number">0x00000070</span>  f0 e3 <span class="hljs-number">50</span> f2 <span class="hljs-number">7</span>c <span class="hljs-number">35</span> <span class="hljs-number">7b</span> <span class="hljs-number">91</span> bd e5 <span class="hljs-number">5</span>e b3 a7 <span class="hljs-number">4</span>d <span class="hljs-number">4</span>c bf    ..P.|<span class="hljs-number">5</span>{...^..ML.
<span class="hljs-number">0x00000080</span>  db f0 de <span class="hljs-number">96</span> ba <span class="hljs-number">50</span> d9 <span class="hljs-number">09</span> <span class="hljs-number">3</span>d <span class="hljs-number">83</span> b2 fb <span class="hljs-number">1</span>a f4 <span class="hljs-number">35</span> aa    .....P..=....<span class="hljs-number">.5</span>.</code></pre>
<pre><code class="hljs c"><span class="hljs-function">Offset      Hex <span class="hljs-title">bytes</span> <span class="hljs-params">(<span class="hljs-number">16B</span>)</span>                                      ASCII</span>
0x00000000  48 49 42 52 09 00 00 00 33 c0 00 00 d8 04 00 00    HIBR....3.......
<span class="hljs-number">0x00000010</span>  <span class="hljs-number">04</span> <span class="hljs-number">3</span>e <span class="hljs-number">0</span>a <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">10</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    .&gt;..............
<span class="hljs-number">0x00000020</span>  <span class="hljs-number">3</span>e <span class="hljs-number">73</span> b2 <span class="hljs-number">1f</span> <span class="hljs-number">2b</span> f7 da <span class="hljs-number">01</span> <span class="hljs-number">3</span>e <span class="hljs-number">1</span>d <span class="hljs-number">07</span> <span class="hljs-number">2</span>a <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    &gt;s..+...&gt;..*....
<span class="hljs-number">0x00000030</span>  ff bd <span class="hljs-number">9b</span> bd <span class="hljs-number">7f</span> a4 <span class="hljs-number">5f</span> <span class="hljs-number">06</span> <span class="hljs-number">01</span> ca <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">0</span>a <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ......_.........
<span class="hljs-number">0x00000040</span>  <span class="hljs-number">00</span> <span class="hljs-number">30</span> <span class="hljs-number">44</span> a8 <span class="hljs-number">80</span> c2 ff ff <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">14</span> <span class="hljs-number">00</span> <span class="hljs-number">4</span>e <span class="hljs-number">21</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    <span class="hljs-number">.0</span>D.........N!..
<span class="hljs-number">0x00000050</span>  <span class="hljs-number">61</span> d7 <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">34</span> <span class="hljs-number">54</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    a......<span class="hljs-number">.4</span>T......
<span class="hljs-number">0x00000060</span>  <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">2</span>c <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ........,.......
<span class="hljs-number">0x00000070</span>  <span class="hljs-number">7</span>c <span class="hljs-number">13</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> fc <span class="hljs-number">57</span> <span class="hljs-number">02</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    |........W......
<span class="hljs-number">0x00000080</span>  a7 bf <span class="hljs-number">12</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">82</span> <span class="hljs-number">99</span> a9 <span class="hljs-number">68</span> <span class="hljs-number">02</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span> <span class="hljs-number">00</span>    ...........h....</code></pre>
<p>exploit &#xC804;&#xD6C4;&#xC758; raw &#xC139;&#xD130;&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xBA74;, exploit &#xC804;&#xC5D0;&#xB294; &#xC554;&#xD638;&#xBB38; &#xD2B9;&#xC131;&#xC0C1; &#xBB34;&#xC791;&#xC704;&#xCC98;&#xB7FC; &#xBCF4;&#xC774;&#xB294; &#xBC14;&#xC774;&#xD2B8;&#xC5F4;&#xC774; &#xAD00;&#xCC30;&#xB418;&#xC9C0;&#xB9CC;, exploit &#xD6C4;&#xC5D0;&#xB294; <code>HIBR</code> &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xD558;&#xC774;&#xBC84;&#xB124;&#xC774;&#xC158; &#xD5E4;&#xB354;&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xAD00;&#xCC30;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC989;, &#xD2B9;&#xC218; &#xACBD;&#xB85C;&#xC5D0;&#xC11C; &#xB364;&#xD504;/&#xD558;&#xC774;&#xBC84;&#xB124;&#xC774;&#xC158; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC554;&#xD638;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD615;&#xD0DC;&#xB85C; &#xADF8;&#xB300;&#xB85C; &#xB178;&#xCD9C;&#xB418;&#xC5B4; &#xB098;&#xD0C0;&#xB098;&#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-4-Reliability-vs-Randomization"><a href="#2-4-Reliability-vs-Randomization" class="headerlink" title="2.4 Reliability vs. Randomization"></a>2.4 Reliability vs. Randomization</h3><p>&#xC774;&#xB7EC;&#xD55C; CrashXTS &#xAC19;&#xC740; &#xD655;&#xB960;&#xC801; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xD575;&#xC2EC;&#xC740; &#xBB34;&#xACB0;&#xC131; &#xBD80;&#xC7AC;&#xB97C; &#xD1B5;&#xD55C; corrupt&#xC778;&#xB370;, &#xC774; &#xBC18;&#xC751;&#xC740; Windows &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB098; &#xBC84;&#xC804;, &#xC0C1;&#xD0DC;&#xC5D0; &#xB530;&#xB77C; &#xC27D;&#xAC8C; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; &#xD2B9;&#xC9D5; &#xB54C;&#xBB38;&#xC5D0; &#xC2E4;&#xC81C;&#xB85C; &#xC720;&#xB3C4;&#xD558;&#xAE30;&#xAC00; &#xC27D;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC19;&#xC740; Windows &#xBC84;&#xC804;&#xC774;&#xB77C;&#xB3C4; &#xC124;&#xCE58; &#xC774;&#xB825;, &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xB0B4;&#xC5ED;, &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC124;&#xCE58;/&#xC81C;&#xAC70;&#xC5D0; &#xB530;&#xB77C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD558;&#xC774;&#xBE0C; &#xB0B4;&#xBD80; &#xAD6C;&#xC870;&#xC640; &#xD30C;&#xC77C; &#xBC30;&#xCE58;&#xAC00; &#xB2EC;&#xB77C;&#xC9C0;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9E4; &#xC2DC;&#xC2A4;&#xD15C;&#xB9C8;&#xB2E4; &#xCC28;&#xB4F1; &#xBD84;&#xC11D;&#xC744; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC218;&#xD589;&#xD574;&#xC57C; &#xD558;&#xBA70; &#xC774; &#xACFC;&#xC815;&#xC758; &#xC790;&#xB3D9;&#xD654;&#xAC00; &#xC0AC;&#xC2E4;&#xC0C1; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; BitLocker &#xC815;&#xCC45;&#xC774; &#xBCC0;&#xACBD;&#xB418;&#xC5B4;&#xB3C4; &#xC774;&#xBBF8; &#xC554;&#xD638;&#xD654;&#xB41C; &#xBE14;&#xB85D;&#xC740; &#xC7AC;&#xC554;&#xD638;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xC6B4;&#xC601; &#xC774;&#xB825;&#xC5D0; &#xB530;&#xB77C; &#xB808;&#xC774;&#xC544;&#xC6C3; &#xC790;&#xCCB4;&#xAC00; &#xB2EC;&#xB77C;&#xC9C0;&#xBBC0;&#xB85C; &#xD55C; &#xBC88; &#xC131;&#xACF5;&#xD55C; &#xACF5;&#xACA9; &#xC704;&#xCE58;&#xAC00; &#xB2E4;&#xB978; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C;&#xB294; &#xC804;&#xD600; &#xC791;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. </p>
<h2 id="3-Conclusion"><a href="#3-Conclusion" class="headerlink" title="3. Conclusion"></a><strong>3. Conclusion</strong></h2><p><img src="/2026/01/22/banda/BitLocker_part1/ko/image16.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0;&#xC11C;&#xB294; CrashXTS&#xB294; XTS&#xC758; &#xADFC;&#xBCF8;&#xC801; &#xD55C;&#xACC4;&#xB97C; &#xC2E4;&#xC99D;&#xD588;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC6A9;&#xC131; &#xCE21;&#xBA74;&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xC18C; &#xC81C;&#xD55C;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xB2E4;&#xC74C; Part&#xC5D0;&#xC11C;&#xB294; BitLocker&#xC758; &#xC774;&#xB7F0; &#xC554;&#xD638;&#xD654; &#xBAA8;&#xB4DC; &#xBE14;&#xB85D; &#xC790;&#xCCB4;&#xC758; corrupt&#xB97C; &#xC77C;&#xC73C;&#xD0A4;&#xAE30;&#xBCF4;&#xB2E4;&#xB294;, <strong>WinRE &#xAC80;&#xC99D; &#xB204;&#xB77D;, &#xBCF5;&#xAD6C; &#xACBD;&#xB85C; &#xACB0;&#xD568;, &#xD0A4; &#xAD00;&#xB9AC; &#xC2E4;&#xC218;</strong> &#xAC19;&#xC740; &#xB17C;&#xB9AC;&#xC801; &#xACB0;&#xD568;&#xC744; &#xC774;&#xC6A9;&#xD55C; exploit&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC624;&#xB298;&#xB3C4; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.&#x1F604;</p>
<h2 id="References"><a href="#References" class="headerlink" title="References"></a>References</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf">https://dfir.ru/wp-content/uploads/2025/01/crashxts.pdf</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf?utm_source=chatgpt.com">https://csrc.nist.gov/csrc/media/projects/block-cipher-techniques/documents/bcm/comments/xts/follow-up_xts_comments-ball.pdf</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/">https://dfir.ru/2025/01/20/cve-2025-21210-aka-crashxts-a-practical-randomization-attack-against-bitlocker/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-21210</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/">https://www.iaesjournal.com/windows-bitlocker-bug-leaks-aes-xts-encryption/</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/banda/">banda</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/BitLocker/">BitLocker</a>
                  
                  <a class="hover-with-bg" href="/tags/CrashXTS/">CrashXTS</a>
                  
                  <a class="hover-with-bg" href="/tags/AES-XTS/">AES-XTS</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_banda.jpg" srcset="/img/loading.gif" alt="banda">
                  </div>

                  <div class="link-text">
                    <div class="link-title">banda</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/banda">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2026/01/22/banda/BitLocker_part1/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Unlocking BitLocker: Windows Full-Disk Encryption Under Attack: Part 1 (EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2026/01/21/newp1ayer48/CVE-2025-48593/">
                    <span class="hidden-mobile">[] CVE-2025-48593 : Android SDP DB    UAF  Zero-Click RCE</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2026/01/22/banda/BitLocker_part1/ko/';
        this.page.identifier = '/2026/01/22/banda/BitLocker_part1/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Unlocking BitLocker: Windows Full-Disk Encryption Under Attack: Part 1 (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
