

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;Part-III&#34;&gt;&lt;a href=&#34;#Part-III&#34; class=&#34;headerlink&#34; title=&#34;Part III&#34;&gt;&lt;/a&gt;Part III&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC8C;&amp;#xC368; Part 3&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 3&amp;#xC8FC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xAE00; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xC62C;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; 3&amp;#xC8FC;&amp;#xAC00; &amp;#xC65C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBE68;&amp;#xB9AC; &amp;#xC9C0;&amp;#xB098;&amp;#xAC08;&amp;#xAE4C;&amp;#xC694;. &amp;#xC544;&amp;#xB9C8; &amp;#xAC1C;&amp;#xAC15;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xBE60;&amp;#xC9C0;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xCC38; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD758;&amp;#xB7EC;&amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB290;&amp;#xAEF4;&amp;#xC9C0;&amp;#xB098; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC640; TTD data object&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Part 2&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB124;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &lt;s&gt;&amp;#xC548; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/s&gt; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Apex Legends &amp;#xAFC0;&amp;#xC7BC; &amp;#x314E;&amp;#x314E;;; &amp;#xC0AC;&amp;#xC2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD558;&amp;#xAE34; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9C9;&amp;#xC0C1; &amp;#x201C;TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xAFC0;&amp;#xD301;!&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30;&amp;#xC5D4; &amp;#xC5C4;&amp;#xCCAD; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC774;&amp;#xBBF8; &amp;#xC774;&amp;#xC804; &amp;#xD30C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC774; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xACE0; &amp;#xBA87;&amp;#xBA87; &amp;#xC0C1;&amp;#xD669;&amp;#xB4E4;&amp;#xC740; &amp;#xAE00;&amp;#xB85C; &amp;#xD615;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D4; &amp;#xC800;&amp;#xC758; &amp;#xAE00;&amp;#xBE68;&amp;#xC774; &amp;#xB538;&amp;#xB9AC;&amp;#xACE0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/both.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; Part 2 &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0; &amp;#xC608;&amp;#xACE0;&amp;#xD588;&amp;#xB358; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE00; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; Part 3&amp;#xC5D0; &amp;#xBAB0;&amp;#xC544; &amp;#xC4F0;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744;-&amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xD574;&amp;#xCEE4;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xC548;&amp;#xB0B4;&amp;#xC11C;-&amp;#xC774;&amp;#xC804;-&amp;#xAE00;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xAC04;&amp;#xC744;-&amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xD574;&amp;#xCEE4;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xC548;&amp;#xB0B4;&amp;#xC11C;-&amp;#xC774;&amp;#xC804;-&amp;#xAE00;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/&#34;&gt;Part1&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/21/fabu1ous/ttd-2/&#34;&gt;Part2&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Time-Travel-Debugging-objects&#34;&gt;&lt;a href=&#34;#Time-Travel-Debugging-objects&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Debugging objects&#34;&gt;&lt;/a&gt;Time Travel Debugging objects&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC120; TTD data model object&amp;#xC640; Trace File&amp;#xB85C;&amp;#xBD80;&amp;#xD130; TTD data model object&amp;#xB97C; Query &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. TTD Trace File &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; Process Object&amp;#xC640; Session Object&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xBA70; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xADF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;dx-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#dx-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;&amp;gt; dx Debugger&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;dx&lt;/code&gt;&amp;#xB294; Debugger Object Model Expression&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C;(&amp;#xB531; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB9CC;) &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xB354; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &lt;a href=&#34;[](&#34;&gt;ms docs dx&lt;/a&gt;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;-g&lt;/code&gt;&amp;#xC640; &lt;code&gt;-r#&lt;/code&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;-g&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; Heap Object&amp;#xB098; Module Object &amp;#xB4F1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;-r#&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xB300; &lt;code&gt;#&lt;/code&gt; &amp;#xB808;&amp;#xBCA8;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD558;&amp;#xC704; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xBA74; &lt;code&gt;-r1&lt;/code&gt;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;call stack &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;&amp;gt; dx -r1 Debugger.Sessions.First().Processes.First().Threads.First().Stack.Frames&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dx&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xC158;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; call stack&amp;#xC744; &lt;code&gt;-r1&lt;/code&gt;&amp;#xC758; &amp;#xC7AC;&amp;#xADC0; &amp;#xB808;&amp;#xBCA8;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD55C; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4C8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt; &amp;gt; dx -g @$curprocess.Modules&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Trace &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; Module&amp;#xB4E4;&amp;#xC744; grid &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD55C; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Process-Object&#34;&gt;&lt;a href=&#34;#Process-Object&#34; class=&#34;headerlink&#34; title=&#34;Process Object&#34;&gt;&lt;/a&gt;Process Object&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9; &amp;#xC801;&amp;#xC73C;&amp;#xB85C; TTD data model object&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xAE00; &amp;#xCD08;&amp;#xBC18; &amp;#xBD80;&amp;#xC5D0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; Process object&amp;#xC640; Session object&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xADF8;&amp;#xC911; Process Object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &lt;code&gt;@$curprocess.TTD&lt;/code&gt; namespace&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Lifetime&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD range object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; Trace File&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. MinPosition&amp;#xC740; Trace File&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; TTD Position&amp;#xC744;, MaxPosition&amp;#xC740; Trace File&amp;#xC758; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; TTD Position&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Threads&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD thread object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; Trace File&amp;#xC758; Lifetime&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Events&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD event object&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD9C;&amp;#xB825; &amp;#xC2DC; Trace File &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; Module&amp;#xC758; &amp;#xB85C;&amp;#xB4DC; &amp;#xC2DC;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; Exception &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00;. Part 2&amp;#xC5D0;&amp;#xC120; &amp;#xC774; Event object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Exception &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Session-Object&#34;&gt;&lt;a href=&#34;#Session-Object&#34; class=&#34;headerlink&#34; title=&#34;Session Object&#34;&gt;&lt;/a&gt;Session Object&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; Session Object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;@$cursession.TTD&lt;/code&gt; namespace&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Data.Heap()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Trace File &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; Heap object&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Data.Heap()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xC640; grid &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC904; &amp;#xC8FC;&amp;#xC18C;, &amp;#xC0AC;&amp;#xC774;&amp;#xC988;, &amp;#xD560;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC810;, &amp;#xD574;&amp;#xC81C; &amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xB418;&amp;#xAC8C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD799; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB85C; &amp;#xC758;&amp;#xC2EC;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778;&amp;#xB370; &amp;#xC774; &lt;code&gt;Data.Heap()&lt;/code&gt; object&amp;#xB97C; &amp;#xC815;&amp;#xB9D0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Calls()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; calls object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Calls()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD638;&amp;#xCD9C; &amp;#xD69F;&amp;#xC218;, &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xC810;, &amp;#xB9AC;&amp;#xD134; &amp;#xC2DC;&amp;#xC810;, &amp;#xB9AC;&amp;#xD134; &amp;#xAC12; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. breakpoint&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; Calls query&amp;#xB97C; TimeStart&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB82C;&amp;#xD55C; &amp;#xD6C4; &amp;#xB9E8; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD639;&amp;#xC740; crash &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; Calls() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC774; &amp;#xC0B4;&amp;#xC544; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Memory()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Memory object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;, &amp;#xC811;&amp;#xADFC; &amp;#xD0C0;&amp;#xC785;, &amp;#xB2F9;&amp;#xC2DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC758; &amp;#xC0C1;&amp;#xD669; &amp;#xB4F1;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; Part 2&amp;#xC5D0;&amp;#xC11C; EBP&amp;#xAC00; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xB300;&amp;#xC2E0; &amp;#xC774; Memory object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560;&amp;#xAE4C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ba&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; range&amp;#xB97C; &amp;#xCD5C;&amp;#xB300; 8 bytes&amp;#xAE4C;&amp;#xC9C0; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; TTD Memory object query&amp;#xB294; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Query&#34;&gt;&lt;a href=&#34;#Query&#34; class=&#34;headerlink&#34; title=&#34;Query&#34;&gt;&lt;/a&gt;Query&lt;/h1&gt;&lt;p&gt;TTD data object&amp;#xB4E4;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xADF8;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xADF8; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xD134; &amp;#xBC1B;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB82C; &amp;#xBC0F; &amp;#xAC00;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Sorting-Queries&#34;&gt;&lt;a href=&#34;#Sorting-Queries&#34; class=&#34;headerlink&#34; title=&#34;Sorting Queries&#34;&gt;&lt;/a&gt;Sorting Queries&lt;/h2&gt;&lt;p&gt;OrderBy() &amp;#xD639;&amp;#xC740; OrderByDescending()&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; column&amp;#xC744; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC815;&amp;#xB82C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Calls() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB358; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC778;&amp;#xB370; crash &amp;#xC2DC;&amp;#xC810;, &amp;#xD639;&amp;#xC740; Trace File&amp;#xC758; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC00;&amp;#xAC00;&amp;#xC6B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; TimeStart&amp;#xC640; OrderByDescending()&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OrderBy()&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).OrderBy(c =&amp;gt; c.TimeStart)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;TimeStart column&amp;#xC73C;&amp;#xB85C; &amp;#xC624;&amp;#xB984; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC0AC;&amp;#xC2E4; TimeStart&amp;#xB85C; &amp;#xC624;&amp;#xB984; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xC815;&amp;#xB82C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;.)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OrderByDescending()&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).OrderByDescending(c =&amp;gt; c.TimeStart)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;TimeStart column&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB9BC; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Specifying-elements-in-query&#34;&gt;&lt;a href=&#34;#Specifying-elements-in-query&#34; class=&#34;headerlink&#34; title=&#34;Specifying elements in query&#34;&gt;&lt;/a&gt;Specifying elements in query&lt;/h2&gt;&lt;p&gt;query&amp;#xC5D0; append &amp;#xB41C; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815;&amp;#xC9C0;&amp;#xC5B4;&amp;#xC11C; &amp;#xCD9C;&amp;#xB825;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. First() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC9D6;&amp;#xAC70;&amp;#xB098; &amp;#xB300;&amp;#xAD04;&amp;#xD638;&amp;#xC640; index number&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).First()
dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;)[&lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;]&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Filtering-in-a-query&#34;&gt;&lt;a href=&#34;#Filtering-in-a-query&#34; class=&#34;headerlink&#34; title=&#34;Filtering in a query&#34;&gt;&lt;/a&gt;Filtering in a query&lt;/h2&gt;&lt;p&gt;SQL&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; Where() &amp;#xD639;&amp;#xC740; Select()&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; query&amp;#xB97C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC608;&amp;#xC81C;&amp;#xB294; &lt;code&gt;kernelbase!GetLastError&lt;/code&gt;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xC911; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; TimeStart&amp;#xAC12;&amp;#xACFC; ReturnValue&amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xB41C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Select() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB294; &amp;#xAC01; column&amp;#xC758; display name&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; string &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&amp;#xC758; size &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC640; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xD638;&amp;#xCD9C;&amp;#xB9CC; &amp;#xACE8;&amp;#xB77C; &amp;#xBCFC; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC720;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).Where(c =&amp;gt; c.ReturnValue != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;).Select(c =&amp;gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt; { Time = c.TimeStart, Error = c.ReturnValue })&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Assigning-query-to-a-variable&#34;&gt;&lt;a href=&#34;#Assigning-query-to-a-variable&#34; class=&#34;headerlink&#34; title=&#34;Assigning query to a variable&#34;&gt;&lt;/a&gt;Assigning query to a variable&lt;/h2&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; query&amp;#xB97C; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C; &amp;#xD6C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xAE34; query&amp;#xB97C; &amp;#xB9E4;&amp;#xBC88; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$myResults = @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).Where(c =&amp;gt; c.ReturnValue != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;).Select(c =&amp;gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt; { Time = c.TimeStart, Error = c.ReturnValue })&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC78;&amp;#xB85C; &amp;#x201C;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C;&amp;#x201D; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; TTD&amp;#xB85C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xAC74;&amp;#xB370; TTD &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBAB8;&amp;#xC774; &amp;#xB3FC;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xB144;&amp;#xC5D4; TTD &amp;#xC5C6;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD55C; &amp;#xAC70;&amp;#xC9C0;? &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xADF8;&amp;#xB54C; &amp;#xB354; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC798;&amp;#xD588;&amp;#xB358; &amp;#xAC70; &amp;#xAC19;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;;; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; TTD&amp;#xAC00; &amp;#xC88B;&amp;#xB2E4;!&amp;#xB77C;&amp;#xACE0; &amp;#xACB0;&amp;#xB860; &amp;#xC9D3;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC820; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] 시간을 여행하는 해커를 위한 안내서 Part3 - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;Part-III&#34;&gt;&lt;a href=&#34;#Part-III&#34; class=&#34;headerlink&#34; title=&#34;Part III&#34;&gt;&lt;/a&gt;Part III&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC8C;&amp;#xC368; Part 3&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. 3&amp;#xC8FC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xAE00; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xC62C;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; 3&amp;#xC8FC;&amp;#xAC00; &amp;#xC65C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBE68;&amp;#xB9AC; &amp;#xC9C0;&amp;#xB098;&amp;#xAC08;&amp;#xAE4C;&amp;#xC694;. &amp;#xC544;&amp;#xB9C8; &amp;#xAC1C;&amp;#xAC15;&amp;#xB3C4; &amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xBE60;&amp;#xC9C0;&amp;#xB2C8; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xCC38; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD758;&amp;#xB7EC;&amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xB290;&amp;#xAEF4;&amp;#xC9C0;&amp;#xB098; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC640; TTD data object&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Part 2&amp;#xB97C; &amp;#xC77D;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC774;&amp;#xAC8C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC8E0;? &amp;#xB124;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &lt;s&gt;&amp;#xC548; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/s&gt; &amp;#xBABB;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Apex Legends &amp;#xAFC0;&amp;#xC7BC; &amp;#x314E;&amp;#x314E;;; &amp;#xC0AC;&amp;#xC2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD558;&amp;#xAE34; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB9C9;&amp;#xC0C1; &amp;#x201C;TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xAFC0;&amp;#xD301;!&amp;#x201D;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xAE00;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30;&amp;#xC5D4; &amp;#xC5C4;&amp;#xCCAD; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;. &amp;#xC774;&amp;#xBBF8; &amp;#xC774;&amp;#xC804; &amp;#xD30C;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC774; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xACE0; &amp;#xBA87;&amp;#xBA87; &amp;#xC0C1;&amp;#xD669;&amp;#xB4E4;&amp;#xC740; &amp;#xAE00;&amp;#xB85C; &amp;#xD615;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D4; &amp;#xC800;&amp;#xC758; &amp;#xAE00;&amp;#xBE68;&amp;#xC774; &amp;#xB538;&amp;#xB9AC;&amp;#xACE0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/both.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; Part 2 &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC5D0; &amp;#xC608;&amp;#xACE0;&amp;#xD588;&amp;#xB358; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE00; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; Part 3&amp;#xC5D0; &amp;#xBAB0;&amp;#xC544; &amp;#xC4F0;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744;-&amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xD574;&amp;#xCEE4;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xC548;&amp;#xB0B4;&amp;#xC11C;-&amp;#xC774;&amp;#xC804;-&amp;#xAE00;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xAC04;&amp;#xC744;-&amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xD574;&amp;#xCEE4;&amp;#xB97C;-&amp;#xC704;&amp;#xD55C;-&amp;#xC548;&amp;#xB0B4;&amp;#xC11C;-&amp;#xC774;&amp;#xC804;-&amp;#xAE00;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C; &amp;#xC774;&amp;#xC804; &amp;#xAE00;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/&#34;&gt;Part1&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/21/fabu1ous/ttd-2/&#34;&gt;Part2&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;Time-Travel-Debugging-objects&#34;&gt;&lt;a href=&#34;#Time-Travel-Debugging-objects&#34; class=&#34;headerlink&#34; title=&#34;Time Travel Debugging objects&#34;&gt;&lt;/a&gt;Time Travel Debugging objects&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC120; TTD data model object&amp;#xC640; Trace File&amp;#xB85C;&amp;#xBD80;&amp;#xD130; TTD data model object&amp;#xB97C; Query &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. TTD Trace File &amp;#xC0AC;&amp;#xC6A9; &amp;#xC2DC; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; Process Object&amp;#xC640; Session Object&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xBA70; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xADF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;dx-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;a href=&#34;#dx-&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34; class=&#34;headerlink&#34; title=&#34;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&#34;&gt;&lt;/a&gt;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&lt;/h1&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;&amp;gt; dx Debugger&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;dx&lt;/code&gt;&amp;#xB294; Debugger Object Model Expression&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5; &amp;#xC704;&amp;#xC8FC;&amp;#xB85C;(&amp;#xB531; &amp;#xC774; &amp;#xAE00;&amp;#xC744; &amp;#xC77D;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB9CC;) &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xB354; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &lt;a href=&#34;[](&#34;&gt;ms docs dx&lt;/a&gt;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC2DC;&amp;#xAE38; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &lt;code&gt;dx&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; Part 3&amp;#xC5D0;&amp;#xC11C; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;-g&lt;/code&gt;&amp;#xC640; &lt;code&gt;-r#&lt;/code&gt;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;-g&lt;/p&gt;
&lt;p&gt;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; Heap Object&amp;#xB098; Module Object &amp;#xB4F1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;-r#&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xB300; &lt;code&gt;#&lt;/code&gt; &amp;#xB808;&amp;#xBCA8;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD558;&amp;#xC704; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0DD;&amp;#xB7B5;&amp;#xD558;&amp;#xBA74; &lt;code&gt;-r1&lt;/code&gt;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;a href=&#34;#&amp;#xC0AC;&amp;#xC6A9;-&amp;#xC608;&amp;#xC2DC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&#34;&gt;&lt;/a&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xC608;&amp;#xC2DC;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;call stack &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt;&amp;gt; dx -r1 Debugger.Sessions.First().Processes.First().Threads.First().Stack.Frames&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dx&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xC138;&amp;#xC158;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; call stack&amp;#xC744; &lt;code&gt;-r1&lt;/code&gt;&amp;#xC758; &amp;#xC7AC;&amp;#xADC0; &amp;#xB808;&amp;#xBCA8;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD55C; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4C8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCD9C;&amp;#xB825;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;000&lt;/span&gt; &amp;gt; dx -g @$curprocess.Modules&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Trace &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; Module&amp;#xB4E4;&amp;#xC744; grid &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xCD9C;&amp;#xB825;&amp;#xD55C; &amp;#xBAA8;&amp;#xC2B5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Process-Object&#34;&gt;&lt;a href=&#34;#Process-Object&#34; class=&#34;headerlink&#34; title=&#34;Process Object&#34;&gt;&lt;/a&gt;Process Object&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;dx &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9; &amp;#xC801;&amp;#xC73C;&amp;#xB85C; TTD data model object&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xAE00; &amp;#xCD08;&amp;#xBC18; &amp;#xBD80;&amp;#xC5D0; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; TTD&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; Process object&amp;#xC640; Session object&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBAA8;&amp;#xB378;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;? &amp;#xADF8;&amp;#xC911; Process Object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.  &lt;code&gt;@$curprocess.TTD&lt;/code&gt; namespace&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Lifetime&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD range object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; Trace File&amp;#xC758; &amp;#xBC94;&amp;#xC704;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. MinPosition&amp;#xC740; Trace File&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; TTD Position&amp;#xC744;, MaxPosition&amp;#xC740; Trace File&amp;#xC758; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; TTD Position&amp;#xC744; &amp;#xB73B;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Threads&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD thread object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC804;&amp;#xCCB4; Trace File&amp;#xC758; Lifetime&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Events&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;TTD event object&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD9C;&amp;#xB825; &amp;#xC2DC; Trace File &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; Module&amp;#xC758; &amp;#xB85C;&amp;#xB4DC; &amp;#xC2DC;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; Exception &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC810;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00;. Part 2&amp;#xC5D0;&amp;#xC120; &amp;#xC774; Event object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; Exception &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Session-Object&#34;&gt;&lt;a href=&#34;#Session-Object&#34; class=&#34;headerlink&#34; title=&#34;Session Object&#34;&gt;&lt;/a&gt;Session Object&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D4; Session Object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;@$cursession.TTD&lt;/code&gt; namespace&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Data.Heap()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Trace File &amp;#xC804;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; Heap object&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Data.Heap()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xC640; grid &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC904; &amp;#xC8FC;&amp;#xC18C;, &amp;#xC0AC;&amp;#xC774;&amp;#xC988;, &amp;#xD560;&amp;#xB2F9; &amp;#xC2DC;&amp;#xC810;, &amp;#xD574;&amp;#xC81C; &amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xD55C;&amp;#xB208;&amp;#xC5D0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xB418;&amp;#xAC8C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD799; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB85C; &amp;#xC758;&amp;#xC2EC;&amp;#xB418;&amp;#xB294; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778;&amp;#xB370; &amp;#xC774; &lt;code&gt;Data.Heap()&lt;/code&gt; object&amp;#xB97C; &amp;#xC815;&amp;#xB9D0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Calls()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; calls object&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;Calls()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD638;&amp;#xCD9C; &amp;#xD69F;&amp;#xC218;, &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xC810;, &amp;#xB9AC;&amp;#xD134; &amp;#xC2DC;&amp;#xC810;, &amp;#xB9AC;&amp;#xD134; &amp;#xAC12; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. breakpoint&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; Calls query&amp;#xB97C; TimeStart&amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xB82C;&amp;#xD55C; &amp;#xD6C4; &amp;#xB9E8; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD639;&amp;#xC740; crash &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC00;&amp;#xAE4C;&amp;#xC6B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xC27D;&amp;#xAC8C;&amp;#xB3C4; Calls() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC774; &amp;#xC0B4;&amp;#xC544; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Memory()&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Memory object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD55C; &amp;#xC2DC;&amp;#xC810;, &amp;#xC811;&amp;#xADFC; &amp;#xD0C0;&amp;#xC785;, &amp;#xB2F9;&amp;#xC2DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC758; &amp;#xC0C1;&amp;#xD669; &amp;#xB4F1;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xD638;&amp;#xD658;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; Part 2&amp;#xC5D0;&amp;#xC11C; EBP&amp;#xAC00; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F0;&amp;#xC774;&amp;#xB294; &amp;#xC2DC;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574; ba &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xB300;&amp;#xC2E0; &amp;#xC774; Memory object&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560;&amp;#xAE4C; &amp;#xACE0;&amp;#xBBFC;&amp;#xD588;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ba&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D4; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; range&amp;#xB97C; &amp;#xCD5C;&amp;#xB300; 8 bytes&amp;#xAE4C;&amp;#xC9C0; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; TTD Memory object query&amp;#xB294; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Query&#34;&gt;&lt;a href=&#34;#Query&#34; class=&#34;headerlink&#34; title=&#34;Query&#34;&gt;&lt;/a&gt;Query&lt;/h1&gt;&lt;p&gt;TTD data object&amp;#xB4E4;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xC640; &amp;#xADF8;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC758; &amp;#xC885;&amp;#xB958;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xADF8; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xD134; &amp;#xBC1B;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB82C; &amp;#xBC0F; &amp;#xAC00;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Sorting-Queries&#34;&gt;&lt;a href=&#34;#Sorting-Queries&#34; class=&#34;headerlink&#34; title=&#34;Sorting Queries&#34;&gt;&lt;/a&gt;Sorting Queries&lt;/h2&gt;&lt;p&gt;OrderBy() &amp;#xD639;&amp;#xC740; OrderByDescending()&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; column&amp;#xC744; &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC815;&amp;#xB82C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Calls() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xB97C; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB358; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC778;&amp;#xB370; crash &amp;#xC2DC;&amp;#xC810;, &amp;#xD639;&amp;#xC740; Trace File&amp;#xC758; &amp;#xC885;&amp;#xB8CC; &amp;#xC2DC;&amp;#xC810;&amp;#xACFC; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC00;&amp;#xAC00;&amp;#xC6B4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; TimeStart&amp;#xC640; OrderByDescending()&amp;#xC744; &amp;#xC8FC;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OrderBy()&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).OrderBy(c =&amp;gt; c.TimeStart)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;TimeStart column&amp;#xC73C;&amp;#xB85C; &amp;#xC624;&amp;#xB984; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC0AC;&amp;#xC2E4; TimeStart&amp;#xB85C; &amp;#xC624;&amp;#xB984; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xC815;&amp;#xB82C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xAC70;&amp;#xB4E0;&amp;#xC694;.)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OrderByDescending()&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).OrderByDescending(c =&amp;gt; c.TimeStart)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;TimeStart column&amp;#xC73C;&amp;#xB85C; &amp;#xB0B4;&amp;#xB9BC; &amp;#xCC28;&amp;#xC21C; &amp;#xC815;&amp;#xB82C;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xC608;&amp;#xC81C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Specifying-elements-in-query&#34;&gt;&lt;a href=&#34;#Specifying-elements-in-query&#34; class=&#34;headerlink&#34; title=&#34;Specifying elements in query&#34;&gt;&lt;/a&gt;Specifying elements in query&lt;/h2&gt;&lt;p&gt;query&amp;#xC5D0; append &amp;#xB41C; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815;&amp;#xC9C0;&amp;#xC5B4;&amp;#xC11C; &amp;#xCD9C;&amp;#xB825;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. First() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xC9D6;&amp;#xAC70;&amp;#xB098; &amp;#xB300;&amp;#xAD04;&amp;#xD638;&amp;#xC640; index number&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; element&amp;#xB97C; &amp;#xD2B9;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).First()
dx @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;)[&lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;]&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Filtering-in-a-query&#34;&gt;&lt;a href=&#34;#Filtering-in-a-query&#34; class=&#34;headerlink&#34; title=&#34;Filtering in a query&#34;&gt;&lt;/a&gt;Filtering in a query&lt;/h2&gt;&lt;p&gt;SQL&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xAC8C; Where() &amp;#xD639;&amp;#xC740; Select()&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; query&amp;#xB97C; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &amp;#xC608;&amp;#xC81C;&amp;#xB294; &lt;code&gt;kernelbase!GetLastError&lt;/code&gt;&amp;#xC758; &amp;#xD638;&amp;#xCD9C;&amp;#xC911; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; TimeStart&amp;#xAC12;&amp;#xACFC; ReturnValue&amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xB41C; query&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Select() &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB294; &amp;#xAC01; column&amp;#xC758; display name&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD574; &amp;#xC904; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCEE4;&amp;#xB7FD;&amp;#xC158; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; string &amp;#xAD00;&amp;#xB828; &amp;#xD568;&amp;#xC218;&amp;#xC758; size &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC640; &amp;#xB9AC;&amp;#xD134; &amp;#xAC12;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xD638;&amp;#xCD9C;&amp;#xB9CC; &amp;#xACE8;&amp;#xB77C; &amp;#xBCFC; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC720;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).Where(c =&amp;gt; c.ReturnValue != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;).Select(c =&amp;gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt; { Time = c.TimeStart, Error = c.ReturnValue })&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Assigning-query-to-a-variable&#34;&gt;&lt;a href=&#34;#Assigning-query-to-a-variable&#34; class=&#34;headerlink&#34; title=&#34;Assigning query to a variable&#34;&gt;&lt;/a&gt;Assigning query to a variable&lt;/h2&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; query&amp;#xB97C; &amp;#xBCC0;&amp;#xC218;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C; &amp;#xD6C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xAE34; query&amp;#xB97C; &amp;#xB9E4;&amp;#xBC88; &amp;#xC785;&amp;#xB825;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;dx -r2 @$myResults = @$cursession.TTD.Calls(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;kernelbase!GetLastError&amp;quot;&lt;/span&gt;).Where(c =&amp;gt; c.ReturnValue != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;).Select(c =&amp;gt; &lt;span class=&#34;hljs-keyword&#34;&gt;new&lt;/span&gt; { Time = c.TimeStart, Error = c.ReturnValue })&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/03/14/fabu1ous/ttd-3/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xAC78;&amp;#xB85C; &amp;#x201C;&amp;#xC2DC;&amp;#xAC04;&amp;#xC744; &amp;#xC5EC;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC548;&amp;#xB0B4;&amp;#xC11C;&amp;#x201D; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xB05D;&amp;#xB0AC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; TTD&amp;#xB85C; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xAC74;&amp;#xB370; TTD &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBAB8;&amp;#xC774; &amp;#xB3FC;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xB144;&amp;#xC5D4; TTD &amp;#xC5C6;&amp;#xC774; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD55C; &amp;#xAC70;&amp;#xC9C0;? &amp;#xC624;&amp;#xD788;&amp;#xB824; &amp;#xADF8;&amp;#xB54C; &amp;#xB354; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC798;&amp;#xD588;&amp;#xB358; &amp;#xAC70; &amp;#xAC19;&amp;#xAE30;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x314E;&amp;#x314E;;; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; TTD&amp;#xAC00; &amp;#xC88B;&amp;#xB2E4;!&amp;#xB77C;&amp;#xACE0; &amp;#xACB0;&amp;#xB860; &amp;#xC9D3;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC820; &amp;#xC9C4;&amp;#xC9DC; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/03/14/fabu1ous/ttd-3/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/14/fabu1ous/ttd-3/">

  <title>[Research] 시간을 여행하는 해커를 위한 안내서 Part3 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-14 14:00" pubdate>
      2021년 3월 14일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.2k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      44
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] 시간을 여행하는 해커를 위한 안내서 Part3</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="Part-III"><a href="#Part-III" class="headerlink" title="Part III"></a>Part III</h1><p><img src="/2021/03/14/fabu1ous/ttd-3/1.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC8C;&#xC368; Part 3&#xC785;&#xB2C8;&#xB2E4;. 3&#xC8FC;&#xB9C8;&#xB2E4; &#xC2DC;&#xB9AC;&#xC988; &#xAE00; &#xD558;&#xB098;&#xC529; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xC62C;&#xB9AC;&#xACE0; &#xC788;&#xB294;&#xB370; 3&#xC8FC;&#xAC00; &#xC65C; &#xC774;&#xB807;&#xAC8C; &#xBE68;&#xB9AC; &#xC9C0;&#xB098;&#xAC08;&#xAE4C;&#xC694;. &#xC544;&#xB9C8; &#xAC1C;&#xAC15;&#xB3C4; &#xD558;&#xACE0; &#xBC14;&#xBE60;&#xC9C0;&#xB2C8; &#xC2DC;&#xAC04;&#xC774; &#xCC38; &#xBE60;&#xB974;&#xAC8C; &#xD758;&#xB7EC;&#xAC00;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xB290;&#xAEF4;&#xC9C0;&#xB098; &#xBD05;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; Part 3&#xC5D0;&#xC11C;&#xB294; <code>dx</code> &#xBA85;&#xB839;&#xC5B4;&#xC640; TTD data object&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. Part 2&#xB97C; &#xC77D;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC774;&#xB77C;&#xBA74; &#xC774;&#xAC8C; &#xBB34;&#xC5C7;&#xC744; &#xB73B;&#xD558;&#xB294;&#xC9C0; &#xC544;&#xC2DC;&#xACA0;&#xC8E0;? &#xB124;, &#xC774;&#xBC88;&#xC5D0;&#xB3C4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; <s>&#xC548; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;</s> &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. Apex Legends &#xAFC0;&#xC7BC; &#x314E;&#x314E;;; &#xC0AC;&#xC2E4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xD558;&#xAE34; &#xD588;&#xB294;&#xB370; &#xB9C9;&#xC0C1; &#x201C;TTD&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; &#xAFC0;&#xD301;!&#x201D;&#xC774;&#xB77C;&#xB294; &#xC8FC;&#xC81C;&#xB85C; &#xD558;&#xB098;&#xC758; &#xAE00;&#xC744; &#xC4F0;&#xAE30;&#xC5D4; &#xC5C4;&#xCCAD; &#xC560;&#xB9E4;&#xD558;&#xB354;&#xB77C;&#xACE0;&#xC694;. &#xC774;&#xBBF8; &#xC774;&#xC804; &#xD30C;&#xD2B8;&#xB4E4;&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; &#xB0B4;&#xC6A9;&#xB4E4;&#xC774; &#xB300;&#xBD80;&#xBD84;&#xC774;&#xACE0; &#xBA87;&#xBA87; &#xC0C1;&#xD669;&#xB4E4;&#xC740; &#xAE00;&#xB85C; &#xD615;&#xC6A9;&#xD558;&#xAE30;&#xC5D4; &#xC800;&#xC758; &#xAE00;&#xBE68;&#xC774; &#xB538;&#xB9AC;&#xACE0;&#x2026;</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/both.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB798;&#xC11C; Part 2 &#xB9C8;&#xC9C0;&#xB9C9;&#xC5D0; &#xC608;&#xACE0;&#xD588;&#xB358; &#xB450; &#xAC00;&#xC9C0; &#xAE00; &#xC8FC;&#xC81C;&#xB97C; Part 3&#xC5D0; &#xBAB0;&#xC544; &#xC4F0;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC2DC;&#xAC04;&#xC744;-&#xC5EC;&#xD589;&#xD558;&#xB294;-&#xD574;&#xCEE4;&#xB97C;-&#xC704;&#xD55C;-&#xC548;&#xB0B4;&#xC11C;-&#xC774;&#xC804;-&#xAE00;"><a href="#&#xC2DC;&#xAC04;&#xC744;-&#xC5EC;&#xD589;&#xD558;&#xB294;-&#xD574;&#xCEE4;&#xB97C;-&#xC704;&#xD55C;-&#xC548;&#xB0B4;&#xC11C;-&#xC774;&#xC804;-&#xAE00;" class="headerlink" title="&#xC2DC;&#xAC04;&#xC744; &#xC5EC;&#xD589;&#xD558;&#xB294; &#xD574;&#xCEE4;&#xB97C; &#xC704;&#xD55C; &#xC548;&#xB0B4;&#xC11C; &#xC774;&#xC804; &#xAE00;"></a>&#xC2DC;&#xAC04;&#xC744; &#xC5EC;&#xD589;&#xD558;&#xB294; &#xD574;&#xCEE4;&#xB97C; &#xC704;&#xD55C; &#xC548;&#xB0B4;&#xC11C; &#xC774;&#xC804; &#xAE00;</h2><ol>
<li><a href="https://hackyboiz.github.io/2021/01/24/fabu1ous/ttd-1/">Part1</a></li>
<li><a href="https://hackyboiz.github.io/2021/02/21/fabu1ous/ttd-2/">Part2</a></li>
</ol>
<h1 id="Time-Travel-Debugging-objects"><a href="#Time-Travel-Debugging-objects" class="headerlink" title="Time Travel Debugging objects"></a>Time Travel Debugging objects</h1><p>&#xC774;&#xBC88; Part 3&#xC5D0;&#xC120; TTD data model object&#xC640; Trace File&#xB85C;&#xBD80;&#xD130; TTD data model object&#xB97C; Query &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCFC; &#xAC81;&#xB2C8;&#xB2E4;. TTD Trace File &#xC0AC;&#xC6A9; &#xC2DC; &#xC790;&#xB3D9;&#xC73C;&#xB85C; Process Object&#xC640; Session Object&#xC5D0; &#xB370;&#xC774;&#xD130;&#xAC00; &#xB85C;&#xB4DC;&#xB418;&#xBA70; <code>dx</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xADF8; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="dx-&#xBA85;&#xB839;&#xC5B4;"><a href="#dx-&#xBA85;&#xB839;&#xC5B4;" class="headerlink" title="dx &#xBA85;&#xB839;&#xC5B4;"></a>dx &#xBA85;&#xB839;&#xC5B4;</h1><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">000</span>&gt; dx Debugger</code></pre>
<p><img src="/2021/03/14/fabu1ous/ttd-3/3.png" srcset="/img/loading.gif" alt></p>
<p><code>dx</code>&#xB294; Debugger Object Model Expression&#xC744; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xB294; &#xBA85;&#xB839;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xB2A5; &#xC704;&#xC8FC;&#xB85C;(&#xB531; &#xC774; &#xAE00;&#xC744; &#xC77D;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xAC83;&#xB4E4;&#xB9CC;) &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>dx</code> &#xBA85;&#xB839;&#xC5B4;&#xC5D0; &#xB300;&#xD574; &#xCD94;&#xAC00;&#xB85C; &#xB354; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xC2F6;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; <a href="[](">ms docs dx</a>)&#xB97C; &#xC77D;&#xC5B4;&#xBCF4;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120; <code>dx</code> &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;. &#xC774;&#xBC88; Part 3&#xC5D0;&#xC11C; &#xC55E;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB4E4;&#xC740; <code>-g</code>&#xC640; <code>-r#</code>&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>-g</p>
<p>&#xB370;&#xC774;&#xD130;&#xB97C; &#xADF8;&#xB9AC;&#xB4DC;&#xB85C; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xB294; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; Heap Object&#xB098; Module Object &#xB4F1;&#xC744; &#xD655;&#xC778;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>-r#</p>
<p>&#xCD5C;&#xB300; <code>#</code> &#xB808;&#xBCA8;&#xAE4C;&#xC9C0; &#xD558;&#xC704; &#xD544;&#xB4DC;&#xB97C; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xB294; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xC0DD;&#xB7B5;&#xD558;&#xBA74; <code>-r1</code>&#xC774; &#xAE30;&#xBCF8;&#xAC12;&#xC73C;&#xB85C; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<h2 id="&#xC0AC;&#xC6A9;-&#xC608;&#xC2DC;"><a href="#&#xC0AC;&#xC6A9;-&#xC608;&#xC2DC;" class="headerlink" title="&#xC0AC;&#xC6A9; &#xC608;&#xC2DC;"></a>&#xC0AC;&#xC6A9; &#xC608;&#xC2DC;</h2><ul>
<li>call stack &#xCD9C;&#xB825;</li>
</ul>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">000</span>&gt; dx -r1 Debugger.Sessions.First().Processes.First().Threads.First().Stack.Frames</code></pre>
<p><img src="/2021/03/14/fabu1ous/ttd-3/4.png" srcset="/img/loading.gif" alt></p>
<p>dx&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xB514;&#xBC84;&#xAE45; &#xC138;&#xC158;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xC4F0;&#xB808;&#xB4DC;&#xC758; call stack&#xC744; <code>-r1</code>&#xC758; &#xC7AC;&#xADC0; &#xB808;&#xBCA8;&#xB85C; &#xCD9C;&#xB825;&#xD55C; &#xBAA8;&#xC2B5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xB85C;&#xB4DC;&#xB41C; &#xBAA8;&#xB4C8; &#xB9AC;&#xC2A4;&#xD2B8; &#xCD9C;&#xB825;</li>
</ul>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">000</span> &gt; dx -g @$curprocess.Modules</code></pre>
<p><img src="/2021/03/14/fabu1ous/ttd-3/5.png" srcset="/img/loading.gif" alt></p>
<p>Trace &#xC804;&#xCCB4;&#xC5D0;&#xC11C; &#xB85C;&#xB4DC;&#xD558;&#xB294; Module&#xB4E4;&#xC744; grid &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xCD9C;&#xB825;&#xD55C; &#xBAA8;&#xC2B5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="Process-Object"><a href="#Process-Object" class="headerlink" title="Process Object"></a>Process Object</h1><p><img src="/2021/03/14/fabu1ous/ttd-3/6.png" srcset="/img/loading.gif" alt></p>
<p>dx &#xBA85;&#xB839;&#xC5B4;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD24;&#xC73C;&#xB2C8; &#xC774;&#xC81C; &#xBCF8;&#xACA9; &#xC801;&#xC73C;&#xB85C; TTD data model object&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;. &#xAE00; &#xCD08;&#xBC18; &#xBD80;&#xC5D0; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; TTD&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; Process object&#xC640; Session object&#xC5D0; &#xB370;&#xC774;&#xD130; &#xBAA8;&#xB378;&#xB4E4;&#xC774; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;&#xACE0; &#xD588;&#xC5C8;&#xC8E0;? &#xADF8;&#xC911; Process Object&#xC785;&#xB2C8;&#xB2E4;.  <code>@$curprocess.TTD</code> namespace&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>Lifetime</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/7.png" srcset="/img/loading.gif" alt></p>
<p>TTD range object&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC804;&#xCCB4; Trace File&#xC758; &#xBC94;&#xC704;&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. MinPosition&#xC740; Trace File&#xC758; &#xC2DC;&#xC791; &#xC2DC;&#xC810;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; TTD Position&#xC744;, MaxPosition&#xC740; Trace File&#xC758; &#xC885;&#xB8CC; &#xC2DC;&#xC810;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; TTD Position&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>Threads</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/8.png" srcset="/img/loading.gif" alt></p>
<p>TTD thread object&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC804;&#xCCB4; Trace File&#xC758; Lifetime&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xC4F0;&#xB808;&#xB4DC;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>Events</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/9.png" srcset="/img/loading.gif" alt></p>
<p>TTD event object&#xB4E4;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD9C;&#xB825; &#xC2DC; Trace File &#xC804;&#xCCB4;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xC5EC;&#xB7EC; &#xC774;&#xBCA4;&#xD2B8;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; Module&#xC758; &#xB85C;&#xB4DC; &#xC2DC;&#xC810;&#xC774;&#xB77C;&#xB358;&#xAC00; Exception &#xBC1C;&#xC0DD; &#xC2DC;&#xC810;&#xC774;&#xB77C;&#xB358;&#xAC00;. Part 2&#xC5D0;&#xC120; &#xC774; Event object&#xB97C; &#xC0AC;&#xC6A9;&#xD574; Exception &#xC704;&#xCE58;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0;, &#xB514;&#xBC84;&#xAE45;&#xC758; &#xC2DC;&#xC791; &#xC704;&#xCE58;&#xB97C; &#xC815;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD588;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<h1 id="Session-Object"><a href="#Session-Object" class="headerlink" title="Session Object"></a>Session Object</h1><p><img src="/2021/03/14/fabu1ous/ttd-3/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBC88;&#xC5D4; Session Object&#xC785;&#xB2C8;&#xB2E4;. <code>@$cursession.TTD</code> namespace&#xB97C; &#xD1B5;&#xD574; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>Data.Heap()</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/11.png" srcset="/img/loading.gif" alt></p>
<p>Trace File &#xC804;&#xCCB4;&#xC5D0;&#xC11C; &#xD560;&#xB2F9;&#xB41C; Heap object&#xB4E4;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>Data.Heap()</code> &#xBA54;&#xC18C;&#xB4DC;&#xC640; grid &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xCD9C;&#xB825;&#xD574;&#xC904; &#xC8FC;&#xC18C;, &#xC0AC;&#xC774;&#xC988;, &#xD560;&#xB2F9; &#xC2DC;&#xC810;, &#xD574;&#xC81C; &#xC2DC;&#xC810;&#xC744; &#xD55C;&#xB208;&#xC5D0; &#xBCFC; &#xC218; &#xC788;&#xC5B4; &#xB418;&#xAC8C; &#xD3B8;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC;&#xC5D0; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xD558;&#xBA74;&#xC11C; &#xD799; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xB85C; &#xC758;&#xC2EC;&#xB418;&#xB294; &#xBC84;&#xADF8;&#xB97C; &#xBD84;&#xC11D; &#xC911;&#xC778;&#xB370; &#xC774; <code>Data.Heap()</code> object&#xB97C; &#xC815;&#xB9D0; &#xC720;&#xC6A9;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>Calls()</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xD2B9;&#xC815; &#xD568;&#xC218;&#xC758; &#xD638;&#xCD9C;&#xC5D0; &#xB300;&#xD55C; &#xC5EC;&#xB7EC; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294; calls object&#xC785;&#xB2C8;&#xB2E4;. <code>Calls()</code> &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xD638;&#xCD9C; &#xD69F;&#xC218;, &#xD638;&#xCD9C; &#xC2DC;&#xC810;, &#xB9AC;&#xD134; &#xC2DC;&#xC810;, &#xB9AC;&#xD134; &#xAC12; &#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. breakpoint&#xC758; &#xC0C1;&#xC704; &#xD638;&#xD658;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xACE0; &#xC788;&#xB2E4;&#xBA74; Calls query&#xB97C; TimeStart&#xAC12;&#xC73C;&#xB85C; &#xC815;&#xB82C;&#xD55C; &#xD6C4; &#xB9E8; &#xB9C8;&#xC9C0;&#xB9C9; &#xB370;&#xC774;&#xD130; &#xD639;&#xC740; crash &#xBC1C;&#xC0DD; &#xC2DC;&#xC810;&#xACFC; &#xAC00;&#xC7A5; &#xAC00;&#xAE4C;&#xC6B4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC120;&#xD0DD;&#xD574; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC815;&#xD655;&#xD55C; &#xC2DC;&#xC810;&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC544;&#xC27D;&#xAC8C;&#xB3C4; Calls() &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xC758; &#xC2EC;&#xBCFC;&#xC774; &#xC0B4;&#xC544; &#xC788;&#xC5B4;&#xC57C; &#xD574;&#xC11C; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>Memory()</p>
<p><img src="/2021/03/14/fabu1ous/ttd-3/13.png" srcset="/img/loading.gif" alt></p>
<p>Memory object&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD2B9;&#xC815; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xBC1C;&#xC0DD;&#xD55C; &#xBAA8;&#xB4E0; &#xC811;&#xADFC;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xC815; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xC5D0; &#xC811;&#xADFC;&#xD55C; &#xC2DC;&#xC810;, &#xC811;&#xADFC; &#xD0C0;&#xC785;, &#xB2F9;&#xC2DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xCE74;&#xC6B4;&#xD130;&#xC758; &#xC0C1;&#xD669; &#xB4F1;&#xC744; &#xD568;&#xAED8; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. ba &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC0C1;&#xC704; &#xD638;&#xD658;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC11C; Part 2&#xC5D0;&#xC11C; EBP&#xAC00; &#xB36E;&#xC5B4; &#xC4F0;&#xC774;&#xB294; &#xC2DC;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574; ba &#xBA85;&#xB839;&#xC5B4; &#xB300;&#xC2E0; &#xC774; Memory object&#xB97C; &#xC0AC;&#xC6A9;&#xD560;&#xAE4C; &#xACE0;&#xBBFC;&#xD588;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. ba&#xC758; &#xACBD;&#xC6B0;&#xC5D4; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; range&#xB97C; &#xCD5C;&#xB300; 8 bytes&#xAE4C;&#xC9C0; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; TTD Memory object query&#xB294; &#xC81C;&#xD55C;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<h1 id="Query"><a href="#Query" class="headerlink" title="Query"></a>Query</h1><p>TTD data object&#xB4E4;&#xC758; &#xC885;&#xB958;&#xC640; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; &#xBA54;&#xC18C;&#xB4DC;&#xB4E4;&#xC758; &#xC885;&#xB958;&#xB97C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xADF8; &#xBA54;&#xC18C;&#xB4DC;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xB9AC;&#xD134; &#xBC1B;&#xC740; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xC815;&#xB82C; &#xBC0F; &#xAC00;&#xACF5;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h2 id="Sorting-Queries"><a href="#Sorting-Queries" class="headerlink" title="Sorting Queries"></a>Sorting Queries</h2><p>OrderBy() &#xD639;&#xC740; OrderByDescending()&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xD2B9;&#xC815; column&#xC744; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC815;&#xB82C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0;&#xC11C; Calls() &#xBA54;&#xC18C;&#xB4DC; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xD558;&#xBA74;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xB358; &#xB0B4;&#xC6A9;&#xC778;&#xB370; crash &#xC2DC;&#xC810;, &#xD639;&#xC740; Trace File&#xC758; &#xC885;&#xB8CC; &#xC2DC;&#xC810;&#xACFC; &#xAC00;&#xC7A5; &#xAC00;&#xAC00;&#xC6B4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xAE30; &#xC704;&#xD574; TimeStart&#xC640; OrderByDescending()&#xC744; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>OrderBy()</li>
</ul>
<pre><code class="hljs c">dx @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>).OrderBy(c =&gt; c.TimeStart)</code></pre>
<p>TimeStart column&#xC73C;&#xB85C; &#xC624;&#xB984; &#xCC28;&#xC21C; &#xC815;&#xB82C;&#xC744; &#xD558;&#xB294; &#xC608;&#xC81C; query&#xC785;&#xB2C8;&#xB2E4;. (&#xC0AC;&#xC2E4; TimeStart&#xB85C; &#xC624;&#xB984; &#xCC28;&#xC21C; &#xC815;&#xB82C;&#xD558;&#xB294; &#xAC74; &#xC758;&#xBBF8;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBBF8; &#xC815;&#xB82C; &#xB418;&#xC5B4; &#xC788;&#xAC70;&#xB4E0;&#xC694;.)</p>
<ul>
<li>OrderByDescending()</li>
</ul>
<pre><code class="hljs c">dx -r2 @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>).OrderByDescending(c =&gt; c.TimeStart)</code></pre>
<p>TimeStart column&#xC73C;&#xB85C; &#xB0B4;&#xB9BC; &#xCC28;&#xC21C; &#xC815;&#xB82C;&#xC744; &#xD558;&#xB294; &#xC608;&#xC81C; query&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="Specifying-elements-in-query"><a href="#Specifying-elements-in-query" class="headerlink" title="Specifying elements in query"></a>Specifying elements in query</h2><p>query&#xC5D0; append &#xB41C; element&#xB97C; &#xD2B9;&#xC815;&#xC9C0;&#xC5B4;&#xC11C; &#xCD9C;&#xB825;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. First() &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xCCAB; &#xBC88;&#xC9F8; element&#xB97C; &#xD2B9;&#xC815; &#xC9D6;&#xAC70;&#xB098; &#xB300;&#xAD04;&#xD638;&#xC640; index number&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC6D0;&#xD558;&#xB294; element&#xB97C; &#xD2B9;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">dx @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>).First()
dx @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>)[<span class="hljs-number">0x0</span>]</code></pre>
<h2 id="Filtering-in-a-query"><a href="#Filtering-in-a-query" class="headerlink" title="Filtering in a query"></a>Filtering in a query</h2><p>SQL&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xAC8C; Where() &#xD639;&#xC740; Select()&#xB97C; &#xC0AC;&#xC6A9;&#xD574; query&#xB97C; &#xD544;&#xD130;&#xB9C1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; &#xC608;&#xC81C;&#xB294; <code>kernelbase!GetLastError</code>&#xC758; &#xD638;&#xCD9C;&#xC911; &#xB9AC;&#xD134; &#xAC12;&#xC774; 0&#xC774; &#xC544;&#xB2CC; &#xB370;&#xC774;&#xD130;&#xC758; TimeStart&#xAC12;&#xACFC; ReturnValue&#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xB3C4;&#xB85D; &#xD544;&#xD130;&#xB9C1;&#xB41C; query&#xC785;&#xB2C8;&#xB2E4;. Select() &#xBA54;&#xC18C;&#xB4DC;&#xB294; &#xAC01; column&#xC758; display name&#xC744; &#xC9C0;&#xC815;&#xD574; &#xC904; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xB54C; string &#xAD00;&#xB828; &#xD568;&#xC218;&#xC758; size &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC640; &#xB9AC;&#xD134; &#xAC12;&#xC774; &#xB2E4;&#xB978; &#xD638;&#xCD9C;&#xB9CC; &#xACE8;&#xB77C; &#xBCFC; &#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">dx -r2 @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>).Where(c =&gt; c.ReturnValue != <span class="hljs-number">0</span>).Select(c =&gt; <span class="hljs-keyword">new</span> { Time = c.TimeStart, Error = c.ReturnValue })</code></pre>
<h2 id="Assigning-query-to-a-variable"><a href="#Assigning-query-to-a-variable" class="headerlink" title="Assigning query to a variable"></a>Assigning query to a variable</h2><p>&#xD2B9;&#xC815; query&#xB97C; &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xD55C; &#xD6C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC11C; &#xAE34; query&#xB97C; &#xB9E4;&#xBC88; &#xC785;&#xB825;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">dx -r2 @$myResults = @$cursession.TTD.Calls(<span class="hljs-string">&quot;kernelbase!GetLastError&quot;</span>).Where(c =&gt; c.ReturnValue != <span class="hljs-number">0</span>).Select(c =&gt; <span class="hljs-keyword">new</span> { Time = c.TimeStart, Error = c.ReturnValue })</code></pre>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p><img src="/2021/03/14/fabu1ous/ttd-3/14.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xAC78;&#xB85C; &#x201C;&#xC2DC;&#xAC04;&#xC744; &#xC5EC;&#xD589;&#xD558;&#xB294; &#xD574;&#xCEE4;&#xB97C; &#xC704;&#xD55C; &#xC548;&#xB0B4;&#xC11C;&#x201D; &#xC2DC;&#xB9AC;&#xC988;&#xAC00; &#xB05D;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88;&#xC5D0; TTD&#xB85C; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; &#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080; &#xAC74;&#xB370; TTD &#xC5C6;&#xC73C;&#xBA74; &#xB354; &#xC774;&#xC0C1; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xBABB;&#xD558;&#xB294; &#xBAB8;&#xC774; &#xB3FC;&#xBC84;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC791;&#xB144;&#xC5D4; TTD &#xC5C6;&#xC774; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD55C; &#xAC70;&#xC9C0;? &#xC624;&#xD788;&#xB824; &#xADF8;&#xB54C; &#xB354; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC798;&#xD588;&#xB358; &#xAC70; &#xAC19;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#x314E;&#x314E;;; &#xC544;&#xBB34;&#xD2BC; &#xADF8;&#xB9CC;&#xD07C; TTD&#xAC00; &#xC88B;&#xB2E4;!&#xB77C;&#xACE0; &#xACB0;&#xB860; &#xC9D3;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC820; &#xC9C4;&#xC9DC; &#xC775;&#xC2A4; &#xD558;&#xB7EC; &#xAC00;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/windbg/">windbg</a>
                  
                  <a class="hover-with-bg" href="/tags/time-travel-debugging/">time travel debugging</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/03/15/idioth/2021-03-15/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-27927: Zabbix에서 발견된 CSRF를 통한 RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/13/fabu1ous/2021-03-13/">
                    <span class="hidden-mobile">[하루한줄] z0Miner: Mining Botnet Spreading quickly</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/14/fabu1ous/ttd-3/';
        this.page.identifier = '/2021/03/14/fabu1ous/ttd-3/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] 시간을 여행하는 해커를 위한 안내서 Part3&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
