

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; Windows Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB3D9;&amp;#xC548; IPC&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB2E4;~ &amp;#x2190; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB450;&amp;#xB8E8;&amp;#xBB49;&amp;#xC220;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xC5EC;&amp;#xB7EC; IPC &amp;#xC911; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xD241;x9 &amp;#xC0AC;&amp;#xD6C4;&amp;#xB8E8;&amp;#xAC00; &amp;#xB4E4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC74; Pipe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/1.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Windows-IPC&#34;&gt;&lt;a href=&#34;#Windows-IPC&#34; class=&#34;headerlink&#34; title=&#34;Windows IPC&#34;&gt;&lt;/a&gt;Windows IPC&lt;/h2&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; IPC(Inter Process Communication)&amp;#xB780;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; IPC &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;(Shared Memory)&lt;/li&gt;
&lt;li&gt;Mail Slot&lt;/li&gt;
&lt;li&gt;COM(Component Object Model)&lt;/li&gt;
&lt;li&gt;Pipe&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4; &amp;#xAC04;&amp;#xC5D0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC65C;? &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xB07C;&amp;#xB9AC; &amp;#xC11C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB97C; &lt;strong&gt;&amp;#xB3C5;&amp;#xB9BD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(Independent Process)&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAC12;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC11C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &amp;#xC774;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC774; &amp;#xC6F9; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB54C;, &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xC9C4;&amp;#xD589; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4; &amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791; &amp;#xC911; &amp;#xC77C; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#x201C;&lt;strong&gt;&amp;#xC9C0;&amp;#xAE08; 70% &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD588;&amp;#xC5B4;!&lt;/strong&gt;&amp;#x201D;&amp;#xAC19;&amp;#xC740; &amp;#xC9C4;&amp;#xD589; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD654;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589; &amp;#xBC14;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB610; &amp;#xD654;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#x201C;&lt;strong&gt;&amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC815;&amp;#xC9C0; &amp;#xBC84;&amp;#xD2BC; &amp;#xB20C;&amp;#xB800;&amp;#xC5B4;!&lt;/strong&gt;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA74; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xBA48;&amp;#xCD94;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC608;&amp;#xC2DC;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAC12;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &lt;strong&gt;&amp;#xD611;&amp;#xB825; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(Co-operating Process)&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC790;&amp;#xC6D0; &amp;#xACF5;&amp;#xC720;&amp;#xB85C; &amp;#xC791;&amp;#xC5C5; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9C0;&amp;#xACE0;, &amp;#xBCD1;&amp;#xB82C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xBA70;, &amp;#xB370;&amp;#xC774;&amp;#xD130; Read/Write &amp;#xC2DC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCCA0;&amp;#xC800;&amp;#xD55C; &amp;#xC124;&amp;#xACC4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Windows-IPC-Pipe&#34;&gt;&lt;a href=&#34;#Windows-IPC-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Windows IPC Pipe&#34;&gt;&lt;/a&gt;Windows IPC Pipe&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; IPC&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#xC65C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows IPC &amp;#xAE30;&amp;#xBC95; &amp;#xC911; Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Pipe&amp;#xB294; Anonymous Pipe&amp;#xC640; Named Pipe &amp;#xB450; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xB984; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC640; &amp;#xC774;&amp;#xB984; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC778;&amp;#xB370;&amp;#x2026; &amp;#xC804;&amp;#xD600; &amp;#xAC10;&amp;#xC774; &amp;#xC548; &amp;#xC624;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xB73B;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB984; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC640; &amp;#xC774;&amp;#xB984;&amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB098; &amp;#xC6D0;&amp;#xACA9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xAE30;&amp;#xC694;? Pipe&amp;#xB294; IPC &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xB2C8; &amp;#xC774;&amp;#xAC8C; &amp;#xB9D0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xAE4C;..? &amp;#x2190; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xB4A4; Anonymous Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xD480;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB9D0;&amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;? &amp;#xB85C;&amp;#xCEEC; Pipe&amp;#xC640; &amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC5D0; &amp;#xACBD;&amp;#xC6B0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; PC&amp;#xB97C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;strong&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&lt;/strong&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xC790;&amp;#xBA74; Named Pipe&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD1B5;&amp;#xC2E0; &amp;#xBC94;&amp;#xC704;(&amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC;)&amp;#xC5D0; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, Anonymous Pipe&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Anonymous-Pipe&#34;&gt;&lt;a href=&#34;#Anonymous-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Anonymous Pipe&#34;&gt;&lt;/a&gt;Anonymous Pipe&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Anonymous Pipe&amp;#xB294; &lt;strong&gt;&amp;#xB2E8;&amp;#xBC29;&amp;#xD5A5;&lt;/strong&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xB744;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &lt;code&gt;CreatePipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xBA74; &amp;#xB2E8;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAC01;&amp;#xC790; &amp;#xC791;&amp;#xC5C5;(Read/Write)&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(hReadPipe, hWritePipe)&amp;#xC744; &amp;#xAC01;&amp;#xAC01; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CreatePipe&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]          PHANDLE               hReadPipe,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]          PHANDLE               hWritePipe,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPSECURITY_ATTRIBUTES lpPipeAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 nSize&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;! &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Anonymous Pipe&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#x201C;&lt;strong&gt;&amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAC01;&amp;#xC790; &amp;#xC791;&amp;#xC5C5;(Read/Write)&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(hReadPipe, hWritePipe)&amp;#xC744; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&amp;#x201D;&amp;#xAC00; &amp;#xBB34;&amp;#xC2A8; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026;? &amp;#xACB0;&amp;#xB860;&amp;#xBD80;&amp;#xD130; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9AC;&amp;#xBA74; Anonymous Pipe&amp;#xB294; &lt;strong&gt;&amp;#xBD80;&amp;#xBAA8;-&amp;#xC790;&amp;#xC2DD; &amp;#xAD00;&amp;#xACC4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CreateProcess&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPCSTR                lpApplicationName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out, optional] LPSTR                 lpCommandLine,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPSECURITY_ATTRIBUTES lpProcessAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPSECURITY_ATTRIBUTES lpThreadAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                BOOL                  bInheritHandles,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                DWORD                 dwCreationFlags,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPVOID                lpEnvironment,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPCSTR                lpCurrentDirectory,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                LPSTARTUPINFOA        lpStartupInfo,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]               LPPROCESS_INFORMATION lpProcessInformation&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBD80;&amp;#xBAA8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreatePipe&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;CreateProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218; bInheritHandles &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; True&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xBD80;&amp;#xBAA8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C1;&amp;#xC18D;&amp;#xBC1B;&amp;#xC544; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Anonymous Pipe&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xC591;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;Anonymous Pipe&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; Pipe&amp;#xC5D0; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xC0C1;&amp;#xC18D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; Anonymous Pipe&amp;#xB294; &amp;#xBD80;&amp;#xBAA8;-&amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Named-Pipe&#34;&gt;&lt;a href=&#34;#Named-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Named Pipe&#34;&gt;&lt;/a&gt;Named Pipe&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Named Pipe&amp;#xB294; &lt;strong&gt;&amp;#xC591;&amp;#xBC29;&amp;#xD5A5;&lt;/strong&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xB744;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xCABD;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; Pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xCABD;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xBA70; Named Pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70; &amp;#xC774;&amp;#xD574;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xAC19;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;hPipe = HANDLE CreateNamedPipe(
  [in]           LPCSTR                lpName,
  [in]           DWORD                 dwOpenMode,
  [in]           DWORD                 dwPipeMode,
  [in]           DWORD                 nMaxInstances,
  [in]           DWORD                 nOutBufferSize,
  [in]           DWORD                 nInBufferSize,
  [in]           DWORD                 nDefaultTimeOut,
  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes
);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC591;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xD55C; &amp;#xAC1C;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;strong&gt;lpName&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; Pipe&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC774;&amp;#xACE0;, &lt;strong&gt;dwOpenMode&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Half-Duplex (&amp;#xC11C;&amp;#xBC84; &amp;#x2192; &amp;#xD074;&amp;#xB77C;&amp;#xC778;&amp;#xD2B8;, &amp;#xC11C;&amp;#xBC84; &amp;#x2190; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;)&amp;#xB85C;&amp;#xB3C4; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;nMaxInstances&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; Pipe &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4; &amp;#xAC1C;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC774; 3&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAC19;&amp;#xC740; &amp;#xC774;&amp;#xB984;&amp;#xC758; Pipe&amp;#xAC00; 3&amp;#xAC1C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCD1D; 3&amp;#xBA85;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;PipeList&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB0B4;&amp;#xC5D0; Named Pipe&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, Max Instances &amp;#xAC12;&amp;#xC774; 1&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; Pipe&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC62C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD558;&amp;#xB098;&amp;#xC758; Pipe&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xACE0; &amp;#xB0A8;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB300;&amp;#xAE30;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &lt;strong&gt;nDefaultTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;ConnectNamedPipe(hPipe, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &lt;code&gt;ConnectNamedPipe&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &lt;strong&gt;&amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB2E4;&amp;#xB978;  &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC5F0;&amp;#xACB0; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Pipe&amp;#xB97C; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;HANDLE &lt;span class=&#34;hljs-title&#34;&gt;CreateFile&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           LPCSTR                lpFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwDesiredAccess,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwShareMode,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwCreationDisposition,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwFlagsAndAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] HANDLE                hTemplateFile&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;lpFileName&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xC11C;&amp;#xBC84; Named Pipe &amp;#xB123;&amp;#xACE0; &lt;code&gt;CreateFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; Named Pipe&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; Anonymous Pipe&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;WaitNamedPipe&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCSTR lpNamedPipeName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] DWORD  nTimeOut&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC11C;&amp;#xBC84; Pipe &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC804;&amp;#xBD80; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &lt;code&gt;WaitNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;nTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xB9CC;&amp;#xD07C; &amp;#xB300;&amp;#xAE30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &lt;strong&gt;nTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xAC00; default &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218; &lt;strong&gt;nDefaultTimeOut&lt;/strong&gt; &amp;#xAC12;&amp;#xB9CC;&amp;#xD07C; &amp;#xB300;&amp;#xAE30;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; Anonymous Pipe&amp;#xC640; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01; Pipe&amp;#xC758; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;&amp;#xC368; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xC544;&amp;#xC154;&amp;#xB3C4; Windows Pipe &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Windows-Named-pipe&#34;&gt;&lt;a href=&#34;#Windows-Named-pipe&#34; class=&#34;headerlink&#34; title=&#34;Windows Named pipe&#34;&gt;&lt;/a&gt;Windows Named pipe&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;CreatePipe&lt;/code&gt;&amp;#xB098; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA70;, &amp;#xC77C;&amp;#xC885;&amp;#xC758; &lt;strong&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&lt;/strong&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; File Object&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; Pipe&amp;#xAC00; File Object&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Named Pipe&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Pipe &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Pipe &amp;#xC774;&amp;#xB984; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;\\&amp;#xC11C;&amp;#xBC84;&amp;#xC774;&amp;#xB984;\pipe\&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC774;&amp;#xB984;&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xCE21;: &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBCF8;&amp;#xC778; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC11C;&amp;#xBC84; &amp;#xC774;&amp;#xB984;&amp;#xC5D0; .(dot)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC774;&amp;#xB984;(&lt;code&gt;ogu123&lt;/code&gt;)&amp;#xC744; &amp;#xB123;&amp;#xACE0; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218; lpName &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;: &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt; or &lt;code&gt;\\ComputerName\pipe\ogu123&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; Pipe&amp;#xAC00; &amp;#xB85C;&amp;#xCEEC; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; Pipe&amp;#xAC00; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; &lt;code&gt;\\ComputerName\pipe\ogu123&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; Pipe &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; Pipe &amp;#xC774;&amp;#xB984; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;ogu123&lt;/code&gt; Pipe&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB290; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;NamedPipeServer.exe&amp;#xB294; &lt;code&gt;ogu123&lt;/code&gt; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Process Explorer&amp;#xB85C; NamedPipeServer.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;ogu123&lt;/code&gt; &amp;#xC774;&amp;#xB984;&amp;#xC758; Named Pipe &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;&amp;#xB294;&lt;code&gt;\Device\NamedPipe\ogu123&lt;/code&gt;&amp;#xC5D0; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; WinObj&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;\\.\pipe&lt;/code&gt;&amp;#xAC00; &lt;code&gt;\Device\NamedPipe&lt;/code&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xB9C1;&amp;#xD06C;&amp;#xAC00; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;\Device\NamedPipe\ogu123&lt;/code&gt; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Named-pipe-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Named-pipe-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Named pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Named pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; Process Explorer, accesschk, IDA &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; Client Impersonation &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &lt;a href=&#34;https://github.com/VerSprite/research/tree/master/projects/cpp/VulnerableApps/WindowsPipes&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0B4;&amp;#xC9DD; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Process Explorer&amp;#xC5D0;&amp;#xC11C; &amp;#xD578;&amp;#xB4E4; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD578;&amp;#xB4E4; &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(NamedPipeServer.exe)&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; ogu123 Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; accesschk&amp;#xC758; &lt;code&gt;accesschk.exe \pipe\&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; \.\pipe\ &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Named Pipe&amp;#xC758; DACL&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; ogu123 Pipe&amp;#xB294; Everyone &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; RW &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; Named Pipe&amp;#xC5D0; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; Read/write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21; Named Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; LPE&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21; Named Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;(&lt;code&gt;CreateNamedPipeW()&lt;/code&gt;&amp;#xD3EC;&amp;#xD568;)&amp;#xC744; IDA Imports&amp;#xB098; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xAC80;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateNamedPipeW&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ogu123 Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; read &amp;#xD558;&amp;#xACE0; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD55C; &amp;#xBCA1;&amp;#xD130;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC8E0;? &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h3 id=&#34;Client-Impersonation-&amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Client-Impersonation-&amp;#xAE30;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Client Impersonation &amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Client Impersonation &amp;#xAE30;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;Client Impersonation &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4; LPE&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; Impersonation&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB294; Access Token&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Access Token&amp;#xC5D0; &amp;#x201C;&lt;strong&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xB0B4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB514;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#x201D; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; Impersonation Level&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;Impersonation Level&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityAnonymous&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xC744; &amp;#xC54C; &amp;#xC218;&amp;#xB3C4;, Impersonation &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityIdentification&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xACFC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218;&amp;#xB9CC; &amp;#xC788;&amp;#xACE0;, Impersonation&amp;#xC740; &amp;#xBABB; &amp;#xD568;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityImpersonation&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB85C;&amp;#xCEEC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; Impersonation &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityDelegation&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC6D0;&amp;#xACA9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xCC98;&amp;#xB7FC; Impersonation &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Access Token&amp;#xC740; Primary Token&amp;#xC640; Impersonation Token &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; Access Token&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC774;&amp;#xB54C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; Primary Token&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBCC0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; Primary Token&amp;#xC640; Impersonation Token &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, Primary Token&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; Primary Token &amp;#xAC12;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0; Primary Token &amp;#xB300;&amp;#xC2E0; &amp;#xB2E4;&amp;#xB978; &amp;#xACC4;&amp;#xC815;&amp;#xC758; Access Token&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD1A0;&amp;#xD070;&amp;#xC774; Impersonation Token&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC989; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; Primary Token&amp;#xC744; &amp;#xD56D;&amp;#xC0C1; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0; Impersonation &amp;#xC911;&amp;#xC77C; &amp;#xB54C;&amp;#xB9CC; Impersonation Token &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;CreateFile(
    &lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;&amp;#xB85C;&amp;#xCEEC; Pipe &amp;#xACBD;&amp;#xB85C; or &amp;#xC6D0;&amp;#xACA9; Pipe &amp;#xACBD;&amp;#xB85C;&amp;quot;&lt;/span&gt;,
    GENERIC_READ | GENERIC_WRITE,
    &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
    OPEN_EXISTING,
    SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION, &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB610;&amp;#xB294; SECURITY_DELEGATION&lt;/span&gt;
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;
);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Client Impersonation&amp;#xC73C;&amp;#xB85C; LPE &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB098; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;CreateFile()&lt;/code&gt;&amp;#xB97C; &amp;#xD560; &amp;#xB54C;, &amp;#xC77C;&amp;#xBC18; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; Named Pipe&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB54C; &lt;code&gt;CreateFile()&lt;/code&gt; &amp;#xD568;&amp;#xC218; 6&amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC774; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION or SECURITY_DELEGATION &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; SECURITY_SQOS_PRESENT &amp;#xAC12;&amp;#xB9CC; &amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; SECURITY_IMPERSONATION&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// Create a server named pipe&lt;/span&gt;
serverPipe = CreateNamedPipe(
    pipeName,           &lt;span class=&#34;hljs-comment&#34;&gt;// name of our pipe, must be in the form of \\.\pipe\&amp;lt;NAME&amp;gt;&lt;/span&gt;
    PIPE_ACCESS_DUPLEX, &lt;span class=&#34;hljs-comment&#34;&gt;// The rest of the parameters don&amp;apos;t really matter&lt;/span&gt;
    PIPE_TYPE_MESSAGE,	&lt;span class=&#34;hljs-comment&#34;&gt;// as all you want is impersonate the client...&lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;,		&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt;,	&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt;,	&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,		&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;	&lt;span class=&#34;hljs-comment&#34;&gt;// This should ne NULL so every client can connect&lt;/span&gt;
);
&lt;span class=&#34;hljs-comment&#34;&gt;// wait for pipe connections&lt;/span&gt;
BOOL bPipeConnected = ConnectNamedPipe(serverPipe, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// Impersonate client&lt;/span&gt;
BOOL bImpersonated = ImpersonateNamedPipeClient(serverPipe);
&lt;span class=&#34;hljs-comment&#34;&gt;// if successful open Thread token - your current thread token is now the client&amp;apos;s token&lt;/span&gt;
BOOL bSuccess = OpenThreadToken(GetCurrentThread(), TOKEN_ALL_ACCESS, FALSE, &amp;amp;hToken);
&lt;span class=&#34;hljs-comment&#34;&gt;// now you got the client token saved in hToken and you can safeyl revert back to self&lt;/span&gt;
bSuccess = RevertToSelf();
&lt;span class=&#34;hljs-comment&#34;&gt;// Now duplicate the client&amp;apos;s token to get a Primary token&lt;/span&gt;
bSuccess = DuplicateTokenEx(hToken,
    TOKEN_ALL_ACCESS,
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
    SecurityImpersonation,
    TokenPrimary,
    &amp;amp;hDuppedToken
);
&lt;span class=&#34;hljs-comment&#34;&gt;// If that succeeds you got a Primary token as hDuppedToken and you can create a proccess with that token&lt;/span&gt;
CreateProcessWithTokenW(hDuppedToken, LOGON_WITH_PROFILE, command, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, CREATE_NEW_CONSOLE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;si, &amp;amp;pi);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; Named Pipe &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; LPE&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;ImpersonateNamedPipeClient()&lt;/code&gt; : &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; Impersonation Token&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; Impersonation Token&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; Primary Token&amp;#xC744; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;RevertToSelf()&lt;/code&gt; : Impersonation&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;CreateProcessWithTokenW()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC804;&amp;#xC5D0;  &amp;#xC774;&amp;#xB904;&amp;#xC838;&amp;#xC57C; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC548; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;DuplicateTokenEx()&lt;/code&gt; : &amp;#xC55E;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; Impersonation Token&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; Primary Token&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;CreateProcessWithTokenW()&lt;/code&gt; : Primary Token &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2192; LPE &amp;#xBC1C;&amp;#xC0DD;!&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Windows IPC&amp;#xC640; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAE4A;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; Windows Attack Vector&amp;#xB294; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB9CE;&amp;#xAD6C;&amp;#xB098;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;&lt;strong&gt;Reference&lt;/strong&gt;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;&lt;/li&gt;
&lt;li&gt;&amp;#xB1CC;&amp;#xB97C; &amp;#xC790;&amp;#xADF9;&amp;#xD558;&amp;#xB294; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC988; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.baeldung.com/cs/pipes-vs-sockets&#34;&gt;https://www.baeldung.com/cs/pipes-vs-sockets&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.codeproject.com/Articles/13724/Windows-IPC&#34;&gt;https://www.codeproject.com/Articles/13724/Windows-IPC&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://versprite.com/vs-labs/microsoft-windows-pipes-intro/&#34;&gt;https://versprite.com/vs-labs/microsoft-windows-pipes-intro/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://versprite.com/vs-labs/vulnerable-named-pipe-application/&#34;&gt;https://versprite.com/vs-labs/vulnerable-named-pipe-application/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html&#34;&gt;https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Windows Named Pipe (KR) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; Windows Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB3D9;&amp;#xC548; IPC&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB2E4;~ &amp;#x2190; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB450;&amp;#xB8E8;&amp;#xBB49;&amp;#xC220;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE30;&amp;#xD68C;&amp;#xC5D0; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xC5EC;&amp;#xB7EC; IPC &amp;#xC911; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;del&gt;(&amp;#xD241;x9 &amp;#xC0AC;&amp;#xD6C4;&amp;#xB8E8;&amp;#xAC00; &amp;#xB4E4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC74; Pipe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/del&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/1.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Windows-IPC&#34;&gt;&lt;a href=&#34;#Windows-IPC&#34; class=&#34;headerlink&#34; title=&#34;Windows IPC&#34;&gt;&lt;/a&gt;Windows IPC&lt;/h2&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; IPC(Inter Process Communication)&amp;#xB780;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; IPC &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;(Shared Memory)&lt;/li&gt;
&lt;li&gt;Mail Slot&lt;/li&gt;
&lt;li&gt;COM(Component Object Model)&lt;/li&gt;
&lt;li&gt;Pipe&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC800;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4; &amp;#xAC04;&amp;#xC5D0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC65C;? &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC744;&amp;#xAE4C; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xB07C;&amp;#xB9AC; &amp;#xC11C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB97C; &lt;strong&gt;&amp;#xB3C5;&amp;#xB9BD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(Independent Process)&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAC12;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC11C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &amp;#xC774;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC774; &amp;#xC6F9; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB54C;, &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB294; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xC9C4;&amp;#xD589; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xC2E4;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4; &amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791; &amp;#xC911; &amp;#xC77C; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#x201C;&lt;strong&gt;&amp;#xC9C0;&amp;#xAE08; 70% &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD588;&amp;#xC5B4;!&lt;/strong&gt;&amp;#x201D;&amp;#xAC19;&amp;#xC740; &amp;#xC9C4;&amp;#xD589; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD654;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589; &amp;#xBC14;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xB610; &amp;#xD654;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#x201C;&lt;strong&gt;&amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC815;&amp;#xC9C0; &amp;#xBC84;&amp;#xD2BC; &amp;#xB20C;&amp;#xB800;&amp;#xC5B4;!&lt;/strong&gt;&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA74; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xAC00; &amp;#xBA48;&amp;#xCD94;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC608;&amp;#xC2DC;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xC0C1;&amp;#xD0DC; &amp;#xAC12;&amp;#xC774;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &lt;strong&gt;&amp;#xD611;&amp;#xB825; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(Co-operating Process)&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC790;&amp;#xC6D0; &amp;#xACF5;&amp;#xC720;&amp;#xB85C; &amp;#xC791;&amp;#xC5C5; &amp;#xD6A8;&amp;#xC728;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9C0;&amp;#xACE0;, &amp;#xBCD1;&amp;#xB82C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xB3C4;&amp;#xAC00; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xBA70;, &amp;#xB370;&amp;#xC774;&amp;#xD130; Read/Write &amp;#xC2DC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xCCA0;&amp;#xC800;&amp;#xD55C; &amp;#xC124;&amp;#xACC4;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Windows-IPC-Pipe&#34;&gt;&lt;a href=&#34;#Windows-IPC-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Windows IPC Pipe&#34;&gt;&lt;/a&gt;Windows IPC Pipe&lt;/h2&gt;&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; IPC&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#xC65C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; Windows IPC &amp;#xAE30;&amp;#xBC95; &amp;#xC911; Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Pipe&amp;#xB294; Anonymous Pipe&amp;#xC640; Named Pipe &amp;#xB450; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC5ED;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xB984; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC640; &amp;#xC774;&amp;#xB984; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC778;&amp;#xB370;&amp;#x2026; &amp;#xC804;&amp;#xD600; &amp;#xAC10;&amp;#xC774; &amp;#xC548; &amp;#xC624;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xB73B;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xBA3C;&amp;#xC800; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB984; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC640; &amp;#xC774;&amp;#xB984;&amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB098; &amp;#xC6D0;&amp;#xACA9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xAE30;&amp;#xC694;? Pipe&amp;#xB294; IPC &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xB2C8; &amp;#xC774;&amp;#xAC8C; &amp;#xB9D0;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xAE4C;..? &amp;#x2190; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xB4A4; Anonymous Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xD480;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB9D0;&amp;#xD558;&amp;#xB294; &amp;#xAC78;&amp;#xAE4C;&amp;#xC694;? &amp;#xB85C;&amp;#xCEEC; Pipe&amp;#xC640; &amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC5D0; &amp;#xACBD;&amp;#xC6B0; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; PC&amp;#xB97C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;strong&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&lt;/strong&gt;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC18D;&amp;#xC131;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xC790;&amp;#xBA74; Named Pipe&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD1B5;&amp;#xC2E0; &amp;#xBC94;&amp;#xC704;(&amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC;)&amp;#xC5D0; &amp;#xC81C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, Anonymous Pipe&amp;#xB294; &amp;#xBC14;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC5D0;&amp;#xC11C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Anonymous-Pipe&#34;&gt;&lt;a href=&#34;#Anonymous-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Anonymous Pipe&#34;&gt;&lt;/a&gt;Anonymous Pipe&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Anonymous Pipe&amp;#xB294; &lt;strong&gt;&amp;#xB2E8;&amp;#xBC29;&amp;#xD5A5;&lt;/strong&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xB744;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; &lt;code&gt;CreatePipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xBA74; &amp;#xB2E8;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAC01;&amp;#xC790; &amp;#xC791;&amp;#xC5C5;(Read/Write)&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(hReadPipe, hWritePipe)&amp;#xC744; &amp;#xAC01;&amp;#xAC01; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CreatePipe&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]          PHANDLE               hReadPipe,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]          PHANDLE               hWritePipe,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPSECURITY_ATTRIBUTES lpPipeAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 nSize&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;! &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; Anonymous Pipe&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#x201C;&lt;strong&gt;&amp;#xB450; &amp;#xAC1C;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAC01;&amp;#xC790; &amp;#xC791;&amp;#xC5C5;(Read/Write)&amp;#xB97C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD578;&amp;#xB4E4;(hReadPipe, hWritePipe)&amp;#xC744; &amp;#xB9AC;&amp;#xD134;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&amp;#x201D;&amp;#xAC00; &amp;#xBB34;&amp;#xC2A8; &amp;#xB9D0;&amp;#xC785;&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026;? &amp;#xACB0;&amp;#xB860;&amp;#xBD80;&amp;#xD130; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB9AC;&amp;#xBA74; Anonymous Pipe&amp;#xB294; &lt;strong&gt;&amp;#xBD80;&amp;#xBAA8;-&amp;#xC790;&amp;#xC2DD; &amp;#xAD00;&amp;#xACC4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&lt;/strong&gt;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;CreateProcess&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPCSTR                lpApplicationName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out, optional] LPSTR                 lpCommandLine,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPSECURITY_ATTRIBUTES lpProcessAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPSECURITY_ATTRIBUTES lpThreadAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                BOOL                  bInheritHandles,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                DWORD                 dwCreationFlags,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPVOID                lpEnvironment,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional]      LPCSTR                lpCurrentDirectory,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]                LPSTARTUPINFOA        lpStartupInfo,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]               LPPROCESS_INFORMATION lpProcessInformation&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBD80;&amp;#xBAA8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreatePipe&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;CreateProcess&lt;/code&gt; &amp;#xD568;&amp;#xC218; bInheritHandles &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; True&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; &amp;#xBD80;&amp;#xBAA8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0C1;&amp;#xC18D;&amp;#xBC1B;&amp;#xC544; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Anonymous Pipe&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xC591;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xB450; &amp;#xAC1C;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;Anonymous Pipe&amp;#xB97C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; Pipe&amp;#xC5D0; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB2E4;&amp;#xB978; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14; &amp;#xC0C1;&amp;#xC18D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; Anonymous Pipe&amp;#xB294; &amp;#xBD80;&amp;#xBAA8;-&amp;#xC790;&amp;#xC2DD; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Named-Pipe&#34;&gt;&lt;a href=&#34;#Named-Pipe&#34; class=&#34;headerlink&#34; title=&#34;Named Pipe&#34;&gt;&lt;/a&gt;Named Pipe&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Named Pipe&amp;#xB294; &lt;strong&gt;&amp;#xC591;&amp;#xBC29;&amp;#xD5A5;&lt;/strong&gt; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xB744;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xC120; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xCABD;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; Pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xCABD;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB77C;&amp;#xACE0; &amp;#xD558;&amp;#xBA70; Named Pipe&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA70; &amp;#xC774;&amp;#xD574;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xC544;&amp;#xB798; &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xAC19;&amp;#xC774; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC218;&amp;#xC6D4;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;hPipe = HANDLE CreateNamedPipe(
  [in]           LPCSTR                lpName,
  [in]           DWORD                 dwOpenMode,
  [in]           DWORD                 dwPipeMode,
  [in]           DWORD                 nMaxInstances,
  [in]           DWORD                 nOutBufferSize,
  [in]           DWORD                 nInBufferSize,
  [in]           DWORD                 nDefaultTimeOut,
  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes
);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xC591;&amp;#xBC29;&amp;#xD5A5; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xD55C; &amp;#xAC1C;&amp;#xC758; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBC18;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &lt;strong&gt;lpName&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; Pipe&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC774;&amp;#xACE0;, &lt;strong&gt;dwOpenMode&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Half-Duplex (&amp;#xC11C;&amp;#xBC84; &amp;#x2192; &amp;#xD074;&amp;#xB77C;&amp;#xC778;&amp;#xD2B8;, &amp;#xC11C;&amp;#xBC84; &amp;#x2190; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;)&amp;#xB85C;&amp;#xB3C4; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;nMaxInstances&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; Pipe &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4; &amp;#xAC1C;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9CC;&amp;#xC57D; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC774; 3&amp;#xC77C; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAC19;&amp;#xC740; &amp;#xC774;&amp;#xB984;&amp;#xC758; Pipe&amp;#xAC00; 3&amp;#xAC1C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xCD1D; 3&amp;#xBA85;&amp;#xC758; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;PipeList&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB0B4;&amp;#xC5D0; Named Pipe&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, Max Instances &amp;#xAC12;&amp;#xC774; 1&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB41C; Pipe&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC62C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD558;&amp;#xB098;&amp;#xC758; Pipe&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xACE0; &amp;#xB0A8;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB300;&amp;#xAE30;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &lt;strong&gt;nDefaultTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;ConnectNamedPipe(hPipe, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &lt;code&gt;ConnectNamedPipe&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &lt;strong&gt;&amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xB2E4;&amp;#xB978;  &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC5F0;&amp;#xACB0; &amp;#xB300;&amp;#xAE30; &amp;#xC0C1;&amp;#xD0DC;&lt;/strong&gt;&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Pipe&amp;#xB97C; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;HANDLE &lt;span class=&#34;hljs-title&#34;&gt;CreateFile&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           LPCSTR                lpFileName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwDesiredAccess,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwShareMode,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwCreationDisposition,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           DWORD                 dwFlagsAndAttributes,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] HANDLE                hTemplateFile&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;lpFileName&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xC11C;&amp;#xBC84; Named Pipe &amp;#xB123;&amp;#xACE0; &lt;code&gt;CreateFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; Named Pipe&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; Anonymous Pipe&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;BOOL &lt;span class=&#34;hljs-title&#34;&gt;WaitNamedPipe&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] LPCSTR lpNamedPipeName,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in] DWORD  nTimeOut&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC11C;&amp;#xBC84; Pipe &amp;#xC778;&amp;#xC2A4;&amp;#xD134;&amp;#xC2A4;&amp;#xAC00; &amp;#xC804;&amp;#xBD80; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC911;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &lt;code&gt;WaitNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;nTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xB9CC;&amp;#xD07C; &amp;#xB300;&amp;#xAE30;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB54C; &lt;strong&gt;nTimeOut&lt;/strong&gt; &amp;#xC778;&amp;#xC790;&amp;#xAC00; default &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218; &lt;strong&gt;nDefaultTimeOut&lt;/strong&gt; &amp;#xAC12;&amp;#xB9CC;&amp;#xD07C; &amp;#xB300;&amp;#xAE30;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; Anonymous Pipe&amp;#xC640; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC744; &amp;#xB73B;&amp;#xD558;&amp;#xACE0;, &amp;#xAC01; Pipe&amp;#xC758; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C;&amp;#xC368; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xC544;&amp;#xC154;&amp;#xB3C4; Windows Pipe &amp;#xCF54;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xBB38;&amp;#xC81C;&amp;#xC5C6;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Windows-Named-pipe&#34;&gt;&lt;a href=&#34;#Windows-Named-pipe&#34; class=&#34;headerlink&#34; title=&#34;Windows Named pipe&#34;&gt;&lt;/a&gt;Windows Named pipe&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;CreatePipe&lt;/code&gt;&amp;#xB098; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA70;, &amp;#xC77C;&amp;#xC885;&amp;#xC758; &lt;strong&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&lt;/strong&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Windows&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; File Object&amp;#xB85C; &amp;#xCDE8;&amp;#xAE09;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; Pipe&amp;#xAC00; File Object&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xB54C;&amp;#xB294; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;WriteFile&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xAD00;&amp;#xB828; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Named Pipe&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Pipe &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xACA9;, &amp;#xB85C;&amp;#xCEEC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Pipe &amp;#xC774;&amp;#xB984; &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;\\&amp;#xC11C;&amp;#xBC84;&amp;#xC774;&amp;#xB984;\pipe\&amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC774;&amp;#xB984;&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84; &amp;#xCE21;: &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xBCF8;&amp;#xC778; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0;&amp;#xC11C; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC11C;&amp;#xBC84; &amp;#xC774;&amp;#xB984;&amp;#xC5D0; .(dot)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC774;&amp;#xB984;(&lt;code&gt;ogu123&lt;/code&gt;)&amp;#xC744; &amp;#xB123;&amp;#xACE0; &lt;code&gt;CreateNamedPipe&lt;/code&gt; &amp;#xD568;&amp;#xC218; lpName &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;: &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt; or &lt;code&gt;\\ComputerName\pipe\ogu123&lt;/code&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; Pipe&amp;#xAC00; &amp;#xB85C;&amp;#xCEEC; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; Pipe&amp;#xAC00; &amp;#xC6D0;&amp;#xACA9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; &lt;code&gt;\\ComputerName\pipe\ogu123&lt;/code&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; Pipe &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; Pipe &amp;#xC774;&amp;#xB984; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &lt;code&gt;ogu123&lt;/code&gt; Pipe&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB290; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;NamedPipeServer.exe&amp;#xB294; &lt;code&gt;ogu123&lt;/code&gt; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Process Explorer&amp;#xB85C; NamedPipeServer.exe &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &lt;code&gt;ogu123&lt;/code&gt; &amp;#xC774;&amp;#xB984;&amp;#xC758; Named Pipe &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC9C4; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC774;&amp;#xC0C1;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &lt;code&gt;\\.\pipe\ogu123&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C;&amp;#xB294;&lt;code&gt;\Device\NamedPipe\ogu123&lt;/code&gt;&amp;#xC5D0; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; WinObj&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;\\.\pipe&lt;/code&gt;&amp;#xAC00; &lt;code&gt;\Device\NamedPipe&lt;/code&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xB9C1;&amp;#xD06C;&amp;#xAC00; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &lt;code&gt;\Device\NamedPipe\ogu123&lt;/code&gt; Pipe&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Named-pipe-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#Named-pipe-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;Named pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&#34;&gt;&lt;/a&gt;Named pipe &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xBCF8;&amp;#xACA9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Named Pipe&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; Process Explorer, accesschk, IDA &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; Client Impersonation &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC2E4;&amp;#xC2B5;&amp;#xC740; &lt;a href=&#34;https://github.com/VerSprite/research/tree/master/projects/cpp/VulnerableApps/WindowsPipes&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0B4;&amp;#xC9DD; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Process Explorer&amp;#xC5D0;&amp;#xC11C; &amp;#xD578;&amp;#xB4E4; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD578;&amp;#xB4E4; &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;(NamedPipeServer.exe)&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; ogu123 Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; accesschk&amp;#xC758; &lt;code&gt;accesschk.exe \pipe\&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; \.\pipe\ &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Named Pipe&amp;#xC758; DACL&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC5D0;&amp;#xC11C; ogu123 Pipe&amp;#xB294; Everyone &amp;#xADF8;&amp;#xB8F9;&amp;#xC774; RW &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; Named Pipe&amp;#xC5D0; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; Read/write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21; Named Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; LPE&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21; Named Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;(&lt;code&gt;CreateNamedPipeW()&lt;/code&gt;&amp;#xD3EC;&amp;#xD568;)&amp;#xC744; IDA Imports&amp;#xB098; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xAC80;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateNamedPipeW&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/05/12/ogu123/NamedPipe/KR/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ogu123 Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; Pipe &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; read &amp;#xD558;&amp;#xACE0; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD560;&amp;#xB9CC;&amp;#xD55C; &amp;#xBCA1;&amp;#xD130;&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC8E0;? &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h3 id=&#34;Client-Impersonation-&amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Client-Impersonation-&amp;#xAE30;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Client Impersonation &amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Client Impersonation &amp;#xAE30;&amp;#xBC95;&lt;/h3&gt;&lt;p&gt;Client Impersonation &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4; LPE&amp;#xB97C; &amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; Impersonation&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB294; Access Token&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Access Token&amp;#xC5D0; &amp;#x201C;&lt;strong&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xB0B4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB514;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#x201D; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xC704;&amp;#xD574; Impersonation Level&amp;#xC774; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;Impersonation Level&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityAnonymous&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xC744; &amp;#xC54C; &amp;#xC218;&amp;#xB3C4;, Impersonation &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityIdentification&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xC2E0;&amp;#xC6D0;&amp;#xACFC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218;&amp;#xB9CC; &amp;#xC788;&amp;#xACE0;, Impersonation&amp;#xC740; &amp;#xBABB; &amp;#xD568;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityImpersonation&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xB85C;&amp;#xCEEC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; Impersonation &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;code&gt;SecurityDelegation&lt;/code&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC6D0;&amp;#xACA9; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xD3EC;&amp;#xD568;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xCC98;&amp;#xB7FC; Impersonation &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Access Token&amp;#xC740; Primary Token&amp;#xC640; Impersonation Token &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC774;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; Access Token&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xC774;&amp;#xB54C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; Primary Token&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB420; &amp;#xB54C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBCC0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; Primary Token&amp;#xC640; Impersonation Token &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, Primary Token&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; Primary Token &amp;#xAC12;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; &amp;#xC0DD;&amp;#xC131;&amp;#xB420; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0; Primary Token &amp;#xB300;&amp;#xC2E0; &amp;#xB2E4;&amp;#xB978; &amp;#xACC4;&amp;#xC815;&amp;#xC758; Access Token&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD1A0;&amp;#xD070;&amp;#xC774; Impersonation Token&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC989; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB294; Primary Token&amp;#xC744; &amp;#xD56D;&amp;#xC0C1; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0; Impersonation &amp;#xC911;&amp;#xC77C; &amp;#xB54C;&amp;#xB9CC; Impersonation Token &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;CreateFile(
    &lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;&amp;#xB85C;&amp;#xCEEC; Pipe &amp;#xACBD;&amp;#xB85C; or &amp;#xC6D0;&amp;#xACA9; Pipe &amp;#xACBD;&amp;#xB85C;&amp;quot;&lt;/span&gt;,
    GENERIC_READ | GENERIC_WRITE,
    &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
    OPEN_EXISTING,
    SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION, &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xB610;&amp;#xB294; SECURITY_DELEGATION&lt;/span&gt;
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;
);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Client Impersonation&amp;#xC73C;&amp;#xB85C; LPE &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB098; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &lt;code&gt;CreateFile()&lt;/code&gt;&amp;#xB97C; &amp;#xD560; &amp;#xB54C;, &amp;#xC77C;&amp;#xBC18; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; &amp;#xB300;&amp;#xC2E0;&amp;#xC5D0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; Named Pipe&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB54C; &lt;code&gt;CreateFile()&lt;/code&gt; &amp;#xD568;&amp;#xC218; 6&amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC774; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION or SECURITY_DELEGATION &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xACA9; Pipe&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; SECURITY_SQOS_PRESENT &amp;#xAC12;&amp;#xB9CC; &amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB3C4; SECURITY_IMPERSONATION&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// Create a server named pipe&lt;/span&gt;
serverPipe = CreateNamedPipe(
    pipeName,           &lt;span class=&#34;hljs-comment&#34;&gt;// name of our pipe, must be in the form of \\.\pipe\&amp;lt;NAME&amp;gt;&lt;/span&gt;
    PIPE_ACCESS_DUPLEX, &lt;span class=&#34;hljs-comment&#34;&gt;// The rest of the parameters don&amp;apos;t really matter&lt;/span&gt;
    PIPE_TYPE_MESSAGE,	&lt;span class=&#34;hljs-comment&#34;&gt;// as all you want is impersonate the client...&lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;,		&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt;,	&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;2048&lt;/span&gt;,	&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;,		&lt;span class=&#34;hljs-comment&#34;&gt;// &lt;/span&gt;
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;	&lt;span class=&#34;hljs-comment&#34;&gt;// This should ne NULL so every client can connect&lt;/span&gt;
);
&lt;span class=&#34;hljs-comment&#34;&gt;// wait for pipe connections&lt;/span&gt;
BOOL bPipeConnected = ConnectNamedPipe(serverPipe, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
&lt;span class=&#34;hljs-comment&#34;&gt;// Impersonate client&lt;/span&gt;
BOOL bImpersonated = ImpersonateNamedPipeClient(serverPipe);
&lt;span class=&#34;hljs-comment&#34;&gt;// if successful open Thread token - your current thread token is now the client&amp;apos;s token&lt;/span&gt;
BOOL bSuccess = OpenThreadToken(GetCurrentThread(), TOKEN_ALL_ACCESS, FALSE, &amp;amp;hToken);
&lt;span class=&#34;hljs-comment&#34;&gt;// now you got the client token saved in hToken and you can safeyl revert back to self&lt;/span&gt;
bSuccess = RevertToSelf();
&lt;span class=&#34;hljs-comment&#34;&gt;// Now duplicate the client&amp;apos;s token to get a Primary token&lt;/span&gt;
bSuccess = DuplicateTokenEx(hToken,
    TOKEN_ALL_ACCESS,
    &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;,
    SecurityImpersonation,
    TokenPrimary,
    &amp;amp;hDuppedToken
);
&lt;span class=&#34;hljs-comment&#34;&gt;// If that succeeds you got a Primary token as hDuppedToken and you can create a proccess with that token&lt;/span&gt;
CreateProcessWithTokenW(hDuppedToken, LOGON_WITH_PROFILE, command, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, CREATE_NEW_CONSOLE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;si, &amp;amp;pi);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xACF5;&amp;#xACA9;&amp;#xC790; Named Pipe &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xBA74; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; LPE&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;ImpersonateNamedPipeClient()&lt;/code&gt; : &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; Impersonation Token&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; Impersonation Token&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; Primary Token&amp;#xC744; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;RevertToSelf()&lt;/code&gt; : Impersonation&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;CreateProcessWithTokenW()&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC804;&amp;#xC5D0;  &amp;#xC774;&amp;#xB904;&amp;#xC838;&amp;#xC57C; &amp;#xC5D0;&amp;#xB7EC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC548; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;DuplicateTokenEx()&lt;/code&gt; : &amp;#xC55E;&amp;#xC11C; &amp;#xC5BB;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; Impersonation Token&amp;#xC744; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; Primary Token&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;CreateProcessWithTokenW()&lt;/code&gt; : Primary Token &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2192; LPE &amp;#xBC1C;&amp;#xC0DD;!&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Windows IPC&amp;#xC640; Named Pipe&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xAE4A;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; Windows Attack Vector&amp;#xB294; &amp;#xC9C4;&amp;#xC9DC; &amp;#xB9CE;&amp;#xAD6C;&amp;#xB098;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;&lt;strong&gt;Reference&lt;/strong&gt;&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;&lt;/li&gt;
&lt;li&gt;&amp;#xB1CC;&amp;#xB97C; &amp;#xC790;&amp;#xADF9;&amp;#xD558;&amp;#xB294; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC988; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.baeldung.com/cs/pipes-vs-sockets&#34;&gt;https://www.baeldung.com/cs/pipes-vs-sockets&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.codeproject.com/Articles/13724/Windows-IPC&#34;&gt;https://www.codeproject.com/Articles/13724/Windows-IPC&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://versprite.com/vs-labs/microsoft-windows-pipes-intro/&#34;&gt;https://versprite.com/vs-labs/microsoft-windows-pipes-intro/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://versprite.com/vs-labs/vulnerable-named-pipe-application/&#34;&gt;https://versprite.com/vs-labs/vulnerable-named-pipe-application/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html&#34;&gt;https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/05/12/ogu123/namedpipe/kr/">

  <title>[Research] Windows Named Pipe (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-05-12 21:00" pubdate>
      2025 5 12 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      86
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Windows Named Pipe (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! ogu123&#xC785;&#xB2C8;&#xB2E4;!!</p>
<p>&#xC624;&#xB298;&#xC740; Windows Named Pipe&#xC5D0; &#xB300;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xAC00;&#xC838;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xADF8;&#xB3D9;&#xC548; IPC&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xBC29;&#xBC95;&#xC774;&#xB2E4;~ &#x2190; &#xC774;&#xB807;&#xAC8C; &#xB450;&#xB8E8;&#xBB49;&#xC220;&#xD558;&#xAC8C; &#xC54C;&#xACE0; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;.. </p>
<p>&#xC774;&#xBC88; &#xAE30;&#xD68C;&#xC5D0; &#xC81C;&#xB300;&#xB85C; &#xC54C;&#xC544;&#xBCF4;&#xACE0;&#xC790; &#xC5EC;&#xB7EC; IPC &#xC911; Named Pipe&#xC5D0; &#xB300;&#xD574; &#xC900;&#xBE44;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><del>(&#xD241;x9 &#xC0AC;&#xD6C4;&#xB8E8;&#xAC00; &#xB4E4;&#xACE0; &#xC788;&#xB294; &#xAC74; Pipe&#xC785;&#xB2C8;&#xB2E4;.)</del></p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/1.png" srcset="/img/loading.gif" alt></p>
<h2 id="Windows-IPC"><a href="#Windows-IPC" class="headerlink" title="Windows IPC"></a>Windows IPC</h2><p>&#xBA3C;&#xC800; IPC(Inter Process Communication)&#xB780;, &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC774; &#xC11C;&#xB85C; &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC544;&#xB798;&#xB294; Windows&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; IPC &#xBC29;&#xBC95;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;(Shared Memory)</li>
<li>Mail Slot</li>
<li>COM(Component Object Model)</li>
<li>Pipe</li>
</ul>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC800;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4; &#xAC04;&#xC5D0; &#xD1B5;&#xC2E0;&#xC744; &#xC65C;? &#xD574;&#xC57C; &#xD558;&#xACE0;, &#xC5B4;&#xB5A4; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC744;&#xAE4C; &#xAD81;&#xAE08;&#xD588;&#xB294;&#xB370;&#xC694;?</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/2.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC704; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; &#xAC1C;&#xBCC4;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xB07C;&#xB9AC; &#xC11C;&#xB85C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xB97C; <strong>&#xB3C5;&#xB9BD; &#xD504;&#xB85C;&#xC138;&#xC2A4;(Independent Process)</strong>&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC;, &#xBCF5;&#xC7A1;&#xD55C; &#xC0C1;&#xD669;&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC0C1;&#xD0DC; &#xAC12;&#xC774;&#xB098; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC11C;&#xB85C; &#xC8FC;&#xACE0;&#xBC1B;&#xC544;&#xC57C; &#xD558;&#xB294;&#xB370;&#xC694;! &#xC774;&#xB97C; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC2DC;&#xB85C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC1B;&#xACE0; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC73C;&#xB85C; &#xAC00;&#xC815;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xB54C;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB294; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xC9C4;&#xD589; &#xC0C1;&#xD669;&#xC744; &#xD654;&#xBA74;&#xC5D0; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC640; &#xC2E4;&#xC81C; &#xD30C;&#xC77C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xC6B4; &#xBC1B;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB3D9;&#xC791; &#xC911; &#xC77C; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#x201C;<strong>&#xC9C0;&#xAE08; 70% &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD588;&#xC5B4;!</strong>&#x201D;&#xAC19;&#xC740; &#xC9C4;&#xD589; &#xC815;&#xBCF4;&#xB97C; &#xD654;&#xBA74; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xBCF4;&#xB0B4;&#xC57C; &#xC720;&#xC800;&#xAC00; &#xC9C4;&#xD589; &#xBC14;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xB610; &#xD654;&#xBA74; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#x201C;<strong>&#xC720;&#xC800;&#xAC00; &#xC815;&#xC9C0; &#xBC84;&#xD2BC; &#xB20C;&#xB800;&#xC5B4;!</strong>&#x201D;&#xB77C;&#xACE0; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC54C;&#xB824;&#xC8FC;&#xBA74; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xAC00; &#xBA48;&#xCD94;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704; &#xC608;&#xC2DC;&#xC640; &#xAC19;&#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xC0C1;&#xD0DC; &#xAC12;&#xC774;&#xB098; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; <strong>&#xD611;&#xB825; &#xD504;&#xB85C;&#xC138;&#xC2A4;(Co-operating Process)</strong>&#xB77C;&#xACE0; &#xD558;&#xACE0; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xACBD;&#xC6B0;, &#xC790;&#xC6D0; &#xACF5;&#xC720;&#xB85C; &#xC791;&#xC5C5; &#xD6A8;&#xC728;&#xC131;&#xC774; &#xB192;&#xC544;&#xC9C0;&#xACE0;, &#xBCD1;&#xB82C; &#xCC98;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB354; &#xBE60;&#xB974;&#xACE0; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC;, &#xC2DC;&#xC2A4;&#xD15C; &#xBCF5;&#xC7A1;&#xB3C4;&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xBA70;, &#xB370;&#xC774;&#xD130; Read/Write &#xC2DC; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xB3D9;&#xAE30;&#xD654; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xCCA0;&#xC800;&#xD55C; &#xC124;&#xACC4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Windows-IPC-Pipe"><a href="#Windows-IPC-Pipe" class="headerlink" title="Windows IPC Pipe"></a>Windows IPC Pipe</h2><p>&#xC704;&#xC5D0;&#xC11C; IPC&#xAC00; &#xBB34;&#xC5C7;&#xC774;&#xACE0; &#xC65C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB294; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC73C;&#xB2C8; &#xC774;&#xC81C; &#xB2E4;&#xC591;&#xD55C; Windows IPC &#xAE30;&#xBC95; &#xC911; Pipe&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; Pipe&#xB294; Anonymous Pipe&#xC640; Named Pipe &#xB450; &#xC885;&#xB958;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC9C1;&#xC5ED;&#xD558;&#xBA74; &#xC774;&#xB984; &#xC5C6;&#xB294; &#xD30C;&#xC774;&#xD504;&#xC640; &#xC774;&#xB984; &#xC788;&#xB294; &#xD30C;&#xC774;&#xD504;&#xC778;&#xB370;&#x2026; &#xC804;&#xD600; &#xAC10;&#xC774; &#xC548; &#xC624;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xC774;&#xB984;&#xC774; &#xB73B;&#xD558;&#xB294; &#xAC8C; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xBA3C;&#xC800; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB984; &#xC5C6;&#xB294; &#xD30C;&#xC774;&#xD504;&#xC640; &#xC774;&#xB984;&#xC788;&#xB294; &#xD30C;&#xC774;&#xD504;&#xC5D0;&#xC11C; <strong>&#xC774;&#xB984;&#xC740; &#xD30C;&#xC774;&#xD504;&#xC758; &#xC8FC;&#xC18C;</strong>&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;! </p>
<p>&#xD30C;&#xC774;&#xD504;&#xC758; &#xC8FC;&#xC18C;&#xAC00; &#xC788;&#xC744; &#xACBD;&#xC6B0; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB098; &#xC6D0;&#xACA9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xACE0; &#xBC18;&#xB300;&#xB85C; &#xC8FC;&#xC18C;&#xAC00; &#xC5C6;&#xC73C;&#xBA74; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC774; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;! </p>
<p>&#xC800;&#xAE30;&#xC694;? Pipe&#xB294; IPC &#xC911; &#xD558;&#xB098;&#xC778;&#xB370; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xC744; &#xBABB;&#xD55C;&#xB2E4;&#xB2C8; &#xC774;&#xAC8C; &#xB9D0;&#xC774; &#xB429;&#xB2C8;&#xAE4C;..? &#x2190; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xBC14;&#xB85C; &#xB4A4; Anonymous Pipe&#xC5D0;&#xC11C; &#xD480;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<p>&#xADF8;&#xB7FC; &#xD30C;&#xC774;&#xD504;&#xC758; &#xC8FC;&#xC18C;&#xB294; &#xBB34;&#xC5C7;&#xC744; &#xB9D0;&#xD558;&#xB294; &#xAC78;&#xAE4C;&#xC694;? &#xB85C;&#xCEEC; Pipe&#xC640; &#xC6D0;&#xACA9; Pipe&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xC6D0;&#xACA9; Pipe&#xC5D0; &#xACBD;&#xC6B0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC0C1;&#xC5D0;&#xC11C; PC&#xB97C; &#xAD6C;&#xBD84;&#xD560; &#xC218; &#xC788;&#xB294; <strong>&#xCEF4;&#xD4E8;&#xD130; &#xC774;&#xB984;</strong>&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC704; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xC2DC;&#xC2A4;&#xD15C; &#xC18D;&#xC131;&#xC5D0;&#xC11C; &#xCEF4;&#xD4E8;&#xD130; &#xC774;&#xB984;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC815;&#xB9AC;&#xD558;&#xC790;&#xBA74; Named Pipe&#xB294; &#xD30C;&#xC774;&#xD504; &#xC8FC;&#xC18C;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD1B5;&#xC2E0; &#xBC94;&#xC704;(&#xC6D0;&#xACA9;, &#xB85C;&#xCEEC;)&#xC5D0; &#xC81C;&#xD55C;&#xC774; &#xC5C6;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBBF8;&#xB9AC; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xACE0;, Anonymous Pipe&#xB294; &#xBC14;&#xB85C; &#xC544;&#xB798;&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h3 id="Anonymous-Pipe"><a href="#Anonymous-Pipe" class="headerlink" title="Anonymous Pipe"></a>Anonymous Pipe</h3><p><img src="/2025/05/12/ogu123/NamedPipe/KR/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; Anonymous Pipe&#xB294; <strong>&#xB2E8;&#xBC29;&#xD5A5;</strong> &#xD2B9;&#xC131;&#xC744; &#xB744;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; <code>CreatePipe</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; Pipe&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xBA74; &#xB2E8;&#xBC29;&#xD5A5; &#xD1B5;&#xC2E0;&#xC774;&#xBBC0;&#xB85C; &#xB450; &#xAC1C;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAC01;&#xC790; &#xC791;&#xC5C5;(Read/Write)&#xB97C; &#xD558;&#xAE30; &#xC704;&#xD55C; &#xD578;&#xB4E4;(hReadPipe, hWritePipe)&#xC744; &#xAC01;&#xAC01; &#xB9AC;&#xD134;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-function">BOOL <span class="hljs-title">CreatePipe</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [out]          PHANDLE               hReadPipe,</span></span>
<span class="hljs-function"><span class="hljs-params">  [out]          PHANDLE               hWritePipe,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPSECURITY_ATTRIBUTES lpPipeAttributes,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD                 nSize</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xC544;&#xB2C8;! &#xC704;&#xC5D0;&#xC11C; Anonymous Pipe&#xB294; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC811;&#xADFC; &#xBABB;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xB294;&#xB370; &#x201C;<strong>&#xB450; &#xAC1C;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAC01;&#xC790; &#xC791;&#xC5C5;(Read/Write)&#xB97C; &#xD558;&#xAE30; &#xC704;&#xD55C; &#xD578;&#xB4E4;(hReadPipe, hWritePipe)&#xC744; &#xB9AC;&#xD134;&#xD569;&#xB2C8;&#xB2E4;.</strong>&#x201D;&#xAC00; &#xBB34;&#xC2A8; &#xB9D0;&#xC785;&#xB2C8;&#xAE4C;&#x2026;? &#xACB0;&#xB860;&#xBD80;&#xD130; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xBA74; Anonymous Pipe&#xB294; <strong>&#xBD80;&#xBAA8;-&#xC790;&#xC2DD; &#xAD00;&#xACC4;&#xC5D0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xD1B5;&#xC2E0;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;</strong>&#xB429;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs cpp"><span class="hljs-function">BOOL <span class="hljs-title">CreateProcess</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]      LPCSTR                lpApplicationName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, out, optional] LPSTR                 lpCommandLine,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]      LPSECURITY_ATTRIBUTES lpProcessAttributes,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]      LPSECURITY_ATTRIBUTES lpThreadAttributes,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]                BOOL                  bInheritHandles,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]                DWORD                 dwCreationFlags,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]      LPVOID                lpEnvironment,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional]      LPCSTR                lpCurrentDirectory,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]                LPSTARTUPINFOA        lpStartupInfo,</span></span>
<span class="hljs-function"><span class="hljs-params">  [out]               LPPROCESS_INFORMATION lpProcessInformation</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xBD80;&#xBAA8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; <code>CreatePipe</code>&#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; <code>CreateProcess</code> &#xD568;&#xC218; bInheritHandles &#xC778;&#xC790; &#xAC12;&#xC744; True&#xB85C; &#xC124;&#xC815;&#xD574; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xBD80;&#xBAA8; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD578;&#xB4E4; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC0C1;&#xC18D;&#xBC1B;&#xC544; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Anonymous Pipe&#xB85C; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xD1B5;&#xC2E0;&#xC740; <code>ReadFile</code>, <code>WriteFile</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D;, &#xC591;&#xBC29;&#xD5A5; &#xD1B5;&#xC2E0;&#xC744; &#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xD504;&#xB97C; &#xB450; &#xAC1C;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xBA74; &#xB418;&#xACA0;&#xC8E0;?</p>
<p>Anonymous Pipe&#xB97C; &#xC815;&#xB9AC;&#xD558;&#xBA74; Pipe&#xC5D0; &#xC774;&#xB984;&#xC774; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xC9C0;&#xB9CC; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xD578;&#xB4E4; &#xD14C;&#xC774;&#xBE14; &#xC0C1;&#xC18D;&#xC744; &#xD1B5;&#xD574; Pipe&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC5B4; Anonymous Pipe&#xB294; &#xBD80;&#xBAA8;-&#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xD1B5;&#xC2E0;&#xC5D0; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="Named-Pipe"><a href="#Named-Pipe" class="headerlink" title="Named Pipe"></a>Named Pipe</h3><p><img src="/2025/05/12/ogu123/NamedPipe/KR/6.png" srcset="/img/loading.gif" alt></p>
<p>Named Pipe&#xB294; <strong>&#xC591;&#xBC29;&#xD5A5;</strong> &#xD2B9;&#xC131;&#xC744; &#xB744;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xCABD;&#xC744; &#xC11C;&#xBC84;, &#xC0DD;&#xC131;&#xB41C; Pipe&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xCABD;&#xC744; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB77C;&#xACE0; &#xD558;&#xBA70; Named Pipe&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xC911;&#xC694;&#xD55C; &#xD568;&#xC218;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA70; &#xC774;&#xD574;&#xD574; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xACFC; &#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB4E4;&#xC744; &#xAC19;&#xC774; &#xD655;&#xC778;&#xD558;&#xC2DC;&#xBA74; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC218;&#xC6D4;&#xD558;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs cpp">hPipe = HANDLE CreateNamedPipe(
  [in]           LPCSTR                lpName,
  [in]           DWORD                 dwOpenMode,
  [in]           DWORD                 dwPipeMode,
  [in]           DWORD                 nMaxInstances,
  [in]           DWORD                 nOutBufferSize,
  [in]           DWORD                 nInBufferSize,
  [in]           DWORD                 nDefaultTimeOut,
  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes
);</code></pre>
<p>&#xBA3C;&#xC800; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; <code>CreateNamedPipe</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xC591;&#xBC29;&#xD5A5; &#xD1B5;&#xC2E0;&#xC774;&#xBBC0;&#xB85C; &#xD55C; &#xAC1C;&#xC758; &#xD578;&#xB4E4;&#xC744; &#xC11C;&#xBC84;&#xC5D0;&#xAC8C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; <strong>lpName</strong> &#xC778;&#xC790;&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xB294; Pipe&#xC758; &#xC774;&#xB984;&#xC774;&#xACE0;, <strong>dwOpenMode</strong> &#xC778;&#xC790;&#xB97C; &#xD1B5;&#xD574; Half-Duplex (&#xC11C;&#xBC84; &#x2192; &#xD074;&#xB77C;&#xC778;&#xD2B8;, &#xC11C;&#xBC84; &#x2190; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;)&#xB85C;&#xB3C4; &#xC124;&#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>nMaxInstances</strong> &#xC778;&#xC790;&#xB294; &#xC0DD;&#xC131;&#xB418;&#xB294; Pipe &#xC778;&#xC2A4;&#xD134;&#xC2A4; &#xAC1C;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xAC12;&#xC774; 3&#xC77C; &#xACBD;&#xC6B0;, &#xAC19;&#xC740; &#xC774;&#xB984;&#xC758; Pipe&#xAC00; 3&#xAC1C;&#xAE4C;&#xC9C0; &#xC0DD;&#xC131;&#xB420; &#xC218; &#xC788;&#xACE0; &#xB530;&#xB77C;&#xC11C; &#xCD1D; 3&#xBA85;&#xC758; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC5F0;&#xACB0;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/7.png" srcset="/img/loading.gif" alt></p>
<p>PipeList&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC2DC;&#xC2A4;&#xD15C; &#xB0B4;&#xC5D0; Named Pipe&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB9CC;&#xC57D;, Max Instances &#xAC12;&#xC774; 1&#xB85C; &#xC124;&#xC815;&#xB41C; Pipe&#xC5D0; &#xC5EC;&#xB7EC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xB4E4;&#xC5B4;&#xC62C; &#xACBD;&#xC6B0; &#xD558;&#xB098;&#xC758; Pipe&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xACE0; &#xB0A8;&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xB300;&#xAE30; &#xC0C1;&#xD0DC;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB300;&#xAE30;&#xD558;&#xB294; &#xC2DC;&#xAC04;&#xC740; <strong>nDefaultTimeOut</strong> &#xC778;&#xC790;&#xB85C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">ConnectNamedPipe(hPipe, <span class="hljs-literal">NULL</span>);</code></pre>
<p>&#xC11C;&#xBC84;&#xC5D0;&#xC11C; Pipe &#xC0DD;&#xC131; &#xD6C4; <code>ConnectNamedPipe</code>&#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; Pipe&#xB97C; <strong>&#xC6D0;&#xACA9;, &#xB85C;&#xCEEC;&#xC5D0; &#xC788;&#xB294; &#xB2E4;&#xB978;  &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC5F0;&#xACB0; &#xB300;&#xAE30; &#xC0C1;&#xD0DC;</strong>&#xB85C; &#xC804;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. Pipe&#xB97C; &#xC678;&#xBD80;&#xC5D0; &#xB178;&#xCD9C;&#xC2DC;&#xD0A8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs cpp"><span class="hljs-function">HANDLE <span class="hljs-title">CreateFile</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           LPCSTR                lpFileName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD                 dwDesiredAccess,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD                 dwShareMode,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] LPSECURITY_ATTRIBUTES lpSecurityAttributes,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD                 dwCreationDisposition,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           DWORD                 dwFlagsAndAttributes,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] HANDLE                hTemplateFile</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xC774;&#xC81C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; <strong>lpFileName</strong> &#xC778;&#xC790;&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xC2F6;&#xC740; &#xC11C;&#xBC84; Named Pipe &#xB123;&#xACE0; <code>CreateFile</code> &#xD568;&#xC218;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; Named Pipe&#xB85C; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xD1B5;&#xC2E0;&#xC740; Anonymous Pipe&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; <code>ReadFile</code>, <code>WriteFile</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-function">BOOL <span class="hljs-title">WaitNamedPipe</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in] LPCSTR lpNamedPipeName,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in] DWORD  nTimeOut</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>;</code></pre>
<p>&#xB9CC;&#xC57D; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; <code>CreateFile</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; Pipe &#xC5F0;&#xACB0; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0C8;&#xC9C0;&#xB9CC;, &#xC11C;&#xBC84; Pipe &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xAC00; &#xC804;&#xBD80; &#xC0AC;&#xC6A9; &#xC911;&#xC774;&#xB77C;&#xBA74; <code>WaitNamedPipe</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; <strong>nTimeOut</strong> &#xC778;&#xC790; &#xAC12;&#xB9CC;&#xD07C; &#xB300;&#xAE30;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB54C; <strong>nTimeOut</strong> &#xC778;&#xC790;&#xAC00; default &#xAC12;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD560; &#xACBD;&#xC6B0;, <code>CreateNamedPipe</code> &#xD568;&#xC218; <strong>nDefaultTimeOut</strong> &#xAC12;&#xB9CC;&#xD07C; &#xB300;&#xAE30;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; Anonymous Pipe&#xC640; Named Pipe&#xC5D0;&#xC11C; &#xC774;&#xB984;&#xC774; &#xBB34;&#xC5C7;&#xC744; &#xB73B;&#xD558;&#xACE0;, &#xAC01; Pipe&#xC758; &#xC0DD;&#xC131;&#xACFC; &#xC0AC;&#xC6A9;&#xC744; &#xCF54;&#xB4DC;&#xB85C;&#xC368; &#xD655;&#xC778;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0; &#xC788;&#xB294; &#xD568;&#xC218;&#xB4E4;&#xB9CC; &#xC544;&#xC154;&#xB3C4; Windows Pipe &#xCF54;&#xB4DC;&#xB4E4;&#xC744; &#xC774;&#xD574;&#xD558;&#xB294;&#xB370; &#xBB38;&#xC81C;&#xC5C6;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;!</p>
<h2 id="Windows-Named-pipe"><a href="#Windows-Named-pipe" class="headerlink" title="Windows Named pipe"></a>Windows Named pipe</h2><p>&#xC774;&#xC81C; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; Named Pipe&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/8.png" srcset="/img/loading.gif" alt></p>
<p><code>CreatePipe</code>&#xB098; <code>CreateNamedPipe</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC0DD;&#xC131;&#xB41C; &#xD30C;&#xC774;&#xD504;&#xB294; &#xCEE4;&#xB110; &#xC601;&#xC5ED;&#xC5D0; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xBA70;, &#xC77C;&#xC885;&#xC758; <strong>&#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;</strong>&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. Windows&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; File Object&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC704; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; Pipe&#xAC00; File Object&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<p>&#xB530;&#xB77C;&#xC11C;, &#xD30C;&#xC774;&#xD504;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0;&#xBC1B;&#xC744; &#xB54C;&#xB294; <code>ReadFile</code>&#xC774;&#xB098; <code>WriteFile</code> &#xAC19;&#xC740; &#xD30C;&#xC77C; &#xAD00;&#xB828; API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Named Pipe&#xC758; &#xACBD;&#xC6B0; Pipe &#xC774;&#xB984;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC6D0;&#xACA9;, &#xB85C;&#xCEEC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5F0;&#xACB0;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; Pipe &#xC774;&#xB984; &#xAE30;&#xBCF8; &#xAD6C;&#xC870;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">\\&#xC11C;&#xBC84;&#xC774;&#xB984;\pipe\&#xD30C;&#xC774;&#xD504;&#xC774;&#xB984;</code></pre>
<ul>
<li>&#xC11C;&#xBC84; &#xCE21;: <code>\\.\pipe\ogu123</code><ul>
<li>&#xC11C;&#xBC84;&#xB294; &#xBCF8;&#xC778; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84; &#xC774;&#xB984;&#xC5D0; .(dot)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xD30C;&#xC774;&#xD504; &#xC774;&#xB984;(<code>ogu123</code>)&#xC744; &#xB123;&#xACE0; <code>CreateNamedPipe</code> &#xD568;&#xC218; lpName &#xC778;&#xC790;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21;: <code>\\.\pipe\ogu123</code> or <code>\\ComputerName\pipe\ogu123</code><ul>
<li>&#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xC2F6;&#xC740; Pipe&#xAC00; &#xB85C;&#xCEEC; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xBA74; <code>\\.\pipe\ogu123</code></li>
<li>&#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xC2F6;&#xC740; Pipe&#xAC00; &#xC6D0;&#xACA9; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xBA74; <code>\\ComputerName\pipe\ogu123</code></li>
</ul>
</li>
</ul>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; Pipe &#xC704;&#xCE58;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; Pipe &#xC774;&#xB984; &#xAD6C;&#xC870;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xB9CC;&#xC57D;, &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; <code>\\.\pipe\ogu123</code>&#xB97C; &#xD1B5;&#xD574; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xBA74; <code>ogu123</code> Pipe&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xC5B4;&#xB290; &#xACBD;&#xB85C;&#xC5D0; &#xC0DD;&#xC131;&#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/10.png" srcset="/img/loading.gif" alt></p>
<p>NamedPipeServer.exe&#xB294; <code>ogu123</code> Pipe&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. Process Explorer&#xB85C; NamedPipeServer.exe &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD578;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC774; <code>ogu123</code> &#xC774;&#xB984;&#xC758; Named Pipe &#xD578;&#xB4E4;&#xC744; &#xAC00;&#xC9C4; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC774;&#xC0C1;&#xD55C; &#xC810;&#xC740; <code>\\.\pipe\ogu123</code> &#xACBD;&#xB85C;&#xC5D0; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD588;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC81C;&#xB85C;&#xB294;<code>\Device\NamedPipe\ogu123</code>&#xC5D0; Pipe&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB294; WinObj&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; <code>\\.\pipe</code>&#xAC00; <code>\Device\NamedPipe</code>&#xACBD;&#xB85C;&#xC5D0; &#xC2EC;&#xBCFC;&#xB9AD; &#xB9C1;&#xD06C;&#xAC00; &#xAC78;&#xB824;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>\Device\NamedPipe\ogu123</code> Pipe&#xAC00; &#xC0DD;&#xC131;&#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Named-pipe-&#xCDE8;&#xC57D;&#xC810;-&#xCC3E;&#xC544;&#xBCF4;&#xAE30;"><a href="#Named-pipe-&#xCDE8;&#xC57D;&#xC810;-&#xCC3E;&#xC544;&#xBCF4;&#xAE30;" class="headerlink" title="Named pipe &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xC544;&#xBCF4;&#xAE30;"></a>Named pipe &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xC544;&#xBCF4;&#xAE30;</h2><p>&#xC774;&#xC81C; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; Named Pipe&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB85C; Process Explorer, accesschk, IDA &#xB4F1;&#xC744; &#xD1B5;&#xD574; &#xCC3E;&#xC544;&#xBCF4;&#xACE0; &#xB450; &#xBC88;&#xC9F8;&#xB294; Client Impersonation &#xAE30;&#xBC95;&#xC744; &#xD1B5;&#xD574; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xB2E4;&#xB904;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC2E4;&#xC2B5;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/VerSprite/research/tree/master/projects/cpp/VulnerableApps/WindowsPipes">&#xB9C1;&#xD06C;</a>&#xC5D0; &#xC788;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC0B4;&#xC9DD; &#xC218;&#xC815;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/12.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; Process Explorer&#xC5D0;&#xC11C; &#xD578;&#xB4E4; &#xC635;&#xC158;&#xC744; &#xD65C;&#xC131;&#xD654;&#xD55C; &#xB2E4;&#xC74C;, &#xB192;&#xC740; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xD578;&#xB4E4; &#xAC12;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/13.png" srcset="/img/loading.gif" alt></p>
<p>&#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;(NamedPipeServer.exe)&#xAC00; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xACE0; ogu123 Pipe&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/14.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; accesschk&#xC758; <code>accesschk.exe \pipe\</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; \.\pipe\ &#xC544;&#xB798;&#xC758; &#xBAA8;&#xB4E0; Named Pipe&#xC758; DACL&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; ogu123 Pipe&#xB294; Everyone &#xADF8;&#xB8F9;&#xC774; RW &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4; Named Pipe&#xC5D0; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC5F0;&#xACB0;&#xD558;&#xACE0; Read/write&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/15.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; IDA&#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xBC84; &#xCE21; Named Pipe &#xC0DD;&#xC131; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; LPE&#xB97C; &#xD2B8;&#xB9AC;&#xAC70; &#xD560;&#xB9CC;&#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xCC3E;&#xC73C;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; &#xC11C;&#xBC84; &#xCE21; Named Pipe &#xC0DD;&#xC131; &#xBD80;&#xBD84;&#xC740; &#xC704; &#xADF8;&#xB9BC; &#xD568;&#xC218;&#xB4E4;(<code>CreateNamedPipeW()</code>&#xD3EC;&#xD568;)&#xC744; IDA Imports&#xB098; &#xBB38;&#xC790;&#xC5F4; &#xAC80;&#xC0C9;&#xC73C;&#xB85C; &#xCC3E;&#xC73C;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/16.png" srcset="/img/loading.gif" alt></p>
<p>&#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; <code>CreateNamedPipeW</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD588;&#xACE0; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACF3;&#xC744; &#xB530;&#xB77C;&#xAC00;&#xBA74;</p>
<p><img src="/2025/05/12/ogu123/NamedPipe/KR/17.png" srcset="/img/loading.gif" alt></p>
<p>ogu123 Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xACF3;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; Pipe &#xC0DD;&#xC131; &#xD6C4; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xC5F0;&#xACB0;&#xB41C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; read &#xD558;&#xACE0; LPE &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD2B8;&#xB9AC;&#xAC70; &#xD560;&#xB9CC;&#xD55C; &#xBCA1;&#xD130;&#xB97C; &#xCC3E;&#xC73C;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;! &#xAC04;&#xB2E8;&#xD558;&#xC8E0;? &#x314E;&#x314E;</p>
<h3 id="Client-Impersonation-&#xAE30;&#xBC95;"><a href="#Client-Impersonation-&#xAE30;&#xBC95;" class="headerlink" title="Client Impersonation &#xAE30;&#xBC95;"></a>Client Impersonation &#xAE30;&#xBC95;</h3><p>Client Impersonation &#xAE30;&#xBC95;&#xC740; &#xC11C;&#xBC84;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC5F0;&#xACB0;&#xC774; &#xB418;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC5B4; LPE&#xB97C; &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xC6B0;&#xC120; &#xC11C;&#xBC84;&#xAC00; Impersonation&#xC744; &#xD558;&#xAE30; &#xC704;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370; &#xC774;&#xB294; Access Token&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; Access Token&#xC5D0; &#x201C;<strong>&#xC11C;&#xBC84;&#xAC00; &#xB0B4; &#xC815;&#xBCF4;&#xB97C; &#xC5B4;&#xB514;&#xAE4C;&#xC9C0; &#xC4F8; &#xC218; &#xC788;&#xB294;&#xC9C0;</strong>&#x201D; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370; &#xC774;&#xB97C; &#xC704;&#xD574; Impersonation Level&#xC774; &#xB4F1;&#xC7A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>Impersonation Level</th>
<th>&#xC124;&#xBA85;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>SecurityAnonymous</code></td>
<td>&#xC11C;&#xBC84;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC2E0;&#xC6D0;&#xC744; &#xC54C; &#xC218;&#xB3C4;, Impersonation &#xD560; &#xC218;&#xB3C4; &#xC5C6;&#xC74C;</td>
</tr>
<tr>
<td><code>SecurityIdentification</code></td>
<td>&#xC11C;&#xBC84;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC2E0;&#xC6D0;&#xACFC; &#xAD8C;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218;&#xB9CC; &#xC788;&#xACE0;, Impersonation&#xC740; &#xBABB; &#xD568;</td>
</tr>
<tr>
<td><code>SecurityImpersonation</code></td>
<td>&#xC11C;&#xBC84;&#xB294; &#xB85C;&#xCEEC; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; Impersonation &#xD560; &#xC218; &#xC788;&#xC74C;</td>
</tr>
<tr>
<td><code>SecurityDelegation</code></td>
<td>&#xC11C;&#xBC84;&#xB294; &#xC6D0;&#xACA9; &#xC2DC;&#xC2A4;&#xD15C;&#xAE4C;&#xC9C0; &#xD3EC;&#xD568;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xCC98;&#xB7FC; Impersonation &#xD560; &#xC218; &#xC788;&#xC74C;</td>
</tr>
</tbody>
</table>
</div>
<p>Access Token&#xC740; Primary Token&#xC640; Impersonation Token &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB370; &#xC774;&#xB97C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC640; &#xC2A4;&#xB808;&#xB4DC;&#xB85C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>Windows&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; Access Token&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xACE0; &#xC774;&#xB54C;, &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD1A0;&#xD070;&#xC740; Primary Token&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC885;&#xB8CC;&#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xBCC0;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2A4;&#xB808;&#xB4DC;&#xB294; Primary Token&#xC640; Impersonation Token &#xB450; &#xAC00;&#xC9C0; &#xAC12;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xACE0;, Primary Token&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; Primary Token &#xAC12;&#xC744; &#xACF5;&#xC720;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2A4;&#xB808;&#xB4DC;&#xB294; &#xC0DD;&#xC131;&#xB420; &#xB2F9;&#xC2DC;&#xC5D0; Primary Token &#xB300;&#xC2E0; &#xB2E4;&#xB978; &#xACC4;&#xC815;&#xC758; Access Token&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; &#xC774;&#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD1A0;&#xD070;&#xC774; Impersonation Token&#xC785;&#xB2C8;&#xB2E4;! &#xC989; &#xC2A4;&#xB808;&#xB4DC;&#xB294; Primary Token&#xC744; &#xD56D;&#xC0C1; &#xCC38;&#xC870;&#xD558;&#xACE0; Impersonation &#xC911;&#xC77C; &#xB54C;&#xB9CC; Impersonation Token &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp">CreateFile(
    <span class="hljs-string">L&quot;&#xB85C;&#xCEEC; Pipe &#xACBD;&#xB85C; or &#xC6D0;&#xACA9; Pipe &#xACBD;&#xB85C;&quot;</span>,
    GENERIC_READ | GENERIC_WRITE,
    <span class="hljs-number">0</span>,
    <span class="hljs-literal">NULL</span>,
    OPEN_EXISTING,
    SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION, <span class="hljs-comment">// &#xB610;&#xB294; SECURITY_DELEGATION</span>
    <span class="hljs-literal">NULL</span>
);</code></pre>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; Client Impersonation&#xC73C;&#xB85C; LPE &#xBC29;&#xBC95;&#xC744; &#xC790;&#xC138;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xD0C0;&#xAC9F; &#xC11C;&#xBE44;&#xC2A4;&#xB098; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; <code>CreateFile()</code>&#xB97C; &#xD560; &#xB54C;, &#xC77C;&#xBC18; &#xD30C;&#xC77C; &#xACBD;&#xB85C; &#xB300;&#xC2E0;&#xC5D0; &#xACF5;&#xACA9;&#xC790; Named Pipe&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;! &#xC774;&#xB54C; <code>CreateFile()</code> &#xD568;&#xC218; 6&#xBC88;&#xC9F8; &#xC778;&#xC790; &#xAC12;&#xC774; &#xC704;&#xC640; &#xAC19;&#xC774; SECURITY_SQOS_PRESENT | SECURITY_IMPERSONATION or SECURITY_DELEGATION &#xAC12;&#xC744; &#xAC00;&#xC838;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6D0;&#xACA9; Pipe&#xC758; &#xACBD;&#xC6B0; SECURITY_SQOS_PRESENT &#xAC12;&#xB9CC; &#xC788;&#xC744; &#xACBD;&#xC6B0;&#xC5D0;&#xB3C4; SECURITY_IMPERSONATION&#xC774; &#xC801;&#xC6A9;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-comment">// Create a server named pipe</span>
serverPipe = CreateNamedPipe(
    pipeName,           <span class="hljs-comment">// name of our pipe, must be in the form of \\.\pipe\&lt;NAME&gt;</span>
    PIPE_ACCESS_DUPLEX, <span class="hljs-comment">// The rest of the parameters don&apos;t really matter</span>
    PIPE_TYPE_MESSAGE,	<span class="hljs-comment">// as all you want is impersonate the client...</span>
    <span class="hljs-number">1</span>,		<span class="hljs-comment">// </span>
    <span class="hljs-number">2048</span>,	<span class="hljs-comment">// </span>
    <span class="hljs-number">2048</span>,	<span class="hljs-comment">// </span>
    <span class="hljs-number">0</span>,		<span class="hljs-comment">// </span>
    <span class="hljs-literal">NULL</span>	<span class="hljs-comment">// This should ne NULL so every client can connect</span>
);
<span class="hljs-comment">// wait for pipe connections</span>
BOOL bPipeConnected = ConnectNamedPipe(serverPipe, <span class="hljs-literal">NULL</span>);
<span class="hljs-comment">// Impersonate client</span>
BOOL bImpersonated = ImpersonateNamedPipeClient(serverPipe);
<span class="hljs-comment">// if successful open Thread token - your current thread token is now the client&apos;s token</span>
BOOL bSuccess = OpenThreadToken(GetCurrentThread(), TOKEN_ALL_ACCESS, FALSE, &amp;hToken);
<span class="hljs-comment">// now you got the client token saved in hToken and you can safeyl revert back to self</span>
bSuccess = RevertToSelf();
<span class="hljs-comment">// Now duplicate the client&apos;s token to get a Primary token</span>
bSuccess = DuplicateTokenEx(hToken,
    TOKEN_ALL_ACCESS,
    <span class="hljs-literal">NULL</span>,
    SecurityImpersonation,
    TokenPrimary,
    &amp;hDuppedToken
);
<span class="hljs-comment">// If that succeeds you got a Primary token as hDuppedToken and you can create a proccess with that token</span>
CreateProcessWithTokenW(hDuppedToken, LOGON_WITH_PROFILE, command, <span class="hljs-literal">NULL</span>, CREATE_NEW_CONSOLE, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>, &amp;si, &amp;pi);</code></pre>
<p>&#xD0C0;&#xAC9F; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xACF5;&#xACA9;&#xC790; Named Pipe &#xC11C;&#xBC84;&#xAC00; &#xC5F0;&#xACB0;&#xB418;&#xBA74; &#xC11C;&#xBC84;&#xB294; &#xC704; &#xCF54;&#xB4DC;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; LPE&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC8FC;&#xC694;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xB9CC; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>ImpersonateNamedPipeClient()</code> : &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; Impersonation Token&#xC744; &#xD1B5;&#xD574; &#xC11C;&#xBC84; &#xC2A4;&#xB808;&#xB4DC;&#xC5D0; &#xC801;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C;, &#xC0AC;&#xC6A9;&#xD55C; Impersonation Token&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; Primary Token&#xC744; &#xC2A4;&#xB808;&#xB4DC;&#xC5D0; &#xC801;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD1A0;&#xD070;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li><code>RevertToSelf()</code> : Impersonation&#xC744; &#xC885;&#xB8CC;&#xD569;&#xB2C8;&#xB2E4;. <code>CreateProcessWithTokenW()</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC804;&#xC5D0;  &#xC774;&#xB904;&#xC838;&#xC57C; &#xC5D0;&#xB7EC;&#xAC00; &#xBC1C;&#xC0DD; &#xC548; &#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>DuplicateTokenEx()</code> : &#xC55E;&#xC11C; &#xC5BB;&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; Impersonation Token&#xC744; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; Primary Token&#xC73C;&#xB85C; &#xBCF5;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>CreateProcessWithTokenW()</code> : Primary Token &#xD1A0;&#xD070;&#xC744; &#xD1B5;&#xD574; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#x2192; LPE &#xBC1C;&#xC0DD;!</li>
</ul>
<h2 id="&#xB9C8;&#xBB34;&#xB9AC;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;"></a>&#xB9C8;&#xBB34;&#xB9AC;</h2><p>&#xC774;&#xBC88; &#xAE00;&#xC744; &#xD1B5;&#xD574; Windows IPC&#xC640; Named Pipe&#xC5D0; &#xB300;&#xD574; &#xAE4A;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAE00;&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74;&#xC11C; Windows Attack Vector&#xB294; &#xC9C4;&#xC9DC; &#xB9CE;&#xAD6C;&#xB098;&#xB97C; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;..</p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2F9; &#x314E;&#x314E;</p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a><strong>Reference</strong></h2><ul>
<li>&#xC708;&#xB3C4;&#xC6B0; &#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;</li>
<li>&#xB1CC;&#xB97C; &#xC790;&#xADF9;&#xD558;&#xB294; &#xC708;&#xB3C4;&#xC6B0;&#xC988; &#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;</li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.baeldung.com/cs/pipes-vs-sockets">https://www.baeldung.com/cs/pipes-vs-sockets</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.codeproject.com/Articles/13724/Windows-IPC">https://www.codeproject.com/Articles/13724/Windows-IPC</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://versprite.com/vs-labs/microsoft-windows-pipes-intro/">https://versprite.com/vs-labs/microsoft-windows-pipes-intro/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://versprite.com/vs-labs/vulnerable-named-pipe-application/">https://versprite.com/vs-labs/vulnerable-named-pipe-application/</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html">https://csandker.io/2021/01/10/Offensive-Windows-IPC-1-NamedPipes.html</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/ogu123/">ogu123</a>
                  
                  <a class="hover-with-bg" href="/tags/IPC/">IPC</a>
                  
                  <a class="hover-with-bg" href="/tags/Named-Pipe/">Named Pipe</a>
                  
                  <a class="hover-with-bg" href="/tags/Anonymous-Pipe/">Anonymous Pipe</a>
                  
                  <a class="hover-with-bg" href="/tags/Client-Impersonation/">Client Impersonation</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_ogu123.jpg" srcset="/img/loading.gif" alt="ogu123">
                  </div>

                  <div class="link-text">
                    <div class="link-title">ogu123</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/ogu123">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/05/12/ogu123/NamedPipe/EN/">
                    <span class="hidden-mobile">[Research] Windows Named Pipe (EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/';
        this.page.identifier = '/2025/05/12/ogu123/NamedPipe/KR/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Windows Named Pipe (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
