

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://showy-money-ab2.notion.site/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03#02be1c3a401847768d256aba5e47912f&#34;&gt;Hacking JSON Web Tokens (JWTs)&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Web, JWT&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;(JWT)&amp;#xC740; &amp;#xC0C1;&amp;#xC6A9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB110;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070; &amp;#xC720;&amp;#xD615;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. JSON &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xBA70; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;(&amp;#xBC0F; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85; &amp;#xAE30;&amp;#xBC18; &amp;#xD1A0;&amp;#xD070;) &amp;#xC0AC;&amp;#xC6A9;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC601;&amp;#xD5A5;&amp;#xACFC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;JWT&amp;#xB294; &amp;#xD5E4;&amp;#xB354;, &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;, &amp;#xC11C;&amp;#xBA85;&amp;#xC758; &amp;#xC138;&amp;#xAC1C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xAC01; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; Base64URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD574;  &amp;#x201C;.&amp;#x201D;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs brainfuck&#34;&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xD5E4;&amp;#xB354;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xC11C;&amp;#xBA85;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;eyBhbGcgOiBIUzI1NiwgdHlwIDogSldUIH0K&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;eyB1c2VyX25hbWUgOiBhZG1pbiB9Cg&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;4Hb/6ibbViPOzq9SJflsNGPWSk6B8F6EqVrkNjpXh7M&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;JWT&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Change up the algorithm type:&lt;/strong&gt; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;code&gt;alg&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;None algorithm : &lt;code&gt;alg&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;&amp;quot;none&amp;quot;&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC11C;&amp;#xBA85; &amp;#xC139;&amp;#xC158;&amp;#xC774; &amp;#xBE44;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;HMAC algorithm : &lt;code&gt;HMAC&lt;/code&gt; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD0A4;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85;/&amp;#xAC80;&amp;#xC99D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;RSA&lt;/code&gt;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xAC1C;&amp;#xC778; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;RSA&lt;/code&gt; &amp;#xC554;&amp;#xD638;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, &lt;code&gt;HAMC&lt;/code&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xAC1C;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xACF5;&amp;#xAC1C;&amp;#xD0A4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD0A4; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xD1B5;&amp;#xACFC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Provide a non-valid signature:&lt;/strong&gt; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF4;&amp;#xC548; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Bruteforce the secret key:&lt;/strong&gt; JWT&amp;#xC5D0; &amp;#xC11C;&amp;#xBA85; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;, &amp;#xACB0;&amp;#xACFC; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC54C;&amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4; &amp;#xB300;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Leak the secret key:&lt;/strong&gt; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD0A4; &amp;#xAC12;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(&amp;#xC608;: &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xD0D0;&amp;#xC0C9;, XXE, SSRF)&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD0A4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE58;&amp;#xACE0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xC11C;&amp;#xBA85;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;KID manipulation:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt;&amp;#xB294; &amp;#x201C;&amp;#xD0A4; ID&amp;#x201D;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. JWT&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD5E4;&amp;#xB354; &amp;#xD544;&amp;#xB4DC;&amp;#xC774;&amp;#xBA70; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070; &amp;#xD655;&amp;#xC778;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD0A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Directory traversal: &lt;code&gt;KID&lt;/code&gt;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC804;&amp;#xC5D0; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xD0D0;&amp;#xC0C9; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD0A4;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs gradle&#34;&gt;&amp;#x201C;kid&amp;#x201D;: &amp;#x201C;..&lt;span class=&#34;hljs-regexp&#34;&gt;/../&lt;/span&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;public&lt;/span&gt;&lt;span class=&#34;hljs-regexp&#34;&gt;/css/m&lt;/span&gt;ain.css&amp;#x201D; &lt;span class=&#34;hljs-comment&#34;&gt;// use the publicly available file main.css to verify the token&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SQL Injection: &lt;code&gt;KID&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; SQL Injection&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; JWT &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs livecodeserver&#34;&gt;&amp;#x201C;kid&amp;#x201D;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;aaaaaaa&amp;apos; UNION SELECT &amp;apos;key&amp;apos;;--&amp;quot;&lt;/span&gt;// use &lt;span class=&#34;hljs-keyword&#34;&gt;the&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;string&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;key&amp;quot;&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;to&lt;/span&gt; verify &lt;span class=&#34;hljs-keyword&#34;&gt;the&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;token&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC704;&amp;#xC758; &amp;#xC0BD;&amp;#xC785;&amp;#xC740; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#x201C;key&amp;#x201D;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;key&amp;#x201D; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Header parameter manipulation:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070; &amp;#xD45C;&amp;#xC900;&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; URL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD0A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xB3C4; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;JKU header parameter: JKU&amp;#xB294; &amp;#x201C;JWK Set URL&amp;#x201D;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xAC80;&amp;#xC99D;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4; &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; URL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD5E4;&amp;#xB354; &amp;#xD544;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xCCB4; &amp;#xD0A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD638;&amp;#xC2A4;&amp;#xD305;&amp;#xD558;&amp;#xACE0; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;JWK header parameter: JWK(JSON Web Key) &amp;#xD5E4;&amp;#xB354; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xD3EC;&amp;#xD568;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;X5U, X5C URL manipulation: JKU &amp;#xBC0F; JWK &amp;#xD5E4;&amp;#xB354;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; X5U &amp;#xBC0F; X5C &amp;#xD5E4;&amp;#xB354; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4; &amp;#xC778;&amp;#xC99D;&amp;#xC11C; &amp;#xB610;&amp;#xB294; &amp;#xC778;&amp;#xC99D;&amp;#xC11C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Other JWT security issues:&lt;/strong&gt; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC798;&amp;#xBABB; &amp;#xB418;&amp;#xC5C8;&amp;#xC744;&amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; JWT &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;Information leak:&lt;/strong&gt; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; base64URL&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Command injection:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC77D;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &lt;code&gt;KID&lt;/code&gt; &amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xB984; &amp;#xB4A4;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.notion.so/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03&#34;&gt;URL&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] Hacking JSON Web Tokens (JWTs) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://showy-money-ab2.notion.site/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03#02be1c3a401847768d256aba5e47912f&#34;&gt;Hacking JSON Web Tokens (JWTs)&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Web, JWT&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;(JWT)&amp;#xC740; &amp;#xC0C1;&amp;#xC6A9; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC5D0;&amp;#xC11C; &amp;#xB110;&amp;#xB9AC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070; &amp;#xC720;&amp;#xD615;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. JSON &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xBA70; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xBB34;&amp;#xACB0;&amp;#xC131;&amp;#xC744; &amp;#xBCF4;&amp;#xC7A5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;(&amp;#xBC0F; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85; &amp;#xAE30;&amp;#xBC18; &amp;#xD1A0;&amp;#xD070;) &amp;#xC0AC;&amp;#xC6A9;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC601;&amp;#xD5A5;&amp;#xACFC; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;JWT&amp;#xB294; &amp;#xD5E4;&amp;#xB354;, &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;, &amp;#xC11C;&amp;#xBA85;&amp;#xC758; &amp;#xC138;&amp;#xAC1C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xAC01; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; Base64URL&amp;#xB85C; &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xD574;  &amp;#x201C;.&amp;#x201D;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xC644;&amp;#xC804;&amp;#xD55C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs brainfuck&#34;&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xD5E4;&amp;#xB354;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;[&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;&amp;#xC11C;&amp;#xBA85;&lt;/span&gt;--&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-literal&#34;&gt;-&lt;/span&gt;&lt;span class=&#34;hljs-title&#34;&gt;]&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;eyBhbGcgOiBIUzI1NiwgdHlwIDogSldUIH0K&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;eyB1c2VyX25hbWUgOiBhZG1pbiB9Cg&lt;/span&gt;&lt;span class=&#34;hljs-string&#34;&gt;.&lt;/span&gt;&lt;span class=&#34;hljs-comment&#34;&gt;4Hb/6ibbViPOzq9SJflsNGPWSk6B8F6EqVrkNjpXh7M&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;JWT&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9; &amp;#xC720;&amp;#xD615;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Change up the algorithm type:&lt;/strong&gt; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;code&gt;alg&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;None algorithm : &lt;code&gt;alg&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;&amp;quot;none&amp;quot;&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC11C;&amp;#xBA85; &amp;#xC139;&amp;#xC158;&amp;#xC774; &amp;#xBE44;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAC04;&amp;#xC8FC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;HMAC algorithm : &lt;code&gt;HMAC&lt;/code&gt; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD0A4;&amp;#xB85C; &amp;#xC11C;&amp;#xBA85;/&amp;#xAC80;&amp;#xC99D;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;RSA&lt;/code&gt;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; &amp;#xAC1C;&amp;#xC778; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD574;&amp;#xB2F9; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;RSA&lt;/code&gt; &amp;#xC554;&amp;#xD638;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4;, &lt;code&gt;HAMC&lt;/code&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB85C; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xAC1C;&amp;#xD0A4;&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD574;&amp;#xC11C; &amp;#xB118;&amp;#xAE30;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xACF5;&amp;#xAC1C;&amp;#xD0A4;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD0A4; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xD1B5;&amp;#xACFC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Provide a non-valid signature:&lt;/strong&gt; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xC11C;&amp;#xBA85; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF4;&amp;#xC548; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Bruteforce the secret key:&lt;/strong&gt; JWT&amp;#xC5D0; &amp;#xC11C;&amp;#xBA85; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;, &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;, &amp;#xACB0;&amp;#xACFC; &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC54C;&amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBB34;&amp;#xCC28;&amp;#xBCC4; &amp;#xB300;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Leak the secret key:&lt;/strong&gt; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD0A4; &amp;#xAC12;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;(&amp;#xC608;: &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xD0D0;&amp;#xC0C9;, XXE, SSRF)&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD0A4;&amp;#xB97C; &amp;#xD6D4;&amp;#xCE58;&amp;#xACE0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xC11C;&amp;#xBA85;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;KID manipulation:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt;&amp;#xB294; &amp;#x201C;&amp;#xD0A4; ID&amp;#x201D;&amp;#xB97C; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. JWT&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD5E4;&amp;#xB354; &amp;#xD544;&amp;#xB4DC;&amp;#xC774;&amp;#xBA70; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070; &amp;#xD655;&amp;#xC778;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD0A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;Directory traversal: &lt;code&gt;KID&lt;/code&gt;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9; &amp;#xC804;&amp;#xC5D0; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xD0D0;&amp;#xC0C9; &amp;#xACF5;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xD0A4;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs gradle&#34;&gt;&amp;#x201C;kid&amp;#x201D;: &amp;#x201C;..&lt;span class=&#34;hljs-regexp&#34;&gt;/../&lt;/span&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;public&lt;/span&gt;&lt;span class=&#34;hljs-regexp&#34;&gt;/css/m&lt;/span&gt;ain.css&amp;#x201D; &lt;span class=&#34;hljs-comment&#34;&gt;// use the publicly available file main.css to verify the token&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SQL Injection: &lt;code&gt;KID&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD0A4;&amp;#xB97C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xC6B0; SQL Injection&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; JWT &amp;#xC11C;&amp;#xBA85;&amp;#xC744; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs livecodeserver&#34;&gt;&amp;#x201C;kid&amp;#x201D;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;aaaaaaa&amp;apos; UNION SELECT &amp;apos;key&amp;apos;;--&amp;quot;&lt;/span&gt;// use &lt;span class=&#34;hljs-keyword&#34;&gt;the&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;string&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;key&amp;quot;&lt;/span&gt; &lt;span class=&#34;hljs-built_in&#34;&gt;to&lt;/span&gt; verify &lt;span class=&#34;hljs-keyword&#34;&gt;the&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;token&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xC704;&amp;#xC758; &amp;#xC0BD;&amp;#xC785;&amp;#xC740; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#x201C;key&amp;#x201D;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0; &amp;#xB2E4;&amp;#xC74C; &amp;#x201C;key&amp;#x201D; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xBE44;&amp;#xBC00; &amp;#xD0A4;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Header parameter manipulation:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt;&amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070; &amp;#xD45C;&amp;#xC900;&amp;#xC740; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; URL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD0A4;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xB3C4; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;JKU header parameter: JKU&amp;#xB294; &amp;#x201C;JWK Set URL&amp;#x201D;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xAC80;&amp;#xC99D;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4; &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; URL&amp;#xC744; &amp;#xBA85;&amp;#xC2DC;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC120;&amp;#xD0DD;&amp;#xC801; &amp;#xD5E4;&amp;#xB354; &amp;#xD544;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xCCB4; &amp;#xD0A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD638;&amp;#xC2A4;&amp;#xD305;&amp;#xD558;&amp;#xACE0; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;JWK header parameter: JWK(JSON Web Key) &amp;#xD5E4;&amp;#xB354; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xD3EC;&amp;#xD568;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;X5U, X5C URL manipulation: JKU &amp;#xBC0F; JWK &amp;#xD5E4;&amp;#xB354;&amp;#xC640; &amp;#xC720;&amp;#xC0AC;&amp;#xD55C; X5U &amp;#xBC0F; X5C &amp;#xD5E4;&amp;#xB354; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACF5;&amp;#xAC1C; &amp;#xD0A4; &amp;#xC778;&amp;#xC99D;&amp;#xC11C; &amp;#xB610;&amp;#xB294; &amp;#xC778;&amp;#xC99D;&amp;#xC11C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;strong&gt;Other JWT security issues:&lt;/strong&gt; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xC798;&amp;#xBABB; &amp;#xB418;&amp;#xC5C8;&amp;#xC744;&amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; JWT &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;Information leak:&lt;/strong&gt; JSON &amp;#xC6F9; &amp;#xD1A0;&amp;#xD070;&amp;#xC740; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC81C;&amp;#xC5B4;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1A0;&amp;#xD070;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; base64URL&amp;#xB85C; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xB514;&amp;#xCF54;&amp;#xB529;&amp;#xD558;&amp;#xACE0; &amp;#xD1A0;&amp;#xD070;&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC77D;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD1A0;&amp;#xD070;&amp;#xC5D0; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC815;&amp;#xBCF4; &amp;#xC720;&amp;#xCD9C;&amp;#xC758; &amp;#xC6D0;&amp;#xC778;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Command injection:&lt;/strong&gt; &lt;code&gt;KID&lt;/code&gt; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC77D;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xC804;&amp;#xB2EC;&amp;#xB420; &amp;#xB54C; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &lt;code&gt;KID&lt;/code&gt; &amp;#xD30C;&amp;#xC77C; &amp;#xC774;&amp;#xB984; &amp;#xB4A4;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xB2E4; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.notion.so/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03&#34;&gt;URL&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/11/20/in0hack/2021-11-20/">

  <title>[하루한줄] Hacking JSON Web Tokens (JWTs) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-11-20 14:00" pubdate>
      2021년 11월 20일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.3k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      26
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] Hacking JSON Web Tokens (JWTs)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://showy-money-ab2.notion.site/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03#02be1c3a401847768d256aba5e47912f">Hacking JSON Web Tokens (JWTs)</a></li>
</ul>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>Web, JWT</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>JSON &#xC6F9; &#xD1A0;&#xD070;(JWT)&#xC740; &#xC0C1;&#xC6A9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC561;&#xC138;&#xC2A4; &#xD1A0;&#xD070; &#xC720;&#xD615;&#xC785;&#xB2C8;&#xB2E4;. JSON &#xD615;&#xC2DD;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD558;&#xBA70; &#xD1A0;&#xD070;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD1A0;&#xD070; &#xC11C;&#xBA85;&#xC744; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; JSON &#xC6F9; &#xD1A0;&#xD070;(&#xBC0F; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC11C;&#xBA85; &#xAE30;&#xBC18; &#xD1A0;&#xD070;) &#xC0AC;&#xC6A9;&#xC758; &#xBCF4;&#xC548; &#xC601;&#xD5A5;&#xACFC; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>JWT&#xB294; &#xD5E4;&#xB354;, &#xD398;&#xC774;&#xB85C;&#xB4DC;, &#xC11C;&#xBA85;&#xC758; &#xC138;&#xAC1C;&#xC758; &#xAD6C;&#xC870;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; &#xAC01; &#xB370;&#xC774;&#xD130;&#xB97C; Base64URL&#xB85C; &#xC778;&#xCF54;&#xB529;&#xD574;  &#x201C;.&#x201D;&#xB85C; &#xC5F0;&#xACB0;&#xD558;&#xC5EC; &#xC644;&#xC804;&#xD55C; &#xD1A0;&#xD070;&#xC744; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs brainfuck"><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xD5E4;&#xB354;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span><span class="hljs-string">.</span><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xD398;&#xC774;&#xB85C;&#xB4DC;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span><span class="hljs-string">.</span><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xC11C;&#xBA85;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span>
<span class="hljs-comment">eyBhbGcgOiBIUzI1NiwgdHlwIDogSldUIH0K</span><span class="hljs-string">.</span><span class="hljs-comment">eyB1c2VyX25hbWUgOiBhZG1pbiB9Cg</span><span class="hljs-string">.</span><span class="hljs-comment">4Hb/6ibbViPOzq9SJflsNGPWSk6B8F6EqVrkNjpXh7M</span></code></pre>
<p>JWT&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xD574;&#xD0B9; &#xACF5;&#xACA9; &#xC720;&#xD615;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p><strong>Change up the algorithm type:</strong> &#xD5E4;&#xB354;&#xC758; <code>alg</code> &#xD544;&#xB4DC;&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>None algorithm : <code>alg</code> &#xD544;&#xB4DC;&#xAC00; <code>&quot;none&quot;</code>&#xC73C;&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC11C;&#xBA85; &#xC139;&#xC158;&#xC774; &#xBE44;&#xC5B4; &#xC788;&#xB294; &#xACBD;&#xC6B0; &#xBAA8;&#xB4E0; &#xD1A0;&#xD070;&#xC774; &#xC720;&#xD6A8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB429;&#xB2C8;&#xB2E4;</li>
<li>HMAC algorithm : <code>HMAC</code> &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xD0A4;&#xB85C; &#xC11C;&#xBA85;/&#xAC80;&#xC99D;&#xB429;&#xB2C8;&#xB2E4;. <code>RSA</code>&#xC758; &#xACBD;&#xC6B0; &#xD1A0;&#xD070;&#xC740; &#xBA3C;&#xC800; &#xAC1C;&#xC778; &#xD0A4;&#xB85C; &#xC0DD;&#xC131;&#xB41C; &#xB2E4;&#xC74C; &#xD574;&#xB2F9; &#xACF5;&#xAC1C; &#xD0A4;&#xB85C; &#xD655;&#xC778;&#xB429;&#xB2C8;&#xB2E4;. <code>RSA</code> &#xC554;&#xD638;&#xB85C; &#xAD6C;&#xD604; &#xB418;&#xC5B4; &#xC788;&#xB354;&#xB77C;&#xB3C4;, <code>HAMC</code>&#xC554;&#xD638;&#xD654;&#xB85C; &#xBA85;&#xC2DC;&#xD558;&#xBA74; &#xACF5;&#xAC1C;&#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654; &#xD574;&#xC11C; &#xB118;&#xAE30;&#xB354;&#xB77C;&#xB3C4; &#xACF5;&#xAC1C;&#xD0A4;&#xB85C; &#xD655;&#xC778;&#xD558;&#xAE30;&#xB54C;&#xBB38;&#xC5D0; &#xD0A4; &#xAC80;&#xC99D;&#xC774; &#xD1B5;&#xACFC;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
<li><p><strong>Provide a non-valid signature:</strong> &#xD1A0;&#xD070;&#xC758; &#xC11C;&#xBA85; &#xAC80;&#xC99D;&#xC774; &#xC5C6;&#xC744; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC798;&#xBABB;&#xB41C; &#xC11C;&#xBA85;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC5EC; &#xBCF4;&#xC548; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Bruteforce the secret key:</strong> JWT&#xC5D0; &#xC11C;&#xBA85; &#xC54C;&#xACE0;&#xB9AC;&#xC998;, &#xD398;&#xC774;&#xB85C;&#xB4DC;, &#xACB0;&#xACFC; &#xC11C;&#xBA85;&#xC744; &#xC54C;&#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xD0A4;&#xB97C; &#xBB34;&#xCC28;&#xBCC4; &#xB300;&#xC785;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Leak the secret key:</strong> &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD0A4; &#xAC12;&#xC774; &#xC800;&#xC7A5;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB294; &#xB2E4;&#xB978; &#xCDE8;&#xC57D;&#xC810;(&#xC608;: &#xB514;&#xB809;&#xD130;&#xB9AC; &#xD0D0;&#xC0C9;, XXE, SSRF)&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD0A4;&#xB97C; &#xD6D4;&#xCE58;&#xACE0; &#xC784;&#xC758;&#xC758; &#xD1A0;&#xD070;&#xC5D0; &#xC11C;&#xBA85;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>KID manipulation:</strong> <code>KID</code>&#xB294; &#x201C;&#xD0A4; ID&#x201D;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. JWT&#xC758; &#xC120;&#xD0DD;&#xC801; &#xD5E4;&#xB354; &#xD544;&#xB4DC;&#xC774;&#xBA70; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xD1A0;&#xD070; &#xD655;&#xC778;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xD0A4;&#xB97C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><p>Directory traversal: <code>KID</code>&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xD0A4; &#xD30C;&#xC77C;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xB294; &#xB370; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0AC;&#xC6A9; &#xC804;&#xC5D0; &#xC0AD;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xD0D0;&#xC0C9; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xD560; &#xD0A4;&#xB85C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs gradle">&#x201C;kid&#x201D;: &#x201C;..<span class="hljs-regexp">/../</span><span class="hljs-keyword">public</span><span class="hljs-regexp">/css/m</span>ain.css&#x201D; <span class="hljs-comment">// use the publicly available file main.css to verify the token</span></code></pre>
</li>
<li><p>SQL Injection: <code>KID</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xD0A4;&#xB97C; &#xAC80;&#xC0C9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; SQL Injection&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; JWT &#xC11C;&#xBA85;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs livecodeserver">&#x201C;kid&#x201D;: <span class="hljs-string">&quot;aaaaaaa&apos; UNION SELECT &apos;key&apos;;--&quot;</span>// use <span class="hljs-keyword">the</span> <span class="hljs-keyword">string</span> <span class="hljs-string">&quot;key&quot;</span> <span class="hljs-built_in">to</span> verify <span class="hljs-keyword">the</span> <span class="hljs-keyword">token</span></code></pre>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC704;&#xC758; &#xC0BD;&#xC785;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xBB38;&#xC790;&#xC5F4; &#x201C;key&#x201D;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#x201C;key&#x201D; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xBE44;&#xBC00; &#xD0A4;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD1A0;&#xD070;&#xC744; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
</li>
<li><p><strong>Header parameter manipulation:</strong> <code>KID</code>&#xC678;&#xC5D0;&#xB3C4; JSON &#xC6F9; &#xD1A0;&#xD070; &#xD45C;&#xC900;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0;&#xAC8C; URL&#xC744; &#xD1B5;&#xD574; &#xD0A4;&#xB97C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xB3C4; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>JKU header parameter: JKU&#xB294; &#x201C;JWK Set URL&#x201D;&#xC758; &#xC57D;&#xC790;&#xB85C; &#xD1A0;&#xD070;&#xAC80;&#xC99D;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD0A4; &#xC9D1;&#xD569;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; URL&#xC744; &#xBA85;&#xC2DC;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC120;&#xD0DD;&#xC801; &#xD5E4;&#xB354; &#xD544;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC790;&#xCCB4; &#xD0A4; &#xD30C;&#xC77C;&#xC744; &#xD638;&#xC2A4;&#xD305;&#xD558;&#xACE0; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB3C4;&#xB85D; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>JWK header parameter: JWK(JSON Web Key) &#xD5E4;&#xB354; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD0A4;&#xB97C; &#xD1A0;&#xD070;&#xC5D0; &#xC9C1;&#xC811; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>X5U, X5C URL manipulation: JKU &#xBC0F; JWK &#xD5E4;&#xB354;&#xC640; &#xC720;&#xC0AC;&#xD55C; X5U &#xBC0F; X5C &#xD5E4;&#xB354; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD1A0;&#xD070;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACF5;&#xAC1C; &#xD0A4; &#xC778;&#xC99D;&#xC11C; &#xB610;&#xB294; &#xC778;&#xC99D;&#xC11C; &#xCCB4;&#xC778;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
<li><p><strong>Other JWT security issues:</strong> &#xAD6C;&#xD604;&#xC774; &#xC798;&#xBABB; &#xB418;&#xC5C8;&#xC744;&#xB54C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xB2E4;&#xB978; JWT &#xBB38;&#xC81C;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>Information leak:</strong> JSON &#xC6F9; &#xD1A0;&#xD070;&#xC740; &#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xBBC0;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD1A0;&#xD070;&#xC774; &#xC554;&#xD638;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; &#xB204;&#xAD6C;&#xB098; base64URL&#xB85C; &#xD1A0;&#xD070;&#xC744; &#xB514;&#xCF54;&#xB529;&#xD558;&#xACE0; &#xD1A0;&#xD070;&#xC758; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD1A0;&#xD070;&#xC5D0; &#xBBFC;&#xAC10;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>Command injection:</strong> <code>KID</code> &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xAC00; &#xC548;&#xC804;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xD30C;&#xC77C; &#xC77D;&#xAE30; &#xC791;&#xC5C5;&#xC5D0; &#xC9C1;&#xC811; &#xC804;&#xB2EC;&#xB420; &#xB54C; &#xACF5;&#xACA9;&#xC790;&#xAC00; <code>KID</code> &#xD30C;&#xC77C; &#xC774;&#xB984; &#xB4A4;&#xC758; &#xC785;&#xB825;&#xC5D0; &#xBA85;&#xB839;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xC2DC;&#xC2A4;&#xD15C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
</ul>
<p>&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xB2E4; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.notion.so/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03">URL</a>&#xC5D0;&#xC11C; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/token/">token</a>
                  
                  <a class="hover-with-bg" href="/tags/web/">web</a>
                  
                  <a class="hover-with-bg" href="/tags/IN-0Hack/">IN'0Hack</a>
                  
                  <a class="hover-with-bg" href="/tags/JWT/">JWT</a>
                  
                  <a class="hover-with-bg" href="/tags/json/">json</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_IN&#39;0Hack.jpg" srcset="/img/loading.gif" alt="IN&#39;0Hack">
                  </div>

                  <div class="link-text">
                    <div class="link-title">IN'0Hack</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/IN&#39;0Hack">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/11/21/l0ch/segment-heap-part3/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Hip하게 Heap 정복하기 Part 3 - HITCON 2020 Michael's Storage</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/11/19/poosic/ISA/">
                    <span class="hidden-mobile">[해키피디아] ISA(Instruction Set Architecture)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/11/20/in0hack/2021-11-20/';
        this.page.identifier = '/2021/11/20/in0hack/2021-11-20/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] Hacking JSON Web Tokens (JWTs)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
