

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xBC14;&amp;#xB85C; &amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB300;-&amp;#xC120;&amp;#xBC30;&amp;#xB2D8;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAFC0;&amp;#xD301;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xB294; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB54C;&amp;#xB294; 2018&amp;#xB144;.. &amp;#xC544;&amp;#xC9C1; &amp;#xC0C8;&amp;#xB0B4;&amp;#xAE30; &amp;#xD2F0;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC;&amp;#xB798;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBA70; &amp;#xC62C;&amp;#xB824;&amp;#xC8FC;&amp;#xC2E0; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;..  &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC18C;&amp;#xAC1C;&amp;#xBD80;&amp;#xD130;, &amp;#xB300;&amp;#xC0C1; &amp;#xC120;&amp;#xC815;-&amp;#xBD84;&amp;#xC11D;-&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xAE4C;&amp;#xC9C0; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xB274;&amp;#xBE44;&amp;#xB3C4; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xCE5C;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC8E0;. (&amp;#xADF8;&amp;#xB550; &amp;#xBAB0;&amp;#xB790;&amp;#xC9C0; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB85C; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#x2026;..)&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xD2BC; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD5C8;&amp;#xB77D;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC62C;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xAE34; &amp;#xB9CC;&amp;#xD07C; &amp;#xB098;&amp;#xB204;&amp;#xC5B4;&amp;#xC11C; &amp;#xC62C;&amp;#xB9B4; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD5C8;&amp;#xB77D;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xC120;&amp;#xBC30;&amp;#xB2D8;&amp;#xAED8; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xC744; &amp;#xB4DC;&amp;#xB9AC;&amp;#xBA70; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xCC3D;&amp;#xD55C; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xD574;&amp;#xB3C4; &amp;#xB420;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC81C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC558;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD574; &amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xB300;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;? &amp;#xD0A4;&amp;#xC0AC; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#xC4F0;&amp;#xB294; &amp;#xD301;&amp;#xB3C4; &amp;#xC880; &amp;#xC368;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xADF8;&amp;#xB0E5; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC8C; &amp;#xB2F5;&amp;#xC778; &amp;#xAC70; &amp;#xAC19;&amp;#xC544; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBE7C;&amp;#xACE0; &amp;#xC598;&amp;#xAE30;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xB791; &amp;#xBB50; IOT&amp;#xAC00; &amp;#xB300;&amp;#xC138;&amp;#xC5EC;&amp;#xC11C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBC84;&amp;#xADF8; &amp;#xD5CC;&amp;#xD305;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xC2DC;&amp;#xB824;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; (&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xAC00; &amp;#xAC1C;&amp;#xAFC0;&amp;#xC784; &amp;#x3160;&amp;#x3160;)&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC740; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC9C0;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC804;&amp;#xC81C; &amp;#xD558;&amp;#xC5D0; &amp;#xC4F0;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6CC;&amp;#xAC8C;&amp;#xC784;&amp;#xB3C4; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC880; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC815;&amp;#xB3C4;&amp;#x2026;.? &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xC544;&amp;#xC608; &amp;#xC548; &amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;? &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC4F0;&amp;#xB824;&amp;#xACE0; &amp;#xB178;&amp;#xB825;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#x203B;-&amp;#xAE00;-&amp;#xC77D;&amp;#xC744;-&amp;#xB54C;-&amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D;-&amp;#x203B;&#34;&gt;&lt;a href=&#34;#&amp;#x203B;-&amp;#xAE00;-&amp;#xC77D;&amp;#xC744;-&amp;#xB54C;-&amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D;-&amp;#x203B;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#x203B; &amp;#xAE00; &amp;#xC77D;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D; &amp;#x203B;&#34;&gt;&lt;/a&gt;&amp;#x203B; &amp;#xAE00; &amp;#xC77D;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D; &amp;#x203B;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC740; &amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD639;&amp;#xC2DC; &amp;#xB354; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB098; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xC740; &amp;#xB313;&amp;#xAE00;&amp;#xC744; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xC81C; &amp;#xC758;&amp;#xC2DD;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xB534; &amp;#xB370;&amp;#xB85C; &amp;#xC0C8;&amp;#xAC70;&amp;#xB098; &amp;#xC624;&amp;#xD0C0;&amp;#xAC00; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xAC1C;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xD558;&amp;#xAC70;&amp;#xB098;&amp;#x2026;.&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC81C;&amp;#xAC00; &amp;#xD588;&amp;#xB358; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC368;&amp;#xB0BC; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xB3C4; &amp;#xC4F8; &amp;#xC0DD;&amp;#xAC01;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCC98;&amp;#xC74C; &amp;#xBCFC; &amp;#xB54C;&amp;#xBD80;&amp;#xD130; &amp;#xC9C1;&amp;#xC811; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC4F1; &amp;#xBCF4;&amp;#xACE0; &amp;#xB530;&amp;#xB77C; &amp;#xD574; &amp;#xBCF4;&amp;#xC2DC;&amp;#xB294; &amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xBB38;&amp;#xACFC;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xAC70;&amp;#xB2C8;&amp;#xC640; &amp;#xD559;&amp;#xCC3D; &amp;#xC2DC;&amp;#xC808;&amp;#xC758; &amp;#xC808;&amp;#xBC18; &amp;#xC774;&amp;#xC0C1;&amp;#xC744; &amp;#xC911;&amp;#xAD88;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB0C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD55C;&amp;#xCFF8;&amp;#xB9D0;&amp;#xC774; &amp;#xCD78;&amp;#xAE08; &amp;#xBD80;&amp;#xC871;&amp;#xD569;&amp;#xB2C8;&amp;#xB370;&amp;#xC2A4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBAA9;&amp;#xCC28;&#34;&gt;&lt;a href=&#34;#&amp;#xBAA9;&amp;#xCC28;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBAA9;&amp;#xCC28;&#34;&gt;&lt;/a&gt;&amp;#xBAA9;&amp;#xCC28;&lt;/h1&gt;&lt;h3 id=&#34;part-1&#34;&gt;&lt;a href=&#34;#part-1&#34; class=&#34;headerlink&#34; title=&#34;part 1&#34;&gt;&lt;/a&gt;part 1&lt;/h3&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&lt;/li&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/li&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&lt;/li&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;To-be-Continued&amp;#x2026;&#34;&gt;&lt;a href=&#34;#To-be-Continued&amp;#x2026;&#34; class=&#34;headerlink&#34; title=&#34;To be Continued&amp;#x2026;&#34;&gt;&lt;/a&gt;To be Continued&amp;#x2026;&lt;/h3&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; - KMPlayer&lt;/li&gt;
&lt;li&gt;From Crash to Exploit&lt;/li&gt;
&lt;li&gt;&amp;#xC7A1;&amp;#xB2F4;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&lt;/h1&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB098; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574; &amp;#xAE08;&amp;#xC804;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC0C1;, &amp;#xD574;&amp;#xCEE4;&amp;#xC758; &amp;#xBA85;&amp;#xC608; &amp;#xD68D;&amp;#xB4DD; &amp;#xB4F1; &amp;#xC774;&amp;#xB4DD;&amp;#xC744; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xD589;&amp;#xC704;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50; &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8;&amp;#xAE4C; &amp;#xACB0;&amp;#xAD6D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACE0; &amp;#xB3C8;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xB527;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#x3131;&amp;#x3147;&amp;#x3137;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xB0B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC810;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC911;&amp;#xC778; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xD639;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xBD88;&amp;#xBC95;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6F9; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC740; &amp;#xC880; &amp;#xD798;&amp;#xB4E4;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30;&amp;#xB85C;&amp;#xB294; &amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC78;&amp;#xB85C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/h1&gt;&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC81C;&amp;#xBCF4;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC81C;&amp;#xB3C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-&amp;#xAC01;-&amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4;-&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;a href=&#34;#1-&amp;#xAC01;-&amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4;-&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34; class=&#34;headerlink&#34; title=&#34;1) &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;/a&gt;1) &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/h2&gt;&lt;p&gt;&amp;#xC678;&amp;#xAD6D; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;(&amp;#xB2E4;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;)&amp;#xB9C8;&amp;#xB2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB4E4; &amp;#xC798; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xAE00;, &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81;, &amp;#xC560;&amp;#xD50C; &amp;#xB4F1;&amp;#xB4F1; &amp;#xC6EC;&amp;#xB9CC;&amp;#xD55C; &amp;#xC544;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC790;&amp;#xC0AC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC01;&amp;#xC790; &amp;#xC6B4;&amp;#xC601; &amp;#xB8F0;&amp;#xC740; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC5B4;&amp;#xB514;&amp;#xB294; &amp;#xC790;&amp;#xC0AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB9CC; &amp;#xBC1B;&amp;#xB294; &amp;#xACF3;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5B4;&amp;#xB514;&amp;#xB294; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#x2026; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xB527;&amp;#xB9CC; &amp;#xC8FC;&amp;#xACE0; &amp;#xB9AC;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB294; &amp;#xC5C6;&amp;#xB294;&amp;#x2026;. &amp;#xBB50; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC70;&amp;#xB294; &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bugcrowd.com/bug-bounty-list/&#34;&gt;https://www.bugcrowd.com/bug-bounty-list/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC2DC;&amp;#xBA74; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC758; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xC6B4;&amp;#xC601; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;2-&amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;-ZDI-&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0;-&amp;#xB4F1;&#34;&gt;&lt;a href=&#34;#2-&amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;-ZDI-&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0;-&amp;#xB4F1;&#34; class=&#34;headerlink&#34; title=&#34;2) &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;, ZDI, &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xB4F1;&#34;&gt;&lt;/a&gt;2) &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;, ZDI, &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xB4F1;&lt;/h2&gt;&lt;p&gt;&amp;#xD0C0; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xC81C;&amp;#xBCF4;&amp;#xBC1B;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC0C1;&amp;#xC774; &amp;#xC318; &amp;#xAC78;&amp;#xB85C; &amp;#xC720;&amp;#xBA85;&amp;#xD558;&amp;#xC8E0;. &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&amp;#xC758; &amp;#xBCF4;&amp;#xC0C1;&amp;#xAE08;&amp;#xC561;&amp;#xC744; &amp;#xD55C;&amp;#xBC88; &amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/07/l0ch/bughunting-tutorial/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xBD10;&amp;#xB3C4; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC138;&amp;#xC8E0;?? &amp;#x314E;&amp;#x3137;&amp;#x3137;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; $10,000 &amp;#xBA74; &amp;#xC9C0;&amp;#xAE08; &amp;#xD658;&amp;#xC728;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xCC9C;&amp;#xB9CC; &amp;#xC6D0;&amp;#xC774; &amp;#xB118;&amp;#xB124;&amp;#xC694;;;; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; &amp;#xC26C;&amp;#xC6B4; &amp;#xD0C0;&amp;#xAE43;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB4E4; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xD798;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&amp;#xACFC; ZDI &amp;#xC640;&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6F9; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC744; &amp;#xB4EF;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;3-KISA-S-W-&amp;#xC2E0;&amp;#xADDC;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xD3EC;&amp;#xC0C1;-&amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#3-KISA-S-W-&amp;#xC2E0;&amp;#xADDC;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xD3EC;&amp;#xC0C1;-&amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;3) KISA S/W &amp;#xC2E0;&amp;#xADDC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD3EC;&amp;#xC0C1; &amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34;&gt;&lt;/a&gt;3) KISA S/W &amp;#xC2E0;&amp;#xADDC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD3EC;&amp;#xC0C1; &amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6D;&amp;#xAC00;&amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB77C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xC5C6;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xD0A4;&amp;#xC0AC;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xC0BC;&amp;#xC131;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xBA87;&amp;#xBA87; &amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; &amp;#xAC78;&amp;#xB85C; &amp;#xAE30;&amp;#xC5B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0A4;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xAC00; &amp;#xC81C;&amp;#xC77C; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.(&amp;#xC560;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xB9CE;&amp;#xC774; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr&#34;&gt;https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xC2E0;&amp;#xACE0;&amp;#xC11C; &amp;#xC591;&amp;#xC2DD;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD574; &amp;#xC591;&amp;#xC2DD;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;2016&amp;#xB144;&amp;#xC5D0;&amp;#xB294; eip&amp;#xB9CC; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xC81C;&amp;#xBCF4;&amp;#xB97C; &amp;#xD574;&amp;#xB3C4; &amp;#xD3EC;&amp;#xC0C1;&amp;#xC744; &amp;#xC92C;&amp;#xB358; &amp;#xAC70; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xAF2D; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD3EC;&amp;#xC0C1;&amp;#xC744; &amp;#xC900;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xAE30;-&amp;#xC804;&amp;#xC5D0;&#34;&gt;&lt;a href=&#34;#&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xAE30;-&amp;#xC804;&amp;#xC5D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&#34;&gt;&lt;/a&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&lt;/h1&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xC54C;&amp;#xC544;&amp;#xB46C;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xC598;&amp;#xAE30;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; untrust input&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2A8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB4E0; &amp;#xAC04;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC870;&amp;#xC791;&amp;#xC5D0; &amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC775;&amp;#xC2A4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC5B4;&amp;#xB3C4; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xBABB; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; eip &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xBABB;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2192; &amp;#xC2E4;&amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC784;. &amp;#xC624;&amp;#xBC84; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC775;&amp;#xC2A4; &amp;#xBABB;&amp;#xD568;&amp;#x2026;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xB354; &amp;#xBCF4;&amp;#xAE30; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xC548; &amp;#xBD04;)&lt;/li&gt;
&lt;li&gt;&amp;#xB0A8;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xC81C;&amp;#xBCF4;&amp;#xB97C; &amp;#xD588;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C;&amp;#xBC14;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC775;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xBA3C;&amp;#xC800; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574;&amp;#xC11C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD55C; &amp;#xAC78; &amp;#xBAA8;&amp;#xB974;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xAC00; &amp;#xC2DC;&amp;#xAC04;&amp;#xB9CC; &amp;#xB0A0;&amp;#xB9AC;&amp;#xBA74; &amp;#xC5B5;&amp;#xC6B8;&amp;#xD558;&amp;#xC790;&amp;#xB098;&amp;#xC694; &amp;#x3160;&amp;#x3160; (&amp;#xC790;&amp;#xAE30; &amp;#xAEBC;&amp;#xB294; &amp;#xD328;&amp;#xCE58; &amp;#xC548;&amp;#xB420; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC138;&amp;#xC694;&amp;#x2026; &amp;#xD328;&amp;#xCE58;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74; &amp;#xC0B6;&amp;#xC758; &amp;#xC758;&amp;#xC695;&amp;#xC774; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#x3160;&amp;#x3160;)&lt;/li&gt;
&lt;li&gt;&amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xB294; &amp;#xC678;&amp;#xAD6D; &amp;#xC720;&amp;#xBA85; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC544; &amp;#xBB3C;&amp;#xB860; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0;&amp;#xC694;. &amp;#xD55C;&amp;#xAE00; &amp;#xAC19;&amp;#xC774;&amp;#x2026;.? &amp;#x3160;&amp;#x3160; &amp;#xBCF4;&amp;#xC548;&amp;#xBAA8;&amp;#xB4C8; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xB294; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBD88;&amp;#xC548;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#x201C;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC5B4;&amp;#xCA4C;&amp;#xC9C0;?&amp;#x201D;&amp;#xC778;&amp;#xB370; &amp;#xBCF4;&amp;#xD1B5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC774; &amp;#xC61B;&amp;#xB0A0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xC4F0;&amp;#xAC70;&amp;#xB098; &amp;#xCC98;&amp;#xC74C; &amp;#xC124;&amp;#xACC4;&amp;#xD560; &amp;#xB54C; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC544;&amp;#xB9C8;&amp;#xB3C4;&amp;#x2026;?)&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; : &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB514; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC838; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC798;&amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACA0;&amp;#xC8E0;.&lt;/li&gt;
&lt;li&gt;&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; : &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; eip&amp;#xB97C; &amp;#xC7A1;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; corelan&amp;#xC758; &lt;a href=&#34;https://www.corelan.be/index.php/category/security/exploit-writing-tutorials/&#34;&gt;windows exploitation tutorial&lt;/a&gt;&amp;#xB9CC; &amp;#xC77D;&amp;#xC5B4;&amp;#xB3C4; &amp;#xCDA9;&amp;#xBD84;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740;? &amp;#xC800;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD574;&amp;#xBCF8; &amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC7A5;&amp;#xB2F4;&amp;#xC740; &amp;#xBABB;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;)&lt;/li&gt;
&lt;li&gt;&amp;#xAC1C;&amp;#xBC1C; &amp;#xB2A5;&amp;#xB825; : &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBC1C; &amp;#xB2A5;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC880; &amp;#xB354; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBE68;&amp;#xB9AC; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xBABB;&amp;#xD558;&amp;#xB098; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4; &amp;#x315C;&amp;#x3160; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC740; &amp;#xB610; &amp;#xC5B8;&amp;#xC81C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xC9C0;&amp;#x2026;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&lt;/li&gt;
&lt;li&gt;&amp;#xC190; &amp;#xD37C;&amp;#xC9D5;&lt;/li&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;?? &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xC74C; &amp;#xD5E5;&amp;#xC2A4;&amp;#xB808;&amp;#xC774; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB418;&amp;#xB824;&amp;#xB098;&amp;#xC694;? &amp;#xBB50; &amp;#xADF8;&amp;#xB0E5; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB450;&amp;#xB8E8;&amp;#xB450;&amp;#xB8E8; &amp;#xB9D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC190;&amp;#xD37C;&amp;#xC9D5; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xC81C;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xBC29;&amp;#xBC95;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB178;&amp;#xAC00;&amp;#xB2E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Untrust input&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC190;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Untrust input &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC77C; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBB54;&amp;#xAC00; &amp;#xC774; &amp;#xC704;&amp;#xCE58;&amp;#xB294; &amp;#xBB34;&amp;#xC2A8; &amp;#xC5ED;&amp;#xD560;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC880; &amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC544;&amp;#xB9C8;? &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xC0BD;&amp;#xC9C8;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;). &amp;#xBB3C;&amp;#xB860; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xB2E8;&amp;#xC21C;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xC774;&amp;#xAE30;&amp;#xB294; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xBB38;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC55E;&amp;#xC5D0; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC774;&amp;#xAC8C; &amp;#xB300;&amp;#xCDA9; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xD3F0;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC54C;&amp;#xAC70;&amp;#xB098; &amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB192;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC790;&amp;#xAE30;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xCE21;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xD3B8;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB4E4;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xBA74; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xC774;&amp;#xAC8C; &amp;#xBB58; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xADF8;&amp;#xB0E5; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD560;&amp;#xAC70; &amp;#xBCF4;&amp;#xD1B5; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC8E0;. &amp;#xC800;&amp;#xB3C4; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC9DC;&amp;#xB3C4; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xBB34;&amp;#xB8CC; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#x314E;&amp;#x314E; &amp;#xAC1C;&amp;#xC774;&amp;#xB4DD; BFF, Peach, AFL &amp;#xB610; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0;&amp;#x2026; &amp;#xBB50; &amp;#xC788;&amp;#xC5C8;&amp;#xB354;&amp;#xB77C;&amp;#x2026; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC798; &amp;#xC548; &amp;#xB098;&amp;#xB294;&amp;#xB370; &amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC800;&amp;#xB294; BFF&amp;#xB97C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. BFF&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.cert.org/vulnerability-analysis/tools/bff.cfm&#34;&gt;https://www.cert.org/vulnerability-analysis/tools/bff.cfm&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774;&amp;#xB984;&amp;#xC740; FOE &amp;#xC600;&amp;#xB294;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; BFF&amp;#xB85C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xB180;&amp;#xB780; &amp;#xAC8C; &amp;#xC6D0;&amp;#xB798; FOE&amp;#xAC00; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB9CC; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xB9E5;&amp;#xC774;&amp;#xB791; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAC8C; &amp;#xB410;&amp;#xB124;&amp;#xC694;!! &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9E5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC1C; &amp;#xB3CC;&amp;#xB824;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xBB54;&amp;#xAC00; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xD130;&amp;#xC9C0;&amp;#xB294; &amp;#xC774; &amp;#xB290;&amp;#xB08C;&amp;#xC801;&amp;#xC778; &amp;#xB290;&amp;#xB08C;&amp;#x2026; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB9E5; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xB3C4; &amp;#xD574;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD2BC; BFF &amp;#xB4F1; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xB2C8; &amp;#xC2A4;&amp;#xD0B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD0C0;&amp;#xAE43;-&amp;#xC120;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#&amp;#xD0C0;&amp;#xAE43;-&amp;#xC120;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&#34;&gt;&lt;/a&gt;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;&amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!! &amp;#xC65C;&amp;#xB0D0;!!! &amp;#xD3EC;&amp;#xC0C1; &amp;#xAE08;&amp;#xC561;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;!!! &amp;#xADF8;&amp;#xB7FC; &amp;#xBA85;&amp;#xC608;&amp;#xC758; &amp;#xC804;&amp;#xB2F9; &amp;#xC21C;&amp;#xC704;&amp;#xAC00; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC774; &amp;#xBCC4;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;!!!!(&amp;#xBB50; &amp;#xB531;&amp;#xD788; &amp;#xC0C1;&amp;#xAD00;&amp;#xC740; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;) &amp;#xC554;&amp;#xD2BC; &amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8; &amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB09C; &amp;#xB3C8;&amp;#xC744; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;!!!! or &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xB9DB;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;ul&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC27D;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; &amp;#xAC70; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC5BC;&amp;#xB8E8; &amp;#xADF8;&amp;#xB0E5; &amp;#xB0A0;&amp;#xB85C; &amp;#xBA39;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3C8; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC880; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xBCA4;&amp;#xB354; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xAE4C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC78;&amp;#xB85C;&amp;#x2026; &amp;#xC798; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC740;&amp;#xADFC;&amp;#xD788; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0; Rebase, ASLR &amp;#xC548; &amp;#xAC78;&amp;#xB824; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB3C4; &amp;#xBD24;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB09C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xACFC; &amp;#xBA85;&amp;#xC608;&amp;#xB97C; &amp;#xC5BB;&amp;#xACA0;&amp;#xB2E4;!!!&lt;ul&gt;
&lt;li&gt;CVE&amp;#xAC00; &amp;#xB098;&amp;#xC62C;&amp;#xB9CC;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00;&amp;#x2026;. (&amp;#xC544; &amp;#xADFC;&amp;#xB370; &amp;#xC65C; &amp;#xC694;&amp;#xC0C8; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCEE4;&amp;#xB110; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C4; &amp;#xB290;&amp;#xB08C;&amp;#xC774;&amp;#xC9C0; &amp;#xB0B4;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xD558;&amp;#xB124; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCEE4;&amp;#xB110; &amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC148;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB098;&amp;#xBA38;&amp;#xC9C4; &amp;#xBB50;&amp;#xB0D0;!!!!&lt;ul&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&amp;#x2026;. &amp;#xC2EC;&amp;#xC2EC;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xC608;&amp;#xC694;&amp;#x2026;&amp;#x2026;.;;;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC7A5;&amp;#xB09C;&amp;#xC774;&amp;#xACE0; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC74C; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xB0B4;&amp;#xAC00; &amp;#xC544;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;?? &amp;#x3134;&amp;#x3134; &amp;#xADF8;&amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://software.naver.com/main.nhn&#34;&gt;http://software.naver.com/main.nhn&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC790;&amp;#xB8CC;&amp;#xC2E4;&amp;#xC744; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xAE09;&amp;#xB3C4;&amp;#xB098; &amp;#xC774;&amp;#xB7F0; &amp;#xAC74; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC218;&amp;#xCE58;&amp;#xB85C;&amp;#xB294; &amp;#xC548; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xCE21;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC8E0; &amp;#x314B;&amp;#x314B; &amp;#xC778;&amp;#xAE30; &amp;#xB9CE;&amp;#xC740; &amp;#xAC8C; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC70;&amp;#xACA0;&amp;#xC8E0;?? &amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC73C;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB4DC;-&amp;#xD30C;&amp;#xC77C;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB4DC;-&amp;#xD30C;&amp;#xC77C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/h1&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB123;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD0C0;&amp;#xAE43; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC74C;&amp;#xC545;&amp;#xC774;&amp;#xB098; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7;&amp;#xB9CC; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;(&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0;&amp;#xB294; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xB098; &amp;#xC555;&amp;#xCD95; &amp;#xBC29;&amp;#xC2DD;, &amp;#xC6B4;&amp;#xC601;&amp;#xBC29;&amp;#xC2DD; &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC880; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xB9CE;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xC88B;&amp;#xC8E0;), &amp;#xC6CC;&amp;#xB4DC;&amp;#xB098; &amp;#xD55C;&amp;#xAE00; &amp;#xAC19;&amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#xB9C9; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560; &amp;#xB54C; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xD558;&amp;#xAE30; &amp;#xC77C;&amp;#xC464;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xB2E4; &amp;#xC2F6;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xC77C; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xC548;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD0C0;&amp;#xAE43;&amp;#xC774; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560; &amp;#xB54C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD568;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAC70;&amp;#xB294; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB610; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADC0;&amp;#xCC2E;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00; &amp;#xAC80;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Filetype&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3EC;&amp;#xB9F7; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xBCF4;&amp;#xD588;&amp;#xB358; &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; KMPlayer&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]   Part 1 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xD2B9;&amp;#xBCC4;&amp;#xD55C; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xBD24;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xBC14;&amp;#xB85C; &amp;#xB300;&amp;#xD559;&amp;#xAD50; &amp;#xB3D9;&amp;#xC544;&amp;#xB9AC; &amp;#xB300;-&amp;#xC120;&amp;#xBC30;&amp;#xB2D8;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAFC0;&amp;#xD301;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xB294; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB54C;&amp;#xB294; 2018&amp;#xB144;.. &amp;#xC544;&amp;#xC9C1; &amp;#xC0C8;&amp;#xB0B4;&amp;#xAE30; &amp;#xD2F0;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C; &amp;#xC800;&amp;#xC5D0;&amp;#xAC8C;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC;&amp;#xB798;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB77C;&amp;#xBA70; &amp;#xC62C;&amp;#xB824;&amp;#xC8FC;&amp;#xC2E0; &amp;#xAE00;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;..  &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC18C;&amp;#xAC1C;&amp;#xBD80;&amp;#xD130;, &amp;#xB300;&amp;#xC0C1; &amp;#xC120;&amp;#xC815;-&amp;#xBD84;&amp;#xC11D;-&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xAE4C;&amp;#xC9C0; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xB274;&amp;#xBE44;&amp;#xB3C4; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xCE5C;&amp;#xC808;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xBA85;&amp;#xC774; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC8E0;. (&amp;#xADF8;&amp;#xB550; &amp;#xBAB0;&amp;#xB790;&amp;#xC9C0; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB85C; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xAC8C; &amp;#xB420;&amp;#xC9C0;&amp;#x2026;..)&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xD2BC; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD5C8;&amp;#xB77D;&amp;#xC744; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC62C;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xAC00; &amp;#xAE34; &amp;#xB9CC;&amp;#xD07C; &amp;#xB098;&amp;#xB204;&amp;#xC5B4;&amp;#xC11C; &amp;#xC62C;&amp;#xB9B4; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xC2DC;&amp;#xB97C; &amp;#xD5C8;&amp;#xB77D;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0; &amp;#xC120;&amp;#xBC30;&amp;#xB2D8;&amp;#xAED8; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xAC10;&amp;#xC0AC;&amp;#xC758; &amp;#xB9D0;&amp;#xC500;&amp;#xC744; &amp;#xB4DC;&amp;#xB9AC;&amp;#xBA70; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;hr&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xCC3D;&amp;#xD55C; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xD574;&amp;#xB3C4; &amp;#xB420;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC81C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC558;&amp;#xB358; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD574; &amp;#xBCF4;&amp;#xACE0;&amp;#xC790; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xB300;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xADF8;&amp;#xB0E5; &amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;? &amp;#xD0A4;&amp;#xC0AC; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C; &amp;#xC4F0;&amp;#xB294; &amp;#xD301;&amp;#xB3C4; &amp;#xC880; &amp;#xC368;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; &amp;#xADF8;&amp;#xB0E5; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC8C; &amp;#xB2F5;&amp;#xC778; &amp;#xAC70; &amp;#xAC19;&amp;#xC544; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBE7C;&amp;#xACE0; &amp;#xC598;&amp;#xAE30;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xB791; &amp;#xBB50; IOT&amp;#xAC00; &amp;#xB300;&amp;#xC138;&amp;#xC5EC;&amp;#xC11C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBC84;&amp;#xADF8; &amp;#xD5CC;&amp;#xD305;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xC2DC;&amp;#xB824;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xAED8; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; (&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xACF5;&amp;#xC720;&amp;#xAE30;&amp;#xAC00; &amp;#xAC1C;&amp;#xAFC0;&amp;#xC784; &amp;#x3160;&amp;#x3160;)&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC740; &amp;#xC77D;&amp;#xC73C;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xD0B9;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC9C0;&amp;#xC2DD;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC804;&amp;#xC81C; &amp;#xD558;&amp;#xC5D0; &amp;#xC4F0;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6CC;&amp;#xAC8C;&amp;#xC784;&amp;#xB3C4; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xACE0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xC880; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC815;&amp;#xB3C4;&amp;#x2026;.? &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xC544;&amp;#xC608; &amp;#xC548; &amp;#xD574;&amp;#xBCF4;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;? &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xC4F0;&amp;#xB824;&amp;#xACE0; &amp;#xB178;&amp;#xB825;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#x203B;-&amp;#xAE00;-&amp;#xC77D;&amp;#xC744;-&amp;#xB54C;-&amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D;-&amp;#x203B;&#34;&gt;&lt;a href=&#34;#&amp;#x203B;-&amp;#xAE00;-&amp;#xC77D;&amp;#xC744;-&amp;#xB54C;-&amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D;-&amp;#x203B;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#x203B; &amp;#xAE00; &amp;#xC77D;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D; &amp;#x203B;&#34;&gt;&lt;/a&gt;&amp;#x203B; &amp;#xAE00; &amp;#xC77D;&amp;#xC744; &amp;#xB54C; &amp;#xC8FC;&amp;#xC758;&amp;#xC0AC;&amp;#xD56D; &amp;#x203B;&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC740; &amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD639;&amp;#xC2DC; &amp;#xB354; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB098; &amp;#xC544;&amp;#xC774;&amp;#xB514;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xC740; &amp;#xB313;&amp;#xAE00;&amp;#xC744; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xAC10;&amp;#xC0AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774; &amp;#xAE00;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC740; &amp;#xC81C; &amp;#xC758;&amp;#xC2DD;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC911;&amp;#xAC04;&amp;#xC5D0; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xAC00; &amp;#xB534; &amp;#xB370;&amp;#xB85C; &amp;#xC0C8;&amp;#xAC70;&amp;#xB098; &amp;#xC624;&amp;#xD0C0;&amp;#xAC00; &amp;#xC788;&amp;#xAC70;&amp;#xB098; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xAC1C;&amp;#xC18C;&amp;#xB9AC;&amp;#xB97C; &amp;#xD558;&amp;#xAC70;&amp;#xB098;&amp;#x2026;.&lt;/li&gt;
&lt;li&gt;&amp;#xCD5C;&amp;#xB300;&amp;#xD55C; &amp;#xC81C;&amp;#xAC00; &amp;#xD588;&amp;#xB358; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC368;&amp;#xB0BC; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xB3C4; &amp;#xC4F8; &amp;#xC0DD;&amp;#xAC01;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCC98;&amp;#xC74C; &amp;#xBCFC; &amp;#xB54C;&amp;#xBD80;&amp;#xD130; &amp;#xC9C1;&amp;#xC811; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xAE30;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xD55C; &amp;#xBC88; &amp;#xC4F1; &amp;#xBCF4;&amp;#xACE0; &amp;#xB530;&amp;#xB77C; &amp;#xD574; &amp;#xBCF4;&amp;#xC2DC;&amp;#xB294; &amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;&lt;/li&gt;
&lt;li&gt;&amp;#xC81C;&amp;#xAC00; &amp;#xBB38;&amp;#xACFC;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xAC70;&amp;#xB2C8;&amp;#xC640; &amp;#xD559;&amp;#xCC3D; &amp;#xC2DC;&amp;#xC808;&amp;#xC758; &amp;#xC808;&amp;#xBC18; &amp;#xC774;&amp;#xC0C1;&amp;#xC744; &amp;#xC911;&amp;#xAD88;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xB0C8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD55C;&amp;#xCFF8;&amp;#xB9D0;&amp;#xC774; &amp;#xCD78;&amp;#xAE08; &amp;#xBD80;&amp;#xC871;&amp;#xD569;&amp;#xB2C8;&amp;#xB370;&amp;#xC2A4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBAA9;&amp;#xCC28;&#34;&gt;&lt;a href=&#34;#&amp;#xBAA9;&amp;#xCC28;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBAA9;&amp;#xCC28;&#34;&gt;&lt;/a&gt;&amp;#xBAA9;&amp;#xCC28;&lt;/h1&gt;&lt;h3 id=&#34;part-1&#34;&gt;&lt;a href=&#34;#part-1&#34; class=&#34;headerlink&#34; title=&#34;part 1&#34;&gt;&lt;/a&gt;part 1&lt;/h3&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&lt;/li&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/li&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&lt;/li&gt;
&lt;li&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;To-be-Continued&amp;#x2026;&#34;&gt;&lt;a href=&#34;#To-be-Continued&amp;#x2026;&#34; class=&#34;headerlink&#34; title=&#34;To be Continued&amp;#x2026;&#34;&gt;&lt;/a&gt;To be Continued&amp;#x2026;&lt;/h3&gt;&lt;ol&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; - KMPlayer&lt;/li&gt;
&lt;li&gt;From Crash to Exploit&lt;/li&gt;
&lt;li&gt;&amp;#xC7A1;&amp;#xB2F4;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC774;&amp;#xB780;?&lt;/h1&gt;&lt;p&gt;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB098; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB4F1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574; &amp;#xAE08;&amp;#xC804;&amp;#xC801;&amp;#xC778; &amp;#xBCF4;&amp;#xC0C1;, &amp;#xD574;&amp;#xCEE4;&amp;#xC758; &amp;#xBA85;&amp;#xC608; &amp;#xD68D;&amp;#xB4DD; &amp;#xB4F1; &amp;#xC774;&amp;#xB4DD;&amp;#xC744; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xD589;&amp;#xC704;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50; &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8;&amp;#xAE4C; &amp;#xACB0;&amp;#xAD6D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC2E0;&amp;#xB098;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACE0; &amp;#xB3C8;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xB527;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#x3131;&amp;#x3147;&amp;#x3137;&lt;/p&gt;
&lt;p&gt;&amp;#xAD6D;&amp;#xB0B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xC810;&amp;#xC740; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC911;&amp;#xC778; &amp;#xC6F9; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8; &amp;#xD639;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xBD88;&amp;#xBC95;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC6F9; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC740; &amp;#xC880; &amp;#xD798;&amp;#xB4E4;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C;&amp;#xAC00; &amp;#xC54C;&amp;#xAE30;&amp;#xB85C;&amp;#xB294; &amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC78;&amp;#xB85C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;a href=&#34;#&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;/a&gt;&amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/h1&gt;&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC81C;&amp;#xBCF4;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC81C;&amp;#xB3C4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;1-&amp;#xAC01;-&amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4;-&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;a href=&#34;#1-&amp;#xAC01;-&amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4;-&amp;#xBC84;&amp;#xADF8;-&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34; class=&#34;headerlink&#34; title=&#34;1) &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&#34;&gt;&lt;/a&gt;1) &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xBCC4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&lt;/h2&gt;&lt;p&gt;&amp;#xC678;&amp;#xAD6D; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;(&amp;#xB2E4;&amp;#xB294; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;)&amp;#xB9C8;&amp;#xB2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E4;&amp;#xB4E4; &amp;#xC798; &amp;#xC544;&amp;#xC2DC;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xAE00;, &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81;, &amp;#xC560;&amp;#xD50C; &amp;#xB4F1;&amp;#xB4F1; &amp;#xC6EC;&amp;#xB9CC;&amp;#xD55C; &amp;#xC544;&amp;#xB294; &amp;#xAE30;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC740; &amp;#xB2E4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xC790;&amp;#xC0AC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC01;&amp;#xC790; &amp;#xC6B4;&amp;#xC601; &amp;#xB8F0;&amp;#xC740; &amp;#xC870;&amp;#xAE08;&amp;#xC529; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC5B4;&amp;#xB514;&amp;#xB294; &amp;#xC790;&amp;#xC0AC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xB9CC; &amp;#xBC1B;&amp;#xB294; &amp;#xACF3;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5B4;&amp;#xB514;&amp;#xB294; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#x2026; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xD06C;&amp;#xB798;&amp;#xB527;&amp;#xB9CC; &amp;#xC8FC;&amp;#xACE0; &amp;#xB9AC;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB294; &amp;#xC5C6;&amp;#xB294;&amp;#x2026;. &amp;#xBB50; &amp;#xADF8;&amp;#xB7F0; &amp;#xAC70;&amp;#xB294; &amp;#xAC01; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.bugcrowd.com/bug-bounty-list/&#34;&gt;https://www.bugcrowd.com/bug-bounty-list/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC2DC;&amp;#xBA74; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD68C;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC758; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xC6B4;&amp;#xC601; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;h2 id=&#34;2-&amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;-ZDI-&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0;-&amp;#xB4F1;&#34;&gt;&lt;a href=&#34;#2-&amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;-ZDI-&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0;-&amp;#xB4F1;&#34; class=&#34;headerlink&#34; title=&#34;2) &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;, ZDI, &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xB4F1;&#34;&gt;&lt;/a&gt;2) &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;, ZDI, &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xB4F1;&lt;/h2&gt;&lt;p&gt;&amp;#xD0C0; &amp;#xD68C;&amp;#xC0AC;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB3C4; &amp;#xC81C;&amp;#xBCF4;&amp;#xBC1B;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xC0C1;&amp;#xC774; &amp;#xC318; &amp;#xAC78;&amp;#xB85C; &amp;#xC720;&amp;#xBA85;&amp;#xD558;&amp;#xC8E0;. &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&amp;#xC758; &amp;#xBCF4;&amp;#xC0C1;&amp;#xAE08;&amp;#xC561;&amp;#xC744; &amp;#xD55C;&amp;#xBC88; &amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/03/07/l0ch/bughunting-tutorial/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98; : &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xBD10;&amp;#xB3C4; &amp;#xC0C1;&amp;#xB2F9;&amp;#xD788; &amp;#xC138;&amp;#xC8E0;?? &amp;#x314E;&amp;#x3137;&amp;#x3137;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; $10,000 &amp;#xBA74; &amp;#xC9C0;&amp;#xAE08; &amp;#xD658;&amp;#xC728;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xCC9C;&amp;#xB9CC; &amp;#xC6D0;&amp;#xC774; &amp;#xB118;&amp;#xB124;&amp;#xC694;;;; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xADF8;&amp;#xB9CC;&amp;#xD07C; &amp;#xC26C;&amp;#xC6B4; &amp;#xD0C0;&amp;#xAE43;&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xB4E4; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC11C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xD798;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0;&amp;#xB294; &amp;#xC81C;&amp;#xB85C;&amp;#xB514;&amp;#xC6C0;&amp;#xACFC; ZDI &amp;#xC640;&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC6F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6F9; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xC544;&amp;#xC26C;&amp;#xC6B4; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xD574;&amp;#xCEE4;&amp;#xC6D0; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC744; &amp;#xB4EF;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;3-KISA-S-W-&amp;#xC2E0;&amp;#xADDC;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xD3EC;&amp;#xC0C1;-&amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#3-KISA-S-W-&amp;#xC2E0;&amp;#xADDC;-&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;-&amp;#xD3EC;&amp;#xC0C1;-&amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;3) KISA S/W &amp;#xC2E0;&amp;#xADDC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD3EC;&amp;#xC0C1; &amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&#34;&gt;&lt;/a&gt;3) KISA S/W &amp;#xC2E0;&amp;#xADDC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD3EC;&amp;#xC0C1; &amp;#xC2E0;&amp;#xACE0;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C; &amp;#xAD6D;&amp;#xAC00;&amp;#xAE30;&amp;#xAD00;&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB77C;&amp;#xACE0; &amp;#xBC1C;&amp;#xD45C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB358; &amp;#xAC8C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;) &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xC5C6;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC774;&amp;#xAE30;&amp;#xB3C4; &amp;#xD558;&amp;#xC8E0; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xD0A4;&amp;#xC0AC;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0; &amp;#xC0BC;&amp;#xC131;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xBA87;&amp;#xBA87; &amp;#xD68C;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xB97C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB300;&amp;#xC0C1;&amp;#xC774; &amp;#xC81C;&amp;#xD55C;&amp;#xC801;&amp;#xC778; &amp;#xAC78;&amp;#xB85C; &amp;#xAE30;&amp;#xC5B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC800;&amp;#xB294; &amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD0A4;&amp;#xC0AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xBC84;&amp;#xADF8; &amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xAC00; &amp;#xC81C;&amp;#xC77C; &amp;#xAD1C;&amp;#xCC2E;&amp;#xC740; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.(&amp;#xC560;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E; &amp;#xB9CE;&amp;#xC774; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026;)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr&#34;&gt;https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB9C1;&amp;#xD06C;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; &amp;#xC2E0;&amp;#xACE0;&amp;#xC11C; &amp;#xC591;&amp;#xC2DD;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD574; &amp;#xC591;&amp;#xC2DD;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC27D;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;2016&amp;#xB144;&amp;#xC5D0;&amp;#xB294; eip&amp;#xB9CC; &amp;#xBC14;&amp;#xAFD4;&amp;#xC11C; &amp;#xC81C;&amp;#xBCF4;&amp;#xB97C; &amp;#xD574;&amp;#xB3C4; &amp;#xD3EC;&amp;#xC0C1;&amp;#xC744; &amp;#xC92C;&amp;#xB358; &amp;#xAC70; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xAF2D; &amp;#xD480; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD3EC;&amp;#xC0C1;&amp;#xC744; &amp;#xC900;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xAE30;-&amp;#xC804;&amp;#xC5D0;&#34;&gt;&lt;a href=&#34;#&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xAE30;-&amp;#xC804;&amp;#xC5D0;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&#34;&gt;&lt;/a&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0;&lt;/h1&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBA3C;&amp;#xC800; &amp;#xC54C;&amp;#xC544;&amp;#xB46C;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xC598;&amp;#xAE30;&amp;#xD574;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; untrust input&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC2A8; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB4E0; &amp;#xAC04;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC870;&amp;#xC791;&amp;#xC5D0; &amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC775;&amp;#xC2A4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC5B4;&amp;#xB3C4; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xBABB; &amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; eip &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xB97C; &amp;#xBABB;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x2192; &amp;#xC2E4;&amp;#xC81C; &amp;#xACBD;&amp;#xD5D8;&amp;#xC784;. &amp;#xC624;&amp;#xBC84; &amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC775;&amp;#xC2A4; &amp;#xBABB;&amp;#xD568;&amp;#x2026;(&amp;#xC0AC;&amp;#xC2E4; &amp;#xB354; &amp;#xBCF4;&amp;#xAE30; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xC11C; &amp;#xC548; &amp;#xBD04;)&lt;/li&gt;
&lt;li&gt;&amp;#xB0A8;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xC81C;&amp;#xBCF4;&amp;#xB97C; &amp;#xD588;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C;&amp;#xBC14;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC775;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xBA3C;&amp;#xC800; &amp;#xC81C;&amp;#xBCF4;&amp;#xD574;&amp;#xC11C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD55C; &amp;#xAC78; &amp;#xBAA8;&amp;#xB974;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xAC00; &amp;#xC2DC;&amp;#xAC04;&amp;#xB9CC; &amp;#xB0A0;&amp;#xB9AC;&amp;#xBA74; &amp;#xC5B5;&amp;#xC6B8;&amp;#xD558;&amp;#xC790;&amp;#xB098;&amp;#xC694; &amp;#x3160;&amp;#x3160; (&amp;#xC790;&amp;#xAE30; &amp;#xAEBC;&amp;#xB294; &amp;#xD328;&amp;#xCE58; &amp;#xC548;&amp;#xB420; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC138;&amp;#xC694;&amp;#x2026; &amp;#xD328;&amp;#xCE58;&amp;#xB2F9;&amp;#xD558;&amp;#xBA74; &amp;#xC0B6;&amp;#xC758; &amp;#xC758;&amp;#xC695;&amp;#xC774; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#x3160;&amp;#x3160;)&lt;/li&gt;
&lt;li&gt;&amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xB294; &amp;#xC678;&amp;#xAD6D; &amp;#xC720;&amp;#xBA85; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xD3B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC544; &amp;#xBB3C;&amp;#xB860; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xACE0;&amp;#xC694;. &amp;#xD55C;&amp;#xAE00; &amp;#xAC19;&amp;#xC774;&amp;#x2026;.? &amp;#x3160;&amp;#x3160; &amp;#xBCF4;&amp;#xC548;&amp;#xBAA8;&amp;#xB4C8; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xB294; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBD88;&amp;#xC548;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#x201C;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC5B4;&amp;#xCA4C;&amp;#xC9C0;?&amp;#x201D;&amp;#xC778;&amp;#xB370; &amp;#xBCF4;&amp;#xD1B5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC774; &amp;#xC61B;&amp;#xB0A0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC744; &amp;#xC4F0;&amp;#xAC70;&amp;#xB098; &amp;#xCC98;&amp;#xC74C; &amp;#xC124;&amp;#xACC4;&amp;#xD560; &amp;#xB54C; &amp;#xBCF4;&amp;#xC548;&amp;#xC5D0; &amp;#xC2E0;&amp;#xACBD; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC544;&amp;#xB9C8;&amp;#xB3C4;&amp;#x2026;?)&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; : &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB514; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC838; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC798;&amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xB354; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xACA0;&amp;#xC8E0;.&lt;/li&gt;
&lt;li&gt;&amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; : &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; eip&amp;#xB97C; &amp;#xC7A1;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC775;&amp;#xC2A4; &amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; corelan&amp;#xC758; &lt;a href=&#34;https://www.corelan.be/index.php/category/security/exploit-writing-tutorials/&#34;&gt;windows exploitation tutorial&lt;/a&gt;&amp;#xB9CC; &amp;#xC77D;&amp;#xC5B4;&amp;#xB3C4; &amp;#xCDA9;&amp;#xBD84;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC740;? &amp;#xC800;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xD574;&amp;#xBCF8; &amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xC7A5;&amp;#xB2F4;&amp;#xC740; &amp;#xBABB;&amp;#xD558;&amp;#xACA0;&amp;#xB124;&amp;#xC694;)&lt;/li&gt;
&lt;li&gt;&amp;#xAC1C;&amp;#xBC1C; &amp;#xB2A5;&amp;#xB825; : &amp;#xAC00;&amp;#xC7A5; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBC1C; &amp;#xB2A5;&amp;#xB825;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC880; &amp;#xB354; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xBE68;&amp;#xB9AC; &amp;#xD30C;&amp;#xC545;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC800;&amp;#xB294; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xBABB;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xD0B9;&amp;#xC744; &amp;#xBABB;&amp;#xD558;&amp;#xB098; &amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4; &amp;#x315C;&amp;#x3160; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC740; &amp;#xB610; &amp;#xC5B8;&amp;#xC81C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xC9C0;&amp;#x2026;&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744;-&amp;#xCC3E;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&lt;/li&gt;
&lt;li&gt;&amp;#xC190; &amp;#xD37C;&amp;#xC9D5;&lt;/li&gt;
&lt;li&gt;&amp;#xD37C;&amp;#xC9D5;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC624;&amp;#xB514;&amp;#xD305;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;?? &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xB294; &amp;#xAC70;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xC74C; &amp;#xD5E5;&amp;#xC2A4;&amp;#xB808;&amp;#xC774; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xB418;&amp;#xB824;&amp;#xB098;&amp;#xC694;? &amp;#xBB50; &amp;#xADF8;&amp;#xB0E5; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB450;&amp;#xB8E8;&amp;#xB450;&amp;#xB8E8; &amp;#xB9D0;&amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC190;&amp;#xD37C;&amp;#xC9D5; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &amp;#xC81C;&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB358; &amp;#xBC29;&amp;#xBC95;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &amp;#xADF8;&amp;#xB0E5; &amp;#xB178;&amp;#xAC00;&amp;#xB2E4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Untrust input&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC190;&amp;#xC73C;&amp;#xB85C; &amp;#xB123;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Untrust input &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC77C; &amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xBB54;&amp;#xAC00; &amp;#xC774; &amp;#xC704;&amp;#xCE58;&amp;#xB294; &amp;#xBB34;&amp;#xC2A8; &amp;#xC5ED;&amp;#xD560;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB290;&amp;#xB08C;&amp;#xC774; &amp;#xC880; &amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xC544;&amp;#xB9C8;? &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xB3C4; &amp;#xAC19;&amp;#xC774; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC880; &amp;#xB9CE;&amp;#xC774; &amp;#xC0BD;&amp;#xC9C8;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;). &amp;#xBB3C;&amp;#xB860; &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774; &amp;#xB2E8;&amp;#xC21C;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;&amp;#xC774;&amp;#xAE30;&amp;#xB294; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#xC694;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; &amp;#xBB38;&amp;#xC11C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC55E;&amp;#xC5D0; &amp;#xC22B;&amp;#xC790;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC774;&amp;#xAC8C; &amp;#xB300;&amp;#xCDA9; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xD3F0;&amp;#xD2B8; &amp;#xC815;&amp;#xBCF4;&amp;#xC774;&amp;#xAC70;&amp;#xB098; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC54C;&amp;#xAC70;&amp;#xB098; &amp;#xBA87; &amp;#xBC88;&amp;#xC758; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB192;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xC790;&amp;#xAE30;&amp;#xAC00; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xCD94;&amp;#xCE21;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC778;&amp;#xD48B;&amp;#xC744; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xD3B8;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC9C1;&amp;#xC811; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xB4E4;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xBA74; &amp;#xB354;&amp;#xB354;&amp;#xC6B1; &amp;#xC774;&amp;#xAC8C; &amp;#xBB58; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC2E4; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xB54C; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC5B4;&amp;#xCC28;&amp;#xD53C; &amp;#xADF8;&amp;#xB0E5; &amp;#xBBA4;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xD560;&amp;#xAC70; &amp;#xBCF4;&amp;#xD1B5; &amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC8FC;&amp;#xC5B4;&amp;#xC9C4; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC784;&amp;#xC758;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD558;&amp;#xC5EC; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xBCF8; &amp;#xD30C;&amp;#xC77C;&amp;#xACFC; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xD30C;&amp;#xC77C; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xC8E0;. &amp;#xC800;&amp;#xB3C4; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC9DC;&amp;#xB3C4; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACF5;&amp;#xAC1C;&amp;#xB41C; &amp;#xBB34;&amp;#xB8CC; &amp;#xD37C;&amp;#xC800;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!! &amp;#x314E;&amp;#x314E; &amp;#xAC1C;&amp;#xC774;&amp;#xB4DD; BFF, Peach, AFL &amp;#xB610; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0;&amp;#x2026; &amp;#xBB50; &amp;#xC788;&amp;#xC5C8;&amp;#xB354;&amp;#xB77C;&amp;#x2026; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xC798; &amp;#xC548; &amp;#xB098;&amp;#xB294;&amp;#xB370; &amp;#xBB50; &amp;#xC554;&amp;#xD2BC; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC800;&amp;#xB294; BFF&amp;#xB97C; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. BFF&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xBA74; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.cert.org/vulnerability-analysis/tools/bff.cfm&#34;&gt;https://www.cert.org/vulnerability-analysis/tools/bff.cfm&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774;&amp;#xB984;&amp;#xC740; FOE &amp;#xC600;&amp;#xB294;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; BFF&amp;#xB85C; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xB180;&amp;#xB780; &amp;#xAC8C; &amp;#xC6D0;&amp;#xB798; FOE&amp;#xAC00; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xB9CC; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD588;&amp;#xC5C8;&amp;#xB294;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xBA74;&amp;#xC11C; &amp;#xB9E5;&amp;#xC774;&amp;#xB791; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xAC8C; &amp;#xB410;&amp;#xB124;&amp;#xC694;!! &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xB9E5;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xAC1C; &amp;#xB3CC;&amp;#xB824;&amp;#xBD24;&amp;#xB294;&amp;#xB370; &amp;#xBB54;&amp;#xAC00; &amp;#xB354; &amp;#xB9CE;&amp;#xC774; &amp;#xD130;&amp;#xC9C0;&amp;#xB294; &amp;#xC774; &amp;#xB290;&amp;#xB08C;&amp;#xC801;&amp;#xC778; &amp;#xB290;&amp;#xB08C;&amp;#x2026; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB9E5; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xB3C4; &amp;#xD574;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD2BC; BFF &amp;#xB4F1; &amp;#xD37C;&amp;#xC800;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xB098;&amp;#xC624;&amp;#xB2C8; &amp;#xC2A4;&amp;#xD0B5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD0C0;&amp;#xAE43;-&amp;#xC120;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#&amp;#xD0C0;&amp;#xAE43;-&amp;#xC120;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&#34;&gt;&lt;/a&gt;&amp;#xD0C0;&amp;#xAE43; &amp;#xC120;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;&amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC74; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!! &amp;#xC65C;&amp;#xB0D0;!!! &amp;#xD3EC;&amp;#xC0C1; &amp;#xAE08;&amp;#xC561;&amp;#xC774; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;!!! &amp;#xADF8;&amp;#xB7FC; &amp;#xBA85;&amp;#xC608;&amp;#xC758; &amp;#xC804;&amp;#xB2F9; &amp;#xC21C;&amp;#xC704;&amp;#xAC00; &amp;#xBCC0;&amp;#xB3D9;&amp;#xC774; &amp;#xBCC4;&amp;#xB85C; &amp;#xC548;&amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;!!!!(&amp;#xBB50; &amp;#xB531;&amp;#xD788; &amp;#xC0C1;&amp;#xAD00;&amp;#xC740; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC;) &amp;#xC554;&amp;#xD2BC; &amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xBC84;&amp;#xADF8; &amp;#xD5CC;&amp;#xD305;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBAA9;&amp;#xC801;&amp;#xC744; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB09C; &amp;#xB3C8;&amp;#xC744; &amp;#xBC8C;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;!!!! or &amp;#xC81C;&amp;#xB85C;&amp;#xB370;&amp;#xC774; &amp;#xB9DB;&amp;#xC774;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xD558;&amp;#xB098;&amp;#xB9CC; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC694; &amp;#x3160;&amp;#x3160;&amp;#x3160;&lt;ul&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC27D;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4; &amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; &amp;#xAC70; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC5BC;&amp;#xB8E8; &amp;#xADF8;&amp;#xB0E5; &amp;#xB0A0;&amp;#xB85C; &amp;#xBA39;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3C8; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC880; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xBCA4;&amp;#xB354; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xAE4C;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC78;&amp;#xB85C;&amp;#x2026; &amp;#xC798; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xC740;&amp;#xADFC;&amp;#xD788; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC5D0; Rebase, ASLR &amp;#xC548; &amp;#xAC78;&amp;#xB824; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB3C4; &amp;#xBD24;&amp;#xC5B4;&amp;#xC694; &amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xB09C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xACFC; &amp;#xBA85;&amp;#xC608;&amp;#xB97C; &amp;#xC5BB;&amp;#xACA0;&amp;#xB2E4;!!!&lt;ul&gt;
&lt;li&gt;CVE&amp;#xAC00; &amp;#xB098;&amp;#xC62C;&amp;#xB9CC;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; &amp;#xCEE4;&amp;#xB110;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00;&amp;#x2026;. (&amp;#xC544; &amp;#xADFC;&amp;#xB370; &amp;#xC65C; &amp;#xC694;&amp;#xC0C8; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCEE4;&amp;#xB110; &amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC9C4; &amp;#xB290;&amp;#xB08C;&amp;#xC774;&amp;#xC9C0; &amp;#xB0B4;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xD558;&amp;#xB124; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCEE4;&amp;#xB110; &amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;&amp;#xC148;)&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xB098;&amp;#xBA38;&amp;#xC9C4; &amp;#xBB50;&amp;#xB0D0;!!!!&lt;ul&gt;
&lt;li&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&amp;#x2026;. &amp;#xC2EC;&amp;#xC2EC;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xB294; &amp;#xAC70;&amp;#xC608;&amp;#xC694;&amp;#x2026;&amp;#x2026;.;;;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC7A5;&amp;#xB09C;&amp;#xC774;&amp;#xACE0; &amp;#x314B;&amp;#x314B;&amp;#x314B; &amp;#xC74C; &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xD0C0;&amp;#xAE43;&amp;#xC744; &amp;#xB0B4;&amp;#xAC00; &amp;#xC544;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB0D0;?? &amp;#x3134;&amp;#x3134; &amp;#xADF8;&amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://software.naver.com/main.nhn&#34;&gt;http://software.naver.com/main.nhn&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC790;&amp;#xB8CC;&amp;#xC2E4;&amp;#xC744; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCF4;&amp;#xAE09;&amp;#xB3C4;&amp;#xB098; &amp;#xC774;&amp;#xB7F0; &amp;#xAC74; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC218;&amp;#xCE58;&amp;#xB85C;&amp;#xB294; &amp;#xC548; &amp;#xB098;&amp;#xC640; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xCE21;&amp;#xC740; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC8E0; &amp;#x314B;&amp;#x314B; &amp;#xC778;&amp;#xAE30; &amp;#xB9CE;&amp;#xC740; &amp;#xAC8C; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC70;&amp;#xACA0;&amp;#xC8E0;?? &amp;#xB124;&amp;#xC774;&amp;#xBC84;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC774;&amp;#xB098; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC3E;&amp;#xC73C;&amp;#xC2DC;&amp;#xBA74; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB4DC;-&amp;#xD30C;&amp;#xC77C;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB4DC;-&amp;#xD30C;&amp;#xC77C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&lt;/h1&gt;&lt;p&gt;&amp;#xD37C;&amp;#xC800;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC591;&amp;#xC9C8;&amp;#xC758; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB123;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC911;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD0C0;&amp;#xAE43; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD37C;&amp;#xC9D5; &amp;#xD560; &amp;#xAC83;&amp;#xC778;&amp;#xC9C0; &amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC74C;&amp;#xC545;&amp;#xC774;&amp;#xB098; &amp;#xB3D9;&amp;#xC601;&amp;#xC0C1;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7;&amp;#xB9CC; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;(&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xACE0;&amp;#xB294; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC84;&amp;#xC804;&amp;#xC774;&amp;#xB098; &amp;#xC555;&amp;#xCD95; &amp;#xBC29;&amp;#xC2DD;, &amp;#xC6B4;&amp;#xC601;&amp;#xBC29;&amp;#xC2DD; &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC880; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC19;&amp;#xC740; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC774;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC0D8;&amp;#xD50C;&amp;#xC774; &amp;#xB9CE;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xC88B;&amp;#xC8E0;), &amp;#xC6CC;&amp;#xB4DC;&amp;#xB098; &amp;#xD55C;&amp;#xAE00; &amp;#xAC19;&amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xB9CE;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560;&amp;#xC9C0;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC548; &amp;#xD558;&amp;#xACE0; &amp;#xADF8;&amp;#xB0E5; &amp;#xB9C9; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560; &amp;#xB54C; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD558;&amp;#xB290;&amp;#xB77C; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;&amp;#xD558;&amp;#xAE30; &amp;#xC77C;&amp;#xC464;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD30C;&amp;#xC545;&amp;#xD558;&amp;#xACE0; &amp;#xAD1C;&amp;#xCC2E;&amp;#xACA0;&amp;#xB2E4; &amp;#xC2F6;&amp;#xC740; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xC11C; &amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC8C; &amp;#xC81C;&amp;#xC77C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xC77C; &amp;#xC88B;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xC548;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xB85C; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD0C0;&amp;#xAE43;&amp;#xC774; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1; &amp;#xD560; &amp;#xB54C; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD568;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC9C1;&amp;#xC811; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB9CC;&amp;#xB4DC;&amp;#xB294; &amp;#xAC70;&amp;#xB294; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB610; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xC811; &amp;#xB9CC;&amp;#xB4E4;&amp;#xAE30; &amp;#xC560;&amp;#xB9E4;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xADC0;&amp;#xCC2E;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xAD6C;&amp;#xAE00; &amp;#xAC80;&amp;#xC0C9;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Filetype&amp;#xC73C;&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3EC;&amp;#xB9F7; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC2DC;&amp;#xB4DC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xBCF4;&amp;#xD588;&amp;#xB358; &amp;#xBBF8;&amp;#xB514;&amp;#xC5B4; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; KMPlayer&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xD3EC;&amp;#xB9F7;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/03/07/l0ch/bughunting-tutorial/image1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">

  <title>[Research]   Part 1 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-03-07 18:00" pubdate>
      2021 3 7 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      92
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]   Part 1</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; L0ch&#xC785;&#xB2C8;&#xB2E4;! &#xC624;&#xB298;&#xC740; &#xD2B9;&#xBCC4;&#xD55C; &#xAE00;&#xC744; &#xAC00;&#xC838;&#xC640;&#xBD24;&#xC5B4;&#xC694; &#x314B;&#x314B;&#x314B; &#xBC14;&#xB85C; &#xB300;&#xD559;&#xAD50; &#xB3D9;&#xC544;&#xB9AC; &#xB300;-&#xC120;&#xBC30;&#xB2D8;&#xC758; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC5D0; &#xB300;&#xD55C; &#xAFC0;&#xD301;&#xC774; &#xB2F4;&#xACA8;&#xC788;&#xB294; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xB54C;&#xB294; 2018&#xB144;.. &#xC544;&#xC9C1; &#xC0C8;&#xB0B4;&#xAE30; &#xD2F0;&#xB97C; &#xBC97;&#xC5B4;&#xB098;&#xC9C0; &#xBABB;&#xD55C; &#xC800;&#xC5D0;&#xAC8C;</p>
<blockquote>
<p>&#xC708;&#xB3C4;&#xC6B0; &#xCDE8;&#xC57D;&#xC810; &#xCC3E;&#xC544;&#xBCFC;&#xB798;?</p>
</blockquote>
<p>&#xB77C;&#xBA70; &#xC62C;&#xB824;&#xC8FC;&#xC2E0; &#xAE00;&#xC785;&#xB2C8;&#xB2E4; &#x314E;&#x314E;..  &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC5D0; &#xB300;&#xD55C; &#xC18C;&#xAC1C;&#xBD80;&#xD130;, &#xB300;&#xC0C1; &#xC120;&#xC815;-&#xBD84;&#xC11D;-&#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xAE4C;&#xC9C0; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xB274;&#xBE44;&#xB3C4; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xCE5C;&#xC808;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xC774; &#xB418;&#xC5B4; &#xC788;&#xC5B4; &#xB3C4;&#xC6C0;&#xC774; &#xB9CE;&#xC774; &#xB418;&#xC5C8;&#xC8E0;. (&#xADF8;&#xB550; &#xBAB0;&#xB790;&#xC9C0; &#xC55E;&#xC73C;&#xB85C; &#xC708;&#xB3C4;&#xC6B0;&#xB85C; &#xACE0;&#xD1B5;&#xBC1B;&#xAC8C; &#xB420;&#xC9C0;&#x2026;..)</p>
<p>&#xC5EC;&#xD2BC; &#xADF8;&#xB798;&#xC11C; &#xD5C8;&#xB77D;&#xC744; &#xAD6C;&#xD558;&#xACE0; &#xC62C;&#xB9AC;&#xAC8C; &#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xC2DC;&#xB9AC;&#xC988;&#xAC00; &#xAE34; &#xB9CC;&#xD07C; &#xB098;&#xB204;&#xC5B4;&#xC11C; &#xC62C;&#xB9B4; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xAC8C;&#xC2DC;&#xB97C; &#xD5C8;&#xB77D;&#xD574;&#xC8FC;&#xC2E0; &#xC120;&#xBC30;&#xB2D8;&#xAED8; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xAC10;&#xC0AC;&#xC758; &#xB9D0;&#xC500;&#xC744; &#xB4DC;&#xB9AC;&#xBA70; &#xC2DC;&#xC791;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<hr>
<h1 id="&#xC11C;&#xB860;"><a href="#&#xC11C;&#xB860;" class="headerlink" title="&#xC11C;&#xB860;"></a>&#xC11C;&#xB860;</h1><p>&#xC74C; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC774;&#xB77C;&#xB294; &#xAC70;&#xCC3D;&#xD55C; &#xC81C;&#xBAA9;&#xC744; &#xD574;&#xB3C4; &#xB420;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xC9C0;&#xB9CC; &#x314B;&#x314B;&#x314B; &#xC81C;&#xAC00; &#xCC3E;&#xC558;&#xB358; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC608;&#xC2DC;&#xB85C; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC598;&#xAE30;&#xD574; &#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB50; &#xB300;&#xB2E8;&#xD55C; &#xAC8C; &#xC544;&#xB2C8;&#xB77C; &#xADF8;&#xB0E5; &#xC81C;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC558;&#xACE0; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD588;&#xB294;&#xC9C0; &#xC815;&#xB3C4;? &#xD0A4;&#xC0AC; &#xBCF4;&#xACE0;&#xC11C; &#xC4F0;&#xB294; &#xD301;&#xB3C4; &#xC880; &#xC368;&#xBCF4;&#xB824;&#xACE0; &#xD558;&#xB2E4;&#xAC00; &#xADF8;&#xB0E5; &#xBCF4;&#xACE0;&#xC11C;&#xB294; &#xCD5C;&#xB300;&#xD55C; &#xC790;&#xC138;&#xD788; &#xB9CE;&#xC774; &#xC4F0;&#xB294; &#xAC8C; &#xB2F5;&#xC778; &#xAC70; &#xAC19;&#xC544; &#xC774; &#xBD80;&#xBD84;&#xC740; &#xBE7C;&#xACE0; &#xC598;&#xAE30;&#xD560; &#xAC70; &#xAC19;&#xB124;&#xC694; &#x314B;&#x314B;</p>
<p>&#xCD5C;&#xADFC;&#xC5D0;&#xB294; &#xACF5;&#xC720;&#xAE30;&#xB791; &#xBB50; IOT&#xAC00; &#xB300;&#xC138;&#xC5EC;&#xC11C; &#xC8FC;&#xBCC0;&#xC5D0; &#xC774;&#xB807;&#xAC8C; &#xC708;&#xB3C4;&#xC6B0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBC84;&#xADF8; &#xD5CC;&#xD305;&#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC744; &#xB9CE;&#xC774; &#xBD24;&#xC9C0;&#xB9CC; &#xC708;&#xB3C4;&#xC6B0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xC2DC;&#xB824;&#xB294; &#xBD84;&#xB4E4;&#xAED8; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xD569;&#xB2C8;&#xB2E4; &#x314E;&#x314E; (&#xADF8;&#xB798;&#xB3C4; &#xACF5;&#xC720;&#xAE30;&#xAC00; &#xAC1C;&#xAFC0;&#xC784; &#x3160;&#x3160;)</p>
<p>&#xC774; &#xAE00;&#xC740; &#xC77D;&#xC73C;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC774; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xD0B9;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xBCF8;&#xC9C0;&#xC2DD;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xC804;&#xC81C; &#xD558;&#xC5D0; &#xC4F0;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6CC;&#xAC8C;&#xC784;&#xB3C4; &#xD480;&#xC5B4;&#xBCF4;&#xACE0; &#xB9AC;&#xBC84;&#xC2F1; &#xC880; &#xD560; &#xC218; &#xC788;&#xACE0; &#xC815;&#xB3C4;&#x2026;.? &#xADF8;&#xB9AC;&#xACE0; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC744; &#xC544;&#xC608; &#xC548; &#xD574;&#xBCF4;&#xC2E0; &#xBD84;&#xB4E4;? &#xC560;&#xB9E4;&#xD558;&#xC9C0;&#xB9CC;&#x2026; &#xADF8;&#xB798;&#xB3C4; &#xCD5C;&#xB300;&#xD55C; &#xC27D;&#xAC8C; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xC4F0;&#xB824;&#xACE0; &#xB178;&#xB825;&#xD574;&#xBCFC;&#xAC8C;&#xC694;.</p>
<h1 id="&#x203B;-&#xAE00;-&#xC77D;&#xC744;-&#xB54C;-&#xC8FC;&#xC758;&#xC0AC;&#xD56D;-&#x203B;"><a href="#&#x203B;-&#xAE00;-&#xC77D;&#xC744;-&#xB54C;-&#xC8FC;&#xC758;&#xC0AC;&#xD56D;-&#x203B;" class="headerlink" title="&#x203B; &#xAE00; &#xC77D;&#xC744; &#xB54C; &#xC8FC;&#xC758;&#xC0AC;&#xD56D; &#x203B;"></a>&#x203B; &#xAE00; &#xC77D;&#xC744; &#xB54C; &#xC8FC;&#xC758;&#xC0AC;&#xD56D; &#x203B;</h1><ol>
<li>&#xC774; &#xAE00;&#xC740; &#xC81C; &#xACBD;&#xD5D8;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xC4F0;&#xB294; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD639;&#xC2DC; &#xB354; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC774;&#xB098; &#xC544;&#xC774;&#xB514;&#xC5B4; &#xC788;&#xC73C;&#xC2E0; &#xBD84;&#xC740; &#xB313;&#xAE00;&#xC744; &#xB2EC;&#xC544;&#xC8FC;&#xC2DC;&#xBA74; &#xAC10;&#xC0AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774; &#xAE00;&#xC758; &#xD750;&#xB984;&#xC740; &#xC81C; &#xC758;&#xC2DD;&#xC758; &#xD750;&#xB984;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC911;&#xAC04;&#xC5D0; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xB534; &#xB370;&#xB85C; &#xC0C8;&#xAC70;&#xB098; &#xC624;&#xD0C0;&#xAC00; &#xC788;&#xAC70;&#xB098; &#xC544;&#xB2C8;&#xBA74; &#xAC1C;&#xC18C;&#xB9AC;&#xB97C; &#xD558;&#xAC70;&#xB098;&#x2026;.</li>
<li>&#xCD5C;&#xB300;&#xD55C; &#xC81C;&#xAC00; &#xD588;&#xB358; &#xBC29;&#xBC95;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xC368;&#xB0BC; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2E4;&#xD328;&#xD558;&#xB294; &#xACFC;&#xC815;&#xB3C4; &#xC4F8; &#xC0DD;&#xAC01;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCC98;&#xC74C; &#xBCFC; &#xB54C;&#xBD80;&#xD130; &#xC9C1;&#xC811; &#xD558;&#xBA74;&#xC11C; &#xB530;&#xB77C;&#xAC00;&#xAE30;&#xBCF4;&#xB2E4;&#xB294; &#xD55C; &#xBC88; &#xC4F1; &#xBCF4;&#xACE0; &#xB530;&#xB77C; &#xD574; &#xBCF4;&#xC2DC;&#xB294; &#xAC78; &#xCD94;&#xCC9C;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;</li>
<li>&#xC81C;&#xAC00; &#xBB38;&#xACFC;&#xB3C4; &#xC544;&#xB2C8;&#xAC70;&#xB2C8;&#xC640; &#xD559;&#xCC3D; &#xC2DC;&#xC808;&#xC758; &#xC808;&#xBC18; &#xC774;&#xC0C1;&#xC744; &#xC911;&#xAD88;&#xC5D0;&#xC11C; &#xBCF4;&#xB0C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD55C;&#xCFF8;&#xB9D0;&#xC774; &#xCD78;&#xAE08; &#xBD80;&#xC871;&#xD569;&#xB2C8;&#xB370;&#xC2A4;.</li>
</ol>
<p>&#xBB50; &#xC554;&#xD2BC; &#xC2DC;&#xC791;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2F9; &#x314B;&#x314B;</p>
<h1 id="&#xBAA9;&#xCC28;"><a href="#&#xBAA9;&#xCC28;" class="headerlink" title="&#xBAA9;&#xCC28;"></a>&#xBAA9;&#xCC28;</h1><h3 id="part-1"><a href="#part-1" class="headerlink" title="part 1"></a>part 1</h3><ol>
<li>&#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC774;&#xB780;?</li>
<li>&#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;</li>
<li>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC804;&#xC5D0;</li>
<li>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xBC29;&#xBC95;</li>
<li>&#xD0C0;&#xAE43; &#xC120;&#xC815;</li>
<li>&#xC2DC;&#xB4DC; &#xD30C;&#xC77C;</li>
</ol>
<h3 id="To-be-Continued&#x2026;"><a href="#To-be-Continued&#x2026;" class="headerlink" title="To be Continued&#x2026;"></a>To be Continued&#x2026;</h3><ol>
<li>&#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; - KMPlayer</li>
<li>From Crash to Exploit</li>
<li>&#xC7A1;&#xB2F4;</li>
</ol>
<h1 id="&#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC774;&#xB780;"><a href="#&#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC774;&#xB780;" class="headerlink" title="&#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC774;&#xB780;?"></a>&#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC774;&#xB780;?</h1><p>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB098; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4; &#xB4F1;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC81C;&#xBCF4;&#xD574; &#xAE08;&#xC804;&#xC801;&#xC778; &#xBCF4;&#xC0C1;, &#xD574;&#xCEE4;&#xC758; &#xBA85;&#xC608; &#xD68D;&#xB4DD; &#xB4F1; &#xC774;&#xB4DD;&#xC744; &#xB178;&#xB9AC;&#xB294; &#xC77C;&#xB828;&#xC758; &#xD589;&#xC704;&#xC785;&#xB2C8;&#xB2E4;. &#xBB50; &#xADF8;&#xB7EC;&#xB2C8;&#xAE4C; &#xACB0;&#xAD6D; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC2E0;&#xB098;&#xAC8C; &#xCC3E;&#xACE0; &#xB3C8;&#xB3C4; &#xBC1B;&#xACE0; &#xD06C;&#xB798;&#xB527;&#xB3C4; &#xBC1B;&#xACE0; &#x3131;&#x3147;&#x3137;</p>
<p>&#xAD6D;&#xB0B4;&#xC758; &#xACBD;&#xC6B0; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD560; &#xC810;&#xC740; &#xC11C;&#xBE44;&#xC2A4; &#xC911;&#xC778; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8; &#xD639;&#xC740; &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xACF5;&#xACA9;&#xC740; &#xBD88;&#xBC95;&#xC774;&#xBBC0;&#xB85C; &#xC6F9; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC740; &#xC880; &#xD798;&#xB4E4;&#xACA0;&#xB124;&#xC694; &#x3160;&#x3160; &#xD558;&#xC9C0;&#xB9CC; &#xC81C;&#xAC00; &#xC54C;&#xAE30;&#xB85C;&#xB294; &#xB124;&#xC774;&#xBC84;&#xB294; &#xAC00;&#xB2A5;&#xD55C; &#xAC78;&#xB85C; &#xC54C;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xBC84;&#xADF8;-&#xBC14;&#xC6B4;&#xD2F0;"><a href="#&#xBC84;&#xADF8;-&#xBC14;&#xC6B4;&#xD2F0;" class="headerlink" title="&#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;"></a>&#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;</h1><p>&#xD574;&#xCEE4;&#xB4E4;&#xC774; &#xC81C;&#xBCF4;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xC0C1;&#xC744; &#xD574;&#xC8FC;&#xB294; &#xC81C;&#xB3C4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="1-&#xAC01;-&#xD68C;&#xC0AC;&#xBCC4;-&#xBC84;&#xADF8;-&#xBC14;&#xC6B4;&#xD2F0;"><a href="#1-&#xAC01;-&#xD68C;&#xC0AC;&#xBCC4;-&#xBC84;&#xADF8;-&#xBC14;&#xC6B4;&#xD2F0;" class="headerlink" title="1) &#xAC01; &#xD68C;&#xC0AC;&#xBCC4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;"></a>1) &#xAC01; &#xD68C;&#xC0AC;&#xBCC4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;</h2><p>&#xC678;&#xAD6D; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xAC01; &#xD68C;&#xC0AC;(&#xB2E4;&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;)&#xB9C8;&#xB2E4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB4E4; &#xC798; &#xC544;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC; &#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; &#xAD6C;&#xAE00;, &#xD398;&#xC774;&#xC2A4;&#xBD81;, &#xC560;&#xD50C; &#xB4F1;&#xB4F1; &#xC6EC;&#xB9CC;&#xD55C; &#xC544;&#xB294; &#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xB2E4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC790;&#xC0AC;&#xC758; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC8E0;. &#xD558;&#xC9C0;&#xB9CC; &#xAC01;&#xC790; &#xC6B4;&#xC601; &#xB8F0;&#xC740; &#xC870;&#xAE08;&#xC529; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC5B4;&#xB514;&#xB294; &#xC790;&#xC0AC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD06C;&#xB798;&#xC2DC;&#xB9CC; &#xBC1B;&#xB294; &#xACF3;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xC5B4;&#xB514;&#xB294; &#xD480; &#xC775;&#xC2A4;&#xAE4C;&#xC9C0; &#xC788;&#xC5B4;&#xC57C;&#xC9C0;&#xB9CC; &#xBCF4;&#xC0C1;&#xC744; &#xD574;&#xC8FC;&#xB294;&#x2026; &#xC544;&#xB2C8;&#xBA74; &#xD06C;&#xB798;&#xB527;&#xB9CC; &#xC8FC;&#xACE0; &#xB9AC;&#xC6CC;&#xB4DC;&#xB294; &#xC5C6;&#xB294;&#x2026;. &#xBB50; &#xADF8;&#xB7F0; &#xAC70;&#xB294; &#xAC01; &#xD68C;&#xC0AC;&#xC758; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xC744; &#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bugcrowd.com/bug-bounty-list/">https://www.bugcrowd.com/bug-bounty-list/</a></p>
<p>&#xC704; &#xB9C1;&#xD06C;&#xB97C; &#xB4E4;&#xC5B4;&#xAC00;&#xC2DC;&#xBA74; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD68C;&#xC0AC;&#xB4E4;&#xC758; &#xB9AC;&#xC2A4;&#xD2B8;&#xC640; &#xC6B4;&#xC601; &#xBC29;&#xC2DD;&#xC774; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD00;&#xC2EC; &#xC788;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC544;&#xC694;.</p>
<h2 id="2-&#xC81C;&#xB85C;&#xB514;&#xC6C0;-ZDI-&#xD574;&#xCEE4;&#xC6D0;-&#xB4F1;"><a href="#2-&#xC81C;&#xB85C;&#xB514;&#xC6C0;-ZDI-&#xD574;&#xCEE4;&#xC6D0;-&#xB4F1;" class="headerlink" title="2) &#xC81C;&#xB85C;&#xB514;&#xC6C0;, ZDI, &#xD574;&#xCEE4;&#xC6D0; &#xB4F1;"></a>2) &#xC81C;&#xB85C;&#xB514;&#xC6C0;, ZDI, &#xD574;&#xCEE4;&#xC6D0; &#xB4F1;</h2><p>&#xD0C0; &#xD68C;&#xC0AC;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xB3C4; &#xC81C;&#xBCF4;&#xBC1B;&#xB294; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xC785;&#xB2C8;&#xB2E4;. &#xBCF4;&#xC0C1;&#xC774; &#xC318; &#xAC78;&#xB85C; &#xC720;&#xBA85;&#xD558;&#xC8E0;. &#xC81C;&#xB85C;&#xB514;&#xC6C0;&#xC758; &#xBCF4;&#xC0C1;&#xAE08;&#xC561;&#xC744; &#xD55C;&#xBC88; &#xBCFC;&#xAE4C;&#xC694;?</p>
<p><img src="/2021/03/07/l0ch/bughunting-tutorial/image1.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98; : &#xC81C;&#xB85C;&#xB514;&#xC6C0;</p>
</blockquote>
<p>&#xADF8;&#xB0E5; &#xBD10;&#xB3C4; &#xC0C1;&#xB2F9;&#xD788; &#xC138;&#xC8E0;?? &#x314E;&#x3137;&#x3137;</p>
<p>&#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; $10,000 &#xBA74; &#xC9C0;&#xAE08; &#xD658;&#xC728;&#xB85C; &#xACC4;&#xC0B0;&#xD574;&#xBCF4;&#xBA74; &#xCC9C;&#xB9CC; &#xC6D0;&#xC774; &#xB118;&#xB124;&#xC694;;;; &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB9CC;&#xD07C; &#xC26C;&#xC6B4; &#xD0C0;&#xAE43;&#xC740; &#xD558;&#xB098;&#xB3C4; &#xC5C6;&#xB124;&#xC694; &#x3160;&#x3160; &#xADF8;&#xB9AC;&#xACE0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB4E4; &#xD480; &#xC775;&#xC2A4;&#xB97C; &#xD574;&#xC11C; &#xBCF4;&#xB0B4;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB354;&#xB354;&#xC6B1; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xCEE4;&#xC6D0; &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xB294; &#xC81C;&#xB85C;&#xB514;&#xC6C0;&#xACFC; ZDI &#xC640;&#xB294; &#xB2E4;&#xB974;&#xAC8C; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6D;&#xB0B4;&#xC5D0;&#xC11C; &#xC6F9; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xBABB;&#xD574;&#xC11C; &#xC544;&#xC26C;&#xC6B4; &#xBD84;&#xB4E4;&#xC740; &#xD574;&#xCEE4;&#xC6D0; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC2DC;&#xB3C4;&#xD574;&#xBCF4;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC744; &#xB4EF;&#xD569;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<h2 id="3-KISA-S-W-&#xC2E0;&#xADDC;-&#xCDE8;&#xC57D;&#xC810;-&#xD3EC;&#xC0C1;-&#xC2E0;&#xACE0;&#xC81C;"><a href="#3-KISA-S-W-&#xC2E0;&#xADDC;-&#xCDE8;&#xC57D;&#xC810;-&#xD3EC;&#xC0C1;-&#xC2E0;&#xACE0;&#xC81C;" class="headerlink" title="3) KISA S/W &#xC2E0;&#xADDC; &#xCDE8;&#xC57D;&#xC810; &#xD3EC;&#xC0C1; &#xC2E0;&#xACE0;&#xC81C;"></a>3) KISA S/W &#xC2E0;&#xADDC; &#xCDE8;&#xC57D;&#xC810; &#xD3EC;&#xC0C1; &#xC2E0;&#xACE0;&#xC81C;</h2><p>&#xC804; &#xC138;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xC77C;&#xD558;&#xAC8C; &#xAD6D;&#xAC00;&#xAE30;&#xAD00;&#xC774; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xB294; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC785;&#xB2C8;&#xB2E4;.(&#xB77C;&#xACE0; &#xBC1C;&#xD45C;&#xC5D0;&#xC11C; &#xB4E4;&#xC5C8;&#xB358; &#xAC8C; &#xC0DD;&#xAC01;&#xC774; &#xB098;&#xB124;&#xC694;) &#xADF8;&#xB9AC;&#xACE0; &#xAD6D;&#xB0B4;&#xC5D0;&#xC11C; &#xBA87; &#xC5C6;&#xB294; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0; &#xC911; &#xD558;&#xB098;&#xC774;&#xAE30;&#xB3C4; &#xD558;&#xC8E0; &#x314B;&#x314B;</p>
<p>&#xD0A4;&#xC0AC;&#xB97C; &#xC81C;&#xC678;&#xD558;&#xACE0; &#xC0BC;&#xC131;&#xC774;&#xB098; &#xB2E4;&#xB978; &#xBA87;&#xBA87; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C;&#xB3C4; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xB97C; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC9C0;&#xB9CC; &#xB300;&#xC0C1;&#xC774; &#xC81C;&#xD55C;&#xC801;&#xC778; &#xAC78;&#xB85C; &#xAE30;&#xC5B5;&#xD569;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xD0A4;&#xC0AC;&#xC5D0;&#xC11C; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xBC84;&#xADF8; &#xBC14;&#xC6B4;&#xD2F0;&#xAC00; &#xC81C;&#xC77C; &#xAD1C;&#xCC2E;&#xC740; &#xAC70; &#xAC19;&#xB124;&#xC694;.(&#xC560;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E; &#xB9CE;&#xC774; &#xC81C;&#xBCF4;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xC558;&#xC9C0;&#xB9CC;&#x2026;)</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr">https://www.krcert.or.kr/consult/software/vulnerability.do?orgSiteUrl=https://www.krcert.or.kr</a></p>
<p>&#xC704; &#xB9C1;&#xD06C;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; &#xC2E0;&#xACE0;&#xC11C; &#xC591;&#xC2DD;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD574; &#xC591;&#xC2DD;&#xB300;&#xB85C; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC81C;&#xBCF4;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC27D;&#xC8E0;?</p>
<p>2016&#xB144;&#xC5D0;&#xB294; eip&#xB9CC; &#xBC14;&#xAFD4;&#xC11C; &#xC81C;&#xBCF4;&#xB97C; &#xD574;&#xB3C4; &#xD3EC;&#xC0C1;&#xC744; &#xC92C;&#xB358; &#xAC70; &#xAC19;&#xC740;&#xB370; &#xCD5C;&#xADFC;&#xC5D0;&#xB294; &#xAF2D; &#xD480; &#xC775;&#xC2A4;&#xB97C; &#xD574;&#xC57C;&#xC9C0;&#xB9CC; &#xD3EC;&#xC0C1;&#xC744; &#xC900;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694; &#x3160;&#x3160;</p>
<h1 id="&#xCDE8;&#xC57D;&#xC810;&#xC744;-&#xCC3E;&#xAE30;-&#xC804;&#xC5D0;"><a href="#&#xCDE8;&#xC57D;&#xC810;&#xC744;-&#xCC3E;&#xAE30;-&#xC804;&#xC5D0;" class="headerlink" title="&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC804;&#xC5D0;"></a>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC804;&#xC5D0;</h1><p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC804;&#xC5D0; &#xBA3C;&#xC800; &#xC54C;&#xC544;&#xB46C;&#xC57C; &#xD560; &#xAC83;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xBA3C;&#xC800; &#xC598;&#xAE30;&#xD574;&#xBCFC;&#xAC8C;&#xC694;</p>
<ol>
<li>&#xBAA8;&#xB4E0; &#xCDE8;&#xC57D;&#xC810;&#xC740; untrust input&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xBB34;&#xC2A8; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB4E0; &#xAC04;&#xC5D0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCEE8;&#xD2B8;&#xB864;&#xD560; &#xC218; &#xC788;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC870;&#xC791;&#xC5D0; &#xC758;&#xD574;&#xC11C; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xBAA8;&#xB4E0; &#xBC84;&#xADF8;&#xAC00; &#xC775;&#xC2A4; &#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC5B4;&#xB3C4; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158; &#xB54C;&#xBB38;&#xC5D0; &#xC775;&#xC2A4;&#xB97C; &#xBABB; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0; &#xC544;&#xB2C8;&#xBA74; eip &#xCEE8;&#xD2B8;&#xB864;&#xD560; &#xC218; &#xC788;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC5C6;&#xC5B4;&#xC11C; &#xC775;&#xC2A4;&#xB97C; &#xBABB;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x2192; &#xC2E4;&#xC81C; &#xACBD;&#xD5D8;&#xC784;. &#xC624;&#xBC84; &#xD50C;&#xB85C;&#xC6B0; &#xD588;&#xB294;&#xB370; &#xC775;&#xC2A4; &#xBABB;&#xD568;&#x2026;(&#xC0AC;&#xC2E4; &#xB354; &#xBCF4;&#xAE30; &#xADC0;&#xCC2E;&#xC544;&#xC11C; &#xC548; &#xBD04;)</li>
<li>&#xB0A8;&#xC774; &#xC774;&#xBBF8; &#xCC3E;&#xC544;&#xC11C; &#xC81C;&#xBCF4;&#xB97C; &#xD588;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xAC00; &#xB098;&#xC624;&#xBA74; &#xBC14;&#xB85C;&#xBC14;&#xB85C; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC775;&#xC2A4;&#xD558;&#xACE0; &#xC788;&#xB294;&#xB370; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC774; &#xBA3C;&#xC800; &#xC81C;&#xBCF4;&#xD574;&#xC11C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD55C; &#xAC78; &#xBAA8;&#xB974;&#xACE0; &#xC788;&#xB2E4;&#xAC00; &#xC2DC;&#xAC04;&#xB9CC; &#xB0A0;&#xB9AC;&#xBA74; &#xC5B5;&#xC6B8;&#xD558;&#xC790;&#xB098;&#xC694; &#x3160;&#x3160; (&#xC790;&#xAE30; &#xAEBC;&#xB294; &#xD328;&#xCE58; &#xC548;&#xB420; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xC9C0; &#xB9C8;&#xC138;&#xC694;&#x2026; &#xD328;&#xCE58;&#xB2F9;&#xD558;&#xBA74; &#xC0B6;&#xC758; &#xC758;&#xC695;&#xC774; &#xC0AC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;&#x2026; &#x3160;&#x3160;)</li>
<li>&#xAD6D;&#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xB294; &#xC678;&#xAD6D; &#xC720;&#xBA85; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xBCF4;&#xB2E4;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB9CE;&#xC740; &#xD3B8;&#xC785;&#xB2C8;&#xB2E4;.(&#xC544; &#xBB3C;&#xB860; &#xC9C4;&#xC9DC; &#xBCF4;&#xC548;&#xC5D0; &#xC2E0;&#xACBD; &#xC4F4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC81C;&#xC678;&#xD558;&#xACE0;&#xC694;. &#xD55C;&#xAE00; &#xAC19;&#xC774;&#x2026;.? &#x3160;&#x3160; &#xBCF4;&#xC548;&#xBAA8;&#xB4C8; &#xC62C;&#xB77C;&#xAC00;&#xACE0; &#xB098;&#xC11C;&#xB294; &#xC775;&#xC2A4; &#xD558;&#xAE30; &#xD798;&#xB4E4;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;) &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xB54C; &#xAC00;&#xC7A5; &#xBD88;&#xC548;&#xD55C; &#xAC83;&#xC774; &#x201C;&#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xC5B4;&#xCA4C;&#xC9C0;?&#x201D;&#xC778;&#xB370; &#xBCF4;&#xD1B5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC774; &#xC61B;&#xB0A0; &#xBAA8;&#xB4C8;&#xC744; &#xC4F0;&#xAC70;&#xB098; &#xCC98;&#xC74C; &#xC124;&#xACC4;&#xD560; &#xB54C; &#xBCF4;&#xC548;&#xC5D0; &#xC2E0;&#xACBD; &#xC4F0;&#xC9C0; &#xC54A;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30;&#xC5D0;&#xB294; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xC544;&#xB9C8;&#xB3C4;&#x2026;?)</li>
</ol>
<p>&#xADF8;&#xB7FC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBB34;&#xC5C7;&#xC774; &#xD544;&#xC694;&#xD560;&#xAE4C;&#xC694;?</p>
<ol>
<li>&#xB9AC;&#xBC84;&#xC2F1; : &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC5B4;&#xB514; &#xC788;&#xB294;&#xC9C0; &#xADF8;&#xB9AC;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3CC;&#xC544;&#xAC00;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xB9AC;&#xBC84;&#xC2F1;&#xC5D0; &#xC775;&#xC219;&#xD574;&#xC838; &#xC788;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC798;&#xD560;&#xC218;&#xB85D; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xCC3E;&#xACA0;&#xC8E0;.</li>
<li>&#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; : &#xC774;&#xAC70;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xACE0; eip&#xB97C; &#xC7A1;&#xACE0; &#xB098;&#xC11C;&#xC758; &#xBB38;&#xC81C;&#xC778;&#xB370; &#xC0AC;&#xC2E4; &#xAD6D;&#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC775;&#xC2A4; &#xD560; &#xB54C;&#xC5D0;&#xB294; corelan&#xC758; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.corelan.be/index.php/category/security/exploit-writing-tutorials/">windows exploitation tutorial</a>&#xB9CC; &#xC77D;&#xC5B4;&#xB3C4; &#xCDA9;&#xBD84;&#xD569;&#xB2C8;&#xB2E4;.(&#xB300;&#xBD80;&#xBD84;&#xC740;? &#xC800;&#xB3C4; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD574;&#xBCF8; &#xAC8C; &#xC544;&#xB2C8;&#xB77C; &#xC7A5;&#xB2F4;&#xC740; &#xBABB;&#xD558;&#xACA0;&#xB124;&#xC694;)</li>
<li>&#xAC1C;&#xBC1C; &#xB2A5;&#xB825; : &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C; &#xB2A5;&#xB825;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xB9AC;&#xBC84;&#xC2F1;&#xD558;&#xB294; &#xB370;&#xC5D0;&#xB3C4; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xAD6C;&#xC870;&#xB97C; &#xC880; &#xB354; &#xC815;&#xD655;&#xD788; &#xBE68;&#xB9AC; &#xD30C;&#xC545;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;. &#xC800;&#xB294; &#xAC1C;&#xBC1C;&#xC744; &#xBABB;&#xD574;&#xC11C; &#xC774;&#xB807;&#xAC8C; &#xD574;&#xD0B9;&#xC744; &#xBABB;&#xD558;&#xB098; &#xBD05;&#xB2C8;&#xB2E4; &#x315C;&#x3160; &#xAC1C;&#xBC1C;&#xC740; &#xB610; &#xC5B8;&#xC81C; &#xACF5;&#xBD80;&#xD558;&#xC9C0;&#x2026;</li>
</ol>
<h1 id="&#xCDE8;&#xC57D;&#xC810;&#xC744;-&#xCC3E;&#xB294;-&#xBC29;&#xBC95;"><a href="#&#xCDE8;&#xC57D;&#xC810;&#xC744;-&#xCC3E;&#xB294;-&#xBC29;&#xBC95;" class="headerlink" title="&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xBC29;&#xBC95;"></a>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xBC29;&#xBC95;</h1><p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xC624;&#xB514;&#xD305;</li>
<li>&#xC190; &#xD37C;&#xC9D5;</li>
<li>&#xD37C;&#xC9D5;</li>
</ol>
<p>&#xC77C;&#xB2E8; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC; &#xC624;&#xB514;&#xD305;&#xC758; &#xACBD;&#xC6B0; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xAC00; &#xC788;&#xC5B4;&#xC57C;&#xACA0;&#xC8E0;?? &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74;&#xC11C; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD0D0;&#xC0C9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xAD6D;&#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xB294; &#xAC70;&#xC758; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774;&#xB124;&#xC694; &#x3160;&#x3160; &#xC74C; &#xD5E5;&#xC2A4;&#xB808;&#xC774; &#xBCF4;&#xBA74;&#xC11C; &#xD558;&#xB294; &#xAC83;&#xB3C4; &#xD574;&#xB2F9; &#xC0AC;&#xD56D;&#xC774; &#xB418;&#xB824;&#xB098;&#xC694;? &#xBB50; &#xADF8;&#xB0E5; &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xACE0; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB450;&#xB8E8;&#xB450;&#xB8E8; &#xB9D0;&#xD558;&#xB294; &#xAC70;&#xB77C;&#xACE0; &#xBCF4;&#xBA74; &#xB418;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xC190;&#xD37C;&#xC9D5; &#xAC19;&#xC740; &#xACBD;&#xC6B0; &#xC81C;&#xAC00; &#xCC98;&#xC74C; &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#xC744; &#xD558;&#xBA74;&#xC11C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD588;&#xB358; &#xBC29;&#xBC95;&#xC778;&#xB370;&#xC694;. &#xADF8;&#xB0E5; &#xB178;&#xAC00;&#xB2E4;&#xC785;&#xB2C8;&#xB2E4;. Untrust input&#xC744; &#xC9C1;&#xC811; &#xC190;&#xC73C;&#xB85C; &#xB123;&#xAC70;&#xB098; &#xC218;&#xC815;&#xD574;&#xAC00;&#xBA74;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Untrust input &#xC774; &#xD30C;&#xC77C;&#xC77C; &#xB54C; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xAC00;&#xBA74;&#xC11C; &#xC9C1;&#xC811; &#xC218;&#xC815;&#xD574;&#xAC00;&#xBA74;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xBCF4;&#xBA74; &#xBB54;&#xAC00; &#xC774; &#xC704;&#xCE58;&#xB294; &#xBB34;&#xC2A8; &#xC5ED;&#xD560;&#xC774;&#xB77C;&#xB294; &#xB290;&#xB08C;&#xC774; &#xC880; &#xC635;&#xB2C8;&#xB2E4;. (&#xC544;&#xB9C8;? &#xB514;&#xBC84;&#xAE45;&#xB3C4; &#xAC19;&#xC774; &#xD558;&#xBA74;&#xC11C; &#xC880; &#xB9CE;&#xC774; &#xC0BD;&#xC9C8;&#xD574;&#xC57C; &#xD558;&#xAE34; &#xD558;&#xC9C0;&#xB9CC;). &#xBB3C;&#xB860; &#xC774;&#xAC83;&#xB3C4; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC774; &#xB2E8;&#xC21C;&#xD560; &#xACBD;&#xC6B0;&#xC774;&#xAE30;&#xB294; &#xD558;&#xC9C0;&#xB9CC;&#xC694;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;&#xC11C; &#xBB38;&#xC11C; &#xD3EC;&#xB9F7;&#xC778; &#xACBD;&#xC6B0;&#xC5D0; &#xD30C;&#xC77C;&#xC5D0; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xC55E;&#xC5D0; &#xC22B;&#xC790;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xC774;&#xAC8C; &#xB300;&#xCDA9; &#xB4A4;&#xC5D0; &#xC788;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xD3F0;&#xD2B8; &#xC815;&#xBCF4;&#xC774;&#xAC70;&#xB098; &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xAE38;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xBC14;&#xB85C; &#xBCF4;&#xACE0; &#xC54C;&#xAC70;&#xB098; &#xBA87; &#xBC88;&#xC758; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xC8E0;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xB098;&#xD558;&#xB098; &#xC0BD;&#xC9C8;&#xC744; &#xD574;&#xAC00;&#xBA74;&#xC11C; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xD574;&#xB97C; &#xB192;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xC790;&#xAE30;&#xAC00; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xCD94;&#xCE21;&#xC744; &#xD560; &#xC218; &#xC788;&#xACE0; &#xC778;&#xD48B;&#xC744; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xC54C;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xAE30;&#xC5D0;&#xB294; &#xBE44;&#xAD50;&#xC801; &#xD3B8;&#xD558;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC9C1;&#xC811; &#xC870;&#xC791;&#xC744; &#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC2DC;&#xAC04;&#xC774; &#xB9CE;&#xC774; &#xB4E4;&#xACE0; &#xBAA8;&#xB4E0; &#xD3EC;&#xB9F7;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB294; &#xAC83;&#xB3C4; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xD30C;&#xC77C;&#xC774; &#xC555;&#xCD95;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xC0C1;&#xD0DC;&#xB77C;&#xBA74; &#xB354;&#xB354;&#xC6B1; &#xC774;&#xAC8C; &#xBB58; &#xD558;&#xB294;&#xC9C0; &#xC54C; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xD37C;&#xC9D5; &#xD560; &#xB54C; &#xB354; &#xB9CE;&#xC774; &#xC4F0;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC5B4;&#xCC28;&#xD53C; &#xADF8;&#xB0E5; &#xBBA4;&#xD14C;&#xC774;&#xC158;&#xC744; &#xD560;&#xAC70; &#xBCF4;&#xD1B5; &#xD37C;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xD37C;&#xC9D5;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xD37C;&#xC800;&#xC5D0;&#xC11C;&#xB294; &#xC8FC;&#xC5B4;&#xC9C4; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xC784;&#xC758;&#xB85C; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xC6D0;&#xBCF8; &#xD30C;&#xC77C;&#xACFC; &#xD06C;&#xB798;&#xC2DC; &#xD30C;&#xC77C; &#xADF8;&#xB9AC;&#xACE0; &#xD06C;&#xB798;&#xC2DC; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xC8E0;. &#xC800;&#xB3C4; &#xD37C;&#xC9D5;&#xC744; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD37C;&#xC800;&#xB97C; &#xC9C1;&#xC811; &#xC9DC;&#xB3C4; &#xB418;&#xC9C0;&#xB9CC; &#xACF5;&#xAC1C;&#xB41C; &#xBB34;&#xB8CC; &#xD37C;&#xC800;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;!!! &#x314E;&#x314E; &#xAC1C;&#xC774;&#xB4DD; BFF, Peach, AFL &#xB610; &#xADF8;&#xB9AC;&#xACE0;&#x2026; &#xBB50; &#xC788;&#xC5C8;&#xB354;&#xB77C;&#x2026; &#x314B;&#x314B;&#x314B; &#xAE30;&#xC5B5;&#xC774; &#xC798; &#xC548; &#xB098;&#xB294;&#xB370; &#xBB50; &#xC554;&#xD2BC; &#x314B;&#x314B;&#x314B;&#x314B; &#xC800;&#xB294; BFF&#xB97C; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. BFF&#xB294; &#xC544;&#xB798; &#xB9C1;&#xD06C;&#xB97C; &#xB4E4;&#xC5B4;&#xAC00;&#xBA74; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cert.org/vulnerability-analysis/tools/bff.cfm">https://www.cert.org/vulnerability-analysis/tools/bff.cfm</a></p>
<p>&#xC6D0;&#xB798; &#xC774;&#xB984;&#xC740; FOE &#xC600;&#xB294;&#xB370; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB418;&#xBA74;&#xC11C; BFF&#xB85C; &#xC774;&#xB984;&#xC774; &#xBC14;&#xB00C;&#xC5C8;&#xB124;&#xC694; &#x314B;&#x314B; &#xCC38;&#xACE0;&#xB85C; &#xB180;&#xB780; &#xAC8C; &#xC6D0;&#xB798; FOE&#xAC00; &#xC708;&#xB3C4;&#xC6B0;&#xB9CC; &#xC9C0;&#xC6D0;&#xD588;&#xC5C8;&#xB294;&#xB370; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB418;&#xBA74;&#xC11C; &#xB9E5;&#xC774;&#xB791; &#xB9AC;&#xB205;&#xC2A4;&#xB3C4; &#xC9C0;&#xC6D0;&#xD558;&#xAC8C; &#xB410;&#xB124;&#xC694;!! &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xB9E5;&#xC5D0;&#xC11C; &#xBA87; &#xAC1C; &#xB3CC;&#xB824;&#xBD24;&#xB294;&#xB370; &#xBB54;&#xAC00; &#xB354; &#xB9CE;&#xC774; &#xD130;&#xC9C0;&#xB294; &#xC774; &#xB290;&#xB08C;&#xC801;&#xC778; &#xB290;&#xB08C;&#x2026; &#xB098;&#xC911;&#xC5D0; &#xB9E5; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xB3C4; &#xD574;&#xBD10;&#xC57C;&#xACA0;&#xB124;&#xC694; &#x314B;&#x314B;&#x314B;</p>
<p>&#xC554;&#xD2BC; BFF &#xB4F1; &#xD37C;&#xC800;&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xAC80;&#xC0C9;&#xB9CC; &#xD574;&#xB3C4; &#xB9CE;&#xC774; &#xB098;&#xC624;&#xB2C8; &#xC2A4;&#xD0B5;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;</p>
<h1 id="&#xD0C0;&#xAE43;-&#xC120;&#xC815;"><a href="#&#xD0C0;&#xAE43;-&#xC120;&#xC815;" class="headerlink" title="&#xD0C0;&#xAE43; &#xC120;&#xC815;"></a>&#xD0C0;&#xAE43; &#xC120;&#xC815;</h1><p>&#xD0C0;&#xAE43;&#xC744; &#xC120;&#xC815;&#xD558;&#xB294; &#xAC74; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;!! &#xC65C;&#xB0D0;!!! &#xD3EC;&#xC0C1; &#xAE08;&#xC561;&#xC774; &#xB2EC;&#xB77C;&#xC9C0;&#xB2C8;&#xAE4C;&#xC694;!!! &#xADF8;&#xB7FC; &#xBA85;&#xC608;&#xC758; &#xC804;&#xB2F9; &#xC21C;&#xC704;&#xAC00; &#xBCC0;&#xB3D9;&#xC774; &#xBCC4;&#xB85C; &#xC548;&#xB418;&#xB2C8;&#xAE4C;&#xC694;!!!!(&#xBB50; &#xB531;&#xD788; &#xC0C1;&#xAD00;&#xC740; &#xC5C6;&#xC9C0;&#xB9CC;) &#xC554;&#xD2BC; &#xD0C0;&#xAE43;&#xC744; &#xC120;&#xC815;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xBC84;&#xADF8; &#xD5CC;&#xD305;&#xC744; &#xD558;&#xB294; &#xBAA9;&#xC801;&#xC744; &#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xB09C; &#xB3C8;&#xC744; &#xBC8C;&#xACE0; &#xC2F6;&#xB2E4;!!!! or &#xC81C;&#xB85C;&#xB370;&#xC774; &#xB9DB;&#xC774;&#xB77C;&#xB3C4; &#xBCF4;&#xACE0; &#xC2F6;&#xC5B4;&#xC694; &#x3160;&#x3160; &#xD558;&#xB098;&#xB9CC; &#xCC3E;&#xC544;&#xBCF4;&#xACE0; &#xC2F6;&#xC5B4;&#xC694; &#x3160;&#x3160;&#x3160;<ul>
<li>&#xADF8;&#xB7FC; &#xC27D;&#xACE0; &#xC775;&#xC2A4; &#xD558;&#xAE30; &#xC26C;&#xC6B4; &#xAC70; &#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xB9AC;&#xC5BC;&#xB8E8; &#xADF8;&#xB0E5; &#xB0A0;&#xB85C; &#xBA39;&#xC73C;&#xBA74;&#xC11C; &#xB3C8; &#xB9CE;&#xC774; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC880; &#xC788;&#xC5B4;&#xC694; &#x314B;&#x314B; &#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C; &#xBCA4;&#xB354; &#xC774;&#xB984;&#xC740; &#xAE4C;&#xC9C0; &#xC54A;&#xB294; &#xAC78;&#xB85C;&#x2026; &#xC798; &#xCC3E;&#xC544;&#xBCF4;&#xC2DC;&#xBA74; &#xC740;&#xADFC;&#xD788; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; &#xBAA8;&#xB4C8;&#xC5D0; Rebase, ASLR &#xC548; &#xAC78;&#xB824; &#xC788;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB3C4; &#xBD24;&#xC5B4;&#xC694; &#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;&#x314B;</li>
</ul>
</li>
<li>&#xB09C; &#xC9C0;&#xC2DD;&#xACFC; &#xBA85;&#xC608;&#xB97C; &#xC5BB;&#xACA0;&#xB2E4;!!!<ul>
<li>CVE&#xAC00; &#xB098;&#xC62C;&#xB9CC;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB77C;&#xB358;&#xAC00; &#xCEE4;&#xB110;&#xC774;&#xB77C;&#xB358;&#xAC00;&#x2026;. (&#xC544; &#xADFC;&#xB370; &#xC65C; &#xC694;&#xC0C8; &#xC8FC;&#xBCC0;&#xC5D0; &#xC708;&#xB3C4;&#xC6B0; &#xCEE4;&#xB110; &#xD558;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xB9CE;&#xC544;&#xC9C4; &#xB290;&#xB08C;&#xC774;&#xC9C0; &#xB0B4;&#xAC00; &#xC2DC;&#xC791;&#xD558;&#xB824;&#xACE0; &#xD558;&#xB2C8;&#xAE4C; &#xC8FC;&#xBCC0;&#xC5D0;&#xC11C; &#xB2E4;&#xD558;&#xB124; &#xB2E4;&#xB4E4; &#xC708;&#xB3C4;&#xC6B0; &#xCEE4;&#xB110; &#xD558;&#xC9C0; &#xB9C8;&#xC148;)</li>
</ul>
</li>
<li>&#xADF8;&#xB7FC; &#xB098;&#xBA38;&#xC9C4; &#xBB50;&#xB0D0;!!!!<ul>
<li>&#xADF8;&#xB0E5; &#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;&#x2026;&#x2026;. &#xC2EC;&#xC2EC;&#xD574;&#xC11C; &#xD558;&#xB294; &#xAC70;&#xC608;&#xC694;&#x2026;&#x2026;.;;;</li>
</ul>
</li>
</ol>
<p>&#xC7A5;&#xB09C;&#xC774;&#xACE0; &#x314B;&#x314B;&#x314B; &#xC74C; &#xADF8;&#xB798;&#xC11C; &#xD0C0;&#xAE43;&#xC744; &#xB0B4;&#xAC00; &#xC544;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C;&#xB9CC; &#xD560; &#xAC83;&#xC774;&#xB0D0;?? &#x3134;&#x3134; &#xADF8;&#xAC74; &#xC544;&#xB2C8;&#xC8E0;</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://software.naver.com/main.nhn">http://software.naver.com/main.nhn</a></p>
<p>&#xB124;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xC774;&#xB807;&#xAC8C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC790;&#xB8CC;&#xC2E4;&#xC744; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBCF4;&#xAE09;&#xB3C4;&#xB098; &#xC774;&#xB7F0; &#xAC74; &#xC815;&#xD655;&#xD55C; &#xC218;&#xCE58;&#xB85C;&#xB294; &#xC548; &#xB098;&#xC640; &#xC788;&#xC9C0;&#xB9CC; &#xCD94;&#xCE21;&#xC740; &#xAC00;&#xB2A5;&#xD558;&#xC8E0; &#x314B;&#x314B; &#xC778;&#xAE30; &#xB9CE;&#xC740; &#xAC8C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xB9CE;&#xC774; &#xC4F0;&#xB294; &#xAC70;&#xACA0;&#xC8E0;?? &#xB124;&#xC774;&#xBC84;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xB2E4;&#xC74C;&#xC774;&#xB098; &#xB2E4;&#xB978; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C;&#xB3C4; &#xBE44;&#xC2B7;&#xD55C; &#xAC83;&#xB4E4;&#xC774; &#xC788;&#xC73C;&#xB2C8; &#xC774;&#xB7F0; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xCC3E;&#xC73C;&#xC2DC;&#xBA74; &#xB420; &#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xC2DC;&#xB4DC;-&#xD30C;&#xC77C;"><a href="#&#xC2DC;&#xB4DC;-&#xD30C;&#xC77C;" class="headerlink" title="&#xC2DC;&#xB4DC; &#xD30C;&#xC77C;"></a>&#xC2DC;&#xB4DC; &#xD30C;&#xC77C;</h1><p>&#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC591;&#xC9C8;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xB098;&#xC624;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC591;&#xC9C8;&#xC758; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB123;&#xB294; &#xAC83;&#xB3C4; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4; &#x314B;&#x314B;&#x314B;</p>
<p>&#xBA3C;&#xC800; &#xD0C0;&#xAE43; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC744; &#xD37C;&#xC9D5; &#xD560; &#xAC83;&#xC778;&#xC9C0; &#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xBBF8;&#xB514;&#xC5B4; &#xD50C;&#xB808;&#xC774;&#xC5B4;&#xC758; &#xACBD;&#xC6B0;, &#xC74C;&#xC545;&#xC774;&#xB098; &#xB3D9;&#xC601;&#xC0C1;&#xC758; &#xD3EC;&#xB9F7;&#xB9CC; &#xACB0;&#xC815;&#xD558;&#xBA74; &#xB418;&#xAE34; &#xD558;&#xC9C0;&#xB9CC;(&#xADF8;&#xB807;&#xB2E4;&#xACE0;&#xB294; &#xD558;&#xC9C0;&#xB9CC; &#xBC84;&#xC804;&#xC774;&#xB098; &#xC555;&#xCD95; &#xBC29;&#xC2DD;, &#xC6B4;&#xC601;&#xBC29;&#xC2DD; &#xB4F1;&#xB4F1;&#xC758; &#xCC28;&#xC774;&#xB85C; &#xAE30;&#xB2A5;&#xC758; &#xCC28;&#xC774;&#xAC00; &#xC880; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAC19;&#xC740; &#xD3EC;&#xB9F7;&#xC774;&#xB354;&#xB77C;&#xB3C4; &#xC0D8;&#xD50C;&#xC774; &#xB9CE;&#xC744;&#xC218;&#xB85D; &#xC88B;&#xC8E0;), &#xC6CC;&#xB4DC;&#xB098; &#xD55C;&#xAE00; &#xAC19;&#xC774; &#xAE30;&#xB2A5;&#xC774; &#xB9CE;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC740; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xD37C;&#xC9D5;&#xC744; &#xC9C4;&#xD589;&#xD560;&#xC9C0;&#xB97C; &#xACB0;&#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC548; &#xD558;&#xACE0; &#xADF8;&#xB0E5; &#xB9C9; &#xB9CC;&#xB4E4;&#xBA74; &#xB9AC;&#xBC84;&#xC2F1; &#xD560; &#xB54C; &#xD544;&#xC694; &#xC5C6;&#xB294; &#xBD80;&#xBD84; &#xB9AC;&#xBC84;&#xC2F1; &#xD558;&#xB290;&#xB77C; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44;&#xD558;&#xAE30; &#xC77C;&#xC464;&#xC785;&#xB2C8;&#xB2E4; &#x3160;&#x3160; &#xB530;&#xB77C;&#xC11C; &#xBA3C;&#xC800; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC368;&#xBCF4;&#xBA74;&#xC11C; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xAD1C;&#xCC2E;&#xACA0;&#xB2E4; &#xC2F6;&#xC740; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xC11C; &#xD558;&#xB098;&#xD558;&#xB098;&#xC5D0; &#xB300;&#xD55C; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB530;&#xB85C; &#xC81C;&#xC791;&#xD558;&#xB294; &#xAC8C; &#xC81C;&#xC77C; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC81C;&#xC77C; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC740; &#xC9C1;&#xC811; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xC81C;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC9C1;&#xC811; &#xC81C;&#xC791;&#xD558;&#xBA74; &#xC548;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC6D0;&#xD558;&#xB294; &#xB370;&#xB85C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xACE0; &#xD0C0;&#xAE43;&#xC774; &#xBA85;&#xD655;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9AC;&#xBC84;&#xC2F1; &#xD560; &#xB54C; &#xD3B8;&#xB9AC;&#xD568;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC9C1;&#xC811; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xAC70;&#xB294; &#xB4A4;&#xC5D0;&#xC11C; &#xB610; &#xC598;&#xAE30;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C1;&#xC811; &#xB9CC;&#xB4E4;&#xAE30; &#xC560;&#xB9E4;&#xD558;&#xAC70;&#xB098; &#xADC0;&#xCC2E;&#xC744; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xAD6C;&#xAE00; &#xAC80;&#xC0C9;&#xC73C;&#xB85C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. Filetype&#xC73C;&#xB85C; &#xC6D0;&#xD558;&#xB294; &#xD3EC;&#xB9F7; &#xCC3E;&#xC544;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xC2DC;&#xB4DC; &#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<hr>
<p>Part 2&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xC81C;&#xBCF4;&#xD588;&#xB358; &#xBBF8;&#xB514;&#xC5B4; &#xD50C;&#xB808;&#xC774;&#xC5B4; KMPlayer&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;&#xC5D0; &#xB300;&#xD574; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE00;&#xB85C; &#xB3CC;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/bug-hunting/">bug hunting</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/03/08/idioth/2021-03-08/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] Microsoft Exchange server    </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/03/07/idioth/ghidra_part2/">
                    <span class="hidden-mobile">[Research] Re:versing  ghidra  Part 2 - Data, Functions, Scripts</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/';
        this.page.identifier = '/2021/03/07/l0ch/bughunting-tutorial/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]   Part 1&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
