

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 2 - Data, Functions, Scripts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 3 - tips for IDA User (Here!)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 4 - Malware Analysis (1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 5 - Malware Analysis (2)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB0A0;&amp;#xC528;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xB354;&amp;#xC6CC;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD04; &amp;#xC637;&amp;#xC744; &amp;#xAEBC;&amp;#xB0BC; &amp;#xACA8;&amp;#xB97C;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xCC3E;&amp;#xC544;&amp;#xC628; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xB290;&amp;#xB08C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xAD50;&amp;#xCC28;&amp;#xB294; &amp;#xB610; &amp;#xC5C4;&amp;#xCCAD; &amp;#xCEE4;&amp;#xC11C; &amp;#xBC24;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xC637;&amp;#xC744; &amp;#xC785;&amp;#xC73C;&amp;#xBA74; &amp;#xB0AE;&amp;#xC5D0;&amp;#xB294; &amp;#xBD88;&amp;#xD0C0;&amp;#xB294; &amp;#xC0B6;&amp;#xC744; &amp;#xC0B4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; BMW&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB365;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Bus&amp;#xC640; Metro&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F4;&amp;#xAE30;&amp;#xB85C; &amp;#xD6C4;&amp;#xB048;&amp;#xD6C4;&amp;#xB048;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC774; &amp;#xB0A0;&amp;#xC528;&amp;#xC5D0; Walk&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB540;&amp;#xC774; &amp;#xCC28;&amp;#xB294;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB0A0;&amp;#xC528;&amp;#xB3C4; &amp;#xB365;&amp;#xACE0; &amp;#xD53C;&amp;#xACE4;&amp;#xD558;&amp;#xB2C8; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xC544;&amp;#xBA54;&amp;#xB9AC;&amp;#xCE74;&amp;#xB178; &amp;#xD55C; &amp;#xC794; &amp;#xB9C8;&amp;#xC2DC;&amp;#xBA74;&amp;#xC11C; &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xC778; IDA &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; ghidra &amp;#xD301;! &amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;API-call-parameter-&amp;#xC790;&amp;#xB3D9;-&amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34;&gt;&lt;a href=&#34;#API-call-parameter-&amp;#xC790;&amp;#xB3D9;-&amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34; class=&#34;headerlink&#34; title=&#34;API call parameter &amp;#xC790;&amp;#xB3D9; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34;&gt;&lt;/a&gt;API call parameter &amp;#xC790;&amp;#xB3D9; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; Windows API&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAC01; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB85C; &amp;#xB2EC;&amp;#xC544;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; analysis&amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; ghidra&amp;#xB294; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &lt;code&gt;memset&lt;/code&gt;&amp;#xC774;&amp;#xB77C; &amp;#xC801;&amp;#xD78C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xADF8;&amp;#xAC70;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E4;&amp;#xCE58;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;&amp;#x2026; &amp;#xD55C; &amp;#xBC88; &amp;#xB354; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8; &amp;#xC880; &amp;#xBD88;&amp;#xD3B8;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;analysis option&amp;#xC5D0;&amp;#xC11C; WindowsPE x86 Propagate External Parameters &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xCCB4;&amp;#xD06C;&amp;#xD55C; &amp;#xD6C4; Analyze&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;..?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC778;&amp;#xC9C0;, &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xACFC; &amp;#xC774;&amp;#xB984;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB450; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD639;&amp;#xC2DC;.. &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xAE4C;&amp;#xBA39;&amp;#xACE0; Analyze&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD73;&amp;#xC774; &amp;#xAED0;&amp;#xB2E4; &amp;#xD0AC; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Analysis - One Shot - WindowsPE x86 Propagate External Parameters&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;flag-constant-&amp;#xC124;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#flag-constant-&amp;#xC124;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;flag constant &amp;#xC124;&amp;#xC815;&#34;&gt;&lt;/a&gt;flag constant &amp;#xC124;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC744; &amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;CreateFileA()&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; API&amp;#xB4E4;&amp;#xC740; flag &amp;#xAC12;&amp;#xC5D0; &lt;code&gt;0x00000004&lt;/code&gt;&amp;#xC774; &lt;code&gt;FILE_SHARE_DELETE&lt;/code&gt;&amp;#xB77C;&amp;#xB358;&amp;#xC9C0;&amp;#xC758; constant&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC774; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#x2018;Use standard symbolic constant&amp;#x2019;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC12;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%208.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;CreateProcessA&lt;/code&gt;&amp;#xC758; &lt;code&gt;0x80000000&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC740; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%209.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2010.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB611;&amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;0x80000000&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &lt;code&gt;CREATE_NO_WINODW&lt;/code&gt;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB611;&amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x2018;Set Equation(&amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4; E)&amp;#x2019;&amp;#xB97C; &amp;#xB204;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2011.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2012.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCC3D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2013.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xB728;&amp;#xB294; &amp;#xCC3D;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574; &amp;#xBD24;&amp;#xC744; &amp;#xB54C;, &amp;#xD070; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC5C6;&amp;#xC8E0;? &amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2014.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2015.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;0x80000000&lt;/code&gt;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBD84;&amp;#xB7C9;-&amp;#xC870;&amp;#xC808;-&amp;#xC2E4;&amp;#xD328;&#34;&gt;&lt;a href=&#34;#&amp;#xBD84;&amp;#xB7C9;-&amp;#xC870;&amp;#xC808;-&amp;#xC2E4;&amp;#xD328;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;!&#34;&gt;&lt;/a&gt;&amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;!&lt;/h1&gt;&lt;p&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC744; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! unreachable code &amp;#xB4F1;&amp;#xC758; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;&amp;#x2026; (&amp;#xBD84;&amp;#xBA85; &amp;#xC608;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815; &amp;#xC544;&amp;#xB2C8;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB098;&amp;#x2026;? &amp;#x3160;&amp;#x3160;) IDAPython&amp;#xC774;&amp;#xB098; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0; &amp;#xB4F1;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; WinAPI&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xB2E4;&amp;#xB8EC; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xAE09;&amp;#xD558;&amp;#xAC8C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. Part 4&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; ghidra&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC640;! &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xBA74; API &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, flag &amp;#xAC12;&amp;#xB3C4; hex&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; constant &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34;&amp;#xB098;&amp;#xB3C4; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD558;&amp;#xC796;&amp;#xC544;? &amp;#xB9DE;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB807;&amp;#xC8E0;? &amp;#x2026;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD48D;&amp;#xC871;&amp;#xD55C; &amp;#xBD84;&amp;#xB7C9;&amp;#xC758; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2016.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC15;&amp;#xC73C;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Re:versing으로 시작하는 ghidra 생활 Part 3 - A few tips for IDA User - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 2 - Data, Functions, Scripts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 3 - tips for IDA User (Here!)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 4 - Malware Analysis (1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 5 - Malware Analysis (2)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xCC3E;&amp;#xC544;&amp;#xBD59;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xB0A0;&amp;#xC528;&amp;#xAC00; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB098;&amp;#xAC8C; &amp;#xB354;&amp;#xC6CC;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBD04; &amp;#xC637;&amp;#xC744; &amp;#xAEBC;&amp;#xB0BC; &amp;#xACA8;&amp;#xB97C;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xAC11;&amp;#xC790;&amp;#xAE30; &amp;#xC5EC;&amp;#xB984;&amp;#xC774; &amp;#xCC3E;&amp;#xC544;&amp;#xC628; &amp;#xAC83;&amp;#xB9CC; &amp;#xAC19;&amp;#xC740; &amp;#xB290;&amp;#xB08C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xAD50;&amp;#xCC28;&amp;#xB294; &amp;#xB610; &amp;#xC5C4;&amp;#xCCAD; &amp;#xCEE4;&amp;#xC11C; &amp;#xBC24;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xC637;&amp;#xC744; &amp;#xC785;&amp;#xC73C;&amp;#xBA74; &amp;#xB0AE;&amp;#xC5D0;&amp;#xB294; &amp;#xBD88;&amp;#xD0C0;&amp;#xB294; &amp;#xC0B6;&amp;#xC744; &amp;#xC0B4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; BMW&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB365;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Bus&amp;#xC640; Metro&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC758; &amp;#xC5F4;&amp;#xAE30;&amp;#xB85C; &amp;#xD6C4;&amp;#xB048;&amp;#xD6C4;&amp;#xB048;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC774; &amp;#xB0A0;&amp;#xC528;&amp;#xC5D0; Walk&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xB9C8;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB540;&amp;#xC774; &amp;#xCC28;&amp;#xB294;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB0A0;&amp;#xC528;&amp;#xB3C4; &amp;#xB365;&amp;#xACE0; &amp;#xD53C;&amp;#xACE4;&amp;#xD558;&amp;#xB2C8; &amp;#xC2DC;&amp;#xC6D0;&amp;#xD55C; &amp;#xC544;&amp;#xBA54;&amp;#xB9AC;&amp;#xCE74;&amp;#xB178; &amp;#xD55C; &amp;#xC794; &amp;#xB9C8;&amp;#xC2DC;&amp;#xBA74;&amp;#xC11C; &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xC8FC;&amp;#xC81C;&amp;#xC778; IDA &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; ghidra &amp;#xD301;! &amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;API-call-parameter-&amp;#xC790;&amp;#xB3D9;-&amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34;&gt;&lt;a href=&#34;#API-call-parameter-&amp;#xC790;&amp;#xB3D9;-&amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34; class=&#34;headerlink&#34; title=&#34;API call parameter &amp;#xC790;&amp;#xB3D9; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&#34;&gt;&lt;/a&gt;API call parameter &amp;#xC790;&amp;#xB3D9; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; Windows API&amp;#xAC00; &amp;#xD638;&amp;#xCD9C;&amp;#xB420; &amp;#xACBD;&amp;#xC6B0;, &amp;#xAC01; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB85C; &amp;#xB2EC;&amp;#xC544;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; analysis&amp;#xB97C; &amp;#xD560; &amp;#xB54C; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; ghidra&amp;#xB294; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB97C; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &lt;code&gt;memset&lt;/code&gt;&amp;#xC774;&amp;#xB77C; &amp;#xC801;&amp;#xD78C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xADF8;&amp;#xAC70;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9E4;&amp;#xCE58;&amp;#xB97C; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xAE34; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#xB9CC;&amp;#x2026; &amp;#xD55C; &amp;#xBC88; &amp;#xB354; &amp;#xC0DD;&amp;#xAC01;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8; &amp;#xC880; &amp;#xBD88;&amp;#xD3B8;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;analysis option&amp;#xC5D0;&amp;#xC11C; WindowsPE x86 Propagate External Parameters &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xCCB4;&amp;#xD06C;&amp;#xD55C; &amp;#xD6C4; Analyze&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;..?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC778;&amp;#xC9C0;, &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC758; &amp;#xC790;&amp;#xB8CC;&amp;#xD615;&amp;#xACFC; &amp;#xC774;&amp;#xB984;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB450; &amp;#xCF54;&amp;#xBA58;&amp;#xD2B8;&amp;#xB85C; &amp;#xC791;&amp;#xC131;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xD639;&amp;#xC2DC;.. &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xAE4C;&amp;#xBA39;&amp;#xACE0; Analyze&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xAD73;&amp;#xC774; &amp;#xAED0;&amp;#xB2E4; &amp;#xD0AC; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Analysis - One Shot - WindowsPE x86 Propagate External Parameters&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;flag-constant-&amp;#xC124;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#flag-constant-&amp;#xC124;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;flag constant &amp;#xC124;&amp;#xC815;&#34;&gt;&lt;/a&gt;flag constant &amp;#xC124;&amp;#xC815;&lt;/h1&gt;&lt;p&gt;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC744; &amp;#xD558;&amp;#xB2E4; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;CreateFileA()&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; API&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; API&amp;#xB4E4;&amp;#xC740; flag &amp;#xAC12;&amp;#xC5D0; &lt;code&gt;0x00000004&lt;/code&gt;&amp;#xC774; &lt;code&gt;FILE_SHARE_DELETE&lt;/code&gt;&amp;#xB77C;&amp;#xB358;&amp;#xC9C0;&amp;#xC758; constant&amp;#xB97C; &amp;#xAC16;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xB9CE;&amp;#xC774; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#x2018;Use standard symbolic constant&amp;#x2019;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xAC12;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%208.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;CreateProcessA&lt;/code&gt;&amp;#xC758; &lt;code&gt;0x80000000&lt;/code&gt; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC740; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xC5EC; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%209.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2010.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB611;&amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;0x80000000&lt;/code&gt; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &lt;code&gt;CREATE_NO_WINODW&lt;/code&gt;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB611;&amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x2018;Set Equation(&amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4; E)&amp;#x2019;&amp;#xB97C; &amp;#xB204;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2011.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2012.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCC3D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2013.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xB728;&amp;#xB294; &amp;#xCC3D;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD574; &amp;#xBD24;&amp;#xC744; &amp;#xB54C;, &amp;#xD070; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC5C6;&amp;#xC8E0;? &amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xAE30;&amp;#xC11C; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2014.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2015.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;0x80000000&lt;/code&gt;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &lt;code&gt;CREATE_NO_WINDOW&lt;/code&gt;&amp;#xB85C; &amp;#xBC14;&amp;#xB010; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xBD84;&amp;#xB7C9;-&amp;#xC870;&amp;#xC808;-&amp;#xC2E4;&amp;#xD328;&#34;&gt;&lt;a href=&#34;#&amp;#xBD84;&amp;#xB7C9;-&amp;#xC870;&amp;#xC808;-&amp;#xC2E4;&amp;#xD328;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;!&#34;&gt;&lt;/a&gt;&amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808; &amp;#xC2E4;&amp;#xD328;!&lt;/h1&gt;&lt;p&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD558;&amp;#xAC8C; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC744; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xBC84;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! unreachable code &amp;#xB4F1;&amp;#xC758; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;&amp;#x2026; (&amp;#xBD84;&amp;#xBA85; &amp;#xC608;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8; &amp;#xC124;&amp;#xC815; &amp;#xC544;&amp;#xB2C8;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB00C;&amp;#xC5C8;&amp;#xB098;&amp;#x2026;? &amp;#x3160;&amp;#x3160;) IDAPython&amp;#xC774;&amp;#xB098; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0; &amp;#xB4F1;&amp;#xC740; &amp;#xC774;&amp;#xC804; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; WinAPI&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xB2E4;&amp;#xB8EC; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xAE09;&amp;#xD558;&amp;#xAC8C; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2D9;&amp;#xB2C8;&amp;#xB2E4;. Part 4&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; ghidra&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB824; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC640;! &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB824;&amp;#xBA74; API &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xACE0;, flag &amp;#xAC12;&amp;#xB3C4; hex&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xAC83;&amp;#xBCF4;&amp;#xB2E4; constant &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xBA74; &amp;#xB108;&amp;#xBB34;&amp;#xB098;&amp;#xB3C4; &amp;#xD3B8;&amp;#xB9AC;&amp;#xD558;&amp;#xC796;&amp;#xC544;? &amp;#xB9DE;&amp;#xC8E0;? &amp;#xADF8;&amp;#xB807;&amp;#xC8E0;? &amp;#x2026;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xD48D;&amp;#xC871;&amp;#xD55C; &amp;#xBD84;&amp;#xB7C9;&amp;#xC758; &amp;#xAE00;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/04/idioth/ghidra_part3/Untitled%2016.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA38;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC15;&amp;#xC73C;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xC900;&amp;#xBE44;&amp;#xD574;&amp;#xC624;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/04/04/idioth/ghidra_part3/thumbnail.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/04/04/idioth/ghidra_part3/">

  <title>[Research] Re:versing으로 시작하는 ghidra 생활 Part 3 - A few tips for IDA User - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-04-04 14:00" pubdate>
      2021년 4월 4일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1.1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      21
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Re:versing으로 시작하는 ghidra 생활 Part 3 - A few tips for IDA User</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p><strong>&#xB2E4;&#xB978; &#xD30C;&#xD2B8; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</strong></p>
<p><a href="https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 1 - Overview</a></p>
<p><a href="https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 2 - Data, Functions, Scripts</a></p>
<p>Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 3 - tips for IDA User (Here!)</p>
<p><a href="https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 4 - Malware Analysis (1)</a></p>
<p><a href="https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 5 - Malware Analysis (2)</a></p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xCC3E;&#xC544;&#xBD59;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC11;&#xC790;&#xAE30; &#xB0A0;&#xC528;&#xAC00; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xB354;&#xC6CC;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD04; &#xC637;&#xC744; &#xAEBC;&#xB0BC; &#xACA8;&#xB97C;&#xB3C4; &#xC5C6;&#xC774; &#xAC11;&#xC790;&#xAE30; &#xC5EC;&#xB984;&#xC774; &#xCC3E;&#xC544;&#xC628; &#xAC83;&#xB9CC; &#xAC19;&#xC740; &#xB290;&#xB08C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled.png" srcset="/img/loading.gif" alt></p>
<p>&#xC77C;&#xAD50;&#xCC28;&#xB294; &#xB610; &#xC5C4;&#xCCAD; &#xCEE4;&#xC11C; &#xBC24;&#xC744; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC637;&#xC744; &#xC785;&#xC73C;&#xBA74; &#xB0AE;&#xC5D0;&#xB294; &#xBD88;&#xD0C0;&#xB294; &#xC0B6;&#xC744; &#xC0B4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; BMW&#xAC00; &#xB108;&#xBB34; &#xB365;&#xC2B5;&#xB2C8;&#xB2E4;. Bus&#xC640; Metro&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xC5F4;&#xAE30;&#xB85C; &#xD6C4;&#xB048;&#xD6C4;&#xB048;&#xD558;&#xACE0;&#x2026; &#xC774; &#xB0A0;&#xC528;&#xC5D0; Walk&#xB97C; &#xD558;&#xBA74; &#xB9C8;&#xC2A4;&#xD06C;&#xC5D0;&#xB3C4; &#xB540;&#xC774; &#xCC28;&#xB294;&#x2026;</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%201.png" srcset="/img/loading.gif" alt></p>
<p>&#xB0A0;&#xC528;&#xB3C4; &#xB365;&#xACE0; &#xD53C;&#xACE4;&#xD558;&#xB2C8; &#xC2DC;&#xC6D0;&#xD55C; &#xC544;&#xBA54;&#xB9AC;&#xCE74;&#xB178; &#xD55C; &#xC794; &#xB9C8;&#xC2DC;&#xBA74;&#xC11C; &#xC624;&#xB298;&#xC758; &#xC8FC;&#xC81C;&#xC778; IDA &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC704;&#xD55C; ghidra &#xD301;! &#xC744; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="API-call-parameter-&#xC790;&#xB3D9;-&#xCF54;&#xBA58;&#xD2B8;"><a href="#API-call-parameter-&#xC790;&#xB3D9;-&#xCF54;&#xBA58;&#xD2B8;" class="headerlink" title="API call parameter &#xC790;&#xB3D9; &#xCF54;&#xBA58;&#xD2B8;"></a>API call parameter &#xC790;&#xB3D9; &#xCF54;&#xBA58;&#xD2B8;</h1><p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%202.png" srcset="/img/loading.gif" alt></p>
<p>IDA&#xC758; &#xACBD;&#xC6B0; &#xC704;&#xC640; &#xAC19;&#xC774; Windows API&#xAC00; &#xD638;&#xCD9C;&#xB420; &#xACBD;&#xC6B0;, &#xAC01; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC758; &#xC774;&#xB984;&#xC744; &#xCF54;&#xBA58;&#xD2B8;&#xB85C; &#xB2EC;&#xC544;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%203.png" srcset="/img/loading.gif" alt></p>
<p>&#xD558;&#xC9C0;&#xB9CC; analysis&#xB97C; &#xD560; &#xB54C; &#xAE30;&#xBCF8; &#xC124;&#xC815;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xC744; &#xD55C;&#xB2E4;&#xBA74; ghidra&#xB294; &#xCF54;&#xBA58;&#xD2B8;&#xB97C; &#xB2EC;&#xC544;&#xC8FC;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; <code>memset</code>&#xC774;&#xB77C; &#xC801;&#xD78C; &#xBD80;&#xBD84;&#xC5D0; &#xC788;&#xB294; &#xCF54;&#xBA58;&#xD2B8;&#xB97C; &#xBCF4;&#xBA74; &#xC5B4;&#xB5A0;&#xD55C; &#xD30C;&#xB77C;&#xBBF8;&#xD130; &#xC774;&#xB984;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xACE0; &#xADF8;&#xAC70;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xB9E4;&#xCE58;&#xB97C; &#xD558;&#xBA74; &#xB418;&#xAE34; &#xD569;&#xB2C8;&#xB2E4;&#xB9CC;&#x2026; &#xD55C; &#xBC88; &#xB354; &#xC0DD;&#xAC01;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB2C8; &#xC880; &#xBD88;&#xD3B8;&#xD558;&#xC8E0;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%204.png" srcset="/img/loading.gif" alt></p>
<p>analysis option&#xC5D0;&#xC11C; WindowsPE x86 Propagate External Parameters &#xC635;&#xC158;&#xC744; &#xCCB4;&#xD06C;&#xD55C; &#xD6C4; Analyze&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA74;..?</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%205.png" srcset="/img/loading.gif" alt></p>
<p>&#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC778;&#xC9C0;, &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC758; &#xC790;&#xB8CC;&#xD615;&#xACFC; &#xC774;&#xB984;&#xAE4C;&#xC9C0; &#xBAA8;&#xB450; &#xCF54;&#xBA58;&#xD2B8;&#xB85C; &#xC791;&#xC131;&#xB429;&#xB2C8;&#xB2E4;!</p>
<p>&#xD639;&#xC2DC;.. &#xC635;&#xC158;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xAC78; &#xAE4C;&#xBA39;&#xACE0; Analyze&#xB97C; &#xC9C4;&#xD589;&#xC744; &#xD558;&#xC168;&#xB2E4;&#xBA74; &#xAD73;&#xC774; &#xAED0;&#xB2E4; &#xD0AC; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%206.png" srcset="/img/loading.gif" alt></p>
<p>Analysis - One Shot - WindowsPE x86 Propagate External Parameters&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC9C4;&#xD589;&#xC744; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%207.png" srcset="/img/loading.gif" alt></p>
<h1 id="flag-constant-&#xC124;&#xC815;"><a href="#flag-constant-&#xC124;&#xC815;" class="headerlink" title="flag constant &#xC124;&#xC815;"></a>flag constant &#xC124;&#xC815;</h1><p>&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D; &#xB4F1;&#xC744; &#xD558;&#xB2E4; &#xBCF4;&#xBA74; <code>CreateFileA()</code> &#xB4F1;&#xC758; API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7EC;&#xD55C; API&#xB4E4;&#xC740; flag &#xAC12;&#xC5D0; <code>0x00000004</code>&#xC774; <code>FILE_SHARE_DELETE</code>&#xB77C;&#xB358;&#xC9C0;&#xC758; constant&#xB97C; &#xAC16;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC774; &#xC788;&#xC8E0;.</p>
<p>IDA&#xC5D0;&#xC11C;&#xB294; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xAC12;&#xC744; &#xC6B0;&#xD074;&#xB9AD;&#xD558;&#xC5EC; &#x2018;Use standard symbolic constant&#x2019;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%208.png" srcset="/img/loading.gif" alt></p>
<p><code>CreateProcessA</code>&#xC758; <code>0x80000000</code> &#xD50C;&#xB798;&#xADF8; &#xAC12;&#xC740; <code>CREATE_NO_WINDOW</code>&#xC758; &#xAC12;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xC5EC; &#xC124;&#xC815;&#xD558;&#xBA74;</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%209.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; &#xD45C;&#xC2DC;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2010.png" srcset="/img/loading.gif" alt></p>
<p>ghidra&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD55C; &#xB611;&#xAC19;&#xC740; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. <code>0x80000000</code> &#xBD80;&#xBD84;&#xC744; &#xB611;&#xAC19;&#xC774; <code>CREATE_NO_WINODW</code>&#xB85C; &#xD45C;&#xC2DC;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB611;&#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xC6B0;&#xD074;&#xB9AD;&#xD558;&#xACE0; &#x2018;Set Equation(&#xB2E8;&#xCD95;&#xD0A4; E)&#x2019;&#xB97C; &#xB204;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2011.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2012.png" srcset="/img/loading.gif" alt></p>
<p>&#xD574;&#xB2F9; &#xCC3D;&#xC744; &#xD655;&#xC778;&#xD558;&#xC2DC;&#xBA74; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xAC12;&#xB4E4;&#xC774; &#xB739;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2013.png" srcset="/img/loading.gif" alt></p>
<p>IDA&#xC5D0;&#xC11C; &#xB728;&#xB294; &#xCC3D;&#xACFC; &#xBE44;&#xAD50;&#xD574; &#xBD24;&#xC744; &#xB54C;, &#xD070; &#xCC28;&#xC774;&#xAC00; &#xC5C6;&#xC8E0;? &#xC774;&#xC81C; &#xC800;&#xAE30;&#xC11C; <code>CREATE_NO_WINDOW</code>&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2014.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2015.png" srcset="/img/loading.gif" alt></p>
<p><code>0x80000000</code>&#xC774; &#xBAA8;&#xB450; <code>CREATE_NO_WINDOW</code>&#xB85C; &#xBC14;&#xB010; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xBD84;&#xB7C9;-&#xC870;&#xC808;-&#xC2E4;&#xD328;"><a href="#&#xBD84;&#xB7C9;-&#xC870;&#xC808;-&#xC2E4;&#xD328;" class="headerlink" title="&#xBD84;&#xB7C9; &#xC870;&#xC808; &#xC2E4;&#xD328;!"></a>&#xBD84;&#xB7C9; &#xC870;&#xC808; &#xC2E4;&#xD328;!</h1><p>&#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD558;&#xAC8C; &#xBD84;&#xB7C9; &#xC870;&#xC808;&#xC744; &#xC2E4;&#xD328;&#xD574;&#xBC84;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;! unreachable code &#xB4F1;&#xC758; &#xBD80;&#xBD84;&#xC740; &#xAE30;&#xBCF8; &#xC124;&#xC815;&#xC73C;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xACE0;&#x2026; (&#xBD84;&#xBA85; &#xC608;&#xC804;&#xC5D0;&#xB294; &#xAE30;&#xBCF8; &#xC124;&#xC815; &#xC544;&#xB2C8;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xC740;&#xB370; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xBA74;&#xC11C; &#xBC14;&#xB00C;&#xC5C8;&#xB098;&#x2026;? &#x3160;&#x3160;) IDAPython&#xC774;&#xB098; &#xADF8;&#xB798;&#xD504; &#xBDF0; &#xB4F1;&#xC740; &#xC774;&#xC804; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xC5C8;&#xC8E0;.</p>
<p>&#xC0AC;&#xC2E4; &#xC774; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; WinAPI&#xC5D0; &#xB300;&#xD55C; &#xAC83;&#xC744; &#xB2E4;&#xB8EC; &#xC774;&#xC720;&#xB294; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xB97C; &#xC704;&#xD574;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;&#x2026; &#xAE09;&#xD558;&#xAC8C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. Part 4&#xC5D0;&#xC11C;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; ghidra&#xB85C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB824; &#xD569;&#xB2C8;&#xB2E4;!</p>
<p>&#xC640;! &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xB824;&#xBA74; API &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xC5D0; &#xC5B4;&#xB5A4; &#xAC8C; &#xB4E4;&#xC5B4;&#xAC00;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xC57C; &#xD558;&#xACE0;, flag &#xAC12;&#xB3C4; hex&#xB85C; &#xB098;&#xC624;&#xB294; &#xAC83;&#xBCF4;&#xB2E4; constant &#xC774;&#xB984;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xBA74; &#xB108;&#xBB34;&#xB098;&#xB3C4; &#xD3B8;&#xB9AC;&#xD558;&#xC796;&#xC544;? &#xB9DE;&#xC8E0;? &#xADF8;&#xB807;&#xC8E0;? &#x2026;. &#xB2E4;&#xC74C;&#xC5D0;&#xB294; &#xD48D;&#xC871;&#xD55C; &#xBD84;&#xB7C9;&#xC758; &#xAE00;&#xC744; &#xAC00;&#xC838;&#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xD558;</p>
<p><img src="/2021/04/04/idioth/ghidra_part3/Untitled%2016.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA38;&#xB9AC;&#xB97C; &#xBC15;&#xC73C;&#xBA70; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xB97C; &#xC900;&#xBE44;&#xD574;&#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/reversing/">reversing</a>
                  
                  <a class="hover-with-bg" href="/tags/ghidra/">ghidra</a>
                  
                  <a class="hover-with-bg" href="/tags/ghidra-tutorials/">ghidra tutorials</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/04/04/insu/2021-04-04/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2019-8761: MacOS txt 파일로 html 실행</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/04/03/fabu1ous/2021-04-03/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-21123: Chrome에서 발생하는 확장자 spoofing</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/04/04/idioth/ghidra_part3/';
        this.page.identifier = '/2021/04/04/idioth/ghidra_part3/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Re:versing으로 시작하는 ghidra 생활 Part 3 - A few tips for IDA User&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
