

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; COM&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9D3;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &lt;a href=&#34;https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-yuxing&#34;&gt;COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB17C;&amp;#xBB38; &amp;#xB9AC;&amp;#xBDF0;&lt;/a&gt;&amp;#xB97C; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. COM &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;del&gt;(&amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xB54C; &amp;#xC4F4; &amp;#xC81C; &amp;#xB17C;&amp;#xBB38;&amp;#xC774;&amp;#xB791; &amp;#xBE44;&amp;#xAD50;&amp;#xAC00; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#x2026;)&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: Struct VS Union (Introduction to Unions in C - Youtube) &lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; union&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xD615;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC27D;&amp;#xAC8C; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; union &amp;#xB0B4;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; union&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; struct &amp;#xC4F0;&amp;#xC9C0; &amp;#xAD73;&amp;#xC774; union&amp;#xC744; &amp;#xC4F0;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBB58;&amp;#xAE4C;&amp;#xC694;? union&amp;#xC740; size&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; size&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;COM&amp;#xC740; 1993&amp;#xB144;&amp;#xBD80;&amp;#xD130; &amp;#xB3C4;&amp;#xC785;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xACFC;&amp;#xAC70; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC131;&amp;#xB2A5;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC808;&amp;#xC57D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; COM &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC740; struct &amp;#xB300;&amp;#xC2E0; union&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;30&amp;#xB144;&amp;#xC774; &amp;#xC9C0;&amp;#xB09C; &amp;#xC9C0;&amp;#xAE08;&amp;#xB3C4; COM&amp;#xC740; OLE, ActiveX, Windows Shell &amp;#xB4F1; MS&amp;#xC5D0; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAE30;&amp;#xBC18;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACFC;&amp;#xAC70; COM &amp;#xAC1C;&amp;#xBC1C; &amp;#xC2DC; union type confusion &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; COM&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; COMFUSION&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; COM&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; COM&amp;#xC5D0;&amp;#xC11C; union&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC81C;&amp;#xC2DC;&amp;#xB418;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD00;&amp;#xD589;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows 10 (&amp;#xBC84;&amp;#xC804; 1803 &amp;#xBC0F; 21H2) &amp;#xBC0F; Windows 11 (&amp;#xBC84;&amp;#xC804; 21H2)&amp;#xC5D0;&amp;#xC11C; MS COM &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; union&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xC9C1;/&amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; COM&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; union &amp;#xC120;&amp;#xC5B8; &amp;#xD615;&amp;#xD0DC;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure1&amp;#xC740; COM&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; union &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Non-encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xB9CC; &amp;#xB2E8;&amp;#xB3C5;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xC744; struct&amp;#xB098; class &amp;#xC548;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; Selector &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;re-encapsulated Union&lt;ul&gt;
&lt;li&gt;encapsulated Union&amp;#xC744; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xBA64;&amp;#xBC84;&amp;#xB85C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD615;&amp;#xD0DC;, &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; Union&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Union&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Selector &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xB85C; union &amp;#xBCC0;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD574;&amp;#xB2F9; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC911; 34~35%&amp;#xAC00; union&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; union &amp;#xD615;&amp;#xD0DC;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; union type confusion&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; Figure 3&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; union&amp;#xC778; MetaInfo&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xC815;&amp;#xC218; &amp;#xBA64;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; main &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; for &amp;#xBB38;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; user.info.name &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; UserInfo&amp;#xC758; type &amp;#xAC12;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xACFC;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC815;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COM&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; union&amp;#xC758; 50% &amp;#xC774;&amp;#xC0C1;&amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xBE44;&amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBA64;&amp;#xBC84;&amp;#xB97C; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; users &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; COM &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; COM &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xC778;&amp;#xC790;&amp;#xB97C; IDL(Interface Definition Language) &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC744; &amp;#xC218;&amp;#xD589; &amp;#xD6C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC5B8;&amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; IDL&amp;#xACFC; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; IDL&amp;#xC740; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C4; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IDL &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; MS&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; MIDL &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; .dil &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD6C4; &amp;#xD5E4;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;, &amp;#xD0C0;&amp;#xC785; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;, Proxy&amp;#xC640; Stub&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4; COM &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC740; IDL &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB978;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; IDL &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB97C; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;(&amp;#xC778;&amp;#xC790; &amp;#xAC12; &amp;#xB4F1;)&amp;#xB97C; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC740; COM type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC27D;&amp;#xAC8C; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC774; &amp;#xB2E4; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC548; &amp;#xD558;&amp;#xBA74; &amp;#xB9D0;&amp;#xC9F1; &amp;#xB3C4;&amp;#xB8E8;&amp;#xBB35;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;Design-of-COMFUSION&#34;&gt;&lt;a href=&#34;#Design-of-COMFUSION&#34; class=&#34;headerlink&#34; title=&#34;Design of COMFUSION&#34;&gt;&lt;/a&gt;Design of COMFUSION&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Windows &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC774; type confusion &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; COMFUSION &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC5D0; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xB2E8;&amp;#xACC4;&amp;#xBCC4;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;h3 id=&#34;1-Extracting-COM-Objects&#34;&gt;&lt;a href=&#34;#1-Extracting-COM-Objects&#34; class=&#34;headerlink&#34; title=&#34;1. Extracting COM Objects&#34;&gt;&lt;/a&gt;1. Extracting COM Objects&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; CLSID&amp;#xC640; &amp;#xD574;&amp;#xB2F9; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;HKEY_CLASSES_ROOT/CLSID/$CLSID/InprocServer32&lt;/li&gt;
&lt;li&gt;HKEY_CLASSES_ROOT/CLSID/$CLSID/LocalServer32&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; oleviewdotnet&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xAC01; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; interface pointer identifier(IPID)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xBAA8;&amp;#xB4E0; IPID&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; IPIDTable&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xB610;&amp;#xD55C; oleviewdotnet&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IPIDTable&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xACE0; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C; &amp;#xD6C4; &amp;#xAC01; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-Exploring-Union-Declarations&#34;&gt;&lt;a href=&#34;#2-Exploring-Union-Declarations&#34; class=&#34;headerlink&#34; title=&#34;2. Exploring Union Declarations&#34;&gt;&lt;/a&gt;2. Exploring Union Declarations&lt;/h3&gt;&lt;p&gt;union type confusion&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xC218;, &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;, union &amp;#xBA64;&amp;#xBC84; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Algorithm1&amp;#xC740; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Algorithm1&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; MIDL &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; struct&amp;#xC640; union&amp;#xC744; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &lt;code&gt;u&lt;/code&gt;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xAD6C;&amp;#xCD08;&amp;#xC81C; &lt;code&gt;v&lt;/code&gt;&amp;#xB97C; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;u&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;v&lt;/code&gt;&amp;#xB85C; edge&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; Non-encapsulated Union, encapsulated Union &amp;#x2026;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB77C;&amp;#xBCA8;&amp;#xB9C1;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0; union &amp;#xD615;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xD655;&amp;#xC778; &amp;#x2026; &amp;#x2190; &amp;#xC774; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; Algorithm1&amp;#xC5D0; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xC544;&amp;#xB798; Figure 5&amp;#xC640; &amp;#xAC19;&amp;#xC774; DAG(Directed Acyclic Graph)&amp;#xAC00; &amp;#xAD6C;&amp;#xCD95;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;DAG&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; System Defined Union - VARIANT&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370; VARIANT&amp;#xB294; union&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; vt&amp;#xB77C;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBA85;&amp;#xC2DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; union&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB4EF; VARIANT&amp;#xB3C4; VARIANT&amp;#x2192; vt &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD6C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;union type confusion&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; &amp;#xBCF8; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; union &amp;#xD615;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xC774; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xBC14;&amp;#xB85C; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;System Defined Union&lt;ul&gt;
&lt;li&gt;VARIANT&amp;#xC758; vt &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;re-encapsulated Union&lt;ul&gt;
&lt;li&gt;Figure 6&amp;#xC5D0;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; Struct_20&amp;#xC5D0; VARIANT &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; Struct_20&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB294; Member10&amp;#x2192;vt&amp;#xB97C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC544;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; VARIANT&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; MS &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD588;&amp;#xACE0; &amp;#xADF8; &amp;#xC678;&amp;#xC758; union &amp;#xD615;&amp;#xD0DC;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; case &amp;#xBAA9;&amp;#xB85D;&amp;#xC774; &amp;#xC8FC;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Figure 6&amp;#xB294; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB860;&amp;#xC0C1; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; union type confusion &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC218;&amp;#xD788; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; COMFUSION&amp;#xC740; MILD &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xB300;&amp;#xB85C; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C1;&amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xAC80;&amp;#xC0AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC790;&amp;#xB97C; taint source&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0; CONFUSION&amp;#xC740; &amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC5D0; union member taint&amp;#xC640; discriminant taint&amp;#xB97C; &amp;#xAD6C;&amp;#xBCC4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure 6&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAC01; &amp;#xC778;&amp;#xC790;&amp;#xB294; [IN], [OUT], [IN, OUT] &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; [IN], [IN, OUT]&amp;#xB9CC;&amp;#xC744; Taint Source Filtration&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; Angr&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; taint&amp;#xB85C; &amp;#xC124;&amp;#xC815; &amp;#xD6C4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; taint &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://hackyboiz.github.io/2021/07/10/j0ker/angr_part1/&#34;&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Angr&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&#34;3-Locate-Union-Variables&#34;&gt;&lt;a href=&#34;#3-Locate-Union-Variables&#34; class=&#34;headerlink&#34; title=&#34;3. Locate Union Variables&#34;&gt;&lt;/a&gt;3. Locate Union Variables&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Algorithm 2&amp;#xB294; COMFUSION&amp;#xC774; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xB2E8;&amp;#xACC4;&amp;#xBCC4;&amp;#xB85C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; MAIN&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF; COMFUSION&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD560; &amp;#xB54C; DFS(Depth-&amp;#xFB01;rst Search)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; union &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, COMFUSION&amp;#xC740; &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB9CC; taint &amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; COMFUSION&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC544;&amp;#xB798; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0C1;&amp;#xD669;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;summarized functions&lt;ul&gt;
&lt;li&gt;&lt;code&gt;memcpy&lt;/code&gt;, &lt;code&gt;strcpy&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; &amp;#xB0B4;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; taint map&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;internal functions&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; taint&amp;#xB97C; &amp;#xCD94;&amp;#xC801; &amp;#xD6C4; taint map&amp;#xC744; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;external functions&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; taint&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;address-taken functions&lt;ul&gt;
&lt;li&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC74;&amp;#xB108;&amp;#xB701;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC544;&amp;#xB798; &amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC784;&amp;#xACC4;&amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;LOOP_THOLD(&amp;#xBB34;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504; &amp;#xBC29;&amp;#xC9C0;) : 2&lt;/li&gt;
&lt;li&gt;CALL_THOLD(&amp;#xD568;&amp;#xC218; &amp;#xC7AC;&amp;#xADC0;/depth &amp;#xBB38;&amp;#xC81C;) : 5&lt;/li&gt;
&lt;li&gt;TOTAL_THOLD(&amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xAC04;) : 10,000&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;4-Identify-Union-Type-Confusion&#34;&gt;&lt;a href=&#34;#4-Identify-Union-Type-Confusion&#34; class=&#34;headerlink&#34; title=&#34;4. Identify Union Type Confusion&#34;&gt;&lt;/a&gt;4. Identify Union Type Confusion&lt;/h3&gt;&lt;p&gt;union type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; union &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xB54C;, &amp;#xD574;&amp;#xB2F9; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; type&amp;#xB97C; &amp;#xAC00;&amp;#xC9C8; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Taint propagation&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xC628; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; symbolic execution&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658; &amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xC774;&amp;#xACE0;, union &amp;#xBCC0;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; union&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;&amp;#xB9CC; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xC778;&amp;#xC790;&amp;#xB4E4;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC778;&amp;#xC790;&amp;#xB97C; symboilc &amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;symbolic execution &amp;#xB610;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xBB34;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504;, &amp;#xC7AC;&amp;#xADC0;, &amp;#xB3D9;&amp;#xC2DC;&amp;#xC131; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; LOOP_THOLD, CALL_THOLD &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB2E8;&amp;#xC77C; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC624;&amp;#xC9C1; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xAC12;&amp;#xB9CC; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xD574;&amp;#xB2F9; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xAC00;&amp;#xC9C0;&amp;#xCE58;&amp;#xAE30; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC740; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xB54C; &amp;#xD06C;&amp;#xAC8C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xBC94;&amp;#xC704;&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xCC98;&amp;#xB7FC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;li&gt;&amp;#xC0B0;&amp;#xC220; &amp;#xBC0F; &amp;#xBE44;&amp;#xAD50; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB098; &amp;#xD53C;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xAC00; union &amp;#xBCC0;&amp;#xC218;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; tainted&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74;, COMFUSION&amp;#xC740; &amp;#xD574;&amp;#xB2F9; union&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC12;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; union type confusion&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COMFUSION &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;(&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC704;&amp;#xCE58;, union &amp;#xBA64;&amp;#xBC84;, &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xB4F1;)&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; PoC&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure 7&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &lt;code&gt;CUxxxame&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC5D0; if &amp;#xBB38;&amp;#xC744; false&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; while &amp;#xBB38;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &lt;code&gt;Initialize()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &lt;code&gt;this + 0x18&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;Initialize()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; ret&amp;#xC5D0; break point&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &lt;code&gt;this + 0x18&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xD6C4; &amp;#xB354; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB41C; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xD45C;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Evaluation&#34;&gt;&lt;a href=&#34;#Evaluation&#34; class=&#34;headerlink&#34; title=&#34;Evaluation&#34;&gt;&lt;/a&gt;Evaluation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC740; python, powershell, c++ &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC678;&amp;#xBD80; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB4E4;(OleViewDotNet, Angr, Cppcheck, TitanEngine)&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows 10(1809, 21H2)&amp;#xACFC; Windows 11(21H2)&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC57D; 200&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; 1,800&amp;#xAC1C;&amp;#xB85C; &amp;#xCD94;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows 11&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; 411&amp;#xAC1C;&amp;#xB85C; &amp;#xD604;&amp;#xC800;&amp;#xD788; &amp;#xC801;&amp;#xC740;&amp;#xB370; &amp;#xC774;&amp;#xB294; oleviewdotnet&amp;#xC774; windows 11&amp;#xC5D0;&amp;#xC11C; union type&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;VARIANT&lt;/code&gt;&amp;#xB97C; &lt;code&gt;FC_USER_MARSHAL&lt;/code&gt;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC5D0; &amp;#xD638;&amp;#xD658;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xCF1C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; COMFUSION&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; type confusion&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. Windows 10(1809, 21H2)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC808;&amp;#xBC18; &amp;#xAC00;&amp;#xAE4C;&amp;#xC774; False Positives&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xACE0; Windows 11&amp;#xC740; 70% &amp;#xC774;&amp;#xC0C1; False Positives&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB09C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB192;&amp;#xC740; False Positives&amp;#xAC00; &amp;#xB098;&amp;#xC628; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; COMFUSION&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;, &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xC54C;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xB124; &amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB9CC; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB124; &amp;#xAC1C; &amp;#xBBF8;&amp;#xB9CC;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, COMFUSION&amp;#xC740; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; union &amp;#xBA64;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; union type confusion&amp;#xB97C; CoP&amp;#xC640; CoNP&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD588;&amp;#xACE0; &amp;#xCD1D; 19&amp;#xAC1C;&amp;#xC758; CoP &amp;#xC911; LPE 5&amp;#xAC1C;&amp;#xC640; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; DoS&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. False Positives&amp;#xAC00; &amp;#xB192;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; COMFUSION &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;p&gt;&amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; COM Server&amp;#xC5D0;&amp;#xC11C; union&amp;#xC744; &amp;#xC798;&amp;#xBABB; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xACE0; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC804;&amp;#xBD80; &amp;#xC774;&amp;#xD574;&amp;#xB294; &amp;#xBABB; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAD00;&amp;#xC810;&amp;#xACFC; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;, IDL &amp;#xB4F1;&amp;#xB4F1; COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9DA;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xD3C9;&amp;#xC18C; &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xB294; &amp;#xBD84;&amp;#xC57C;&amp;#xC758; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; Introduction&amp;#xB9CC; &amp;#xC77D;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774;&amp;#xBC88; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Detecting Union Type Confusion in Component Object Model - Paper Review (KR) - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; COM&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC628; ogu123&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xB97C; &amp;#xC9D3;&amp;#xACE0; &amp;#xC2F6;&amp;#xC5B4;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..!&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &lt;a href=&#34;https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-yuxing&#34;&gt;COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB17C;&amp;#xBB38; &amp;#xB9AC;&amp;#xBDF0;&lt;/a&gt;&amp;#xB97C; &amp;#xC900;&amp;#xBE44;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. COM &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;del&gt;(&amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xB54C; &amp;#xC4F4; &amp;#xC81C; &amp;#xB17C;&amp;#xBB38;&amp;#xC774;&amp;#xB791; &amp;#xBE44;&amp;#xAD50;&amp;#xAC00; &amp;#xC548;&amp;#xB418;&amp;#xB294;&amp;#x2026;)&lt;/del&gt;&lt;/p&gt;
&lt;h2 id=&#34;Background&#34;&gt;&lt;a href=&#34;#Background&#34; class=&#34;headerlink&#34; title=&#34;Background&#34;&gt;&lt;/a&gt;Background&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/2.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: Struct VS Union (Introduction to Unions in C - Youtube) &lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; union&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xD615;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC27D;&amp;#xAC8C; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;? &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; union &amp;#xB0B4;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; union&amp;#xC740; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB9CC; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; struct &amp;#xC4F0;&amp;#xC9C0; &amp;#xAD73;&amp;#xC774; union&amp;#xC744; &amp;#xC4F0;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#xBB58;&amp;#xAE4C;&amp;#xC694;? union&amp;#xC740; size&amp;#xAC00; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; size&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xBC1B;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xC81C;&amp;#xD55C;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC720;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;COM&amp;#xC740; 1993&amp;#xB144;&amp;#xBD80;&amp;#xD130; &amp;#xB3C4;&amp;#xC785;&amp;#xD55C; &amp;#xAE30;&amp;#xC220;&amp;#xB85C; &amp;#xACFC;&amp;#xAC70; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC131;&amp;#xB2A5;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xC808;&amp;#xC57D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; COM &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xBD84;&amp;#xB4E4;&amp;#xC740; struct &amp;#xB300;&amp;#xC2E0; union&amp;#xC744; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;30&amp;#xB144;&amp;#xC774; &amp;#xC9C0;&amp;#xB09C; &amp;#xC9C0;&amp;#xAE08;&amp;#xB3C4; COM&amp;#xC740; OLE, ActiveX, Windows Shell &amp;#xB4F1; MS&amp;#xC5D0; &amp;#xD575;&amp;#xC2EC; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAE30;&amp;#xBC18;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC; &amp;#xACFC;&amp;#xAC70; COM &amp;#xAC1C;&amp;#xBC1C; &amp;#xC2DC; union type confusion &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; COM&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; COMFUSION&amp;#xC744; &amp;#xC81C;&amp;#xC2DC;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; COM&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; COM&amp;#xC5D0;&amp;#xC11C; union&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC81C;&amp;#xC2DC;&amp;#xB418;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD00;&amp;#xD589;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows 10 (&amp;#xBC84;&amp;#xC804; 1803 &amp;#xBC0F; 21H2) &amp;#xBC0F; Windows 11 (&amp;#xBC84;&amp;#xC804; 21H2)&amp;#xC5D0;&amp;#xC11C; MS COM &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; union&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xC9C1;/&amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; COM&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; union &amp;#xC120;&amp;#xC5B8; &amp;#xD615;&amp;#xD0DC;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure1&amp;#xC740; COM&amp;#xC758; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; union &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Non-encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xB9CC; &amp;#xB2E8;&amp;#xB3C5;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xD615;&amp;#xD0DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xC744; struct&amp;#xB098; class &amp;#xC548;&amp;#xC5D0; &amp;#xD3EC;&amp;#xD568;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0; Selector &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218; &amp;#xCD94;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;re-encapsulated Union&lt;ul&gt;
&lt;li&gt;encapsulated Union&amp;#xC744; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xBA64;&amp;#xBC84;&amp;#xB85C; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD615;&amp;#xD0DC;, &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB9CC; &amp;#xBCF4;&amp;#xBA74; Union&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; Union&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD0DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Selector &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB294; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xB85C; union &amp;#xBCC0;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC804; &amp;#xD574;&amp;#xB2F9; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC911; 34~35%&amp;#xAC00; union&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; union &amp;#xD615;&amp;#xD0DC;&amp;#xAC00; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; union type confusion&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; Figure 3&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; union&amp;#xC778; MetaInfo&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xC815;&amp;#xC218; &amp;#xBA64;&amp;#xBC84;&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; main &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; for &amp;#xBB38;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; user.info.name &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; UserInfo&amp;#xC758; type &amp;#xAC12;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xACFC;&amp;#xC815; &amp;#xC5C6;&amp;#xC774; &amp;#xC815;&amp;#xC218; &amp;#xAC12;&amp;#xC744; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COM&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; union&amp;#xC758; 50% &amp;#xC774;&amp;#xC0C1;&amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xBE44;&amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBA64;&amp;#xBC84;&amp;#xB97C; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; users &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xD2B9;&amp;#xC815; COM &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; COM &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xC778;&amp;#xC790;&amp;#xB97C; IDL(Interface Definition Language) &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCC0;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC744; &amp;#xC218;&amp;#xD589; &amp;#xD6C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC5B8;&amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC6D0;&amp;#xBCF8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC5BB;&amp;#xC5B4; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; IDL&amp;#xACFC; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; IDL&amp;#xC740; &amp;#xC704; &amp;#xADF8;&amp;#xB9BC;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C4; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xB294; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. IDL &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; MS&amp;#xAC00; &amp;#xB9CC;&amp;#xB4E0; MIDL &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; .dil &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD6C4; &amp;#xD5E4;&amp;#xB354; &amp;#xD30C;&amp;#xC77C;, &amp;#xD0C0;&amp;#xC785; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;, Proxy&amp;#xC640; Stub&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4; COM &amp;#xAC1C;&amp;#xBC1C;&amp;#xC744; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC740; IDL &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xB530;&amp;#xB978;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; IDL &amp;#xADDC;&amp;#xCE59;&amp;#xC5D0; &amp;#xB530;&amp;#xB97C; &amp;#xC218;&amp;#xBC16;&amp;#xC5D0; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xC740; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;(&amp;#xC778;&amp;#xC790; &amp;#xAC12; &amp;#xB4F1;)&amp;#xB97C; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC740; COM type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC27D;&amp;#xAC8C; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;&amp;#xC774; &amp;#xB2E4; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC548; &amp;#xD558;&amp;#xBA74; &amp;#xB9D0;&amp;#xC9F1; &amp;#xB3C4;&amp;#xB8E8;&amp;#xBB35;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC70;&amp;#xC8E0; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;h2 id=&#34;Design-of-COMFUSION&#34;&gt;&lt;a href=&#34;#Design-of-COMFUSION&#34; class=&#34;headerlink&#34; title=&#34;Design of COMFUSION&#34;&gt;&lt;/a&gt;Design of COMFUSION&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Windows &amp;#xB0B4;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xB9CE;&amp;#xC740; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; Figure 3&amp;#xC640; &amp;#xAC19;&amp;#xC774; type confusion &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xB294; COMFUSION &amp;#xB3C4;&amp;#xAD6C;&amp;#xC758; &amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC5D0; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; union type confusion&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC774;&amp;#xACE0; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xD0D0;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xB2E8;&amp;#xACC4;&amp;#xBCC4;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC8E0;!&lt;/p&gt;
&lt;h3 id=&#34;1-Extracting-COM-Objects&#34;&gt;&lt;a href=&#34;#1-Extracting-COM-Objects&#34; class=&#34;headerlink&#34; title=&#34;1. Extracting COM Objects&#34;&gt;&lt;/a&gt;1. Extracting COM Objects&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Windows &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xB798; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; CLSID&amp;#xC640; &amp;#xD574;&amp;#xB2F9; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;HKEY_CLASSES_ROOT/CLSID/$CLSID/InprocServer32&lt;/li&gt;
&lt;li&gt;HKEY_CLASSES_ROOT/CLSID/$CLSID/LocalServer32&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; oleviewdotnet&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; COM &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC5EC; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xAC01; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xB294; &amp;#xD2B9;&amp;#xC815; interface pointer identifier(IPID)&amp;#xB97C; &amp;#xAC00;&amp;#xC9C4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xBAA8;&amp;#xB4E0; IPID&amp;#xB294; COM &amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; IPIDTable&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774; &amp;#xB610;&amp;#xD55C; oleviewdotnet&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IPIDTable&amp;#xC744; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xACE0; COM &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC2DC;&amp;#xC791;&amp;#xB41C; &amp;#xD6C4; &amp;#xAC01; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-Exploring-Union-Declarations&#34;&gt;&lt;a href=&#34;#2-Exploring-Union-Declarations&#34; class=&#34;headerlink&#34; title=&#34;2. Exploring Union Declarations&#34;&gt;&lt;/a&gt;2. Exploring Union Declarations&lt;/h3&gt;&lt;p&gt;union type confusion&amp;#xC744; &amp;#xCC3E;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xBCC0;&amp;#xC218;, &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;, union &amp;#xBA64;&amp;#xBC84; &amp;#xB4F1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xB4E4;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Algorithm1&amp;#xC740; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC815;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xAD00;&amp;#xACC4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;Algorithm1&amp;#xC744; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; MIDL &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; struct&amp;#xC640; union&amp;#xC744; &amp;#xADF8;&amp;#xB798;&amp;#xD504;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &lt;code&gt;u&lt;/code&gt;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xAD6C;&amp;#xCD08;&amp;#xC81C; &lt;code&gt;v&lt;/code&gt;&amp;#xB97C; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB85C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;u&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;v&lt;/code&gt;&amp;#xB85C; edge&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC55E;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; Non-encapsulated Union, encapsulated Union &amp;#x2026;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB77C;&amp;#xBCA8;&amp;#xB9C1;&amp;#xC744; &amp;#xBD80;&amp;#xC5EC;&amp;#xD558;&amp;#xACE0; union &amp;#xD615;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xD655;&amp;#xC778; &amp;#x2026; &amp;#x2190; &amp;#xC774; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; Algorithm1&amp;#xC5D0; &amp;#xACB0;&amp;#xACFC;&amp;#xB85C; &amp;#xC544;&amp;#xB798; Figure 5&amp;#xC640; &amp;#xAC19;&amp;#xC774; DAG(Directed Acyclic Graph)&amp;#xAC00; &amp;#xAD6C;&amp;#xCD95;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;DAG&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; System Defined Union - VARIANT&amp;#xC774; &amp;#xBCF4;&amp;#xC774;&amp;#xB294;&amp;#xB370; VARIANT&amp;#xB294; union&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; vt&amp;#xB77C;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xBA85;&amp;#xC2DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; union&amp;#xC744; &amp;#xC62C;&amp;#xBC14;&amp;#xB974;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB4EF; VARIANT&amp;#xB3C4; VARIANT&amp;#x2192; vt &amp;#xAC12;&amp;#xC744; &amp;#xD655;&amp;#xC778; &amp;#xD6C4; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;union type confusion&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; &amp;#xBCF8; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; union &amp;#xD615;&amp;#xD0DC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xBD84;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;encapsulated Union&lt;ul&gt;
&lt;li&gt;union&amp;#xC774; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xBC14;&amp;#xB85C; &amp;#xC9C1;&amp;#xC804;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;System Defined Union&lt;ul&gt;
&lt;li&gt;VARIANT&amp;#xC758; vt &amp;#xBA64;&amp;#xBC84; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;re-encapsulated Union&lt;ul&gt;
&lt;li&gt;Figure 6&amp;#xC5D0;&amp;#xC11C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; Struct_20&amp;#xC5D0; VARIANT &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA74; Struct_20&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB294; Member10&amp;#x2192;vt&amp;#xB97C; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC544;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370; VARIANT&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; MS &amp;#xBB38;&amp;#xC11C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD588;&amp;#xACE0; &amp;#xADF8; &amp;#xC678;&amp;#xC758; union &amp;#xD615;&amp;#xD0DC;&amp;#xB4E4;&amp;#xC740; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; union &amp;#xBCC0;&amp;#xC218;&amp;#xC758; case &amp;#xBAA9;&amp;#xB85D;&amp;#xC774; &amp;#xC8FC;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Figure 6&amp;#xB294; &amp;#xBCF5;&amp;#xAD6C;&amp;#xB41C; MIDL &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xC608;&amp;#xC2DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB860;&amp;#xC0C1; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; union type confusion &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; COM &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBE44;&amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB34;&amp;#xC218;&amp;#xD788; &amp;#xB9CE;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; COMFUSION&amp;#xC740; MILD &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC120;&amp;#xC5B8;&amp;#xB41C; &amp;#xB300;&amp;#xB85C; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C1;&amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB9CC; &amp;#xAC80;&amp;#xC0AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC790;&amp;#xB97C; taint source&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0; CONFUSION&amp;#xC740; &amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC5D0; union member taint&amp;#xC640; discriminant taint&amp;#xB97C; &amp;#xAD6C;&amp;#xBCC4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure 6&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xAC01; &amp;#xC778;&amp;#xC790;&amp;#xB294; [IN], [OUT], [IN, OUT] &amp;#xC18D;&amp;#xC131;&amp;#xC744; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xB294; [IN], [IN, OUT]&amp;#xB9CC;&amp;#xC744; Taint Source Filtration&amp;#xB85C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; Angr&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; taint&amp;#xB85C; &amp;#xC124;&amp;#xC815; &amp;#xD6C4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; taint &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://hackyboiz.github.io/2021/07/10/j0ker/angr_part1/&#34;&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; Angr&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/a&gt;&lt;/p&gt;
&lt;h3 id=&#34;3-Locate-Union-Variables&#34;&gt;&lt;a href=&#34;#3-Locate-Union-Variables&#34; class=&#34;headerlink&#34; title=&#34;3. Locate Union Variables&#34;&gt;&lt;/a&gt;3. Locate Union Variables&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Algorithm 2&amp;#xB294; COMFUSION&amp;#xC774; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xB2E8;&amp;#xACC4;&amp;#xBCC4;&amp;#xB85C; &amp;#xCC3E;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; MAIN&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF; COMFUSION&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD560; &amp;#xB54C; DFS(Depth-&amp;#xFB01;rst Search)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; union &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;, COMFUSION&amp;#xC740; &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB9CC; taint &amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xC0C1;&amp;#xD669; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; COMFUSION&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC544;&amp;#xB798; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0; &amp;#xC0C1;&amp;#xD669;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;summarized functions&lt;ul&gt;
&lt;li&gt;&lt;code&gt;memcpy&lt;/code&gt;, &lt;code&gt;strcpy&lt;/code&gt;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; &amp;#xB0B4;&amp;#xBD80; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xADDC;&amp;#xCE59;&amp;#xC744; &amp;#xC801;&amp;#xC6A9;&amp;#xD574; taint map&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;internal functions&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; taint&amp;#xB97C; &amp;#xCD94;&amp;#xC801; &amp;#xD6C4; taint map&amp;#xC744; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;external functions&lt;ul&gt;
&lt;li&gt;&amp;#xBD84;&amp;#xC11D; &amp;#xC911;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC678;&amp;#xBD80;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; taint&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xB77C;&amp;#xC9C4;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;address-taken functions&lt;ul&gt;
&lt;li&gt;&amp;#xB7F0;&amp;#xD0C0;&amp;#xC784;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xACB0;&amp;#xC815;&amp;#xB418;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xB85C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xAE30;&amp;#xC5D0; &amp;#xAC74;&amp;#xB108;&amp;#xB701;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC544;&amp;#xB798; &amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC784;&amp;#xACC4;&amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;LOOP_THOLD(&amp;#xBB34;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504; &amp;#xBC29;&amp;#xC9C0;) : 2&lt;/li&gt;
&lt;li&gt;CALL_THOLD(&amp;#xD568;&amp;#xC218; &amp;#xC7AC;&amp;#xADC0;/depth &amp;#xBB38;&amp;#xC81C;) : 5&lt;/li&gt;
&lt;li&gt;TOTAL_THOLD(&amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xAC04;) : 10,000&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;4-Identify-Union-Type-Confusion&#34;&gt;&lt;a href=&#34;#4-Identify-Union-Type-Confusion&#34; class=&#34;headerlink&#34; title=&#34;4. Identify Union Type Confusion&#34;&gt;&lt;/a&gt;4. Identify Union Type Confusion&lt;/h3&gt;&lt;p&gt;union type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB294; union &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xB54C;, &amp;#xD574;&amp;#xB2F9; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; type&amp;#xB97C; &amp;#xAC00;&amp;#xC9C8; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC2E0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xC8E0;&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Taint propagation&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB514;&amp;#xC11C; &amp;#xC628; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; symbolic execution&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xB97C; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xD658; &amp;#xD6C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xC774;&amp;#xACE0;, union &amp;#xBCC0;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD310;&amp;#xB2E8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; symbolic&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xB370; union&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xAC12;&amp;#xB9CC; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB2E4;&amp;#xB978; &amp;#xC778;&amp;#xC790;&amp;#xB4E4;&amp;#xB3C4; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC2E4;&amp;#xD589; &amp;#xD750;&amp;#xB984;&amp;#xC5D0; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xC8FC;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC778;&amp;#xC790;&amp;#xB97C; symboilc &amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;symbolic execution &amp;#xB610;&amp;#xD55C; &amp;#xC2E4;&amp;#xD589; &amp;#xC911; &amp;#xBB34;&amp;#xD55C; &amp;#xB8E8;&amp;#xD504;, &amp;#xC7AC;&amp;#xADC0;, &amp;#xB3D9;&amp;#xC2DC;&amp;#xC131; &amp;#xBB38;&amp;#xC81C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC55E;&amp;#xC11C; LOOP_THOLD, CALL_THOLD &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xD574;&amp;#xACB0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB2E8;&amp;#xC77C; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; COMFUSION&amp;#xC740; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC624;&amp;#xC9C1; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xAC12;&amp;#xB9CC; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xD574;&amp;#xB2F9; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xAC00;&amp;#xC9C0;&amp;#xCE58;&amp;#xAE30; &amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC740; union &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xB54C; &amp;#xD06C;&amp;#xAC8C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xBC94;&amp;#xC704;&amp;#xB85C; &amp;#xCD94;&amp;#xC801;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;li&gt;&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xCC98;&amp;#xB7FC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;li&gt;&amp;#xC0B0;&amp;#xC220; &amp;#xBC0F; &amp;#xBE44;&amp;#xAD50; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB098; &amp;#xD53C;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xAC00; union &amp;#xBCC0;&amp;#xC218;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; tainted&amp;#xB41C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74;, COMFUSION&amp;#xC740; &amp;#xD574;&amp;#xB2F9; union&amp;#xC758; &amp;#xD310;&amp;#xBCC4;&amp;#xC790;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC12;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0; &amp;#xD558;&amp;#xB098; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; union type confusion&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD574; &amp;#xC774;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;COMFUSION &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xC5BB;&amp;#xC740; &amp;#xC815;&amp;#xBCF4;(&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC704;&amp;#xCE58;, union &amp;#xBA64;&amp;#xBC84;, &amp;#xD310;&amp;#xBCC4;&amp;#xC790; &amp;#xB4F1;)&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; PoC&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574; &amp;#xBC84;&amp;#xADF8;&amp;#xB97C; &amp;#xC7AC;&amp;#xD604;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD574;&amp;#xACB0;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Figure 7&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &lt;code&gt;CUxxxame&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB0B4;&amp;#xC5D0; if &amp;#xBB38;&amp;#xC744; false&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; while &amp;#xBB38;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &lt;code&gt;Initialize()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &lt;code&gt;this + 0x18&lt;/code&gt;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD568;&amp;#xC218; &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD574; &amp;#xD37C;&amp;#xC9D5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;Initialize()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; ret&amp;#xC5D0; break point&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &lt;code&gt;this + 0x18&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xAC12;&amp;#xC774; 0&amp;#xC774; &amp;#xC544;&amp;#xB2CC;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xBA74;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xD37C;&amp;#xC9D5;&amp;#xC740; &amp;#xC9C1;&amp;#xC811; harness&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD94;&amp;#xD6C4; &amp;#xB354; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&amp;#xB41C; &amp;#xC194;&amp;#xB8E8;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBAA9;&amp;#xD45C;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Evaluation&#34;&gt;&lt;a href=&#34;#Evaluation&#34; class=&#34;headerlink&#34; title=&#34;Evaluation&#34;&gt;&lt;/a&gt;Evaluation&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;COMFUSION&amp;#xC740; python, powershell, c++ &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; &amp;#xC678;&amp;#xBD80; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB4E4;(OleViewDotNet, Angr, Cppcheck, TitanEngine)&amp;#xB3C4; &amp;#xD65C;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Windows 10(1809, 21H2)&amp;#xACFC; Windows 11(21H2)&amp;#xC5D0;&amp;#xC11C; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD55C; &amp;#xACB0;&amp;#xACFC;, &amp;#xC57D; 200&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; 1,800&amp;#xAC1C;&amp;#xB85C; &amp;#xCD94;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Windows 11&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB294; 411&amp;#xAC1C;&amp;#xB85C; &amp;#xD604;&amp;#xC800;&amp;#xD788; &amp;#xC801;&amp;#xC740;&amp;#xB370; &amp;#xC774;&amp;#xB294; oleviewdotnet&amp;#xC774; windows 11&amp;#xC5D0;&amp;#xC11C; union type&amp;#xC744; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;VARIANT&lt;/code&gt;&amp;#xB97C; &lt;code&gt;FC_USER_MARSHAL&lt;/code&gt;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC5D0; &amp;#xD638;&amp;#xD658;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xCF1C; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC544;&amp;#xB0BC; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; COMFUSION&amp;#xC774; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; type confusion&amp;#xC744; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. Windows 10(1809, 21H2)&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC808;&amp;#xBC18; &amp;#xAC00;&amp;#xAE4C;&amp;#xC774; False Positives&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0AC;&amp;#xACE0; Windows 11&amp;#xC740; 70% &amp;#xC774;&amp;#xC0C1; False Positives&amp;#xAC00; &amp;#xB098;&amp;#xD0C0;&amp;#xB09C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB192;&amp;#xC740; False Positives&amp;#xAC00; &amp;#xB098;&amp;#xC628; &amp;#xC6D0;&amp;#xC778;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xACB0;&amp;#xACFC; COMFUSION&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC5D0; &amp;#xAD6C;&amp;#xD604;&amp;#xB41C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;, &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC778;&amp;#xC790; &amp;#xAC1C;&amp;#xC218;&amp;#xB97C; &amp;#xC54C;&amp;#xC9C0; &amp;#xBABB;&amp;#xD574; &amp;#xB124; &amp;#xAC1C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB9CC; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xC804;&amp;#xB7B5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C;, &amp;#xC2E4;&amp;#xC81C; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xB124; &amp;#xAC1C; &amp;#xBBF8;&amp;#xB9CC;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74;, COMFUSION&amp;#xC740; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; union &amp;#xBA64;&amp;#xBC84;&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC1C;&amp;#xACAC;&amp;#xB41C; union type confusion&amp;#xB97C; CoP&amp;#xC640; CoNP&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD588;&amp;#xACE0; &amp;#xCD1D; 19&amp;#xAC1C;&amp;#xC758; CoP &amp;#xC911; LPE 5&amp;#xAC1C;&amp;#xC640; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; DoS&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. False Positives&amp;#xAC00; &amp;#xB192;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBBFC;&amp;#xAC10;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; COMFUSION &amp;#xB3C4;&amp;#xAD6C;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;p&gt;&amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; COM Server&amp;#xC5D0;&amp;#xC11C; union&amp;#xC744; &amp;#xC798;&amp;#xBABB; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; type confusion&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xACE0; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC804;&amp;#xBD80; &amp;#xC774;&amp;#xD574;&amp;#xB294; &amp;#xBABB; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; COM&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xB54C; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAD00;&amp;#xC810;&amp;#xACFC; &amp;#xB9C8;&amp;#xC0EC;&amp;#xB9C1;, IDL &amp;#xB4F1;&amp;#xB4F1; COM&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC9DA;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
&lt;p&gt;&amp;#xD3C9;&amp;#xC18C; &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xB294; &amp;#xBD84;&amp;#xC57C;&amp;#xC758; &amp;#xB17C;&amp;#xBB38;&amp;#xC5D0;&amp;#xC11C; Introduction&amp;#xB9CC; &amp;#xC77D;&amp;#xC5B4;&amp;#xB3C4; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xAC70; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC774;&amp;#xBC88; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE34; &amp;#xAE00; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC154;&amp;#xC11C; &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2F9; &amp;#x314E;&amp;#x314E;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/08/28/ogu123/Detecting Union Type Confusion in Component Object Model/KR/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/08/28/ogu123/detecting union type confusion in component object model/kr/">

  <title>[Research] Detecting Union Type Confusion in Component Object Model - Paper Review (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-08-28 17:00" pubdate>
      2025 8 28 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.3k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      85
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Detecting Union Type Confusion in Component Object Model - Paper Review (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! &#xC624;&#xB79C;&#xB9CC;&#xC5D0; COM&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC628; ogu123&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xB2E4;&#xB978; &#xAC83;&#xB4E4;&#xC744; &#xD558;&#xB2E4;&#xAC00; COM&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xACE0; &#xB9C8;&#xBB34;&#xB9AC;&#xB97C; &#xC9D3;&#xACE0; &#xC2F6;&#xC5B4;&#xC11C; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xC624;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;..!</p>
<p>&#xC624;&#xB298;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.usenix.org/conference/usenixsecurity23/presentation/zhang-yuxing">COM&#xC5D0; &#xB300;&#xD55C; &#xB17C;&#xBB38; &#xB9AC;&#xBDF0;</a>&#xB97C; &#xC900;&#xBE44;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. COM &#xC11C;&#xBC84;&#xC5D0;&#xC11C; union &#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; type confusion&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD558;&#xB294;&#xB370;&#xC694;? &#xAD6C;&#xCCB4;&#xC801; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! <del>(&#xB300;&#xD559;&#xC0DD; &#xB54C; &#xC4F4; &#xC81C; &#xB17C;&#xBB38;&#xC774;&#xB791; &#xBE44;&#xAD50;&#xAC00; &#xC548;&#xB418;&#xB294;&#x2026;)</del></p>
<h2 id="Background"><a href="#Background" class="headerlink" title="Background"></a>Background</h2><p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/2.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xCD9C;&#xCC98;: Struct VS Union (Introduction to Unions in C - Youtube) </p>
</blockquote>
<p>&#xC6B0;&#xC120; union&#xC740; &#xBAA8;&#xB4E0; &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC704;&#xCE58;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xD615;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC744; &#xBCF4;&#xBA74; &#xC27D;&#xAC8C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;? &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; union &#xB0B4;&#xC5D0; &#xC120;&#xC5B8;&#xB41C; &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xB294; &#xD558;&#xB098;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; union&#xC740; &#xD558;&#xB098;&#xC758; &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xB9CC; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xADF8;&#xB7FC; struct &#xC4F0;&#xC9C0; &#xAD73;&#xC774; union&#xC744; &#xC4F0;&#xB294; &#xC774;&#xC720;&#xB294; &#xBB58;&#xAE4C;&#xC694;? union&#xC740; size&#xAC00; &#xAC00;&#xC7A5; &#xD070; &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xC758; size&#xB85C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xBC1B;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC81C;&#xD55C;&#xB41C; &#xACBD;&#xC6B0; &#xC720;&#xC6A9;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>COM&#xC740; 1993&#xB144;&#xBD80;&#xD130; &#xB3C4;&#xC785;&#xD55C; &#xAE30;&#xC220;&#xB85C; &#xACFC;&#xAC70; &#xC2DC;&#xC2A4;&#xD15C; &#xC131;&#xB2A5;&#xC0C1; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC808;&#xC57D;&#xD558;&#xAE30; &#xC704;&#xD574; COM &#xAC1C;&#xBC1C;&#xC790;&#xBD84;&#xB4E4;&#xC740; struct &#xB300;&#xC2E0; union&#xC744; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>30&#xB144;&#xC774; &#xC9C0;&#xB09C; &#xC9C0;&#xAE08;&#xB3C4; COM&#xC740; OLE, ActiveX, Windows Shell &#xB4F1; MS&#xC5D0; &#xD575;&#xC2EC; &#xAE30;&#xC220;&#xC758; &#xAE30;&#xBC18;&#xC774;&#xC9C0;&#xB9CC; &#xACFC;&#xAC70; COM &#xAC1C;&#xBC1C; &#xC2DC; union type confusion &#xBB38;&#xC81C;&#xB294; &#xB0A8;&#xC544;&#xC788;&#xB2E4;&#xACE0; &#xB17C;&#xBB38;&#xC5D0;&#xC11C; &#xB9D0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xD574;&#xB2F9; &#xB17C;&#xBB38;&#xC5D0;&#xC11C;&#xB294; COM&#xC5D0;&#xC11C; union type confusion&#xC744; &#xD0D0;&#xC9C0;&#xD558;&#xB294; COMFUSION&#xC744; &#xC81C;&#xC2DC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120; COM&#xC5D0;&#xC11C; union type confusion&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; COM&#xC5D0;&#xC11C; union&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xC81C;&#xC2DC;&#xB418;&#xACE0; &#xC5B4;&#xB5A4; &#xAD00;&#xD589;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294;&#xC9C0; &#xC5F0;&#xAD6C;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/3.png" srcset="/img/loading.gif" alt></p>
<p>Windows 10 (&#xBC84;&#xC804; 1803 &#xBC0F; 21H2) &#xBC0F; Windows 11 (&#xBC84;&#xC804; 21H2)&#xC5D0;&#xC11C; MS COM &#xCF54;&#xB4DC;&#xC640; &#xBB38;&#xC11C;&#xB97C; &#xD1B5;&#xD574; union&#xACFC; &#xC5F0;&#xACB0;&#xB418;&#xAC70;&#xB098; &#xC9C1;/&#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xCC38;&#xC870;&#xD558;&#xB294; COM&#xC758; &#xBAA8;&#xB4E0; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xACE0; &#xC218;&#xC9D1;&#xD55C; &#xACB0;&#xACFC;, &#xC704;&#xC640; &#xAC19;&#xC774; &#xC77C;&#xBC18;&#xC801;&#xC778; union &#xC120;&#xC5B8; &#xD615;&#xD0DC;&#xC744; &#xC815;&#xC758;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Figure1&#xC740; COM&#xC758; &#xC138; &#xAC00;&#xC9C0; &#xB300;&#xD45C;&#xC801;&#xC778; union &#xD615;&#xD0DC;&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>Non-encapsulated Union<ul>
<li>union&#xB9CC; &#xB2E8;&#xB3C5;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD615;&#xD0DC;</li>
</ul>
</li>
<li>encapsulated Union<ul>
<li>union&#xC744; struct&#xB098; class &#xC548;&#xC5D0; &#xD3EC;&#xD568;&#xC2DC;&#xD0A4;&#xACE0; Selector &#xBA64;&#xBC84; &#xBCC0;&#xC218; &#xCD94;&#xAC00;</li>
</ul>
</li>
<li>re-encapsulated Union<ul>
<li>encapsulated Union&#xC744; &#xAD6C;&#xC870;&#xCCB4; &#xBA64;&#xBC84;&#xB85C; &#xD3EC;&#xD568;&#xD55C; &#xD615;&#xD0DC;, &#xAD6C;&#xC870;&#xCCB4;&#xB9CC; &#xBCF4;&#xBA74; Union&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC9C0;&#xB9CC; &#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; Union&#xC774; &#xC788;&#xB294; &#xC0C1;&#xD0DC;</li>
</ul>
</li>
</ol>
<p>&#xC5EC;&#xAE30;&#xC11C; Selector &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xB294; &#xD310;&#xBCC4;&#xC790; &#xC5ED;&#xD560;&#xB85C; union &#xBCC0;&#xC218; &#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804; &#xD574;&#xB2F9; union &#xBCC0;&#xC218;&#xC758; &#xD0C0;&#xC785;&#xC744; &#xD655;&#xC778;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xADF8;&#xB9BC;&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xAD6C;&#xC870;&#xCCB4; &#xC911; 34~35%&#xAC00; union&#xC778; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC55E;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF8; &#xC138; &#xAC00;&#xC9C0; union &#xD615;&#xD0DC;&#xAC00; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/5.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7EC;&#xBA74; union type confusion&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC2DC;&#xB97C; Figure 3&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; union&#xC778; MetaInfo&#xB294; &#xBB38;&#xC790;&#xC5F4; &#xD3EC;&#xC778;&#xD130;&#xC640; &#xC815;&#xC218; &#xBA64;&#xBC84;&#xB97C; &#xAD6C;&#xC131;&#xD558;&#xACE0; &#xC788;&#xACE0; main &#xD568;&#xC218;&#xC5D0;&#xC11C; for &#xBB38;&#xC744; &#xD1B5;&#xD574; user.info.name &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD310;&#xBCC4;&#xC790; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; UserInfo&#xC758; type &#xAC12;&#xC744; &#xBA3C;&#xC800; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xACFC;&#xC815; &#xC5C6;&#xC774; &#xC815;&#xC218; &#xAC12;&#xC744; &#xBB38;&#xC790;&#xC5F4; &#xD3EC;&#xC778;&#xD130;&#xB85C; &#xC0AC;&#xC6A9;&#xD574; type confusion&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>COM&#xC758; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; union&#xC758; 50% &#xC774;&#xC0C1;&#xC774; &#xD3EC;&#xC778;&#xD130;&#xC640; &#xBE44;&#xD3EC;&#xC778;&#xD130; &#xBA64;&#xBC84;&#xB97C; &#xAC19;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Figure 3&#xC640; &#xAC19;&#xC740; &#xC7A0;&#xC7AC;&#xC801;&#xC778; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC744; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; users &#xBC30;&#xC5F4;&#xC758; &#xAC12;&#xC744; &#xD2B9;&#xC815; COM &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xBC84;&#xB85C; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xD638;&#xCD9C;&#xD558;&#xB294; COM &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC640; &#xC778;&#xC790;&#xB97C; IDL(Interface Definition Language) &#xADDC;&#xCE59;&#xC5D0; &#xB530;&#xB77C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xB9C8;&#xC0EC;&#xB9C1;&#xC744; &#xC218;&#xD589; &#xD6C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC0EC;&#xB9C1;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xB2EC;&#xBC1B;&#xC740; &#xC11C;&#xBC84;&#xB294; &#xC5B8;&#xB9C8;&#xC0EC;&#xB9C1;&#xC744; &#xD1B5;&#xD574; &#xC6D0;&#xBCF8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5BB;&#xC5B4; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB294;&#xB370; &#xC5EC;&#xAE30;&#xC11C; IDL&#xACFC; &#xB9C8;&#xC0EC;&#xB9C1;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; IDL&#xC740; &#xC704; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; COM &#xC11C;&#xBC84;&#xAC00; &#xAC00;&#xC9C4; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC640; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xC815;&#xC758;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. IDL &#xC790;&#xCCB4;&#xB294; &#xC5B8;&#xC5B4;&#xC774;&#xBBC0;&#xB85C; MS&#xAC00; &#xB9CC;&#xB4E0; MIDL &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB97C; &#xD1B5;&#xD574; .dil &#xD30C;&#xC77C;&#xC744; &#xCEF4;&#xD30C;&#xC77C; &#xD6C4; &#xD5E4;&#xB354; &#xD30C;&#xC77C;, &#xD0C0;&#xC785; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;, Proxy&#xC640; Stub&#xC744; &#xC704;&#xD55C; &#xD30C;&#xC77C; &#xB4F1;&#xC744; &#xC5BB;&#xC5B4; COM &#xAC1C;&#xBC1C;&#xC744; &#xC774;&#xC5B4;&#xC11C; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC55E;&#xC11C; &#xB9C8;&#xC0EC;&#xB9C1;&#xC740; IDL &#xADDC;&#xCE59;&#xC744; &#xB530;&#xB978;&#xB2E4;&#xACE0; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC11C;&#xBC84;&#xB85C; &#xBCF4;&#xB0B4;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; IDL &#xADDC;&#xCE59;&#xC5D0; &#xB530;&#xB97C; &#xC218;&#xBC16;&#xC5D0; &#xC5C6;&#xC9C0;&#xB9CC; &#xC774;&#xB97C; &#xC804;&#xB2EC;&#xBC1B;&#xC740; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xBCF4;&#xB0B8; &#xB370;&#xC774;&#xD130;(&#xC778;&#xC790; &#xAC12; &#xB4F1;)&#xB97C; &#xC81C;&#xB300;&#xB85C; &#xAC80;&#xC99D;&#xD558;&#xC9C0; &#xC54A;&#xC544; Figure 3&#xC640; &#xAC19;&#xC740; COM type confusion&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>&#xC27D;&#xAC8C; &#xB9C8;&#xC0EC;&#xB9C1;&#xC774; &#xB2E4; &#xD574;&#xC8FC;&#xB294;&#xB370; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xC548; &#xD558;&#xBA74; &#xB9D0;&#xC9F1; &#xB3C4;&#xB8E8;&#xBB35;&#xC774;&#xB77C;&#xB294; &#xAC70;&#xC8E0; &#x314E;&#x314E;</p>
<h2 id="Design-of-COMFUSION"><a href="#Design-of-COMFUSION" class="headerlink" title="Design of COMFUSION"></a>Design of COMFUSION</h2><p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/7.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; Windows &#xB0B4;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB9CE;&#xC740; COM &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0;&#xC11C; Figure 3&#xC640; &#xAC19;&#xC774; type confusion &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD0D0;&#xC0C9;&#xD558;&#xB294; COMFUSION &#xB3C4;&#xAD6C;&#xC758; &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>COMFUSION&#xC5D0; &#xBAA9;&#xD45C;&#xB294; COM &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0;&#xC11C; union type confusion&#xC744; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xACE0; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xD0D0;&#xC9C0;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;! &#xB2E8;&#xACC4;&#xBCC4;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC8E0;!</p>
<h3 id="1-Extracting-COM-Objects"><a href="#1-Extracting-COM-Objects" class="headerlink" title="1. Extracting COM Objects"></a>1. Extracting COM Objects</h3><p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/8.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; Windows &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;&#xC5D0;&#xC11C; &#xC544;&#xB798; &#xACBD;&#xB85C;&#xB97C; &#xCC38;&#xACE0;&#xD574; &#xBAA8;&#xB4E0; CLSID&#xC640; &#xD574;&#xB2F9; COM &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>HKEY_CLASSES_ROOT/CLSID/$CLSID/InprocServer32</li>
<li>HKEY_CLASSES_ROOT/CLSID/$CLSID/LocalServer32</li>
</ul>
<p>&#xC774;&#xD6C4; oleviewdotnet&#xB97C; &#xD1B5;&#xD574; COM &#xAC1D;&#xCCB4;&#xC758; &#xB9C8;&#xC0EC;&#xB9C1; &#xADDC;&#xCE59;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xC5EC; MIDL &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xAC01; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB294; &#xD2B9;&#xC815; interface pointer identifier(IPID)&#xB97C; &#xAC00;&#xC9C4; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; &#xBAA8;&#xB4E0; IPID&#xB294; COM &#xC11C;&#xBC84; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC5D0; &#xC788;&#xB294; IPIDTable&#xC774;&#xB77C;&#xB294; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xAD6C;&#xC131;&#xC774; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xB610;&#xD55C; oleviewdotnet&#xC744; &#xD1B5;&#xD574; IPIDTable&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xACE0; COM &#xC11C;&#xBC84;&#xAC00; &#xC2DC;&#xC791;&#xB41C; &#xD6C4; &#xAC01; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD568;&#xC218; &#xD14C;&#xC774;&#xBE14;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC744; &#xACC4;&#xC0B0;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-Exploring-Union-Declarations"><a href="#2-Exploring-Union-Declarations" class="headerlink" title="2. Exploring Union Declarations"></a>2. Exploring Union Declarations</h3><p>union type confusion&#xC744; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xD310;&#xBCC4;&#xC790; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; &#xBCC0;&#xC218;, &#xC720;&#xD6A8;&#xD55C; &#xD310;&#xBCC4;&#xC790; &#xAC12;, union &#xBA64;&#xBC84; &#xB4F1;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB4E4;&#xC774; &#xD544;&#xC694;&#xD558;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; &#xBCF5;&#xAD6C;&#xB41C; MIDL &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xC815;&#xBCF4;&#xB4E4;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/9.png" srcset="/img/loading.gif" alt></p>
<p>Algorithm1&#xC740; MIDL &#xD30C;&#xC77C;&#xC5D0; &#xC120;&#xC5B8;&#xB41C; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4; &#xC0AC;&#xC774;&#xC758; &#xAD00;&#xACC4;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>Algorithm1&#xC744; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; MIDL &#xD30C;&#xC77C; &#xB0B4;&#xC758; &#xBAA8;&#xB4E0; struct&#xC640; union&#xC744; &#xADF8;&#xB798;&#xD504;&#xC758; &#xB178;&#xB4DC;&#xB85C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xAD6C;&#xC870;&#xCCB4; <code>u</code>&#xAC00; &#xB2E4;&#xB978; &#xAD6C;&#xCD08;&#xC81C; <code>v</code>&#xB97C; &#xBCC0;&#xC218;&#xB098; &#xD3EC;&#xC778;&#xD130;&#xB85C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA74; <code>u</code>&#xC5D0;&#xC11C; <code>v</code>&#xB85C; edge&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC55E;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF8; Non-encapsulated Union, encapsulated Union &#x2026;&#xC5D0; &#xB530;&#xB77C; &#xB77C;&#xBCA8;&#xB9C1;&#xC744; &#xBD80;&#xC5EC;&#xD558;&#xACE0; union &#xD615;&#xD0DC;&#xC5D0; &#xB530;&#xB77C; &#xD310;&#xBCC4;&#xC790;&#xB97C; &#xD655;&#xC778; &#x2026; &#x2190; &#xC774; &#xB0B4;&#xC6A9;&#xC740; &#xBC14;&#xB85C; &#xC544;&#xB798;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; Algorithm1&#xC5D0; &#xACB0;&#xACFC;&#xB85C; &#xC544;&#xB798; Figure 5&#xC640; &#xAC19;&#xC774; DAG(Directed Acyclic Graph)&#xAC00; &#xAD6C;&#xCD95;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/10.png" srcset="/img/loading.gif" alt></p>
<p>DAG&#xB97C; &#xD655;&#xC778;&#xD558;&#xBA74; System Defined Union - VARIANT&#xC774; &#xBCF4;&#xC774;&#xB294;&#xB370; VARIANT&#xB294; union&#xACFC; &#xAC19;&#xC740; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xC9C0;&#xB9CC; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; vt&#xB77C;&#xB294; &#xD544;&#xB4DC;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xC758; &#xD0C0;&#xC785;&#xC774; &#xBA85;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; union&#xC744; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD310;&#xBCC4;&#xC790; &#xAC12;&#xC744; &#xBA3C;&#xC800; &#xD655;&#xC778;&#xD558;&#xB4EF; VARIANT&#xB3C4; VARIANT&#x2192; vt &#xAC12;&#xC744; &#xD655;&#xC778; &#xD6C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>union type confusion&#xC5D0;&#xC11C;&#xB294; union &#xBCC0;&#xC218;&#xC758; &#xD310;&#xBCC4;&#xC790;&#xB97C; &#xCC3E;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370; &#xBCF8; &#xB17C;&#xBB38;&#xC5D0;&#xC11C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; union &#xD615;&#xD0DC;&#xC5D0; &#xB530;&#xB77C; &#xAD6C;&#xBD84;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>encapsulated Union<ul>
<li>union&#xC774; &#xC120;&#xC5B8;&#xB41C; &#xBC14;&#xB85C; &#xC9C1;&#xC804;&#xC5D0; &#xC704;&#xCE58;&#xD55C; &#xBCC0;&#xC218;&#xAC00; &#xD310;&#xBCC4;&#xC790;&#xB85C; &#xC778;&#xC2DD;</li>
</ul>
</li>
<li>System Defined Union<ul>
<li>VARIANT&#xC758; vt &#xBA64;&#xBC84; &#xBCC0;&#xC218;&#xB97C; &#xD310;&#xBCC4;&#xC790;&#xB85C; &#xC778;&#xC2DD;</li>
</ul>
</li>
<li>re-encapsulated Union<ul>
<li>Figure 6&#xC5D0;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; Struct_20&#xC5D0; VARIANT &#xD0C0;&#xC785;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xBA74; Struct_20&#xC758; &#xD310;&#xBCC4;&#xC790;&#xB294; Member10&#x2192;vt&#xB97C; &#xD310;&#xBCC4;&#xC790;&#xB85C; &#xC778;&#xC2DD;</li>
</ul>
</li>
</ol>
<p>&#xD310;&#xBCC4;&#xC790;&#xB97C; &#xC778;&#xC2DD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xD310;&#xBCC4;&#xC790;&#xAC00; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB294; &#xAC12;&#xC744; &#xC544;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370; VARIANT&#xC758; &#xACBD;&#xC6B0; MS &#xBB38;&#xC11C;&#xB97C; &#xCC38;&#xACE0;&#xD588;&#xACE0; &#xADF8; &#xC678;&#xC758; union &#xD615;&#xD0DC;&#xB4E4;&#xC740; &#xBCF5;&#xAD6C;&#xB41C; MIDL &#xD30C;&#xC77C;&#xC5D0;&#xC11C; union &#xBCC0;&#xC218;&#xC758; case &#xBAA9;&#xB85D;&#xC774; &#xC8FC;&#xC11D;&#xC73C;&#xB85C; &#xB418;&#xC5B4;&#xC788;&#xC5B4; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/11.png" srcset="/img/loading.gif" alt></p>
<p>Figure 6&#xB294; &#xBCF5;&#xAD6C;&#xB41C; MIDL &#xD30C;&#xC77C;&#xC758; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB860;&#xC0C1; union &#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD574; union type confusion &#xAC80;&#xC0AC;&#xB97C; &#xD574;&#xC57C; &#xD558;&#xC9C0;&#xB9CC;&#x2026; COM &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC758; &#xBAA8;&#xB4E0; &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD574; union &#xBCC0;&#xC218;&#xB97C; &#xCC3E;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xD6A8;&#xC728;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xBB34;&#xC218;&#xD788; &#xB9CE;&#xAE30; &#xB54C;&#xBB38;&#x2026;</p>
<p>&#xB530;&#xB77C;&#xC11C; COMFUSION&#xC740; MILD &#xD30C;&#xC77C;&#xC5D0; &#xC120;&#xC5B8;&#xB41C; &#xB300;&#xB85C; union &#xBCC0;&#xC218;&#xB97C; &#xC778;&#xC790;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD568;&#xC218;&#xC5D0; &#xC9C1;&#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB418;&#xB294; &#xD568;&#xC218;&#xB4E4;&#xB9CC; &#xAC80;&#xC0AC;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD568;&#xC218; &#xC778;&#xC790;&#xB97C; taint source&#xB85C; &#xC9C0;&#xC815;&#xD558;&#xACE0; CONFUSION&#xC740; &#xBD84;&#xC11D; &#xC911;&#xC5D0; union member taint&#xC640; discriminant taint&#xB97C; &#xAD6C;&#xBCC4;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Figure 6&#xC744; &#xD655;&#xC778;&#xD558;&#xBA74; &#xD568;&#xC218;&#xC758; &#xAC01; &#xC778;&#xC790;&#xB294; [IN], [OUT], [IN, OUT] &#xC18D;&#xC131;&#xC744; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xB294; [IN], [IN, OUT]&#xB9CC;&#xC744; Taint Source Filtration&#xB85C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xCD94;&#xAC00;&#xB85C; COMFUSION&#xC740; Angr&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xD2B9;&#xC815; &#xBCC0;&#xC218;&#xB97C; taint&#xB85C; &#xC124;&#xC815; &#xD6C4; &#xBA85;&#xB839;&#xC5B4; &#xC218;&#xC900;&#xC5D0;&#xC11C; taint &#xBCC0;&#xC218;&#xAC00; &#xB2E4;&#xB978; &#xBCC0;&#xC218;&#xB098; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xCD94;&#xC801;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. <a href="https://hackyboiz.github.io/2021/07/10/j0ker/angr_part1/">&#xC5EC;&#xAE30;&#xC11C; Angr&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xBE14;&#xB85C;&#xADF8;&#xB97C; &#xCC38;&#xACE0;&#xD574; &#xC8FC;&#xC138;&#xC694;!</a></p>
<h3 id="3-Locate-Union-Variables"><a href="#3-Locate-Union-Variables" class="headerlink" title="3. Locate Union Variables"></a>3. Locate Union Variables</h3><p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/12.png" srcset="/img/loading.gif" alt></p>
<p>Algorithm 2&#xB294; COMFUSION&#xC774; union &#xBCC0;&#xC218;&#xB97C; &#xB2E8;&#xACC4;&#xBCC4;&#xB85C; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; MAIN&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4EF; COMFUSION&#xC740; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xD0D0;&#xC0C9;&#xD560; &#xB54C; DFS(Depth-&#xFB01;rst Search)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC5EC;&#xB7EC; union &#xC778;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD568;&#xC218;&#xC758; &#xACBD;&#xC6B0;, COMFUSION&#xC740; &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xC778;&#xC790;&#xB9CC; taint &#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBD84;&#xC11D; &#xC911; &#xBCF5;&#xC7A1;&#xD55C; &#xC0C1;&#xD669; &#xC911; &#xD558;&#xB098;&#xB294; &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC774;&#xACE0; COMFUSION&#xC740; &#xC774;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xACE0;&#xC790; &#xD568;&#xC218;&#xB97C; &#xC544;&#xB798; &#xB124; &#xAC00;&#xC9C0; &#xC0C1;&#xD669;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>summarized functions<ul>
<li><code>memcpy</code>, <code>strcpy</code>&#xC640; &#xAC19;&#xC740; &#xD568;&#xC218;&#xB4E4;&#xB85C; &#xB0B4;&#xBD80; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xBBF8;&#xB9AC; &#xC815;&#xC758;&#xB41C; &#xADDC;&#xCE59;&#xC744; &#xC801;&#xC6A9;&#xD574; taint map&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>internal functions<ul>
<li>&#xBD84;&#xC11D; &#xC911;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB0B4;&#xBD80;&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xD568;&#xC218;&#xB85C; &#xB0B4;&#xBD80;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; taint&#xB97C; &#xCD94;&#xC801; &#xD6C4; taint map&#xC744; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>external functions<ul>
<li>&#xBD84;&#xC11D; &#xC911;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC678;&#xBD80;&#xC5D0; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xD568;&#xC218;&#xB85C; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB4E4;&#xC740; &#xAC74;&#xB108;&#xB6F0;&#xACE0; &#xBD84;&#xC11D;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; taint&#xAC00; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xC0AC;&#xB77C;&#xC9C4;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>address-taken functions<ul>
<li>&#xB7F0;&#xD0C0;&#xC784;&#xC5D0; &#xD638;&#xCD9C; &#xC8FC;&#xC18C;&#xAC00; &#xACB0;&#xC815;&#xB418;&#xB294; &#xD568;&#xC218;&#xB4E4;&#xB85C; &#xBCF5;&#xC7A1;&#xC131;&#xC774; &#xB192;&#xAE30;&#xC5D0; &#xAC74;&#xB108;&#xB701;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ol>
<p>&#xCD94;&#xAC00;&#xB85C; COMFUSION&#xC740; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xC138; &#xAC00;&#xC9C0; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC544;&#xB798; &#xC640; &#xAC19;&#xC774; &#xC784;&#xACC4;&#xAC12;&#xC744; &#xC124;&#xC815;&#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>LOOP_THOLD(&#xBB34;&#xD55C; &#xB8E8;&#xD504; &#xBC29;&#xC9C0;) : 2</li>
<li>CALL_THOLD(&#xD568;&#xC218; &#xC7AC;&#xADC0;/depth &#xBB38;&#xC81C;) : 5</li>
<li>TOTAL_THOLD(&#xBD84;&#xC11D; &#xC2DC;&#xAC04;) : 10,000</li>
</ol>
<h3 id="4-Identify-Union-Type-Confusion"><a href="#4-Identify-Union-Type-Confusion" class="headerlink" title="4. Identify Union Type Confusion"></a>4. Identify Union Type Confusion</h3><p>union type confusion&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC774;&#xC720;&#xB294; union &#xBCC0;&#xC218;&#xAC00; &#xC0AC;&#xC6A9;&#xB420; &#xB54C;, &#xD574;&#xB2F9; &#xD310;&#xBCC4;&#xC790;&#xAC00; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; type&#xB97C; &#xAC00;&#xC9C8; &#xB54C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xC5B4;&#xB5A4; &#xD0C0;&#xC785;&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC2E0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xC0C1;&#xD669;&#xC774;&#xC8E0;</p>
<p>&#xC55E;&#xC11C; Taint propagation&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB514;&#xC11C; &#xC628; &#xB370;&#xC774;&#xD130;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0; symbolic execution&#xC744; &#xD1B5;&#xD574; &#xBCC0;&#xC218;&#xC640; &#xD310;&#xBCC4;&#xC790;&#xB97C; symbolic&#xC73C;&#xB85C; &#xBCC0;&#xD658; &#xD6C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xAC00;&#xB2A5;&#xD55C; &#xBAA8;&#xB4E0; &#xACBD;&#xB85C;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xBA70; &#xC5B4;&#xB5A4; &#xBCC0;&#xC218;&#xAC00; &#xD310;&#xBCC4;&#xC790;&#xC774;&#xACE0;, union &#xBCC0;&#xC218;&#xC778;&#xC9C0; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C;, &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xC804; &#xC5B4;&#xB5A4; &#xBCC0;&#xC218;&#xB97C; symbolic&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xC815;&#xC758;&#xD574;&#xC57C; &#xD558;&#xB294;&#xB370; union&#xC758; &#xD310;&#xBCC4;&#xC790; &#xAC12;&#xB9CC; &#xACC4;&#xC0B0;&#xD558;&#xACE0; &#xC2F6;&#xC9C0;&#xB9CC;, &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD568;&#xC218;&#xC758; &#xB2E4;&#xB978; &#xC778;&#xC790;&#xB4E4;&#xB3C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBAA8;&#xB4E0; &#xC778;&#xC790;&#xB97C; symboilc &#xD654;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>symbolic execution &#xB610;&#xD55C; &#xC2E4;&#xD589; &#xC911; &#xBB34;&#xD55C; &#xB8E8;&#xD504;, &#xC7AC;&#xADC0;, &#xB3D9;&#xC2DC;&#xC131; &#xBB38;&#xC81C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; LOOP_THOLD, CALL_THOLD &#xB4F1;&#xC73C;&#xB85C; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xACE0; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;&#xAC00; &#xB2E8;&#xC77C; &#xC2A4;&#xB808;&#xB4DC;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574; &#xB3D9;&#xC2DC;&#xC131; &#xBB38;&#xC81C;&#xB97C; &#xBB34;&#xC2DC;&#xD558;&#xAE30;&#xB85C; &#xD588;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xB85C; COMFUSION&#xC740; &#xC0C8;&#xB85C;&#xC6B4; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xAC00; &#xC0DD;&#xAE38; &#xB54C;&#xB9C8;&#xB2E4; &#xD310;&#xBCC4;&#xC790;&#xAC00; &#xC5EC;&#xB7EC; &#xAC12;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xC624;&#xC9C1; &#xD558;&#xB098;&#xC758; &#xAC12;&#xB9CC; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB2E4;&#xBA74;, &#xD574;&#xB2F9; &#xACBD;&#xB85C;&#xB294; &#xAC00;&#xC9C0;&#xCE58;&#xAE30; &#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/13.png" srcset="/img/loading.gif" alt></p>
<p>COMFUSION&#xC740; union &#xBCC0;&#xC218;&#xB97C; &#xCD94;&#xC801;&#xD560; &#xB54C; &#xD06C;&#xAC8C; &#xC138; &#xAC00;&#xC9C0;&#xB85C; &#xBC94;&#xC704;&#xB85C; &#xCD94;&#xC801;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD568;&#xC218;&#xC758; &#xC778;&#xC790;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACBD;&#xC6B0;</li>
<li>&#xD3EC;&#xC778;&#xD130;&#xCC98;&#xB7FC; &#xC8FC;&#xC18C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACBD;&#xC6B0;</li>
<li>&#xC0B0;&#xC220; &#xBC0F; &#xBE44;&#xAD50; &#xC5F0;&#xC0B0;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACBD;&#xC6B0;</li>
</ol>
<p>&#xB9CC;&#xC57D; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB098; &#xD53C;&#xC5F0;&#xC0B0;&#xC790;&#xAC00; union &#xBCC0;&#xC218;&#xB85C;&#xBD80;&#xD130; tainted&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xBA74;, COMFUSION&#xC740; &#xD574;&#xB2F9; union&#xC758; &#xD310;&#xBCC4;&#xC790;&#xAC00; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xAC12;&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xACE0; &#xD558;&#xB098; &#xC774;&#xC0C1;&#xC758; &#xAC12;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB2E4;&#xBA74; union type confusion&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD574; &#xC774;&#xB97C; &#xBCF4;&#xACE0;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>COMFUSION &#xBD84;&#xC11D;&#xC73C;&#xB85C; &#xC5BB;&#xC740; &#xC815;&#xBCF4;(&#xCDE8;&#xC57D;&#xC810; &#xC704;&#xCE58;, union &#xBA64;&#xBC84;, &#xD310;&#xBCC4;&#xC790; &#xB4F1;)&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xC9C1;&#xC811; PoC&#xB97C; &#xC791;&#xC131;&#xD574; &#xBC84;&#xADF8;&#xB97C; &#xC7AC;&#xD604;&#xD558;&#xC9C0;&#xB9CC; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD568;&#xC218;&#xC758; &#xC778;&#xC790;&#xAC00; &#xBCF5;&#xC7A1;&#xD55C; &#xACBD;&#xC6B0; &#xD37C;&#xC9D5;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xACB0;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Figure 7&#xC758; &#xBAA9;&#xD45C;&#xB294; <code>CUxxxame</code> &#xD568;&#xC218;&#xB0B4;&#xC5D0; if &#xBB38;&#xC744; false&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; while &#xBB38;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C;, <code>Initialize()</code> &#xD568;&#xC218;&#xAC00; <code>this + 0x18</code>&#xC758; &#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xC558;&#xC9C0;&#xB9CC; &#xD568;&#xC218; &#xC778;&#xC790;&#xAC00; &#xBCF5;&#xC7A1;&#xD574; &#xD37C;&#xC9D5;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; <code>Initialize()</code> &#xD568;&#xC218;&#xC758; ret&#xC5D0; break point&#xB97C; &#xC124;&#xC815;&#xD558;&#xACE0; <code>this + 0x18</code> &#xC8FC;&#xC18C;&#xC758; &#xAC12;&#xC774; 0&#xC774; &#xC544;&#xB2CC;&#xC9C0; &#xD655;&#xC778;&#xB418;&#xBA74;, &#xCDE8;&#xC57D;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC801;&#xC808;&#xD55C; &#xC778;&#xC790; &#xAC12;&#xC744; &#xCC3E;&#xC558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; &#xBC84;&#xC804;&#xC758; &#xD37C;&#xC9D5;&#xC740; &#xC9C1;&#xC811; harness&#xB97C; &#xC791;&#xC131;&#xD574;&#xC57C; &#xD558;&#xC9C0;&#xB9CC; &#xCD94;&#xD6C4; &#xB354; &#xC790;&#xB3D9;&#xD654;&#xB41C; &#xC194;&#xB8E8;&#xC158;&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBAA9;&#xD45C;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Evaluation"><a href="#Evaluation" class="headerlink" title="Evaluation"></a>Evaluation</h2><p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/14.png" srcset="/img/loading.gif" alt></p>
<p>COMFUSION&#xC740; python, powershell, c++ &#xB4F1;&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC73C;&#xBA70; &#xC678;&#xBD80; &#xB3C4;&#xAD6C;&#xB4E4;(OleViewDotNet, Angr, Cppcheck, TitanEngine)&#xB3C4; &#xD65C;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Windows 10(1809, 21H2)&#xACFC; Windows 11(21H2)&#xC5D0;&#xC11C; &#xD14C;&#xC2A4;&#xD2B8; &#xD55C; &#xACB0;&#xACFC;, &#xC57D; 200&#xB9CC; &#xAC1C;&#xC758; &#xD568;&#xC218; &#xC911; &#xBBFC;&#xAC10;&#xD55C; &#xD568;&#xC218;&#xB294; 1,800&#xAC1C;&#xB85C; &#xCD94;&#xB9B4; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Windows 11&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xBBFC;&#xAC10;&#xD55C; &#xD568;&#xC218;&#xB294; 411&#xAC1C;&#xB85C; &#xD604;&#xC800;&#xD788; &#xC801;&#xC740;&#xB370; &#xC774;&#xB294; oleviewdotnet&#xC774; windows 11&#xC5D0;&#xC11C; union type&#xC744; &#xC81C;&#xB300;&#xB85C; &#xC778;&#xC2DD;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC70;&#xB098; <code>VARIANT</code>&#xB97C; <code>FC_USER_MARSHAL</code>&#xB85C; &#xBD84;&#xB958;&#xD558;&#xB294; &#xB4F1;&#xC5D0; &#xD638;&#xD658;&#xC131; &#xBB38;&#xC81C;&#xB97C; &#xC77C;&#xC73C;&#xCF1C; &#xD544;&#xC694;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xCC3E;&#xC544;&#xB0BC; &#xC218; &#xC5C6;&#xC5C8;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/15.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C; COMFUSION&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC815;&#xD655;&#xD558;&#xAC8C; type confusion&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xB294;&#xC9C0; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;. Windows 10(1809, 21H2)&#xC5D0;&#xC11C;&#xB294; &#xC808;&#xBC18; &#xAC00;&#xAE4C;&#xC774; False Positives&#xC774; &#xB098;&#xD0C0;&#xB0AC;&#xACE0; Windows 11&#xC740; 70% &#xC774;&#xC0C1; False Positives&#xAC00; &#xB098;&#xD0C0;&#xB09C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB192;&#xC740; False Positives&#xAC00; &#xB098;&#xC628; &#xC6D0;&#xC778;&#xC744; &#xBD84;&#xC11D;&#xD55C; &#xACB0;&#xACFC; COMFUSION&#xC774; &#xC678;&#xBD80; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xAD6C;&#xD604;&#xB41C; &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xB54C;, &#xC815;&#xD655;&#xD55C; &#xC778;&#xC790; &#xAC1C;&#xC218;&#xB97C; &#xC54C;&#xC9C0; &#xBABB;&#xD574; &#xB124; &#xAC1C;&#xC758; &#xC778;&#xC790;&#xB9CC; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xC804;&#xB7B5;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C;, &#xC2E4;&#xC81C; &#xD568;&#xC218;&#xAC00; &#xB124; &#xAC1C; &#xBBF8;&#xB9CC;&#xC758; &#xC778;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74;, COMFUSION&#xC740; &#xB098;&#xBA38;&#xC9C0; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC798;&#xBABB;&#xB41C; union &#xBA64;&#xBC84;&#xB85C; &#xC778;&#xC2DD;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/16.png" srcset="/img/loading.gif" alt></p>
<p>&#xB17C;&#xBB38;&#xC5D0;&#xC11C;&#xB294; &#xBC1C;&#xACAC;&#xB41C; union type confusion&#xB97C; CoP&#xC640; CoNP&#xB85C; &#xBD84;&#xB958;&#xD588;&#xACE0; &#xCD1D; 19&#xAC1C;&#xC758; CoP &#xC911; LPE 5&#xAC1C;&#xC640; &#xB098;&#xBA38;&#xC9C0;&#xB294; DoS&#xB97C; &#xD2B8;&#xB9AC;&#xAC70; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. False Positives&#xAC00; &#xB192;&#xC9C0;&#xB9CC; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xBBFC;&#xAC10;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD544;&#xD130;&#xB9C1;&#xD560; &#xC218; &#xC788;&#xC5B4; COMFUSION &#xB3C4;&#xAD6C;&#xAC00; &#xD6A8;&#xACFC;&#xC801;&#xC774;&#xC5C8;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xB9C8;&#xBB34;&#xB9AC;"><a href="#&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="&#xB9C8;&#xBB34;&#xB9AC;"></a>&#xB9C8;&#xBB34;&#xB9AC;</h2><p>&#xB17C;&#xBB38;&#xC744; &#xD1B5;&#xD574; COM Server&#xC5D0;&#xC11C; union&#xC744; &#xC798;&#xBABB; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; type confusion&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xC558;&#xACE0; &#xB17C;&#xBB38;&#xC5D0; &#xB300;&#xD574; &#xC804;&#xBD80; &#xC774;&#xD574;&#xB294; &#xBABB; &#xD588;&#xC9C0;&#xB9CC; COM&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xB54C; &#xC0C8;&#xB85C;&#xC6B4; &#xAD00;&#xC810;&#xACFC; &#xB9C8;&#xC0EC;&#xB9C1;, IDL &#xB4F1;&#xB4F1; COM&#xC5D0; &#xB300;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xB2E4;&#xC2DC; &#xC9DA;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;</p>
<p>&#xD3C9;&#xC18C; &#xAD00;&#xC2EC; &#xC788;&#xB294; &#xBD84;&#xC57C;&#xC758; &#xB17C;&#xBB38;&#xC5D0;&#xC11C; Introduction&#xB9CC; &#xC77D;&#xC5B4;&#xB3C4; &#xC5C4;&#xCCAD; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC70; &#xAC19;&#xB2E4;&#xACE0; &#xC774;&#xBC88; &#xB17C;&#xBB38;&#xC744; &#xBCF4;&#xBA74;&#xC11C; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE34; &#xAE00; &#xC77D;&#xC5B4;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2F9; &#x314E;&#x314E;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/review/">review</a>
                  
                  <a class="hover-with-bg" href="/tags/ogu123/">ogu123</a>
                  
                  <a class="hover-with-bg" href="/tags/COM-Object/">COM Object</a>
                  
                  <a class="hover-with-bg" href="/tags/Type-Confusion/">Type Confusion</a>
                  
                  <a class="hover-with-bg" href="/tags/usenix/">usenix</a>
                  
                  <a class="hover-with-bg" href="/tags/COMFUSION/">COMFUSION</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_ogu123.jpg" srcset="/img/loading.gif" alt="ogu123">
                  </div>

                  <div class="link-text">
                    <div class="link-title">ogu123</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/ogu123">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/08/30/banda/CVE-2025-29824/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2025-29824: Windows CLFS (clfs.sys) Use-After-Free  LPE </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/EN/">
                    <span class="hidden-mobile">[Research] Detecting Union Type Confusion in Component Object Model - Paper Review (EN)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/';
        this.page.identifier = '/2025/08/28/ogu123/Detecting%20Union%20Type%20Confusion%20in%20Component%20Object%20Model/KR/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Detecting Union Type Confusion in Component Object Model - Paper Review (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
