

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &lt;a href=&#34;https://hackyboiz.github.io/2025/07/24/romi0x/MCP_Part1_ko/&#34;&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&lt;/a&gt;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; MCP Part2 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xB4F1;&amp;#xC7A5; &amp;#xBC30;&amp;#xACBD;, &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xB3C4;&amp;#xC785; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xB2E4;&amp;#xB918;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;MCP&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD574;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574; &amp;#xBD24;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;MCP&amp;#xC758;-&amp;#xD575;&amp;#xC2EC;-&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;-Host-Client-Server&#34;&gt;&lt;a href=&#34;#MCP&amp;#xC758;-&amp;#xD575;&amp;#xC2EC;-&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;-Host-Client-Server&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; (Host / Client / Server)&#34;&gt;&lt;/a&gt;MCP&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; (Host / Client / Server)&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; MCP&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; LLM&amp;#xB4E4;&amp;#xC774; &amp;#xBB38;&amp;#xB9E5; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; MCP&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xBC14;&amp;#xAC00; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB294; &lt;strong&gt;MCP &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;, MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;, MCP &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xB367;&amp;#xBD99;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC;, &amp;#xC774; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB4E4;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xB418;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;th&gt;&amp;#xC608;&amp;#xC2DC;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Server&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;&lt;/td&gt;
&lt;td&gt;Google Drive MCP, GitHub MCP &amp;#xB4F1;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Client&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Host &amp;#x2194; Server &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xC911;&amp;#xACC4;&amp;#xC790;&lt;/td&gt;
&lt;td&gt;OpenAI&amp;#xC758; Function Router &amp;#xB4F1;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Host&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;LLM&amp;#xC774;&amp;#xB098; LLM &amp;#xC571; (Claude, GPT &amp;#xB4F1;)&lt;/td&gt;
&lt;td&gt;Claude Desktop, AI IDE&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xB72F;&amp;#xC5B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-MCP-Server&#34;&gt;&lt;a href=&#34;#1-MCP-Server&#34; class=&#34;headerlink&#34; title=&#34;(1) MCP Server&#34;&gt;&lt;/a&gt;(1) MCP Server&lt;/h2&gt;&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &lt;strong&gt;AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xC138;&amp;#xACC4;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C;, &amp;#xC5EC;&amp;#xD589; &amp;#xC77C;&amp;#xC815;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xB4F1; &amp;#xD2B9;&amp;#xC815; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC5D0; &amp;#xD2B9;&amp;#xD654;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74;, &amp;#xBB38;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC11C;&amp;#xBC84;, &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC11C;&amp;#xBC84;, &amp;#xC5EC;&amp;#xD589; &amp;#xACC4;&amp;#xD68D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xD589; &amp;#xC11C;&amp;#xBC84; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xBAA8;&amp;#xB378;&amp;#xC740; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;, &amp;#xD234;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xBA85;&amp;#xC2DC;&amp;#xB41C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC561;&amp;#xC158;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; LLM&amp;#xC744; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC544;&amp;#xB2CC;, &lt;strong&gt;&amp;#xC571;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &lt;strong&gt;Tools, Resources, Prompts&lt;/strong&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&lt;/th&gt;
&lt;th&gt;&amp;#xBAA9;&amp;#xC801;&lt;/th&gt;
&lt;th&gt;&amp;#xC81C;&amp;#xC5B4; &amp;#xC8FC;&amp;#xCCB4;&lt;/th&gt;
&lt;th&gt;&amp;#xC608;&amp;#xC2DC;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Tool&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC561;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378;&lt;/td&gt;
&lt;td&gt;&amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Resource&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xB9E5; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&lt;/td&gt;
&lt;td&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xCE98;&amp;#xB9B0;&amp;#xB354;, &amp;#xBB38;&amp;#xC11C;, &amp;#xC5EC;&amp;#xD589; &amp;#xC774;&amp;#xB825;, &amp;#xB0A0;&amp;#xC528; &amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Prompt&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; &amp;#xC81C;&amp;#xACF5;&lt;/td&gt;
&lt;td&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&lt;/td&gt;
&lt;td&gt;&amp;#x201C;&amp;#xD734;&amp;#xAC00; &amp;#xACC4;&amp;#xD68D; &amp;#xC9DC;&amp;#xC918;&amp;#x201D;, &amp;#x201C;&amp;#xD68C;&amp;#xC758; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xC2A4;&amp;#xD0A4;&amp;#xB9C8;&amp;#xC640; URI &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB530;&amp;#xB974;&amp;#xBA70;, JSON-RPC&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-Tools-AI&amp;#xAC00;-&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xC561;&amp;#xC158;&#34;&gt;&lt;a href=&#34;#1-1-Tools-AI&amp;#xAC00;-&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xC561;&amp;#xC158;&#34; class=&#34;headerlink&#34; title=&#34;(1-1) Tools: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC561;&amp;#xC158;&#34;&gt;&lt;/a&gt;(1-1) Tools: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC561;&amp;#xC158;&lt;/h3&gt;&lt;p&gt;Tool&amp;#xC740; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC561;&amp;#xC158;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; MCP Tool&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; Tool&amp;#xC740; JSON Schema&amp;#xB85C; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC785;&amp;#xB825;/&amp;#xCD9C;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; LLM&amp;#xC774; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xD615;&amp;#xC2DD;&amp;#xC801; &amp;#xC624;&amp;#xB958; &amp;#xC5C6;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3D5;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;searchFlights&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Search for available flights&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;inputSchema&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;object&amp;quot;&lt;/span&gt;,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;properties&amp;quot;&lt;/span&gt;: {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;origin&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;format&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt; }
    },
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;origin&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt;]
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `tools/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD234; &amp;#xBAA9;&amp;#xB85D; &amp;#xC870;&amp;#xD68C; |
| `tools/call` | &amp;#xD2B9;&amp;#xC815; &amp;#xD234; &amp;#xC2E4;&amp;#xD589; &amp;#xC694;&amp;#xCCAD; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Tool &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801; &amp;#xC2B9;&amp;#xC778;&lt;/strong&gt;&amp;#xC744; &amp;#xAC70;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xD574;&amp;#xB2F9; Tool&amp;#xC758; &amp;#xC124;&amp;#xBA85;, &amp;#xC785;&amp;#xB825;&amp;#xAC12;, &amp;#xC608;&amp;#xC0C1; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC2B9;&amp;#xC778; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; Tool&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9; &amp;#xC2B9;&amp;#xC778; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-Resources-&amp;#x2013;-&amp;#xBB38;&amp;#xB9E5;-Context-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xC81C;&amp;#xACF5;&#34;&gt;&lt;a href=&#34;#1-2-Resources-&amp;#x2013;-&amp;#xBB38;&amp;#xB9E5;-Context-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xC81C;&amp;#xACF5;&#34; class=&#34;headerlink&#34; title=&#34;(1-2) Resources &amp;#x2013; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&#34;&gt;&lt;/a&gt;(1-2) Resources &amp;#x2013; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&lt;/h3&gt;&lt;p&gt;Resource&amp;#xB294; LLM&amp;#xC774; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &lt;strong&gt;&amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC77C;&amp;#xC815;, &amp;#xB0A0;&amp;#xC528; &amp;#xC815;&amp;#xBCF4;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C;, DB &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xBB38;&amp;#xB9E5;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;p&gt;Resource&amp;#xB294; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; URI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB418;&amp;#xBA70;, &lt;code&gt;file://&lt;/code&gt;, &lt;code&gt;calendar://&lt;/code&gt;, &lt;code&gt;travel://&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xC2A4;&amp;#xD0B4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; MIME &amp;#xD0C0;&amp;#xC785;, &amp;#xC81C;&amp;#xBAA9;, &amp;#xC124;&amp;#xBA85; &amp;#xB4F1;&amp;#xC758; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;uriTemplate&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;weather://forecast/{city}/{date}&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;weather-forecast&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;title&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Weather Forecast&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Get weather forecast for any city and date&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;mimeType&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;application/json&amp;quot;&lt;/span&gt;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `resources/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xC870;&amp;#xD68C; |
| `resources/templates/list` | &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; &amp;#xC870;&amp;#xD68C; |
| `resources/read` | &amp;#xD2B9;&amp;#xC815; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC77D;&amp;#xAE30; |
| `resources/subscribe` | &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xBCC0;&amp;#xACBD; &amp;#xAD6C;&amp;#xB3C5; (&amp;#xC635;&amp;#xC158;) |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&lt;/strong&gt;, &lt;strong&gt;&amp;#xAC80;&amp;#xC0C9;&amp;#xCC3D;&lt;/strong&gt;, &lt;strong&gt;&amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1; UI&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. LLM&amp;#xC740; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xB7EC;&amp;#xC624;&amp;#xAC70;&amp;#xB098;&lt;/strong&gt;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB294; AI&amp;#xC5D0;&amp;#xAC8C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC9C8;&amp;#xBB38; &amp;#xC751;&amp;#xB2F5;, &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-3-Prompts-&amp;#x2013;-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34;&gt;&lt;a href=&#34;#1-3-Prompts-&amp;#x2013;-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34; class=&#34;headerlink&#34; title=&#34;(1-3) Prompts &amp;#x2013; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34;&gt;&lt;/a&gt;(1-3) Prompts &amp;#x2013; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&lt;/h3&gt;&lt;p&gt;Prompt&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC8FC; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &lt;strong&gt;&amp;#xC815;&amp;#xD615;&amp;#xD654;&amp;#xB41C; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC790;&amp;#xC5F0;&amp;#xC5B4; &amp;#xC785;&amp;#xB825;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD2B9;&amp;#xC815; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;plan-vacation&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;title&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Plan a vacation&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Guide through vacation planning process&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;arguments&amp;quot;&lt;/span&gt;: [
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;duration&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;number&amp;quot;&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;budget&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;number&amp;quot;&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;interests&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;array&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;items&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; } }
  ]
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `prompts/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8; &amp;#xBAA9;&amp;#xB85D; &amp;#xC870;&amp;#xD68C; |
| `prompts/get` | &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8; &amp;#xC138;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4; &amp;#xC870;&amp;#xD68C; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;/plan-vacation&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC2AC;&amp;#xB798;&amp;#xC2DC; &amp;#xBA85;&amp;#xB839; &amp;#xB610;&amp;#xB294; UI &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC785;&amp;#xB825;&amp;#xD3FC;(&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;, &amp;#xC22B;&amp;#xC790;, &amp;#xB4DC;&amp;#xB86D;&amp;#xB2E4;&amp;#xC6B4; &amp;#xB4F1;)&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xBA70;, &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xAC12;&amp;#xC740; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC9C1;&amp;#xC811; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;&amp;#xC77C;&amp;#xAD00;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&lt;/strong&gt;, &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC644;&amp;#xC131;&lt;/strong&gt;, &lt;strong&gt;&amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&lt;/strong&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;h2 id=&#34;2-MCP-Client&#34;&gt;&lt;a href=&#34;#2-MCP-Client&#34; class=&#34;headerlink&#34; title=&#34;(2) MCP Client&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2) MCP Client&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &lt;strong&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC778; Claude, AI IDE &amp;#xB4F1;&amp;#xC774; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xB208;&amp;#xC5D0; &amp;#xBCF4;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xB300;&amp;#xC0C1;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC11C;&amp;#xBC84; &amp;#xC5F0;&amp;#xACB0;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xAC70;&amp;#xB098;, &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xB54C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;MCP Client &amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&lt;/p&gt;
&lt;p&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &lt;strong&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; LLM&amp;#xC774;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC811;&amp;#xADFC;&amp;#xACFC; &amp;#xB3C4;&amp;#xAD6C; &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB208;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2B9;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; AI&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xD1B5;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC811;&amp;#xADFC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &lt;strong&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xACBD;&amp;#xACC4;(roots)&amp;#xB97C; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&amp;#xD574; &amp;#x201C;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#x201D;&amp;#xB294; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xB450;&amp;#xC5B4; &amp;#xC548;&amp;#xC804;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC704;&amp;#xC784;&amp;#xD558;&amp;#xAC8C; &amp;#xD568;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xBE44;&amp;#xC6A9;, &amp;#xBCF4;&amp;#xC548;, &amp;#xC2B9;&amp;#xC778; &amp;#xC808;&amp;#xCC28;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC911;&amp;#xC2EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xAE30;&amp;#xB2A5;&amp;#xBA85; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| **Sampling** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; AI &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC704;&amp;#xC784; |
| **Roots** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815; |
| **Elicitation** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;3&amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Sampling-&amp;#xBAA8;&amp;#xB378;-&amp;#xD638;&amp;#xCD9C;-&amp;#xC704;&amp;#xC784;&#34;&gt;&lt;a href=&#34;#2-1-Sampling-&amp;#xBAA8;&amp;#xB378;-&amp;#xD638;&amp;#xCD9C;-&amp;#xC704;&amp;#xC784;&#34; class=&#34;headerlink&#34; title=&#34;(2-1) Sampling: &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2-1) Sampling: &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Sampling&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; LLM API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;AI &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC704;&amp;#xC784;&lt;/strong&gt;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC608;&amp;#xC2DC; &amp;#xD750;&amp;#xB984;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/docs/learn/client-concepts&#34;&gt;https://modelcontextprotocol.io/docs/learn/client-concepts&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#x201C;&amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC694;&amp;#xCCAD; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0;, &lt;strong&gt;&amp;#xC2B9;&amp;#xC778; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC2B9;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; LLM&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC751;&amp;#xB2F5;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAC80;&amp;#xD1A0; &amp;#xD6C4; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;messages&amp;quot;&lt;/span&gt;: [
    {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;role&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;user&amp;quot;&lt;/span&gt;,
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;content&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xB2E4;&amp;#xC74C; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCD5C;&amp;#xC801;&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;...&amp;quot;&lt;/span&gt;
    }
  ],
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;modelPreferences&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hints&amp;quot;&lt;/span&gt;: [{ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;claude-3-5-sonnet&amp;quot;&lt;/span&gt; }],
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;costPriority&amp;quot;&lt;/span&gt;: 0.3,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;speedPriority&amp;quot;&lt;/span&gt;: 0.2,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;intelligencePriority&amp;quot;&lt;/span&gt;: 0.9
  },
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;systemPrompt&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xC5EC;&amp;#xD589; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB85C;&amp;#xC11C; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xCD94;&amp;#xCC9C;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;maxTokens&amp;quot;&lt;/span&gt;: 1500
}&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;2-2-Roots-&amp;#xD30C;&amp;#xC77C;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xACBD;&amp;#xACC4;-&amp;#xC124;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#2-2-Roots-&amp;#xD30C;&amp;#xC77C;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xACBD;&amp;#xACC4;-&amp;#xC124;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;(2-2) Roots: &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815;&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2-2) Roots: &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Roots&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBC94;&amp;#xC704;(&amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &lt;code&gt;file://&lt;/code&gt; URI&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774; &amp;#xACBD;&amp;#xACC4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;uri&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;file:///Users/agent/travel-planning&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Travel Planning Workspace&amp;quot;&lt;/span&gt;
}&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC774; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xC678;&amp;#xBD80; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC28;&amp;#xB2E8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC5F4;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; roots&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &lt;code&gt;roots/list_changed&lt;/code&gt; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC54C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-Elicitation-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xCD94;&amp;#xAC00;-&amp;#xC785;&amp;#xB825;-&amp;#xC694;&amp;#xCCAD;&#34;&gt;&lt;a href=&#34;#2-3-Elicitation-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xCD94;&amp;#xAC00;-&amp;#xC785;&amp;#xB825;-&amp;#xC694;&amp;#xCCAD;&#34; class=&#34;headerlink&#34; title=&#34;(2-3) Elicitation: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&#34;&gt;&lt;/a&gt;(2-3) Elicitation: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&lt;/h3&gt;&lt;p&gt;Elicitation&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC791;&amp;#xC5C5; &amp;#xC911; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xD750;&amp;#xB984;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image1.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/docs/learn/client-concepts&#34;&gt;https://modelcontextprotocol.io/docs/learn/client-concepts&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; UI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBC0F; &amp;#xC785;&amp;#xB825; &amp;#xC591;&amp;#xC2DD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;method&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;elicitation/requestInput&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;params&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;message&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xBC14;&amp;#xB974;&amp;#xC140;&amp;#xB85C;&amp;#xB098; &amp;#xC5EC;&amp;#xD589; &amp;#xC608;&amp;#xC57D;&amp;#xC744; &amp;#xD655;&amp;#xC815;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;:&amp;quot;&lt;/span&gt;,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;schema&amp;quot;&lt;/span&gt;: {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;object&amp;quot;&lt;/span&gt;,
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;properties&amp;quot;&lt;/span&gt;: {
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;confirmBooking&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;boolean&amp;quot;&lt;/span&gt; },
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;seatPreference&amp;quot;&lt;/span&gt;: {
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;,
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;enum&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;window&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;aisle&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;no preference&amp;quot;&lt;/span&gt;]
        },
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;roomType&amp;quot;&lt;/span&gt;: {
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;,
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;enum&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;sea view&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;city view&amp;quot;&lt;/span&gt;]
        }
      },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;confirmBooking&amp;quot;&lt;/span&gt;]
    }
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;hr&gt;
&lt;h2 id=&#34;3-&amp;#xC804;&amp;#xCCB4;-&amp;#xD1B5;&amp;#xC2E0;-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#3-&amp;#xC804;&amp;#xCCB4;-&amp;#xD1B5;&amp;#xC2E0;-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;(3) &amp;#xC804;&amp;#xCCB4; &amp;#xD1B5;&amp;#xC2E0; &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;(3) &amp;#xC804;&amp;#xCCB4; &amp;#xD1B5;&amp;#xC2E0; &amp;#xAD6C;&amp;#xC870;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image2.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBCF8;&amp;#xC778; &amp;#xC81C;&amp;#xC791;&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBCF8;&amp;#xC778; &amp;#xC81C;&amp;#xC791;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;(User)&lt;/strong&gt;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;(&amp;#xC608;: Claude, GPT &amp;#xAE30;&amp;#xBC18; IDE &amp;#xB4F1;)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; AI &amp;#xBAA8;&amp;#xB378;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;AI &amp;#xBAA8;&amp;#xB378;(Host)&lt;/strong&gt;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;(Client)&lt;/strong&gt;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; MCP &amp;#xC11C;&amp;#xBC84; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC911;&amp;#xACC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&lt;/strong&gt;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;strong&gt;JSON-RPC&lt;/strong&gt; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC73C;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC640;&amp;#xC758; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC2B9;&amp;#xC778;, &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xC5B4;, &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;(sampling) &amp;#xB4F1;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;(Server)&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD575;&amp;#xC2EC; &amp;#xBE4C;&amp;#xB529; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Tool&lt;/strong&gt;: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xC561;&amp;#xC158; (&amp;#xC608;: &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Resource&lt;/strong&gt;: AI&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xB9E5; &amp;#xB370;&amp;#xC774;&amp;#xD130; (&amp;#xC608;: &amp;#xD30C;&amp;#xC77C;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354;, &amp;#xB0A0;&amp;#xC528; &amp;#xC815;&amp;#xBCF4;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Prompt&lt;/strong&gt;: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; (&amp;#xC608;: &amp;#x201C;&amp;#xD734;&amp;#xAC00; &amp;#xACC4;&amp;#xD68D; &amp;#xC9DC;&amp;#xC918;&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; MCP&amp;#xB294; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC77C;&amp;#xAD00;&amp;#xB418;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC561;&amp;#xC158;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC2B9;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2E0;&amp;#xB8B0; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB904;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; -!&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xD655; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;MCP&amp;#xB97C; &amp;#xC190;&amp;#xC27D;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;a href=&#34;https://modelcontextprotocol.io/docs/tutorials/use-remote-mcp-server&#34;&gt;&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&lt;/a&gt;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xD568;&amp;#xAED8;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;~&lt;/p&gt;
&lt;h3 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://modelcontextprotocol.io/docs/getting-started/intro&#34;&gt;https://modelcontextprotocol.io/docs/getting-started/intro&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] MCP (Model Context Protocol) Part 2 (ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! romi0x&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC740; &lt;a href=&#34;https://hackyboiz.github.io/2025/07/24/romi0x/MCP_Part1_ko/&#34;&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&lt;/a&gt;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; MCP Part2 &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;~&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; MCP&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xB4F1;&amp;#xC7A5; &amp;#xBC30;&amp;#xACBD;, &amp;#xAE30;&amp;#xBCF8; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xB3C4;&amp;#xC785; &amp;#xC0AC;&amp;#xB840;&amp;#xB97C; &amp;#xB2E4;&amp;#xB918;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;strong&gt;MCP&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC791;&amp;#xB3D9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&lt;/strong&gt;&amp;#xC5D0; &amp;#xC9D1;&amp;#xC911;&amp;#xD574;&amp;#xC11C; &amp;#xC791;&amp;#xC131;&amp;#xD574; &amp;#xBD24;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;h1 id=&#34;MCP&amp;#xC758;-&amp;#xD575;&amp;#xC2EC;-&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;-Host-Client-Server&#34;&gt;&lt;a href=&#34;#MCP&amp;#xC758;-&amp;#xD575;&amp;#xC2EC;-&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;-Host-Client-Server&#34; class=&#34;headerlink&#34; title=&#34;MCP&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; (Host / Client / Server)&#34;&gt;&lt;/a&gt;MCP&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8; (Host / Client / Server)&lt;/h1&gt;&lt;p&gt;&amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; MCP&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; LLM&amp;#xB4E4;&amp;#xC774; &amp;#xBB38;&amp;#xB9E5; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C;, &amp;#xC800;&amp;#xBC88; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; MCP&amp;#xC758; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC791;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD55C; &amp;#xBC14;&amp;#xAC00; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB294; &lt;strong&gt;MCP &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;, MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;, MCP &amp;#xC11C;&amp;#xBC84;&lt;/strong&gt; &amp;#xB4F1;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xB367;&amp;#xBD99;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC;, &amp;#xC774; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB4E4;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD788; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xB418;&amp;#xACE0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;3&amp;#xAC00;&amp;#xC9C0;&amp;#xC758; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/th&gt;
&lt;th&gt;&amp;#xC124;&amp;#xBA85;&lt;/th&gt;
&lt;th&gt;&amp;#xC608;&amp;#xC2DC;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Server&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC2E4;&amp;#xC81C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC720;&amp;#xD55C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;&lt;/td&gt;
&lt;td&gt;Google Drive MCP, GitHub MCP &amp;#xB4F1;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Client&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Host &amp;#x2194; Server &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xC911;&amp;#xACC4;&amp;#xC790;&lt;/td&gt;
&lt;td&gt;OpenAI&amp;#xC758; Function Router &amp;#xB4F1;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;MCP Host&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;LLM&amp;#xC774;&amp;#xB098; LLM &amp;#xC571; (Claude, GPT &amp;#xB4F1;)&lt;/td&gt;
&lt;td&gt;Claude Desktop, AI IDE&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xB72F;&amp;#xC5B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;1-MCP-Server&#34;&gt;&lt;a href=&#34;#1-MCP-Server&#34; class=&#34;headerlink&#34; title=&#34;(1) MCP Server&#34;&gt;&lt;/a&gt;(1) MCP Server&lt;/h2&gt;&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &lt;strong&gt;AI &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xC138;&amp;#xACC4;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C;, &amp;#xC5EC;&amp;#xD589; &amp;#xC77C;&amp;#xC815;, &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4; &amp;#xB4F1; &amp;#xD2B9;&amp;#xC815; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC5D0; &amp;#xD2B9;&amp;#xD654;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74;, &amp;#xBB38;&amp;#xC11C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC11C;&amp;#xBC84;, &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC11C;&amp;#xBC84;, &amp;#xC5EC;&amp;#xD589; &amp;#xACC4;&amp;#xD68D;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xD589; &amp;#xC11C;&amp;#xBC84; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;AI &amp;#xBAA8;&amp;#xB378;&amp;#xC740; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;, &amp;#xD234;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70;, &amp;#xBA85;&amp;#xC2DC;&amp;#xB41C; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC561;&amp;#xC158;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB294; LLM&amp;#xC744; &amp;#xB2E8;&amp;#xC21C;&amp;#xD55C; &amp;#xC5B8;&amp;#xC5B4; &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC544;&amp;#xB2CC;, &lt;strong&gt;&amp;#xC571;&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD658;&amp;#xACBD;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC7A5;&amp;#xC2DC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB85C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; 3&amp;#xAC00;&amp;#xC9C0; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &lt;strong&gt;Tools, Resources, Prompts&lt;/strong&gt; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;div class=&#34;table-container&#34;&gt;
&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&lt;/th&gt;
&lt;th&gt;&amp;#xBAA9;&amp;#xC801;&lt;/th&gt;
&lt;th&gt;&amp;#xC81C;&amp;#xC5B4; &amp;#xC8FC;&amp;#xCCB4;&lt;/th&gt;
&lt;th&gt;&amp;#xC608;&amp;#xC2DC;&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Tool&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC561;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xBAA8;&amp;#xB378;&lt;/td&gt;
&lt;td&gt;&amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Resource&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xBB38;&amp;#xB9E5; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&lt;/td&gt;
&lt;td&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&lt;/td&gt;
&lt;td&gt;&amp;#xCE98;&amp;#xB9B0;&amp;#xB354;, &amp;#xBB38;&amp;#xC11C;, &amp;#xC5EC;&amp;#xD589; &amp;#xC774;&amp;#xB825;, &amp;#xB0A0;&amp;#xC528; &amp;#xB370;&amp;#xC774;&amp;#xD130;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Prompt&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; &amp;#xC81C;&amp;#xACF5;&lt;/td&gt;
&lt;td&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&lt;/td&gt;
&lt;td&gt;&amp;#x201C;&amp;#xD734;&amp;#xAC00; &amp;#xACC4;&amp;#xD68D; &amp;#xC9DC;&amp;#xC918;&amp;#x201D;, &amp;#x201C;&amp;#xD68C;&amp;#xC758; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;#xAC01; &amp;#xC694;&amp;#xC18C;&amp;#xB294; &amp;#xD45C;&amp;#xC900;&amp;#xD654;&amp;#xB41C; &amp;#xC2A4;&amp;#xD0A4;&amp;#xB9C8;&amp;#xC640; URI &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB530;&amp;#xB974;&amp;#xBA70;, JSON-RPC&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-1-Tools-AI&amp;#xAC00;-&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xC561;&amp;#xC158;&#34;&gt;&lt;a href=&#34;#1-1-Tools-AI&amp;#xAC00;-&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294;-&amp;#xC561;&amp;#xC158;&#34; class=&#34;headerlink&#34; title=&#34;(1-1) Tools: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC561;&amp;#xC158;&#34;&gt;&lt;/a&gt;(1-1) Tools: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC561;&amp;#xC158;&lt;/h3&gt;&lt;p&gt;Tool&amp;#xC740; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xC138;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC561;&amp;#xC158;&amp;#xC740; &amp;#xBAA8;&amp;#xB450; MCP Tool&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;p&gt;&amp;#xAC01; Tool&amp;#xC740; JSON Schema&amp;#xB85C; &amp;#xBA85;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC785;&amp;#xB825;/&amp;#xCD9C;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; LLM&amp;#xC774; &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xD615;&amp;#xC2DD;&amp;#xC801; &amp;#xC624;&amp;#xB958; &amp;#xC5C6;&amp;#xC774; &amp;#xC815;&amp;#xD655;&amp;#xD55C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xB3D5;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;searchFlights&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Search for available flights&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;inputSchema&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;object&amp;quot;&lt;/span&gt;,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;properties&amp;quot;&lt;/span&gt;: {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;origin&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;format&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt; }
    },
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;origin&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;date&amp;quot;&lt;/span&gt;]
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `tools/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD234; &amp;#xBAA9;&amp;#xB85D; &amp;#xC870;&amp;#xD68C; |
| `tools/call` | &amp;#xD2B9;&amp;#xC815; &amp;#xD234; &amp;#xC2E4;&amp;#xD589; &amp;#xC694;&amp;#xCCAD; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Tool &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801; &amp;#xC2B9;&amp;#xC778;&lt;/strong&gt;&amp;#xC744; &amp;#xAC70;&amp;#xCE69;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC2E4;&amp;#xD589; &amp;#xC804; &amp;#xD574;&amp;#xB2F9; Tool&amp;#xC758; &amp;#xC124;&amp;#xBA85;, &amp;#xC785;&amp;#xB825;&amp;#xAC12;, &amp;#xC608;&amp;#xC0C1; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC2B9;&amp;#xC778; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; Tool&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9; &amp;#xC2B9;&amp;#xC778; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&amp;#xB3C4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-2-Resources-&amp;#x2013;-&amp;#xBB38;&amp;#xB9E5;-Context-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xC81C;&amp;#xACF5;&#34;&gt;&lt;a href=&#34;#1-2-Resources-&amp;#x2013;-&amp;#xBB38;&amp;#xB9E5;-Context-&amp;#xB370;&amp;#xC774;&amp;#xD130;-&amp;#xC81C;&amp;#xACF5;&#34; class=&#34;headerlink&#34; title=&#34;(1-2) Resources &amp;#x2013; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&#34;&gt;&lt;/a&gt;(1-2) Resources &amp;#x2013; &amp;#xBB38;&amp;#xB9E5;(Context) &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC81C;&amp;#xACF5;&lt;/h3&gt;&lt;p&gt;Resource&amp;#xB294; LLM&amp;#xC774; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &lt;strong&gt;&amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBB38;&amp;#xC11C;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354; &amp;#xC77C;&amp;#xC815;, &amp;#xB0A0;&amp;#xC528; &amp;#xC815;&amp;#xBCF4;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C;, DB &amp;#xB808;&amp;#xCF54;&amp;#xB4DC; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC774;&amp;#xB97C; &amp;#xBB38;&amp;#xB9E5;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC544;&amp;#xB4E4;&amp;#xC774;&amp;#xACE0; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;p&gt;Resource&amp;#xB294; &amp;#xACE0;&amp;#xC720;&amp;#xD55C; URI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB418;&amp;#xBA70;, &lt;code&gt;file://&lt;/code&gt;, &lt;code&gt;calendar://&lt;/code&gt;, &lt;code&gt;travel://&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xC2A4;&amp;#xD0B4;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; MIME &amp;#xD0C0;&amp;#xC785;, &amp;#xC81C;&amp;#xBAA9;, &amp;#xC124;&amp;#xBA85; &amp;#xB4F1;&amp;#xC758; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;uriTemplate&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;weather://forecast/{city}/{date}&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;weather-forecast&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;title&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Weather Forecast&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Get weather forecast for any city and date&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;mimeType&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;application/json&amp;quot;&lt;/span&gt;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `resources/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xC870;&amp;#xD68C; |
| `resources/templates/list` | &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; &amp;#xC870;&amp;#xD68C; |
| `resources/read` | &amp;#xD2B9;&amp;#xC815; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC77D;&amp;#xAE30; |
| `resources/subscribe` | &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4; &amp;#xBCC0;&amp;#xACBD; &amp;#xAD6C;&amp;#xB3C5; (&amp;#xC635;&amp;#xC158;) |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;&amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB294; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;&lt;/strong&gt;, &lt;strong&gt;&amp;#xAC80;&amp;#xC0C9;&amp;#xCC3D;&lt;/strong&gt;, &lt;strong&gt;&amp;#xCE74;&amp;#xD14C;&amp;#xACE0;&amp;#xB9AC; &amp;#xD544;&amp;#xD130;&amp;#xB9C1; UI&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. LLM&amp;#xC740; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB97C; &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD88;&amp;#xB7EC;&amp;#xC624;&amp;#xAC70;&amp;#xB098;&lt;/strong&gt;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC120;&amp;#xD0DD;&amp;#xB41C; &amp;#xB9AC;&amp;#xC18C;&amp;#xC2A4;&amp;#xB294; AI&amp;#xC5D0;&amp;#xAC8C; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC9C8;&amp;#xBB38; &amp;#xC751;&amp;#xB2F5;, &amp;#xBD84;&amp;#xC11D; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;1-3-Prompts-&amp;#x2013;-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34;&gt;&lt;a href=&#34;#1-3-Prompts-&amp;#x2013;-&amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;-&amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34; class=&#34;headerlink&#34; title=&#34;(1-3) Prompts &amp;#x2013; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&#34;&gt;&lt;/a&gt;(1-3) Prompts &amp;#x2013; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&lt;/h3&gt;&lt;p&gt;Prompt&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC790;&amp;#xC8FC; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &lt;strong&gt;&amp;#xC815;&amp;#xD615;&amp;#xD654;&amp;#xB41C; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBAA8;&amp;#xB378;&amp;#xC740; &amp;#xC790;&amp;#xC5F0;&amp;#xC5B4; &amp;#xC785;&amp;#xB825;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB354; &amp;#xBA85;&amp;#xD655;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &amp;#xD2B9;&amp;#xC815; &amp;#xB3C4;&amp;#xBA54;&amp;#xC778;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xC720;&amp;#xB3C4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;plan-vacation&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;title&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Plan a vacation&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Guide through vacation planning process&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;arguments&amp;quot;&lt;/span&gt;: [
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-literal&#34;&gt;true&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;duration&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;number&amp;quot;&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;budget&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;number&amp;quot;&lt;/span&gt; },
    { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;interests&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;array&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;items&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt; } }
  ]
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xBA54;&amp;#xC11C;&amp;#xB4DC; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| `prompts/list` | &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8; &amp;#xBAA9;&amp;#xB85D; &amp;#xC870;&amp;#xD68C; |
| `prompts/get` | &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8; &amp;#xC138;&amp;#xBD80; &amp;#xC815;&amp;#xBCF4; &amp;#xC870;&amp;#xD68C; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &lt;code&gt;/plan-vacation&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC2AC;&amp;#xB798;&amp;#xC2DC; &amp;#xBA85;&amp;#xB839; &amp;#xB610;&amp;#xB294; UI &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB86C;&amp;#xD504;&amp;#xD2B8;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC785;&amp;#xB825;&amp;#xD3FC;(&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;, &amp;#xC22B;&amp;#xC790;, &amp;#xB4DC;&amp;#xB86D;&amp;#xB2E4;&amp;#xC6B4; &amp;#xB4F1;)&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xBA70;, &amp;#xC785;&amp;#xB825;&amp;#xB41C; &amp;#xAC12;&amp;#xC740; &amp;#xBAA8;&amp;#xB378;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC9C1;&amp;#xC811; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;&amp;#xC77C;&amp;#xAD00;&amp;#xB41C; &amp;#xACB0;&amp;#xACFC;&lt;/strong&gt;, &lt;strong&gt;&amp;#xC790;&amp;#xB3D9;&amp;#xC644;&amp;#xC131;&lt;/strong&gt;, &lt;strong&gt;&amp;#xC6CC;&amp;#xD06C;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0; &amp;#xC790;&amp;#xB3D9;&amp;#xD654;&lt;/strong&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;hr&gt;
&lt;h2 id=&#34;2-MCP-Client&#34;&gt;&lt;a href=&#34;#2-MCP-Client&#34; class=&#34;headerlink&#34; title=&#34;(2) MCP Client&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2) MCP Client&lt;/strong&gt;&lt;/h2&gt;&lt;p&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &lt;strong&gt;&amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC778; Claude, AI IDE &amp;#xB4F1;&amp;#xC774; MCP &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xCEF4;&amp;#xD3EC;&amp;#xB10C;&amp;#xD2B8;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xB208;&amp;#xC5D0; &amp;#xBCF4;&amp;#xAC70;&amp;#xB098; &amp;#xB2E4;&amp;#xB8E8;&amp;#xB294; &amp;#xB300;&amp;#xC0C1;&amp;#xC740; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC11C;&amp;#xBC84; &amp;#xC5F0;&amp;#xACB0;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC70;&amp;#xCCD0;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC624;&amp;#xAC70;&amp;#xB098;, &amp;#xB3C4;&amp;#xAD6C;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xAC00; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xB54C;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;MCP Client &amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&lt;/p&gt;
&lt;p&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC5ED;&amp;#xD560;&amp;#xC740; &lt;strong&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; LLM&amp;#xC774;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC811;&amp;#xADFC;&amp;#xACFC; &amp;#xB3C4;&amp;#xAD6C; &amp;#xC2E4;&amp;#xD589;&amp;#xC740; &amp;#xBC18;&amp;#xB4DC;&amp;#xC2DC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xB208;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2B9;&amp;#xC778; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; AI&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC2DC;&amp;#xB3C4;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xD1B5;&amp;#xC81C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC811;&amp;#xADFC;&amp;#xCC98;&amp;#xB7FC; &amp;#xC704;&amp;#xD5D8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC740; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &lt;strong&gt;&amp;#xB8E8;&amp;#xD2B8; &amp;#xACBD;&amp;#xACC4;(roots)&amp;#xB97C; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&amp;#xD574; &amp;#x201C;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#x201D;&amp;#xB294; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xB450;&amp;#xC5B4; &amp;#xC548;&amp;#xC804;&amp;#xC131;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xB54C;&amp;#xB3C4; &amp;#xC9C1;&amp;#xC811; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &lt;strong&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC704;&amp;#xC784;&amp;#xD558;&amp;#xAC8C; &amp;#xD568;&lt;/strong&gt;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xBE44;&amp;#xC6A9;, &amp;#xBCF4;&amp;#xC548;, &amp;#xC2B9;&amp;#xC778; &amp;#xC808;&amp;#xCC28;&amp;#xAE4C;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC911;&amp;#xC2EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC5B4;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code&gt;| &amp;#xAE30;&amp;#xB2A5;&amp;#xBA85; | &amp;#xC124;&amp;#xBA85; |
| --- | --- |
| **Sampling** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; AI &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC704;&amp;#xC784; |
| **Roots** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815; |
| **Elicitation** | &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0; |
&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;3&amp;#xAC00;&amp;#xC9C0; &amp;#xC8FC;&amp;#xC694; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB098;&amp;#xC529; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-1-Sampling-&amp;#xBAA8;&amp;#xB378;-&amp;#xD638;&amp;#xCD9C;-&amp;#xC704;&amp;#xC784;&#34;&gt;&lt;a href=&#34;#2-1-Sampling-&amp;#xBAA8;&amp;#xB378;-&amp;#xD638;&amp;#xCD9C;-&amp;#xC704;&amp;#xC784;&#34; class=&#34;headerlink&#34; title=&#34;(2-1) Sampling: &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2-1) Sampling: &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Sampling&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; LLM API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;strong&gt;AI &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xC704;&amp;#xC784;&lt;/strong&gt;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC608;&amp;#xC2DC; &amp;#xD750;&amp;#xB984;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/docs/learn/client-concepts&#34;&gt;https://modelcontextprotocol.io/docs/learn/client-concepts&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC5D0; &amp;#x201C;&amp;#xC774; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC918;&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC694;&amp;#xCCAD; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC8FC;&amp;#xACE0;, &lt;strong&gt;&amp;#xC2B9;&amp;#xC778; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&lt;/strong&gt;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC2B9;&amp;#xC778;&amp;#xD558;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; LLM&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC751;&amp;#xB2F5;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xAC80;&amp;#xD1A0; &amp;#xD6C4; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/strong&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;messages&amp;quot;&lt;/span&gt;: [
    {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;role&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;user&amp;quot;&lt;/span&gt;,
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;content&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xB2E4;&amp;#xC74C; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xCD5C;&amp;#xC801;&amp;#xC758; &amp;#xC120;&amp;#xD0DD;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;...&amp;quot;&lt;/span&gt;
    }
  ],
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;modelPreferences&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;hints&amp;quot;&lt;/span&gt;: [{ &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;claude-3-5-sonnet&amp;quot;&lt;/span&gt; }],
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;costPriority&amp;quot;&lt;/span&gt;: 0.3,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;speedPriority&amp;quot;&lt;/span&gt;: 0.2,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;intelligencePriority&amp;quot;&lt;/span&gt;: 0.9
  },
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;systemPrompt&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xC5EC;&amp;#xD589; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;&amp;#xB85C;&amp;#xC11C; &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xCD94;&amp;#xCC9C;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;maxTokens&amp;quot;&lt;/span&gt;: 1500
}&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;2-2-Roots-&amp;#xD30C;&amp;#xC77C;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xACBD;&amp;#xACC4;-&amp;#xC124;&amp;#xC815;&#34;&gt;&lt;a href=&#34;#2-2-Roots-&amp;#xD30C;&amp;#xC77C;-&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;-&amp;#xACBD;&amp;#xACC4;-&amp;#xC124;&amp;#xC815;&#34; class=&#34;headerlink&#34; title=&#34;(2-2) Roots: &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815;&#34;&gt;&lt;/a&gt;&lt;strong&gt;(2-2) Roots: &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xACBD;&amp;#xACC4; &amp;#xC124;&amp;#xC815;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Roots&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;strong&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xBC94;&amp;#xC704;(&amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&lt;/strong&gt;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xC811;&amp;#xADFC;&amp;#xC740; &lt;code&gt;file://&lt;/code&gt; URI&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC774; &amp;#xACBD;&amp;#xACC4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBA85;&amp;#xD655;&amp;#xD788; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;uri&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;file:///Users/agent/travel-planning&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Travel Planning Workspace&amp;quot;&lt;/span&gt;
}&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC774; &amp;#xB8E8;&amp;#xD2B8; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xB9CC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xBA70;, &amp;#xC678;&amp;#xBD80; &amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xC815;&amp;#xCC45;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xCC28;&amp;#xB2E8;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC5F4;&amp;#xBA74; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; roots&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA70;, &lt;code&gt;roots/list_changed&lt;/code&gt; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC54C;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;2-3-Elicitation-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xCD94;&amp;#xAC00;-&amp;#xC785;&amp;#xB825;-&amp;#xC694;&amp;#xCCAD;&#34;&gt;&lt;a href=&#34;#2-3-Elicitation-&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;-&amp;#xCD94;&amp;#xAC00;-&amp;#xC785;&amp;#xB825;-&amp;#xC694;&amp;#xCCAD;&#34; class=&#34;headerlink&#34; title=&#34;(2-3) Elicitation: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&#34;&gt;&lt;/a&gt;(2-3) Elicitation: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xCD94;&amp;#xAC00; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&lt;/h3&gt;&lt;p&gt;Elicitation&amp;#xC740; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC791;&amp;#xC5C5; &amp;#xC911; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &lt;strong&gt;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xAE30;&amp;#xB2A5;&lt;/strong&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9; &amp;#xD750;&amp;#xB984;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image1.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &lt;a href=&#34;https://modelcontextprotocol.io/docs/learn/client-concepts&#34;&gt;https://modelcontextprotocol.io/docs/learn/client-concepts&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC785;&amp;#xB825; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; UI&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBC0F; &amp;#xC785;&amp;#xB825; &amp;#xC591;&amp;#xC2DD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xACE0; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xACC4;&amp;#xC18D; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC0D8;&amp;#xD50C; &amp;#xC694;&amp;#xCCAD; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
  &lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;{
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;method&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;elicitation/requestInput&amp;quot;&lt;/span&gt;,
  &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;params&amp;quot;&lt;/span&gt;: {
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;message&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;&amp;#xBC14;&amp;#xB974;&amp;#xC140;&amp;#xB85C;&amp;#xB098; &amp;#xC5EC;&amp;#xD589; &amp;#xC608;&amp;#xC57D;&amp;#xC744; &amp;#xD655;&amp;#xC815;&amp;#xD574; &amp;#xC8FC;&amp;#xC138;&amp;#xC694;:&amp;quot;&lt;/span&gt;,
    &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;schema&amp;quot;&lt;/span&gt;: {
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;object&amp;quot;&lt;/span&gt;,
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;properties&amp;quot;&lt;/span&gt;: {
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;confirmBooking&amp;quot;&lt;/span&gt;: { &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;boolean&amp;quot;&lt;/span&gt; },
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;seatPreference&amp;quot;&lt;/span&gt;: {
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;,
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;enum&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;window&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;aisle&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;no preference&amp;quot;&lt;/span&gt;]
        },
        &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;roomType&amp;quot;&lt;/span&gt;: {
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;string&amp;quot;&lt;/span&gt;,
          &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;enum&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;sea view&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;city view&amp;quot;&lt;/span&gt;]
        }
      },
      &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;required&amp;quot;&lt;/span&gt;: [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;confirmBooking&amp;quot;&lt;/span&gt;]
    }
  }
}
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;hr&gt;
&lt;h2 id=&#34;3-&amp;#xC804;&amp;#xCCB4;-&amp;#xD1B5;&amp;#xC2E0;-&amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;a href=&#34;#3-&amp;#xC804;&amp;#xCCB4;-&amp;#xD1B5;&amp;#xC2E0;-&amp;#xAD6C;&amp;#xC870;&#34; class=&#34;headerlink&#34; title=&#34;(3) &amp;#xC804;&amp;#xCCB4; &amp;#xD1B5;&amp;#xC2E0; &amp;#xAD6C;&amp;#xC870;&#34;&gt;&lt;/a&gt;(3) &amp;#xC804;&amp;#xCCB4; &amp;#xD1B5;&amp;#xC2E0; &amp;#xAD6C;&amp;#xC870;&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/09/02/romi0x/MCP_Part2_ko/image2.png&#34; alt=&#34;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBCF8;&amp;#xC778; &amp;#xC81C;&amp;#xC791;&#34;&gt;&lt;br&gt;&amp;#xCD9C;&amp;#xCC98;: &amp;#xBCF8;&amp;#xC778; &amp;#xC81C;&amp;#xC791;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;(User)&lt;/strong&gt;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;(&amp;#xC608;: Claude, GPT &amp;#xAE30;&amp;#xBC18; IDE &amp;#xB4F1;)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; AI &amp;#xBAA8;&amp;#xB378;&amp;#xACFC; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;AI &amp;#xBAA8;&amp;#xB378;(Host)&lt;/strong&gt;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xACB0;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MCP &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;(Client)&lt;/strong&gt;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; MCP &amp;#xC11C;&amp;#xBC84; &amp;#xC0AC;&amp;#xC774;&amp;#xC5D0;&amp;#xC11C; &lt;strong&gt;&amp;#xC911;&amp;#xACC4;&amp;#xC790; &amp;#xC5ED;&amp;#xD560;&lt;/strong&gt;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;strong&gt;JSON-RPC&lt;/strong&gt; &amp;#xD615;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC73C;&amp;#xBA70;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xC11C;&amp;#xBC84;&amp;#xC640;&amp;#xC758; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC2B9;&amp;#xC778;, &amp;#xBCF4;&amp;#xC548; &amp;#xC81C;&amp;#xC5B4;, &amp;#xBAA8;&amp;#xB378; &amp;#xD638;&amp;#xCD9C; &amp;#xC704;&amp;#xC784;(sampling) &amp;#xB4F1;&amp;#xC744; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;MCP &amp;#xC11C;&amp;#xBC84;(Server)&amp;#xB294; &amp;#xC2E4;&amp;#xC81C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC11C;&amp;#xBC84;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xD575;&amp;#xC2EC; &amp;#xBE4C;&amp;#xB529; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Tool&lt;/strong&gt;: AI&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xC561;&amp;#xC158; (&amp;#xC608;: &amp;#xD56D;&amp;#xACF5;&amp;#xD3B8; &amp;#xAC80;&amp;#xC0C9;, &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC804;&amp;#xC1A1;, &amp;#xC77C;&amp;#xC815; &amp;#xB4F1;&amp;#xB85D;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Resource&lt;/strong&gt;: AI&amp;#xC5D0;&amp;#xAC8C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xB294; &amp;#xBB38;&amp;#xB9E5; &amp;#xB370;&amp;#xC774;&amp;#xD130; (&amp;#xC608;: &amp;#xD30C;&amp;#xC77C;, &amp;#xCE98;&amp;#xB9B0;&amp;#xB354;, &amp;#xB0A0;&amp;#xC528; &amp;#xC815;&amp;#xBCF4;)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Prompt&lt;/strong&gt;: &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC7AC;&amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xD654;&amp;#xB41C; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9; &amp;#xD15C;&amp;#xD50C;&amp;#xB9BF; (&amp;#xC608;: &amp;#x201C;&amp;#xD734;&amp;#xAC00; &amp;#xACC4;&amp;#xD68D; &amp;#xC9DC;&amp;#xC918;&amp;#x201D;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; MCP&amp;#xB294; AI &amp;#xBAA8;&amp;#xB378;&amp;#xC774; &amp;#xC678;&amp;#xBD80; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC640; &amp;#xB3C4;&amp;#xAD6C;&amp;#xC5D0; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC77C;&amp;#xAD00;&amp;#xB418;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xBA70;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC561;&amp;#xC158;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC2B9;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC2E0;&amp;#xB8B0; &amp;#xAE30;&amp;#xBC18;&amp;#xC758; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC740; MCP&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD558;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB904;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; -!&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xD655; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;MCP&amp;#xB97C; &amp;#xC190;&amp;#xC27D;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;a href=&#34;https://modelcontextprotocol.io/docs/tutorials/use-remote-mcp-server&#34;&gt;&amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&lt;/a&gt;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xD568;&amp;#xAED8;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC694;~&lt;/p&gt;
&lt;h3 id=&#34;Ref&#34;&gt;&lt;a href=&#34;#Ref&#34; class=&#34;headerlink&#34; title=&#34;Ref&#34;&gt;&lt;/a&gt;Ref&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://modelcontextprotocol.io/docs/getting-started/intro&#34;&gt;https://modelcontextprotocol.io/docs/getting-started/intro&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/09/02/romi0x/MCP_Part2_ko/index.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/09/02/romi0x/mcp_part2_ko/">

  <title>[Research] MCP (Model Context Protocol) Part 2 (ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-09-02 17:00" pubdate>
      2025 9 2 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      67
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] MCP (Model Context Protocol) Part 2 (ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! romi0x&#xC785;&#xB2C8;&#xB2E4;~</p>
<p>&#xC774;&#xBC88; &#xAE00;&#xC740; <a href="https://hackyboiz.github.io/2025/07/24/romi0x/MCP_Part1_ko/">&#xC800;&#xBC88; &#xAE00;</a>&#xC5D0; &#xC774;&#xC5B4; MCP Part2 &#xC785;&#xB2C8;&#xB2E4;~</p>
<p>&#xC9C0;&#xB09C; &#xAE00;&#xC5D0;&#xC11C;&#xB294; MCP&#xC758; &#xAC1C;&#xB150;&#xACFC; &#xB4F1;&#xC7A5; &#xBC30;&#xACBD;, &#xAE30;&#xBCF8; &#xAD6C;&#xC870;&#xC640; &#xB3C4;&#xC785; &#xC0AC;&#xB840;&#xB97C; &#xB2E4;&#xB918;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB294; <strong>MCP&#xAC00; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xC9C0;</strong>&#xC5D0; &#xC9D1;&#xC911;&#xD574;&#xC11C; &#xC791;&#xC131;&#xD574; &#xBD24;&#xC5B4;&#xC694;.</p>
<h1 id="MCP&#xC758;-&#xD575;&#xC2EC;-&#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;-Host-Client-Server"><a href="#MCP&#xC758;-&#xD575;&#xC2EC;-&#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;-Host-Client-Server" class="headerlink" title="MCP&#xC758; &#xD575;&#xC2EC; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8; (Host / Client / Server)"></a>MCP&#xC758; &#xD575;&#xC2EC; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8; (Host / Client / Server)</h1><p>&#xC800;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; MCP&#xB294; &#xC5EC;&#xB7EC; LLM&#xB4E4;&#xC774; &#xBB38;&#xB9E5; &#xAC1D;&#xCCB4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xD45C;&#xC900;&#xD654;&#xB41C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC8FC;&#xACE0;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xC800;&#xBC88; &#xAE00;&#xC5D0;&#xC11C;&#xB3C4; MCP&#xC758; &#xAC04;&#xB2E8;&#xD55C; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD574; &#xC18C;&#xAC1C;&#xD55C; &#xBC14;&#xAC00; &#xC788;&#xC8E0;!</p>
<p>&#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB294; <strong>MCP &#xD638;&#xC2A4;&#xD2B8;, MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;, MCP &#xC11C;&#xBC84;</strong> &#xB4F1;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xACE0; &#xB367;&#xBD99;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC;, &#xC774; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB4E4;&#xC774; &#xC815;&#xD655;&#xD788; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xB418;&#xACE0; &#xC5B4;&#xB5A4; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p>3&#xAC00;&#xC9C0;&#xC758; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC694;&#xC57D;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC544;&#xC694;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;</th>
<th>&#xC124;&#xBA85;</th>
<th>&#xC608;&#xC2DC;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>MCP Server</strong></td>
<td>&#xC2E4;&#xC81C; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xBCF4;&#xC720;&#xD55C; &#xBC31;&#xC5D4;&#xB4DC;</td>
<td>Google Drive MCP, GitHub MCP &#xB4F1;</td>
</tr>
<tr>
<td><strong>MCP Client</strong></td>
<td>Host &#x2194; Server &#xC0AC;&#xC774;&#xC758; &#xD1B5;&#xC2E0; &#xC911;&#xACC4;&#xC790;</td>
<td>OpenAI&#xC758; Function Router &#xB4F1;</td>
</tr>
<tr>
<td><strong>MCP Host</strong></td>
<td>LLM&#xC774;&#xB098; LLM &#xC571; (Claude, GPT &#xB4F1;)</td>
<td>Claude Desktop, AI IDE</td>
</tr>
</tbody>
</table>
</div>
<p>&#xC774; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB97C; &#xD558;&#xB098;&#xC529; &#xB72F;&#xC5B4;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h2 id="1-MCP-Server"><a href="#1-MCP-Server" class="headerlink" title="(1) MCP Server"></a>(1) MCP Server</h2><p>MCP &#xC11C;&#xBC84;&#xB294; <strong>AI &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC678;&#xBD80; &#xC138;&#xACC4;&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xB3D9;&#xC791;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xC11C;&#xBC84;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;, &#xC774;&#xBA54;&#xC77C;, &#xC5EC;&#xD589; &#xC77C;&#xC815;, &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xB4F1; &#xD2B9;&#xC815; &#xB3C4;&#xBA54;&#xC778;&#xC5D0; &#xD2B9;&#xD654;&#xB41C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xBA74;, &#xBB38;&#xC11C; &#xAD00;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xC11C;&#xBC84;, &#xBA54;&#xC2DC;&#xC9C0; &#xCC98;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xC774;&#xBA54;&#xC77C; &#xC11C;&#xBC84;, &#xC5EC;&#xD589; &#xACC4;&#xD68D;&#xC744; &#xC704;&#xD55C; &#xC5EC;&#xD589; &#xC11C;&#xBC84; &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>AI &#xBAA8;&#xB378;&#xC740; MCP &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574; &#xB9AC;&#xC18C;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0;, &#xD234;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA70;, &#xBA85;&#xC2DC;&#xB41C; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xC591;&#xD55C; &#xC561;&#xC158;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xAD6C;&#xC870;&#xB294; LLM&#xC744; &#xB2E8;&#xC21C;&#xD55C; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;&#xC774; &#xC544;&#xB2CC;, <strong>&#xC571;&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD560; &#xC218; &#xC788;&#xB294; &#xD658;&#xACBD;</strong>&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<p>MCP &#xC11C;&#xBC84;&#xB294; &#xC138; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB85C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; 3&#xAC00;&#xC9C0; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB294; <strong>Tools, Resources, Prompts</strong> &#xC785;&#xB2C8;&#xB2E4;.</p>
<div class="table-container">
<table>
<thead>
<tr>
<th>&#xAD6C;&#xC131; &#xC694;&#xC18C;</th>
<th>&#xBAA9;&#xC801;</th>
<th>&#xC81C;&#xC5B4; &#xC8FC;&#xCCB4;</th>
<th>&#xC608;&#xC2DC;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Tool</strong></td>
<td>&#xBAA8;&#xB378;&#xC774; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC561;&#xC158;</td>
<td>&#xBAA8;&#xB378;</td>
<td>&#xD56D;&#xACF5;&#xD3B8; &#xAC80;&#xC0C9;, &#xC774;&#xBA54;&#xC77C; &#xC804;&#xC1A1;, &#xC77C;&#xC815; &#xB4F1;&#xB85D;</td>
</tr>
<tr>
<td><strong>Resource</strong></td>
<td>&#xBB38;&#xB9E5; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC81C;&#xACF5;</td>
<td>&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;</td>
<td>&#xCE98;&#xB9B0;&#xB354;, &#xBB38;&#xC11C;, &#xC5EC;&#xD589; &#xC774;&#xB825;, &#xB0A0;&#xC528; &#xB370;&#xC774;&#xD130;</td>
</tr>
<tr>
<td><strong>Prompt</strong></td>
<td>&#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD15C;&#xD50C;&#xB9BF; &#xC81C;&#xACF5;</td>
<td>&#xC0AC;&#xC6A9;&#xC790;</td>
<td>&#x201C;&#xD734;&#xAC00; &#xACC4;&#xD68D; &#xC9DC;&#xC918;&#x201D;, &#x201C;&#xD68C;&#xC758; &#xC694;&#xC57D;&#xD574;&#xC918;&#x201D;</td>
</tr>
</tbody>
</table>
</div>
<p>&#xAC01; &#xC694;&#xC18C;&#xB294; &#xD45C;&#xC900;&#xD654;&#xB41C; &#xC2A4;&#xD0A4;&#xB9C8;&#xC640; URI &#xAD6C;&#xC870;&#xB97C; &#xB530;&#xB974;&#xBA70;, JSON-RPC&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-1-Tools-AI&#xAC00;-&#xC2E4;&#xD589;&#xD558;&#xB294;-&#xC561;&#xC158;"><a href="#1-1-Tools-AI&#xAC00;-&#xC2E4;&#xD589;&#xD558;&#xB294;-&#xC561;&#xC158;" class="headerlink" title="(1-1) Tools: AI&#xAC00; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC561;&#xC158;"></a>(1-1) Tools: AI&#xAC00; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC561;&#xC158;</h3><p>Tool&#xC740; AI &#xBAA8;&#xB378;&#xC774; &#xC678;&#xBD80; &#xC138;&#xACC4;&#xC5D0;&#xC11C; <strong>&#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xAE30;&#xB2A5;</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xD56D;&#xACF5;&#xD3B8; &#xAC80;&#xC0C9;, &#xC774;&#xBA54;&#xC77C; &#xC804;&#xC1A1;, &#xCE98;&#xB9B0;&#xB354; &#xC77C;&#xC815; &#xB4F1;&#xB85D;&#xACFC; &#xAC19;&#xC740; &#xC561;&#xC158;&#xC740; &#xBAA8;&#xB450; MCP Tool&#xB85C; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xAD6C;&#xC870;</p>
<p>&#xAC01; Tool&#xC740; JSON Schema&#xB85C; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC815;&#xC758;&#xB41C; &#xC785;&#xB825;/&#xCD9C;&#xB825; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB294; LLM&#xC774; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xD615;&#xC2DD;&#xC801; &#xC624;&#xB958; &#xC5C6;&#xC774; &#xC815;&#xD655;&#xD55C; &#xC785;&#xB825;&#xC744; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3D5;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
  <pre><code class="hljs bash">{
  <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;searchFlights&quot;</span>,
  <span class="hljs-string">&quot;description&quot;</span>: <span class="hljs-string">&quot;Search for available flights&quot;</span>,
  <span class="hljs-string">&quot;inputSchema&quot;</span>: {
    <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;object&quot;</span>,
    <span class="hljs-string">&quot;properties&quot;</span>: {
      <span class="hljs-string">&quot;origin&quot;</span>: { <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span> },
      <span class="hljs-string">&quot;destination&quot;</span>: { <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span> },
      <span class="hljs-string">&quot;date&quot;</span>: { <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>, <span class="hljs-string">&quot;format&quot;</span>: <span class="hljs-string">&quot;date&quot;</span> }
    },
    <span class="hljs-string">&quot;required&quot;</span>: [<span class="hljs-string">&quot;origin&quot;</span>, <span class="hljs-string">&quot;destination&quot;</span>, <span class="hljs-string">&quot;date&quot;</span>]
  }
}
</code></pre>
</li>
<li><p>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBA54;&#xC11C;&#xB4DC;</p>
</li>
</ul>
<pre><code>| &#xBA54;&#xC11C;&#xB4DC; | &#xC124;&#xBA85; |
| --- | --- |
| `tools/list` | &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xD234; &#xBAA9;&#xB85D; &#xC870;&#xD68C; |
| `tools/call` | &#xD2B9;&#xC815; &#xD234; &#xC2E4;&#xD589; &#xC694;&#xCCAD; |
</code></pre><p>Tool &#xC2E4;&#xD589;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; <strong>&#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xBA85;&#xC2DC;&#xC801; &#xC2B9;&#xC778;</strong>&#xC744; &#xAC70;&#xCE69;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC2E4;&#xD589; &#xC804; &#xD574;&#xB2F9; Tool&#xC758; &#xC124;&#xBA85;, &#xC785;&#xB825;&#xAC12;, &#xC608;&#xC0C1; &#xACB0;&#xACFC;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC2B9;&#xC778; &#xC5EC;&#xBD80;&#xB97C; &#xACB0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC788;&#xB294; Tool&#xC5D0; &#xB300;&#xD574; <strong>&#xC790;&#xB3D9; &#xC2B9;&#xC778; &#xC124;&#xC815;</strong>&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-2-Resources-&#x2013;-&#xBB38;&#xB9E5;-Context-&#xB370;&#xC774;&#xD130;-&#xC81C;&#xACF5;"><a href="#1-2-Resources-&#x2013;-&#xBB38;&#xB9E5;-Context-&#xB370;&#xC774;&#xD130;-&#xC81C;&#xACF5;" class="headerlink" title="(1-2) Resources &#x2013; &#xBB38;&#xB9E5;(Context) &#xB370;&#xC774;&#xD130; &#xC81C;&#xACF5;"></a>(1-2) Resources &#x2013; &#xBB38;&#xB9E5;(Context) &#xB370;&#xC774;&#xD130; &#xC81C;&#xACF5;</h3><p>Resource&#xB294; LLM&#xC774; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xD615;&#xD0DC;&#xB85C; &#xC81C;&#xACF5;&#xB418;&#xB294; <strong>&#xC678;&#xBD80; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBB38;&#xC11C;, &#xCE98;&#xB9B0;&#xB354; &#xC77C;&#xC815;, &#xB0A0;&#xC528; &#xC815;&#xBCF4;, &#xC774;&#xBA54;&#xC77C;, DB &#xB808;&#xCF54;&#xB4DC; &#xB4F1; &#xB2E4;&#xC591;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xBAA8;&#xB378;&#xC740; &#xC774;&#xB97C; &#xBB38;&#xB9E5;&#xC73C;&#xB85C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xACE0; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xAD6C;&#xC870;</p>
<p>Resource&#xB294; &#xACE0;&#xC720;&#xD55C; URI&#xB97C; &#xD1B5;&#xD574; &#xC2DD;&#xBCC4;&#xB418;&#xBA70;, <code>file://</code>, <code>calendar://</code>, <code>travel://</code> &#xB4F1;&#xC758; &#xC2A4;&#xD0B4;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; MIME &#xD0C0;&#xC785;, &#xC81C;&#xBAA9;, &#xC124;&#xBA85; &#xB4F1;&#xC758; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB97C; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<pre><code class="hljs bash">{
  <span class="hljs-string">&quot;uriTemplate&quot;</span>: <span class="hljs-string">&quot;weather://forecast/{city}/{date}&quot;</span>,
  <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;weather-forecast&quot;</span>,
  <span class="hljs-string">&quot;title&quot;</span>: <span class="hljs-string">&quot;Weather Forecast&quot;</span>,
  <span class="hljs-string">&quot;description&quot;</span>: <span class="hljs-string">&quot;Get weather forecast for any city and date&quot;</span>,
  <span class="hljs-string">&quot;mimeType&quot;</span>: <span class="hljs-string">&quot;application/json&quot;</span>
}
</code></pre>
<ul>
<li>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBA54;&#xC11C;&#xB4DC;</li>
</ul>
<pre><code>| &#xBA54;&#xC11C;&#xB4DC; | &#xC124;&#xBA85; |
| --- | --- |
| `resources/list` | &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4; &#xC870;&#xD68C; |
| `resources/templates/list` | &#xB9AC;&#xC18C;&#xC2A4; &#xD15C;&#xD50C;&#xB9BF; &#xC870;&#xD68C; |
| `resources/read` | &#xD2B9;&#xC815; &#xB9AC;&#xC18C;&#xC2A4; &#xB370;&#xC774;&#xD130; &#xC77D;&#xAE30; |
| `resources/subscribe` | &#xB9AC;&#xC18C;&#xC2A4; &#xBCC0;&#xACBD; &#xAD6C;&#xB3C5; (&#xC635;&#xC158;) |
</code></pre><p>&#xB9AC;&#xC18C;&#xC2A4;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; <strong>&#xD30C;&#xC77C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;</strong>, <strong>&#xAC80;&#xC0C9;&#xCC3D;</strong>, <strong>&#xCE74;&#xD14C;&#xACE0;&#xB9AC; &#xD544;&#xD130;&#xB9C1; UI</strong>&#xB97C; &#xD1B5;&#xD574; &#xD0D0;&#xC0C9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. LLM&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC120;&#xD0DD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; <strong>&#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBD88;&#xB7EC;&#xC624;&#xAC70;&#xB098;</strong>, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC120;&#xD0DD;&#xB41C; &#xB9AC;&#xC18C;&#xC2A4;&#xB294; AI&#xC5D0;&#xAC8C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xC5B4; &#xC9C8;&#xBB38; &#xC751;&#xB2F5;, &#xBD84;&#xC11D; &#xB4F1;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-3-Prompts-&#x2013;-&#xC0C1;&#xD638;&#xC791;&#xC6A9;-&#xD15C;&#xD50C;&#xB9BF;"><a href="#1-3-Prompts-&#x2013;-&#xC0C1;&#xD638;&#xC791;&#xC6A9;-&#xD15C;&#xD50C;&#xB9BF;" class="headerlink" title="(1-3) Prompts &#x2013; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD15C;&#xD50C;&#xB9BF;"></a>(1-3) Prompts &#x2013; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD15C;&#xD50C;&#xB9BF;</h3><p>Prompt&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC790;&#xC8FC; &#xC218;&#xD589;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC744; <strong>&#xC815;&#xD615;&#xD654;&#xB41C; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC7AC;&#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC815;&#xC758;&#xD55C; &#xD15C;&#xD50C;&#xB9BF;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xBAA8;&#xB378;&#xC740; &#xC790;&#xC5F0;&#xC5B4; &#xC785;&#xB825;&#xBCF4;&#xB2E4; &#xB354; &#xBA85;&#xD655;&#xD55C; &#xAD6C;&#xC870;&#xD654;&#xB41C; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xD2B9;&#xC815; &#xB3C4;&#xBA54;&#xC778;&#xC5D0; &#xB9DE;&#xB294; &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xC720;&#xB3C4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xAD6C;&#xC870;</p>
  <pre><code class="hljs bash">{
  <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;plan-vacation&quot;</span>,
  <span class="hljs-string">&quot;title&quot;</span>: <span class="hljs-string">&quot;Plan a vacation&quot;</span>,
  <span class="hljs-string">&quot;description&quot;</span>: <span class="hljs-string">&quot;Guide through vacation planning process&quot;</span>,
  <span class="hljs-string">&quot;arguments&quot;</span>: [
    { <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;destination&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>, <span class="hljs-string">&quot;required&quot;</span>: <span class="hljs-literal">true</span> },
    { <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;duration&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;number&quot;</span> },
    { <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;budget&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;number&quot;</span> },
    { <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;interests&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;array&quot;</span>, <span class="hljs-string">&quot;items&quot;</span>: { <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span> } }
  ]
}
</code></pre>
</li>
<li><p>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBA54;&#xC11C;&#xB4DC;</p>
</li>
</ul>
<pre><code>| &#xBA54;&#xC11C;&#xB4DC; | &#xC124;&#xBA85; |
| --- | --- |
| `prompts/list` | &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xD504;&#xB86C;&#xD504;&#xD2B8; &#xBAA9;&#xB85D; &#xC870;&#xD68C; |
| `prompts/get` | &#xD2B9;&#xC815; &#xD504;&#xB86C;&#xD504;&#xD2B8; &#xC138;&#xBD80; &#xC815;&#xBCF4; &#xC870;&#xD68C; |
</code></pre><p>&#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>/plan-vacation</code>&#xACFC; &#xAC19;&#xC740; &#xC2AC;&#xB798;&#xC2DC; &#xBA85;&#xB839; &#xB610;&#xB294; UI &#xBC84;&#xD2BC;&#xC744; &#xD1B5;&#xD574; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB294; &#xAD6C;&#xC870;&#xD654;&#xB41C; &#xC785;&#xB825;&#xD3FC;(&#xD14D;&#xC2A4;&#xD2B8;, &#xC22B;&#xC790;, &#xB4DC;&#xB86D;&#xB2E4;&#xC6B4; &#xB4F1;)&#xC73C;&#xB85C; &#xB098;&#xD0C0;&#xB098;&#xBA70;, &#xC785;&#xB825;&#xB41C; &#xAC12;&#xC740; &#xBAA8;&#xB378;&#xC5D0;&#xAC8C; &#xC9C1;&#xC811; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; <strong>&#xC77C;&#xAD00;&#xB41C; &#xACB0;&#xACFC;</strong>, <strong>&#xC790;&#xB3D9;&#xC644;&#xC131;</strong>, <strong>&#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0; &#xC790;&#xB3D9;&#xD654;</strong>&#xAC00; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<hr>
<h2 id="2-MCP-Client"><a href="#2-MCP-Client" class="headerlink" title="(2) MCP Client"></a><strong>(2) MCP Client</strong></h2><p>MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; <strong>&#xD638;&#xC2A4;&#xD2B8; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC778; Claude, AI IDE &#xB4F1;&#xC774; MCP &#xC11C;&#xBC84;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC9C1;&#xC811; &#xB208;&#xC5D0; &#xBCF4;&#xAC70;&#xB098; &#xB2E4;&#xB8E8;&#xB294; &#xB300;&#xC0C1;&#xC740; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;, &#xBAA8;&#xB4E0; &#xC11C;&#xBC84; &#xC5F0;&#xACB0;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xAC70;&#xCCD0;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xC5B4;&#xC624;&#xAC70;&#xB098;, &#xB3C4;&#xAD6C;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAC70;&#xB098;, &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xCD94;&#xAC00; &#xC815;&#xBCF4;&#xB97C; &#xC694;&#xCCAD;&#xD560; &#xB54C;, &#xBAA8;&#xB4E0; &#xC694;&#xCCAD;&#xC774; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD1B5;&#xACFC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>MCP Client &#xAC00; &#xC911;&#xC694;&#xD55C; &#xC774;&#xC720;</p>
<p>MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xAC00;&#xC7A5; &#xD070; &#xC5ED;&#xD560;&#xC740; <strong>&#xC11C;&#xBC84;&#xAC00; &#xC9C1;&#xC811; LLM&#xC774;&#xB098; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xD658;&#xACBD;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xCC28;&#xB2E8;&#xD558;&#xB294; &#xAC83;</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130; &#xC811;&#xADFC;&#xACFC; &#xB3C4;&#xAD6C; &#xC2E4;&#xD589;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; &#xC0AC;&#xC6A9;&#xC790; &#xB208;&#xC55E;&#xC5D0;&#xC11C; &#xC2B9;&#xC778; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE58;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5B4; &#xC788;&#xC5B4;, &#xC0AC;&#xC6A9;&#xC790;&#xB294; AI&#xAC00; &#xC5B4;&#xB5A4; &#xC791;&#xC5C5;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xB294;&#xC9C0; &#xBA85;&#xD655;&#xD788; &#xD655;&#xC778;&#xD558;&#xACE0; &#xD1B5;&#xC81C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD2B9;&#xD788; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xC811;&#xADFC;&#xCC98;&#xB7FC; &#xC704;&#xD5D8;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC740; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; <strong>&#xB8E8;&#xD2B8; &#xACBD;&#xACC4;(roots)&#xB97C; &#xC124;&#xC815;</strong>&#xD574; &#x201C;&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0;&#xB9CC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#x201D;&#xB294; &#xC81C;&#xD55C;&#xC744; &#xB450;&#xC5B4; &#xC548;&#xC804;&#xC131;&#xC744; &#xD655;&#xBCF4;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC11C;&#xBC84;&#xAC00; &#xBAA8;&#xB378; &#xD638;&#xCD9C;&#xC774; &#xD544;&#xC694;&#xD560; &#xB54C;&#xB3C4; &#xC9C1;&#xC811; &#xC2E4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, <strong>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; &#xC704;&#xC784;&#xD558;&#xAC8C; &#xD568;</strong>&#xC73C;&#xB85C;&#xC368; &#xBE44;&#xC6A9;, &#xBCF4;&#xC548;, &#xC2B9;&#xC778; &#xC808;&#xCC28;&#xAE4C;&#xC9C0; &#xBAA8;&#xB450; &#xC0AC;&#xC6A9;&#xC790; &#xC911;&#xC2EC;&#xC5D0;&#xC11C; &#xC81C;&#xC5B4;&#xB429;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>&#xC8FC;&#xC694; &#xAE30;&#xB2A5;</p>
</li>
</ul>
<pre><code>| &#xAE30;&#xB2A5;&#xBA85; | &#xC124;&#xBA85; |
| --- | --- |
| **Sampling** | &#xC11C;&#xBC84;&#xAC00; AI &#xBAA8;&#xB378; &#xD638;&#xCD9C;&#xC744; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC704;&#xC784; |
| **Roots** | &#xC11C;&#xBC84;&#xAC00; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xACBD;&#xACC4; &#xC124;&#xC815; |
| **Elicitation** | &#xC11C;&#xBC84;&#xAC00; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xCD94;&#xAC00; &#xC785;&#xB825;&#xC744; &#xC694;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0; |
</code></pre><p>3&#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB098;&#xC529; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h3 id="2-1-Sampling-&#xBAA8;&#xB378;-&#xD638;&#xCD9C;-&#xC704;&#xC784;"><a href="#2-1-Sampling-&#xBAA8;&#xB378;-&#xD638;&#xCD9C;-&#xC704;&#xC784;" class="headerlink" title="(2-1) Sampling: &#xBAA8;&#xB378; &#xD638;&#xCD9C; &#xC704;&#xC784;"></a><strong>(2-1) Sampling: &#xBAA8;&#xB378; &#xD638;&#xCD9C; &#xC704;&#xC784;</strong></h3><p>Sampling&#xC740; &#xC11C;&#xBC84;&#xAC00; &#xC9C1;&#xC811; LLM API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD1B5;&#xD574; <strong>AI &#xBAA8;&#xB378; &#xD638;&#xCD9C;&#xC744; &#xC704;&#xC784;</strong>&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xC608;&#xC2DC; &#xD750;&#xB984;</p>
<p><img src="/2025/09/02/romi0x/MCP_Part2_ko/image.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)"></p>
<p>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/docs/learn/client-concepts">https://modelcontextprotocol.io/docs/learn/client-concepts</a></p>
<ol>
<li>&#xC11C;&#xBC84;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0; &#x201C;&#xC774; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D;&#xD574;&#xC918;&#x201D;&#xB77C;&#xB294; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC694;&#xCCAD; &#xB0B4;&#xC6A9;&#xC744; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xBA85;&#xD655;&#xD788; &#xBCF4;&#xC5EC;&#xC8FC;&#xACE0;, <strong>&#xC2B9;&#xC778; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;</strong>&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC2B9;&#xC778;&#xD558;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; LLM&#xC744; &#xD638;&#xCD9C;&#xD558;&#xACE0; &#xC751;&#xB2F5;&#xC744; &#xC11C;&#xBC84;&#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBAA8;&#xB4E0; &#xC751;&#xB2F5;&#xC740; &#xC0AC;&#xC6A9;&#xC790; &#xAC80;&#xD1A0; &#xD6C4; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;.</strong></li>
</ol>
</li>
<li><p>&#xC0D8;&#xD50C; &#xC694;&#xCCAD; &#xC608;&#xC2DC;</p>
  <pre><code class="hljs bash">{
  <span class="hljs-string">&quot;messages&quot;</span>: [
    {
      <span class="hljs-string">&quot;role&quot;</span>: <span class="hljs-string">&quot;user&quot;</span>,
      <span class="hljs-string">&quot;content&quot;</span>: <span class="hljs-string">&quot;&#xB2E4;&#xC74C; &#xD56D;&#xACF5;&#xD3B8; &#xC635;&#xC158;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xCD5C;&#xC801;&#xC758; &#xC120;&#xD0DD;&#xC744; &#xCD94;&#xCC9C;&#xD574;&#xC8FC;&#xC138;&#xC694;...&quot;</span>
    }
  ],
  <span class="hljs-string">&quot;modelPreferences&quot;</span>: {
    <span class="hljs-string">&quot;hints&quot;</span>: [{ <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;claude-3-5-sonnet&quot;</span> }],
    <span class="hljs-string">&quot;costPriority&quot;</span>: 0.3,
    <span class="hljs-string">&quot;speedPriority&quot;</span>: 0.2,
    <span class="hljs-string">&quot;intelligencePriority&quot;</span>: 0.9
  },
  <span class="hljs-string">&quot;systemPrompt&quot;</span>: <span class="hljs-string">&quot;&#xC5EC;&#xD589; &#xC804;&#xBB38;&#xAC00;&#xB85C;&#xC11C; &#xD56D;&#xACF5;&#xD3B8; &#xCD94;&#xCC9C;&#xC744; &#xC218;&#xD589;&#xD574;&#xC8FC;&#xC138;&#xC694;&quot;</span>,
  <span class="hljs-string">&quot;maxTokens&quot;</span>: 1500
}</code></pre>
</li>
</ul>
<h3 id="2-2-Roots-&#xD30C;&#xC77C;-&#xC2DC;&#xC2A4;&#xD15C;-&#xACBD;&#xACC4;-&#xC124;&#xC815;"><a href="#2-2-Roots-&#xD30C;&#xC77C;-&#xC2DC;&#xC2A4;&#xD15C;-&#xACBD;&#xACC4;-&#xC124;&#xC815;" class="headerlink" title="(2-2) Roots: &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xACBD;&#xACC4; &#xC124;&#xC815;"></a><strong>(2-2) Roots: &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xACBD;&#xACC4; &#xC124;&#xC815;</strong></h3><p>Roots&#xB294; &#xC11C;&#xBC84;&#xAC00; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; <strong>&#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xBC94;&#xC704;(&#xB514;&#xB809;&#xD130;&#xB9AC;)&#xB97C; &#xC815;&#xC758;</strong>&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; &#xC811;&#xADFC;&#xC740; <code>file://</code> URI&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xBA70;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC774; &#xACBD;&#xACC4;&#xB97C; &#xC11C;&#xBC84;&#xC5D0; &#xBA85;&#xD655;&#xD788; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xC0D8;&#xD50C; &#xC694;&#xCCAD; &#xC608;&#xC2DC;</p>
  <pre><code class="hljs bash">{
  <span class="hljs-string">&quot;uri&quot;</span>: <span class="hljs-string">&quot;file:///Users/agent/travel-planning&quot;</span>,
  <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;Travel Planning Workspace&quot;</span>
}</code></pre>
</li>
</ul>
<p>&#xC11C;&#xBC84;&#xB294; &#xC774; &#xB8E8;&#xD2B8; &#xB0B4;&#xBD80;&#xC758; &#xD30C;&#xC77C;&#xB9CC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD558;&#xBA70;, &#xC678;&#xBD80; &#xACBD;&#xB85C;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC815;&#xCC45;&#xC5D0; &#xB530;&#xB77C; &#xCC28;&#xB2E8;&#xB429;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD3F4;&#xB354;&#xB97C; &#xC5F4;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC790;&#xB3D9;&#xC73C;&#xB85C; roots&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, <code>roots/list_changed</code> &#xC774;&#xBCA4;&#xD2B8;&#xB85C; &#xC11C;&#xBC84;&#xC5D0; &#xC54C;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h3 id="2-3-Elicitation-&#xC0AC;&#xC6A9;&#xC790;-&#xCD94;&#xAC00;-&#xC785;&#xB825;-&#xC694;&#xCCAD;"><a href="#2-3-Elicitation-&#xC0AC;&#xC6A9;&#xC790;-&#xCD94;&#xAC00;-&#xC785;&#xB825;-&#xC694;&#xCCAD;" class="headerlink" title="(2-3) Elicitation: &#xC0AC;&#xC6A9;&#xC790; &#xCD94;&#xAC00; &#xC785;&#xB825; &#xC694;&#xCCAD;"></a>(2-3) Elicitation: &#xC0AC;&#xC6A9;&#xC790; &#xCD94;&#xAC00; &#xC785;&#xB825; &#xC694;&#xCCAD;</h3><p>Elicitation&#xC740; &#xC11C;&#xBC84;&#xAC00; &#xC791;&#xC5C5; &#xC911; &#xD544;&#xC694;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; <strong>&#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xAE30;&#xB2A5;</strong>&#xC785;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xC0AC;&#xC6A9; &#xD750;&#xB984;</p>
<p><img src="/2025/09/02/romi0x/MCP_Part2_ko/image1.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: [https://modelcontextprotocol.io/docs/learn/client-concepts](https://modelcontextprotocol.io/docs/learn/client-concepts)"><br>&#xCD9C;&#xCC98;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/docs/learn/client-concepts">https://modelcontextprotocol.io/docs/learn/client-concepts</a></p>
<ol>
<li>&#xC11C;&#xBC84;&#xAC00; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC785;&#xB825; &#xC694;&#xCCAD;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; UI&#xB97C; &#xD1B5;&#xD574; &#xBA54;&#xC2DC;&#xC9C0; &#xBC0F; &#xC785;&#xB825; &#xC591;&#xC2DD;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xC815;&#xBCF4;&#xB97C; &#xC11C;&#xBC84;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xACE0; &#xC791;&#xC5C5;&#xC744; &#xACC4;&#xC18D; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
</li>
<li><p>&#xC0D8;&#xD50C; &#xC694;&#xCCAD; &#xC608;&#xC2DC;</p>
  <pre><code class="hljs bash">{
  <span class="hljs-string">&quot;method&quot;</span>: <span class="hljs-string">&quot;elicitation/requestInput&quot;</span>,
  <span class="hljs-string">&quot;params&quot;</span>: {
    <span class="hljs-string">&quot;message&quot;</span>: <span class="hljs-string">&quot;&#xBC14;&#xB974;&#xC140;&#xB85C;&#xB098; &#xC5EC;&#xD589; &#xC608;&#xC57D;&#xC744; &#xD655;&#xC815;&#xD574; &#xC8FC;&#xC138;&#xC694;:&quot;</span>,
    <span class="hljs-string">&quot;schema&quot;</span>: {
      <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;object&quot;</span>,
      <span class="hljs-string">&quot;properties&quot;</span>: {
        <span class="hljs-string">&quot;confirmBooking&quot;</span>: { <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;boolean&quot;</span> },
        <span class="hljs-string">&quot;seatPreference&quot;</span>: {
          <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>,
          <span class="hljs-string">&quot;enum&quot;</span>: [<span class="hljs-string">&quot;window&quot;</span>, <span class="hljs-string">&quot;aisle&quot;</span>, <span class="hljs-string">&quot;no preference&quot;</span>]
        },
        <span class="hljs-string">&quot;roomType&quot;</span>: {
          <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>,
          <span class="hljs-string">&quot;enum&quot;</span>: [<span class="hljs-string">&quot;sea view&quot;</span>, <span class="hljs-string">&quot;city view&quot;</span>]
        }
      },
      <span class="hljs-string">&quot;required&quot;</span>: [<span class="hljs-string">&quot;confirmBooking&quot;</span>]
    }
  }
}
</code></pre>
</li>
</ul>
<hr>
<h2 id="3-&#xC804;&#xCCB4;-&#xD1B5;&#xC2E0;-&#xAD6C;&#xC870;"><a href="#3-&#xC804;&#xCCB4;-&#xD1B5;&#xC2E0;-&#xAD6C;&#xC870;" class="headerlink" title="(3) &#xC804;&#xCCB4; &#xD1B5;&#xC2E0; &#xAD6C;&#xC870;"></a>(3) &#xC804;&#xCCB4; &#xD1B5;&#xC2E0; &#xAD6C;&#xC870;</h2><p><img src="/2025/09/02/romi0x/MCP_Part2_ko/image2.png" srcset="/img/loading.gif" alt="&#xCD9C;&#xCC98;: &#xBCF8;&#xC778; &#xC81C;&#xC791;"><br>&#xCD9C;&#xCC98;: &#xBCF8;&#xC778; &#xC81C;&#xC791;</p>
<p><strong>&#xC0AC;&#xC6A9;&#xC790;(User)</strong>&#xB294; &#xD638;&#xC2A4;&#xD2B8; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;(&#xC608;: Claude, GPT &#xAE30;&#xBC18; IDE &#xB4F1;)&#xC744; &#xD1B5;&#xD574; AI &#xBAA8;&#xB378;&#xACFC; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>AI &#xBAA8;&#xB378;(Host)</strong>&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xD574;&#xC11D;&#xD558;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xACB0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>MCP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;(Client)</strong>&#xB294; &#xD638;&#xC2A4;&#xD2B8;&#xC640; MCP &#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xC5D0;&#xC11C; <strong>&#xC911;&#xACC4;&#xC790; &#xC5ED;&#xD560;</strong>&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBAA8;&#xB4E0; &#xD1B5;&#xC2E0;&#xC740; <strong>JSON-RPC</strong> &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC8FC;&#xACE0;&#xBC1B;&#xC73C;&#xBA70;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xC11C;&#xBC84;&#xC640;&#xC758; &#xC5F0;&#xACB0;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xBA74;&#xC11C; &#xC0AC;&#xC6A9;&#xC790; &#xC2B9;&#xC778;, &#xBCF4;&#xC548; &#xC81C;&#xC5B4;, &#xBAA8;&#xB378; &#xD638;&#xCD9C; &#xC704;&#xC784;(sampling) &#xB4F1;&#xC744; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>MCP &#xC11C;&#xBC84;(Server)&#xB294; &#xC2E4;&#xC81C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC11C;&#xBC84;&#xB294; &#xC138; &#xAC00;&#xC9C0; &#xD575;&#xC2EC; &#xBE4C;&#xB529; &#xBE14;&#xB85D;&#xC744; &#xB178;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>Tool</strong>: AI&#xAC00; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xC561;&#xC158; (&#xC608;: &#xD56D;&#xACF5;&#xD3B8; &#xAC80;&#xC0C9;, &#xC774;&#xBA54;&#xC77C; &#xC804;&#xC1A1;, &#xC77C;&#xC815; &#xB4F1;&#xB85D;)</li>
<li><strong>Resource</strong>: AI&#xC5D0;&#xAC8C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xBB38;&#xB9E5; &#xB370;&#xC774;&#xD130; (&#xC608;: &#xD30C;&#xC77C;, &#xCE98;&#xB9B0;&#xB354;, &#xB0A0;&#xC528; &#xC815;&#xBCF4;)</li>
<li><strong>Prompt</strong>: &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC7AC;&#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xAD6C;&#xC870;&#xD654;&#xB41C; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD15C;&#xD50C;&#xB9BF; (&#xC608;: &#x201C;&#xD734;&#xAC00; &#xACC4;&#xD68D; &#xC9DC;&#xC918;&#x201D;)</li>
</ul>
<p>&#xC774;&#xB7EC;&#xD55C; &#xAD6C;&#xC870;&#xB97C; &#xD1B5;&#xD574; MCP&#xB294; AI &#xBAA8;&#xB378;&#xC774; &#xC678;&#xBD80; &#xB370;&#xC774;&#xD130;&#xC640; &#xB3C4;&#xAD6C;&#xC5D0; &#xC548;&#xC804;&#xD558;&#xACE0; &#xC77C;&#xAD00;&#xB418;&#xAC8C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xBA70;, &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xBAA8;&#xB4E0; &#xC561;&#xC158;&#xC744; &#xC9C1;&#xC811; &#xC2B9;&#xC778;&#xD558;&#xACE0; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xB294; &#xC2E0;&#xB8B0; &#xAE30;&#xBC18;&#xC758; &#xD658;&#xACBD;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xBC88; &#xC5F0;&#xAD6C;&#xAE00;&#xC740; MCP&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC880; &#xB354; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xB2E4;&#xB904;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4; -!</p>
<p>&#xC2E4;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xD655; &#xB420; &#xAC83; &#xAC19;&#xB124;&#xC694;!</p>
<p>MCP&#xB97C; &#xC190;&#xC27D;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/docs/tutorials/use-remote-mcp-server">&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;</a>&#xC774; &#xC788;&#xC73C;&#xB2C8; &#xD568;&#xAED8;&#xBCF4;&#xBA74; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC544;&#xC694;~</p>
<h3 id="Ref"><a href="#Ref" class="headerlink" title="Ref"></a>Ref</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://modelcontextprotocol.io/docs/getting-started/intro">https://modelcontextprotocol.io/docs/getting-started/intro</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/mcp/">mcp</a>
                  
                  <a class="hover-with-bg" href="/tags/romi0x/">romi0x</a>
                  
                  <a class="hover-with-bg" href="/tags/llm/">llm</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_romi0x.jpg" srcset="/img/loading.gif" alt="romi0x">
                  </div>

                  <div class="link-text">
                    <div class="link-title">romi0x</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/romi0x">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/09/02/romi0x/MCP_Part2_en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] MCP (Model Context Protocol) Part 2 (en)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/08/30/banda/CVE-2025-29824/">
                    <span class="hidden-mobile">[] CVE-2025-29824: Windows CLFS (clfs.sys) Use-After-Free  LPE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/09/02/romi0x/MCP_Part2_ko/';
        this.page.identifier = '/2025/09/02/romi0x/MCP_Part2_ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] MCP (Model Context Protocol) Part 2 (ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
