

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/logo_window.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; &amp;#xBC8C;&amp;#xC368; 2025&amp;#xB144;&amp;#xC774; &amp;#xB05D;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;.. &amp;#xB2E4;&amp;#xB4E4; &amp;#xC5F0;&amp;#xB9D0; &amp;#xC798; &amp;#xC990;&amp;#xAE30;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?&amp;#x1F385;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8;&amp;#xD587; &amp;#xC2A4;&amp;#xCFE8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC800;&amp;#xD76C; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4; &amp;#xC77C;&amp;#xBD80;&amp;#xAC00; &amp;#x2018;Windows Kernel Driver &amp;amp; Named Pipe LPE &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB54C;&amp;#xB294; 2025&amp;#xB144; 5&amp;#xC6D4;.. &amp;#xBA58;&amp;#xD1A0;&amp;#xB2D8;&amp;#xC758; &amp;#x2018;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xD55C;&amp;#xB9C8;&amp;#xB514;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAC8C; &amp;#xB41C; banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; part 1&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xD2B9;&amp;#xD788; Kernel Driver &amp;amp; Named Pipe &amp;#xBCA1;&amp;#xD130;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xAFC0;&amp;#xD301;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC774;&amp;#xD6C4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xC8FC;&amp;#xC2E4; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB2C8;, &amp;#xAF2D; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xAE30; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xBCF8; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kernel Driver Named Pipe &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; LPE &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C;, &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h2 id=&#34;Chapter-1-Kernel-Driver-as-an-Attack-Surface&#34;&gt;&lt;a href=&#34;#Chapter-1-Kernel-Driver-as-an-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;Chapter 1: Kernel Driver as an Attack Surface&#34;&gt;&lt;/a&gt;Chapter 1: Kernel Driver as an Attack Surface&lt;/h2&gt;&lt;h3 id=&#34;1-1-Kernel-Driver-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#1-1-Kernel-Driver-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Kernel Driver &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&lt;strong&gt;1.1 Kernel Driver &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xBC94;&amp;#xC704; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. WDM &amp;#xAD6C;&amp;#xC870;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; IRP(&lt;code&gt;IRP_MJ_DEVICE_CONTROL&lt;/code&gt;)&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;IO_STACK_LOCATION&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC640; &amp;#xCD9C;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC758; &amp;#xAE38;&amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; IOCTL &amp;#xC804;&amp;#xB2EC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; IRP &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; WDM&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; I/O Manager&amp;#xAC00; &amp;#xCEE4;&amp;#xB110; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &lt;code&gt;Irp-&amp;gt;AssociatedIrp.SystemBuffer&lt;/code&gt;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xBAA8;&amp;#xB450; &amp;#xC774; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC774;&amp;#xB7F0; IOCTL &amp;#xCC98;&amp;#xB9AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; I/O Manager&amp;#xAC00; IRP&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD2B9;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;1-2-Kernel-Driver-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;a href=&#34;#1-2-Kernel-Driver-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34; class=&#34;headerlink&#34; title=&#34;1.2 Kernel Driver &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;/a&gt;1.2 Kernel Driver &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC81C;&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xD55C; &amp;#xC11C;&amp;#xB4DC;&amp;#xD30C;&amp;#xD2F0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;? &amp;#xCCAB; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; FolderChangesView&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; sys &amp;#xD30C;&amp;#xC77C; &amp;#xBA85;&amp;#xACFC; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; Path&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C;, &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; DriverView&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xB294;&amp;#xAC74; IOCTL, IRP &amp;#xCC98;&amp;#xB9AC; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD234;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; FolderChangesView&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xC11C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC6A9; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB85C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xC6A9; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC798; &amp;#xC62E;&amp;#xACA8;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;1-3-Kernel-Driver-&amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;a href=&#34;#1-3-Kernel-Driver-&amp;#xBD84;&amp;#xC11D;&#34; class=&#34;headerlink&#34; title=&#34;1.3 Kernel Driver &amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;/a&gt;1.3 Kernel Driver &amp;#xBD84;&amp;#xC11D;&lt;/h3&gt;&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;DeviceName&lt;/code&gt; &amp;#x2192; &amp;#xC720;&amp;#xC800; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80; &amp;#xD310;&amp;#xB2E8;&lt;/li&gt;
&lt;li&gt;WinObj&amp;#xB85C; &lt;code&gt;\Device&lt;/code&gt; &amp;#xB178;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;IDA/Plugin &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791;&lt;/li&gt;
&lt;li&gt;IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IOCTL Table &amp;#xC2DD;&amp;#xBCC4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;DispatchRoutine&lt;/code&gt; &amp;#xBD84;&amp;#xC11D; &amp;#x2192; &amp;#xC785;&amp;#xB825; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xBD84;/ &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;/ &amp;#xD544;&amp;#xB4DC; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xD750;&amp;#xB984;&lt;code&gt;/Device&lt;/code&gt; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; DriverEntry&amp;#xC5D0;&amp;#xC11C; Device, Symlink&amp;#xAC00; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xCC98;&amp;#xB7FC; Device Name&amp;#xC774; &lt;code&gt;\Device\PdFwKrnl&lt;/code&gt;, Symlink&amp;#xAC00; &lt;code&gt;\DosDevices\PdFwKrnl&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile/DeviceControl&lt;/code&gt;&amp;#xB85C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0BC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;DriverObject-&amp;gt;MajorFunction&lt;/code&gt; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&lt;code&gt;IRP_MJ_DEVICE_CONTROL&lt;/code&gt;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xB8E8;&amp;#xD2F4;(&lt;code&gt;DispatchDeviceControl&lt;/code&gt;)&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\Device&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xB204;&amp;#xAD6C;&amp;#xD55C;&amp;#xD14C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. WinObj&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\Device&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; Device Object&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, Symlink&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Device&amp;#xC640; Symlink&amp;#xC758; Security &amp;#xD0ED;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; Everyone&amp;#xC778; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; Read Write &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAF2D; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; IOCTL &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; IDA&amp;#xC758; DriverBuddy&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC694; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC778;&amp;#xC9C0; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. DriverBuddy&amp;#xAC00; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110; API &amp;#xD638;&amp;#xCD9C; &amp;#xD754;&amp;#xC801;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;, &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &lt;code&gt;MmMapIoSpace&lt;/code&gt;, &lt;code&gt;MmUnmapIoSpace&lt;/code&gt;, &lt;code&gt;MmBuildMdlForNonPagedPool&lt;/code&gt;, &lt;code&gt;MmMapLockedPages&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD638;&amp;#xCD9C; &amp;#xC9C0;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xAC19;&amp;#xC740; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xAC00;&amp;#xC0C1; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;, &amp;#xC989; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC8FC;&amp;#xC18C;, &amp;#xAE38;&amp;#xC774;, &amp;#xCE90;&amp;#xC2DC; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xAC78; &amp;#xBD84;&amp;#xC11D; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; switch-case&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; IOCTL &amp;#xBD84;&amp;#xAE30; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC5ED;&amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80; switch-case&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; IOCTL Cases&amp;#xB4E4;&amp;#xC774; &lt;code&gt;0x80002000&lt;/code&gt;, &lt;code&gt;0x80002004&lt;/code&gt;, &lt;code&gt;0x8000201C&lt;/code&gt;&amp;#x2026; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD0C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; IOCTL Case&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xD589;&amp;#xC704; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC635;&amp;#xC158; &amp;#xAC12;, &amp;#xAE38;&amp;#xC774;, &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xCC98;&amp;#xB9AC;&amp;#xAC19;&amp;#xC740; &amp;#xC785;&amp;#xB825; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF8; &amp;#xC9C0;&amp;#xC810;&amp;#xC740; &lt;code&gt;0x8000202C&lt;/code&gt; Case&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; IRP &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xAC12;&amp;#xC744; &lt;code&gt;dst&lt;/code&gt;/&lt;code&gt;src&lt;/code&gt;/&lt;code&gt;size&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xD574; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xC11C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xB370;&amp;#xC694;. WDM &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;DeviceIoControl&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; IOCTL&amp;#xC774; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xB77C;&amp;#xBA74; I/O Manager&amp;#xC740; &lt;code&gt;IRP&amp;#x2192;AssociatedIrp.SystemBuffer&lt;/code&gt;&amp;#xC5D0; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB123;&amp;#xACE0;, &amp;#xADF8; &amp;#xBC84;&amp;#xD37C; &amp;#xC548;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC720;&amp;#xC800; &amp;#xC778;&amp;#xD48B;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xC11C; &amp;#xCC44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;0x8000202C&lt;/code&gt; Case&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C; &amp;#xAE38;&amp;#xC774; &lt;code&gt;0x38&lt;/code&gt;&amp;#xB9CC; &amp;#xB9DE;&amp;#xC73C;&amp;#xBA74;, &amp;#xADF8; &amp;#xBC84;&amp;#xD37C; &amp;#xC548;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;(+&lt;code&gt;0x20&lt;/code&gt;/+&lt;code&gt;0x28&lt;/code&gt;/+&lt;code&gt;0x30&lt;/code&gt;)&amp;#xC5D0;&amp;#xC11C; &amp;#xAEBC;&amp;#xB0B8; &amp;#xAC12;&amp;#xC744; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;/&amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; read/ write primitive&amp;#xAC00; &amp;#xC131;&amp;#xB9BD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; WinDBG&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &lt;code&gt;0x8000202C&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SystemBuffer(rsi)+0x20/0x28/0x30&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xC5D0; &amp;#xB123;&amp;#xB294;&amp;#xB2E4;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB294;&amp;#xB370;, payload&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;rsi&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xC758; &lt;code&gt;SystemBuffer&lt;/code&gt; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C;&amp;#xB300;&amp;#xB85C;  &amp;#x2018;&lt;code&gt;A&lt;/code&gt;&amp;#x2019;&amp;#xB85C; &amp;#xB36E;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; exploit&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC704;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; IOCTL &amp;#xC785;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB2E4; &lt;code&gt;dst=output_buf&lt;/code&gt;(&amp;#xC720;&amp;#xC800; &amp;#xC8FC;&amp;#xC18C;), &lt;code&gt;src=&amp;#xC77D;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&lt;/code&gt;, &lt;code&gt;size=8&lt;/code&gt;&amp;#xC744; &amp;#xB123;&amp;#xC5B4; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704; Arbitrary Read&amp;#xAC00; &amp;#xC131;&amp;#xB9BD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xBC84;&amp;#xADF8; &amp;#xCC3E;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xC778; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xACE0;, &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC5BB;&amp;#xC740; SYSTEM EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; TOKENOFFSET&amp;#xC744; &amp;#xB354;&amp;#xD574; &lt;code&gt;EPROCESS-&amp;gt;Token&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628; &amp;#xD6C4;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD574; Token &amp;#xD544;&amp;#xB4DC; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C; &amp;#xB4A4;, IOCTL&amp;#xC5D0; &lt;code&gt;dst=&amp;#xD604;&amp;#xC7AC; EPROCESS+TOKENOFFSET&lt;/code&gt;, &lt;code&gt;src=&amp;#xC900;&amp;#xBE44;&amp;#xD55C; SYSTEM &amp;#xD1A0;&amp;#xD070; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/code&gt;, &lt;code&gt;size=8&lt;/code&gt; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; Arbitrary Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD574; Privilege escalation&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xB4EF; &amp;#xC138;&amp;#xBD80; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB098;&amp;#xD0C0;&amp;#xB09C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC720;&amp;#xD615;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;   &lt;/p&gt;
&lt;h2 id=&#34;Chapter-2-Named-Pipe-as-an-Attack-Surface&#34;&gt;&lt;a href=&#34;#Chapter-2-Named-Pipe-as-an-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;Chapter 2: Named Pipe as an Attack Surface&#34;&gt;&lt;/a&gt;Chapter 2: Named Pipe as an Attack Surface&lt;/h2&gt;&lt;h3 id=&#34;2-1-Named-Pipe-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#2-1-Named-Pipe-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;2.1 Named Pipe &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;2.1 Named Pipe &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&lt;/h3&gt;&lt;p&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; Named Pipe&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC778;&amp;#xB370;&amp;#xC694;. Named Pipe &amp;#xD1B5;&amp;#xC2E0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xC804;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/&#34;&gt;&amp;#x1F449;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&lt;/a&gt; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC624;&amp;#xC2DC;&amp;#xB294;&amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! Named Pipe&amp;#xB294; IPC &amp;#xD1B5;&amp;#xC2E0; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCEE4;&amp;#xB110; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; SYSTEM &amp;#xAD8C;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBE48;&amp;#xBC88;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; Named Pipe &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC774;&amp;#xAC78; &amp;#xB0B4;&amp;#xBD80; &amp;#xBA54;&amp;#xC138;&amp;#xC9C0;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB85C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAD8C;&amp;#xD55C; &amp;#xBCC0;&amp;#xACBD;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xB3D9;&amp;#xC791;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC2E4;&amp;#xD589;&amp;#xAC19;&amp;#xC740; &amp;#xBBFC;&amp;#xAC10; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xAF64; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xBA74; LPE&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IPC&amp;#xB294; IOCTL&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2DC;&amp;#xC8E0;? &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;2-2-Named-Pipe-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;a href=&#34;#2-2-Named-Pipe-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34; class=&#34;headerlink&#34; title=&#34;2.2 Named Pipe &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;/a&gt;2.2 Named Pipe &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; (1) SYSTEM/&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB97C; &amp;#xACE0;&amp;#xB9AC;&amp;#xACE0;, (2) &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;, (3) &amp;#xD30C;&amp;#xC774;&amp;#xD504; ACL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Everyone &amp;#xAC19;&amp;#xC740; &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xAC00; Read Write &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Process Explorer&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB97C; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC81C;&amp;#xAC00; &amp;#xC7A1;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACC4;&amp;#xC815;&amp;#xC774; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0;, &amp;#xC11C;&amp;#xB4DC;&amp;#xD30C;&amp;#xD2F0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0;, HANDLE&amp;#xC5D0; Named Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;, Integrity Level&amp;#xC774; SYSTEM&amp;#xC778;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC881;&amp;#xD600;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; Process Explorer &amp;#xD558;&amp;#xB2E8;&amp;#xC758; Handles &amp;#xD0ED;&amp;#xC5D0;&amp;#xC11C; NamedPipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB54C; Type&amp;#xC774; &lt;code&gt;File&lt;/code&gt;&amp;#xB85C; &amp;#xC7A1;&amp;#xD788;&amp;#xBA74;&amp;#xC11C; Name&amp;#xC774; &lt;code&gt;\Device\NamedPipe\&amp;#x2026;&lt;/code&gt; &amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD56D;&amp;#xBAA9;&amp;#xC774; Named Pipe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &lt;code&gt;\Device\NamedPipe\&amp;#x2026;&lt;/code&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\.\pipe\&amp;#x2026;&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xAD00;&amp;#xBB38;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.. &amp;#xBC14;&amp;#xB85C; ACL&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD798;&amp;#xB4E4;&amp;#xAC8C; Named Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC78; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F8; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74;&amp;#x2026; &amp;#xADF8; Named Pipe&amp;#xC640;&amp;#xB294; &amp;#xC791;&amp;#xBCC4;&amp;#xC778;&amp;#xC0AC;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F62D;  Administrators&amp;#xB9CC; RW&amp;#xC774;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xC5D0;&amp;#xAC90; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; LPE&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xBCF4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xACE0;, Everyone, Authenticated Users, Users &amp;#xAC19;&amp;#xC740; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD55C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; RW&amp;#xAC00; &amp;#xC5F4;&amp;#xB824; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; accesschk&amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; ACL&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC881;&amp;#xD600;&amp;#xB098;&amp;#xAC00;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74;, &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;CreateNamedPipeA/W&lt;/code&gt;, &lt;code&gt;ConnectNamedPipe&lt;/code&gt;, &lt;code&gt;DisconnectNamedPipe&lt;/code&gt; &amp;#xAC19;&amp;#xC740; API&amp;#xB4E4;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xAC8C; &amp;#xC11C;&amp;#xBC84; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;Connect &amp;#x2192; Read&lt;/code&gt; &amp;#xD750;&amp;#xB984;, &amp;#xD30C;&amp;#xC2F1; &amp;#xBD84;&amp;#xAE30;, &amp;#xD1A0;&amp;#xD070;/&amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC19;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xAD00;&amp;#xB828; &amp;#xBD84;&amp;#xAE30;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB05D;&amp;#xC774; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;2-3-Named-Pipe-&amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;a href=&#34;#2-3-Named-Pipe-&amp;#xBD84;&amp;#xC11D;&#34; class=&#34;headerlink&#34; title=&#34;2.3 Named Pipe &amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;/a&gt;2.3 Named Pipe &amp;#xBD84;&amp;#xC11D;&lt;/h3&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Process Explorer&amp;#xB85C; &amp;#xC11C;&amp;#xBC84;(SYSTEM &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;) &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4; &amp;#xC120;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &lt;code&gt;\Device\NamedPipe\...&lt;/code&gt;&amp;#xAC00; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\\.\pipe\...&lt;/code&gt;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;accesschk&amp;#xB85C; Pipe ACL &amp;#xC810;&amp;#xAC80; &amp;#x2192; Everyone&amp;#xAC19;&amp;#xC740; &amp;#xAD11;&amp;#xBC94;&amp;#xC704; &amp;#xADF8;&amp;#xB8F9; Read/Write &amp;#xC5F4;&amp;#xB9BC; &amp;#xC5EC;&amp;#xBD80; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;IDA&amp;#xB85C; &lt;code&gt;CreateNamedPipe*&lt;/code&gt; &amp;#x2192; &lt;code&gt;ConnectNamedPipe&lt;/code&gt; &amp;#x2192; &lt;code&gt;ReadFile/WriteFile&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xD568;&amp;#xC218; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xC7A1;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;/HKLM, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC124;&amp;#xC815; &amp;#xB4F1; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xC881;&amp;#xD788;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;ProcMon &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801;&amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC815;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; procmon&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; I/O&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD589;&amp;#xC704;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC1A1;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC881;&amp;#xD78C; &amp;#xD6C4;&amp;#xC5D0;, &lt;code&gt;CreateNamedPipe&lt;/code&gt;, &lt;code&gt;CreateFile&lt;/code&gt;, &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xAC19;&amp;#xC740; IPC &amp;#xD638;&amp;#xCD9C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; &lt;code&gt;Process Name&lt;/code&gt;, &lt;code&gt;Operation&lt;/code&gt;&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB098; named pipe &amp;#xD575;&amp;#xC2EC; I/O &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; Filter&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xACE0;, &amp;#xC11C;&amp;#xBC84; Integrity&amp;#xAC00; System&amp;#xC778;&amp;#xC9C0; &amp;#xD544;&amp;#xD130;&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xD574;&amp;#xB450;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xC720;&amp;#xC800; &amp;#xC785;&amp;#xB825;&amp;#xC774; SYSTEM&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xCE68; &amp;#xC81C;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC5D0; Non Admin&amp;#xB3C4; Access Control&amp;#xB85C; &amp;#xC77C;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xB124;&amp;#xC694;.. &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xADF8;&amp;#xB7F4;&amp;#xB9CC;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC774;&amp;#xB807;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB294;&amp;#xB370; &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;/ &amp;#xBCF4;&amp;#xD638; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xD5C8;&amp;#xC6A9; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xBD10;&amp;#xB3C4; UAC&amp;#xAC00; &amp;#xC804;&amp;#xD600; &amp;#xB728;&amp;#xC9C0; &amp;#xC54A;&amp;#xB124;&amp;#xC694;?? &amp;#xBB54;&amp;#xAC00; &amp;#xC218;&amp;#xC0C1;&amp;#xD558;&amp;#xC8E0;? &amp;#xBC14;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC6B0;&amp;#xC120; &amp;#xC21C;&amp;#xC704;&amp;#xB85C; &amp;#xC758;&amp;#xC2EC;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PS C:\Users\banda\Downloads\AccessChk&amp;gt; .\accesschk.exe -accepteula -lv &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\pipe\K7TSMngrService1&amp;quot;&lt;/span&gt;

\\.\Pipe\K7TSMngrService1
  DESCRIPTOR FLAGS:
      [SE_DACL_PRESENT]
      [SE_SACL_PRESENT]
      [SE_SACL_AUTO_INHERITED]
      [SE_SELF_RELATIVE]
  OWNER: NT AUTHORITY\SYSTEM
  LABEL: Low Mandatory Level
        SYSTEM_MANDATORY_LABEL_NO_WRITE_UP
  [&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] ACCESS_ALLOWED_ACE_TYPE: NT AUTHORITY\SYSTEM
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL
  [&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] ACCESS_ALLOWED_ACE_TYPE: Everyone
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;ACL&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt; &amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC758;&amp;#xC2EC;&amp;#xACFC; &amp;#xB9DE;&amp;#xAC8C; DACL&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB110;&amp;#xB110;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. Everyone&amp;#xC5D0; &lt;code&gt;file read&lt;/code&gt;, &lt;code&gt;file write&lt;/code&gt;, &lt;code&gt;file append&lt;/code&gt;&amp;#xAC19;&amp;#xC740;&amp;#xAC8C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD574; write&amp;#xD558;&amp;#xACE0; read&amp;#xD558;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58;&amp;#xB098; &amp;#xD30C;&amp;#xC2F1; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xB450; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Named Pipe&amp;#xC758; &amp;#xC11C;&amp;#xBC84; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC0DD;&amp;#xC131; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD070; &amp;#xACE8;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC740;&amp;#xB370;, &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;CreateNamedPipeA(&amp;quot;\\\\.\\pipe\\K7TSMngrService1&amp;quot;, ...)&lt;/code&gt;&amp;#xB85C; Named Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;ConnectNamedPipe&lt;/code&gt;&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB7F0; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC77D;&amp;#xB294;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image21.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// request header (28 bytes)&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; _&lt;span class=&#34;hljs-title&#34;&gt;K7TS_REQ_HDR&lt;/span&gt; {&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; magic;      &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;apos;K7TS&amp;apos;&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; ver;        &lt;span class=&#34;hljs-comment&#34;&gt;// 0x1010&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; hdr_sz;     &lt;span class=&#34;hljs-comment&#34;&gt;// 28&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; reserved;   &lt;span class=&#34;hljs-comment&#34;&gt;// 0&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; op;         &lt;span class=&#34;hljs-comment&#34;&gt;// v21&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; in_len;     &lt;span class=&#34;hljs-comment&#34;&gt;// nNumberOfBytesToRead&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; out_len;    &lt;span class=&#34;hljs-comment&#34;&gt;// v23&lt;/span&gt;
} K7TS_REQ_HDR;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, &amp;#xC694;&amp;#xCCAD; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xC9C0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB72F;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB300;&amp;#xC0C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;result = 0x4B375453(&amp;apos;K7TS&amp;apos;)&lt;/code&gt;, &lt;code&gt;ver=0x1010&lt;/code&gt;, &lt;code&gt;hdr_sz=28&lt;/code&gt;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD; &amp;#xD0C0;&amp;#xC785;&amp;#xACFC; &amp;#xC785;&amp;#xCD9C;&amp;#xB825; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &lt;code&gt;1mb&lt;/code&gt;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; heap &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &amp;#xB0B4;&amp;#xBD80; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCC98;&amp;#xB85C; &amp;#xB118;&amp;#xACA8; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; 36&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC751;&amp;#xB2F5;&amp;#xD5E4;&amp;#xB354; + &amp;#xC751;&amp;#xB2F5; &amp;#xBC14;&amp;#xB514;&amp;#xB97C; &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0; &lt;code&gt;DisconnectNamedPipe&lt;/code&gt;, &lt;code&gt;CloseHandle&lt;/code&gt;&amp;#xB85C; &amp;#xC138;&amp;#xC158;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xAC80;&amp;#xC99D; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC80;&amp;#xC99D; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xC544;&amp;#xAE4C; &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD24;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xCC38;&amp;#xC870;&amp;#xB97C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &lt;code&gt;AdminNonAdminIsValid&lt;/code&gt;, &lt;code&gt;AdminChangesNeedPassword&lt;/code&gt;, &lt;code&gt;AdminEnableNeedVerification&lt;/code&gt; &amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &lt;code&gt;K7TS&lt;/code&gt; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xAE30;&amp;#xBC18; &amp;#xC815;&amp;#xCC45; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD; &amp;#xD558;&amp;#xB098;&amp;#xB85C; SYSTEM &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;HKLM&lt;/code&gt;&amp;#xC5D0; Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC800;&amp;#xD76C;&amp;#xAC19;&amp;#xC740; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; SYSTEM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; Write&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; primitive&amp;#xAC00; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBCF4;&amp;#xACE0; Process Monitor &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. Named Pipe&amp;#xB294; &amp;#xC77C;&amp;#xB2E8; IPC &amp;#xC5D4;&amp;#xB4DC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;/&lt;code&gt;HKLM&lt;/code&gt;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC124;&amp;#xC815;, &amp;#xD30C;&amp;#xC77C; &amp;#xC77D;&amp;#xAE30;/&amp;#xC4F0;&amp;#xAE30;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC2E4;&amp;#xD589;&amp;#xAC19;&amp;#xC740; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC798; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC9C0;&amp;#xAE08; ProcMon &amp;#xB85C;&amp;#xADF8;&amp;#xB294; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC778; &amp;#xC81C;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC900; &amp;#xD6C4;&amp;#xC5D0;, SYSTEM &amp;#xAD8C;&amp;#xD55C; &lt;code&gt;K7TSMngr.exe&lt;/code&gt;&amp;#xAC00; &lt;code&gt;HKLM&lt;/code&gt;&amp;#xC5D0; &amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#xAD00;&amp;#xB828; &amp;#xD0A4;&amp;#xC778; &lt;code&gt;AdminNonAdminIsValid&lt;/code&gt;, &lt;code&gt;AdminChangesNeedPassword&lt;/code&gt;, &lt;code&gt;AdminChangesPasswordHash&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; write&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C; &amp;#xC694;&amp;#xAD6C;, &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xD5C8;&amp;#xC6A9;&amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACC4;&amp;#xAC00; &amp;#xD480;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; LPE&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8;&amp;#xC740; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB85C; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC11C; &lt;code&gt;K7TS&lt;/code&gt; &amp;#xD5E4;&amp;#xB354;&amp;#xC640; &amp;#xB9E4;&amp;#xC9C1; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; SYSTEM&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xC124;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4;&amp;#xC5D0;, &lt;code&gt;HKLM&lt;/code&gt; IFEO&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &lt;code&gt;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\K7TSHlpr.exe&lt;/code&gt; &amp;#xC774; &amp;#xD0A4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xB744;&amp;#xC6B8;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xAC78; &lt;code&gt;cmd.exe /c C:\temp\payload.bat&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xCE58;&amp;#xAE30;&amp;#xD558;&amp;#xBA74;..? LPE&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;K7TSMngrService1&lt;/code&gt; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xB294; &lt;code&gt;K7TSMngr.exe&lt;/code&gt;&amp;#xC600;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xBD80; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;code&gt;K7TSHlpr.exe&lt;/code&gt; &amp;#xBCF4;&amp;#xC870; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB192;&amp;#xC740; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xAC78; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; bat &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.   &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Local Group Memberships&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; Administrators&amp;#xAC00; &amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; Named Pipe&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; ACL, &amp;#xAD8C;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC; &amp;#xBD80;&amp;#xC7AC;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xACBD;&amp;#xB85C; &amp;#xC870;&amp;#xC791;, &amp;#xB808;&amp;#xC774;&amp;#xC2A4;&amp;#xCEE8;&amp;#xB514;&amp;#xC158;&amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB2C8;.. &amp;#xB9CE;&amp;#xC740; &amp;#xCC38;&amp;#xACE0;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xD638;&amp;#xD638;&amp;#xD638;&amp;#x2026;&amp;#x1F98C;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC774; &amp;#xC88B;&amp;#xC740; &amp;#xC5F0;&amp;#xB9D0; &amp;#xC120;&amp;#xBB3C;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xAE30;&amp;#xB97C; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;! Kernel Driver, Named Pipe &amp;#xC218;&amp;#xC9D1;&amp;#xACFC; &amp;#xBD84;&amp;#xC11D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xC608;&amp;#xC804; cve&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xC740; Win11 24H2 &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xD2F0;&amp;#xC5E0;&amp;#xC544;&amp;#xC774;&amp;#xC778;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xAE00;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD234;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB9C9; &amp;#xB208;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xB534; &amp;#xAE38;&amp;#xB85C; &amp;#xC0DC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xD558;&amp;#xD56B;  &amp;#xB2E4;&amp;#xC74C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://voidsec.com/windows-drivers-reverse-engineering-methodology/&#34;&gt;Windows Driver RE Methodology (voidsec)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.amd.com/en/resources/product-security/bulletin/amd-sb-6009.html&#34;&gt;AMD-SB-6009: Radeon Graphics Kernel Driver Privilege Management&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://owasp.org/www-chapter-seoul/#div-pastevents&#34;&gt;OWASP Seoul(2025.07) - Windows 3rd-Party Driver LPE BugHunting&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.quarkslab.com/k7-antivirus-named-pipe-abuse-registry-manipulation-and-privilege-escalation.html&#34;&gt;K7 Antivirus Named Pipe Abuse &amp;#x2192; Registry Manipulation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]    Windows LPE   Part 1 (KR) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/logo_window.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h2&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694; &amp;#xBC8C;&amp;#xC368; 2025&amp;#xB144;&amp;#xC774; &amp;#xB05D;&amp;#xC774; &amp;#xB098;&amp;#xB124;&amp;#xC694;.. &amp;#xB2E4;&amp;#xB4E4; &amp;#xC5F0;&amp;#xB9D0; &amp;#xC798; &amp;#xC990;&amp;#xAE30;&amp;#xACE0; &amp;#xACC4;&amp;#xC2E0;&amp;#xAC00;&amp;#xC694;?&amp;#x1F385;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC9C4;&amp;#xD589;&amp;#xB41C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8;&amp;#xD587; &amp;#xC2A4;&amp;#xCFE8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC800;&amp;#xD76C; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4; &amp;#xC77C;&amp;#xBD80;&amp;#xAC00; &amp;#x2018;Windows Kernel Driver &amp;amp; Named Pipe LPE &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305;&amp;#x2019;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC81C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xB54C;&amp;#xB294; 2025&amp;#xB144; 5&amp;#xC6D4;.. &amp;#xBA58;&amp;#xD1A0;&amp;#xB2D8;&amp;#xC758; &amp;#x2018;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#x2019;&amp;#xB77C;&amp;#xB294; &amp;#xD55C;&amp;#xB9C8;&amp;#xB514;&amp;#xC5D0; &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xAC8C; &amp;#xB41C; banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC81C;&amp;#xAC00; part 1&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xD2B9;&amp;#xD788; Kernel Driver &amp;amp; Named Pipe &amp;#xBCA1;&amp;#xD130;&amp;#xB97C; &amp;#xC911;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xAFC0;&amp;#xD301;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC774;&amp;#xD6C4; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xB4E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD300;&amp;#xC6D0;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xB354;&amp;#xC6B1; &amp;#xC720;&amp;#xC775;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xB2F4;&amp;#xC544;&amp;#xC8FC;&amp;#xC2E4; &amp;#xC608;&amp;#xC815;&amp;#xC774;&amp;#xB2C8;, &amp;#xAF2D; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC2DC;&amp;#xAE30; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xBCF8; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Kernel Driver Named Pipe &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; LPE &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C;, &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h2 id=&#34;Chapter-1-Kernel-Driver-as-an-Attack-Surface&#34;&gt;&lt;a href=&#34;#Chapter-1-Kernel-Driver-as-an-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;Chapter 1: Kernel Driver as an Attack Surface&#34;&gt;&lt;/a&gt;Chapter 1: Kernel Driver as an Attack Surface&lt;/h2&gt;&lt;h3 id=&#34;1-1-Kernel-Driver-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#1-1-Kernel-Driver-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Kernel Driver &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;&lt;strong&gt;1.1 Kernel Driver &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Windows &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; LPE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC2E0;&amp;#xB8B0;&amp;#xBC94;&amp;#xC704; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD560; &amp;#xB54C; &amp;#xB9CE;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xB418;&amp;#xB294;&amp;#xB370;, &amp;#xC774; &amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC88B;&amp;#xC740; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. WDM &amp;#xAD6C;&amp;#xC870;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; IRP(&lt;code&gt;IRP_MJ_DEVICE_CONTROL&lt;/code&gt;)&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;IO_STACK_LOCATION&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IOCTL &amp;#xCF54;&amp;#xB4DC;&amp;#xC640; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC640; &amp;#xCD9C;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC758; &amp;#xAE38;&amp;#xC774; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xBC1B;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; IOCTL &amp;#xC804;&amp;#xB2EC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; IRP &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xAC01; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; WDM&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; I/O Manager&amp;#xAC00; &amp;#xCEE4;&amp;#xB110; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0; &amp;#xADF8; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &lt;code&gt;Irp-&amp;gt;AssociatedIrp.SystemBuffer&lt;/code&gt;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC785;&amp;#xB825;&amp;#xACFC; &amp;#xCD9C;&amp;#xB825; &amp;#xBAA8;&amp;#xB450; &amp;#xC774; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC624;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, &amp;#xC774;&amp;#xB7F0; IOCTL &amp;#xCC98;&amp;#xB9AC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xC11D;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; I/O Manager&amp;#xAC00; IRP&amp;#xB97C; &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xC785;&amp;#xB825;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC80;&amp;#xC99D;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD2B9;&amp;#xC131;&amp;#xC73C;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC218;&amp;#xC9D1;&amp;#xD558;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;1-2-Kernel-Driver-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;a href=&#34;#1-2-Kernel-Driver-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34; class=&#34;headerlink&#34; title=&#34;1.2 Kernel Driver &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;/a&gt;1.2 Kernel Driver &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xC81C;&amp;#xAC00; &amp;#xC124;&amp;#xCE58;&amp;#xD55C; &amp;#xC11C;&amp;#xB4DC;&amp;#xD30C;&amp;#xD2F0; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;? &amp;#xCCAB; &amp;#xB2E8;&amp;#xACC4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; FolderChangesView&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xB294; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xBA74;&amp;#xC11C;, &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; sys &amp;#xD30C;&amp;#xC77C; &amp;#xBA85;&amp;#xACFC; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; Path&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xD589; &amp;#xC911;&amp;#xC778; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C;, &amp;#xADF8; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; DriverView&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xB294;&amp;#xAC74; IOCTL, IRP &amp;#xCC98;&amp;#xB9AC; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xD234;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; FolderChangesView&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;.sys&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCD94;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0;&amp;#xC11C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC6A9; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB85C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xAC70;&amp;#xCCE4;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xCD9C;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xC6A9; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC798; &amp;#xC62E;&amp;#xACA8;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;1-3-Kernel-Driver-&amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;a href=&#34;#1-3-Kernel-Driver-&amp;#xBD84;&amp;#xC11D;&#34; class=&#34;headerlink&#34; title=&#34;1.3 Kernel Driver &amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;/a&gt;1.3 Kernel Driver &amp;#xBD84;&amp;#xC11D;&lt;/h3&gt;&lt;p&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB178;&amp;#xCD9C;&amp;#xB41C; &lt;code&gt;DeviceName&lt;/code&gt; &amp;#x2192; &amp;#xC720;&amp;#xC800; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80; &amp;#xD310;&amp;#xB2E8;&lt;/li&gt;
&lt;li&gt;WinObj&amp;#xB85C; &lt;code&gt;\Device&lt;/code&gt; &amp;#xB178;&amp;#xB4DC; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5; &amp;#xC5EC;&amp;#xBD80; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;IDA/Plugin &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBD84;&amp;#xC11D; &amp;#xC2DC;&amp;#xC791;&lt;/li&gt;
&lt;li&gt;IDA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; IOCTL Table &amp;#xC2DD;&amp;#xBCC4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;DispatchRoutine&lt;/code&gt; &amp;#xBD84;&amp;#xC11D; &amp;#x2192; &amp;#xC785;&amp;#xB825; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xBD84;/ &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;/ &amp;#xD544;&amp;#xB4DC; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD568;&amp;#xC218; &amp;#xD750;&amp;#xB984;&lt;code&gt;/Device&lt;/code&gt; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xACFC;&amp;#xC815; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; DriverEntry&amp;#xC5D0;&amp;#xC11C; Device, Symlink&amp;#xAC00; &amp;#xB178;&amp;#xCD9C;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xCC98;&amp;#xB7FC; Device Name&amp;#xC774; &lt;code&gt;\Device\PdFwKrnl&lt;/code&gt;, Symlink&amp;#xAC00; &lt;code&gt;\DosDevices\PdFwKrnl&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;CreateFile/DeviceControl&lt;/code&gt;&amp;#xB85C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0BC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xBBF8;&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;DriverObject-&amp;gt;MajorFunction&lt;/code&gt; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&lt;code&gt;IRP_MJ_DEVICE_CONTROL&lt;/code&gt;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xB8E8;&amp;#xD2F4;(&lt;code&gt;DispatchDeviceControl&lt;/code&gt;)&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;\Device&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC811;&amp;#xADFC; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC9C4;&amp;#xC785;&amp;#xC810;&amp;#xC744; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC00; &amp;#xB204;&amp;#xAD6C;&amp;#xD55C;&amp;#xD14C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. WinObj&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\Device&lt;/code&gt; &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; Device Object&amp;#xAC00; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, Symlink&amp;#xB3C4; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; Device&amp;#xC640; Symlink&amp;#xC758; Security &amp;#xD0ED;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; Everyone&amp;#xC778; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; Read Write &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xAF2D; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC5F4;&amp;#xB824;&amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB3C4; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xACE0; IOCTL &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; IDA&amp;#xC758; DriverBuddy&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC694; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC778;&amp;#xC9C0; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. DriverBuddy&amp;#xAC00; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110; API &amp;#xD638;&amp;#xCD9C; &amp;#xD754;&amp;#xC801;&amp;#xB4E4;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;, &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &lt;code&gt;MmMapIoSpace&lt;/code&gt;, &lt;code&gt;MmUnmapIoSpace&lt;/code&gt;, &lt;code&gt;MmBuildMdlForNonPagedPool&lt;/code&gt;, &lt;code&gt;MmMapLockedPages&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD638;&amp;#xCD9C; &amp;#xC9C0;&amp;#xC810;&amp;#xB4E4;&amp;#xC774; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xADFC;&amp;#xCC98;&amp;#xC5D0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &lt;code&gt;MmMapIoSpace&lt;/code&gt;&amp;#xAC19;&amp;#xC740; &amp;#xBB3C;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xAC00;&amp;#xC0C1; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;, &amp;#xC989; &amp;#xBB3C;&amp;#xB9AC;&amp;#xC8FC;&amp;#xC18C;, &amp;#xAE38;&amp;#xC774;, &amp;#xCE90;&amp;#xC2DC; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xBA74; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xC800;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xAC78; &amp;#xBD84;&amp;#xC11D; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; switch-case&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; IOCTL &amp;#xBD84;&amp;#xAE30; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xC5ED;&amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xB2E8;&amp;#xACC4;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; WDM &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;DispatchDeviceControl&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80; switch-case&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; IOCTL Cases&amp;#xB4E4;&amp;#xC774; &lt;code&gt;0x80002000&lt;/code&gt;, &lt;code&gt;0x80002004&lt;/code&gt;, &lt;code&gt;0x8000201C&lt;/code&gt;&amp;#x2026; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xBD84;&amp;#xAE30;&amp;#xB97C; &amp;#xD0C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;MmMapIoSpace&lt;/code&gt; &amp;#xD638;&amp;#xCD9C;&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; IOCTL Case&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xB4E4;&amp;#xC744; &amp;#xD589;&amp;#xC704; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xB958;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC635;&amp;#xC158; &amp;#xAC12;, &amp;#xAE38;&amp;#xC774;, &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xCC98;&amp;#xB9AC;&amp;#xAC19;&amp;#xC740; &amp;#xC785;&amp;#xB825; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD575;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF8; &amp;#xC9C0;&amp;#xC810;&amp;#xC740; &lt;code&gt;0x8000202C&lt;/code&gt; Case&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xCF00;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; IRP &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xAC12;&amp;#xC744; &lt;code&gt;dst&lt;/code&gt;/&lt;code&gt;src&lt;/code&gt;/&lt;code&gt;size&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xD574;&amp;#xC11D;&amp;#xD574; &amp;#xCD94;&amp;#xCD9C;&amp;#xD574;&amp;#xC11C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xB370;&amp;#xC694;. WDM &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xBA74; &lt;code&gt;DeviceIoControl&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C; IOCTL&amp;#xC774; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xB77C;&amp;#xBA74; I/O Manager&amp;#xC740; &lt;code&gt;IRP&amp;#x2192;AssociatedIrp.SystemBuffer&lt;/code&gt;&amp;#xC5D0; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xB123;&amp;#xACE0;, &amp;#xADF8; &amp;#xBC84;&amp;#xD37C; &amp;#xC548;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xC720;&amp;#xC800; &amp;#xC778;&amp;#xD48B;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xC11C; &amp;#xCC44;&amp;#xC6C1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;0x8000202C&lt;/code&gt; Case&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C; &amp;#xAE38;&amp;#xC774; &lt;code&gt;0x38&lt;/code&gt;&amp;#xB9CC; &amp;#xB9DE;&amp;#xC73C;&amp;#xBA74;, &amp;#xADF8; &amp;#xBC84;&amp;#xD37C; &amp;#xC548;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;(+&lt;code&gt;0x20&lt;/code&gt;/+&lt;code&gt;0x28&lt;/code&gt;/+&lt;code&gt;0x30&lt;/code&gt;)&amp;#xC5D0;&amp;#xC11C; &amp;#xAEBC;&amp;#xB0B8; &amp;#xAC12;&amp;#xC744; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;/&amp;#xAE38;&amp;#xC774;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB7F0; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; read/ write primitive&amp;#xAC00; &amp;#xC131;&amp;#xB9BD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; WinDBG&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBCF4;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &lt;code&gt;0x8000202C&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SystemBuffer(rsi)+0x20/0x28/0x30&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xC5D0; &amp;#xB123;&amp;#xB294;&amp;#xB2E4;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB294;&amp;#xB370;, payload&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;rsi&lt;/code&gt;&amp;#xAC00; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &lt;code&gt;METHOD_BUFFERED&lt;/code&gt;&amp;#xC758; &lt;code&gt;SystemBuffer&lt;/code&gt; &amp;#xC8FC;&amp;#xBCC0;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C;&amp;#xB300;&amp;#xB85C;  &amp;#x2018;&lt;code&gt;A&lt;/code&gt;&amp;#x2019;&amp;#xB85C; &amp;#xB36E;&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; exploit&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC704;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; IOCTL &amp;#xC785;&amp;#xB825; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB2E4; &lt;code&gt;dst=output_buf&lt;/code&gt;(&amp;#xC720;&amp;#xC800; &amp;#xC8FC;&amp;#xC18C;), &lt;code&gt;src=&amp;#xC77D;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&lt;/code&gt;, &lt;code&gt;size=8&lt;/code&gt;&amp;#xC744; &amp;#xB123;&amp;#xC5B4; &lt;code&gt;DeviceIoControl&lt;/code&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &lt;code&gt;memmove(dst, src, size)&lt;/code&gt;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; 8&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xB2E8;&amp;#xC704; Arbitrary Read&amp;#xAC00; &amp;#xC131;&amp;#xB9BD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC708;&amp;#xB3C4;&amp;#xC6B0; &amp;#xBC84;&amp;#xADF8; &amp;#xCC3E;&amp;#xB294; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC775;&amp;#xC219;&amp;#xD55C; &amp;#xCE5C;&amp;#xAD6C;&amp;#xC778; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xD578;&amp;#xB4E4; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC5BB;&amp;#xACE0;, &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC5BB;&amp;#xC740; SYSTEM EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; TOKENOFFSET&amp;#xC744; &amp;#xB354;&amp;#xD574; &lt;code&gt;EPROCESS-&amp;gt;Token&lt;/code&gt; &amp;#xAC12;&amp;#xC744; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628; &amp;#xD6C4;, &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD604;&amp;#xC7AC; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD574; Token &amp;#xD544;&amp;#xB4DC; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xACC4;&amp;#xC0B0;&amp;#xD55C; &amp;#xB4A4;, IOCTL&amp;#xC5D0; &lt;code&gt;dst=&amp;#xD604;&amp;#xC7AC; EPROCESS+TOKENOFFSET&lt;/code&gt;, &lt;code&gt;src=&amp;#xC900;&amp;#xBE44;&amp;#xD55C; SYSTEM &amp;#xD1A0;&amp;#xD070; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/code&gt;, &lt;code&gt;size=8&lt;/code&gt; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; Arbitrary Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD574; Privilege escalation&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xC2DC;&amp;#xCF30;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xB4EF; &amp;#xC138;&amp;#xBD80; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC; &amp;#xAD6C;&amp;#xC131;&amp;#xC740; &amp;#xB098;&amp;#xD0C0;&amp;#xB09C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC720;&amp;#xD615;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAD6C;&amp;#xC131;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;   &lt;/p&gt;
&lt;h2 id=&#34;Chapter-2-Named-Pipe-as-an-Attack-Surface&#34;&gt;&lt;a href=&#34;#Chapter-2-Named-Pipe-as-an-Attack-Surface&#34; class=&#34;headerlink&#34; title=&#34;Chapter 2: Named Pipe as an Attack Surface&#34;&gt;&lt;/a&gt;Chapter 2: Named Pipe as an Attack Surface&lt;/h2&gt;&lt;h3 id=&#34;2-1-Named-Pipe-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;a href=&#34;#2-1-Named-Pipe-&amp;#xACF5;&amp;#xACA9;-&amp;#xD45C;&amp;#xBA74;-&amp;#xAC1C;&amp;#xC694;&#34; class=&#34;headerlink&#34; title=&#34;2.1 Named Pipe &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&#34;&gt;&lt;/a&gt;2.1 Named Pipe &amp;#xACF5;&amp;#xACA9; &amp;#xD45C;&amp;#xBA74; &amp;#xAC1C;&amp;#xC694;&lt;/h3&gt;&lt;p&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; Named Pipe&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC; &amp;#xCC28;&amp;#xB840;&amp;#xC778;&amp;#xB370;&amp;#xC694;. Named Pipe &amp;#xD1B5;&amp;#xC2E0; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC57D;&amp;#xAC04;&amp;#xC758; &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xC804;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774; &lt;a href=&#34;https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/&#34;&gt;&amp;#x1F449;&amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8;&lt;/a&gt; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC624;&amp;#xC2DC;&amp;#xB294;&amp;#xAC78; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;! Named Pipe&amp;#xB294; IPC &amp;#xD1B5;&amp;#xC2E0; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xCEE4;&amp;#xB110; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB85C; &amp;#xAD00;&amp;#xB9AC;&amp;#xB418;&amp;#xACE0; &amp;#xCEE4;&amp;#xB110; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; SYSTEM &amp;#xAD8C;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBE48;&amp;#xBC88;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xD788; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; Named Pipe &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B8; &amp;#xB4A4;&amp;#xC5D0; &amp;#xC774;&amp;#xAC78; &amp;#xB0B4;&amp;#xBD80; &amp;#xBA54;&amp;#xC138;&amp;#xC9C0;&amp;#xB85C; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD558;&amp;#xACE0; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB85C; &amp;#xD30C;&amp;#xC2F1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAD8C;&amp;#xD55C; &amp;#xBCC0;&amp;#xACBD;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xB3D9;&amp;#xC791;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC2E4;&amp;#xD589;&amp;#xAC19;&amp;#xC740; &amp;#xBBFC;&amp;#xAC10; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xC6B0;&amp;#xAC00; &amp;#xAF64; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xBD80;&amp;#xC871;&amp;#xD558;&amp;#xBA74; LPE&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IPC&amp;#xB294; IOCTL&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC811;&amp;#xADFC;&amp;#xD574;&amp;#xBD10;&amp;#xC57C; &amp;#xD560;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2DC;&amp;#xC8E0;? &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;2-2-Named-Pipe-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;a href=&#34;#2-2-Named-Pipe-&amp;#xD0C0;&amp;#xAC9F;-&amp;#xC218;&amp;#xC9D1;&#34; class=&#34;headerlink&#34; title=&#34;2.2 Named Pipe &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&#34;&gt;&lt;/a&gt;2.2 Named Pipe &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&lt;/h3&gt;&lt;p&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1;&amp;#xC740; &amp;#xBA3C;&amp;#xC800; (1) SYSTEM/&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB97C; &amp;#xACE0;&amp;#xB9AC;&amp;#xACE0;, (2) &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xD578;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;, (3) &amp;#xD30C;&amp;#xC774;&amp;#xD504; ACL&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Everyone &amp;#xAC19;&amp;#xC740; &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xAC00; Read Write &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB294; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; Process Explorer&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4;&amp;#xB97C; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC81C;&amp;#xAC00; &amp;#xC7A1;&amp;#xB294; &amp;#xAE30;&amp;#xC900;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACC4;&amp;#xC815;&amp;#xC774; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0;, &amp;#xC11C;&amp;#xB4DC;&amp;#xD30C;&amp;#xD2F0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778;&amp;#xC9C0;, HANDLE&amp;#xC5D0; Named Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;, Integrity Level&amp;#xC774; SYSTEM&amp;#xC778;&amp;#xC9C0; &amp;#xC815;&amp;#xB3C4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC881;&amp;#xD600;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; Process Explorer &amp;#xD558;&amp;#xB2E8;&amp;#xC758; Handles &amp;#xD0ED;&amp;#xC5D0;&amp;#xC11C; NamedPipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB54C; Type&amp;#xC774; &lt;code&gt;File&lt;/code&gt;&amp;#xB85C; &amp;#xC7A1;&amp;#xD788;&amp;#xBA74;&amp;#xC11C; Name&amp;#xC774; &lt;code&gt;\Device\NamedPipe\&amp;#x2026;&lt;/code&gt; &amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xD56D;&amp;#xBAA9;&amp;#xC774; Named Pipe&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xB41C; &lt;code&gt;\Device\NamedPipe\&amp;#x2026;&lt;/code&gt;&amp;#xACBD;&amp;#xB85C;&amp;#xB294; &amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\.\pipe\&amp;#x2026;&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xAD00;&amp;#xBB38;&amp;#xC774; &amp;#xD558;&amp;#xB098; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;.. &amp;#xBC14;&amp;#xB85C; ACL&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD798;&amp;#xB4E4;&amp;#xAC8C; Named Pipe&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC774;&amp;#xAC78; &amp;#xC77D;&amp;#xACE0; &amp;#xC4F8; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74;&amp;#x2026; &amp;#xADF8; Named Pipe&amp;#xC640;&amp;#xB294; &amp;#xC791;&amp;#xBCC4;&amp;#xC778;&amp;#xC0AC;&amp;#xB97C; &amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&amp;#x1F62D;  Administrators&amp;#xB9CC; RW&amp;#xC774;&amp;#xACE0; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xC5D0;&amp;#xAC90; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; LPE&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xBCA1;&amp;#xD130;&amp;#xB85C; &amp;#xBCF4;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xACE0;, Everyone, Authenticated Users, Users &amp;#xAC19;&amp;#xC740; &amp;#xAD11;&amp;#xBC94;&amp;#xC704;&amp;#xD55C; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; RW&amp;#xAC00; &amp;#xC5F4;&amp;#xB824; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; accesschk&amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; ACL&amp;#xC744; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC881;&amp;#xD600;&amp;#xB098;&amp;#xAC00;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD588;&amp;#xB2E4;&amp;#xBA74;, &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;CreateNamedPipeA/W&lt;/code&gt;, &lt;code&gt;ConnectNamedPipe&lt;/code&gt;, &lt;code&gt;DisconnectNamedPipe&lt;/code&gt; &amp;#xAC19;&amp;#xC740; API&amp;#xB4E4;&amp;#xC744; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xAC80;&amp;#xC0C9;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xAC8C; &amp;#xC11C;&amp;#xBC84; &amp;#xAD6C;&amp;#xD604;&amp;#xC774; &amp;#xB9DE;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;Connect &amp;#x2192; Read&lt;/code&gt; &amp;#xD750;&amp;#xB984;, &amp;#xD30C;&amp;#xC2F1; &amp;#xBD84;&amp;#xAE30;, &amp;#xD1A0;&amp;#xD070;/&amp;#xC811;&amp;#xADFC; &amp;#xC81C;&amp;#xC5B4;&amp;#xAC19;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xAD00;&amp;#xB828; &amp;#xBD84;&amp;#xAE30;&amp;#xB4E4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC218;&amp;#xC9D1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xB05D;&amp;#xC774; &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h3 id=&#34;2-3-Named-Pipe-&amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;a href=&#34;#2-3-Named-Pipe-&amp;#xBD84;&amp;#xC11D;&#34; class=&#34;headerlink&#34; title=&#34;2.3 Named Pipe &amp;#xBD84;&amp;#xC11D;&#34;&gt;&lt;/a&gt;2.3 Named Pipe &amp;#xBD84;&amp;#xC11D;&lt;/h3&gt;&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Process Explorer&amp;#xB85C; &amp;#xC11C;&amp;#xBC84;(SYSTEM &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;) &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xD6C4;&amp;#xBCF4; &amp;#xC120;&amp;#xC815;&lt;/li&gt;
&lt;li&gt;&amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &lt;code&gt;\Device\NamedPipe\...&lt;/code&gt;&amp;#xAC00; &amp;#xC720;&amp;#xC800; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;\\.\pipe\...&lt;/code&gt;&amp;#xB85C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;accesschk&amp;#xB85C; Pipe ACL &amp;#xC810;&amp;#xAC80; &amp;#x2192; Everyone&amp;#xAC19;&amp;#xC740; &amp;#xAD11;&amp;#xBC94;&amp;#xC704; &amp;#xADF8;&amp;#xB8F9; Read/Write &amp;#xC5F4;&amp;#xB9BC; &amp;#xC5EC;&amp;#xBD80; &amp;#xD655;&amp;#xC778;&lt;/li&gt;
&lt;li&gt;IDA&amp;#xB85C; &lt;code&gt;CreateNamedPipe*&lt;/code&gt; &amp;#x2192; &lt;code&gt;ConnectNamedPipe&lt;/code&gt; &amp;#x2192; &lt;code&gt;ReadFile/WriteFile&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD750;&amp;#xB984;&amp;#xACFC; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xD568;&amp;#xC218; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58; &amp;#xC7A1;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&amp;#xC5B4;&amp;#xB5A4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;/HKLM, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC124;&amp;#xC815; &amp;#xB4F1; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xC881;&amp;#xD788;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;ProcMon &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &amp;#xB3D9;&amp;#xC801;&amp;#xBD84;&amp;#xC11D; &amp;#xC218;&amp;#xD589;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xAC9F;&amp;#xC744; &amp;#xC815;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; procmon&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xD504; I/O&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD589;&amp;#xC704;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC640; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC1A1;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC881;&amp;#xD78C; &amp;#xD6C4;&amp;#xC5D0;, &lt;code&gt;CreateNamedPipe&lt;/code&gt;, &lt;code&gt;CreateFile&lt;/code&gt;, &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xAC19;&amp;#xC740; IPC &amp;#xD638;&amp;#xCD9C; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBC94;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xC900;&amp;#xBE44;&amp;#xB97C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xB85C; &lt;code&gt;Process Name&lt;/code&gt;, &lt;code&gt;Operation&lt;/code&gt;&amp;#xC5D0; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB098; named pipe &amp;#xD575;&amp;#xC2EC; I/O &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; Filter&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xACE0;, &amp;#xC11C;&amp;#xBC84; Integrity&amp;#xAC00; System&amp;#xC778;&amp;#xC9C0; &amp;#xD544;&amp;#xD130;&amp;#xB85C; &amp;#xACE0;&amp;#xC815;&amp;#xD574;&amp;#xB450;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xC720;&amp;#xC800; &amp;#xC785;&amp;#xB825;&amp;#xC774; SYSTEM&amp;#xC73C;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xCE68; &amp;#xC81C;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC124;&amp;#xC815;&amp;#xC5D0; Non Admin&amp;#xB3C4; Access Control&amp;#xB85C; &amp;#xC77C;&amp;#xBD80; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC774; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xAC00; &amp;#xC788;&amp;#xB124;&amp;#xC694;.. &amp;#xC548;&amp;#xD2F0;&amp;#xBC14;&amp;#xC774;&amp;#xB7EC;&amp;#xC2A4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xADF8;&amp;#xB7F4;&amp;#xB9CC;&amp;#xB3C4; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xBCF4;&amp;#xD1B5; &amp;#xC774;&amp;#xB807;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xB294;&amp;#xB370; &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815; &amp;#xBCC0;&amp;#xACBD;/ &amp;#xBCF4;&amp;#xD638; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654; &amp;#xD5C8;&amp;#xC6A9; &amp;#xCCB4;&amp;#xD06C;&amp;#xBC15;&amp;#xC2A4;&amp;#xB97C; &amp;#xACC4;&amp;#xC18D; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xBD10;&amp;#xB3C4; UAC&amp;#xAC00; &amp;#xC804;&amp;#xD600; &amp;#xB728;&amp;#xC9C0; &amp;#xC54A;&amp;#xB124;&amp;#xC694;?? &amp;#xBB54;&amp;#xAC00; &amp;#xC218;&amp;#xC0C1;&amp;#xD558;&amp;#xC8E0;? &amp;#xBC14;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xC6B0;&amp;#xC120; &amp;#xC21C;&amp;#xC704;&amp;#xB85C; &amp;#xC758;&amp;#xC2EC;&amp;#xD574;&amp;#xC11C; &amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PS C:\Users\banda\Downloads\AccessChk&amp;gt; .\accesschk.exe -accepteula -lv &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;\pipe\K7TSMngrService1&amp;quot;&lt;/span&gt;

\\.\Pipe\K7TSMngrService1
  DESCRIPTOR FLAGS:
      [SE_DACL_PRESENT]
      [SE_SACL_PRESENT]
      [SE_SACL_AUTO_INHERITED]
      [SE_SELF_RELATIVE]
  OWNER: NT AUTHORITY\SYSTEM
  LABEL: Low Mandatory Level
        SYSTEM_MANDATORY_LABEL_NO_WRITE_UP
  [&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;] ACCESS_ALLOWED_ACE_TYPE: NT AUTHORITY\SYSTEM
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL
  [&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] ACCESS_ALLOWED_ACE_TYPE: Everyone
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;ACL&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt; &amp;#xCABD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC758;&amp;#xC2EC;&amp;#xACFC; &amp;#xB9DE;&amp;#xAC8C; DACL&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB110;&amp;#xB110;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. Everyone&amp;#xC5D0; &lt;code&gt;file read&lt;/code&gt;, &lt;code&gt;file write&lt;/code&gt;, &lt;code&gt;file append&lt;/code&gt;&amp;#xAC19;&amp;#xC740;&amp;#xAC8C; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC0AC;&amp;#xC2E4;&amp;#xC0C1; &amp;#xB204;&amp;#xAD6C;&amp;#xB098; &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD574; write&amp;#xD558;&amp;#xACE0; read&amp;#xD558;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC18C;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC774; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58;&amp;#xB098; &amp;#xD30C;&amp;#xC2F1; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xC9C0; &amp;#xB450; &amp;#xB208;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Named Pipe&amp;#xC758; &amp;#xC11C;&amp;#xBC84; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC0DD;&amp;#xC131; &amp;#xC2DC;&amp;#xC810;&amp;#xBD80;&amp;#xD130; &amp;#xD070; &amp;#xACE8;&amp;#xACA9;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC740;&amp;#xB370;, &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;CreateNamedPipeA(&amp;quot;\\\\.\\pipe\\K7TSMngrService1&amp;quot;, ...)&lt;/code&gt;&amp;#xB85C; Named Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;ConnectNamedPipe&lt;/code&gt;&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; &amp;#xC694;&amp;#xCCAD; &amp;#xCC98;&amp;#xB9AC; &amp;#xD578;&amp;#xB4E4;&amp;#xB7EC; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774;&amp;#xB7F0; &amp;#xD328;&amp;#xD134;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xB2E8;&amp;#xACC4;&amp;#xB294; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD5E4;&amp;#xB354;&amp;#xB97C; &amp;#xC77D;&amp;#xB294;&amp;#xC9C0; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xAC80;&amp;#xC99D; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image21.png&#34; alt&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// request header (28 bytes)&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; _&lt;span class=&#34;hljs-title&#34;&gt;K7TS_REQ_HDR&lt;/span&gt; {&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; magic;      &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;apos;K7TS&amp;apos;&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; ver;        &lt;span class=&#34;hljs-comment&#34;&gt;// 0x1010&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; hdr_sz;     &lt;span class=&#34;hljs-comment&#34;&gt;// 28&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; reserved;   &lt;span class=&#34;hljs-comment&#34;&gt;// 0&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; op;         &lt;span class=&#34;hljs-comment&#34;&gt;// v21&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; in_len;     &lt;span class=&#34;hljs-comment&#34;&gt;// nNumberOfBytesToRead&lt;/span&gt;
  &lt;span class=&#34;hljs-keyword&#34;&gt;uint32_t&lt;/span&gt; out_len;    &lt;span class=&#34;hljs-comment&#34;&gt;// v23&lt;/span&gt;
} K7TS_REQ_HDR;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB824;&amp;#xBA74;, &amp;#xC694;&amp;#xCCAD; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xAD6C;&amp;#xC131;&amp;#xD574;&amp;#xC57C;&amp;#xC9C0; &amp;#xC5F0;&amp;#xACB0;&amp;#xC5D0; &amp;#xC131;&amp;#xACF5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB72F;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xB300;&amp;#xC0C1; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xB97C; &amp;#xC7A1;&amp;#xC73C;&amp;#xBA74;&amp;#xC11C; &lt;code&gt;result = 0x4B375453(&amp;apos;K7TS&amp;apos;)&lt;/code&gt;, &lt;code&gt;ver=0x1010&lt;/code&gt;, &lt;code&gt;hdr_sz=28&lt;/code&gt;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD; &amp;#xD0C0;&amp;#xC785;&amp;#xACFC; &amp;#xC785;&amp;#xCD9C;&amp;#xB825; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &lt;code&gt;1mb&lt;/code&gt;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD55C; &amp;#xB4A4;&amp;#xC5D0;&amp;#xB9CC; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0; heap &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD574; &lt;code&gt;ReadFile&lt;/code&gt;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC218;&amp;#xC2E0;&amp;#xD558;&amp;#xACE0;, &amp;#xB0B4;&amp;#xBD80; &amp;#xB514;&amp;#xC2A4;&amp;#xD328;&amp;#xCC98;&amp;#xB85C; &amp;#xB118;&amp;#xACA8; &amp;#xC751;&amp;#xB2F5;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; 36&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xC751;&amp;#xB2F5;&amp;#xD5E4;&amp;#xB354; + &amp;#xC751;&amp;#xB2F5; &amp;#xBC14;&amp;#xB514;&amp;#xB97C; &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xB85C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACE0; &lt;code&gt;DisconnectNamedPipe&lt;/code&gt;, &lt;code&gt;CloseHandle&lt;/code&gt;&amp;#xB85C; &amp;#xC138;&amp;#xC158;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xAC80;&amp;#xC99D; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD30C;&amp;#xC774;&amp;#xD504;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC54C;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC80;&amp;#xC99D; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xC544;&amp;#xAE4C; &amp;#xC124;&amp;#xC815; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD24;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xAD00;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xCC38;&amp;#xC870;&amp;#xB97C; &amp;#xB530;&amp;#xB77C;&amp;#xAC00;&amp;#xBA74; &lt;code&gt;AdminNonAdminIsValid&lt;/code&gt;, &lt;code&gt;AdminChangesNeedPassword&lt;/code&gt;, &lt;code&gt;AdminEnableNeedVerification&lt;/code&gt; &amp;#xC774;&amp;#xB7F0; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB4E4;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &lt;code&gt;K7TS&lt;/code&gt; &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xAC00; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xAE30;&amp;#xBC18; &amp;#xC815;&amp;#xCC45; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD; &amp;#xD558;&amp;#xB098;&amp;#xB85C; SYSTEM &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &lt;code&gt;HKLM&lt;/code&gt;&amp;#xC5D0; Write&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xCDA9;&amp;#xBD84;&amp;#xD788; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xC800;&amp;#xD76C;&amp;#xAC19;&amp;#xC740; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; SYSTEM &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; Write&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; primitive&amp;#xAC00; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC798; &amp;#xBCF4;&amp;#xB0B4;&amp;#xBCF4;&amp;#xACE0; Process Monitor &amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;. Named Pipe&amp;#xB294; &amp;#xC77C;&amp;#xB2E8; IPC &amp;#xC5D4;&amp;#xB4DC;&amp;#xD3EC;&amp;#xC778;&amp;#xD2B8;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;/&lt;code&gt;HKLM&lt;/code&gt;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC124;&amp;#xC815;, &amp;#xD30C;&amp;#xC77C; &amp;#xC77D;&amp;#xAE30;/&amp;#xC4F0;&amp;#xAE30;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC2E4;&amp;#xD589;&amp;#xAC19;&amp;#xC740; &amp;#xBC14;&amp;#xB00C;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC744; &amp;#xC911;&amp;#xC2EC;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC798; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC88B;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C;&amp;#xB4E4;&amp;#xBA74; &amp;#xC9C0;&amp;#xAE08; ProcMon &amp;#xB85C;&amp;#xADF8;&amp;#xB294; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC778; &amp;#xC81C;&amp;#xAC00; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC900; &amp;#xD6C4;&amp;#xC5D0;, SYSTEM &amp;#xAD8C;&amp;#xD55C; &lt;code&gt;K7TSMngr.exe&lt;/code&gt;&amp;#xAC00; &lt;code&gt;HKLM&lt;/code&gt;&amp;#xC5D0; &amp;#xC4F0;&amp;#xAE30; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xD2B9;&amp;#xD788; &amp;#xAD00;&amp;#xB828; &amp;#xD0A4;&amp;#xC778; &lt;code&gt;AdminNonAdminIsValid&lt;/code&gt;, &lt;code&gt;AdminChangesNeedPassword&lt;/code&gt;, &lt;code&gt;AdminChangesPasswordHash&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; write&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xBCF4;&amp;#xBA74; &amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xAD8C;&amp;#xD55C; &amp;#xC694;&amp;#xAD6C;, &amp;#xBE44;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790; &amp;#xD5C8;&amp;#xC6A9;&amp;#xAC19;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xACBD;&amp;#xACC4;&amp;#xAC00; &amp;#xD480;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD55C;&amp;#xBC88; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; LPE&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC77C;&amp;#xB2E8;&amp;#xC740; &amp;#xC77C;&amp;#xBC18; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB85C; &lt;code&gt;\\.\pipe\K7TSMngrService1&lt;/code&gt;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC11C; &lt;code&gt;K7TS&lt;/code&gt; &amp;#xD5E4;&amp;#xB354;&amp;#xC640; &amp;#xB9E4;&amp;#xC9C1; &amp;#xD615;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4; SYSTEM&amp;#xC774; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xC124;&amp;#xC815; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xB4A4;&amp;#xC5D0;, &lt;code&gt;HKLM&lt;/code&gt; IFEO&amp;#xB97C; &amp;#xC368;&amp;#xC11C; &lt;code&gt;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\K7TSHlpr.exe&lt;/code&gt; &amp;#xC774; &amp;#xD0A4;&amp;#xB97C; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xB85C; &amp;#xB744;&amp;#xC6B8;&amp;#xB824;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xAC78; &lt;code&gt;cmd.exe /c C:\temp\payload.bat&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xCE58;&amp;#xAE30;&amp;#xD558;&amp;#xBA74;..? LPE&amp;#xAC00; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &lt;code&gt;K7TSMngrService1&lt;/code&gt; &amp;#xD30C;&amp;#xC774;&amp;#xD504; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xCCB4;&amp;#xB294; &lt;code&gt;K7TSMngr.exe&lt;/code&gt;&amp;#xC600;&amp;#xB294;&amp;#xB370;, &amp;#xC774;&amp;#xB54C; &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xB0B4;&amp;#xBD80; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &lt;code&gt;K7TSHlpr.exe&lt;/code&gt; &amp;#xBCF4;&amp;#xC870; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xB192;&amp;#xC740; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xACE0;, &amp;#xC774;&amp;#xAC78; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; bat &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.   &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/12/28/banda/WHS3-bughunting/ko/image25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Local Group Memberships&amp;#xC5D0;&amp;#xC11C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; Administrators&amp;#xAC00; &amp;#xB41C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD94;&amp;#xAC00;&amp;#xB85C; &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; Named Pipe&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC8FC;&amp;#xB85C; ACL, &amp;#xAD8C;&amp;#xD55C; &amp;#xAC80;&amp;#xC0AC; &amp;#xBD80;&amp;#xC7AC;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xACBD;&amp;#xB85C; &amp;#xC870;&amp;#xC791;, &amp;#xB808;&amp;#xC774;&amp;#xC2A4;&amp;#xCEE8;&amp;#xB514;&amp;#xC158;&amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB2C8;.. &amp;#xB9CE;&amp;#xC740; &amp;#xCC38;&amp;#xACE0;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;br&gt;&lt;br&gt;  &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&lt;/h2&gt;&lt;p&gt;&amp;#xD638;&amp;#xD638;&amp;#xD638;&amp;#x2026;&amp;#x1F98C;&amp;#xC774;&amp;#xBC88; &amp;#xAE00;&amp;#xC774; &amp;#xC88B;&amp;#xC740; &amp;#xC5F0;&amp;#xB9D0; &amp;#xC120;&amp;#xBB3C;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xAE30;&amp;#xB97C; &amp;#xBC14;&amp;#xB78D;&amp;#xB2C8;&amp;#xB2E4;! Kernel Driver, Named Pipe &amp;#xC218;&amp;#xC9D1;&amp;#xACFC; &amp;#xBD84;&amp;#xC11D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC5D0;&amp;#xAC8C; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA74; &amp;#xC88B;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xB54C; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xB294; &amp;#xC608;&amp;#xC804; cve&amp;#xB4E4;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC80;&amp;#xC99D;&amp;#xC740; Win11 24H2 &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xC810;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;. &amp;#xD2F0;&amp;#xC5E0;&amp;#xC544;&amp;#xC774;&amp;#xC778;&amp;#xB370; &amp;#xC0AC;&amp;#xC2E4; &amp;#xAE00;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD234;&amp;#xB4E4;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC774; &amp;#xB9C9; &amp;#xB208;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &amp;#xACC4;&amp;#xC18D; &amp;#xB534; &amp;#xAE38;&amp;#xB85C; &amp;#xC0DC;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xD558;&amp;#xD56B;  &amp;#xB2E4;&amp;#xC74C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xCC3E;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xB4E4;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xAC10;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://voidsec.com/windows-drivers-reverse-engineering-methodology/&#34;&gt;Windows Driver RE Methodology (voidsec)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.amd.com/en/resources/product-security/bulletin/amd-sb-6009.html&#34;&gt;AMD-SB-6009: Radeon Graphics Kernel Driver Privilege Management&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://owasp.org/www-chapter-seoul/#div-pastevents&#34;&gt;OWASP Seoul(2025.07) - Windows 3rd-Party Driver LPE BugHunting&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://blog.quarkslab.com/k7-antivirus-named-pipe-abuse-registry-manipulation-and-privilege-escalation.html&#34;&gt;K7 Antivirus Named Pipe Abuse &amp;#x2192; Registry Manipulation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/12/28/banda/WHS3-bughunting/ko/logo_window.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/12/28/banda/whs3-bughunting/ko/">

  <title>[Research]    Windows LPE   Part 1 (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-12-28 17:00" pubdate>
      2025 12 28 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      5.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      102
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]    Windows LPE   Part 1 (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><img src="/2025/12/28/banda/WHS3-bughunting/ko/logo_window.png" srcset="/img/loading.gif" alt></p>
<h2 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694; &#xBC8C;&#xC368; 2025&#xB144;&#xC774; &#xB05D;&#xC774; &#xB098;&#xB124;&#xC694;.. &#xB2E4;&#xB4E4; &#xC5F0;&#xB9D0; &#xC798; &#xC990;&#xAE30;&#xACE0; &#xACC4;&#xC2E0;&#xAC00;&#xC694;?&#x1F385;&#xC774;&#xBC88;&#xC5D0; &#xC9C4;&#xD589;&#xB41C; &#xD654;&#xC774;&#xD2B8;&#xD587; &#xC2A4;&#xCFE8;&#xC5D0;&#xC11C; &#xC800;&#xD76C; &#xD300;&#xC6D0;&#xBD84;&#xB4E4; &#xC77C;&#xBD80;&#xAC00; &#x2018;Windows Kernel Driver &amp; Named Pipe LPE &#xBC84;&#xADF8;&#xD5CC;&#xD305;&#x2019;&#xC774;&#xB77C;&#xB294; &#xC8FC;&#xC81C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xB294;&#xB370;&#xC694;. &#xB54C;&#xB294; 2025&#xB144; 5&#xC6D4;.. &#xBA58;&#xD1A0;&#xB2D8;&#xC758; &#x2018;&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB4E4;&#xC5B4;&#xC640;&#x2019;&#xB77C;&#xB294; &#xD55C;&#xB9C8;&#xB514;&#xC5D0; &#xC708;&#xB3C4;&#xC6B0; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAC8C; &#xB41C; banda&#xC785;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image1.png" srcset="/img/loading.gif" alt></p>
<p>&#xC624;&#xB298;&#xC740; &#xC81C;&#xAC00; part 1&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74;&#xC11C;, &#xD2B9;&#xD788; Kernel Driver &amp; Named Pipe &#xBCA1;&#xD130;&#xB97C; &#xC911;&#xC810;&#xC73C;&#xB85C; &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xAFC0;&#xD301;&#xC744; &#xC804;&#xB2EC;&#xD574;&#xB4DC;&#xB9AC;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xCD94;&#xAC00;&#xB85C; &#xC774;&#xD6C4; &#xC2DC;&#xB9AC;&#xC988;&#xB4E4;&#xC5D0;&#xC11C; &#xD300;&#xC6D0;&#xBD84;&#xB4E4;&#xC774; &#xB354;&#xC6B1; &#xC720;&#xC775;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xB2F4;&#xC544;&#xC8FC;&#xC2E4; &#xC608;&#xC815;&#xC774;&#xB2C8;, &#xAF2D; &#xC77D;&#xC5B4;&#xC8FC;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;! &#xBCF8; &#xC2DC;&#xB9AC;&#xC988;&#xC5D0;&#xC11C;&#xB294; Kernel Driver Named Pipe &#xB450; &#xAC00;&#xC9C0; &#xC694;&#xC18C;&#xB97C; &#xAC01;&#xAC01; &#xB3C5;&#xB9BD;&#xC801;&#xC778; LPE &#xACF5;&#xACA9; &#xD45C;&#xBA74;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;&#xC11C;, &#xC800;&#xD76C;&#xAC00; &#xCC3E;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xC18C;&#xAC1C;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.<br><br>  </p>
<h2 id="Chapter-1-Kernel-Driver-as-an-Attack-Surface"><a href="#Chapter-1-Kernel-Driver-as-an-Attack-Surface" class="headerlink" title="Chapter 1: Kernel Driver as an Attack Surface"></a>Chapter 1: Kernel Driver as an Attack Surface</h2><h3 id="1-1-Kernel-Driver-&#xACF5;&#xACA9;-&#xD45C;&#xBA74;-&#xAC1C;&#xC694;"><a href="#1-1-Kernel-Driver-&#xACF5;&#xACA9;-&#xD45C;&#xBA74;-&#xAC1C;&#xC694;" class="headerlink" title="1.1 Kernel Driver &#xACF5;&#xACA9; &#xD45C;&#xBA74; &#xAC1C;&#xC694;"></a><strong>1.1 Kernel Driver &#xACF5;&#xACA9; &#xD45C;&#xBA74; &#xAC1C;&#xC694;</strong></h3><p>Windows &#xD658;&#xACBD;&#xC5D0;&#xC11C; LPE &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC640; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC; &#xC0AC;&#xC774;&#xC758; &#xC2E0;&#xB8B0;&#xBC94;&#xC704; &#xAC80;&#xC99D;&#xC774; &#xBD80;&#xC871;&#xD560; &#xB54C; &#xB9CE;&#xC774; &#xBC1C;&#xC0DD;&#xB418;&#xB294;&#xB370;, &#xC774; &#xC810;&#xC5D0;&#xC11C; &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC88B;&#xC740; &#xD0C0;&#xAC9F;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. WDM &#xAD6C;&#xC870;&#xC758; &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; IRP(<code>IRP_MJ_DEVICE_CONTROL</code>)&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xBA74;&#xC11C; <code>IO_STACK_LOCATION</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD1B5;&#xD574; IOCTL &#xCF54;&#xB4DC;&#xC640; &#xC785;&#xB825; &#xBC84;&#xD37C;&#xC640; &#xCD9C;&#xB825; &#xBC84;&#xD37C;&#xC758; &#xAE38;&#xC774; &#xC815;&#xBCF4;&#xB97C; &#xCEE4;&#xB110;&#xC5D0; &#xC804;&#xB2EC;&#xBC1B;&#xB294; &#xD615;&#xD0DC;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; IOCTL &#xC804;&#xB2EC; &#xBC29;&#xC2DD;&#xC5D0; &#xB530;&#xB77C; IRP &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xAC01; &#xD544;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xC0AC;&#xC6A9;&#xC790; &#xC785;&#xB825; &#xBC84;&#xD37C;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294;&#xB370;&#xC694;! </p>
<p>&#xD2B9;&#xD788; WDM&#xC5D0;&#xC11C; <code>METHOD_BUFFERED</code>&#xC5D0;&#xC11C;&#xB294; I/O Manager&#xAC00; &#xCEE4;&#xB110; &#xBC84;&#xD37C;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xACE0; &#xADF8; &#xD3EC;&#xC778;&#xD130;&#xB97C; <code>Irp-&gt;AssociatedIrp.SystemBuffer</code>&#xB85C; &#xC81C;&#xACF5;&#xD558;&#xBA74;&#xC11C; &#xC785;&#xB825;&#xACFC; &#xCD9C;&#xB825; &#xBAA8;&#xB450; &#xC774; &#xBC84;&#xD37C;&#xB97C; &#xD1B5;&#xD574; &#xC624;&#xAC11;&#xB2C8;&#xB2E4;. &#xC989;, &#xC774;&#xB7F0; IOCTL &#xCC98;&#xB9AC; &#xB85C;&#xC9C1;&#xC774; &#xC0AC;&#xC6A9;&#xC790; &#xC785;&#xB825;&#xC744; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; &#xACF5;&#xAC04;&#xC5D0;&#xC11C; &#xD574;&#xC11D;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5B4;&#xC788;&#xB2E4;&#xB294; &#xC810;, &#xADF8;&#xB9AC;&#xACE0; I/O Manager&#xAC00; IRP&#xB97C; &#xAD6C;&#xC131;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xC790; &#xC785;&#xB825;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC99D;&#xC744; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD2B9;&#xC131;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xBA74;&#xC11C; &#xD0C0;&#xAC9F;&#xC744; &#xC218;&#xC9D1;&#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<br><br>  </p>
<h3 id="1-2-Kernel-Driver-&#xD0C0;&#xAC9F;-&#xC218;&#xC9D1;"><a href="#1-2-Kernel-Driver-&#xD0C0;&#xAC9F;-&#xC218;&#xC9D1;" class="headerlink" title="1.2 Kernel Driver &#xD0C0;&#xAC9F; &#xC218;&#xC9D1;"></a>1.2 Kernel Driver &#xD0C0;&#xAC9F; &#xC218;&#xC9D1;</h3><p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image2.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; &#xC81C;&#xAC00; &#xC124;&#xCE58;&#xD55C; &#xC11C;&#xB4DC;&#xD30C;&#xD2F0; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xCC3E;&#xC544;&#xBD10;&#xC57C;&#xACA0;&#xC8E0;? &#xCCAB; &#xB2E8;&#xACC4;&#xC5D0;&#xC11C;&#xB294; FolderChangesView&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xC790; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB418;&#xB294; <code>.sys</code> &#xD30C;&#xC77C;&#xC744; &#xCD94;&#xC801;&#xD558;&#xBA74;&#xC11C;, &#xC0DD;&#xC131;&#xB41C; sys &#xD30C;&#xC77C; &#xBA85;&#xACFC; &#xC5B4;&#xB514;&#xC5D0; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xB294;&#xC9C0; Path&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xC800;&#xD76C;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xCEE4;&#xB110;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xC5B4; &#xC2E4;&#xD589; &#xC911;&#xC778; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD558;&#xB2C8;&#xAE4C;, &#xADF8; &#xB2E4;&#xC74C;&#xC5D0;&#xB294; DriverView&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD604;&#xC7AC; &#xCEE4;&#xB110;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xBAA9;&#xB85D;&#xC744; &#xD655;&#xC778;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xB85C;&#xB4DC;&#xB41C; &#xC0C1;&#xD0DC;&#xB77C;&#xB294;&#xAC74; IOCTL, IRP &#xCC98;&#xB9AC; &#xB8E8;&#xD2F4;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4;&#xC788;&#xB2E4;&#xB294; &#xC18C;&#xB9AC;&#xACA0;&#xC8E0;?</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image4.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC800;&#xD76C;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xC790;&#xB3D9;&#xD654; &#xD234;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4; FolderChangesView&#xB97C; &#xD1B5;&#xD574; <code>.sys</code> &#xD30C;&#xC77C;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCCD0;&#xC11C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC704;&#xCE58;&#xD55C; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xC6A9; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB85C; &#xBCF5;&#xC0AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCCE4;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xCD9C;&#xB41C; &#xD30C;&#xC77C;&#xC774; &#xBD84;&#xC11D;&#xC6A9; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xC798; &#xC62E;&#xACA8;&#xC84C;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xBA74;&#xC11C; &#xBD84;&#xC11D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.<br><br>  </p>
<h3 id="1-3-Kernel-Driver-&#xBD84;&#xC11D;"><a href="#1-3-Kernel-Driver-&#xBD84;&#xC11D;" class="headerlink" title="1.3 Kernel Driver &#xBD84;&#xC11D;"></a>1.3 Kernel Driver &#xBD84;&#xC11D;</h3><p>&#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xBD84;&#xC11D;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xBD80;&#xBD84;&#xC744; &#xC21C;&#xC11C;&#xB85C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xB178;&#xCD9C;&#xB41C; <code>DeviceName</code> &#x2192; &#xC720;&#xC800; &#xC811;&#xADFC; &#xAC00;&#xB2A5; &#xC5EC;&#xBD80; &#xD310;&#xB2E8;</li>
<li>WinObj&#xB85C; <code>\Device</code> &#xB178;&#xB4DC; &#xC811;&#xADFC; &#xAC00;&#xB2A5; &#xC5EC;&#xBD80; &#xD655;&#xC778;</li>
<li>IDA/Plugin &#xD65C;&#xC6A9;&#xD574; WDM &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xBD84;&#xC11D; &#xC2DC;&#xC791;</li>
<li>IDA&#xB97C; &#xD1B5;&#xD574; IOCTL Table &#xC2DD;&#xBCC4;</li>
<li><code>DispatchRoutine</code> &#xBD84;&#xC11D; &#x2192; &#xC785;&#xB825; &#xAC80;&#xC99D; &#xBD80;&#xBD84;/ &#xAD6C;&#xC870;&#xCCB4;/ &#xD544;&#xB4DC; &#xD655;&#xC778;</li>
<li>WinDBG&#xB97C; &#xD1B5;&#xD574; &#xD568;&#xC218; &#xD750;&#xB984;<code>/Device</code> &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xACFC;&#xC815; &#xCD94;&#xC801;&#xD558;&#xBA74;&#xC11C; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xC218;&#xD589;</li>
</ol>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; DriverEntry&#xC5D0;&#xC11C; Device, Symlink&#xAC00; &#xB178;&#xCD9C;&#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC83;&#xC774; &#xCCAB; &#xBC88;&#xC9F8; &#xB2E8;&#xACC4;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xCC98;&#xB7FC; Device Name&#xC774; <code>\Device\PdFwKrnl</code>, Symlink&#xAC00; <code>\DosDevices\PdFwKrnl</code> &#xAC19;&#xC740; &#xC2DD;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xB2E4;&#xBA74;, &#xC774; &#xB2E8;&#xACC4;&#xB97C; &#xD1B5;&#xD574; &#xC720;&#xC800; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; <code>CreateFile/DeviceControl</code>&#xB85C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0BC; &#xAC00;&#xB2A5;&#xD55C; &#xC9C4;&#xC785;&#xC810;&#xC744; &#xD655;&#xBCF4;&#xD588;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. <code>DriverObject-&gt;MajorFunction</code> &#xD14C;&#xC774;&#xBE14;&#xC744; &#xD1B5;&#xD574;<code>IRP_MJ_DEVICE_CONTROL</code>&#xC774; &#xC5B4;&#xB5A4; &#xB514;&#xC2A4;&#xD328;&#xCE58; &#xB8E8;&#xD2F4;(<code>DispatchDeviceControl</code>)&#xC5D0; &#xC5F0;&#xACB0;&#xB418;&#xB294;&#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image6.png" srcset="/img/loading.gif" alt></p>
<p><code>\Device</code>&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC54C;&#xC544;&#xB0C8;&#xB2E4;&#xBA74; &#xC774; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC2E4;&#xC81C;&#xB85C; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; &#xC9C4;&#xC785;&#xC810;&#xC744; &#xB178;&#xCD9C;&#xD558;&#xACE0; &#xC788;&#xB294;&#xC9C0;, &#xC811;&#xADFC; &#xC81C;&#xC5B4;&#xAC00; &#xB204;&#xAD6C;&#xD55C;&#xD14C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC5F4;&#xB824;&#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. WinObj&#xC5D0;&#xC11C; <code>\Device</code> &#xC544;&#xB798;&#xC5D0; &#xC6B0;&#xB9AC;&#xAC00; &#xCC3E;&#xC740; Device Object&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0;, Symlink&#xB3C4; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; Device&#xC640; Symlink&#xC758; Security &#xD0ED;&#xC744; &#xC5F4;&#xC5B4;&#xC11C; Everyone&#xC778; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; Read Write &#xAD8C;&#xD55C;&#xC774; &#xC5F4;&#xB824;&#xC788;&#xB294;&#xC9C0; &#xAF2D; &#xD655;&#xC778;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;! &#xC5F4;&#xB824;&#xC788;&#xC5B4;&#xC57C; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xB3C4; &#xD578;&#xB4E4;&#xC744; &#xC5F4;&#xACE0; IOCTL &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xD6C4; IDA&#xC758; DriverBuddy&#xB97C; &#xD1B5;&#xD574; &#xC8FC;&#xC694; &#xB514;&#xC2A4;&#xD328;&#xCE58; &#xB8E8;&#xD2F4;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xD655;&#xC778;&#xD558;&#xACE0;, WDM &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC778;&#xC9C0; &#xC2DD;&#xBCC4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. DriverBuddy&#xAC00; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xCEE4;&#xB110; API &#xD638;&#xCD9C; &#xD754;&#xC801;&#xB4E4;&#xC744; &#xCC3E;&#xC544;&#xC8FC;&#xB294;&#xB370;, &#xC608;&#xC2DC;&#xB85C; &#xC704;&#xC5D0;&#xC11C; &#xB098;&#xC628; <code>MmMapIoSpace</code>, <code>MmUnmapIoSpace</code>, <code>MmBuildMdlForNonPagedPool</code>, <code>MmMapLockedPages</code> &#xAC19;&#xC740; &#xD638;&#xCD9C; &#xC9C0;&#xC810;&#xB4E4;&#xC774; <code>DispatchDeviceControl</code> &#xADFC;&#xCC98;&#xC5D0; &#xC788;&#xB2E4;&#xB294;&#xAC78; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; <code>MmMapIoSpace</code>&#xAC19;&#xC740; &#xBB3C;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; &#xCEE4;&#xB110; &#xAC00;&#xC0C1; &#xC8FC;&#xC18C;&#xB85C; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xB8E8;&#xD2F4;, &#xC989; &#xBB3C;&#xB9AC;&#xC8FC;&#xC18C;, &#xAE38;&#xC774;, &#xCE90;&#xC2DC; &#xD0C0;&#xC785;&#xC744; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xC81C;&#xC5B4;&#xD558;&#xBA74; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xB420; &#xC218; &#xC788;&#xC73C;&#xB2C8; &#xC800;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC774;&#xAC78; &#xBD84;&#xC11D; &#xBCA1;&#xD130;&#xB85C; &#xC9C0;&#xC815;&#xD558;&#xACE0; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB9AC;&#xACE0; <code>DispatchDeviceControl</code> &#xB0B4;&#xBD80;&#xC758; switch-case&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; IOCTL &#xBD84;&#xAE30; &#xAD6C;&#xC870;&#xB97C; &#xC5ED;&#xCD94;&#xC801;&#xD558;&#xB294; &#xB2E8;&#xACC4;&#xB97C; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC704; WDM &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xAC19;&#xC740; &#xACBD;&#xC6B0; <code>DispatchDeviceControl</code> &#xB0B4;&#xBD80; switch-case&#xC5D0;&#xC11C; &#xD2B9;&#xC815; IOCTL Cases&#xB4E4;&#xC774; <code>0x80002000</code>, <code>0x80002004</code>, <code>0x8000201C</code>&#x2026; &#xD615;&#xD0DC;&#xB85C; &#xBD84;&#xAE30;&#xB97C; &#xD0C0;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; <code>MmMapIoSpace</code> &#xD638;&#xCD9C;&#xACFC; &#xC9C1;&#xC811; &#xC5F0;&#xACB0;&#xB418;&#xB294; IOCTL Case&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xCF00;&#xC774;&#xC2A4;&#xB4E4;&#xC744; &#xD589;&#xC704; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xBD84;&#xB958;&#xD558;&#xBA74;&#xC11C; &#xC635;&#xC158; &#xAC12;, &#xAE38;&#xC774;, &#xD3EC;&#xC778;&#xD130; &#xCC98;&#xB9AC;&#xAC19;&#xC740; &#xC785;&#xB825; &#xAC80;&#xC99D;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image9.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC608;&#xB97C;&#xB4E4;&#xBA74; &#xC774; &#xBD84;&#xC11D;&#xC5D0;&#xC11C; &#xD575;&#xC2EC;&#xC73C;&#xB85C; &#xBCF8; &#xC9C0;&#xC810;&#xC740; <code>0x8000202C</code> Case&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xCF00;&#xC774;&#xC2A4;&#xC5D0;&#xC11C;&#xB294; IRP &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC785;&#xB825; &#xBC84;&#xD37C;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xC624;&#xD504;&#xC14B; &#xAC12;&#xC744; <code>dst</code>/<code>src</code>/<code>size</code> &#xAC19;&#xC740; &#xC778;&#xC790;&#xB85C; &#xD574;&#xC11D;&#xD574; &#xCD94;&#xCD9C;&#xD574;&#xC11C; <code>memmove</code>&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD750;&#xB984;&#xC774; &#xB098;&#xD0C0;&#xB098;&#xB294;&#xB370;&#xC694;. WDM &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xBCF4;&#xBA74; <code>DeviceIoControl</code> &#xACBD;&#xB85C;&#xC5D0;&#xC11C; IOCTL&#xC774; <code>METHOD_BUFFERED</code>&#xB77C;&#xBA74; I/O Manager&#xC740; <code>IRP&#x2192;AssociatedIrp.SystemBuffer</code>&#xC5D0; &#xCEE4;&#xB110;&#xC774; &#xD560;&#xB2F9;&#xD55C; &#xBC84;&#xD37C; &#xC8FC;&#xC18C;&#xB97C; &#xB123;&#xACE0;, &#xADF8; &#xBC84;&#xD37C; &#xC548;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC720;&#xC800; &#xC778;&#xD48B;&#xC5D0;&#xC11C; &#xBCF5;&#xC0AC;&#xD574;&#xC11C; &#xCC44;&#xC6C1;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image11.png" srcset="/img/loading.gif" alt></p>
<p><code>0x8000202C</code> Case&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xC9C4;&#xC785;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;, &#xC785;&#xB825; &#xBC84;&#xD37C; &#xAE38;&#xC774; <code>0x38</code>&#xB9CC; &#xB9DE;&#xC73C;&#xBA74;, &#xADF8; &#xBC84;&#xD37C; &#xC548;&#xC758; &#xC624;&#xD504;&#xC14B;(+<code>0x20</code>/+<code>0x28</code>/+<code>0x30</code>)&#xC5D0;&#xC11C; &#xAEBC;&#xB0B8; &#xAC12;&#xC744; &#xD3EC;&#xC778;&#xD130;/&#xAE38;&#xC774;&#xB85C; &#xC2E0;&#xB8B0;&#xD558;&#xACE0; <code>memmove(dst, src, size)</code>&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB124;&#xC694;. &#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; read/ write primitive&#xAC00; &#xC131;&#xB9BD;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image12.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xD6C4; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC54C;&#xC544;&#xB0B8; &#xC815;&#xBCF4;&#xB97C; &#xD1B5;&#xD574; WinDBG&#xC5D0;&#xC11C; &#xD568;&#xC218; &#xD750;&#xB984;&#xC744; &#xB530;&#xB77C;&#xAC00;&#xBCF4;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC544;&#xAE4C; <code>0x8000202C</code>&#xC5D0;&#xC11C; <code>SystemBuffer(rsi)+0x20/0x28/0x30</code> &#xAC12;&#xC744; <code>memmove(dst, src, size)</code>&#xC5D0; &#xB123;&#xB294;&#xB2E4;&#xB294;&#xAC78; &#xD655;&#xC778;&#xD588;&#xB294;&#xB370;, payload&#xB97C; &#xC791;&#xC131;&#xD558;&#xACE0; <code>rsi</code>&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; <code>METHOD_BUFFERED</code>&#xC758; <code>SystemBuffer</code> &#xC8FC;&#xBCC0;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;&#x2026; &#xC758;&#xB3C4;&#xD55C;&#xB300;&#xB85C;  &#x2018;<code>A</code>&#x2019;&#xB85C; &#xB36E;&#xC778; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC8E0;?</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image13.png" srcset="/img/loading.gif" alt></p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD655;&#xC778;&#xD588;&#xB2E4;&#xBA74; &#xC774;&#xC81C; exploit&#xC744; &#xD574;&#xC8FC;&#xBA74; &#xB418;&#xB294;&#xB370;&#xC694; &#xC608;&#xC2DC;&#xB85C; &#xC704;&#xC758; &#xACBD;&#xC6B0;&#xB97C; &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; IOCTL &#xC785;&#xB825; &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xB2E4; <code>dst=output_buf</code>(&#xC720;&#xC800; &#xC8FC;&#xC18C;), <code>src=&#xC77D;&#xACE0; &#xC2F6;&#xC740; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;</code>, <code>size=8</code>&#xC744; &#xB123;&#xC5B4; <code>DeviceIoControl</code>&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xCEE4;&#xB110;&#xC774; <code>memmove(dst, src, size)</code>&#xB97C; &#xC218;&#xD589;&#xD558;&#xBA74;&#xC11C; 8&#xBC14;&#xC774;&#xD2B8; &#xB2E8;&#xC704; Arbitrary Read&#xAC00; &#xC131;&#xB9BD;&#xD569;&#xB2C8;&#xB2E4;. &#xC708;&#xB3C4;&#xC6B0; &#xBC84;&#xADF8; &#xCC3E;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xC775;&#xC219;&#xD55C; &#xCE5C;&#xAD6C;&#xC778; <code>NtQuerySystemInformation</code> &#xD578;&#xB4E4; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xD1B5;&#xD574; EPROCESS &#xC8FC;&#xC18C;&#xB97C; &#xC5BB;&#xACE0;, &#xC774;&#xB807;&#xAC8C; &#xC5BB;&#xC740; SYSTEM EPROCESS &#xC8FC;&#xC18C;&#xC5D0; TOKENOFFSET&#xC744; &#xB354;&#xD574; <code>EPROCESS-&gt;Token</code> &#xAC12;&#xC744; &#xC77D;&#xC5B4;&#xC628; &#xD6C4;, &#xB2E4;&#xC2DC; &#xB3D9;&#xC77C;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD604;&#xC7AC; EPROCESS &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD574; Token &#xD544;&#xB4DC; &#xC704;&#xCE58;&#xB97C; &#xACC4;&#xC0B0;&#xD55C; &#xB4A4;, IOCTL&#xC5D0; <code>dst=&#xD604;&#xC7AC; EPROCESS+TOKENOFFSET</code>, <code>src=&#xC900;&#xBE44;&#xD55C; SYSTEM &#xD1A0;&#xD070; &#xD3EC;&#xC778;&#xD130;</code>, <code>size=8</code> &#xC774;&#xB807;&#xAC8C; &#xB123;&#xC5B4;&#xC11C; Arbitrary Write&#xB97C; &#xC218;&#xD589;&#xD574; Privilege escalation&#xC744; &#xC131;&#xACF5;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xB4EF; &#xC138;&#xBD80; &#xD398;&#xC774;&#xB85C;&#xB4DC; &#xAD6C;&#xC131;&#xC740; &#xB098;&#xD0C0;&#xB09C; &#xCDE8;&#xC57D;&#xC810; &#xC720;&#xD615;&#xC5D0; &#xB530;&#xB77C; &#xAD6C;&#xC131;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.<br><br>   </p>
<h2 id="Chapter-2-Named-Pipe-as-an-Attack-Surface"><a href="#Chapter-2-Named-Pipe-as-an-Attack-Surface" class="headerlink" title="Chapter 2: Named Pipe as an Attack Surface"></a>Chapter 2: Named Pipe as an Attack Surface</h2><h3 id="2-1-Named-Pipe-&#xACF5;&#xACA9;-&#xD45C;&#xBA74;-&#xAC1C;&#xC694;"><a href="#2-1-Named-Pipe-&#xACF5;&#xACA9;-&#xD45C;&#xBA74;-&#xAC1C;&#xC694;" class="headerlink" title="2.1 Named Pipe &#xACF5;&#xACA9; &#xD45C;&#xBA74; &#xAC1C;&#xC694;"></a>2.1 Named Pipe &#xACF5;&#xACA9; &#xD45C;&#xBA74; &#xAC1C;&#xC694;</h3><p>&#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xB2E4;&#xBA74; &#xC774;&#xBC88;&#xC5D0;&#xB294; Named Pipe&#xB97C; &#xC0B4;&#xD3B4;&#xBCFC; &#xCC28;&#xB840;&#xC778;&#xB370;&#xC694;. Named Pipe &#xD1B5;&#xC2E0; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD55C; &#xC57D;&#xAC04;&#xC758; &#xC774;&#xD574;&#xB97C; &#xC804;&#xC81C;&#xD558;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xC5F0;&#xAD6C;&#xAE00;&#xC774; <a href="https://hackyboiz.github.io/2025/05/12/ogu123/NamedPipe/KR/">&#x1F449;&#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xC73C;&#xB2C8;</a> &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xACE0; &#xC624;&#xC2DC;&#xB294;&#xAC78; &#xCD94;&#xCC9C;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! Named Pipe&#xB294; IPC &#xD1B5;&#xC2E0; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC774; &#xB418;&#xC9C0;&#xB9CC;, &#xCEE4;&#xB110; &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB85C; &#xAD00;&#xB9AC;&#xB418;&#xACE0; &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; SYSTEM &#xAD8C;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBE48;&#xBC88;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; Named Pipe &#xC785;&#xB825;&#xC744; &#xBCF4;&#xB0B8; &#xB4A4;&#xC5D0; &#xC774;&#xAC78; &#xB0B4;&#xBD80; &#xBA54;&#xC138;&#xC9C0;&#xB85C; &#xC2E0;&#xB8B0;&#xD558;&#xACE0; &#xAD6C;&#xC870;&#xCCB4;&#xB85C; &#xD30C;&#xC2F1;&#xD558;&#xAC70;&#xB098; &#xAD8C;&#xD55C; &#xBCC0;&#xACBD;, &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xB3D9;&#xC791;, &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC2E4;&#xD589;&#xAC19;&#xC740; &#xBBFC;&#xAC10; &#xB3D9;&#xC791;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xAF64; &#xB9CE;&#xC544;&#xC11C; &#xAC80;&#xC99D;&#xC774; &#xBD80;&#xC871;&#xD558;&#xBA74; LPE&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. IPC&#xB294; IOCTL&#xACFC; &#xB2E4;&#xB974;&#xAC8C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC811;&#xADFC;&#xD574;&#xBD10;&#xC57C; &#xD560;&#xC9C0; &#xAD81;&#xAE08;&#xD558;&#xC2DC;&#xC8E0;? &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;!<br><br>  </p>
<h3 id="2-2-Named-Pipe-&#xD0C0;&#xAC9F;-&#xC218;&#xC9D1;"><a href="#2-2-Named-Pipe-&#xD0C0;&#xAC9F;-&#xC218;&#xC9D1;" class="headerlink" title="2.2 Named Pipe &#xD0C0;&#xAC9F; &#xC218;&#xC9D1;"></a>2.2 Named Pipe &#xD0C0;&#xAC9F; &#xC218;&#xC9D1;</h3><p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xD0C0;&#xAC9F; &#xC218;&#xC9D1;&#xC740; &#xBA3C;&#xC800; (1) SYSTEM/&#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD6C4;&#xBCF4;&#xB97C; &#xACE0;&#xB9AC;&#xACE0;, (2) &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5F4;&#xACE0; &#xC788;&#xB294; &#xD30C;&#xC774;&#xD504; &#xD578;&#xB4E4;&#xC744; &#xD655;&#xBCF4;&#xD55C; &#xB2E4;&#xC74C;&#xC5D0;, (3) &#xD30C;&#xC774;&#xD504; ACL&#xC744; &#xD1B5;&#xD574; Everyone &#xAC19;&#xC740; &#xBE44;&#xAD00;&#xB9AC;&#xC790;&#xAC00; Read Write &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xB294; &#xC21C;&#xC11C;&#xB85C; &#xC9C4;&#xD589;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image14.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; Process Explorer&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD6C4;&#xBCF4;&#xB97C; &#xC7A1;&#xC73C;&#xBA74;&#xC11C; &#xC2DC;&#xC791;&#xD558;&#xAC8C; &#xB418;&#xB294;&#xB370;&#xC694;. &#xC81C;&#xAC00; &#xC7A1;&#xB294; &#xAE30;&#xC900;&#xC740; &#xC2E4;&#xD589; &#xACC4;&#xC815;&#xC774; SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC778;&#xC9C0;, &#xC11C;&#xB4DC;&#xD30C;&#xD2F0; &#xC11C;&#xBE44;&#xC2A4;&#xC778;&#xC9C0;, HANDLE&#xC5D0; Named Pipe&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0;, Integrity Level&#xC774; SYSTEM&#xC778;&#xC9C0; &#xC815;&#xB3C4;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xD0C0;&#xAC9F;&#xC744; &#xC881;&#xD600;&#xAC11;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image15.png" srcset="/img/loading.gif" alt></p>
<p>&#xD2B9;&#xD788; Process Explorer &#xD558;&#xB2E8;&#xC758; Handles &#xD0ED;&#xC5D0;&#xC11C; NamedPipe&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;. &#xC774;&#xB54C; Type&#xC774; <code>File</code>&#xB85C; &#xC7A1;&#xD788;&#xBA74;&#xC11C; Name&#xC774; <code>\Device\NamedPipe\&#x2026;</code> &#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xD56D;&#xBAA9;&#xC774; Named Pipe&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xC218;&#xC9D1;&#xB41C; <code>\Device\NamedPipe\&#x2026;</code>&#xACBD;&#xB85C;&#xB294; &#xB294; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; <code>\.\pipe\&#x2026;</code> &#xAC19;&#xC740; &#xD615;&#xD0DC;&#xB85C; &#xB9E4;&#xD551;&#xB418;&#xB294; &#xC9C0;&#xC810;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image16.png" srcset="/img/loading.gif" alt></p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xD070; &#xAD00;&#xBB38;&#xC774; &#xD558;&#xB098; &#xB0A8;&#xC544;&#xC788;&#xB294;&#xB370;&#xC694;.. &#xBC14;&#xB85C; ACL&#xC785;&#xB2C8;&#xB2E4;. &#xD798;&#xB4E4;&#xAC8C; Named Pipe&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xAC78; &#xD655;&#xC778;&#xD588;&#xB294;&#xB370; &#xC774;&#xAC78; &#xC77D;&#xACE0; &#xC4F8; &#xC218;&#xAC00; &#xC5C6;&#xC73C;&#xBA74;&#x2026; &#xADF8; Named Pipe&#xC640;&#xB294; &#xC791;&#xBCC4;&#xC778;&#xC0AC;&#xB97C; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.&#x1F62D;  Administrators&#xB9CC; RW&#xC774;&#xACE0; &#xB098;&#xBA38;&#xC9C0;&#xC5D0;&#xAC90; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xC73C;&#xBA74; LPE&#xAC00; &#xC131;&#xACF5;&#xD558;&#xB294; &#xBCA1;&#xD130;&#xB85C; &#xBCF4;&#xAE30; &#xD798;&#xB4E4;&#xACE0;, Everyone, Authenticated Users, Users &#xAC19;&#xC740; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xADF8;&#xB8F9;&#xC5D0; RW&#xAC00; &#xC5F4;&#xB824; &#xC788;&#xB294;&#xC9C0; accesschk&#xAC19;&#xC740; &#xD234;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD30C;&#xC774;&#xD504; ACL&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xD0C0;&#xAC9F;&#xC744; &#xC881;&#xD600;&#xB098;&#xAC00;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image17.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB807;&#xAC8C; &#xD0C0;&#xAC9F;&#xC744; &#xC120;&#xC815;&#xD588;&#xB2E4;&#xBA74;, &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC5F4;&#xC5B4;&#xC11C; <code>CreateNamedPipeA/W</code>, <code>ConnectNamedPipe</code>, <code>DisconnectNamedPipe</code> &#xAC19;&#xC740; API&#xB4E4;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xAC80;&#xC0C9;&#xD574;&#xC11C; &#xC774;&#xAC8C; &#xC11C;&#xBC84; &#xAD6C;&#xD604;&#xC774; &#xB9DE;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0;, <code>Connect &#x2192; Read</code> &#xD750;&#xB984;, &#xD30C;&#xC2F1; &#xBD84;&#xAE30;, &#xD1A0;&#xD070;/&#xC811;&#xADFC; &#xC81C;&#xC5B4;&#xAC19;&#xC740; &#xAD8C;&#xD55C; &#xAD00;&#xB828; &#xBD84;&#xAE30;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xBA74; &#xD0C0;&#xAC9F; &#xC218;&#xC9D1; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xB05D;&#xC774; &#xB0A9;&#xB2C8;&#xB2E4;.<br><br>  </p>
<h3 id="2-3-Named-Pipe-&#xBD84;&#xC11D;"><a href="#2-3-Named-Pipe-&#xBD84;&#xC11D;" class="headerlink" title="2.3 Named Pipe &#xBD84;&#xC11D;"></a>2.3 Named Pipe &#xBD84;&#xC11D;</h3><p>&#xBD84;&#xC11D;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC21C;&#xC11C;&#xB85C; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>Process Explorer&#xB85C; &#xC11C;&#xBC84;(SYSTEM &#xC11C;&#xBE44;&#xC2A4;) &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xD6C4;&#xBCF4; &#xC120;&#xC815;</li>
<li>&#xC218;&#xC9D1;&#xD55C; <code>\Device\NamedPipe\...</code>&#xAC00; &#xC720;&#xC800; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; <code>\\.\pipe\...</code>&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xB294; &#xC9C0;&#xC810;&#xC778;&#xC9C0; &#xD655;&#xC778;</li>
<li>accesschk&#xB85C; Pipe ACL &#xC810;&#xAC80; &#x2192; Everyone&#xAC19;&#xC740; &#xAD11;&#xBC94;&#xC704; &#xADF8;&#xB8F9; Read/Write &#xC5F4;&#xB9BC; &#xC5EC;&#xBD80; &#xD655;&#xC778;</li>
<li>IDA&#xB85C; <code>CreateNamedPipe*</code> &#x2192; <code>ConnectNamedPipe</code> &#x2192; <code>ReadFile/WriteFile</code> &#xAC19;&#xC740; &#xD750;&#xB984;&#xACFC; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xD568;&#xC218; &#xB514;&#xC2A4;&#xD328;&#xCE58; &#xC7A1;&#xAE30;</li>
<li>&#xC5B4;&#xB5A4; &#xC694;&#xCCAD;&#xC774; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;/HKLM, &#xC11C;&#xBE44;&#xC2A4; &#xC124;&#xC815; &#xB4F1; &#xAD8C;&#xD55C;&#xC774; &#xC911;&#xC694;&#xD55C; &#xB3D9;&#xC791;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294;&#xC9C0; &#xBD84;&#xAE30;&#xB85C; &#xC881;&#xD788;&#xAE30;</li>
<li>ProcMon &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8; &#xC7A1;&#xC73C;&#xBA74;&#xC11C; &#xB3D9;&#xC801;&#xBD84;&#xC11D; &#xC218;&#xD589;</li>
</ol>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image18.png" srcset="/img/loading.gif" alt></p>
<p>&#xD0C0;&#xAC9F;&#xC744; &#xC815;&#xD588;&#xC73C;&#xBA74; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC740; procmon&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD30C;&#xC774;&#xD504; I/O&#xAC00; &#xC5B4;&#xB5A4; &#xCDE8;&#xC57D;&#xD55C; &#xD589;&#xC704;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; &#xD30C;&#xC774;&#xD504;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC218;&#xC2E0;&#xD558;&#xB294; &#xC11C;&#xBC84; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC640; &#xD30C;&#xC774;&#xD504;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xACE0; &#xC1A1;&#xC2E0;&#xD558;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC881;&#xD78C; &#xD6C4;&#xC5D0;, <code>CreateNamedPipe</code>, <code>CreateFile</code>, <code>ReadFile</code>, <code>WriteFile</code>&#xAC19;&#xC740; IPC &#xD638;&#xCD9C; &#xD750;&#xB984;&#xC744; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC94;&#xC704;&#xC5D0;&#xC11C; &#xCD94;&#xC801;&#xD560; &#xC900;&#xBE44;&#xB97C; &#xD569;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; <code>Process Name</code>, <code>Operation</code>&#xC5D0; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4; &#xAD00;&#xB828;&#xB41C; &#xC774;&#xBCA4;&#xD2B8;&#xB098; named pipe &#xD575;&#xC2EC; I/O &#xC774;&#xBCA4;&#xD2B8;&#xB97C; Filter&#xC5D0; &#xB4F1;&#xB85D;&#xD558;&#xACE0;, &#xC11C;&#xBC84; Integrity&#xAC00; System&#xC778;&#xC9C0; &#xD544;&#xD130;&#xB85C; &#xACE0;&#xC815;&#xD574;&#xB450;&#xB294;&#xAC8C; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xD574;&#xC57C; &#xC720;&#xC800; &#xC785;&#xB825;&#xC774; SYSTEM&#xC73C;&#xB85C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30;&#xC5D0; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image19.png" srcset="/img/loading.gif" alt></p>
<p>&#xB9C8;&#xCE68; &#xC81C;&#xAC00; &#xBD84;&#xC11D;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xC124;&#xC815;&#xC5D0; Non Admin&#xB3C4; Access Control&#xB85C; &#xC77C;&#xBD80; &#xAD00;&#xB9AC; &#xAE30;&#xB2A5;&#xC774; &#xD5C8;&#xC6A9;&#xB418;&#xB294; &#xCCB4;&#xD06C;&#xBC15;&#xC2A4;&#xAC00; &#xC788;&#xB124;&#xC694;.. &#xC548;&#xD2F0;&#xBC14;&#xC774;&#xB7EC;&#xC2A4;&#xB2C8;&#xAE4C; &#xADF8;&#xB7F4;&#xB9CC;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xBCF4;&#xD1B5; &#xC774;&#xB807;&#xC9C0;&#xB294; &#xC54A;&#xB294;&#xB370; &#xBE44;&#xAD00;&#xB9AC;&#xC790; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC124;&#xC815; &#xBCC0;&#xACBD;/ &#xBCF4;&#xD638; &#xBE44;&#xD65C;&#xC131;&#xD654; &#xD5C8;&#xC6A9; &#xCCB4;&#xD06C;&#xBC15;&#xC2A4;&#xB97C; &#xACC4;&#xC18D; &#xD074;&#xB9AD;&#xD574;&#xBD10;&#xB3C4; UAC&#xAC00; &#xC804;&#xD600; &#xB728;&#xC9C0; &#xC54A;&#xB124;&#xC694;?? &#xBB54;&#xAC00; &#xC218;&#xC0C1;&#xD558;&#xC8E0;? &#xBC14;&#xB85C; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC6B0;&#xC120; &#xC21C;&#xC704;&#xB85C; &#xC758;&#xC2EC;&#xD574;&#xC11C; &#xAC00;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs c">PS C:\Users\banda\Downloads\AccessChk&gt; .\accesschk.exe -accepteula -lv <span class="hljs-string">&quot;\pipe\K7TSMngrService1&quot;</span>

\\.\Pipe\K7TSMngrService1
  DESCRIPTOR FLAGS:
      [SE_DACL_PRESENT]
      [SE_SACL_PRESENT]
      [SE_SACL_AUTO_INHERITED]
      [SE_SELF_RELATIVE]
  OWNER: NT AUTHORITY\SYSTEM
  LABEL: Low Mandatory Level
        SYSTEM_MANDATORY_LABEL_NO_WRITE_UP
  [<span class="hljs-number">0</span>] ACCESS_ALLOWED_ACE_TYPE: NT AUTHORITY\SYSTEM
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL
  [<span class="hljs-number">1</span>] ACCESS_ALLOWED_ACE_TYPE: Everyone
        FILE_ADD_FILE
        FILE_CREATE_PIPE_INSTANCE
        FILE_APPEND_DATA
        FILE_LIST_DIRECTORY
        FILE_READ_ATTRIBUTES
        FILE_READ_DATA
        FILE_READ_EA
        FILE_WRITE_ATTRIBUTES
        FILE_WRITE_DATA
        FILE_WRITE_EA
        SYNCHRONIZE
        READ_CONTROL</code></pre>
<p>ACL&#xC744; &#xC9C1;&#xC811; &#xD655;&#xC778;&#xD574;&#xBCF8; &#xACB0;&#xACFC;, <code>\\.\pipe\K7TSMngrService1</code> &#xCABD;&#xC5D0;&#xC11C; &#xC758;&#xC2EC;&#xACFC; &#xB9DE;&#xAC8C; DACL&#xC774; &#xB108;&#xBB34; &#xB110;&#xB110;&#xD558;&#xAC8C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.. Everyone&#xC5D0; <code>file read</code>, <code>file write</code>, <code>file append</code>&#xAC19;&#xC740;&#xAC8C; &#xD5C8;&#xC6A9;&#xB418;&#xC5C8;&#xC73C;&#xB2C8;, &#xC0AC;&#xC2E4;&#xC0C1; &#xB204;&#xAD6C;&#xB098; &#xC774; &#xD30C;&#xC774;&#xD504;&#xC5D0; &#xC5F0;&#xACB0;&#xC744; &#xC694;&#xCCAD;&#xD574; write&#xD558;&#xACE0; read&#xD558;&#xB294; &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC18C;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xC810;&#xC744; &#xD655;&#xC778;&#xD588;&#xC73C;&#xBA74; &#xC774; &#xC2DC;&#xC810;&#xBD80;&#xD130;&#xB294; &#xB514;&#xC2A4;&#xD328;&#xCE58;&#xB098; &#xD30C;&#xC2F1; &#xB8E8;&#xD2F4;&#xC744; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xC5B4;&#xB5A4; &#xC694;&#xCCAD;&#xC774; &#xAD8C;&#xD55C;&#xC774; &#xC911;&#xC694;&#xD55C; &#xB3D9;&#xC791;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294;&#xC9C0; &#xB450; &#xB208;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image20.png" srcset="/img/loading.gif" alt></p>
<p>&#xAD8C;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD588;&#xC73C;&#xB2C8; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; Named Pipe&#xC758; &#xC11C;&#xBC84; &#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC88B;&#xACA0;&#xC8E0;? &#xC0DD;&#xC131; &#xC2DC;&#xC810;&#xBD80;&#xD130; &#xD070; &#xACE8;&#xACA9;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xB294;&#xAC8C; &#xC88B;&#xC740;&#xB370;, &#xC608;&#xB97C;&#xB4E4;&#xBA74; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; <code>CreateNamedPipeA(&quot;\\\\.\\pipe\\K7TSMngrService1&quot;, ...)</code>&#xB85C; Named Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, <code>ConnectNamedPipe</code>&#xAC00; &#xC131;&#xACF5;&#xD558;&#xBA74; &#xC694;&#xCCAD; &#xCC98;&#xB9AC; &#xD578;&#xB4E4;&#xB7EC; &#xD568;&#xC218;&#xB85C; &#xB514;&#xC2A4;&#xD328;&#xCE58;&#xD558;&#xB294; &#xD750;&#xB984;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774;&#xB7F0; &#xD328;&#xD134;&#xC744; &#xD655;&#xC778;&#xD588;&#xC73C;&#xBA74; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB294; <code>ReadFile</code>&#xB85C; &#xC5B4;&#xB5A4; &#xD5E4;&#xB354;&#xB97C; &#xC77D;&#xB294;&#xC9C0; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xAC80;&#xC99D; &#xBD80;&#xBD84;&#xB3C4; &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image21.png" srcset="/img/loading.gif" alt></p>
<pre><code class="hljs c"><span class="hljs-comment">// request header (28 bytes)</span>
<span class="hljs-keyword">typedef</span> <span class="hljs-class"><span class="hljs-keyword">struct</span> _<span class="hljs-title">K7TS_REQ_HDR</span> {</span>
  <span class="hljs-keyword">uint32_t</span> magic;      <span class="hljs-comment">// &apos;K7TS&apos;</span>
  <span class="hljs-keyword">uint32_t</span> ver;        <span class="hljs-comment">// 0x1010</span>
  <span class="hljs-keyword">uint32_t</span> hdr_sz;     <span class="hljs-comment">// 28</span>
  <span class="hljs-keyword">uint32_t</span> reserved;   <span class="hljs-comment">// 0</span>
  <span class="hljs-keyword">uint32_t</span> op;         <span class="hljs-comment">// v21</span>
  <span class="hljs-keyword">uint32_t</span> in_len;     <span class="hljs-comment">// nNumberOfBytesToRead</span>
  <span class="hljs-keyword">uint32_t</span> out_len;    <span class="hljs-comment">// v23</span>
} K7TS_REQ_HDR;</code></pre>
<p>&#xC608;&#xB97C;&#xB4E4;&#xBA74; <code>\\.\pipe\K7TSMngrService1</code>&#xB85C; &#xD1B5;&#xC2E0;&#xD558;&#xB824;&#xBA74;, &#xC694;&#xCCAD; &#xBC84;&#xD37C;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD6C;&#xC131;&#xD574;&#xC57C;&#xC9C0; &#xC5F0;&#xACB0;&#xC5D0; &#xC131;&#xACF5;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? &#xCF54;&#xB4DC;&#xB97C; &#xB72F;&#xC5B4;&#xBCF4;&#xBA74; &#xB300;&#xC0C1; &#xD30C;&#xC774;&#xD504; <code>\\.\pipe\K7TSMngrService1</code>&#xB97C; &#xC7A1;&#xC73C;&#xBA74;&#xC11C; <code>result = 0x4B375453(&apos;K7TS&apos;)</code>, <code>ver=0x1010</code>, <code>hdr_sz=28</code>, &#xADF8;&#xB9AC;&#xACE0; &#xC694;&#xCCAD; &#xD0C0;&#xC785;&#xACFC; &#xC785;&#xCD9C;&#xB825; &#xAE38;&#xC774;&#xB97C; <code>1mb</code>&#xB85C; &#xC81C;&#xD55C;&#xD55C; &#xB4A4;&#xC5D0;&#xB9CC; &#xC774;&#xD6C4;&#xC5D0; heap &#xBC84;&#xD37C;&#xB97C; &#xD560;&#xB2F9;&#xD574; <code>ReadFile</code>&#xB85C; &#xC694;&#xCCAD;&#xC744; &#xC218;&#xC2E0;&#xD558;&#xACE0;, &#xB0B4;&#xBD80; &#xB514;&#xC2A4;&#xD328;&#xCC98;&#xB85C; &#xB118;&#xACA8; &#xC751;&#xB2F5;&#xC744; &#xB9CC;&#xB4E0; &#xB2E4;&#xC74C;&#xC5D0; 36&#xBC14;&#xC774;&#xD2B8; &#xC751;&#xB2F5;&#xD5E4;&#xB354; + &#xC751;&#xB2F5; &#xBC14;&#xB514;&#xB97C; <code>WriteFile</code>&#xB85C; &#xBC18;&#xD658;&#xD558;&#xACE0; <code>DisconnectNamedPipe</code>, <code>CloseHandle</code>&#xB85C; &#xC138;&#xC158;&#xC744; &#xC885;&#xB8CC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xAC80;&#xC99D; &#xB8E8;&#xD2F4;&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xD30C;&#xC774;&#xD504;&#xC5D0; &#xC5F0;&#xACB0;&#xD574; &#xD1B5;&#xC2E0;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC911;&#xC694;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC54C;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image22.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC80;&#xC99D; &#xB8E8;&#xD2F4;&#xC744; &#xD655;&#xC778;&#xD588;&#xC73C;&#xB2C8; &#xC774;&#xC81C;&#xB294; &#xC544;&#xAE4C; &#xC124;&#xC815; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xBD24;&#xB358; &#xAC83;&#xCC98;&#xB7FC; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAD00;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xD5C8;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xAD8C;&#xD55C;&#xC774; &#xC911;&#xC694;&#xD55C; &#xB3D9;&#xC791;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xBB38;&#xC790;&#xC5F4; &#xCC38;&#xC870;&#xB97C; &#xB530;&#xB77C;&#xAC00;&#xBA74; <code>AdminNonAdminIsValid</code>, <code>AdminChangesNeedPassword</code>, <code>AdminEnableNeedVerification</code> &#xC774;&#xB7F0; &#xBB38;&#xC790;&#xC5F4;&#xB4E4;&#xC744; &#xD1B5;&#xD574;&#xC11C; <code>K7TS</code> &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xAC00; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xAE30;&#xBC18; &#xC815;&#xCC45; &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC9C1;&#xC811; &#xCC38;&#xC870;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xD30C;&#xC774;&#xD504; &#xC694;&#xCCAD; &#xD558;&#xB098;&#xB85C; SYSTEM &#xC11C;&#xBE44;&#xC2A4;&#xAC00; <code>HKLM</code>&#xC5D0; Write&#xB97C; &#xC218;&#xD589;&#xD558;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xAC80;&#xC99D;&#xC774; &#xCDA9;&#xBD84;&#xD788; &#xC81C;&#xD55C;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xC800;&#xD76C;&#xAC19;&#xC740; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; SYSTEM &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; Write&#xB97C; &#xD560; &#xC218; &#xC788;&#xB294; primitive&#xAC00; &#xB420; &#xC218; &#xC788;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image23.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; &#xC704;&#xC5D0;&#xC11C; &#xC54C;&#xC544;&#xB0B8; &#xC815;&#xBCF4;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xB85C; &#xC694;&#xCCAD;&#xC744; &#xC798; &#xBCF4;&#xB0B4;&#xBCF4;&#xACE0; Process Monitor &#xB85C;&#xADF8;&#xB97C; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xC5C8;&#xB294;&#xB370;&#xC694;. Named Pipe&#xB294; &#xC77C;&#xB2E8; IPC &#xC5D4;&#xB4DC;&#xD3EC;&#xC778;&#xD2B8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC;/<code>HKLM</code>, &#xC11C;&#xBE44;&#xC2A4; &#xC124;&#xC815;, &#xD30C;&#xC77C; &#xC77D;&#xAE30;/&#xC4F0;&#xAE30;, &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC2E4;&#xD589;&#xAC19;&#xC740; &#xBC14;&#xB00C;&#xB294; &#xC9C0;&#xC810;&#xC744; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC798; &#xD655;&#xC778;&#xC744; &#xD558;&#xB294;&#xAC8C; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C;&#xB4E4;&#xBA74; &#xC9C0;&#xAE08; ProcMon &#xB85C;&#xADF8;&#xB294; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xC778; &#xC81C;&#xAC00; &#xC785;&#xB825;&#xC744; &#xD1B5;&#xD574; &#xD30C;&#xC774;&#xD504; &#xC694;&#xCCAD;&#xC744; &#xC900; &#xD6C4;&#xC5D0;, SYSTEM &#xAD8C;&#xD55C; <code>K7TSMngr.exe</code>&#xAC00; <code>HKLM</code>&#xC5D0; &#xC4F0;&#xAE30; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xD2B9;&#xD788; &#xAD00;&#xB828; &#xD0A4;&#xC778; <code>AdminNonAdminIsValid</code>, <code>AdminChangesNeedPassword</code>, <code>AdminChangesPasswordHash</code> &#xAC19;&#xC740; &#xD544;&#xB4DC;&#xC5D0; write&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD574;&#xBCF4;&#xACE0; &#xBCF4;&#xBA74; &#xAD00;&#xB9AC;&#xC790; &#xAD8C;&#xD55C; &#xC694;&#xAD6C;, &#xBE44;&#xAD00;&#xB9AC;&#xC790; &#xD5C8;&#xC6A9;&#xAC19;&#xC740; &#xBCF4;&#xC548; &#xACBD;&#xACC4;&#xAC00; &#xD480;&#xB9B4; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image24.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xC81C; LPE&#xB97C; &#xD574;&#xBCF4;&#xBA74; &#xB418;&#xB294;&#xB370;&#xC694;. &#xC77C;&#xB2E8;&#xC740; &#xC77C;&#xBC18; &#xC0AC;&#xC6A9;&#xC790;&#xB85C; <code>\\.\pipe\K7TSMngrService1</code>&#xC5D0; &#xC5F0;&#xACB0; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xC11C; <code>K7TS</code> &#xD5E4;&#xB354;&#xC640; &#xB9E4;&#xC9C1; &#xD615;&#xC2DD;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4; SYSTEM&#xC774; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xC124;&#xC815; &#xAE30;&#xB2A5;&#xC744; &#xB300;&#xC2E0; &#xC124;&#xC815;&#xD558;&#xAC8C; &#xB9CC;&#xB4E0; &#xB4A4;&#xC5D0;, <code>HKLM</code> IFEO&#xB97C; &#xC368;&#xC11C; <code>HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\K7TSHlpr.exe</code> &#xC774; &#xD0A4;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAC70;&#xB85C; &#xB744;&#xC6B8;&#xB824;&#xACE0; &#xD558;&#xB294;&#xAC78; <code>cmd.exe /c C:\temp\payload.bat</code>&#xC73C;&#xB85C; &#xBC14;&#xAFD4;&#xCE58;&#xAE30;&#xD558;&#xBA74;..? LPE&#xAC00; &#xC131;&#xACF5;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;! <code>K7TSMngrService1</code> &#xD30C;&#xC774;&#xD504; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xC8FC;&#xCCB4;&#xB294; <code>K7TSMngr.exe</code>&#xC600;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xC774; &#xC548;&#xC5D0;&#xC11C; &#xB0B4;&#xBD80; &#xB3D9;&#xC791;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; <code>K7TSHlpr.exe</code> &#xBCF4;&#xC870; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAD8C;&#xD55C;&#xC774; &#xB192;&#xC740; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB85C; &#xC2E4;&#xD589;&#xB41C;&#xB2E4;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xACE0;, &#xC774;&#xAC78; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC6B0;&#xB9AC;&#xAC00; &#xC6D0;&#xD558;&#xB294; bat &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xC774;&#xC8E0;.   </p>
<p><img src="/2025/12/28/banda/WHS3-bughunting/ko/image25.png" srcset="/img/loading.gif" alt></p>
<p>&#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xD1B5;&#xD574; Local Group Memberships&#xC5D0;&#xC11C; &#xAD8C;&#xD55C;&#xC774; Administrators&#xAC00; &#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xB85C; &#xC774;&#xCC98;&#xB7FC; Named Pipe&#xC5D0;&#xC11C;&#xB294; &#xC8FC;&#xB85C; ACL, &#xAD8C;&#xD55C; &#xAC80;&#xC0AC; &#xBD80;&#xC7AC;, &#xBA54;&#xBAA8;&#xB9AC; &#xCDE8;&#xC57D;&#xC810;, &#xACBD;&#xB85C; &#xC870;&#xC791;, &#xB808;&#xC774;&#xC2A4;&#xCEE8;&#xB514;&#xC158;&#xAC19;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB2C8;.. &#xB9CE;&#xC740; &#xCC38;&#xACE0;&#xAC00; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!<br><br>  </p>
<h2 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h2><p>&#xD638;&#xD638;&#xD638;&#x2026;&#x1F98C;&#xC774;&#xBC88; &#xAE00;&#xC774; &#xC88B;&#xC740; &#xC5F0;&#xB9D0; &#xC120;&#xBB3C;&#xC774; &#xB418;&#xC5C8;&#xAE30;&#xB97C; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;! Kernel Driver, Named Pipe &#xC218;&#xC9D1;&#xACFC; &#xBD84;&#xC11D; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5EC;&#xB7EC;&#xBD84;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC124;&#xBA85;&#xD560; &#xB54C; &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xC608;&#xC804; cve&#xB4E4;&#xC744; &#xC0B4;&#xD3B4;&#xBD24;&#xC9C0;&#xB9CC; &#xAC80;&#xC99D;&#xC740; Win11 24H2 &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD55C; &#xC810;&#xC744; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xD2F0;&#xC5E0;&#xC544;&#xC774;&#xC778;&#xB370; &#xC0AC;&#xC2E4; &#xAE00;&#xC744; &#xC368;&#xBCF4;&#xB2E4;&#xBCF4;&#xBA74;&#xC11C; &#xD234;&#xB4E4;&#xC744; &#xC5F4;&#xC5B4;&#xBCF4;&#xB2E4;&#xBCF4;&#xB2C8;&#xAE4C; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD0C0;&#xAC9F;&#xC774; &#xB9C9; &#xB208;&#xC5D0; &#xB4E4;&#xC5B4;&#xC640;&#xC11C; &#xACC4;&#xC18D; &#xB534; &#xAE38;&#xB85C; &#xC0DC;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xD558;&#xD56B;  &#xB2E4;&#xC74C; &#xC2DC;&#xB9AC;&#xC988;&#xC5D0;&#xC11C;&#xB294; &#xC800;&#xD76C;&#xAC00; &#xCC3E;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xC18C;&#xAC1C;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://voidsec.com/windows-drivers-reverse-engineering-methodology/">Windows Driver RE Methodology (voidsec)</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.amd.com/en/resources/product-security/bulletin/amd-sb-6009.html">AMD-SB-6009: Radeon Graphics Kernel Driver Privilege Management</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://owasp.org/www-chapter-seoul/#div-pastevents">OWASP Seoul(2025.07) - Windows 3rd-Party Driver LPE BugHunting</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.quarkslab.com/k7-antivirus-named-pipe-abuse-registry-manipulation-and-privilege-escalation.html">K7 Antivirus Named Pipe Abuse &#x2192; Registry Manipulation</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/LPE/">LPE</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/BugHunting/">BugHunting</a>
                  
                  <a class="hover-with-bg" href="/tags/KernelDriver/">KernelDriver</a>
                  
                  <a class="hover-with-bg" href="/tags/NamedPipe/">NamedPipe</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_banda.jpg" srcset="/img/loading.gif" alt="banda">
                  </div>

                  <div class="link-text">
                    <div class="link-title">banda</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/banda">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/12/28/banda/WHS3-bughunting/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Windows LPE Bug Hunting, Served by the Teams Youngest: Part 1 (EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/12/27/Libera/CVE-2025-62215/">
                    <span class="hidden-mobile">[] CVE-2025-62215: Windows Kernel Race Condition  Double Free  LPE </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/12/28/banda/WHS3-bughunting/ko/';
        this.page.identifier = '/2025/12/28/banda/WHS3-bughunting/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]    Windows LPE   Part 1 (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
