

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://bugzilla.redhat.com/show_bug.cgi?id=2219266&#34;&gt;CVE-2023-2861 QEMU: 9pfs: improper access control on special files&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;qemu &amp;lt; 8.1.0&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;9pfs(9p passthrough filesystem)&amp;#xB294; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xB780; Plan 9 &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xACF5;&amp;#xC720;, IPC &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9;&amp;#xC9C0;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; 9p server&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; 9p client&amp;#xAC00; 9p transport driver&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 9p server&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2E4;&amp;#xC81C; &amp;#xCC98;&amp;#xB9AC;&amp;#xC5D0; 9p fs(filesystem) driver&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VFS(Virtual File System) &amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xCD9C;&amp;#xCC98;&amp;#xB098; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD; &amp;#xB4F1;&amp;#xC744; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/01/15/pwndorei/2024-01-15/image1.png&#34; alt=&#34;Image1&#34;&gt;&lt;/p&gt;
&lt;p&gt;9p &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xC740; qemu 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xAE30;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAD6C;&amp;#xD604;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xC758;&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&amp;#xC5D0; qemu&amp;#xC758; 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAE08;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Linux 9p Client&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; guest side&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;qemu&amp;#xC758; 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD1B5;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; 9pfs &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC7A5;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; 9p tree&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB450; &amp;#xC138;&amp;#xD305; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs routeros&#34;&gt;1. qemu&amp;#xB97C; root&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;amp; 9f local fs driver&amp;#xC640; passthrough security model &amp;#xC0AC;&amp;#xC6A9;
2. 9p&lt;span class=&#34;hljs-built_in&#34;&gt; proxy &lt;/span&gt;fs driver &amp;#xC0AC;&amp;#xC6A9;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; local fs(filesystem) driver&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; fs driver&amp;#xB85C; VFS(Virtual File System) &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &lt;code&gt;open&lt;/code&gt;, &lt;code&gt;read&lt;/code&gt;, &lt;code&gt;write&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. local fs driver&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xB9AC;&amp;#xB9F5;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xC720;&amp;#xC800;(root)&amp;#xAC00; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC16;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. qemu &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; proxy fs driver&amp;#xB294; proxy helper&amp;#xB77C;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; VFS &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. proxy helper &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC5EC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC7A5;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB09C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; qemu&amp;#xB97C; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD574;&amp;#xC9C0;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAD8C;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; proxy fs driver&amp;#xB294; qemu 8.1 &amp;#xBC84;&amp;#xC804; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; deprecate&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC5F4; &amp;#xB54C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &lt;a href=&#34;https://gitlab.com/qemu-project/qemu/-/commit/f6b0de53fb87ddefed348a39284c8e2f28dc4eda&#34;&gt;&amp;#xD328;&amp;#xCE58;&lt;/a&gt;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://wiki.qemu.org/Documentation/9p&#34;&gt;qemu 9p documentation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] CVE-2023-2861: qemu 9pfs 구현의 특수 파일에 대한 부적절한 접근 제어 - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://bugzilla.redhat.com/show_bug.cgi?id=2219266&#34;&gt;CVE-2023-2861 QEMU: 9pfs: improper access control on special files&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;qemu &amp;lt; 8.1.0&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;9pfs(9p passthrough filesystem)&amp;#xB294; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC774;&amp;#xB780; Plan 9 &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xACF5;&amp;#xC720;, IPC &amp;#xB4F1;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9;&amp;#xC9C0;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; 9p server&amp;#xC640; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; 9p client&amp;#xAC00; 9p transport driver&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xB85C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. 9p server&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC2E4;&amp;#xC81C; &amp;#xCC98;&amp;#xB9AC;&amp;#xC5D0; 9p fs(filesystem) driver&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; VFS(Virtual File System) &amp;#xB808;&amp;#xC774;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xCD9C;&amp;#xCC98;&amp;#xB098; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD; &amp;#xB4F1;&amp;#xC744; &amp;#xC720;&amp;#xC5F0;&amp;#xD558;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/01/15/pwndorei/2024-01-15/image1.png&#34; alt=&#34;Image1&#34;&gt;&lt;/p&gt;
&lt;p&gt;9p &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC758; &amp;#xAD6C;&amp;#xD604;&amp;#xC740; qemu 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC758; &amp;#xC77C;&amp;#xBD80;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xAE30;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xAD6C;&amp;#xD604;&amp;#xCCB4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; 9p &amp;#xD504;&amp;#xB85C;&amp;#xD1A0;&amp;#xCF5C;&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xC815;&amp;#xC758;&amp;#xB294; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30;&amp;#xC5D0; qemu&amp;#xC758; 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5F4;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAE08;&amp;#xC9C0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xC788;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Linux 9p Client&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; guest side&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC11C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;qemu&amp;#xC758; 9pfs &amp;#xAD6C;&amp;#xD604;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xD1B5;&amp;#xC81C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xC7A0;&amp;#xC7AC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC545;&amp;#xC758;&amp;#xC801;&amp;#xC778; 9pfs &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xC7A5;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; 9p tree&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xBC97;&amp;#xC5B4;&amp;#xB098;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC758; &amp;#xB450; &amp;#xC138;&amp;#xD305; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs routeros&#34;&gt;1. qemu&amp;#xB97C; root&amp;#xB85C; &amp;#xC2E4;&amp;#xD589; &amp;amp; 9f local fs driver&amp;#xC640; passthrough security model &amp;#xC0AC;&amp;#xC6A9;
2. 9p&lt;span class=&#34;hljs-built_in&#34;&gt; proxy &lt;/span&gt;fs driver &amp;#xC0AC;&amp;#xC6A9;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; local fs(filesystem) driver&amp;#xB294; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF4;&amp;#xD3B8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; fs driver&amp;#xB85C; VFS(Virtual File System) &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &lt;code&gt;open&lt;/code&gt;, &lt;code&gt;read&lt;/code&gt;, &lt;code&gt;write&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xC9C1;&amp;#xC811; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. local fs driver&amp;#xB294; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xB9AC;&amp;#xB9F5;&amp;#xD551;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAC8C;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC758; &amp;#xB192;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC218;&amp;#xC900;&amp;#xC758; &amp;#xC720;&amp;#xC800;(root)&amp;#xAC00; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC81C;&amp;#xC5B4;&amp;#xB97C; &amp;#xAC16;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. qemu &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; proxy fs driver&amp;#xB294; proxy helper&amp;#xB77C;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; VFS &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. proxy helper &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD638;&amp;#xC2A4;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC5EC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC7A5;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C; &amp;#xB4F1;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC97;&amp;#xC5B4;&amp;#xB09C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; qemu&amp;#xB97C; root &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xBCF4;&amp;#xC548; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xD574;&amp;#xC9C0;&amp;#xAE30;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xAD8C;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xACE0; &amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xC138;&amp;#xD305;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; proxy fs driver&amp;#xB294; qemu 8.1 &amp;#xBC84;&amp;#xC804; &amp;#xC774;&amp;#xD6C4;&amp;#xB85C; deprecate&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC5F4; &amp;#xB54C; &amp;#xD2B9;&amp;#xC218; &amp;#xD30C;&amp;#xC77C;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &lt;a href=&#34;https://gitlab.com/qemu-project/qemu/-/commit/f6b0de53fb87ddefed348a39284c8e2f28dc4eda&#34;&gt;&amp;#xD328;&amp;#xCE58;&lt;/a&gt;&amp;#xAC00; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://wiki.qemu.org/Documentation/9p&#34;&gt;qemu 9p documentation&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/01/15/pwndorei/2024-01-15/">

  <title>[하루한줄] CVE-2023-2861: qemu 9pfs 구현의 특수 파일에 대한 부적절한 접근 제어 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-01-15 18:00" pubdate>
      2024년 1월 15일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      962 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      19
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] CVE-2023-2861: qemu 9pfs 구현의 특수 파일에 대한 부적절한 접근 제어</h1>
            
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://bugzilla.redhat.com/show_bug.cgi?id=2219266">CVE-2023-2861 QEMU: 9pfs: improper access control on special files</a></p>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>qemu &lt; 8.1.0</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>9pfs(9p passthrough filesystem)&#xB294; 9p &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774;&#xB780; Plan 9 &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0;&#xC11C; &#xD30C;&#xC77C; &#xACF5;&#xC720;, IPC &#xB4F1;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC6D0;&#xACA9;&#xC9C0;&#xC758; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xAD6C;&#xD604;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB798;&#xC758; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; &#xD638;&#xC2A4;&#xD2B8;&#xC758; 9p server&#xC640; &#xAC8C;&#xC2A4;&#xD2B8;&#xC758; 9p client&#xAC00; 9p transport driver&#xB97C; &#xD1B5;&#xD574; 9p &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB85C; &#xD1B5;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;. 9p server&#xB294; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xC2E4;&#xC81C; &#xCC98;&#xB9AC;&#xC5D0; 9p fs(filesystem) driver&#xB97C; &#xD1B5;&#xD574; VFS(Virtual File System) &#xB808;&#xC774;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xC5D0; &#xD30C;&#xC77C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xB370;&#xC774;&#xD130;&#xC758; &#xCD9C;&#xCC98;&#xB098; &#xC2E4;&#xC81C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xBC29;&#xC2DD; &#xB4F1;&#xC744; &#xC720;&#xC5F0;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2024/01/15/pwndorei/2024-01-15/image1.png" srcset="/img/loading.gif" alt="Image1"></p>
<p>9p &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xAD6C;&#xD604;&#xC740; qemu 9pfs &#xAD6C;&#xD604;&#xC758; &#xC77C;&#xBD80;&#xAC00; &#xC544;&#xB2C8;&#xAE30;&#xC5D0; &#xB2E4;&#xC591;&#xD55C; &#xAD6C;&#xD604;&#xCCB4;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; 9p &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xB824;&#xACE0; &#xD560; &#xB54C; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xC815;&#xC758;&#xB294; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xAE30;&#xC5D0; qemu&#xC758; 9pfs &#xAD6C;&#xD604;&#xC5D0;&#xC11C;&#xB294; &#xD638;&#xC2A4;&#xD2B8; &#xCE21;&#xC5D0;&#xC11C; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC774; &#xC5F4;&#xB9AC;&#xB294; &#xAC83;&#xC744; &#xAE08;&#xC9C0;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Linux 9p Client&#xC640; &#xAC19;&#xC740; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xC791;&#xC5C5;&#xC744; guest side&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xC9C0;&#xB9CC; &#xC545;&#xC758;&#xC801;&#xC778; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC774; &#xC5F4;&#xC5B4;&#xC11C; &#xC791;&#xC5C5;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>qemu&#xC758; 9pfs &#xAD6C;&#xD604;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xC811;&#xADFC;&#xC744; &#xD1B5;&#xC81C;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xC545;&#xC758;&#xC801;&#xC778; 9pfs &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC7A5;&#xCE58; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC81C;&#xACF5;&#xB41C; 9p tree&#xB85C;&#xBD80;&#xD130; &#xBC97;&#xC5B4;&#xB098;&#xB294; &#xAC83;&#xC744; &#xD5C8;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC544;&#xB798;&#xC758; &#xB450; &#xC138;&#xD305; &#xC911; &#xD558;&#xB098;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs routeros">1. qemu&#xB97C; root&#xB85C; &#xC2E4;&#xD589; &amp; 9f local fs driver&#xC640; passthrough security model &#xC0AC;&#xC6A9;
2. 9p<span class="hljs-built_in"> proxy </span>fs driver &#xC0AC;&#xC6A9;</code></pre>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC138;&#xD305;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; local fs(filesystem) driver&#xB294; &#xAC00;&#xC7A5; &#xBCF4;&#xD3B8;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; fs driver&#xB85C; VFS(Virtual File System) &#xD568;&#xC218;&#xB97C; &#xD638;&#xC2A4;&#xD2B8;&#xC758; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; <code>open</code>, <code>read</code>, <code>write</code> &#xB4F1;&#xC758; &#xD568;&#xC218;&#xC5D0; &#xC9C1;&#xC811; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. local fs driver&#xB294; &#xD638;&#xC2A4;&#xD2B8; &#xCE21; &#xD30C;&#xC77C;&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xB9AC;&#xB9F5;&#xD551;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xAC8C;&#xC2A4;&#xD2B8;&#xC758; &#xB192;&#xC740; &#xAD8C;&#xD55C; &#xC218;&#xC900;&#xC758; &#xC720;&#xC800;(root)&#xAC00; &#xD638;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB300;&#xD55C; &#xBAA8;&#xB4E0; &#xC81C;&#xC5B4;&#xB97C; &#xAC16;&#xC9C0; &#xBABB;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. qemu &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; root &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD574;&#xC11C; &#xCDE8;&#xC57D;&#xD55C; &#xD658;&#xACBD;&#xC744; &#xB9CC;&#xB4E4; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB450; &#xBC88;&#xC9F8; &#xC138;&#xD305;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; proxy fs driver&#xB294; proxy helper&#xB77C;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC758;&#xD574; VFS &#xD568;&#xC218;&#xB4E4;&#xC774; &#xD638;&#xCD9C;&#xB429;&#xB2C8;&#xB2E4;. proxy helper &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; root &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD638;&#xC2A4;&#xD2B8; &#xCE21;&#xC5D0; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC744; root &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xD558;&#xAC70;&#xB098; &#xC5EC;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xBA74; &#xC7A5;&#xCE58; &#xD30C;&#xC77C; &#xB4F1;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC81C;&#xACF5;&#xB41C; &#xD30C;&#xC77C; &#xD2B8;&#xB9AC;&#xB97C; &#xBC97;&#xC5B4;&#xB09C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xC138;&#xD305;&#xC5D0;&#xC11C; qemu&#xB97C; root &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBCF4;&#xC548; &#xCE21;&#xBA74;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xD574;&#xC9C0;&#xAE30;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xAD8C;&#xACE0;&#xD558;&#xACE0; &#xC788;&#xACE0; &#xB450; &#xBC88;&#xC9F8; &#xC138;&#xD305;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; proxy fs driver&#xB294; qemu 8.1 &#xBC84;&#xC804; &#xC774;&#xD6C4;&#xB85C; deprecate&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xAC70;&#xB098; &#xC5F4; &#xB54C; &#xD2B9;&#xC218; &#xD30C;&#xC77C;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xB8E8;&#xD2F4;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://gitlab.com/qemu-project/qemu/-/commit/f6b0de53fb87ddefed348a39284c8e2f28dc4eda">&#xD328;&#xCE58;</a>&#xAC00; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://wiki.qemu.org/Documentation/9p">qemu 9p documentation</a></li>
</ul>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/pwndorei/">pwndorei</a>
                  
                  <a class="hover-with-bg" href="/tags/qemu/">qemu</a>
                  
                  <a class="hover-with-bg" href="/tags/9pfs/">9pfs</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_pwndorei.jpg" srcset="/img/loading.gif" alt="pwndorei">
                  </div>

                  <div class="link-text">
                    <div class="link-title">pwndorei</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/pwndorei">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/01/18/ogu123/cve-2023-2033/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2023-2033: V8 엔진에서 발생하는 Type Confusion 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/01/11/l0ch/2024-01-11/">
                    <span class="hidden-mobile">[하루한줄] CVE-2023-48702: jellyfin의 UNC 경로를 통한 원격 코드 실행 취약점</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/01/15/pwndorei/2024-01-15/';
        this.page.identifier = '/2024/01/15/pwndorei/2024-01-15/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] CVE-2023-2861: qemu 9pfs 구현의 특수 파일에 대한 부적절한 접근 제어&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
