

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; :D&lt;br&gt;7&amp;#xC6D4; 1&amp;#xC77C;, &amp;#xC6D4;&amp;#xC694;&amp;#xC77C;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;!&lt;br&gt;&amp;#xC660;&amp;#xC9C0; &amp;#xB7ED;&amp;#xD0A4;&amp;#xBE44;&amp;#xD0A4;&amp;#xD55C; 7&amp;#xC6D4;&amp;#xC774; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; KT, &amp;#xC870;&amp;#xC9C1;&amp;#xC801; &amp;#xD574;&amp;#xD0B9;&amp;#xD300; &amp;#xAFB8;&amp;#xB824; &amp;#xD1B5;&amp;#xC2E0;&amp;#xB9DD; &amp;#xAC10;&amp;#xCCAD;&amp;#xB7;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD3EC; &amp;#xC758;&amp;#xD639;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.24 | JTBC | &lt;a href=&#34;https://www.youtube.com/watch?v=qaF0NSLZ4cU&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt; | &lt;a href=&#34;https://www.youtube.com/watch?v=qaF0NSLZ4cU&#34;&gt;&amp;#xC601;&amp;#xC0C1;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;https://img.youtube.com/vi/qaF0NSLZ4cU/0.jpg&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC601;&amp;#xC0C1;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xD654;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xACE0;&amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xAC74;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;KT&amp;#xAC00; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xD639;&amp;#xC740; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D;(&amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; &amp;#xC7AC;&amp;#xC0DD;) &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1;&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xD654;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#x2018;&lt;strong&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#x2018; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD1B5;&amp;#xC2E0; &amp;#xC7A5;&amp;#xC560;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A8; &amp;#xD610;&amp;#xC758;&amp;#xB85C; &amp;#xACBD;&amp;#xCC30; &amp;#xC218;&amp;#xC0AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC57D; 4&amp;#xB144; &amp;#xC804;&amp;#xC778; 2020&amp;#xB144; &amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; 2020&amp;#xB144; 5&amp;#xC6D4; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC218;&amp;#xC2ED; &amp;#xACF3;&amp;#xC774; &amp;#xBA39;&amp;#xD1B5;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB358; &amp;#xAC70; &amp;#xC544;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;KT&amp;#xAC00; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5D0; &amp;#xACE0;&amp;#xC758;&amp;#xB85C; &amp;#xC7A5;&amp;#xC560;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A8;&amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694; &amp;#x1F631; &amp;#xC57D; 60&amp;#xB9CC; &amp;#xBA85;&amp;#xC5D0; &amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC774;&amp;#xC6A9; &amp;#xC2DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC624;&amp;#xB958;&amp;#xB97C; &amp;#xACAA;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; KT&amp;#xAC00; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &amp;#x2018;&amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#x2019;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xD639;&amp;#xB3C4; &amp;#xC81C;&amp;#xAE30;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xACBD;&amp;#xCC30;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC1D;&amp;#xD600;&amp;#xC9C4; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD55C; &amp;#xACF3;&amp;#xC740; &amp;#xB2E4;&amp;#xB984; &amp;#xC544;&amp;#xB2CC; KT&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC13C;&amp;#xD130; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; &amp;#xBD84;&amp;#xB2F9; IDC &amp;#xC13C;&amp;#xD130;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC218;&amp;#xC2ED; &amp;#xACF3;&amp;#xC5D0; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. KT&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC77C;&amp;#xBD80; &amp;#xACE0;&amp;#xAC1D;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#x2018;&amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#x2019;&amp;#xB97C; &amp;#xC2EC;&amp;#xC740; &amp;#xC148;&amp;#xC778;&amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xB54C; &lt;strong&gt;&amp;#x2018;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;&amp;#xACFC;, &lt;strong&gt;&amp;#x2018;&amp;#xC720;&amp;#xD3EC;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; KT &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB294; &lt;strong&gt;&amp;#x2018;&amp;#xAC10;&amp;#xCCAD;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xC5EC; &amp;#xD300;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; KT&amp;#xAC00; &amp;#xBC14;&amp;#xAFBC; &amp;#xC758;&amp;#xD639;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; KT &amp;#xCE21;&amp;#xC740; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC5B4;&amp;#xCA54; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC744; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;KT &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC13C;&amp;#xD130;&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xBCF8;&amp;#xC0AC;&lt;/strong&gt;&amp;#xB97C; &amp;#xCC28;&amp;#xB840;&amp;#xB85C; &amp;#xC555;&amp;#xC218;&amp;#xC218;&amp;#xC0C9;&amp;#xC744; &amp;#xD55C; &amp;#xACBD;&amp;#xAE30;&amp;#xB0A8;&amp;#xBD80;&amp;#xCCAD;&amp;#xC740; &lt;strong&gt;KT&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0;&amp;#xBE44;&amp;#xBC00;&amp;#xBCF4;&amp;#xD638;&amp;#xBC95;&amp;#xACFC; &amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xB9DD;&amp;#xBC95; &amp;#xB4F1;&amp;#xC744; &amp;#xC704;&amp;#xBC18;&lt;/strong&gt;&amp;#xD588;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC218;&amp;#xC0AC;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F46E;&lt;/p&gt;
&lt;p&gt;KT&amp;#xB294; &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC640; &amp;#xAC08;&amp;#xB4F1;&amp;#xC744; &amp;#xBE5A;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC9C0;&amp;#xB09C; 2015&amp;#xB144; &amp;#xAC00;&amp;#xC785;&amp;#xC790;&amp;#xC6A9; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xD68C;&amp;#xC120;&amp;#xC758; &amp;#xC0C1;&amp;#xC5C5;&amp;#xC6A9; &amp;#xC774;&amp;#xC6A9;&amp;#xC744; &amp;#xAE08;&amp;#xC9C0;&amp;#xD55C; &amp;#xC774;&amp;#xC6A9;&amp;#xC57D;&amp;#xAD00;&amp;#xC5D0; &amp;#xC704;&amp;#xBC30;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC6A9; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC11C;&amp;#xBC84;&amp;#xC758; IP&amp;#xB9CC;&amp;#xC744; &amp;#xACE8;&amp;#xB77C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xACBD;&amp;#xCC30;&amp;#xC740; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 11&amp;#xC6D4; KT &amp;#xC9C1;&amp;#xC6D0;&amp;#xACFC; KT &amp;#xB2F9;&amp;#xC2DC; &amp;#xD611;&amp;#xB825;&amp;#xC5C5;&amp;#xCCB4; &amp;#xC9C1;&amp;#xC6D0; &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; 13&amp;#xBA85;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD574; &amp;#xAC80;&amp;#xCC30;&amp;#xC5D0; &amp;#xC1A1;&amp;#xCE58;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xD1B5;&amp;#xC2E0;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xB7;&amp;#xAC10;&amp;#xB3C5;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;&amp;#xB294; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 9&amp;#xC6D4; &amp;#xC774; &amp;#xC0AC;&amp;#xC548;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC218;&amp;#xC0AC;&amp;#xC911;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC870;&amp;#xCE58;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC78;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.. &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC9C0; &amp;#xB274;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACC4;&amp;#xC18D; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD574;&amp;#xC694;~&amp;#x1F425;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;&amp;#xC6D0;&amp;#xD074;&amp;#xB9AD;&amp;#x2019; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&amp;#x2026; &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC678;&amp;#xAD6D;&amp;#xC778;&amp;#xC774;&amp;#xB77C; &amp;#xBCF4;&amp;#xC0C1; &amp;#xC5C6;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.28 | &amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xD0C0;&amp;#xC784;&amp;#xC2A4; | &lt;a href=&#34;https://m.dt.co.kr/contents.html?article_no=2024062802109931081012&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;&amp;#xC6D0;&amp;#xD074;&amp;#xB9AD;&amp;#x2019; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD574; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC740; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD6D4;&amp;#xCCD0;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026;&amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1; 10.4.3 &amp;#xBC84;&amp;#xC804;&amp;#xC758; &lt;strong&gt;&amp;#xB525;&amp;#xB9C1;&amp;#xD06C; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6F9;&amp;#xBDF0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, HTTP &amp;#xC694;&amp;#xCCAD; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;strong&gt;&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&amp;#xC744;&lt;/strong&gt; &lt;strong&gt;&amp;#xC720;&amp;#xCD9C;&lt;/strong&gt;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xACE0; &amp;#xCC44;&amp;#xD305; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2023-51219&#34;&gt;CVE-2023-51219&lt;/a&gt;&amp;#xB85C; &amp;#xBA85;&amp;#xBA85;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://stulle123.github.io/posts/kakaotalk-account-takeover/&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC740; &amp;#xC790;&amp;#xC0AC; &amp;#xC6F9;&amp;#xACFC; &amp;#xC571; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xBC1C;&amp;#xAD74;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;! &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;, &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCE74;&amp;#xCE74;&amp;#xC624; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD574; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4;&amp;#xC640; &amp;#xBC1C;&amp;#xAD74; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4; &amp;#xB4F1;&amp;#xC744; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC80;&amp;#xD1A0;&amp;#xD574; &amp;#xCD5C;&amp;#xC18C; 5&amp;#xB9CC; &amp;#xC6D0;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xB300; 1,000&amp;#xB9CC; &amp;#xC6D0;&amp;#xC758; &amp;#xD3EC;&amp;#xC0C1;&amp;#xAE08;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC9C0;&amp;#xAE09;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC678; &amp;#xAC70;&amp;#xC8FC;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C;&amp;#xC815;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xB294; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 12&amp;#xC6D4; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xC5D0; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xD55C;&amp;#xAD6D; &amp;#xAD6D;&amp;#xC801;&amp;#xC790;&amp;#xB9CC; &amp;#xD3EC;&amp;#xC0C1;&amp;#xAE08;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xBCF4;&amp;#xC0C1;&amp;#xB3C4; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F972; &lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xAC00; &amp;#xAE43;&amp;#xD5C8;&amp;#xBE0C;&amp;#xC5D0; &amp;#xAE00;&amp;#xC744; &amp;#xAC8C;&amp;#xC2DC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD654;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;, &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC774; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC778; &amp;#xB9CC;&amp;#xD07C; &amp;#xC5B4;&amp;#xCA54; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xACAC;&amp;#xB3C4; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xD55C;&amp;#xD3B8;, &amp;#xD574;&amp;#xC678;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xACB0;&amp;#xAD6D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC545;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC6B0;&amp;#xB824;&amp;#xB3C4; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C;, &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC9C4;&amp;#xD765;&amp;#xC6D0;(KISA)&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; &amp;#xC5ED;&amp;#xC2DC; &amp;#xCC38;&amp;#xAC00; &amp;#xB300;&amp;#xC0C1;&amp;#xC744; &amp;#xAD6D;&amp;#xB0B4;, &amp;#xC678; &amp;#xAC70;&amp;#xC8FC;&amp;#xD558;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD574;&amp;#xC678; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC5D0; &amp;#xAD6D;&amp;#xC801; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70;, &amp;#xAD6D;&amp;#xB0B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0BC;&amp;#xC131; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131; &amp;#xBCF4;&amp;#xACE0; &amp;#xBCF4;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xAC70;&amp;#xC8FC;&amp;#xC790;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xC758; &amp;#xAD6D;&amp;#xC801;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F62E;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xBBF8;&amp;#xB798; &amp;#xAD6D;&amp;#xBC29; &amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800;&amp;#xB85C;&amp;#x2026;&amp;#x2018;&amp;#xBBFC;&amp;#xAD00;&amp;#xAD70; &amp;#xC591;&amp;#xC790;&amp;#xC815;&amp;#xBCF4;&amp;#xD611;&amp;#xC758;&amp;#xD68C;&amp;#x2019; &amp;#xACF5;&amp;#xC2DD; &amp;#xCD9C;&amp;#xBC94;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.27 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157257&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC591;&amp;#xC790; &amp;#xACFC;&amp;#xD559; &amp;#xAE30;&amp;#xC220;! &amp;#xB2E4;&amp;#xB4E4; &amp;#xD55C;&amp;#xBC88;&amp;#xC529;&amp;#xC740; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694; &amp;#x1F600; &lt;/p&gt;
&lt;p&gt;&amp;#xC591;&amp;#xC790; &amp;#xACFC;&amp;#xD559; &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xB780; &amp;#xC591;&amp;#xC790;&amp;#xC5ED;&amp;#xD559;&amp;#xC801; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xC774;&amp;#xB860;&amp;#xC801; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xB3CC;&amp;#xD30C;&amp;#xD558;&amp;#xB294; &amp;#xCD08;&amp;#xC815;&amp;#xBC00; &amp;#xACC4;&amp;#xCE21;(&amp;#xC591;&amp;#xC790;&amp;#xC13C;&amp;#xC11C;), &amp;#xC591;&amp;#xC790;&amp;#xAE30;&amp;#xAE30;&amp;#xAC04; &amp;#xCD08;&amp;#xC2E0;&amp;#xB8B0;&amp;#xC5F0;&amp;#xACB0;(&amp;#xC591;&amp;#xC790;&amp;#xD1B5;&amp;#xC2E0;), &amp;#xCD08;&amp;#xACE0;&amp;#xC18D;&amp;#xC5F0;&amp;#xC0B0;(&amp;#xC591;&amp;#xC790;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;)&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC815;&amp;#xBD80;&amp;#xB294; &amp;#xD070; &amp;#xD30C;&amp;#xAE09;&amp;#xB825;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC744; 3&amp;#xB300; &amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xC778;&amp;#xB825;&amp;#xC744; &amp;#xC721;&amp;#xC131;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xB294; &amp;#xAD6D;&amp;#xBC29;&amp;#xAE30;&amp;#xC220;&amp;#xC804;&amp;#xB7B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; 14&amp;#xB300; &amp;#xAD6D;&amp;#xBC29; &amp;#xD575;&amp;#xC2EC;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC120;&amp;#xC815;(2023&amp;#xB144;)&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC601;&amp;#xAD6D;&amp;#xB3C4; &amp;#xAD6D;&amp;#xAC00;&amp;#xC591;&amp;#xC790;&amp;#xC804;&amp;#xB7B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xC13C;&amp;#xC11C;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29;&amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;(2023&amp;#xB144;)&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xBA70;, &amp;#xD504;&amp;#xB791;&amp;#xC2A4;&amp;#xB294; &amp;#xC591;&amp;#xC790;&amp;#xD56D;&amp;#xBC95;&amp;#xC758; &amp;#xD574;&amp;#xAD70; &amp;#xC218;&amp;#xC0C1; &amp;#xD568;&amp;#xC815; &amp;#xC801;&amp;#xC6A9;&amp;#xACC4;&amp;#xD68D;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;(2022&amp;#xB144;)&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD574;&amp;#xC678; &amp;#xC8FC;&amp;#xC694;&amp;#xAD6D;&amp;#xC740; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC; &amp;#xC815;&amp;#xBD80;&amp;#xB3C4; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xBD84;&amp;#xC57C; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xC9C0;&amp;#xC18D;&amp;#xD574; &amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB294; &amp;#xC791;&amp;#xB144; &amp;#x2018;&amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC758; 7&amp;#xB300; &amp;#xCD94;&amp;#xC9C4; &amp;#xBC29;&amp;#xD5A5; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;&amp;#x2018;&amp;#xAD6D;&amp;#xBC29;&amp;#xB7;&amp;#xC548;&amp;#xBCF4; &amp;#xB3C4;&amp;#xC785; &amp;#xCD94;&amp;#xC9C4;&amp;#x2019;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xB294; &amp;#xC791;&amp;#xB144; 10&amp;#xB300; &amp;#xAD6D;&amp;#xBC29;&amp;#xC804;&amp;#xB7B5;&amp;#xAE30;&amp;#xC220; &amp;#xC911;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xC801;&amp;#xC6A9;&amp;#xC131;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB294; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xC640; &amp;#xACF5;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C;, &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD84;&amp;#xC57C; &amp;#xC801;&amp;#xC6A9;&amp;#xB7;&amp;#xD655;&amp;#xC0B0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#x2018;&lt;strong&gt;&amp;#xBBFC;&amp;#xAD00;&amp;#xAD70; &amp;#xC591;&amp;#xC790;&amp;#xC815;&amp;#xBCF4;&amp;#xD611;&amp;#xC758;&amp;#xD68C;&amp;#x2018;&lt;/strong&gt;&amp;#xB97C; 6&amp;#xC6D4; 27&amp;#xC77C; &amp;#xCD9C;&amp;#xBC94;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; 2024&amp;#xB144; 4&amp;#xC6D4; &amp;#xCCB4;&amp;#xACB0;&amp;#xD55C; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB7;&amp;#xAD6D;&amp;#xBC29;&amp;#xBD80; &amp;#xC7A5;&amp;#xAD00;&amp;#xAC04; &amp;#xAD6D;&amp;#xBC29;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xD611;&amp;#xB825; MOU &amp;#xD6C4;&amp;#xC18D;&amp;#xC870;&amp;#xCE58;&amp;#xB85C;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xBC1C;&amp;#xACFC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xCC3D;&amp;#xCD9C;, &amp;#xAD6D;&amp;#xBC29;&amp;#xD601;&amp;#xC2E0;&amp;#xC758; &amp;#xC120;&amp;#xC21C;&amp;#xD658; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xAE30;&amp;#xC5EC;&amp;#xD560; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB300;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F632;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xD0B9;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC885; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC7A5; &amp;#x1F631;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156885&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD5C9; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB77C;&amp;#xB2C8;&amp;#xC694; &amp;#x1F631;&amp;#x1F630;&amp;#x1F628;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&lt;strong&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;(DISGOMOJI)&lt;/strong&gt;&amp;#x2018;&amp;#xB77C;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xBA70;, &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;(Discord)&amp;#xC640; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xBA85;&amp;#xB839; &amp;#xBC0F; &amp;#xC81C;&amp;#xC5B4;(C2) &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xC7A5;&amp;#xCE58;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC778; discord-c2&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; C2 &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC18; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC694;. &amp;#xC544;&amp;#xD649; &amp;#xAC1C;&amp;#xC758; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xBA70;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC258; &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;, &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7; &amp;#xCD2C;&amp;#xC601;, &amp;#xD30C;&amp;#xC77C; &amp;#xD0C8;&amp;#xCDE8; &amp;#xB4F1;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026; &amp;#xC815;&amp;#xB9D0; &amp;#xCC3D;&amp;#xC758;&amp;#xC801;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;1) &amp;#x1F3C3;&amp;#x200D;&amp;#x2642;&amp;#xFE0F; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xBA85;&amp;#xB839; &amp;#xC218;&amp;#xD589;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC544;&amp;#xADDC;&amp;#xBA3C;&amp;#xD2B8;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;2) &amp;#x1F4F8; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;3) &amp;#x1F447; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xC544; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;4) &amp;#x261D;&amp;#xFE0F; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2EC;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5) &amp;#x1F449; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC6D0;&amp;#xACA9; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778; &amp;#xC624;&amp;#xC2DC;(Oshi)&amp;#xB85C; &amp;#xC62E;&amp;#xAE34;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;6) &amp;#x1F448; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC6D0;&amp;#xACA9; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778; &amp;#xD2B8;&amp;#xB79C;&amp;#xC2A4;&amp;#xD37C;(transfer.sh)&amp;#xB85C; &amp;#xC62E;&amp;#xAE34;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;7) &amp;#x1F525; : &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;8) &amp;#x1F98A; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44; &amp;#xB0B4; &amp;#xD30C;&amp;#xC774;&amp;#xC5B4;&amp;#xD3ED;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC555;&amp;#xCD95;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;9) &amp;#x1F480; : &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC774; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xACC4; &amp;#xBAA8;&amp;#xC591; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB0B4;&amp;#xBCF4;&amp;#xB0B4;&amp;#xC5B4;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#x201C;&amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC798; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#x201D;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xCD08;&amp;#xB85D;&amp;#xC0C9; &amp;#xB124;&amp;#xBAA8; &amp;#xBC15;&amp;#xC2A4;&amp;#xC5D0; &amp;#xCCB4;&amp;#xD06C; &amp;#xD45C;&amp;#xC2DC;&amp;#xAC00; &amp;#xB41C; &amp;#xBAA8;&amp;#xC591;&amp;#xC758; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1FAE0;&amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD30C;&amp;#xD0A4;&amp;#xC2A4;&amp;#xD0C4; &amp;#xD574;&amp;#xD0B9; &amp;#xADF8;&amp;#xB8F9; &lt;strong&gt;UTA0137&lt;/strong&gt;&amp;#xC774; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xD30C;&amp;#xD0A4;&amp;#xC2A4;&amp;#xD0C4; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC790;&amp;#xC8FC; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC778;&amp;#xB3C4;&amp;#xC758; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC740; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xAE30;&amp;#xBC18; &amp;#xB370;&amp;#xC2A4;&amp;#xD06C;&amp;#xD1B1;&amp;#xC744; &amp;#xC5C5;&amp;#xBB34;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB9C8;&amp;#xCE68; &amp;#xC774; &amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4; UPX&amp;#xB85C; &amp;#xD328;&amp;#xD0B9;&amp;#xB41C; ELF &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD53C;&amp;#xC2F1; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.volexity.com/blog/2024/06/13/disgomoji-malware-used-to-target-indian-government/&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; OpenAI, &amp;#xC911;&amp;#xAD6D;, &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;, &amp;#xC774;&amp;#xB780; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; ChatGPT &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC911;&amp;#xB2E8;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.26 | bankinfosecurity | &lt;a href=&#34;https://www.bankinfosecurity.com/openai-drops-chatgpt-access-for-users-in-china-russia-iran-a-25631&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#xC640; &amp;#xC911;&amp;#xAD6D;, &amp;#xC774;&amp;#xB780; &amp;#xB4F1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC9C0;&amp;#xC6D0; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC678;&amp;#xB41C; &amp;#xAD6D;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; 7&amp;#xC6D4; 9&amp;#xC77C; &amp;#xC774;&amp;#xD6C4; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xB85C; &amp;#xD1B5;&amp;#xBCF4;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xC624;&amp;#xD508;AI &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0; &amp;#xD3EC;&amp;#xB7FC;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&amp;#xC790;&amp;#xC0AC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xADC0;&amp;#xC0AC; API &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC774; &amp;#xD604;&amp;#xC7AC; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB2E4;&amp;#xBA70; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC640; &amp;#xC9C0;&amp;#xC5ED; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBC1D;&amp;#xD788;&amp;#xACE0; 7&amp;#xC6D4; 9&amp;#xC77C;&amp;#xBD80;&amp;#xD130; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC640; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; API &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00; &amp;#xC870;&amp;#xCE58;&amp;#xB97C; &amp;#xCDE8;&amp;#xD560; &amp;#xAC83;&amp;#x2019; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xAC1C; &amp;#xB41C; &lt;a href=&#34;https://platform.openai.com/docs/supported-countries&#34;&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBAA9;&amp;#xB85D;&lt;/a&gt;&amp;#xC5D0;&amp;#xB294; &amp;#xBBF8;&amp;#xAD6D;, &amp;#xCE90;&amp;#xB098;&amp;#xB2E4;, EU &amp;#xAD6D;&amp;#xAC00;, &amp;#xC544;&amp;#xC2DC;&amp;#xC544;, &amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC77C;&amp;#xBD80; &amp;#xB4F1; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xB9CE;&amp;#xC740; &amp;#xAD6D;&amp;#xAC00;&amp;#xB294; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;&amp;#xC911;&amp;#xAD6D;, &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;, &amp;#xBD81;&amp;#xD55C;, &amp;#xC774;&amp;#xB780;&lt;/strong&gt; &amp;#xB4F1; &amp;#xC77C;&amp;#xBD80; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xB3C4;&amp;#xC5D0;&amp;#xC120; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xC911;&amp;#xAD6D;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; 4&amp;#xAC1C;&amp;#xAD6D;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD55C; &amp;#xAC74; &amp;#xBBF8;&amp;#xAD6D;&amp;#xACFC; &amp;#xC911;&amp;#xAD6D;&amp;#xAC04; &amp;#xAE34;&amp;#xC7A5;&amp;#xC774; &amp;#xACE0;&amp;#xC870;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xC9C0;&amp;#xB09C; 2&amp;#xC6D4; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB41C; &amp;#xC774; &lt;a href=&#34;https://www.aitimes.com/news/articleView.html?idxno=157207&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&amp;#xAC00; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCCE4;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758;-&amp;#xD558;&amp;#xB8E8;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758;-&amp;#xD558;&amp;#xB8E8;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758; &amp;#xD558;&amp;#xB8E8; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758; &amp;#xD558;&amp;#xB8E8; &amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xC6D4;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157113&#34;&gt;&amp;#xBCF4;&amp;#xC548;&amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC548;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xD615; &amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xB798;&amp;#xD2C0; RAT&amp;#x2026;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC8FC;&amp;#xC758;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB798;&amp;#xD2C0; RAT&amp;#xB294; &amp;#xAD6C;&amp;#xD615; &amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xACA8;&amp;#xB0E5;&amp;#xD55C; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xC6D0;&amp;#xACA9; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD2B8;&amp;#xB85C;&amp;#xC774; &amp;#xBAA9;&amp;#xB9C8;&amp;#xB85C;, &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC653;&amp;#xCE20;&amp;#xC571; &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC0B0;&amp;#xB418;&amp;#xBA70; &amp;#xD30C;&amp;#xC77C; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xC704;&amp;#xCE58; &amp;#xCD94;&amp;#xC801; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; APK&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xD654;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157168&amp;amp;page=3&amp;amp;total=102987&#34;&gt;&amp;#xD504;&amp;#xB808;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC0F5; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xBAA8;&amp;#xB4C8; &amp;#xBCF4;&amp;#xC548;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xC2E0;&amp;#xC6A9;&amp;#xCE74;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC911;&amp;#x2026;&amp;#xC8FC;&amp;#xC758;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC1FC;&amp;#xD551;&amp;#xBAB0;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xD504;&amp;#xB808;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC0F5;(PrestaShop)&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC778; pkfacebook&amp;#xC5D0;&amp;#xC11C; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB410;&amp;#xB2E4;. SQL &amp;#xC778;&amp;#xC81D;&amp;#xC158;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xC790;&amp;#xC0C1;&amp;#xAC70;&amp;#xB798; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCE74;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD0A4;&amp;#xBA38;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xC6A9;&amp;#xCE74;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. (&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-36680&#34;&gt;CVE-2024-36680&lt;/a&gt;)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xC218;&lt;/strong&gt; | &lt;a href=&#34;https://m.boannews.com/html/detail.html?tab_type=1&amp;amp;idx=130809&#34;&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9; &amp;#xC704;&amp;#xD611; 5&amp;#xAC00;&amp;#xC9C0;&amp;#x2026; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xAE08;&amp;#xC804; &amp;#xD0C8;&amp;#xCDE8; &amp;#xBAA9;&amp;#xC801;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCE68;&amp;#xD574;&amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC9C4;&amp;#xD765;&amp;#xC6D0;(&amp;#xC774;&amp;#xD558; KISA)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; 2020&amp;#xB144; 630&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; 2021&amp;#xB144; 640&amp;#xAC74;, 2022&amp;#xB144; 1142&amp;#xAC74;, 2023&amp;#xB144; 1,227&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xAE09;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xCD94;&amp;#xC138;&amp;#xB2E4;. &amp;#xAE08;&amp;#xC804;&amp;#xD0C8;&amp;#xCDE8; &amp;#xBAA9;&amp;#xC801;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC0B0;&amp;#xC5C5;&amp;#xAD70;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC758;&amp;#xB8CC; 98%, &amp;#xC81C;&amp;#xC870; 96%, &amp;#xAD50;&amp;#xC721; 92%, &amp;#xC815;&amp;#xBD80;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; 68% &amp;#xC21C;&amp;#xC73C;&amp;#xB85C; &amp;#xC9D1;&amp;#xACC4;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xBAA9;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157256&#34;&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC8FC;&amp;#xBB38;&amp;#x2027;&amp;#xBC30;&amp;#xB2EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, &amp;#xC790;&amp;#xC728;&amp;#xADDC;&amp;#xC81C;&amp;#xB85C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638; &amp;#xAC15;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xBB38;&amp;#xC911;&amp;#xAC1C;&amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC0AC;&amp;#xC640; &amp;#xC8FC;&amp;#xBB38;&amp;#xD1B5;&amp;#xD569;&amp;#xAD00;&amp;#xB9AC;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC0AC; &amp;#xBC0F; &amp;#xBC30;&amp;#xB2EC;&amp;#xB300;&amp;#xD589;&amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC0AC; &amp;#xAC04; &amp;#xC8FC;&amp;#xBB38;&amp;#xC815;&amp;#xBCF4; &amp;#xC1A1;&amp;#x2024;&amp;#xC218;&amp;#xC2E0;&amp;#xB3C4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;(API) &amp;#xD6C4;&amp;#xD0B9; &amp;#xB4F1; &amp;#xC218;&amp;#xC2E0; &amp;#xC8FC;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC5D0;&amp;#xC774;&amp;#xD53C;&amp;#xC544;&amp;#xC774;(API) &amp;#xC5F0;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC804;&amp;#xC1A1;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xC870;&amp;#xCE58;&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xAE08;&lt;/strong&gt; | &lt;a href=&#34;https://www.cepro.com/networking/critical-cybersecurity-vulnerabilities-in-smart-home-devices-uncovered-in-new-research/&#34;&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xD648; &amp;#xAE30;&amp;#xAE30;&amp;#xC758; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;NETGEAR&amp;#xC640; Bitdefender &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://www.netgear.com/hub/network/2024-iot-threat-report/&#34;&gt;2024 IoT &amp;#xBCF4;&amp;#xC548; &amp;#xD658;&amp;#xACBD; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&lt;/a&gt;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xD648; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xACFC; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xBC1D;&amp;#xD600;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 91&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC57D; 5&amp;#xCC9C;&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; IoT &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C;, &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBAB0;&amp;#xB9AC;&amp;#xB294; &amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xBD84;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xB9C1;&amp;#xD06C;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB9C1;&amp;#xD06C;(URL)&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xC7A5;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xD310;&amp;#xB3C4;&amp;#xB97C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC5B4; &amp;#xB193;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; &amp;#xACB0;&amp;#xC815;&amp;#xC801; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;, &amp;#xC0AC;&amp;#xAC74;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, &amp;#xC81C;&amp;#xD488; &amp;#xB4F1;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB098; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xC790;&amp;#xC6D0;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD0A4;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.bankinfosecurity.com/no-patches-for-hospital-temperature-monitors-critical-flaws-a-25632&#34;&gt;&amp;#xBCD1;&amp;#xC6D0;&amp;#xC6A9; Temperature Monitors&amp;#x2019;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xD328;&amp;#xCE58; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130953&#34;&gt;&amp;#xAC70;&amp;#xB300; &amp;#xCD95;&amp;#xAD6C; &amp;#xD589;&amp;#xC0AC; UEFA, &amp;#xCD5C;&amp;#xADFC; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC758; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://thehackernews.com/2024/06/apple-patches-airpods-bluetooth.html&#34;&gt;Apple, &amp;#xB3C4;&amp;#xCCAD;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; AirPods &amp;#xBE14;&amp;#xB8E8;&amp;#xD22C;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130915&amp;amp;skind=6&#34;&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC8FC;&amp;#xBB38;&amp;#xB7;&amp;#xBC30;&amp;#xB2EC; &amp;#xBD84;&amp;#xC57C;, &amp;#x2018;&amp;#xBBFC;&amp;#xAD00;&amp;#xD611;&amp;#xB825; &amp;#xC790;&amp;#xC728;&amp;#xADDC;&amp;#xC81C;&amp;#x2019;&amp;#xB85C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xAC15;&amp;#xD654;&amp;#xB410;&amp;#xB098;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130808&#34;&gt;AI &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xB300;&amp;#xD45C;&amp;#xC801; &amp;#xACF5;&amp;#xACA9; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB294;? AI &amp;#xBAA8;&amp;#xB378; &amp;#xACF5;&amp;#xC720; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;, AI &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC624;&amp;#xC5FC;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;7&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#7&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;7&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;7&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130368&amp;amp;kind=3&amp;amp;sub_kind=&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~2408.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://www.itdaily.kr/news/articleView.html?idxno=223547&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://iscr.cyber.go.kr/&#34;&gt;&amp;#xAD6D;&amp;#xC81C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBC94;&amp;#xC8C4;&amp;#xB300;&amp;#xC751; &amp;#xC2EC;&amp;#xD3EC;&amp;#xC9C0;&amp;#xC5C4;&lt;/a&gt; | &amp;#xACBD;&amp;#xCC30;&amp;#xCCAD; | 24.07.01 &amp;#xC0AC;&amp;#xC804; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC;&amp;#xC791; (24.08.27 ~ 24.08.29)&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[] KT,        - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, clalxk &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4; :D&lt;br&gt;7&amp;#xC6D4; 1&amp;#xC77C;, &amp;#xC6D4;&amp;#xC694;&amp;#xC77C;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;!&lt;br&gt;&amp;#xC660;&amp;#xC9C0; &amp;#xB7ED;&amp;#xD0A4;&amp;#xBE44;&amp;#xD0A4;&amp;#xD55C; 7&amp;#xC6D4;&amp;#xC774; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694; &amp;#x314E;&amp;#x314E; &lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;-PICK&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9; PICK&amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; KT, &amp;#xC870;&amp;#xC9C1;&amp;#xC801; &amp;#xD574;&amp;#xD0B9;&amp;#xD300; &amp;#xAFB8;&amp;#xB824; &amp;#xD1B5;&amp;#xC2E0;&amp;#xB9DD; &amp;#xAC10;&amp;#xCCAD;&amp;#xB7;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xC720;&amp;#xD3EC; &amp;#xC758;&amp;#xD639;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.24 | JTBC | &lt;a href=&#34;https://www.youtube.com/watch?v=qaF0NSLZ4cU&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt; | &lt;a href=&#34;https://www.youtube.com/watch?v=qaF0NSLZ4cU&#34;&gt;&amp;#xC601;&amp;#xC0C1;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;https://img.youtube.com/vi/qaF0NSLZ4cU/0.jpg&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC601;&amp;#xC0C1;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xD654;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xACE0;&amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xAC74;&amp;#xC778;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;KT&amp;#xAC00; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xD639;&amp;#xC740; &amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC;&amp;#xBC0D;(&amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; &amp;#xC7AC;&amp;#xC0DD;) &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC804;&amp;#xC1A1;&amp;#xC744; &amp;#xD6A8;&amp;#xC728;&amp;#xD654;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#x2018;&lt;strong&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#x2018; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD1B5;&amp;#xC2E0; &amp;#xC7A5;&amp;#xC560;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A8; &amp;#xD610;&amp;#xC758;&amp;#xB85C; &amp;#xACBD;&amp;#xCC30; &amp;#xC218;&amp;#xC0AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC740; &amp;#xC57D; 4&amp;#xB144; &amp;#xC804;&amp;#xC778; 2020&amp;#xB144; &amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; 2020&amp;#xB144; 5&amp;#xC6D4; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC218;&amp;#xC2ED; &amp;#xACF3;&amp;#xC774; &amp;#xBA39;&amp;#xD1B5;&amp;#xC774; &amp;#xB418;&amp;#xC5C8;&amp;#xB358; &amp;#xAC70; &amp;#xC544;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;KT&amp;#xAC00; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5D0; &amp;#xACE0;&amp;#xC758;&amp;#xB85C; &amp;#xC7A5;&amp;#xC560;&amp;#xB97C; &amp;#xC77C;&amp;#xC73C;&amp;#xD0A8;&amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694; &amp;#x1F631; &amp;#xC57D; 60&amp;#xB9CC; &amp;#xBA85;&amp;#xC5D0; &amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC774;&amp;#xC6A9; &amp;#xC2DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC624;&amp;#xB958;&amp;#xB97C; &amp;#xACAA;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; KT&amp;#xAC00; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB9C9;&amp;#xB294; &amp;#xC77C;&amp;#xC885;&amp;#xC758; &amp;#x2018;&amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#x2019;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;&amp;#xD588;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xD639;&amp;#xB3C4; &amp;#xC81C;&amp;#xAE30;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &amp;#xACBD;&amp;#xCC30;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC1D;&amp;#xD600;&amp;#xC9C4; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xD55C; &amp;#xACF3;&amp;#xC740; &amp;#xB2E4;&amp;#xB984; &amp;#xC544;&amp;#xB2CC; KT&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC13C;&amp;#xD130; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC778; &amp;#xBD84;&amp;#xB2F9; IDC &amp;#xC13C;&amp;#xD130;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;. &amp;#xC774;&amp;#xACF3;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC218;&amp;#xC2ED; &amp;#xACF3;&amp;#xC5D0; &amp;#xD574;&amp;#xD0B9; &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. KT&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC77C;&amp;#xBD80; &amp;#xACE0;&amp;#xAC1D;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#x2018;&amp;#xC545;&amp;#xC131; &amp;#xCF54;&amp;#xB4DC;&amp;#x2019;&amp;#xB97C; &amp;#xC2EC;&amp;#xC740; &amp;#xC148;&amp;#xC778;&amp;#xAC70;&amp;#xC8E0;. &amp;#xC774;&amp;#xB54C; &lt;strong&gt;&amp;#x2018;&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xAC1C;&amp;#xBC1C;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;&amp;#xACFC;, &lt;strong&gt;&amp;#x2018;&amp;#xC720;&amp;#xD3EC;&amp;#xC640; &amp;#xC6B4;&amp;#xC601;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; KT &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5EC;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB294; &lt;strong&gt;&amp;#x2018;&amp;#xAC10;&amp;#xCCAD;&amp;#x2019;&lt;/strong&gt; &amp;#xB2F4;&amp;#xB2F9;&amp;#xC73C;&amp;#xB85C; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xC5EC; &amp;#xD300;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xC744; &amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC774; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xC720;&amp;#xD3EC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; KT&amp;#xAC00; &amp;#xBC14;&amp;#xAFBC; &amp;#xC758;&amp;#xD639;&amp;#xB3C4; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; KT &amp;#xCE21;&amp;#xC740; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC790;&amp;#xCCB4;&amp;#xAC00; &amp;#xC545;&amp;#xC131; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC5B4;&amp;#xCA54; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xC785;&amp;#xC7A5;&amp;#xC744; &amp;#xBC1D;&amp;#xD614;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;KT &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC13C;&amp;#xD130;&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xBCF8;&amp;#xC0AC;&lt;/strong&gt;&amp;#xB97C; &amp;#xCC28;&amp;#xB840;&amp;#xB85C; &amp;#xC555;&amp;#xC218;&amp;#xC218;&amp;#xC0C9;&amp;#xC744; &amp;#xD55C; &amp;#xACBD;&amp;#xAE30;&amp;#xB0A8;&amp;#xBD80;&amp;#xCCAD;&amp;#xC740; &lt;strong&gt;KT&amp;#xAC00; &amp;#xD1B5;&amp;#xC2E0;&amp;#xBE44;&amp;#xBC00;&amp;#xBCF4;&amp;#xD638;&amp;#xBC95;&amp;#xACFC; &amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xB9DD;&amp;#xBC95; &amp;#xB4F1;&amp;#xC744; &amp;#xC704;&amp;#xBC18;&lt;/strong&gt;&amp;#xD588;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xC218;&amp;#xC0AC;&amp;#xB97C; &amp;#xC774;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F46E;&lt;/p&gt;
&lt;p&gt;KT&amp;#xB294; &amp;#xACFC;&amp;#xAC70;&amp;#xC5D0;&amp;#xB3C4; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC5C5;&amp;#xCCB4;&amp;#xC640; &amp;#xAC08;&amp;#xB4F1;&amp;#xC744; &amp;#xBE5A;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &amp;#xC9C0;&amp;#xB09C; 2015&amp;#xB144; &amp;#xAC00;&amp;#xC785;&amp;#xC790;&amp;#xC6A9; &amp;#xC778;&amp;#xD130;&amp;#xB137; &amp;#xD68C;&amp;#xC120;&amp;#xC758; &amp;#xC0C1;&amp;#xC5C5;&amp;#xC6A9; &amp;#xC774;&amp;#xC6A9;&amp;#xC744; &amp;#xAE08;&amp;#xC9C0;&amp;#xD55C; &amp;#xC774;&amp;#xC6A9;&amp;#xC57D;&amp;#xAD00;&amp;#xC5D0; &amp;#xC704;&amp;#xBC30;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC6F9;&amp;#xD558;&amp;#xB4DC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC6A9; &amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xC11C;&amp;#xBC84;&amp;#xC758; IP&amp;#xB9CC;&amp;#xC744; &amp;#xACE8;&amp;#xB77C; &amp;#xCC28;&amp;#xB2E8;&amp;#xD588;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xACBD;&amp;#xCC30;&amp;#xC740; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 11&amp;#xC6D4; KT &amp;#xC9C1;&amp;#xC6D0;&amp;#xACFC; KT &amp;#xB2F9;&amp;#xC2DC; &amp;#xD611;&amp;#xB825;&amp;#xC5C5;&amp;#xCCB4; &amp;#xC9C1;&amp;#xC6D0; &amp;#xB4F1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; 13&amp;#xBA85;&amp;#xC744; &amp;#xD2B9;&amp;#xC815;&amp;#xD574; &amp;#xAC80;&amp;#xCC30;&amp;#xC5D0; &amp;#xC1A1;&amp;#xCE58;&amp;#xD588;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xD1B5;&amp;#xC2E0;&amp;#xC0AC;&amp;#xB4E4;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xB7;&amp;#xAC10;&amp;#xB3C5;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC815;&amp;#xBCF4;&amp;#xD1B5;&amp;#xC2E0;&amp;#xBD80;&amp;#xB294; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 9&amp;#xC6D4; &amp;#xC774; &amp;#xC0AC;&amp;#xC548;&amp;#xC744; &amp;#xC54C;&amp;#xC558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC218;&amp;#xC0AC;&amp;#xC911;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC870;&amp;#xCE58;&amp;#xB3C4; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xAC78;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.. &amp;#x1F92F;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC0AC;&amp;#xAC74;&amp;#xC774; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xC9C0; &amp;#xB274;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACC4;&amp;#xC18D; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xD0B9;&amp;#xC9F9;&amp;#xC9F9;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xD574;&amp;#xC694;~&amp;#x1F425;&lt;/p&gt;
&lt;h2 id&gt;&lt;a href=&#34;#&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;&amp;#xC6D0;&amp;#xD074;&amp;#xB9AD;&amp;#x2019; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&amp;#x2026; &amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xC678;&amp;#xAD6D;&amp;#xC778;&amp;#xC774;&amp;#xB77C; &amp;#xBCF4;&amp;#xC0C1; &amp;#xC5C6;&amp;#xC5B4;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.28 | &amp;#xB514;&amp;#xC9C0;&amp;#xD138;&amp;#xD0C0;&amp;#xC784;&amp;#xC2A4; | &lt;a href=&#34;https://m.dt.co.kr/contents.html?article_no=2024062802109931081012&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC5D0;&amp;#xC11C; &amp;#x2018;&amp;#xC6D0;&amp;#xD074;&amp;#xB9AD;&amp;#x2019; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD574; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC740; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xD6D4;&amp;#xCCD0;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;&amp;#x2026;&amp;#x1F631; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image1.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1; 10.4.3 &amp;#xBC84;&amp;#xC804;&amp;#xC758; &lt;strong&gt;&amp;#xB525;&amp;#xB9C1;&amp;#xD06C; &amp;#xC720;&amp;#xD6A8;&amp;#xC131; &amp;#xAC80;&amp;#xC0AC; &amp;#xBB38;&amp;#xC81C;&lt;/strong&gt;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xC6D0;&amp;#xACA9; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC6F9;&amp;#xBDF0;&amp;#xC5D0;&amp;#xC11C; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC790;&amp;#xBC14;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, HTTP &amp;#xC694;&amp;#xCCAD; &amp;#xD5E4;&amp;#xB354;&amp;#xC758; &lt;strong&gt;&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&amp;#xC744;&lt;/strong&gt; &lt;strong&gt;&amp;#xC720;&amp;#xCD9C;&lt;/strong&gt;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC600;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xD1A0;&amp;#xD070;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xAE30;&amp;#xAE30;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACC4;&amp;#xC815;&amp;#xC744; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xACE0; &amp;#xCC44;&amp;#xD305; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC77D;&amp;#xB294; &amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2023-51219&#34;&gt;CVE-2023-51219&lt;/a&gt;&amp;#xB85C; &amp;#xBA85;&amp;#xBA85;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC758; &amp;#xB354; &amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://stulle123.github.io/posts/kakaotalk-account-takeover/&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image2.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC740; &amp;#xC790;&amp;#xC0AC; &amp;#xC6F9;&amp;#xACFC; &amp;#xC571; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC0AC;&amp;#xC804;&amp;#xC5D0; &amp;#xBC1C;&amp;#xAD74;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xCE58;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;! &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xBCF4;&amp;#xC548; &amp;#xC804;&amp;#xBB38;&amp;#xAC00;, &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCE74;&amp;#xCE74;&amp;#xC624; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD574; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xD5D8;&amp;#xB3C4;&amp;#xC640; &amp;#xBC1C;&amp;#xAD74; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4; &amp;#xB4F1;&amp;#xC744; &amp;#xC885;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAC80;&amp;#xD1A0;&amp;#xD574; &amp;#xCD5C;&amp;#xC18C; 5&amp;#xB9CC; &amp;#xC6D0;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xB300; 1,000&amp;#xB9CC; &amp;#xC6D0;&amp;#xC758; &amp;#xD3EC;&amp;#xC0C1;&amp;#xAE08;&amp;#xC744; &amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC9C0;&amp;#xAE09;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;. &amp;#xB2E4;&amp;#xB9CC; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xCC38;&amp;#xC5EC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCC38;&amp;#xC5EC;&amp;#xC790;&amp;#xB294; &amp;#xAD6D;&amp;#xB0B4;&amp;#xC678; &amp;#xAC70;&amp;#xC8FC;&amp;#xD558;&amp;#xB294; &lt;strong&gt;&amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C;&amp;#xC815;&lt;/strong&gt;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xB294; &amp;#xC9C0;&amp;#xB09C;&amp;#xD574; 12&amp;#xC6D4; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xC5D0; &amp;#xC774; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0;&amp;#xD588;&amp;#xC73C;&amp;#xB098;, &amp;#xD55C;&amp;#xAD6D; &amp;#xAD6D;&amp;#xC801;&amp;#xC790;&amp;#xB9CC; &amp;#xD3EC;&amp;#xC0C1;&amp;#xAE08;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC544;&amp;#xBB34;&amp;#xB7F0; &amp;#xBCF4;&amp;#xC0C1;&amp;#xB3C4; &amp;#xBC1B;&amp;#xC9C0; &amp;#xBABB;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F972; &lt;/p&gt;
&lt;p&gt;&amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xAC00; &amp;#xAE43;&amp;#xD5C8;&amp;#xBE0C;&amp;#xC5D0; &amp;#xAE00;&amp;#xC744; &amp;#xAC8C;&amp;#xC2DC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD654;&amp;#xC81C;&amp;#xAC00; &amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;, &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC774; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC778; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC778; &amp;#xB9CC;&amp;#xD07C; &amp;#xC5B4;&amp;#xCA54; &amp;#xC218; &amp;#xC5C6;&amp;#xB2E4;&amp;#xB294; &amp;#xC758;&amp;#xACAC;&amp;#xB3C4; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xD55C;&amp;#xD3B8;, &amp;#xD574;&amp;#xC678;&amp;#xC5D0;&amp;#xC11C; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xD1A1;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBC1C;&amp;#xACAC;&amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xBCF4;&amp;#xC0C1;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xC801;&amp;#xADF9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC774;&amp;#xB97C; &amp;#xC81C;&amp;#xBCF4;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xACB0;&amp;#xAD6D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC545;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC6B0;&amp;#xB824;&amp;#xB3C4; &amp;#xB098;&amp;#xC624;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1F600;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xCE74;&amp;#xCE74;&amp;#xC624;&amp;#xC640; &amp;#xB3D9;&amp;#xC77C;&amp;#xD558;&amp;#xAC8C;, &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC9C4;&amp;#xD765;&amp;#xC6D0;(KISA)&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; &amp;#xC5ED;&amp;#xC2DC; &amp;#xCC38;&amp;#xAC00; &amp;#xB300;&amp;#xC0C1;&amp;#xC744; &amp;#xAD6D;&amp;#xB0B4;, &amp;#xC678; &amp;#xAC70;&amp;#xC8FC;&amp;#xD558;&amp;#xB294; &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xC73C;&amp;#xB85C; &amp;#xD55C;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &amp;#xD574;&amp;#xC678; &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;&amp;#xC5D0; &amp;#xAD6D;&amp;#xC801; &amp;#xC81C;&amp;#xD55C;&amp;#xC744; &amp;#xB450;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA70;, &amp;#xAD6D;&amp;#xB0B4;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xC0BC;&amp;#xC131; &amp;#xBAA8;&amp;#xBC14;&amp;#xC77C;&amp;#xC774; &amp;#xC6B4;&amp;#xC601;&amp;#xD558;&amp;#xB294; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131; &amp;#xBCF4;&amp;#xACE0; &amp;#xBCF4;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC815;&amp;#xBD80;&amp;#xC758; &amp;#xC81C;&amp;#xC7AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC740; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xAC70;&amp;#xC8FC;&amp;#xC790;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD558;&amp;#xBA74; &amp;#xC81C;&amp;#xBCF4;&amp;#xC790;&amp;#xC758; &amp;#xAD6D;&amp;#xC801;&amp;#xC744; &amp;#xB530;&amp;#xB85C; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F62E;&lt;/p&gt;
&lt;h2 id=&#34;-1&#34;&gt;&lt;a href=&#34;#-1&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xBBF8;&amp;#xB798; &amp;#xAD6D;&amp;#xBC29; &amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800;&amp;#xB85C;&amp;#x2026;&amp;#x2018;&amp;#xBBFC;&amp;#xAD00;&amp;#xAD70; &amp;#xC591;&amp;#xC790;&amp;#xC815;&amp;#xBCF4;&amp;#xD611;&amp;#xC758;&amp;#xD68C;&amp;#x2019; &amp;#xACF5;&amp;#xC2DD; &amp;#xCD9C;&amp;#xBC94;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.27 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157257&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC591;&amp;#xC790; &amp;#xACFC;&amp;#xD559; &amp;#xAE30;&amp;#xC220;! &amp;#xB2E4;&amp;#xB4E4; &amp;#xD55C;&amp;#xBC88;&amp;#xC529;&amp;#xC740; &amp;#xB4E4;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC168;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694; &amp;#x1F600; &lt;/p&gt;
&lt;p&gt;&amp;#xC591;&amp;#xC790; &amp;#xACFC;&amp;#xD559; &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xB780; &amp;#xC591;&amp;#xC790;&amp;#xC5ED;&amp;#xD559;&amp;#xC801; &amp;#xD2B9;&amp;#xC131;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xC874; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xC774;&amp;#xB860;&amp;#xC801; &amp;#xD55C;&amp;#xACC4;&amp;#xB97C; &amp;#xB3CC;&amp;#xD30C;&amp;#xD558;&amp;#xB294; &amp;#xCD08;&amp;#xC815;&amp;#xBC00; &amp;#xACC4;&amp;#xCE21;(&amp;#xC591;&amp;#xC790;&amp;#xC13C;&amp;#xC11C;), &amp;#xC591;&amp;#xC790;&amp;#xAE30;&amp;#xAE30;&amp;#xAC04; &amp;#xCD08;&amp;#xC2E0;&amp;#xB8B0;&amp;#xC5F0;&amp;#xACB0;(&amp;#xC591;&amp;#xC790;&amp;#xD1B5;&amp;#xC2E0;), &amp;#xCD08;&amp;#xACE0;&amp;#xC18D;&amp;#xC5F0;&amp;#xC0B0;(&amp;#xC591;&amp;#xC790;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;)&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xC220;&amp;#xC774;&amp;#xC5D0;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC815;&amp;#xBD80;&amp;#xB294; &amp;#xD070; &amp;#xD30C;&amp;#xAE09;&amp;#xB825;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC774; &amp;#xAE30;&amp;#xC220;&amp;#xC744; 3&amp;#xB300; &amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xC778;&amp;#xB825;&amp;#xC744; &amp;#xC721;&amp;#xC131;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xAE30;&amp;#xC6B8;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xBBF8;&amp;#xAD6D; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xB294; &amp;#xAD6D;&amp;#xBC29;&amp;#xAE30;&amp;#xC220;&amp;#xC804;&amp;#xB7B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; 14&amp;#xB300; &amp;#xAD6D;&amp;#xBC29; &amp;#xD575;&amp;#xC2EC;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC120;&amp;#xC815;(2023&amp;#xB144;)&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC601;&amp;#xAD6D;&amp;#xB3C4; &amp;#xAD6D;&amp;#xAC00;&amp;#xC591;&amp;#xC790;&amp;#xC804;&amp;#xB7B5;&amp;#xC5D0;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xC13C;&amp;#xC11C;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29;&amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xBAA9;&amp;#xD45C;&amp;#xB85C; &amp;#xC124;&amp;#xC815;(2023&amp;#xB144;)&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xBA70;, &amp;#xD504;&amp;#xB791;&amp;#xC2A4;&amp;#xB294; &amp;#xC591;&amp;#xC790;&amp;#xD56D;&amp;#xBC95;&amp;#xC758; &amp;#xD574;&amp;#xAD70; &amp;#xC218;&amp;#xC0C1; &amp;#xD568;&amp;#xC815; &amp;#xC801;&amp;#xC6A9;&amp;#xACC4;&amp;#xD68D;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;(2022&amp;#xB144;)&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD574;&amp;#xC678; &amp;#xC8FC;&amp;#xC694;&amp;#xAD6D;&amp;#xC740; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xB178;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC; &amp;#xC815;&amp;#xBD80;&amp;#xB3C4; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xBD84;&amp;#xC57C; &amp;#xC801;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xC9C0;&amp;#xC18D;&amp;#xD574; &amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;! &amp;#x1F60E;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB294; &amp;#xC791;&amp;#xB144; &amp;#x2018;&amp;#xB300;&amp;#xD55C;&amp;#xBBFC;&amp;#xAD6D; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xC804;&amp;#xB7B5;&amp;#x2019;&amp;#xC758; 7&amp;#xB300; &amp;#xCD94;&amp;#xC9C4; &amp;#xBC29;&amp;#xD5A5; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C;&amp;#x2018;&amp;#xAD6D;&amp;#xBC29;&amp;#xB7;&amp;#xC548;&amp;#xBCF4; &amp;#xB3C4;&amp;#xC785; &amp;#xCD94;&amp;#xC9C4;&amp;#x2019;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xB294; &amp;#xC791;&amp;#xB144; 10&amp;#xB300; &amp;#xAD6D;&amp;#xBC29;&amp;#xC804;&amp;#xB7B5;&amp;#xAE30;&amp;#xC220; &amp;#xC911;&amp;#xC758; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC120;&amp;#xC815;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29; &amp;#xC801;&amp;#xC6A9;&amp;#xC131;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image3.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB294; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD80;&amp;#xC640; &amp;#xACF5;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C;, &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220;&amp;#xC758; &amp;#xAD6D;&amp;#xBC29;&amp;#xBD84;&amp;#xC57C; &amp;#xC801;&amp;#xC6A9;&amp;#xB7;&amp;#xD655;&amp;#xC0B0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#x2018;&lt;strong&gt;&amp;#xBBFC;&amp;#xAD00;&amp;#xAD70; &amp;#xC591;&amp;#xC790;&amp;#xC815;&amp;#xBCF4;&amp;#xD611;&amp;#xC758;&amp;#xD68C;&amp;#x2018;&lt;/strong&gt;&amp;#xB97C; 6&amp;#xC6D4; 27&amp;#xC77C; &amp;#xCD9C;&amp;#xBC94;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB294; 2024&amp;#xB144; 4&amp;#xC6D4; &amp;#xCCB4;&amp;#xACB0;&amp;#xD55C; &amp;#xACFC;&amp;#xAE30;&amp;#xC815;&amp;#xD1B5;&amp;#xBD80;&amp;#xB7;&amp;#xAD6D;&amp;#xBC29;&amp;#xBD80; &amp;#xC7A5;&amp;#xAD00;&amp;#xAC04; &amp;#xAD6D;&amp;#xBC29;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xD611;&amp;#xB825; MOU &amp;#xD6C4;&amp;#xC18D;&amp;#xC870;&amp;#xCE58;&amp;#xB85C;&amp;#xC11C; &amp;#xC591;&amp;#xC790;&amp;#xACFC;&amp;#xD559;&amp;#xAE30;&amp;#xC220; &amp;#xAC1C;&amp;#xBC1C;&amp;#xACFC; &amp;#xC0B0;&amp;#xC5C5;&amp;#xCC3D;&amp;#xCD9C;, &amp;#xAD6D;&amp;#xBC29;&amp;#xD601;&amp;#xC2E0;&amp;#xC758; &amp;#xC120;&amp;#xC21C;&amp;#xD658; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xAE30;&amp;#xC5EC;&amp;#xD560; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xAE30;&amp;#xB300;&amp;#xB41C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694; &amp;#x1F632;&lt;/p&gt;
&lt;h2 id=&#34;-2&#34;&gt;&lt;a href=&#34;#-2&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x26A0;&amp;#xFE0F; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xD0B9;&amp;#xD558;&amp;#xB294; &amp;#xC2E0;&amp;#xC885; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xB4F1;&amp;#xC7A5; &amp;#x1F631;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.17 | &amp;#xB370;&amp;#xC77C;&amp;#xB9AC;&amp;#xC2DC;&amp;#xD050; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=156885&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD5C9; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB77C;&amp;#xB2C8;&amp;#xC694; &amp;#x1F631;&amp;#x1F630;&amp;#x1F628;&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&lt;strong&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;(DISGOMOJI)&lt;/strong&gt;&amp;#x2018;&amp;#xB77C;&amp;#xB294; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xACAC;&amp;#xB418;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;! &amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC744; &amp;#xB300;&amp;#xC0C1;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xBA70;, &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;(Discord)&amp;#xC640; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xBA85;&amp;#xB839; &amp;#xBC0F; &amp;#xC81C;&amp;#xC5B4;(C2) &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xC7A5;&amp;#xCE58;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image4.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xC758; &amp;#xD2B9;&amp;#xC9D5;&amp;#xC740; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC778; discord-c2&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; C2 &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC778;&amp;#xB370;&amp;#xC694;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xC5B4;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC18; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC694;. &amp;#xC544;&amp;#xD649; &amp;#xAC1C;&amp;#xC758; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xBA70;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC258; &amp;#xBA85;&amp;#xB839; &amp;#xC2E4;&amp;#xD589;, &amp;#xC2A4;&amp;#xD06C;&amp;#xB9B0;&amp;#xC0F7; &amp;#xCD2C;&amp;#xC601;, &amp;#xD30C;&amp;#xC77C; &amp;#xD0C8;&amp;#xCDE8; &amp;#xB4F1;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xBAA8;&amp;#xC9C0;&amp;#xB85C; &amp;#xB300;&amp;#xCCB4;&amp;#xD558;&amp;#xB2E4;&amp;#xB2C8;&amp;#x2026; &amp;#xC815;&amp;#xB9D0; &amp;#xCC3D;&amp;#xC758;&amp;#xC801;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC544;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;1) &amp;#x1F3C3;&amp;#x200D;&amp;#x2642;&amp;#xFE0F; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xBA85;&amp;#xB839; &amp;#xC218;&amp;#xD589;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xC544;&amp;#xADDC;&amp;#xBA3C;&amp;#xD2B8;&amp;#xB97C; &amp;#xB530;&amp;#xB85C; &amp;#xBC1B;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;2) &amp;#x1F4F8; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xCEA1;&amp;#xCCD0;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;3) &amp;#x1F447; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC; &amp;#xBC1B;&amp;#xC544; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;4) &amp;#x261D;&amp;#xFE0F; : &amp;#xD53C;&amp;#xD574;&amp;#xC790;&amp;#xC758; &amp;#xC7A5;&amp;#xBE44;&amp;#xC5D0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2EC;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;5) &amp;#x1F449; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC6D0;&amp;#xACA9; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778; &amp;#xC624;&amp;#xC2DC;(Oshi)&amp;#xB85C; &amp;#xC62E;&amp;#xAE34;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;6) &amp;#x1F448; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44;&amp;#xC758; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xC6D0;&amp;#xACA9; &amp;#xD30C;&amp;#xC77C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC778; &amp;#xD2B8;&amp;#xB79C;&amp;#xC2A4;&amp;#xD37C;(transfer.sh)&amp;#xB85C; &amp;#xC62E;&amp;#xAE34;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;7) &amp;#x1F525; : &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xCC3E;&amp;#xC544; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;8) &amp;#x1F98A; : &amp;#xD53C;&amp;#xD574;&amp;#xC790; &amp;#xC7A5;&amp;#xBE44; &amp;#xB0B4; &amp;#xD30C;&amp;#xC774;&amp;#xC5B4;&amp;#xD3ED;&amp;#xC2A4; &amp;#xD504;&amp;#xB85C;&amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC555;&amp;#xCD95;&amp;#xD574; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;9) &amp;#x1F480; : &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0A8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xC774; &amp;#xBA85;&amp;#xB839;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xC2DC;&amp;#xACC4; &amp;#xBAA8;&amp;#xC591; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC11C;&amp;#xBC84;&amp;#xB85C; &amp;#xB0B4;&amp;#xBCF4;&amp;#xB0B4;&amp;#xC5B4;, &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC774; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; &amp;#x201C;&amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC798; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#x201D;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xB610;&amp;#xD55C; &amp;#xBA85;&amp;#xB839;&amp;#xC774; &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0;&amp;#xAC00; &amp;#xCD08;&amp;#xB85D;&amp;#xC0C9; &amp;#xB124;&amp;#xBAA8; &amp;#xBC15;&amp;#xC2A4;&amp;#xC5D0; &amp;#xCCB4;&amp;#xD06C; &amp;#xD45C;&amp;#xC2DC;&amp;#xAC00; &amp;#xB41C; &amp;#xBAA8;&amp;#xC591;&amp;#xC758; &amp;#xC774;&amp;#xBAA8;&amp;#xD2F0;&amp;#xCF58;&amp;#xC744; &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC804;&amp;#xC1A1;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694;! &amp;#x1FAE0;&amp;#x1F62E;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD30C;&amp;#xD0A4;&amp;#xC2A4;&amp;#xD0C4; &amp;#xD574;&amp;#xD0B9; &amp;#xADF8;&amp;#xB8F9; &lt;strong&gt;UTA0137&lt;/strong&gt;&amp;#xC774; &amp;#xC81C;&amp;#xC791;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. &amp;#xD30C;&amp;#xD0A4;&amp;#xC2A4;&amp;#xD0C4; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC790;&amp;#xC8FC; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xC778;&amp;#xB3C4;&amp;#xC758; &amp;#xC815;&amp;#xBD80; &amp;#xAE30;&amp;#xAD00;&amp;#xB4E4;&amp;#xC740; &amp;#xACF5;&amp;#xBB34;&amp;#xC6D0;&amp;#xB4E4;&amp;#xC774; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xAE30;&amp;#xBC18; &amp;#xB370;&amp;#xC2A4;&amp;#xD06C;&amp;#xD1B1;&amp;#xC744; &amp;#xC5C5;&amp;#xBB34;&amp;#xC5D0; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xB9C8;&amp;#xCE68; &amp;#xC774; &amp;#xB514;&amp;#xC2A4;&amp;#xACE0;&amp;#xBAA8;&amp;#xC9C0; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; ZIP &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4; UPX&amp;#xB85C; &amp;#xD328;&amp;#xD0B9;&amp;#xB41C; ELF &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; &amp;#xD53C;&amp;#xC2F1; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBC30;&amp;#xD3EC;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;! &lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &lt;a href=&#34;https://www.volexity.com/blog/2024/06/13/disgomoji-malware-used-to-target-indian-government/&#34;&gt;&amp;#xB9C1;&amp;#xD06C;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;-3&#34;&gt;&lt;a href=&#34;#-3&#34; class=&#34;headerlink&#34; title=&#34; &#34;&gt;&lt;/a&gt; &lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x1F5E3;&amp;#xFE0F; OpenAI, &amp;#xC911;&amp;#xAD6D;, &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;, &amp;#xC774;&amp;#xB780; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; ChatGPT &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xC911;&amp;#xB2E8;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;2024.06.26 | bankinfosecurity | &lt;a href=&#34;https://www.bankinfosecurity.com/openai-drops-chatgpt-access-for-users-in-china-russia-iran-a-25631&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&amp;#xBCF4;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2024/07/01/clalxk/newsletter0701/image5.png&#34; alt=&#34;&amp;#xAE30;&amp;#xC0AC;&amp;#xC0AC;&amp;#xC9C4;&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;&amp;#xC640; &amp;#xC911;&amp;#xAD6D;, &amp;#xC774;&amp;#xB780; &amp;#xB4F1; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC9C0;&amp;#xC6D0; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC678;&amp;#xB41C; &amp;#xAD6D;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC5D0;&amp;#xAC8C; 7&amp;#xC6D4; 9&amp;#xC77C; &amp;#xC774;&amp;#xD6C4; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xB85C; &amp;#xD1B5;&amp;#xBCF4;&amp;#xD588;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xC694; &amp;#x1FAE2;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xC624;&amp;#xD508;AI &amp;#xCEE4;&amp;#xBBA4;&amp;#xB2C8;&amp;#xD2F0; &amp;#xD3EC;&amp;#xB7FC;&amp;#xC5D0; &amp;#xAC8C;&amp;#xC2DC;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#x2018;&amp;#xC790;&amp;#xC0AC; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; &amp;#xADC0;&amp;#xC0AC; API &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC774; &amp;#xD604;&amp;#xC7AC; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB2E4;&amp;#xBA70; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC640; &amp;#xC9C0;&amp;#xC5ED; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBC1D;&amp;#xD788;&amp;#xACE0; 7&amp;#xC6D4; 9&amp;#xC77C;&amp;#xBD80;&amp;#xD130; &amp;#xC9C0;&amp;#xC6D0;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC640; &amp;#xC9C0;&amp;#xC5ED;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; API &amp;#xD2B8;&amp;#xB798;&amp;#xD53D;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCD94;&amp;#xAC00; &amp;#xC870;&amp;#xCE58;&amp;#xB97C; &amp;#xCDE8;&amp;#xD560; &amp;#xAC83;&amp;#x2019; &amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBA54;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xACF5;&amp;#xAC1C; &amp;#xB41C; &lt;a href=&#34;https://platform.openai.com/docs/supported-countries&#34;&gt;&amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC9C0;&amp;#xC6D0; &amp;#xBAA9;&amp;#xB85D;&lt;/a&gt;&amp;#xC5D0;&amp;#xB294; &amp;#xBBF8;&amp;#xAD6D;, &amp;#xCE90;&amp;#xB098;&amp;#xB2E4;, EU &amp;#xAD6D;&amp;#xAC00;, &amp;#xC544;&amp;#xC2DC;&amp;#xC544;, &amp;#xC544;&amp;#xD504;&amp;#xB9AC;&amp;#xCE74; &amp;#xC77C;&amp;#xBD80; &amp;#xB4F1; &amp;#xC804; &amp;#xC138;&amp;#xACC4; &amp;#xB9CE;&amp;#xC740; &amp;#xAD6D;&amp;#xAC00;&amp;#xB294; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &lt;strong&gt;&amp;#xC911;&amp;#xAD6D;, &amp;#xB7EC;&amp;#xC2DC;&amp;#xC544;, &amp;#xBD81;&amp;#xD55C;, &amp;#xC774;&amp;#xB780;&lt;/strong&gt; &amp;#xB4F1; &amp;#xC77C;&amp;#xBD80; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC740; &amp;#xCC3E;&amp;#xC544;&amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC5B4;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xB3C4;&amp;#xC5D0;&amp;#xC120; &amp;#xC774;&amp;#xBC88;&amp;#xC5D0; &amp;#xC624;&amp;#xD508;AI&amp;#xAC00; &amp;#xC911;&amp;#xAD6D;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD55C; 4&amp;#xAC1C;&amp;#xAD6D;&amp;#xC73C;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xACB0;&amp;#xC815;&amp;#xD55C; &amp;#xAC74; &amp;#xBBF8;&amp;#xAD6D;&amp;#xACFC; &amp;#xC911;&amp;#xAD6D;&amp;#xAC04; &amp;#xAE34;&amp;#xC7A5;&amp;#xC774; &amp;#xACE0;&amp;#xC870;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xC9C0;&amp;#xB09C; 2&amp;#xC6D4; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB41C; &amp;#xC774; &lt;a href=&#34;https://www.aitimes.com/news/articleView.html?idxno=157207&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&amp;#xAC00; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBBF8;&amp;#xCCE4;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xCD94;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC694; &amp;#x1FAE0;&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758;-&amp;#xD558;&amp;#xB8E8;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#&amp;#xC774;&amp;#xBC88;-&amp;#xC8FC;-&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758;-&amp;#xD558;&amp;#xB8E8;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758; &amp;#xD558;&amp;#xB8E8; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&amp;#xC774;&amp;#xBC88; &amp;#xC8FC; &amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC758; &amp;#xD558;&amp;#xB8E8; &amp;#x1F425;&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xC6D4;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157113&#34;&gt;&amp;#xBCF4;&amp;#xC548;&amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC548;&amp;#xB418;&amp;#xB294; &amp;#xAD6C;&amp;#xD615; &amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30; &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xB798;&amp;#xD2C0; RAT&amp;#x2026;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xACF5;&amp;#xACA9; &amp;#xC8FC;&amp;#xC758;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB798;&amp;#xD2C0; RAT&amp;#xB294; &amp;#xAD6C;&amp;#xD615; &amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC; &amp;#xAE30;&amp;#xAE30;&amp;#xB97C; &amp;#xACA8;&amp;#xB0E5;&amp;#xD55C; &amp;#xC624;&amp;#xD508;&amp;#xC18C;&amp;#xC2A4; &amp;#xC6D0;&amp;#xACA9; &amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD2B8;&amp;#xB85C;&amp;#xC774; &amp;#xBAA9;&amp;#xB9C8;&amp;#xB85C;, &amp;#xC778;&amp;#xC2A4;&amp;#xD0C0;&amp;#xADF8;&amp;#xB7A8;, &amp;#xC653;&amp;#xCE20;&amp;#xC571; &amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC0B0;&amp;#xB418;&amp;#xBA70; &amp;#xD30C;&amp;#xC77C; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xC704;&amp;#xCE58; &amp;#xCD94;&amp;#xC801; &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBCF4;&amp;#xC548; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC720;&amp;#xC9C0;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xB8B0;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; APK&amp;#xB97C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB3C4;&amp;#xB85D; &amp;#xC8FC;&amp;#xC758;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xD654;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157168&amp;amp;page=3&amp;amp;total=102987&#34;&gt;&amp;#xD504;&amp;#xB808;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC0F5; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xBAA8;&amp;#xB4C8; &amp;#xBCF4;&amp;#xC548;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC545;&amp;#xC6A9;&amp;#xD574; &amp;#xC2E0;&amp;#xC6A9;&amp;#xCE74;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4; &amp;#xD0C8;&amp;#xCDE8; &amp;#xC911;&amp;#x2026;&amp;#xC8FC;&amp;#xC758;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC1FC;&amp;#xD551;&amp;#xBAB0;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xAD6C;&amp;#xCD95;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC73C;&amp;#xB85C; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xD504;&amp;#xB808;&amp;#xC2A4;&amp;#xD0C0;&amp;#xC0F5;(PrestaShop)&amp;#xC758; &amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xBD81; &amp;#xBAA8;&amp;#xB4C8;&amp;#xC778; pkfacebook&amp;#xC5D0;&amp;#xC11C; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xACAC;&amp;#xB410;&amp;#xB2E4;. SQL &amp;#xC778;&amp;#xC81D;&amp;#xC158;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xC790;&amp;#xC0C1;&amp;#xAC70;&amp;#xB798; &amp;#xC6F9;&amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCE74;&amp;#xB4DC; &amp;#xC2A4;&amp;#xD0A4;&amp;#xBA38;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; &amp;#xC2E0;&amp;#xC6A9;&amp;#xCE74;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD0C8;&amp;#xCDE8;&amp;#xD558;&amp;#xB294; &amp;#xB370; &amp;#xC545;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. (&lt;a href=&#34;https://nvd.nist.gov/vuln/detail/CVE-2024-36680&#34;&gt;CVE-2024-36680&lt;/a&gt;)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xC218;&lt;/strong&gt; | &lt;a href=&#34;https://m.boannews.com/html/detail.html?tab_type=1&amp;amp;idx=130809&#34;&gt;&amp;#xCD5C;&amp;#xADFC; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xACF5;&amp;#xACA9; &amp;#xC704;&amp;#xD611; 5&amp;#xAC00;&amp;#xC9C0;&amp;#x2026; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &amp;#xAE08;&amp;#xC804; &amp;#xD0C8;&amp;#xCDE8; &amp;#xBAA9;&amp;#xC801;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC5C5;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCE68;&amp;#xD574;&amp;#xC0AC;&amp;#xACE0;&amp;#xAC00; &amp;#xC9C0;&amp;#xC18D;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;. &amp;#xD55C;&amp;#xAD6D;&amp;#xC778;&amp;#xD130;&amp;#xB137;&amp;#xC9C4;&amp;#xD765;&amp;#xC6D0;(&amp;#xC774;&amp;#xD558; KISA)&amp;#xC5D0; &amp;#xB530;&amp;#xB974;&amp;#xBA74; 2020&amp;#xB144; 630&amp;#xAC74;&amp;#xC5D0;&amp;#xC11C; 2021&amp;#xB144; 640&amp;#xAC74;, 2022&amp;#xB144; 1142&amp;#xAC74;, 2023&amp;#xB144; 1,227&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &amp;#xAE09;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xCD94;&amp;#xC138;&amp;#xB2E4;. &amp;#xAE08;&amp;#xC804;&amp;#xD0C8;&amp;#xCDE8; &amp;#xBAA9;&amp;#xC801;&amp;#xC758; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xC0B0;&amp;#xC5C5;&amp;#xAD70;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC758;&amp;#xB8CC; 98%, &amp;#xC81C;&amp;#xC870; 96%, &amp;#xAD50;&amp;#xC721; 92%, &amp;#xC815;&amp;#xBD80;&amp;#xB7;&amp;#xACF5;&amp;#xACF5;&amp;#xAE30;&amp;#xAD00; 68% &amp;#xC21C;&amp;#xC73C;&amp;#xB85C; &amp;#xC9D1;&amp;#xACC4;&amp;#xB410;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xBAA9;&lt;/strong&gt; | &lt;a href=&#34;https://www.dailysecu.com/news/articleView.html?idxno=157256&#34;&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC8FC;&amp;#xBB38;&amp;#x2027;&amp;#xBC30;&amp;#xB2EC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, &amp;#xC790;&amp;#xC728;&amp;#xADDC;&amp;#xC81C;&amp;#xB85C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638; &amp;#xAC15;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xBB38;&amp;#xC911;&amp;#xAC1C;&amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC0AC;&amp;#xC640; &amp;#xC8FC;&amp;#xBB38;&amp;#xD1B5;&amp;#xD569;&amp;#xAD00;&amp;#xB9AC;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC0AC; &amp;#xBC0F; &amp;#xBC30;&amp;#xB2EC;&amp;#xB300;&amp;#xD589;&amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC0AC; &amp;#xAC04; &amp;#xC8FC;&amp;#xBB38;&amp;#xC815;&amp;#xBCF4; &amp;#xC1A1;&amp;#x2024;&amp;#xC218;&amp;#xC2E0;&amp;#xB3C4; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;(API) &amp;#xD6C4;&amp;#xD0B9; &amp;#xB4F1; &amp;#xC218;&amp;#xC2E0; &amp;#xC8FC;&amp;#xCCB4;&amp;#xAC00; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5C5;&amp;#xCCB4;&amp;#xAC00; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xC5D0;&amp;#xC774;&amp;#xD53C;&amp;#xC544;&amp;#xC774;(API) &amp;#xC5F0;&amp;#xB3D9; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xAC1C;&amp;#xC120;&amp;#xD558;&amp;#xC5EC; &amp;#xC548;&amp;#xC804;&amp;#xD558;&amp;#xAC8C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC804;&amp;#xC1A1;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xBCF4;&amp;#xD638;&amp;#xC870;&amp;#xCE58;&amp;#xB97C; &amp;#xAC15;&amp;#xD654;&amp;#xD558;&amp;#xC600;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#x2B50; &lt;strong&gt;&amp;#xAE08;&lt;/strong&gt; | &lt;a href=&#34;https://www.cepro.com/networking/critical-cybersecurity-vulnerabilities-in-smart-home-devices-uncovered-in-new-research/&#34;&gt;&amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xD648; &amp;#xAE30;&amp;#xAE30;&amp;#xC758; &amp;#xC2EC;&amp;#xAC01;&amp;#xD55C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBC1C;&amp;#xACAC;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;NETGEAR&amp;#xC640; Bitdefender &amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C; &lt;a href=&#34;https://www.netgear.com/hub/network/2024-iot-threat-report/&#34;&gt;2024 IoT &amp;#xBCF4;&amp;#xC548; &amp;#xD658;&amp;#xACBD; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&lt;/a&gt;&amp;#xB97C; &amp;#xBC1C;&amp;#xD45C;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774; &amp;#xBCF4;&amp;#xACE0;&amp;#xC11C;&amp;#xB294; &amp;#xC2A4;&amp;#xB9C8;&amp;#xD2B8; &amp;#xD648; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC131;&amp;#xACFC; &amp;#xACF5;&amp;#xACA9; &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xBC1D;&amp;#xD600;&amp;#xB0B4;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC804; &amp;#xC138;&amp;#xACC4;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; 91&amp;#xC5B5; &amp;#xAC1C; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xBCF4;&amp;#xC548; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC57D; 5&amp;#xCC9C;&amp;#xB9CC; &amp;#xAC1C;&amp;#xC758; IoT &amp;#xC7A5;&amp;#xCE58;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34;&gt;&lt;a href=&#34;#&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C;-&amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &#34;&gt;&lt;/a&gt;&amp;#xC9F9;&amp;#xC9F9;&amp;#xC774;&amp;#xC5D0;&amp;#xAC8C; &amp;#xBB3C;&amp;#xC5B4;&amp;#xBD10; &lt;img src=&#34;/img/keyword.gif&#34; width=&#34;30&#34; height=&#34;30&#34; style=&#34;float:left;&#34;&gt;&lt;/h2&gt;&lt;p&gt;&lt;strong&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xC774;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB85C;, &amp;#xD1B5;&amp;#xC2E0;&amp;#xC5C5;&amp;#xCCB4;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC758; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD574; &amp;#xC11C;&amp;#xBC84;&amp;#xC5D0; &amp;#xBAB0;&amp;#xB9AC;&amp;#xB294; &amp;#xBD80;&amp;#xD558;&amp;#xB97C; &amp;#xBD84;&amp;#xC0B0;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xB525;&amp;#xB9C1;&amp;#xD06C;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB9C1;&amp;#xD06C;(URL)&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xAC8C;&amp;#xC784;&amp;#xCCB4;&amp;#xC778;&amp;#xC800;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xC7A5;&amp;#xC758; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD1B5;&amp;#xC9F8;&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xAC70;&amp;#xB098; &amp;#xD310;&amp;#xB3C4;&amp;#xB97C; &amp;#xB4A4;&amp;#xC9D1;&amp;#xC5B4; &amp;#xB193;&amp;#xC744; &amp;#xB9CC;&amp;#xD55C; &amp;#xACB0;&amp;#xC815;&amp;#xC801; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD55C; &amp;#xC0AC;&amp;#xB78C;, &amp;#xC0AC;&amp;#xAC74;, &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, &amp;#xC81C;&amp;#xD488; &amp;#xB4F1;&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xB294; &amp;#xAC83;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#xC561;&amp;#xC138;&amp;#xC2A4; &amp;#xD1A0;&amp;#xD070;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB098; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xD2B9;&amp;#xC815; &amp;#xC790;&amp;#xC6D0;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC99D;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD0A4;&lt;/p&gt;
&lt;h3 id=&#34;&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34;&gt;&lt;a href=&#34;#&amp;#xC9C0;&amp;#xC2DD;-PLUS-&amp;#x2795;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&#34;&gt;&lt;/a&gt;&amp;#xC9C0;&amp;#xC2DD; PLUS &amp;#x2795;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://www.bankinfosecurity.com/no-patches-for-hospital-temperature-monitors-critical-flaws-a-25632&#34;&gt;&amp;#xBCD1;&amp;#xC6D0;&amp;#xC6A9; Temperature Monitors&amp;#x2019;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xD328;&amp;#xCE58; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130953&#34;&gt;&amp;#xAC70;&amp;#xB300; &amp;#xCD95;&amp;#xAD6C; &amp;#xD589;&amp;#xC0AC; UEFA, &amp;#xCD5C;&amp;#xADFC; &amp;#xB2E4;&amp;#xD06C;&amp;#xC6F9;&amp;#xC758; &amp;#xD574;&amp;#xCEE4;&amp;#xB4E4;&amp;#xC774; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://thehackernews.com/2024/06/apple-patches-airpods-bluetooth.html&#34;&gt;Apple, &amp;#xB3C4;&amp;#xCCAD;&amp;#xC744; &amp;#xD5C8;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; AirPods &amp;#xBE14;&amp;#xB8E8;&amp;#xD22C;&amp;#xC2A4; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD328;&amp;#xCE58;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130915&amp;amp;skind=6&#34;&gt;&amp;#xC628;&amp;#xB77C;&amp;#xC778; &amp;#xC8FC;&amp;#xBB38;&amp;#xB7;&amp;#xBC30;&amp;#xB2EC; &amp;#xBD84;&amp;#xC57C;, &amp;#x2018;&amp;#xBBFC;&amp;#xAD00;&amp;#xD611;&amp;#xB825; &amp;#xC790;&amp;#xC728;&amp;#xADDC;&amp;#xC81C;&amp;#x2019;&amp;#xB85C; &amp;#xAC1C;&amp;#xC778;&amp;#xC815;&amp;#xBCF4; &amp;#xBCF4;&amp;#xD638; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xAC15;&amp;#xD654;&amp;#xB410;&amp;#xB098;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130808&#34;&gt;AI &amp;#xB178;&amp;#xB9AC;&amp;#xB294; &amp;#xB300;&amp;#xD45C;&amp;#xC801; &amp;#xACF5;&amp;#xACA9; 3&amp;#xAC00;&amp;#xC9C0;&amp;#xB294;? AI &amp;#xBAA8;&amp;#xB378; &amp;#xACF5;&amp;#xC720; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;, AI &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;, &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC624;&amp;#xC5FC;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&#34;7&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34;&gt;&lt;a href=&#34;#7&amp;#xC6D4;-&amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;-&amp;#xB300;&amp;#xD68C;-&amp;#x1F425;&#34; class=&#34;headerlink&#34; title=&#34;7&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C; &amp;#x1F425;&#34;&gt;&lt;/a&gt;&lt;strong&gt;7&amp;#xC6D4; &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; | &amp;#xB300;&amp;#xD68C;&lt;/strong&gt; &amp;#x1F425;&lt;/h2&gt;&lt;p&gt;&lt;a href=&#34;https://www.boannews.com/media/view.asp?idx=130368&amp;amp;kind=3&amp;amp;sub_kind=&#34;&gt;&amp;#xC81C;10&amp;#xD68C; &amp;#xB300;&amp;#xD559;&amp;#xC0DD; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xC0BC;&amp;#xC131;&amp;#xC804;&amp;#xC790; | ~ 24.07.04&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://cryptocontest.kr/challenge/&#34;&gt;&amp;#xC554;&amp;#xD638;&amp;#xBD84;&amp;#xC11D;&amp;#xACBD;&amp;#xC9C4;&amp;#xB300;&amp;#xD68C;&lt;/a&gt; | &amp;#xD55C;&amp;#xAD6D;&amp;#xC815;&amp;#xBCF4;&amp;#xBCF4;&amp;#xD638;&amp;#xD559;&amp;#xD68C; | ~2408.31 &lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;http://www.itdaily.kr/news/articleView.html?idxno=223547&#34;&gt;&amp;#xAE08;&amp;#xC735;&amp;#xAD8C; &amp;#xBCF4;&amp;#xC548; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC2E0;&amp;#xACE0;&amp;#xD3EC;&amp;#xC0C1;&amp;#xC81C; (&amp;#xBC84;&amp;#xADF8;&amp;#xBC14;&amp;#xC6B4;&amp;#xD2F0;)&lt;/a&gt; | &amp;#xAE08;&amp;#xC735;&amp;#xBCF4;&amp;#xC548;&amp;#xC6D0; | ~24.08.31&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://iscr.cyber.go.kr/&#34;&gt;&amp;#xAD6D;&amp;#xC81C; &amp;#xC0AC;&amp;#xC774;&amp;#xBC84;&amp;#xBC94;&amp;#xC8C4;&amp;#xB300;&amp;#xC751; &amp;#xC2EC;&amp;#xD3EC;&amp;#xC9C0;&amp;#xC5C4;&lt;/a&gt; | &amp;#xACBD;&amp;#xCC30;&amp;#xCCAD; | 24.07.01 &amp;#xC0AC;&amp;#xC804; &amp;#xB4F1;&amp;#xB85D; &amp;#xC2DC;&amp;#xC791; (24.08.27 ~ 24.08.29)&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/Newsletter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2024/07/01/clalxk/newsletter0701/">

  <title>[] KT,        - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2024-07-01 17:00" pubdate>
      2024 7 1 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.6k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      91
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[] KT,       </h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, clalxk &#xC785;&#xB2C8;&#xB2E4; :D<br>7&#xC6D4; 1&#xC77C;, &#xC6D4;&#xC694;&#xC77C;&#xC774;&#xC5D0;&#xC694;!<br>&#xC660;&#xC9C0; &#xB7ED;&#xD0A4;&#xBE44;&#xD0A4;&#xD55C; 7&#xC6D4;&#xC774; &#xB420; &#xAC83; &#xAC19;&#xB124;&#xC694; &#x314E;&#x314E; </p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;-PICK&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9; PICK&#x1F425;</h2><blockquote>
<p>&#x26A0;&#xFE0F; KT, &#xC870;&#xC9C1;&#xC801; &#xD574;&#xD0B9;&#xD300; &#xAFB8;&#xB824; &#xD1B5;&#xC2E0;&#xB9DD; &#xAC10;&#xCCAD;&#xB7;&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC720;&#xD3EC; &#xC758;&#xD639;</p>
</blockquote>
<p>2024.06.24 | JTBC | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=qaF0NSLZ4cU">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.youtube.com/watch?v=qaF0NSLZ4cU">&#xC601;&#xC0C1;&#xBCF4;&#xAE30;</a></p>
<p><img src="https://img.youtube.com/vi/qaF0NSLZ4cU/0.jpg" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC601;&#xC0C1;"></p>
<p>&#xCD5C;&#xADFC; &#xD654;&#xC81C;&#xAC00; &#xB418;&#xACE0;&#xC788;&#xB294; &#xC0AC;&#xAC74;&#xC778;&#xB370;&#xC694;. </p>
<p>KT&#xAC00; &#xC6F9;&#xD558;&#xB4DC; &#xD639;&#xC740; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D;(&#xC2E4;&#xC2DC;&#xAC04; &#xC7AC;&#xC0DD;) &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1;&#xC744; &#xD6A8;&#xC728;&#xD654;&#xD574;&#xC8FC;&#xB294; &#x2018;<strong>&#xADF8;&#xB9AC;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</strong>&#x2018; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xD1B5;&#xC2E0; &#xC7A5;&#xC560;&#xB97C; &#xC77C;&#xC73C;&#xD0A8; &#xD610;&#xC758;&#xB85C; &#xACBD;&#xCC30; &#xC218;&#xC0AC;&#xB97C; &#xBC1B;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xD574;&#xB2F9; &#xC0AC;&#xAC74;&#xC740; &#xC57D; 4&#xB144; &#xC804;&#xC778; 2020&#xB144; &#xBD80;&#xD130; &#xC2DC;&#xC791;&#xB418;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p>&#xC9C0;&#xB09C; 2020&#xB144; 5&#xC6D4; &#xAD6D;&#xB0B4; &#xC6F9;&#xD558;&#xB4DC; &#xC218;&#xC2ED; &#xACF3;&#xC774; &#xBA39;&#xD1B5;&#xC774; &#xB418;&#xC5C8;&#xB358; &#xAC70; &#xC544;&#xC2DC;&#xB098;&#xC694;?</p>
<p>KT&#xAC00; &#xADF8;&#xB9AC;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC758; &#xD1B5;&#xC2E0;&#xC5D0; &#xACE0;&#xC758;&#xB85C; &#xC7A5;&#xC560;&#xB97C; &#xC77C;&#xC73C;&#xD0A8;&#xAC83;&#xC778;&#xB370;&#xC694; &#x1F631; &#xC57D; 60&#xB9CC; &#xBA85;&#xC5D0; &#xB2EC;&#xD558;&#xB294; &#xC774;&#xC6A9;&#xC790;&#xB4E4;&#xC774; &#xC6F9;&#xD558;&#xB4DC; &#xC774;&#xC6A9; &#xC2DC; &#xC11C;&#xBE44;&#xC2A4; &#xC624;&#xB958;&#xB97C; &#xACAA;&#xC5C8;&#xC5B4;&#xC694;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; KT&#xAC00; &#xADF8;&#xB9AC;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB9C9;&#xB294; &#xC77C;&#xC885;&#xC758; &#x2018;&#xC545;&#xC131; &#xCF54;&#xB4DC;&#x2019;&#xB97C; &#xBC30;&#xD3EC;&#xD588;&#xB2E4;&#xB294; &#xC758;&#xD639;&#xB3C4; &#xC81C;&#xAE30;&#xB418;&#xACE0; &#xC788;&#xC5B4;&#xC694;.</p>
<p>&#xC774;&#xD6C4; &#xACBD;&#xCC30;&#xC744; &#xD1B5;&#xD574; &#xBC1D;&#xD600;&#xC9C4; &#xD574;&#xD0B9; &#xACF5;&#xACA9;&#xC744; &#xD55C; &#xACF3;&#xC740; &#xB2E4;&#xB984; &#xC544;&#xB2CC; KT&#xC758; &#xB370;&#xC774;&#xD130;&#xC13C;&#xD130; &#xC911; &#xD558;&#xB098;&#xC778; &#xBD84;&#xB2F9; IDC &#xC13C;&#xD130;&#xC600;&#xC5B4;&#xC694;. &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xAD6D;&#xB0B4; &#xC6F9;&#xD558;&#xB4DC; &#xC218;&#xC2ED; &#xACF3;&#xC5D0; &#xD574;&#xD0B9; &#xACF5;&#xACA9;&#xC744; &#xC9C4;&#xD589;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xC5B4;&#xC694;. KT&#xAC00; &#xC9C1;&#xC811; &#xC77C;&#xBD80; &#xACE0;&#xAC1D;&#xB4E4;&#xC5D0;&#xAC8C; &#x2018;&#xC545;&#xC131; &#xCF54;&#xB4DC;&#x2019;&#xB97C; &#xC2EC;&#xC740; &#xC148;&#xC778;&#xAC70;&#xC8E0;. &#xC774;&#xB54C; <strong>&#x2018;&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAC1C;&#xBC1C;&#x2019;</strong> &#xB2F4;&#xB2F9;&#xACFC;, <strong>&#x2018;&#xC720;&#xD3EC;&#xC640; &#xC6B4;&#xC601;&#x2019;</strong> &#xB2F4;&#xB2F9;, &#xADF8;&#xB9AC;&#xACE0; KT &#xC774;&#xC6A9;&#xC790;&#xB4E4;&#xC774; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xB4E4;&#xC5EC;&#xB2E4;&#xBCF4;&#xB294; <strong>&#x2018;&#xAC10;&#xCCAD;&#x2019;</strong> &#xB2F4;&#xB2F9;&#xC73C;&#xB85C; &#xC5ED;&#xD560;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xC5EC; &#xD300;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xC744; &#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xC27D;&#xAC8C; &#xC720;&#xD3EC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC6F9;&#xD558;&#xB4DC; &#xC774;&#xC6A9;&#xC790;&#xB4E4;&#xACFC; &#xC11C;&#xBC84;&#xAC00; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; KT&#xAC00; &#xBC14;&#xAFBC; &#xC758;&#xD639;&#xB3C4; &#xBC1B;&#xACE0; &#xC788;&#xC5B4;&#xC694;..</p>
<p>&#xADF8;&#xB7EC;&#xB098; KT &#xCE21;&#xC740; &#xC6F9;&#xD558;&#xB4DC; &#xC5C5;&#xCCB4;&#xC758; &#xADF8;&#xB9AC;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4; &#xC790;&#xCCB4;&#xAC00; &#xC545;&#xC131; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC120; &#xC5B4;&#xCA54; &#xC218; &#xC5C6;&#xC5C8;&#xB2E4;&#xB294; &#xC785;&#xC7A5;&#xC744; &#xBC1D;&#xD614;&#xC5B4;&#xC694;. </p>
<p>&#xD558;&#xC9C0;&#xB9CC; <strong>KT &#xB370;&#xC774;&#xD130;&#xC13C;&#xD130;</strong>&#xC640; <strong>&#xBCF8;&#xC0AC;</strong>&#xB97C; &#xCC28;&#xB840;&#xB85C; &#xC555;&#xC218;&#xC218;&#xC0C9;&#xC744; &#xD55C; &#xACBD;&#xAE30;&#xB0A8;&#xBD80;&#xCCAD;&#xC740; <strong>KT&#xAC00; &#xD1B5;&#xC2E0;&#xBE44;&#xBC00;&#xBCF4;&#xD638;&#xBC95;&#xACFC; &#xC815;&#xBCF4;&#xD1B5;&#xC2E0;&#xB9DD;&#xBC95; &#xB4F1;&#xC744; &#xC704;&#xBC18;</strong>&#xD588;&#xC744; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xC218;&#xC0AC;&#xB97C; &#xC774;&#xC5B4;&#xAC00;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1F46E;</p>
<p>KT&#xB294; &#xACFC;&#xAC70;&#xC5D0;&#xB3C4; &#xADF8;&#xB9AC;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0AC;&#xC6A9;&#xC744; &#xB450;&#xACE0; &#xC6F9;&#xD558;&#xB4DC; &#xC5C5;&#xCCB4;&#xC640; &#xAC08;&#xB4F1;&#xC744; &#xBE5A;&#xC5C8;&#xC5B4;&#xC694;. &#xC9C0;&#xB09C; 2015&#xB144; &#xAC00;&#xC785;&#xC790;&#xC6A9; &#xC778;&#xD130;&#xB137; &#xD68C;&#xC120;&#xC758; &#xC0C1;&#xC5C5;&#xC6A9; &#xC774;&#xC6A9;&#xC744; &#xAE08;&#xC9C0;&#xD55C; &#xC774;&#xC6A9;&#xC57D;&#xAD00;&#xC5D0; &#xC704;&#xBC30;&#xB41C;&#xB2E4;&#xB294; &#xC774;&#xC720;&#xB85C; &#xC6F9;&#xD558;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4;&#xC6A9; &#xADF8;&#xB9AC;&#xB4DC; &#xC11C;&#xBC84;&#xC758; IP&#xB9CC;&#xC744; &#xACE8;&#xB77C; &#xCC28;&#xB2E8;&#xD588;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;.</p>
<p>&#xACBD;&#xCC30;&#xC740; &#xC9C0;&#xB09C;&#xD574; 11&#xC6D4; KT &#xC9C1;&#xC6D0;&#xACFC; KT &#xB2F9;&#xC2DC; &#xD611;&#xB825;&#xC5C5;&#xCCB4; &#xC9C1;&#xC6D0; &#xB4F1;&#xC744; &#xD3EC;&#xD568;&#xD55C; 13&#xBA85;&#xC744; &#xD2B9;&#xC815;&#xD574; &#xAC80;&#xCC30;&#xC5D0; &#xC1A1;&#xCE58;&#xD588;&#xC5B4;&#xC694;.</p>
<p>&#xD1B5;&#xC2E0;&#xC0AC;&#xB4E4;&#xC744; &#xAD00;&#xB9AC;&#xB7;&#xAC10;&#xB3C5;&#xD558;&#xB294; &#xACFC;&#xD559;&#xAE30;&#xC220;&#xC815;&#xBCF4;&#xD1B5;&#xC2E0;&#xBD80;&#xB294; &#xC9C0;&#xB09C;&#xD574; 9&#xC6D4; &#xC774; &#xC0AC;&#xC548;&#xC744; &#xC54C;&#xC558;&#xC9C0;&#xB9CC;, &#xC218;&#xC0AC;&#xC911;&#xC774;&#xB77C;&#xB294; &#xC774;&#xC720;&#xB85C; &#xC5B4;&#xB5A4; &#xC870;&#xCE58;&#xB3C4; &#xD558;&#xC9C0; &#xC54A;&#xC740; &#xAC78;&#xB85C; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;.. &#x1F92F;</p>
<p>&#xD574;&#xB2F9; &#xC0AC;&#xAC74;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xC9C4;&#xD589;&#xB418;&#xB294; &#xC9C0; &#xB274;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xACC4;&#xC18D; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD560; &#xAC83; &#xAC19;&#xB124;&#xC694;. </p>
<p>&#xD574;&#xD0B9;&#xC9F9;&#xC9F9;&#xACFC; &#xD568;&#xAED8; &#xD574;&#xC694;~&#x1F425;</p>
<h2 id><a href="#" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; &#xCE74;&#xCE74;&#xC624;&#xD1A1;&#xC5D0;&#xC11C; &#x2018;&#xC6D0;&#xD074;&#xB9AD;&#x2019; &#xCDE8;&#xC57D;&#xC810; &#xBC1C;&#xACAC;&#x2026; &#xADF8;&#xB7EC;&#xB098; &#xC678;&#xAD6D;&#xC778;&#xC774;&#xB77C; &#xBCF4;&#xC0C1; &#xC5C6;&#xC5B4;</p>
</blockquote>
<p>2024.06.28 | &#xB514;&#xC9C0;&#xD138;&#xD0C0;&#xC784;&#xC2A4; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.dt.co.kr/contents.html?article_no=2024062802109931081012">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xCE74;&#xCE74;&#xC624;&#xD1A1;&#xC5D0;&#xC11C; &#x2018;&#xC6D0;&#xD074;&#xB9AD;&#x2019; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC5B4;&#xC694;!</p>
<p>&#xB2E4;&#xB978; &#xC774;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC744; &#xD0C8;&#xCDE8;&#xD574; &#xC8FC;&#xACE0;&#xBC1B;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xD6D4;&#xCCD0;&#xBCFC; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB294;&#xB370;&#xC694;&#x2026;&#x1F631; </p>
<p><img src="/2024/07/01/clalxk/newsletter0701/image1.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xCE74;&#xCE74;&#xC624;&#xD1A1; 10.4.3 &#xBC84;&#xC804;&#xC758; <strong>&#xB525;&#xB9C1;&#xD06C; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC; &#xBB38;&#xC81C;</strong>&#xB85C; &#xC778;&#xD574; &#xC6D0;&#xACA9; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC6F9;&#xBDF0;&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0;, HTTP &#xC694;&#xCCAD; &#xD5E4;&#xB354;&#xC758; <strong>&#xC561;&#xC138;&#xC2A4; &#xD1A0;&#xD070;&#xC744;</strong> <strong>&#xC720;&#xCD9C;</strong>&#xD560; &#xC218; &#xC788;&#xB294; &#xBB38;&#xC81C;&#xC600;&#xC5B4;&#xC694;.</p>
<p>&#xC774; &#xD1A0;&#xD070;&#xC744; &#xACF5;&#xACA9;&#xC790;&#xC758; &#xAE30;&#xAE30;&#xC5D0; &#xB4F1;&#xB85D;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xB2E4;&#xB978; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC744; &#xD0C8;&#xCDE8;&#xD558;&#xACE0; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC77D;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2023-51219">CVE-2023-51219</a>&#xB85C; &#xBA85;&#xBA85;&#xB418;&#xC5C8;&#xC5B4;&#xC694;.</p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xB354; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://stulle123.github.io/posts/kakaotalk-account-takeover/">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xC138;&#xC694;!</p>
<p><img src="/2024/07/01/clalxk/newsletter0701/image2.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xCE74;&#xCE74;&#xC624;&#xD1A1;&#xC740; &#xC790;&#xC0AC; &#xC6F9;&#xACFC; &#xC571; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0AC;&#xC804;&#xC5D0; &#xBC1C;&#xAD74;&#xD558;&#xACE0; &#xC870;&#xCE58;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;! &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xBCF4;&#xC548; &#xC804;&#xBB38;&#xAC00;, &#xC774;&#xC6A9;&#xC790;&#xAC00; &#xCE74;&#xCE74;&#xC624; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD574; &#xC81C;&#xBCF4;&#xD558;&#xBA74; &#xC704;&#xD5D8;&#xB3C4;&#xC640; &#xBC1C;&#xAD74; &#xB09C;&#xC774;&#xB3C4; &#xB4F1;&#xC744; &#xC885;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xAC80;&#xD1A0;&#xD574; &#xCD5C;&#xC18C; 5&#xB9CC; &#xC6D0;&#xC5D0;&#xC11C; &#xCD5C;&#xB300; 1,000&#xB9CC; &#xC6D0;&#xC758; &#xD3EC;&#xC0C1;&#xAE08;&#xC744; &#xC81C;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xC9C0;&#xAE09;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;. &#xB2E4;&#xB9CC; &#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xCC38;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xB294; &#xCC38;&#xC5EC;&#xC790;&#xB294; &#xAD6D;&#xB0B4;&#xC678; &#xAC70;&#xC8FC;&#xD558;&#xB294; <strong>&#xD55C;&#xAD6D;&#xC778;&#xC73C;&#xB85C; &#xD55C;&#xC815;</strong>&#xB418;&#xC5B4; &#xC788;&#xC5B4;&#xC694;.</p>
<p>&#xC81C;&#xBCF4;&#xC790;&#xB294; &#xC9C0;&#xB09C;&#xD574; 12&#xC6D4; &#xCE74;&#xCE74;&#xC624;&#xC5D0; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBCF4;&#xACE0;&#xD588;&#xC73C;&#xB098;, &#xD55C;&#xAD6D; &#xAD6D;&#xC801;&#xC790;&#xB9CC; &#xD3EC;&#xC0C1;&#xAE08;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC5B4; &#xACB0;&#xAD6D; &#xC544;&#xBB34;&#xB7F0; &#xBCF4;&#xC0C1;&#xB3C4; &#xBC1B;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F972; </p>
<p>&#xC81C;&#xBCF4;&#xC790;&#xAC00; &#xAE43;&#xD5C8;&#xBE0C;&#xC5D0; &#xAE00;&#xC744; &#xAC8C;&#xC2DC;&#xD558;&#xBA74;&#xC11C; &#xD654;&#xC81C;&#xAC00; &#xB418;&#xC5C8;&#xB294;&#xB370;, &#xCE74;&#xCE74;&#xC624;&#xD1A1;&#xC774; &#xAD6D;&#xB0B4; &#xC774;&#xC6A9;&#xC790;&#xAC00; &#xB300;&#xBD80;&#xBD84;&#xC778; &#xD50C;&#xB7AB;&#xD3FC;&#xC778; &#xB9CC;&#xD07C; &#xC5B4;&#xCA54; &#xC218; &#xC5C6;&#xB2E4;&#xB294; &#xC758;&#xACAC;&#xB3C4; &#xB098;&#xC624;&#xB294; &#xD55C;&#xD3B8;, &#xD574;&#xC678;&#xC5D0;&#xC11C; &#xCE74;&#xCE74;&#xC624;&#xD1A1;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xBCF4;&#xC0C1;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC5C6;&#xC5B4; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xB97C; &#xC81C;&#xBCF4;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xACB0;&#xAD6D; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC545;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC6B0;&#xB824;&#xB3C4; &#xB098;&#xC624;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1F600;</p>
<p>&#xCC38;&#xACE0;&#xB85C; &#xCE74;&#xCE74;&#xC624;&#xC640; &#xB3D9;&#xC77C;&#xD558;&#xAC8C;, &#xD55C;&#xAD6D;&#xC778;&#xD130;&#xB137;&#xC9C4;&#xD765;&#xC6D0;(KISA)&#xC774; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810; &#xC2E0;&#xACE0;&#xD3EC;&#xC0C1;&#xC81C; &#xC5ED;&#xC2DC; &#xCC38;&#xAC00; &#xB300;&#xC0C1;&#xC744; &#xAD6D;&#xB0B4;, &#xC678; &#xAC70;&#xC8FC;&#xD558;&#xB294; &#xD55C;&#xAD6D;&#xC778;&#xC73C;&#xB85C; &#xD55C;&#xC815;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. </p>
<p>&#xADF8;&#xB7EC;&#xB098; &#xD574;&#xC678; &#xAE30;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xB300;&#xBD80;&#xBD84; &#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;&#xC5D0; &#xAD6D;&#xC801; &#xC81C;&#xD55C;&#xC744; &#xB450;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xAD6D;&#xB0B4;&#xC758; &#xACBD;&#xC6B0; &#xC0BC;&#xC131; &#xBAA8;&#xBC14;&#xC77C;&#xC774; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC131; &#xBCF4;&#xACE0; &#xBCF4;&#xC0C1; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xC815;&#xBD80;&#xC758; &#xC81C;&#xC7AC;&#xB97C; &#xBC1B;&#xC740; &#xAD6D;&#xAC00;&#xC758; &#xAC70;&#xC8FC;&#xC790;&#xB97C; &#xC81C;&#xC678;&#xD558;&#xBA74; &#xC81C;&#xBCF4;&#xC790;&#xC758; &#xAD6D;&#xC801;&#xC744; &#xB530;&#xB85C; &#xC81C;&#xD55C;&#xD558;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F62E;</p>
<h2 id="-1"><a href="#-1" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC744; &#xBBF8;&#xB798; &#xAD6D;&#xBC29; &#xAC8C;&#xC784;&#xCCB4;&#xC778;&#xC800;&#xB85C;&#x2026;&#x2018;&#xBBFC;&#xAD00;&#xAD70; &#xC591;&#xC790;&#xC815;&#xBCF4;&#xD611;&#xC758;&#xD68C;&#x2019; &#xACF5;&#xC2DD; &#xCD9C;&#xBC94;</p>
</blockquote>
<p>2024.06.27 | &#xB370;&#xC77C;&#xB9AC;&#xC2DC;&#xD050; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=157257">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xC591;&#xC790; &#xACFC;&#xD559; &#xAE30;&#xC220;! &#xB2E4;&#xB4E4; &#xD55C;&#xBC88;&#xC529;&#xC740; &#xB4E4;&#xC5B4;&#xBCF4;&#xC168;&#xC744; &#xAC83; &#xAC19;&#xC740;&#xB370;&#xC694; &#x1F600; </p>
<p>&#xC591;&#xC790; &#xACFC;&#xD559; &#xAE30;&#xC220;&#xC774;&#xB780; &#xC591;&#xC790;&#xC5ED;&#xD559;&#xC801; &#xD2B9;&#xC131;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xAE30;&#xC874; &#xAE30;&#xC220;&#xC758; &#xC774;&#xB860;&#xC801; &#xD55C;&#xACC4;&#xB97C; &#xB3CC;&#xD30C;&#xD558;&#xB294; &#xCD08;&#xC815;&#xBC00; &#xACC4;&#xCE21;(&#xC591;&#xC790;&#xC13C;&#xC11C;), &#xC591;&#xC790;&#xAE30;&#xAE30;&#xAC04; &#xCD08;&#xC2E0;&#xB8B0;&#xC5F0;&#xACB0;(&#xC591;&#xC790;&#xD1B5;&#xC2E0;), &#xCD08;&#xACE0;&#xC18D;&#xC5F0;&#xC0B0;(&#xC591;&#xC790;&#xCEF4;&#xD4E8;&#xD130;)&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xB294; &#xAE30;&#xC220;&#xC774;&#xC5D0;&#xC694;. </p>
<p>&#xCD5C;&#xADFC; &#xC815;&#xBD80;&#xB294; &#xD070; &#xD30C;&#xAE09;&#xB825;&#xC5D0; &#xC8FC;&#xBAA9;&#xD558;&#xC600;&#xACE0;, &#xC774; &#xAE30;&#xC220;&#xC744; 3&#xB300; &#xAC8C;&#xC784;&#xCCB4;&#xC778;&#xC800; &#xC911; &#xD558;&#xB098;&#xB85C; &#xC9C0;&#xC815;&#xD558;&#xC5EC; &#xC778;&#xB825;&#xC744; &#xC721;&#xC131;&#xD558;&#xACE0;&#xC790; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC774;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1F62E;</p>
<p>&#xBBF8;&#xAD6D; &#xAD6D;&#xBC29;&#xBD80;&#xB294; &#xAD6D;&#xBC29;&#xAE30;&#xC220;&#xC804;&#xB7B5;&#xC5D0;&#xC11C; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC744; 14&#xB300; &#xAD6D;&#xBC29; &#xD575;&#xC2EC;&#xAE30;&#xC220;&#xC758; &#xD558;&#xB098;&#xB85C; &#xC120;&#xC815;(2023&#xB144;)&#xD558;&#xC600;&#xACE0;, &#xC601;&#xAD6D;&#xB3C4; &#xAD6D;&#xAC00;&#xC591;&#xC790;&#xC804;&#xB7B5;&#xC5D0;&#xC11C; &#xC591;&#xC790;&#xC13C;&#xC11C;&#xC758; &#xAD6D;&#xBC29;&#xC801;&#xC6A9;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xC124;&#xC815;(2023&#xB144;)&#xD558;&#xC600;&#xC73C;&#xBA70;, &#xD504;&#xB791;&#xC2A4;&#xB294; &#xC591;&#xC790;&#xD56D;&#xBC95;&#xC758; &#xD574;&#xAD70; &#xC218;&#xC0C1; &#xD568;&#xC815; &#xC801;&#xC6A9;&#xACC4;&#xD68D;&#xC744; &#xBC1C;&#xD45C;(2022&#xB144;)&#xD558;&#xB294; &#xB4F1; &#xD574;&#xC678; &#xC8FC;&#xC694;&#xAD6D;&#xC740; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC758; &#xAD6D;&#xBC29; &#xC801;&#xC6A9;&#xC744; &#xC704;&#xD574; &#xB178;&#xB825;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. </p>
<p>&#xC6B0;&#xB9AC; &#xC815;&#xBD80;&#xB3C4; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC758; &#xAD6D;&#xBC29; &#xBD84;&#xC57C; &#xC801;&#xC6A9;&#xC744; &#xC704;&#xD55C; &#xB178;&#xB825;&#xC744; &#xC9C0;&#xC18D;&#xD574; &#xC654;&#xB294;&#xB370;&#xC694;! &#x1F60E;</p>
<p>&#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;&#xB294; &#xC791;&#xB144; &#x2018;&#xB300;&#xD55C;&#xBBFC;&#xAD6D; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220; &#xC804;&#xB7B5;&#x2019;&#xC758; 7&#xB300; &#xCD94;&#xC9C4; &#xBC29;&#xD5A5; &#xC911; &#xD558;&#xB098;&#xB85C;&#x2018;&#xAD6D;&#xBC29;&#xB7;&#xC548;&#xBCF4; &#xB3C4;&#xC785; &#xCD94;&#xC9C4;&#x2019;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC600;&#xACE0;, &#xAD6D;&#xBC29;&#xBD80;&#xB294; &#xC791;&#xB144; 10&#xB300; &#xAD6D;&#xBC29;&#xC804;&#xB7B5;&#xAE30;&#xC220; &#xC911;&#xC758; &#xD558;&#xB098;&#xB85C; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC744; &#xC120;&#xC815;&#xD558;&#xC5EC; &#xAE30;&#xC220;&#xC758; &#xAD6D;&#xBC29; &#xC801;&#xC6A9;&#xC131;&#xC5D0; &#xC8FC;&#xBAA9;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694;. </p>
<p><img src="/2024/07/01/clalxk/newsletter0701/image3.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;&#xB294; &#xAD6D;&#xBC29;&#xBD80;&#xC640; &#xACF5;&#xB3D9;&#xC73C;&#xB85C;, &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220;&#xC758; &#xAD6D;&#xBC29;&#xBD84;&#xC57C; &#xC801;&#xC6A9;&#xB7;&#xD655;&#xC0B0;&#xC744; &#xC704;&#xD55C; &#x2018;<strong>&#xBBFC;&#xAD00;&#xAD70; &#xC591;&#xC790;&#xC815;&#xBCF4;&#xD611;&#xC758;&#xD68C;&#x2018;</strong>&#xB97C; 6&#xC6D4; 27&#xC77C; &#xCD9C;&#xBC94;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;! </p>
<p>&#xC774;&#xB294; 2024&#xB144; 4&#xC6D4; &#xCCB4;&#xACB0;&#xD55C; &#xACFC;&#xAE30;&#xC815;&#xD1B5;&#xBD80;&#xB7;&#xAD6D;&#xBC29;&#xBD80; &#xC7A5;&#xAD00;&#xAC04; &#xAD6D;&#xBC29;&#xACFC;&#xD559;&#xAE30;&#xC220; &#xD611;&#xB825; MOU &#xD6C4;&#xC18D;&#xC870;&#xCE58;&#xB85C;&#xC11C; &#xC591;&#xC790;&#xACFC;&#xD559;&#xAE30;&#xC220; &#xAC1C;&#xBC1C;&#xACFC; &#xC0B0;&#xC5C5;&#xCC3D;&#xCD9C;, &#xAD6D;&#xBC29;&#xD601;&#xC2E0;&#xC758; &#xC120;&#xC21C;&#xD658; &#xAD6C;&#xC870;&#xB97C; &#xAD6C;&#xCD95;&#xD558;&#xB294; &#xB370; &#xAE30;&#xC5EC;&#xD560; &#xAC83;&#xC73C;&#xB85C; &#xAE30;&#xB300;&#xB41C;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694; &#x1F632;</p>
<h2 id="-2"><a href="#-2" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x26A0;&#xFE0F; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xD574;&#xD0B9;&#xD558;&#xB294; &#xC2E0;&#xC885; &#xB9AC;&#xB205;&#xC2A4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xB4F1;&#xC7A5; &#x1F631;</p>
</blockquote>
<p>2024.06.17 | &#xB370;&#xC77C;&#xB9AC;&#xC2DC;&#xD050; | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=156885">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p>&#xD5C9; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB77C;&#xB2C8;&#xC694; &#x1F631;&#x1F630;&#x1F628;</p>
<p>&#x2018;<strong>&#xB514;&#xC2A4;&#xACE0;&#xBAA8;&#xC9C0;(DISGOMOJI)</strong>&#x2018;&#xB77C;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC5B4;&#xC694;! &#xC774; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB294; &#xB9AC;&#xB205;&#xC2A4; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xBA70;, &#xB514;&#xC2A4;&#xCF54;&#xB4DC;(Discord)&#xC640; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xBA85;&#xB839; &#xBC0F; &#xC81C;&#xC5B4;(C2) &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xD1B5;&#xD574; &#xAC10;&#xC5FC;&#xB41C; &#xC7A5;&#xCE58;&#xB97C; &#xC81C;&#xC5B4;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;.</p>
<p><img src="/2024/07/01/clalxk/newsletter0701/image4.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xB514;&#xC2A4;&#xACE0;&#xBAA8;&#xC9C0;&#xC758; &#xD2B9;&#xC9D5;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC778; discord-c2&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xB514;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; C2 &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC778;&#xB370;&#xC694;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xB514;&#xC2A4;&#xCF54;&#xB4DC; &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xD2B9;&#xC815; &#xC774;&#xBAA8;&#xC9C0; &#xAE30;&#xBC18; &#xBA85;&#xB839;&#xC744; &#xC218;&#xD589;&#xD574;&#xC694;. &#xC544;&#xD649; &#xAC1C;&#xC758; &#xC774;&#xBAA8;&#xC9C0;&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xBA85;&#xB839;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xBA70;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC258; &#xBA85;&#xB839; &#xC2E4;&#xD589;, &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7; &#xCD2C;&#xC601;, &#xD30C;&#xC77C; &#xD0C8;&#xCDE8; &#xB4F1;&#xC758; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1F62E;</p>
<p>&#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC774;&#xBAA8;&#xC9C0;&#xB85C; &#xB300;&#xCCB4;&#xD558;&#xB2E4;&#xB2C8;&#x2026; &#xC815;&#xB9D0; &#xCC3D;&#xC758;&#xC801;&#xC774;&#xB124;&#xC694;!</p>
<p>&#xC0AC;&#xC6A9;&#xB41C; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC544;&#xC694;.</p>
<p>1) &#x1F3C3;&#x200D;&#x2642;&#xFE0F; : &#xD53C;&#xD574;&#xC790;&#xC758; &#xC7A5;&#xBE44;&#xC5D0;&#xC11C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;. &#xC774; &#xB54C; &#xBA85;&#xB839; &#xC218;&#xD589;&#xC744; &#xC704;&#xD55C; &#xC544;&#xADDC;&#xBA3C;&#xD2B8;&#xB97C; &#xB530;&#xB85C; &#xBC1B;&#xB294;&#xB2E4;.</p>
<p>2) &#x1F4F8; : &#xD53C;&#xD574;&#xC790;&#xC758; &#xD654;&#xBA74;&#xC744; &#xCEA1;&#xCCD0;&#xD574; &#xC11C;&#xBC84;&#xB85C; &#xC5C5;&#xB85C;&#xB4DC; &#xD55C;&#xB2E4;.</p>
<p>3) &#x1F447; : &#xD53C;&#xD574;&#xC790;&#xC758; &#xC7A5;&#xBE44;&#xB85C;&#xBD80;&#xD130; &#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC1B;&#xC544; &#xACF5;&#xACA9;&#xC790;&#xC758; &#xC11C;&#xBC84;&#xB85C; &#xC5C5;&#xB85C;&#xB4DC; &#xD55C;&#xB2E4;.</p>
<p>4) &#x261D;&#xFE0F; : &#xD53C;&#xD574;&#xC790;&#xC758; &#xC7A5;&#xBE44;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xC2EC;&#xB294;&#xB2E4;.</p>
<p>5) &#x1F449; : &#xD53C;&#xD574;&#xC790; &#xC7A5;&#xBE44;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xC6D0;&#xACA9; &#xD30C;&#xC77C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xC11C;&#xBE44;&#xC2A4;&#xC778; &#xC624;&#xC2DC;(Oshi)&#xB85C; &#xC62E;&#xAE34;&#xB2E4;.</p>
<p>6) &#x1F448; : &#xD53C;&#xD574;&#xC790; &#xC7A5;&#xBE44;&#xC758; &#xD30C;&#xC77C;&#xC744; &#xB610; &#xB2E4;&#xB978; &#xC6D0;&#xACA9; &#xD30C;&#xC77C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xC11C;&#xBE44;&#xC2A4;&#xC778; &#xD2B8;&#xB79C;&#xC2A4;&#xD37C;(transfer.sh)&#xB85C; &#xC62E;&#xAE34;&#xB2E4;.</p>
<p>7) &#x1F525; : &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xBBF8;&#xB9AC; &#xC815;&#xC758;&#xD55C; &#xB0B4;&#xC6A9;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xCC3E;&#xC544; &#xACF5;&#xACA9;&#xC790;&#xC758; &#xC11C;&#xBC84;&#xB85C; &#xC804;&#xC1A1;&#xD55C;&#xB2E4;.</p>
<p>8) &#x1F98A; : &#xD53C;&#xD574;&#xC790; &#xC7A5;&#xBE44; &#xB0B4; &#xD30C;&#xC774;&#xC5B4;&#xD3ED;&#xC2A4; &#xD504;&#xB85C;&#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xC555;&#xCD95;&#xD574; &#xACF5;&#xACA9;&#xC790;&#xC5D0;&#xAC8C; &#xC804;&#xC1A1;&#xD55C;&#xB2E4;.</p>
<p>9) &#x1F480; : &#xBA40;&#xC6E8;&#xC5B4;&#xC758; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xC2DC;&#xD0A8;&#xB2E4;.</p>
<p>&#xB514;&#xC2A4;&#xACE0;&#xBAA8;&#xC9C0;&#xAC00; &#xC774; &#xBA85;&#xB839;&#xC744; &#xBC1B;&#xC544; &#xCC98;&#xB9AC;&#xD558;&#xBA74; &#xC2DC;&#xACC4; &#xBAA8;&#xC591; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xB2E4;&#xC2DC; &#xC11C;&#xBC84;&#xB85C; &#xB0B4;&#xBCF4;&#xB0B4;&#xC5B4;, &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC774; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xBC1B;&#xC544; &#x201C;&#xBA85;&#xB839;&#xC774; &#xC798; &#xC218;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#x201D;&#xB294; &#xAC78; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC5B4;&#xC694;. &#xB610;&#xD55C; &#xBA85;&#xB839;&#xC774; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xB514;&#xC2A4;&#xACE0;&#xBAA8;&#xC9C0;&#xAC00; &#xCD08;&#xB85D;&#xC0C9; &#xB124;&#xBAA8; &#xBC15;&#xC2A4;&#xC5D0; &#xCCB4;&#xD06C; &#xD45C;&#xC2DC;&#xAC00; &#xB41C; &#xBAA8;&#xC591;&#xC758; &#xC774;&#xBAA8;&#xD2F0;&#xCF58;&#xC744; &#xACF5;&#xACA9;&#xC790;&#xC5D0;&#xAC8C; &#xC804;&#xC1A1;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC694;! &#x1FAE0;&#x1F62E;</p>
<p>&#xC774; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB294; &#xD30C;&#xD0A4;&#xC2A4;&#xD0C4; &#xD574;&#xD0B9; &#xADF8;&#xB8F9; <strong>UTA0137</strong>&#xC774; &#xC81C;&#xC791;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xACE0; &#xC788;&#xC5B4;&#xC694;. &#xD30C;&#xD0A4;&#xC2A4;&#xD0C4; &#xD574;&#xCEE4;&#xB4E4;&#xC774; &#xC790;&#xC8FC; &#xB178;&#xB9AC;&#xB294; &#xC778;&#xB3C4;&#xC758; &#xC815;&#xBD80; &#xAE30;&#xAD00;&#xB4E4;&#xC740; &#xACF5;&#xBB34;&#xC6D0;&#xB4E4;&#xC774; &#xB9AC;&#xB205;&#xC2A4; &#xAE30;&#xBC18; &#xB370;&#xC2A4;&#xD06C;&#xD1B1;&#xC744; &#xC5C5;&#xBB34;&#xC5D0; &#xD65C;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xB9C8;&#xCE68; &#xC774; &#xB514;&#xC2A4;&#xACE0;&#xBAA8;&#xC9C0; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; ZIP &#xC555;&#xCD95; &#xD30C;&#xC77C; &#xB0B4; UPX&#xB85C; &#xD328;&#xD0B9;&#xB41C; ELF &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xD53C;&#xC2F1; &#xC774;&#xBA54;&#xC77C;&#xC744; &#xD1B5;&#xD574; &#xBC30;&#xD3EC;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;! </p>
<p>&#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.volexity.com/blog/2024/06/13/disgomoji-malware-used-to-target-indian-government/">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD574;&#xC8FC;&#xC138;&#xC694;!</p>
<h2 id="-3"><a href="#-3" class="headerlink" title=" "></a> </h2><blockquote>
<p>&#x1F5E3;&#xFE0F; OpenAI, &#xC911;&#xAD6D;, &#xB7EC;&#xC2DC;&#xC544;, &#xC774;&#xB780; &#xC0AC;&#xC6A9;&#xC790;&#xC758; ChatGPT &#xC561;&#xC138;&#xC2A4; &#xC911;&#xB2E8;</p>
</blockquote>
<p>2024.06.26 | bankinfosecurity | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bankinfosecurity.com/openai-drops-chatgpt-access-for-users-in-china-russia-iran-a-25631">&#xAE30;&#xC0AC;&#xBCF4;&#xAE30;</a></p>
<p><img src="/2024/07/01/clalxk/newsletter0701/image5.png" srcset="/img/loading.gif" alt="&#xAE30;&#xC0AC;&#xC0AC;&#xC9C4;"></p>
<p>&#xC624;&#xD508;AI&#xAC00; &#xB7EC;&#xC2DC;&#xC544;&#xC640; &#xC911;&#xAD6D;, &#xC774;&#xB780; &#xB4F1; &#xC11C;&#xBE44;&#xC2A4; &#xC9C0;&#xC6D0; &#xB300;&#xC0C1;&#xC5D0;&#xC11C; &#xC81C;&#xC678;&#xB41C; &#xAD6D;&#xAC00; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; 7&#xC6D4; 9&#xC77C; &#xC774;&#xD6C4; &#xC811;&#xADFC;&#xC744; &#xCC28;&#xB2E8;&#xD560; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xBA54;&#xC77C;&#xB85C; &#xD1B5;&#xBCF4;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC694; &#x1FAE2;</p>
<p>&#xC774;&#xBA54;&#xC77C; &#xB0B4;&#xC6A9;&#xC774; &#xC624;&#xD508;AI &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xD3EC;&#xB7FC;&#xC5D0; &#xAC8C;&#xC2DC;&#xB418;&#xC5C8;&#xB294;&#xB370;&#xC694;!</p>
<p>&#x2018;&#xC790;&#xC0AC; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xADC0;&#xC0AC; API &#xD2B8;&#xB798;&#xD53D;&#xC774; &#xD604;&#xC7AC; &#xC624;&#xD508;AI&#xAC00; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xC9C0;&#xC5ED;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD588;&#xB2E4;&#xBA70; &#xC9C0;&#xC6D0;&#xB418;&#xB294; &#xAD6D;&#xAC00;&#xC640; &#xC9C0;&#xC5ED; &#xBAA9;&#xB85D;&#xC744; &#xBC1D;&#xD788;&#xACE0; 7&#xC6D4; 9&#xC77C;&#xBD80;&#xD130; &#xC9C0;&#xC6D0;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAD6D;&#xAC00;&#xC640; &#xC9C0;&#xC5ED;&#xC73C;&#xB85C;&#xBD80;&#xD130;&#xC758; API &#xD2B8;&#xB798;&#xD53D;&#xC744; &#xCC28;&#xB2E8;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCD94;&#xAC00; &#xC870;&#xCE58;&#xB97C; &#xCDE8;&#xD560; &#xAC83;&#x2019; &#xC774;&#xB77C;&#xB294; &#xB0B4;&#xC6A9;&#xC774; &#xB2F4;&#xACA8;&#xC838; &#xC788;&#xC5C8;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;. </p>
<p>&#xC774;&#xBA54;&#xC77C;&#xC5D0;&#xC11C; &#xACF5;&#xAC1C; &#xB41C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://platform.openai.com/docs/supported-countries">&#xC11C;&#xBE44;&#xC2A4; &#xC9C0;&#xC6D0; &#xBAA9;&#xB85D;</a>&#xC5D0;&#xB294; &#xBBF8;&#xAD6D;, &#xCE90;&#xB098;&#xB2E4;, EU &#xAD6D;&#xAC00;, &#xC544;&#xC2DC;&#xC544;, &#xC544;&#xD504;&#xB9AC;&#xCE74; &#xC77C;&#xBD80; &#xB4F1; &#xC804; &#xC138;&#xACC4; &#xB9CE;&#xC740; &#xAD6D;&#xAC00;&#xB294; &#xC788;&#xC9C0;&#xB9CC; <strong>&#xC911;&#xAD6D;, &#xB7EC;&#xC2DC;&#xC544;, &#xBD81;&#xD55C;, &#xC774;&#xB780;</strong> &#xB4F1; &#xC77C;&#xBD80; &#xAD6D;&#xAC00;&#xC758; &#xC774;&#xB984;&#xC740; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC5C6;&#xC5C8;&#xC5B4;&#xC694;. </p>
<p>&#xBCF4;&#xB3C4;&#xC5D0;&#xC120; &#xC774;&#xBC88;&#xC5D0; &#xC624;&#xD508;AI&#xAC00; &#xC911;&#xAD6D;&#xC744; &#xD3EC;&#xD568;&#xD55C; 4&#xAC1C;&#xAD6D;&#xC73C;&#xB85C;&#xBD80;&#xD130;&#xC758; &#xC811;&#xADFC;&#xC744; &#xCC28;&#xB2E8;&#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD55C; &#xAC74; &#xBBF8;&#xAD6D;&#xACFC; &#xC911;&#xAD6D;&#xAC04; &#xAE34;&#xC7A5;&#xC774; &#xACE0;&#xC870;&#xB418;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xACFC; &#xC9C0;&#xB09C; 2&#xC6D4; &#xBCF4;&#xB3C4;&#xB41C; &#xC774; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.aitimes.com/news/articleView.html?idxno=157207">&#xAE30;&#xC0AC;</a>&#xAC00; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCCE4;&#xC744; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xCD94;&#xC815;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC694; &#x1FAE0;</p>
<h2 id="&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;&#xC774;&#xC758;-&#xD558;&#xB8E8;-&#x1F425;"><a href="#&#xC774;&#xBC88;-&#xC8FC;-&#xC9F9;&#xC9F9;&#xC774;&#xC758;-&#xD558;&#xB8E8;-&#x1F425;" class="headerlink" title="&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9;&#xC774;&#xC758; &#xD558;&#xB8E8; &#x1F425;"></a>&#xC774;&#xBC88; &#xC8FC; &#xC9F9;&#xC9F9;&#xC774;&#xC758; &#xD558;&#xB8E8; &#x1F425;</h2><blockquote>
<p>&#x2B50; <strong>&#xC6D4;</strong> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=157113">&#xBCF4;&#xC548;&#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC548;&#xB418;&#xB294; &#xAD6C;&#xD615; &#xC548;&#xB4DC;&#xB85C;&#xC774;&#xB4DC; &#xAE30;&#xAE30; &#xB178;&#xB9AC;&#xB294; &#xB798;&#xD2C0; RAT&#x2026;&#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xACF5;&#xACA9; &#xC8FC;&#xC758;</a></p>
</blockquote>
<p>&#xB798;&#xD2C0; RAT&#xB294; &#xAD6C;&#xD615; &#xC548;&#xB4DC;&#xB85C;&#xC774;&#xB4DC; &#xAE30;&#xAE30;&#xB97C; &#xACA8;&#xB0E5;&#xD55C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC6D0;&#xACA9; &#xC561;&#xC138;&#xC2A4; &#xD2B8;&#xB85C;&#xC774; &#xBAA9;&#xB9C8;&#xB85C;, &#xC778;&#xC2A4;&#xD0C0;&#xADF8;&#xB7A8;, &#xC653;&#xCE20;&#xC571; &#xB4F1;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC0B0;&#xB418;&#xBA70; &#xD30C;&#xC77C; &#xC554;&#xD638;&#xD654;, &#xC704;&#xCE58; &#xCD94;&#xC801; &#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD55C;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xCD5C;&#xC2E0; &#xBCF4;&#xC548; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xC720;&#xC9C0;&#xD558;&#xACE0; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xC18C;&#xC2A4;&#xC5D0;&#xC11C; APK&#xB97C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</p>
<blockquote>
<p>&#x2B50; <strong>&#xD654;</strong> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=157168&amp;page=3&amp;total=102987">&#xD504;&#xB808;&#xC2A4;&#xD0C0;&#xC0F5; &#xD398;&#xC774;&#xC2A4;&#xBD81; &#xBAA8;&#xB4C8; &#xBCF4;&#xC548;&#xCDE8;&#xC57D;&#xC810; &#xC545;&#xC6A9;&#xD574; &#xC2E0;&#xC6A9;&#xCE74;&#xB4DC; &#xC815;&#xBCF4; &#xD0C8;&#xCDE8; &#xC911;&#x2026;&#xC8FC;&#xC758;</a></p>
</blockquote>
<p>&#xC628;&#xB77C;&#xC778; &#xC1FC;&#xD551;&#xBAB0;&#xC744; &#xC27D;&#xAC8C; &#xAD6C;&#xCD95;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xC798; &#xC54C;&#xB824;&#xC9C4; &#xD504;&#xB808;&#xC2A4;&#xD0C0;&#xC0F5;(PrestaShop)&#xC758; &#xD398;&#xC774;&#xC2A4;&#xBD81; &#xBAA8;&#xB4C8;&#xC778; pkfacebook&#xC5D0;&#xC11C; &#xC2EC;&#xAC01;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB410;&#xB2E4;. SQL &#xC778;&#xC81D;&#xC158;&#xC744; &#xD1B5;&#xD574; &#xC804;&#xC790;&#xC0C1;&#xAC70;&#xB798; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xCE74;&#xB4DC; &#xC2A4;&#xD0A4;&#xBA38;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xACE0; &#xC2E0;&#xC6A9;&#xCE74;&#xB4DC; &#xC815;&#xBCF4;&#xB97C; &#xD0C8;&#xCDE8;&#xD558;&#xB294; &#xB370; &#xC545;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;. (<a target="_blank" rel="external nofollow noopener noreferrer" href="https://nvd.nist.gov/vuln/detail/CVE-2024-36680">CVE-2024-36680</a>)</p>
<blockquote>
<p>&#x2B50; <strong>&#xC218;</strong> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://m.boannews.com/html/detail.html?tab_type=1&amp;idx=130809">&#xCD5C;&#xADFC; &#xC0AC;&#xC774;&#xBC84; &#xACF5;&#xACA9; &#xC704;&#xD611; 5&#xAC00;&#xC9C0;&#x2026; &#xB300;&#xBD80;&#xBD84; &#xAE08;&#xC804; &#xD0C8;&#xCDE8; &#xBAA9;&#xC801;</a></p>
</blockquote>
<p>&#xAE30;&#xC5C5;&#xC758; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xCE68;&#xD574;&#xC0AC;&#xACE0;&#xAC00; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC99D;&#xAC00;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xD55C;&#xAD6D;&#xC778;&#xD130;&#xB137;&#xC9C4;&#xD765;&#xC6D0;(&#xC774;&#xD558; KISA)&#xC5D0; &#xB530;&#xB974;&#xBA74; 2020&#xB144; 630&#xAC74;&#xC5D0;&#xC11C; 2021&#xB144; 640&#xAC74;, 2022&#xB144; 1142&#xAC74;, 2023&#xB144; 1,227&#xAC74;&#xC73C;&#xB85C; &#xAE09;&#xC99D;&#xD558;&#xB294; &#xCD94;&#xC138;&#xB2E4;. &#xAE08;&#xC804;&#xD0C8;&#xCDE8; &#xBAA9;&#xC801;&#xC758; &#xC0AC;&#xC774;&#xBC84;&#xACF5;&#xACA9;&#xC744; &#xB2F9;&#xD558;&#xB294; &#xC0B0;&#xC5C5;&#xAD70;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC758;&#xB8CC; 98%, &#xC81C;&#xC870; 96%, &#xAD50;&#xC721; 92%, &#xC815;&#xBD80;&#xB7;&#xACF5;&#xACF5;&#xAE30;&#xAD00; 68% &#xC21C;&#xC73C;&#xB85C; &#xC9D1;&#xACC4;&#xB410;&#xB2E4;.</p>
<blockquote>
<p>&#x2B50; <strong>&#xBAA9;</strong> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.dailysecu.com/news/articleView.html?idxno=157256">&#xC628;&#xB77C;&#xC778; &#xC8FC;&#xBB38;&#x2027;&#xBC30;&#xB2EC; &#xC11C;&#xBE44;&#xC2A4;, &#xC790;&#xC728;&#xADDC;&#xC81C;&#xB85C; &#xAC1C;&#xC778;&#xC815;&#xBCF4;&#xBCF4;&#xD638; &#xAC15;&#xD654;&#xD55C;&#xB2E4;</a></p>
</blockquote>
<p>&#xC8FC;&#xBB38;&#xC911;&#xAC1C;&#xD50C;&#xB7AB;&#xD3FC;&#xC0AC;&#xC640; &#xC8FC;&#xBB38;&#xD1B5;&#xD569;&#xAD00;&#xB9AC;&#xC2DC;&#xC2A4;&#xD15C;&#xC0AC; &#xBC0F; &#xBC30;&#xB2EC;&#xB300;&#xD589;&#xD50C;&#xB7AB;&#xD3FC;&#xC0AC; &#xAC04; &#xC8FC;&#xBB38;&#xC815;&#xBCF4; &#xC1A1;&#x2024;&#xC218;&#xC2E0;&#xB3C4; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;(API) &#xD6C4;&#xD0B9; &#xB4F1; &#xC218;&#xC2E0; &#xC8FC;&#xCCB4;&#xAC00; &#xC2DD;&#xBCC4;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xBC29;&#xC2DD;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xC815;&#xBCF4;&#xB97C; &#xC5B4;&#xB5A4; &#xC5C5;&#xCCB4;&#xAC00; &#xC8FC;&#xACE0;&#xBC1B;&#xC558;&#xB294;&#xC9C0; &#xD655;&#xC778; &#xAC00;&#xB2A5;&#xD55C; &#xC5D0;&#xC774;&#xD53C;&#xC544;&#xC774;(API) &#xC5F0;&#xB3D9; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xAC1C;&#xC120;&#xD558;&#xC5EC; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC804;&#xC1A1;&#xB418;&#xB3C4;&#xB85D; &#xBCF4;&#xD638;&#xC870;&#xCE58;&#xB97C; &#xAC15;&#xD654;&#xD558;&#xC600;&#xB2E4;.</p>
<blockquote>
<p>&#x2B50; <strong>&#xAE08;</strong> | <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.cepro.com/networking/critical-cybersecurity-vulnerabilities-in-smart-home-devices-uncovered-in-new-research/">&#xC2A4;&#xB9C8;&#xD2B8; &#xD648; &#xAE30;&#xAE30;&#xC758; &#xC2EC;&#xAC01;&#xD55C; &#xC0AC;&#xC774;&#xBC84; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xBC1C;&#xACAC;</a></p>
</blockquote>
<p>NETGEAR&#xC640; Bitdefender &#xAE30;&#xC5C5;&#xC5D0;&#xC11C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.netgear.com/hub/network/2024-iot-threat-report/">2024 IoT &#xBCF4;&#xC548; &#xD658;&#xACBD; &#xBCF4;&#xACE0;&#xC11C;</a>&#xB97C; &#xBC1C;&#xD45C;&#xD588;&#xB2E4;. &#xC774; &#xBCF4;&#xACE0;&#xC11C;&#xB294; &#xC2A4;&#xB9C8;&#xD2B8; &#xD648; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xCDE8;&#xC57D;&#xC131;&#xACFC; &#xACF5;&#xACA9; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xBC1D;&#xD600;&#xB0B4;&#xAE30; &#xC704;&#xD574; &#xC804; &#xC138;&#xACC4;&#xC801;&#xC73C;&#xB85C; 91&#xC5B5; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xBCF4;&#xC548; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC57D; 5&#xCC9C;&#xB9CC; &#xAC1C;&#xC758; IoT &#xC7A5;&#xCE58;&#xC5D0; &#xB300;&#xD55C; &#xBD84;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD588;&#xB2E4;.</p>
<h2 id="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;"><a href="#&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C;-&#xBB3C;&#xC5B4;&#xBD10;" class="headerlink" title="&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; "></a>&#xC9F9;&#xC9F9;&#xC774;&#xC5D0;&#xAC8C; &#xBB3C;&#xC5B4;&#xBD10; <img src="/img/keyword.gif" srcset="/img/loading.gif" width="30" height="30" style="float:left;"></h2><p><strong>&#xADF8;&#xB9AC;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</strong></p>
<p>&#xC774;&#xC6A9;&#xC790;&#xAC00; &#xB2E4;&#xB978; &#xC774;&#xC6A9;&#xC790;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB85C;, &#xD1B5;&#xC2E0;&#xC5C5;&#xCCB4;&#xC758; &#xC11C;&#xBC84;&#xAC00; &#xC544;&#xB2CC; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC11C;&#xBC84;&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xC11C;&#xBC84;&#xC5D0; &#xBAB0;&#xB9AC;&#xB294; &#xBD80;&#xD558;&#xB97C; &#xBD84;&#xC0B0;&#xD558;&#xB294; &#xAC83;</p>
<p><strong>&#xB525;&#xB9C1;&#xD06C;</strong></p>
<p>&#xD2B9;&#xC815; &#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xB3C4;&#xB2EC; &#xD560; &#xC218; &#xC788;&#xB294; &#xB9C1;&#xD06C;(URL)</p>
<p><strong>&#xAC8C;&#xC784;&#xCCB4;&#xC778;&#xC800;</strong></p>
<p>&#xC2DC;&#xC7A5;&#xC758; &#xD750;&#xB984;&#xC744; &#xD1B5;&#xC9F8;&#xB85C; &#xBC14;&#xAFB8;&#xAC70;&#xB098; &#xD310;&#xB3C4;&#xB97C; &#xB4A4;&#xC9D1;&#xC5B4; &#xB193;&#xC744; &#xB9CC;&#xD55C; &#xACB0;&#xC815;&#xC801; &#xC5ED;&#xD560;&#xC744; &#xD55C; &#xC0AC;&#xB78C;, &#xC0AC;&#xAC74;, &#xC11C;&#xBE44;&#xC2A4;, &#xC81C;&#xD488; &#xB4F1;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xAC83;</p>
<p><strong>&#xC561;&#xC138;&#xC2A4; &#xD1A0;&#xD070;</strong></p>
<p>&#xC0AC;&#xC6A9;&#xC790;&#xB098; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xD2B9;&#xC815; &#xC790;&#xC6D0;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC744; &#xC99D;&#xBA85;&#xD558;&#xB294; &#xB514;&#xC9C0;&#xD138; &#xD0A4;</p>
<h3 id="&#xC9C0;&#xC2DD;-PLUS-&#x2795;"><a href="#&#xC9C0;&#xC2DD;-PLUS-&#x2795;" class="headerlink" title="&#xC9C0;&#xC2DD; PLUS &#x2795;"></a>&#xC9C0;&#xC2DD; PLUS &#x2795;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.bankinfosecurity.com/no-patches-for-hospital-temperature-monitors-critical-flaws-a-25632">&#xBCD1;&#xC6D0;&#xC6A9; Temperature Monitors&#x2019;&#xC758; &#xCDE8;&#xC57D;&#xC810;, &#xD328;&#xCE58; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC544;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130953">&#xAC70;&#xB300; &#xCD95;&#xAD6C; &#xD589;&#xC0AC; UEFA, &#xCD5C;&#xADFC; &#xB2E4;&#xD06C;&#xC6F9;&#xC758; &#xD574;&#xCEE4;&#xB4E4;&#xC774; &#xC8FC;&#xBAA9;&#xD558;&#xACE0; &#xC788;&#xC5B4;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://thehackernews.com/2024/06/apple-patches-airpods-bluetooth.html">Apple, &#xB3C4;&#xCCAD;&#xC744; &#xD5C8;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; AirPods &#xBE14;&#xB8E8;&#xD22C;&#xC2A4; &#xCDE8;&#xC57D;&#xC810; &#xD328;&#xCE58;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130915&amp;skind=6">&#xC628;&#xB77C;&#xC778; &#xC8FC;&#xBB38;&#xB7;&#xBC30;&#xB2EC; &#xBD84;&#xC57C;, &#x2018;&#xBBFC;&#xAD00;&#xD611;&#xB825; &#xC790;&#xC728;&#xADDC;&#xC81C;&#x2019;&#xB85C; &#xAC1C;&#xC778;&#xC815;&#xBCF4; &#xBCF4;&#xD638; &#xC5BC;&#xB9C8;&#xB098; &#xAC15;&#xD654;&#xB410;&#xB098;</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130808">AI &#xB178;&#xB9AC;&#xB294; &#xB300;&#xD45C;&#xC801; &#xACF5;&#xACA9; 3&#xAC00;&#xC9C0;&#xB294;? AI &#xBAA8;&#xB378; &#xACF5;&#xC720; &#xD50C;&#xB7AB;&#xD3FC;, AI &#xCDE8;&#xC57D;&#xC810;, &#xB370;&#xC774;&#xD130; &#xC624;&#xC5FC;</a></p>
<h2 id="7&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;"><a href="#7&#xC6D4;-&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;-&#xB300;&#xD68C;-&#x1F425;" class="headerlink" title="7&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C; &#x1F425;"></a><strong>7&#xC6D4; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4; | &#xB300;&#xD68C;</strong> &#x1F425;</h2><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.boannews.com/media/view.asp?idx=130368&amp;kind=3&amp;sub_kind=">&#xC81C;10&#xD68C; &#xB300;&#xD559;&#xC0DD; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xC0BC;&#xC131;&#xC804;&#xC790; | ~ 24.07.04</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://cryptocontest.kr/challenge/">&#xC554;&#xD638;&#xBD84;&#xC11D;&#xACBD;&#xC9C4;&#xB300;&#xD68C;</a> | &#xD55C;&#xAD6D;&#xC815;&#xBCF4;&#xBCF4;&#xD638;&#xD559;&#xD68C; | ~2408.31 </p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.itdaily.kr/news/articleView.html?idxno=223547">&#xAE08;&#xC735;&#xAD8C; &#xBCF4;&#xC548; &#xCDE8;&#xC57D;&#xC810; &#xC2E0;&#xACE0;&#xD3EC;&#xC0C1;&#xC81C; (&#xBC84;&#xADF8;&#xBC14;&#xC6B4;&#xD2F0;)</a> | &#xAE08;&#xC735;&#xBCF4;&#xC548;&#xC6D0; | ~24.08.31</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://iscr.cyber.go.kr/">&#xAD6D;&#xC81C; &#xC0AC;&#xC774;&#xBC84;&#xBC94;&#xC8C4;&#xB300;&#xC751; &#xC2EC;&#xD3EC;&#xC9C0;&#xC5C4;</a> | &#xACBD;&#xCC30;&#xCCAD; | 24.07.01 &#xC0AC;&#xC804; &#xB4F1;&#xB85D; &#xC2DC;&#xC791; (24.08.27 ~ 24.08.29)</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Newsletter/">Newsletter</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/newsletter/">newsletter</a>
                  
                  <a class="hover-with-bg" href="/tags/clalxk/">clalxk</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_clalxk.jpg" srcset="/img/loading.gif" alt="clalxk">
                  </div>

                  <div class="link-text">
                    <div class="link-title">clalxk</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/clalxk">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2024/07/06/j0ker/2024-07-06/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2024-1724 : Snap Symbolic Link    Sandbox Escape </span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2024/06/26/ogu123/cve-2024-4323/">
                    <span class="hidden-mobile">[] CVE-2024-4323: Fluent Bit Memory Corruption  DoS </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2024/07/01/clalxk/newsletter0701/';
        this.page.identifier = '/2024/07/01/clalxk/newsletter0701/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[] KT,       &nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
