

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 1 - Overview (Here!)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 2 - Data, Functions, Scripts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/04/ghidra_part3&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 3 - tips for IDA User&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 4 - Malware Analysis (1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 5 - Malware Analysis (2)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC88B;&amp;#xC544;&amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBE4C;&amp;#xB824; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC758; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558;&amp;#xD558;! &amp;#xC81C; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xB9DE;&amp;#xB2E4;&amp;#xBA74; &amp;#xC800;&amp;#xD76C; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xCCAB; research &amp;#xAE00;&amp;#xC740; Ghidra&amp;#xC758; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC778; AngryGhidra&amp;#xC600;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xB294; ghidra&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xC694;&amp;#xC6D0;(?)&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xBB34; &amp;#xC911;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;, NSA&amp;#xC5D0;&amp;#xC11C; IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD234;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD55C;&amp;#xB2E4;! &amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC2E0;&amp;#xAE30;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE54;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740; &amp;#x201C;&amp;#xC544;.. &amp;#xC774;&amp;#xAC70; &amp;#xC5C4;&amp;#xCCAD; &amp;#xBD88;&amp;#xD3B8;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;&amp;#x201D;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; IDA&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC218;&amp;#xC21C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4;&amp;#xB85C; &amp;#xC78A;&amp;#xACE0; &amp;#xC0B4;&amp;#xB2E4;&amp;#xAC00; &amp;#xC18C;&amp;#xC9D1;&amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xB294;&amp;#xB370; reverse engineering with ghidra, malware analysis with ghidra &amp;#xB4F1; &amp;#xD574;&amp;#xC678;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; ghidra&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;? &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC790;&amp;#xB8CC; &amp;#xC911;&amp;#xC5D0;&amp;#xB294; ghidra&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xB8CC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C;&amp;#x2026; &amp;#xC81C;&amp;#xAC00; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xC790;&amp;#xB8CC;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBB3C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE00;&amp;#xC740; offical docs&amp;#xC640; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD574;&amp;#xC678; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xB4E4;&amp;#xC758; tip&amp;#xB4E4;&amp;#xC744; &amp;#xC885;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &amp;#xC9C4;&amp;#xD589;&amp;#xB420; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Ghidra&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&#34;&gt;&lt;a href=&#34;#Ghidra&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&#34;&gt;&lt;/a&gt;Ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC790;&amp;#xAE30; &amp;#xAF2C;&amp;#xB9AC;&amp;#xB97C; &amp;#xBA39;&amp;#xC73C;&amp;#xB824; &amp;#xD558;&amp;#xB294; &amp;#xC6A9;..??&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ghidra&amp;#xB294; NSA(&amp;#xBBF8;&amp;#xAD6D; &amp;#xAD6D;&amp;#xAC00; &amp;#xC548;&amp;#xBCF4;&amp;#xAD6D;)&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://wikileaks.org/ciav7p1/index.html&#34;&gt;WikiLeaks&amp;#xC758; Vault 7&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xCC98;&amp;#xC74C; &amp;#xC815;&amp;#xCCB4;(?)&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &lt;a href=&#34;https://www.rsaconference.com/industry-topics/presentation/come-get-your-free-nsa-reverse-engineering-tool&#34;&gt;2019&amp;#xB144; RSA &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; JAVA&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; 5&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Programs&lt;/li&gt;
&lt;li&gt;Plugins&lt;/li&gt;
&lt;li&gt;Tools&lt;/li&gt;
&lt;li&gt;Project Manager&lt;/li&gt;
&lt;li&gt;Server&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h2 id=&#34;Programs&#34;&gt;&lt;a href=&#34;#Programs&#34; class=&#34;headerlink&#34; title=&#34;Programs&#34;&gt;&lt;/a&gt;Programs&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; ghidra&amp;#xC758; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Symbols, Bytes, Reference, Comments &amp;#xB4F1; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB610;&amp;#xD55C; Ghidra &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xC774; &amp;#xB418;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Plugins&#34;&gt;&lt;a href=&#34;#Plugins&#34; class=&#34;headerlink&#34; title=&#34;Plugins&#34;&gt;&lt;/a&gt;Plugins&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC758; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC740; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC8E0;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC740; &amp;#xC11C;&amp;#xB85C; &amp;#xC18C;&amp;#xD1B5;&amp;#xD558;&amp;#xBA70; ghidra &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791; &amp;#xC5C6;&amp;#xC774; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC758; &amp;#xCD94;&amp;#xAC00;/&amp;#xC81C;&amp;#xAC70;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xB85C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Tools&#34;&gt;&lt;a href=&#34;#Tools&#34; class=&#34;headerlink&#34; title=&#34;Tools&#34;&gt;&lt;/a&gt;Tools&lt;/h2&gt;&lt;p&gt;Tools&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xACFC; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xC124;&amp;#xC815;&amp;#xC758; &amp;#xBAA8;&amp;#xC784;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; tools&amp;#xB294; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; tools&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Project-Manager&#34;&gt;&lt;a href=&#34;#Project-Manager&#34; class=&#34;headerlink&#34; title=&#34;Project Manager&#34;&gt;&lt;/a&gt;Project Manager&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774;, &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;, tools, data&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB9CC; &amp;#xC5F4;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; ghidra&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Ghidra-Server&#34;&gt;&lt;a href=&#34;#Ghidra-Server&#34; class=&#34;headerlink&#34; title=&#34;Ghidra Server&#34;&gt;&lt;/a&gt;Ghidra Server&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xD611;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; Shared-Project&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACF5;&amp;#xC720; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; ghidra &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xD30C;&amp;#xC77C; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, check out, check in, version history &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Ghidra-vs-IDA-Pro&#34;&gt;&lt;a href=&#34;#Ghidra-vs-IDA-Pro&#34; class=&#34;headerlink&#34; title=&#34;Ghidra vs IDA Pro&#34;&gt;&lt;/a&gt;Ghidra vs IDA Pro&lt;/h1&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD300; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC7A5;&amp;#xC810;&amp;#xC740; &lt;strong&gt;&amp;#xBB34;&amp;#xB8CC;&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC8E0;. IDA Pro&amp;#xC758; &amp;#xAC00;&amp;#xACA9;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC7A5;&amp;#xC810;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xACF5;&amp;#xBD80; &amp;#xC6A9;&amp;#xB3C4;&amp;#xB85C; 200&amp;#xB9CC; &amp;#xC6D0;&amp;#xAC00;&amp;#xB7C9;&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294;&amp;#x2026; &amp;#xD06C;&amp;#xD760;&lt;/p&gt;
&lt;p&gt;Ghidra&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC740; IDA Pro&amp;#xB791; ghidra&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;, &amp;#xBB50;&amp;#xAC00; &amp;#xB354; &amp;#xB098;&amp;#xC740;&amp;#xAC00;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD1A0;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xB354; &amp;#xB098;&amp;#xC740;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; &amp;#xC0AC;&amp;#xB78C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xBBC0;&amp;#xB85C; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD55C; &amp;#xBC88; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;ghidra&amp;#xB294; decompiler&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xB8CC;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;IDA&amp;#xAC00; &amp;#xBB34;&amp;#xB8CC; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Hex-rays &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xC758; &amp;#xD070; &amp;#xC7A5;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;IDA&amp;#xC5D0;&amp;#xB294; debugger&amp;#xAC00; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xC5D0;&amp;#xB294; &amp;#xC5C6;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;IDA&amp;#xC5D0;&amp;#xB294; debugger&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xB294; &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xAC04;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xBCF4;&amp;#xB2E4; IDA&amp;#xAC00; &amp;#xB354; &amp;#xC624;&amp;#xB798; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C;, IDA &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xC880; &amp;#xB354; &amp;#xB9CE;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC740; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xC788;&amp;#xACE0;, Hex-rays&amp;#xC640; Ghidra Decompiler&amp;#xC758; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Hex-rays-vs-Ghidra-Decompiler&#34;&gt;&lt;a href=&#34;#Hex-rays-vs-Ghidra-Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Hex-rays vs Ghidra Decompiler&#34;&gt;&lt;/a&gt;Hex-rays vs Ghidra Decompiler&lt;/h2&gt;&lt;h3 id=&#34;Hex-rays&#34;&gt;&lt;a href=&#34;#Hex-rays&#34; class=&#34;headerlink&#34; title=&#34;Hex-rays&#34;&gt;&lt;/a&gt;Hex-rays&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://ko.wikipedia.org/wiki/%EB%A7%88%EC%9D%B4%ED%81%AC%EB%A1%9C%EC%BD%94%EB%93%9C&#34;&gt;Microcode&lt;/a&gt; &amp;#xAE30;&amp;#xBC18;&lt;/li&gt;
&lt;li&gt;&amp;#xC77C;&amp;#xBD80; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB9CC; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218;, &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; xrefer &amp;#xC81C;&amp;#xACF5;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218; &amp;#xB9E4;&amp;#xD551; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCC0;&amp;#xC218; &amp;#xD45C;&amp;#xD604;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(decimal, hex, char &amp;#xB4F1;)&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Ghidra-Decompiler&#34;&gt;&lt;a href=&#34;#Ghidra-Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Ghidra Decompiler&#34;&gt;&lt;/a&gt;Ghidra Decompiler&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://ko.wikipedia.org/wiki/P-%EC%BD%94%EB%93%9C&#34;&gt;P-code&lt;/a&gt; &amp;#xAE30;&amp;#xBC18;&lt;/li&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;xref &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218; &amp;#xB9E4;&amp;#xD551; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCC0;&amp;#xC218; &amp;#xD45C;&amp;#xD604; &amp;#xBCC0;&amp;#xACBD; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;IDA Pro&amp;#xC640;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC774;&amp;#xC81C; ghidra&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xB7EC; &amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Ghidra&amp;#xB97C;-&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&#34;&gt;&lt;a href=&#34;#Ghidra&amp;#xB97C;-&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;!&#34;&gt;&lt;/a&gt;Ghidra&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;!&lt;/h1&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;? ghidra&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows 7 or 10 (64-bit)&lt;/li&gt;
&lt;li&gt;Linux (64-bit, CentOS 7 is preferred)&lt;/li&gt;
&lt;li&gt;macOS (OS X) 10.8.3+ (Mountain Lion or later)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; OS&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC740; &amp;#xC77C;&amp;#xC808; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; ghidra&amp;#xB294; JAVA&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xC8E0;? &amp;#xB530;&amp;#xB77C;&amp;#xC11C; jdk &amp;#xB610;&amp;#xD55C; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ghidra&amp;#xC758; &amp;#xC6D0;&amp;#xD65C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &lt;a href=&#34;https://www.oracle.com/java/technologies/javase-jdk11-downloads.html&#34;&gt;jdk 11&lt;/a&gt;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;ghidra &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC124;&amp;#xCE58;&amp;#xB294; &lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;ghidra &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; Download Ghidra &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; setup &amp;#xC5C6;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xD6C4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBB58; &amp;#xB20C;&amp;#xB7EC;&amp;#xC57C; &amp;#xB420;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8;&amp;#xB0E5; &amp;#xB458; &amp;#xB2E4; &amp;#xB20C;&amp;#xB7EC;&amp;#xBCF4;&amp;#xC790;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Windows&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACE0;, Linux&amp;#xB098; MacOS&amp;#xB294; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;-Crackme&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-Ghidra-&amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34;&gt;&lt;a href=&#34;#&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;-Crackme&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-Ghidra-&amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Crackme&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Ghidra &amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34;&gt;&lt;/a&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Crackme&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Ghidra &amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&lt;/h1&gt;&lt;p&gt;&amp;#xC81C;&amp;#xAC00; Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; Windows &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Linux&amp;#xC640; MacOS&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xBFD0;, &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC71;&amp;#xC815; &amp;#xC548; &amp;#xD558;&amp;#xC154;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;a href=&#34;https://crackmes.one/crackme/6004daf233c5d42c3d016717&#34;&gt;&amp;#xC5EC;&amp;#xAE30;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB294; &lt;code&gt;crackmes.one&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ghidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;, &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8; &amp;#xC564; &amp;#xB4DC;&amp;#xB86D;&amp;#xC744; &amp;#xD558;&amp;#xC5EC; &amp;#xCD94;&amp;#xAC00;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;File - New Project (Ctrl+N)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8; &amp;#xC564; &amp;#xB4DC;&amp;#xB86D;&amp;#xD558;&amp;#xAC70;&amp;#xB098; Import File&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; import&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74;, Import Summary &amp;#xCC3D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC04;&amp;#xB7B5;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;, Compiler ID &amp;#xB4F1;&amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.)&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; crackme.exe&amp;#xB97C; &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xB4DC;&amp;#xB798;&amp;#xACE4;(!) &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB728;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xB0D0;&amp;#xACE0; &amp;#xBB3B;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; Yes&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%208.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Yes&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xC138;&amp;#xD305;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8; &amp;#xAC12;&amp;#xC744; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xB3C4; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%209.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xACE0; &amp;#xB09C; &amp;#xD6C4; &amp;#xBA54;&amp;#xC778; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xBA54;&amp;#xC778; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xAC01; &amp;#xC139;&amp;#xC158;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Program-amp-Symbol-Trees-Data-Type-Manager&#34;&gt;&lt;a href=&#34;#Program-amp-Symbol-Trees-Data-Type-Manager&#34; class=&#34;headerlink&#34; title=&#34;Program &amp;amp; Symbol Trees, Data Type Manager&#34;&gt;&lt;/a&gt;Program &amp;amp; Symbol Trees, Data Type Manager&lt;/h2&gt;&lt;h3 id=&#34;Program-Trees&#34;&gt;&lt;a href=&#34;#Program-Trees&#34; class=&#34;headerlink&#34; title=&#34;Program Trees&#34;&gt;&lt;/a&gt;Program Trees&lt;/h3&gt;&lt;p&gt;Program Trees&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC139;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2010.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2011.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Dominance&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC139;&amp;#xC158; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Symbol-Tree&#34;&gt;&lt;a href=&#34;#Symbol-Tree&#34; class=&#34;headerlink&#34; title=&#34;Symbol Tree&#34;&gt;&lt;/a&gt;Symbol Tree&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2012.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Symbol Tree&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Import &amp;#xB41C; DLL, Exports &amp;#xB41C; &amp;#xD568;&amp;#xC218; &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2013.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2014.png&#34; alt&gt;&lt;/p&gt;
&lt;h3 id=&#34;Data-Type-Manager&#34;&gt;&lt;a href=&#34;#Data-Type-Manager&#34; class=&#34;headerlink&#34; title=&#34;Data Type Manager&#34;&gt;&lt;/a&gt;Data Type Manager&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2015.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Data Type Manager&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x201C;Find Uses of&amp;#x201D;(&lt;code&gt;Ctrl + Shift + F&lt;/code&gt;)&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2016.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2017.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Disassembly-View-amp-Function-Graph&#34;&gt;&lt;a href=&#34;#Disassembly-View-amp-Function-Graph&#34; class=&#34;headerlink&#34; title=&#34;Disassembly View &amp;amp; Function Graph&#34;&gt;&lt;/a&gt;Disassembly View &amp;amp; Function Graph&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2018.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC911;&amp;#xC559;&amp;#xC5D0; &amp;#xD070; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCC3D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xD45C;&amp;#xC2DC;&amp;#xB420;&amp;#xC9C0; &amp;#xB4F1; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0C1;&amp;#xB2E8; &amp;#xD45C;&amp;#xC2DC;&amp;#xC904;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#x201C;Edit the Listing fileds&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x201C;Instruction/Data&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC218;&amp;#xC815;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xAE30; &amp;#xC870;&amp;#xC815;, &amp;#xC704;&amp;#xCE58; &amp;#xC774;&amp;#xB3D9;, &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xB2A5; &amp;#xCD94;&amp;#xAC00; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2019.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;L&lt;/code&gt; &amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2020.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB3D9; &amp;#xC5C6;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4; &amp;#xCEE4;&amp;#xC11C;&amp;#xB97C; &amp;#xC62C;&amp;#xB824;&amp;#xB193;&amp;#xACE0; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2021.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;-Comments- &amp;#xC6D0;&amp;#xD558;&amp;#xB294; Comment&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC11D;&amp;#xB3C4; &amp;#xCD94;&amp;#xAC00;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;;&lt;/code&gt; &amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBC14;&amp;#xB85C; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xB2EC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2022.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;;&lt;/code&gt;&amp;#xB97C; &amp;#xB20C;&amp;#xB800;&amp;#xC744; &amp;#xB54C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xCC3D;. &amp;#xD574;&amp;#xB2F9; &amp;#xCC3D;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#x2018;OK&amp;#x2019;&amp;#xB97C; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;IDA Pro&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xD3B8;&amp;#xD588;&amp;#xB358; &amp;#xAE30;&amp;#xB2A5; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC600;&amp;#xC8E0;? ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC21C; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#x201C;Windows&amp;#x201D; - &amp;#x201C;Function Graph&amp;#x201D;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2023.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2024.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; function graph. IDA Pro&amp;#xC640; &amp;#xD070; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xB098;&amp;#xC9C4; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2025.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Function Graph &amp;#xB610;&amp;#xD55C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC758; &amp;#x201C;Edit Code Block Fileds&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD55C; &amp;#xD6C4; &amp;#x201C;Instruction/Data&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xBB34; &amp;#xACF5;&amp;#xAC04;&amp;#xC774;&amp;#xB098; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;-Add Field&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Decompiler&#34;&gt;&lt;a href=&#34;#Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Decompiler&#34;&gt;&lt;/a&gt;Decompiler&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA Pro&amp;#xC758; hex-rays &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC; &amp;#xCC3D; &amp;#xC6B0;&amp;#xCE21;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xBA70;, &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC870;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC704;&amp;#xCE58; &amp;#xC870;&amp;#xC815; &amp;#xB610;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2026.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3FC;&amp;#xC11C; &amp;#xC6B0;&amp;#xCE21; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xCC3D;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; Function Graph&amp;#xB97C; &amp;#xB04C;&amp;#xC5B4;&amp;#xB2E4; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; Function Graph &amp;#xCC3D;&amp;#xC774; &amp;#xC88C;&amp;#xCE21;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xB3C4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2027.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9B0; &amp;#xAC83;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xB2EC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Crackme&amp;#xB97C;-&amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&#34;&gt;&lt;a href=&#34;#Crackme&amp;#xB97C;-&amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&#34; class=&#34;headerlink&#34; title=&#34;Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;!&#34;&gt;&lt;/a&gt;Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;!&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; ghidra&amp;#xC758; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2028.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9DE;&amp;#xB294; Input &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAD70;&amp;#xC694;.(&lt;del&gt;Crackme&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&lt;/del&gt;) ghidra&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xB9DE;&amp;#xB294; input&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;ghidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xD6C4; Project &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0;, &amp;#xBD84;&amp;#xC11D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC644;&amp;#xB8CC;&amp;#xD55C; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; main &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. String &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;(&amp;#xADF8;&amp;#xAC8C; &amp;#xB354; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;), Symbol Tree&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC88C;&amp;#xCE21; Symbol Tree&amp;#xC5D0;&amp;#xC11C; Function &amp;#xC606; + &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2029.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;___main&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC11;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xC2A4;&amp;#xD06C;&amp;#xB864;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2030.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_main&lt;/code&gt;&amp;#xACFC; &lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Entry Point&amp;#xC778; &lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xB294; main &amp;#xD568;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2031.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;___mingw_CRTStartup&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB3C4; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC744; &amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2032.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;___main&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &lt;code&gt;_main&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0; &amp;#xD568;&amp;#xC218;&amp;#xBD80;&amp;#xD130; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2033.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2034.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC74C;&amp;#x2026; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC78; &amp;#xBCF4;&amp;#xC544; &lt;code&gt;_main&lt;/code&gt;&amp;#xC774; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBA54;&amp;#xC778; &amp;#xD568;&amp;#xC218;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xB4A4;&amp;#xB85C; &amp;#xAC00;&amp;#xAC70;&amp;#xB098; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC88C;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC758; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;ALT + &amp;#xC88C;&amp;#xC6B0; &amp;#xBC29;&amp;#xD5A5;&amp;#xD0A4;&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2035.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_main&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC624;&amp;#xB2C8; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB3C4; &amp;#xCD9C;&amp;#xB825;&amp;#xB418;&amp;#xACE0;, &amp;#xC785;&amp;#xB825; &amp;#xAC12;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4; 1&amp;#xC9DC;&amp;#xB9AC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xC774;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC14;&amp;#xB85C; &amp;#xD480;&amp;#xB824;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;&amp;#x314B;&amp;#x314B;&amp;#x314B;. &amp;#xBB50; ghidra&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xBB38;&amp;#xC81C;&amp;#xB2C8;&amp;#xAE4C;! &lt;code&gt;0x1232b14 = 19082004&lt;/code&gt;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2036.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB2F5;&amp;#xC784;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&lt;/h1&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;, IDA&amp;#xB791; &amp;#xBE44;&amp;#xAD50;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, ghidra&amp;#xB294; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; Easy Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA70; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC624;&amp;#xB298; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC04; Data, Function, Scripts&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xB2E4;&amp;#xB904;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; IDA Pro &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xACC4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, IDA Pro&amp;#xB97C; &amp;#xC811;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; ghidra&amp;#xB97C; &amp;#xC368;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740;&amp;#xB370; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB2E4; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB410;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xBA70;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC124;&amp;#xBA85;&amp;#xC774;&amp;#xB098;, &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B8;&amp;#xC81C;&amp;#xB4E0; &amp;#xB313;&amp;#xAE00;&amp;#xB85C; &amp;#xB0A8;&amp;#xACA8;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC88B;&amp;#xC740; &amp;#xBC24; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC138;&amp;#xC694;~! &amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xC81C; &amp;#xC790;&amp;#xB7EC; &amp;#xAC00; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2037.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBC24;&amp;#xC5D0; &amp;#xAE68;&amp;#xC5B4;&amp;#xC788;&amp;#xACE0; &amp;#xB0AE;&amp;#xC5D0; &amp;#xC790;&amp;#xB294; &amp;#xBC40;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xAC19;&amp;#xC740; &amp;#xBAA8;&amp;#xC21C;&amp;#xC801;&amp;#xC778; &amp;#xC0B6;&amp;#x2026;&lt;/del&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://dannyquist.github.io/gootkit-reversing-ghidra/&#34;&gt;https://dannyquist.github.io/gootkit-reversing-ghidra/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html&#34;&gt;https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ghidra.re/online-courses/&#34;&gt;https://ghidra.re/online-courses/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Re:versing  ghidra  Part 1 - Overview - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&lt;strong&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xD30C;&amp;#xD2B8; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 1 - Overview (Here!)&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 2 - Data, Functions, Scripts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/04/ghidra_part3&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 3 - tips for IDA User&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 4 - Malware Analysis (1)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/&#34;&gt;Re:versing&amp;#xC73C;&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; ghidra &amp;#xC0DD;&amp;#xD65C; Part 5 - Malware Analysis (2)&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xC88B;&amp;#xC544;&amp;#xD558;&amp;#xB294; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBE4C;&amp;#xB824; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&amp;#xC758; &amp;#xC81C;&amp;#xBAA9;&amp;#xC744; &amp;#xC815;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558;&amp;#xD558;! &amp;#xC81C; &amp;#xAE30;&amp;#xC5B5;&amp;#xC774; &amp;#xB9DE;&amp;#xB2E4;&amp;#xBA74; &amp;#xC800;&amp;#xD76C; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xCCAB; research &amp;#xAE00;&amp;#xC740; Ghidra&amp;#xC758; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC778; AngryGhidra&amp;#xC600;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC800;&amp;#xB294; ghidra&amp;#xAC00; &amp;#xCC98;&amp;#xC74C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC744; &amp;#xB54C; &amp;#xAD00;&amp;#xC2EC;&amp;#xC774; &amp;#xB9CE;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB54C;&amp;#xB294; &amp;#xAD6D;&amp;#xAC00;&amp;#xC758; &amp;#xC694;&amp;#xC6D0;(?)&amp;#xC73C;&amp;#xB85C; &amp;#xBCF5;&amp;#xBB34; &amp;#xC911;&amp;#xC774;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;, NSA&amp;#xC5D0;&amp;#xC11C; IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD234;&amp;#xC744; &amp;#xBC1C;&amp;#xD45C;&amp;#xD55C;&amp;#xB2E4;! &amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC2E0;&amp;#xAE30;&amp;#xD588;&amp;#xC5C8;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE54;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740; &amp;#x201C;&amp;#xC544;.. &amp;#xC774;&amp;#xAC70; &amp;#xC5C4;&amp;#xCCAD; &amp;#xBD88;&amp;#xD3B8;&amp;#xD558;&amp;#xAD6C;&amp;#xB098;&amp;#x201D;&amp;#xC600;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; IDA&amp;#xC5D0; &amp;#xC775;&amp;#xC219;&amp;#xD574;&amp;#xC838; &amp;#xC788;&amp;#xC5C8;&amp;#xC73C;&amp;#xB2C8; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD55C; &amp;#xC218;&amp;#xC21C;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8; &amp;#xD6C4;&amp;#xB85C; &amp;#xC78A;&amp;#xACE0; &amp;#xC0B4;&amp;#xB2E4;&amp;#xAC00; &amp;#xC18C;&amp;#xC9D1;&amp;#xD574;&amp;#xC81C;&amp;#xB97C; &amp;#xD558;&amp;#xACE0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE00;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xB294;&amp;#xB370; reverse engineering with ghidra, malware analysis with ghidra &amp;#xB4F1; &amp;#xD574;&amp;#xC678;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; ghidra&amp;#xB97C; &amp;#xB9CE;&amp;#xC774; &amp;#xC4F0;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xB354;&amp;#xB77C;&amp;#xACE0;&amp;#xC694;? &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAD6D;&amp;#xB0B4; &amp;#xC790;&amp;#xB8CC; &amp;#xC911;&amp;#xC5D0;&amp;#xB294; ghidra&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC790;&amp;#xB8CC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xC11C;&amp;#x2026; &amp;#xC81C;&amp;#xAC00; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF8; &amp;#xC790;&amp;#xB8CC;&amp;#xB97C; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBB3C;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE00;&amp;#xC740; offical docs&amp;#xC640; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD574;&amp;#xC678; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xB4E4;&amp;#xC758; tip&amp;#xB4E4;&amp;#xC744; &amp;#xC885;&amp;#xD569;&amp;#xD558;&amp;#xC5EC; &amp;#xC9C4;&amp;#xD589;&amp;#xB420; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC2DC;&amp;#xC791;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;!&lt;/p&gt;
&lt;h1 id=&#34;Ghidra&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&#34;&gt;&lt;a href=&#34;#Ghidra&amp;#xB780;-&amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&#34;&gt;&lt;/a&gt;Ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xAC00;?&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC790;&amp;#xAE30; &amp;#xAF2C;&amp;#xB9AC;&amp;#xB97C; &amp;#xBA39;&amp;#xC73C;&amp;#xB824; &amp;#xD558;&amp;#xB294; &amp;#xC6A9;..??&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ghidra&amp;#xB294; NSA(&amp;#xBBF8;&amp;#xAD6D; &amp;#xAD6D;&amp;#xAC00; &amp;#xC548;&amp;#xBCF4;&amp;#xAD6D;)&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2A4; &amp;#xC5D4;&amp;#xC9C0;&amp;#xB2C8;&amp;#xC5B4;&amp;#xB9C1;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;a href=&#34;https://wikileaks.org/ciav7p1/index.html&#34;&gt;WikiLeaks&amp;#xC758; Vault 7&lt;/a&gt;&amp;#xC5D0; &amp;#xC758;&amp;#xD574;&amp;#xC11C; &amp;#xCC98;&amp;#xC74C; &amp;#xC815;&amp;#xCCB4;(?)&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &lt;a href=&#34;https://www.rsaconference.com/industry-topics/presentation/come-get-your-free-nsa-reverse-engineering-tool&#34;&gt;2019&amp;#xB144; RSA &amp;#xCEE8;&amp;#xD37C;&amp;#xB7F0;&amp;#xC2A4;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xD45C;&amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xAC8C; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; JAVA&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xACE0;, &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; 5&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xC778; &amp;#xD30C;&amp;#xD2B8;&amp;#xB97C; &amp;#xAC00;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Programs&lt;/li&gt;
&lt;li&gt;Plugins&lt;/li&gt;
&lt;li&gt;Tools&lt;/li&gt;
&lt;li&gt;Project Manager&lt;/li&gt;
&lt;li&gt;Server&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB098;&amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;h2 id=&#34;Programs&#34;&gt;&lt;a href=&#34;#Programs&#34; class=&#34;headerlink&#34; title=&#34;Programs&#34;&gt;&lt;/a&gt;Programs&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; ghidra&amp;#xC758; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Symbols, Bytes, Reference, Comments &amp;#xB4F1; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xB610;&amp;#xD55C; Ghidra &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xC774; &amp;#xB418;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Plugins&#34;&gt;&lt;a href=&#34;#Plugins&#34; class=&#34;headerlink&#34; title=&#34;Plugins&#34;&gt;&lt;/a&gt;Plugins&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC758; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC740; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC8E0;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xB4E4;&amp;#xC740; &amp;#xC11C;&amp;#xB85C; &amp;#xC18C;&amp;#xD1B5;&amp;#xD558;&amp;#xBA70; ghidra &amp;#xC7AC;&amp;#xC2DC;&amp;#xC791; &amp;#xC5C6;&amp;#xC774; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC758; &amp;#xCD94;&amp;#xAC00;/&amp;#xC81C;&amp;#xAC70;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xB300;&amp;#xB85C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Tools&#34;&gt;&lt;a href=&#34;#Tools&#34; class=&#34;headerlink&#34; title=&#34;Tools&#34;&gt;&lt;/a&gt;Tools&lt;/h2&gt;&lt;p&gt;Tools&amp;#xB294; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xACFC; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xC124;&amp;#xC815;&amp;#xC758; &amp;#xBAA8;&amp;#xC784;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; tools&amp;#xB294; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC11C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; tools&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Project-Manager&#34;&gt;&lt;a href=&#34;#Project-Manager&#34; class=&#34;headerlink&#34; title=&#34;Project Manager&#34;&gt;&lt;/a&gt;Project Manager&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774;, &amp;#xD2B9;&amp;#xC815; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xADF8;&amp;#xB8F9;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;, tools, data&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB9CC; &amp;#xC5F4;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; ghidra&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, &amp;#xAC70;&amp;#xAE30;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xACFC;&amp;#xC815;&amp;#xC774; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;h2 id=&#34;Ghidra-Server&#34;&gt;&lt;a href=&#34;#Ghidra-Server&#34; class=&#34;headerlink&#34; title=&#34;Ghidra Server&#34;&gt;&lt;/a&gt;Ghidra Server&lt;/h2&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xD611;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xD55C; Shared-Project&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACF5;&amp;#xC720; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; ghidra &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xC720;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;. &amp;#xD30C;&amp;#xC77C; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, check out, check in, version history &amp;#xB4F1;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Ghidra-vs-IDA-Pro&#34;&gt;&lt;a href=&#34;#Ghidra-vs-IDA-Pro&#34; class=&#34;headerlink&#34; title=&#34;Ghidra vs IDA Pro&#34;&gt;&lt;/a&gt;Ghidra vs IDA Pro&lt;/h1&gt;&lt;p&gt;ghidra&amp;#xB294; &amp;#xBD84;&amp;#xC11D; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD300; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC83; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC7A5;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC7A5;&amp;#xC810;&amp;#xC740; &lt;strong&gt;&amp;#xBB34;&amp;#xB8CC;&lt;/strong&gt;&amp;#xB77C;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xC8E0;. IDA Pro&amp;#xC758; &amp;#xAC00;&amp;#xACA9;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xB97C; &amp;#xD574;&amp;#xBCF8;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5C4;&amp;#xCCAD;&amp;#xB09C; &amp;#xC7A5;&amp;#xC810;&amp;#x2026;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAC1C;&amp;#xC778;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xACF5;&amp;#xBD80; &amp;#xC6A9;&amp;#xB3C4;&amp;#xB85C; 200&amp;#xB9CC; &amp;#xC6D0;&amp;#xAC00;&amp;#xB7C9;&amp;#xC744; &amp;#xC9C0;&amp;#xBD88;&amp;#xD558;&amp;#xAE30;&amp;#xC5D0;&amp;#xB294;&amp;#x2026; &amp;#xD06C;&amp;#xD760;&lt;/p&gt;
&lt;p&gt;Ghidra&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xACE0; &amp;#xB098;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC740; IDA Pro&amp;#xB791; ghidra&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;, &amp;#xBB50;&amp;#xAC00; &amp;#xB354; &amp;#xB098;&amp;#xC740;&amp;#xAC00;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD1A0;&amp;#xB860;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC84C;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xB354; &amp;#xB098;&amp;#xC740;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; &amp;#xC0AC;&amp;#xB78C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2E4;&amp;#xB974;&amp;#xBBC0;&amp;#xB85C; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xD55C; &amp;#xBC88; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;ghidra&amp;#xB294; decompiler&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xAC83;&amp;#xC774; &amp;#xBB34;&amp;#xB8CC;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;IDA&amp;#xAC00; &amp;#xBB34;&amp;#xB8CC; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Hex-rays &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xC758; &amp;#xD070; &amp;#xC7A5;&amp;#xC810; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;IDA&amp;#xC5D0;&amp;#xB294; debugger&amp;#xAC00; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xC5D0;&amp;#xB294; &amp;#xC5C6;&amp;#xB2E4;!&lt;ul&gt;
&lt;li&gt;IDA&amp;#xC5D0;&amp;#xB294; debugger&amp;#xB97C; &amp;#xBD99;&amp;#xC5EC;&amp;#xC11C; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xB294; &amp;#xD55C; &amp;#xBC88;&amp;#xC5D0; &amp;#xC5EC;&amp;#xB7EC; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;ul&gt;
&lt;li&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xACFC; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &amp;#xAC04;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC; &amp;#xCD94;&amp;#xC801;&amp;#xC744; &amp;#xC27D;&amp;#xAC8C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD750;&amp;#xB984; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBCC0;&amp;#xC218;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;ghidra&amp;#xBCF4;&amp;#xB2E4; IDA&amp;#xAC00; &amp;#xB354; &amp;#xC624;&amp;#xB798; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC5B4;&amp;#xC11C;, IDA &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xC880; &amp;#xB354; &amp;#xB9CE;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF8; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC740; &amp;#xC774; &amp;#xC815;&amp;#xB3C4;&amp;#xAC00; &amp;#xC788;&amp;#xACE0;, Hex-rays&amp;#xC640; Ghidra Decompiler&amp;#xC758; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Hex-rays-vs-Ghidra-Decompiler&#34;&gt;&lt;a href=&#34;#Hex-rays-vs-Ghidra-Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Hex-rays vs Ghidra Decompiler&#34;&gt;&lt;/a&gt;Hex-rays vs Ghidra Decompiler&lt;/h2&gt;&lt;h3 id=&#34;Hex-rays&#34;&gt;&lt;a href=&#34;#Hex-rays&#34; class=&#34;headerlink&#34; title=&#34;Hex-rays&#34;&gt;&lt;/a&gt;Hex-rays&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://ko.wikipedia.org/wiki/%EB%A7%88%EC%9D%B4%ED%81%AC%EB%A1%9C%EC%BD%94%EB%93%9C&#34;&gt;Microcode&lt;/a&gt; &amp;#xAE30;&amp;#xBC18;&lt;/li&gt;
&lt;li&gt;&amp;#xC77C;&amp;#xBD80; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98;&amp;#xB9CC; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218;, &amp;#xB370;&amp;#xC774;&amp;#xD130;, &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; xrefer &amp;#xC81C;&amp;#xACF5;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218; &amp;#xB9E4;&amp;#xD551; &amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCC0;&amp;#xC218; &amp;#xD45C;&amp;#xD604;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;(decimal, hex, char &amp;#xB4F1;)&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&#34;Ghidra-Decompiler&#34;&gt;&lt;a href=&#34;#Ghidra-Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Ghidra Decompiler&#34;&gt;&lt;/a&gt;Ghidra Decompiler&lt;/h3&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://ko.wikipedia.org/wiki/P-%EC%BD%94%EB%93%9C&#34;&gt;P-code&lt;/a&gt; &amp;#xAE30;&amp;#xBC18;&lt;/li&gt;
&lt;li&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xC544;&amp;#xD0A4;&amp;#xD14D;&amp;#xCC98; &amp;#xC9C0;&amp;#xC6D0;&lt;/li&gt;
&lt;li&gt;xref &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC74C;&lt;/li&gt;
&lt;li&gt;&amp;#xBCC0;&amp;#xC218; &amp;#xB9E4;&amp;#xD551; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;li&gt;&amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCC0;&amp;#xC218; &amp;#xD45C;&amp;#xD604; &amp;#xBCC0;&amp;#xACBD; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;IDA Pro&amp;#xC640;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB3C4; &amp;#xAC04;&amp;#xB7B5;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8;, &amp;#xC774;&amp;#xC81C; ghidra&amp;#xB97C; &amp;#xB9CC;&amp;#xB098;&amp;#xB7EC; &amp;#xAC00;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Ghidra&amp;#xB97C;-&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&#34;&gt;&lt;a href=&#34;#Ghidra&amp;#xB97C;-&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;!&#34;&gt;&lt;/a&gt;Ghidra&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;!&lt;/h1&gt;&lt;p&gt;&amp;#xBA3C;&amp;#xC800; ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC124;&amp;#xCE58;&amp;#xB97C; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;? ghidra&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows 7 or 10 (64-bit)&lt;/li&gt;
&lt;li&gt;Linux (64-bit, CentOS 7 is preferred)&lt;/li&gt;
&lt;li&gt;macOS (OS X) 10.8.3+ (Mountain Lion or later)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; OS&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC740; &amp;#xC77C;&amp;#xC808; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xB2C8; &amp;#xCC38;&amp;#xACE0;&amp;#xD574;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; ghidra&amp;#xB294; JAVA&amp;#xB85C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xB9D0;&amp;#xC500;&amp;#xB4DC;&amp;#xB838;&amp;#xC8E0;? &amp;#xB530;&amp;#xB77C;&amp;#xC11C; jdk &amp;#xB610;&amp;#xD55C; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. ghidra&amp;#xC758; &amp;#xC6D0;&amp;#xD65C;&amp;#xD55C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &lt;a href=&#34;https://www.oracle.com/java/technologies/javase-jdk11-downloads.html&#34;&gt;jdk 11&lt;/a&gt;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;ghidra &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xC124;&amp;#xCE58;&amp;#xB294; &lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;ghidra &amp;#xD648;&amp;#xD398;&amp;#xC774;&amp;#xC9C0;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; Download Ghidra &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC124;&amp;#xCE58;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; setup &amp;#xC5C6;&amp;#xC774; &amp;#xC555;&amp;#xCD95;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD55C; &amp;#xD6C4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBB58; &amp;#xB20C;&amp;#xB7EC;&amp;#xC57C; &amp;#xB420;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC73C;&amp;#xBA74; &amp;#xADF8;&amp;#xB0E5; &amp;#xB458; &amp;#xB2E4; &amp;#xB20C;&amp;#xB7EC;&amp;#xBCF4;&amp;#xC790;&lt;/del&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Windows&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACE0;, Linux&amp;#xB098; MacOS&amp;#xB294; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;-Crackme&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-Ghidra-&amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34;&gt;&lt;a href=&#34;#&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;-Crackme&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-Ghidra-&amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Crackme&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Ghidra &amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&#34;&gt;&lt;/a&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; Crackme&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Ghidra &amp;#xD0D0;&amp;#xC0C9;&amp;#xC804;&lt;/h1&gt;&lt;p&gt;&amp;#xC81C;&amp;#xAC00; Windows &amp;#xBA38;&amp;#xC2E0;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; Windows &amp;#xAE30;&amp;#xC900;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xD589;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Linux&amp;#xC640; MacOS&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC2E4;&amp;#xD589; &amp;#xBC29;&amp;#xC2DD;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&amp;#xB9CC; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xBFD0;, &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xB2C8; &amp;#xAC71;&amp;#xC815; &amp;#xC548; &amp;#xD558;&amp;#xC154;&amp;#xB3C4; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &lt;a href=&#34;https://crackmes.one/crackme/6004daf233c5d42c3d016717&#34;&gt;&amp;#xC5EC;&amp;#xAE30;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBE44;&amp;#xBC00;&amp;#xBC88;&amp;#xD638;&amp;#xB294; &lt;code&gt;crackmes.one&lt;/code&gt;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.)&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;ghidraRun.bat&lt;/code&gt;&amp;#xC774;&amp;#xB098; &lt;code&gt;ghidraRun.sh&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; ghidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB85C;&amp;#xB4DC;, &amp;#xAD6C;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C8; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8; &amp;#xC564; &amp;#xB4DC;&amp;#xB86D;&amp;#xC744; &amp;#xD558;&amp;#xC5EC; &amp;#xCD94;&amp;#xAC00;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;File - New Project (Ctrl+N)&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB4DC;&amp;#xB798;&amp;#xADF8; &amp;#xC564; &amp;#xB4DC;&amp;#xB86D;&amp;#xD558;&amp;#xAC70;&amp;#xB098; Import File&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC5EC; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; import&amp;#xAC00; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xBA74;, Import Summary &amp;#xCC3D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAC04;&amp;#xB7B5;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xC815;&amp;#xBCF4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC;, Compiler ID &amp;#xB4F1;&amp;#xB4F1;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC88B;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.)&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xC81D;&amp;#xD2B8; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; crackme.exe&amp;#xB97C; &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xB4DC;&amp;#xB798;&amp;#xACE4;(!) &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xB728;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xB0D0;&amp;#xACE0; &amp;#xBB3B;&amp;#xB294; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; Yes&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%208.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Yes&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D; &amp;#xC635;&amp;#xC158;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1C;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xC138;&amp;#xD305;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#xAE30;&amp;#xBCF8; &amp;#xAC12;&amp;#xC744; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC154;&amp;#xB3C4; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%209.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xC644;&amp;#xB8CC;&amp;#xB418;&amp;#xACE0; &amp;#xB09C; &amp;#xD6C4; &amp;#xBA54;&amp;#xC778; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xBA54;&amp;#xC778; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xAC01; &amp;#xC139;&amp;#xC158;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Program-amp-Symbol-Trees-Data-Type-Manager&#34;&gt;&lt;a href=&#34;#Program-amp-Symbol-Trees-Data-Type-Manager&#34; class=&#34;headerlink&#34; title=&#34;Program &amp;amp; Symbol Trees, Data Type Manager&#34;&gt;&lt;/a&gt;Program &amp;amp; Symbol Trees, Data Type Manager&lt;/h2&gt;&lt;h3 id=&#34;Program-Trees&#34;&gt;&lt;a href=&#34;#Program-Trees&#34; class=&#34;headerlink&#34; title=&#34;Program Trees&#34;&gt;&lt;/a&gt;Program Trees&lt;/h3&gt;&lt;p&gt;Program Trees&amp;#xB97C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC139;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xD2B8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB098;&amp;#xB20C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2010.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2011.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Dominance&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xC131;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xC139;&amp;#xC158; &amp;#xC608;&amp;#xC2DC;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3 id=&#34;Symbol-Tree&#34;&gt;&lt;a href=&#34;#Symbol-Tree&#34; class=&#34;headerlink&#34; title=&#34;Symbol Tree&#34;&gt;&lt;/a&gt;Symbol Tree&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2012.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Symbol Tree&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; Import &amp;#xB41C; DLL, Exports &amp;#xB41C; &amp;#xD568;&amp;#xC218; &amp;#xB4F1;&amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC81C;&amp;#xACF5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD2B9;&amp;#xC815; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2013.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2014.png&#34; alt&gt;&lt;/p&gt;
&lt;h3 id=&#34;Data-Type-Manager&#34;&gt;&lt;a href=&#34;#Data-Type-Manager&#34; class=&#34;headerlink&#34; title=&#34;Data Type Manager&#34;&gt;&lt;/a&gt;Data Type Manager&lt;/h3&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2015.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Data Type Manager&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xAC70;&amp;#xB098;, &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD0C0;&amp;#xC785;&amp;#xC744; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x201C;Find Uses of&amp;#x201D;(&lt;code&gt;Ctrl + Shift + F&lt;/code&gt;)&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xB0B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2016.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2017.png&#34; alt&gt;&lt;/p&gt;
&lt;h2 id=&#34;Disassembly-View-amp-Function-Graph&#34;&gt;&lt;a href=&#34;#Disassembly-View-amp-Function-Graph&#34; class=&#34;headerlink&#34; title=&#34;Disassembly View &amp;amp; Function Graph&#34;&gt;&lt;/a&gt;Disassembly View &amp;amp; Function Graph&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2018.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC911;&amp;#xC559;&amp;#xC5D0; &amp;#xD070; &amp;#xD654;&amp;#xBA74;&amp;#xC740; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xB41C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xCC3D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xB7EC; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0;, &amp;#xC5B4;&amp;#xB5A4; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774; &amp;#xD45C;&amp;#xC2DC;&amp;#xB420;&amp;#xC9C0; &amp;#xB4F1; &amp;#xBAA8;&amp;#xB450; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC0C1;&amp;#xB2E8; &amp;#xD45C;&amp;#xC2DC;&amp;#xC904;&amp;#xC5D0; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#x201C;Edit the Listing fileds&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#x201C;Instruction/Data&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC218;&amp;#xC815;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD06C;&amp;#xAE30; &amp;#xC870;&amp;#xC815;, &amp;#xC704;&amp;#xCE58; &amp;#xC774;&amp;#xB3D9;, &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;, &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xAE30;&amp;#xB2A5; &amp;#xCD94;&amp;#xAC00; &amp;#xB4F1; &amp;#xB2E4;&amp;#xC591;&amp;#xD558;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2019.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;L&lt;/code&gt; &amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2020.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB3D9; &amp;#xC5C6;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xBA74; &amp;#xD568;&amp;#xC218; &amp;#xC774;&amp;#xB984;&amp;#xC5D0; &amp;#xB9C8;&amp;#xC6B0;&amp;#xC2A4; &amp;#xCEE4;&amp;#xC11C;&amp;#xB97C; &amp;#xC62C;&amp;#xB824;&amp;#xB193;&amp;#xACE0; &amp;#xAE30;&amp;#xB2E4;&amp;#xB9AC;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2021.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;-Comments- &amp;#xC6D0;&amp;#xD558;&amp;#xB294; Comment&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC8FC;&amp;#xC11D;&amp;#xB3C4; &amp;#xCD94;&amp;#xAC00;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;;&lt;/code&gt; &amp;#xB2E8;&amp;#xCD95;&amp;#xD0A4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xBC14;&amp;#xB85C; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xB2EC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2022.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;code&gt;;&lt;/code&gt;&amp;#xB97C; &amp;#xB20C;&amp;#xB800;&amp;#xC744; &amp;#xB54C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xCC3D;. &amp;#xD574;&amp;#xB2F9; &amp;#xCC3D;&amp;#xC5D0; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#x2018;OK&amp;#x2019;&amp;#xB97C; &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;IDA Pro&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xAC00;&amp;#xC7A5; &amp;#xD3B8;&amp;#xD588;&amp;#xB358; &amp;#xAE30;&amp;#xB2A5; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBAA8;&amp;#xB4DC;&amp;#xC600;&amp;#xC8E0;? ghidra&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC21C; &amp;#xC5C6;&amp;#xC9C0;&amp;#xB9CC; &amp;#x201C;Windows&amp;#x201D; - &amp;#x201C;Function Graph&amp;#x201D;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xADF8;&amp;#xB798;&amp;#xD504; &amp;#xBDF0;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2023.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2024.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; function graph. IDA Pro&amp;#xC640; &amp;#xD070; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xB098;&amp;#xC9C4; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2025.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Function Graph &amp;#xB610;&amp;#xD55C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC6B0;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC758; &amp;#x201C;Edit Code Block Fileds&amp;#x201D;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD55C; &amp;#xD6C4; &amp;#x201C;Instruction/Data&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC544;&amp;#xBB34; &amp;#xACF5;&amp;#xAC04;&amp;#xC774;&amp;#xB098; &amp;#xC6B0;&amp;#xD074;&amp;#xB9AD;-Add Field&amp;#xB85C; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Decompiler&#34;&gt;&lt;a href=&#34;#Decompiler&#34; class=&#34;headerlink&#34; title=&#34;Decompiler&#34;&gt;&lt;/a&gt;Decompiler&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; IDA Pro&amp;#xC758; hex-rays &amp;#xAE30;&amp;#xB2A5;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9;&amp;#xD558;&amp;#xB294; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC; &amp;#xCC3D; &amp;#xC6B0;&amp;#xCE21;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD558;&amp;#xBA70;, &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xC870;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC704;&amp;#xCE58; &amp;#xC870;&amp;#xC815; &amp;#xB610;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2026.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xBD80;&amp;#xB97C; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xB3FC;&amp;#xC11C; &amp;#xC6B0;&amp;#xCE21; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xCC3D;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; &amp;#xC0AC;&amp;#xC9C4;&amp;#xCC98;&amp;#xB7FC; Function Graph&amp;#xB97C; &amp;#xB04C;&amp;#xC5B4;&amp;#xB2E4; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; Function Graph &amp;#xCC3D;&amp;#xC774; &amp;#xC88C;&amp;#xCE21;&amp;#xC5D0; &amp;#xD45C;&amp;#xC2DC;&amp;#xB418;&amp;#xAC8C; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD130;&amp;#xB9C8;&amp;#xC774;&amp;#xC9D5;&amp;#xB3C4; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2027.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xB4DC;&amp;#xB9B0; &amp;#xAC83;&amp;#xACFC; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xBCC0;&amp;#xC218;&amp;#xB098; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xC218;&amp;#xC815;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xC8FC;&amp;#xC11D;&amp;#xC744; &amp;#xB2EC; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC801;&amp;#xC6A9;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, &amp;#xB514;&amp;#xC2A4; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC815;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB3C4; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB7EC; &amp;#xCC3D;&amp;#xC5D0; &amp;#xC801;&amp;#xC6A9;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Crackme&amp;#xB97C;-&amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&#34;&gt;&lt;a href=&#34;#Crackme&amp;#xB97C;-&amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;&#34; class=&#34;headerlink&#34; title=&#34;Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;!&#34;&gt;&lt;/a&gt;Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xC790;!&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; ghidra&amp;#xC758; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xAE30;&amp;#xB2A5;&amp;#xB3C4; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC73C;&amp;#xB2C8; Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2028.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9DE;&amp;#xB294; Input &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xAD70;&amp;#xC694;.(&lt;del&gt;Crackme&amp;#xB2C8;&amp;#xAE4C;&amp;#x2026; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD558;&amp;#xACA0;&amp;#xC9C0;&lt;/del&gt;) ghidra&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xC11C; &amp;#xB9DE;&amp;#xB294; input&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;ghidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD55C; &amp;#xD6C4; Project &amp;#xC0DD;&amp;#xC131; &amp;#xD6C4; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xACE0;, &amp;#xBD84;&amp;#xC11D;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC644;&amp;#xB8CC;&amp;#xD55C; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0;&amp;#xC11C; main &amp;#xD654;&amp;#xBA74;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. String &amp;#xAC80;&amp;#xC0C9;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;(&amp;#xADF8;&amp;#xAC8C; &amp;#xB354; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;), Symbol Tree&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCC3E;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC88C;&amp;#xCE21; Symbol Tree&amp;#xC5D0;&amp;#xC11C; Function &amp;#xC606; + &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2029.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;___main&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC11;&amp;#xC73C;&amp;#xB85C; &amp;#xB354; &amp;#xC2A4;&amp;#xD06C;&amp;#xB864;&amp;#xD574;&amp;#xC11C; &amp;#xB2E4;&amp;#xB978; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2030.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_main&lt;/code&gt;&amp;#xACFC; &lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Entry Point&amp;#xC778; &lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC8C; &amp;#xCC98;&amp;#xC74C; &amp;#xC2DC;&amp;#xC791;&amp;#xB418;&amp;#xB294; main &amp;#xD568;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2031.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_mainCRTStartup&lt;/code&gt;&amp;#xC758; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xB2C8; &lt;code&gt;___mingw_CRTStartup&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB3C4; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC744; &amp;#xD574;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? &amp;#xB354;&amp;#xBE14;&amp;#xD074;&amp;#xB9AD;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB3D9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2032.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;___main&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC640; &lt;code&gt;_main&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC5D0; &amp;#xD568;&amp;#xC218;&amp;#xBD80;&amp;#xD130; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2033.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2034.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC74C;&amp;#x2026; &amp;#xC2E4;&amp;#xD589;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xB098;&amp;#xC624;&amp;#xB294; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xAC78; &amp;#xBCF4;&amp;#xC544; &lt;code&gt;_main&lt;/code&gt;&amp;#xC774; &amp;#xC9C4;&amp;#xC9DC; &amp;#xBA54;&amp;#xC778; &amp;#xD568;&amp;#xC218;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &amp;#xB4A4;&amp;#xB85C; &amp;#xAC00;&amp;#xAC70;&amp;#xB098; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC88C;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC758; &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;code&gt;ALT + &amp;#xC88C;&amp;#xC6B0; &amp;#xBC29;&amp;#xD5A5;&amp;#xD0A4;&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2035.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;_main&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xC624;&amp;#xB2C8; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xD655;&amp;#xC778;&amp;#xD588;&amp;#xB358; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xB3C4; &amp;#xCD9C;&amp;#xB825;&amp;#xB418;&amp;#xACE0;, &amp;#xC785;&amp;#xB825; &amp;#xAC12;&amp;#xACFC; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xB3C4; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xC544;&amp;#xBB34;&amp;#xB798;&amp;#xB3C4; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4; 1&amp;#xC9DC;&amp;#xB9AC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C;&amp;#xC774;&amp;#xB2E4; &amp;#xBCF4;&amp;#xB2C8; &amp;#xBC14;&amp;#xB85C; &amp;#xD480;&amp;#xB824;&amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;&amp;#x314B;&amp;#x314B;&amp;#x314B;. &amp;#xBB50; ghidra&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xBB38;&amp;#xC81C;&amp;#xB2C8;&amp;#xAE4C;! &lt;code&gt;0x1232b14 = 19082004&lt;/code&gt;&amp;#xC774;&amp;#xBBC0;&amp;#xB85C; &amp;#xC785;&amp;#xB825;&amp;#xC744; &amp;#xD574;&amp;#xC8FC;&amp;#xBA74;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2036.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB2F5;&amp;#xC784;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xCE58;&amp;#xBA70;&amp;#x2026;&lt;/h1&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; ghidra&amp;#xB780; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0;, IDA&amp;#xB791; &amp;#xBE44;&amp;#xAD50;&amp;#xD588;&amp;#xC744; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, ghidra&amp;#xB294; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xB4E4;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; Easy Crackme&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA70; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Part 2&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC624;&amp;#xB298; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC9DA;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC04; Data, Function, Scripts&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xB2E4;&amp;#xB904;&amp;#xBCFC; &amp;#xC608;&amp;#xC815;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD6D;&amp;#xB0B4;&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xC9C1; IDA Pro &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB9CE;&amp;#xC9C0;&amp;#xB9CC; ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC774; &amp;#xACC4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xAC70;&amp;#xB098;, IDA Pro&amp;#xB97C; &amp;#xC811;&amp;#xD558;&amp;#xAE30; &amp;#xD798;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC11C; ghidra&amp;#xB97C; &amp;#xC368;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740;&amp;#xB370; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB2E4; &amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xB4E4;&amp;#xC5D0;&amp;#xAC8C; &amp;#xD070; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB410;&amp;#xC73C;&amp;#xBA74; &amp;#xD558;&amp;#xBA70;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xC124;&amp;#xBA85;&amp;#xC774;&amp;#xB098;, &amp;#xBD80;&amp;#xC871;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B8;&amp;#xC81C;&amp;#xB4E0; &amp;#xB313;&amp;#xAE00;&amp;#xB85C; &amp;#xB0A8;&amp;#xACA8;&amp;#xC8FC;&amp;#xC2DC;&amp;#xBA74; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xACE0; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB2E4;&amp;#xB4E4; &amp;#xC88B;&amp;#xC740; &amp;#xBC24; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC138;&amp;#xC694;~! &amp;#xC800;&amp;#xB294; &amp;#xC774;&amp;#xC81C; &amp;#xC790;&amp;#xB7EC; &amp;#xAC00; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/02/07/idioth/ghidra_part1/Untitled%2037.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;del&gt;&amp;#xBC24;&amp;#xC5D0; &amp;#xAE68;&amp;#xC5B4;&amp;#xC788;&amp;#xACE0; &amp;#xB0AE;&amp;#xC5D0; &amp;#xC790;&amp;#xB294; &amp;#xBC40;&amp;#xD30C;&amp;#xC774;&amp;#xC5B4; &amp;#xAC19;&amp;#xC740; &amp;#xBAA8;&amp;#xC21C;&amp;#xC801;&amp;#xC778; &amp;#xC0B6;&amp;#x2026;&lt;/del&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://dannyquist.github.io/gootkit-reversing-ghidra/&#34;&gt;https://dannyquist.github.io/gootkit-reversing-ghidra/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html&#34;&gt;https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ghidra.re/online-courses/&#34;&gt;https://ghidra.re/online-courses/&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/thumbnail.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/">

  <title>[Research] Re:versing  ghidra  Part 1 - Overview - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-02-07 14:00" pubdate>
      2021 2 7 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      4.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      81
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Re:versing  ghidra  Part 1 - Overview</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p><strong>&#xB2E4;&#xB978; &#xD30C;&#xD2B8; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</strong></p>
<p>Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 1 - Overview (Here!)</p>
<p><a href="https://hackyboiz.github.io/2021/03/07/idioth/ghidra_part2/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 2 - Data, Functions, Scripts</a></p>
<p><a href="https://hackyboiz.github.io/2021/04/04/ghidra_part3">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 3 - tips for IDA User</a></p>
<p><a href="https://hackyboiz.github.io/2021/05/19/idioth/ghidra_part4/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 4 - Malware Analysis (1)</a></p>
<p><a href="https://hackyboiz.github.io/2021/07/11/idioth/ghidra_part5/">Re:versing&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; ghidra &#xC0DD;&#xD65C; Part 5 - Malware Analysis (2)</a></p>
<hr>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! idioth&#xC785;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xC88B;&#xC544;&#xD558;&#xB294; &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158;&#xC758; &#xC774;&#xB984;&#xC744; &#xBE4C;&#xB824; &#xC2DC;&#xB9AC;&#xC988;&#xC758; &#xC81C;&#xBAA9;&#xC744; &#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4; &#xD558;&#xD558;&#xD558;! &#xC81C; &#xAE30;&#xC5B5;&#xC774; &#xB9DE;&#xB2E4;&#xBA74; &#xC800;&#xD76C; &#xBE14;&#xB85C;&#xADF8;&#xC758; &#xCCAB; research &#xAE00;&#xC740; Ghidra&#xC758; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC778; AngryGhidra&#xC600;&#xC8E0;?</p>
<p>&#xC0AC;&#xC2E4; &#xC800;&#xB294; ghidra&#xAC00; &#xCC98;&#xC74C; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC744; &#xB54C; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB54C;&#xB294; &#xAD6D;&#xAC00;&#xC758; &#xC694;&#xC6D0;(?)&#xC73C;&#xB85C; &#xBCF5;&#xBB34; &#xC911;&#xC774;&#xC5C8;&#xB294;&#xB370;, NSA&#xC5D0;&#xC11C; IDA&#xC640; &#xAC19;&#xC740; &#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1;&#xC744; &#xC704;&#xD55C; &#xD234;&#xC744; &#xBC1C;&#xD45C;&#xD55C;&#xB2E4;! &#xD588;&#xC744; &#xB54C; &#xC2E0;&#xAE30;&#xD588;&#xC5C8;&#xC8E0;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled.png" srcset="/img/loading.gif" alt></p>
<p>&#xAE54;&#xC544;&#xBCF4;&#xACE0; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xB290;&#xB080; &#xC810;&#xC740; &#x201C;&#xC544;.. &#xC774;&#xAC70; &#xC5C4;&#xCCAD; &#xBD88;&#xD3B8;&#xD558;&#xAD6C;&#xB098;&#x201D;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xBB34;&#xB798;&#xB3C4; IDA&#xC5D0; &#xC775;&#xC219;&#xD574;&#xC838; &#xC788;&#xC5C8;&#xC73C;&#xB2C8; &#xB2F9;&#xC5F0;&#xD55C; &#xC218;&#xC21C;&#x2026;</p>
<p>&#xADF8; &#xD6C4;&#xB85C; &#xC78A;&#xACE0; &#xC0B4;&#xB2E4;&#xAC00; &#xC18C;&#xC9D1;&#xD574;&#xC81C;&#xB97C; &#xD558;&#xACE0; &#xC5EC;&#xB7EC; &#xAE00;&#xB4E4;&#xC744; &#xBCF4;&#xB294;&#xB370; reverse engineering with ghidra, malware analysis with ghidra &#xB4F1; &#xD574;&#xC678;&#xC5D0;&#xC11C;&#xB294; ghidra&#xB97C; &#xB9CE;&#xC774; &#xC4F0;&#xB294; &#xAC83; &#xAC19;&#xB354;&#xB77C;&#xACE0;&#xC694;? &#xD558;&#xC9C0;&#xB9CC; &#xAD6D;&#xB0B4; &#xC790;&#xB8CC; &#xC911;&#xC5D0;&#xB294; ghidra&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xB8CC;&#xAC00; &#xB9CE;&#xC9C0; &#xC54A;&#xC544;&#xC11C;&#x2026; &#xC81C;&#xAC00; &#xACF5;&#xBD80;&#xD558;&#xAC70;&#xB098; &#xCC3E;&#xC544;&#xBCF8; &#xC790;&#xB8CC;&#xB97C; &#xD1A0;&#xB300;&#xB85C; &#xC2DC;&#xB9AC;&#xC988; &#xBB3C;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE00;&#xC740; offical docs&#xC640; &#xC5EC;&#xB7EC; &#xD574;&#xC678; &#xAC8C;&#xC2DC;&#xAE00;&#xB4E4;&#xC758; tip&#xB4E4;&#xC744; &#xC885;&#xD569;&#xD558;&#xC5EC; &#xC9C4;&#xD589;&#xB420; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xBA74; &#xC774;&#xC81C; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;!</p>
<h1 id="Ghidra&#xB780;-&#xBB34;&#xC5C7;&#xC778;&#xAC00;"><a href="#Ghidra&#xB780;-&#xBB34;&#xC5C7;&#xC778;&#xAC00;" class="headerlink" title="Ghidra&#xB780; &#xBB34;&#xC5C7;&#xC778;&#xAC00;?"></a>Ghidra&#xB780; &#xBB34;&#xC5C7;&#xC778;&#xAC00;?</h1><p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%201.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xC790;&#xAE30; &#xAF2C;&#xB9AC;&#xB97C; &#xBA39;&#xC73C;&#xB824; &#xD558;&#xB294; &#xC6A9;..??</p>
</blockquote>
<p>ghidra&#xB294; NSA(&#xBBF8;&#xAD6D; &#xAD6D;&#xAC00; &#xC548;&#xBCF4;&#xAD6D;)&#xC5D0;&#xC11C; &#xB9CC;&#xB4E0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xB9AC;&#xBC84;&#xC2A4; &#xC5D4;&#xC9C0;&#xB2C8;&#xC5B4;&#xB9C1;&#xC744; &#xC704;&#xD55C; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://wikileaks.org/ciav7p1/index.html">WikiLeaks&#xC758; Vault 7</a>&#xC5D0; &#xC758;&#xD574;&#xC11C; &#xCC98;&#xC74C; &#xC815;&#xCCB4;(?)&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xACE0;, <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.rsaconference.com/industry-topics/presentation/come-get-your-free-nsa-reverse-engineering-tool">2019&#xB144; RSA &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;</a>&#xC5D0;&#xC11C; &#xBC1C;&#xD45C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xB7EC; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; JAVA&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xACE0;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; 5&#xAC1C;&#xC758; &#xBA54;&#xC778; &#xD30C;&#xD2B8;&#xB97C; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Programs</li>
<li>Plugins</li>
<li>Tools</li>
<li>Project Manager</li>
<li>Server</li>
</ul>
<p>&#xD558;&#xB098;&#xD558;&#xB098;&#xAC00; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;?</p>
<h2 id="Programs"><a href="#Programs" class="headerlink" title="Programs"></a>Programs</h2><p>ghidra&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130;&#xB294; ghidra&#xC758; &#xCEE4;&#xC2A4;&#xD140; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. Symbols, Bytes, Reference, Comments &#xB4F1; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCD94;&#xAC00;&#xD55C; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130; &#xB610;&#xD55C; Ghidra &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xC774; &#xB418;&#xC8E0;.</p>
<h2 id="Plugins"><a href="#Plugins" class="headerlink" title="Plugins"></a>Plugins</h2><p>ghidra&#xB294; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xB4E4;&#xC758; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01;&#xC758; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xB4E4;&#xC740; &#xD2B9;&#xC815;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC8E0;. &#xBAA8;&#xB4E0; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xB4E4;&#xC740; &#xC11C;&#xB85C; &#xC18C;&#xD1B5;&#xD558;&#xBA70; ghidra &#xC7AC;&#xC2DC;&#xC791; &#xC5C6;&#xC774; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC758; &#xCD94;&#xAC00;/&#xC81C;&#xAC70;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xB300;&#xB85C; &#xCEE4;&#xC2A4;&#xD140;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC9C1;&#xC811; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC791;&#xC131;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC8E0;.</p>
<h2 id="Tools"><a href="#Tools" class="headerlink" title="Tools"></a>Tools</h2><p>Tools&#xB294; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xACFC; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xC124;&#xC815;&#xC758; &#xBAA8;&#xC784;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xD3B8;&#xD569;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; tools&#xB294; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xCD94;&#xAC00;&#xD574;&#xC11C; &#xC6D0;&#xD558;&#xB294; tools&#xB97C; &#xB9CC;&#xB4E4; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Project-Manager"><a href="#Project-Manager" class="headerlink" title="Project Manager"></a>Project Manager</h2><p>&#xC774;&#xB984;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774;, &#xD2B9;&#xC815; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xADF8;&#xB8F9;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;, tools, data&#xB97C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. IDA&#xC5D0;&#xC11C;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB9CC; &#xC5F4;&#xBA74; &#xB418;&#xB294; &#xAC83;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; ghidra&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xAC70;&#xAE30;&#xC5D0; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCD94;&#xAC00;&#xD574;&#xC57C; &#xD558;&#xB294; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC694;&#xD558;&#xC8E0;.</p>
<h2 id="Ghidra-Server"><a href="#Ghidra-Server" class="headerlink" title="Ghidra Server"></a>Ghidra Server</h2><p>ghidra&#xB294; &#xD611;&#xC5C5;&#xC744; &#xC704;&#xD55C; Shared-Project&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACF5;&#xC720; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC740; ghidra &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xACF5;&#xC720;&#xD560; &#xC218; &#xC788;&#xC8E0;. &#xD30C;&#xC77C; &#xBC84;&#xC804;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0;, check out, check in, version history &#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="Ghidra-vs-IDA-Pro"><a href="#Ghidra-vs-IDA-Pro" class="headerlink" title="Ghidra vs IDA Pro"></a>Ghidra vs IDA Pro</h1><p>ghidra&#xB294; &#xBD84;&#xC11D; &#xD658;&#xACBD;&#xC744; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5; &#xD560; &#xC218; &#xC788;&#xACE0; &#xD300; &#xD65C;&#xB3D9;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC83; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xB294;&#xB370; &#xAC00;&#xC7A5; &#xD070; &#xC7A5;&#xC810;&#xC740; <strong>&#xBB34;&#xB8CC;</strong>&#xB77C;&#xB294; &#xC810;&#xC774;&#xC8E0;. IDA Pro&#xC758; &#xAC00;&#xACA9;&#xACFC; &#xBE44;&#xAD50;&#xB97C; &#xD574;&#xBCF8;&#xB2E4;&#xBA74; &#xC5C4;&#xCCAD;&#xB09C; &#xC7A5;&#xC810;&#x2026;!</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%202.png" srcset="/img/loading.gif" alt></p>
<p>&#xAC1C;&#xC778;&#xC801;&#xC778; &#xC0AC;&#xC6A9;&#xC744; &#xD558;&#xAC70;&#xB098; &#xACF5;&#xBD80; &#xC6A9;&#xB3C4;&#xB85C; 200&#xB9CC; &#xC6D0;&#xAC00;&#xB7C9;&#xC744; &#xC9C0;&#xBD88;&#xD558;&#xAE30;&#xC5D0;&#xB294;&#x2026; &#xD06C;&#xD760;</p>
<p>Ghidra&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xACE0; &#xB098;&#xC11C;&#xBD80;&#xD130; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; IDA Pro&#xB791; ghidra&#xC758; &#xCC28;&#xC774;&#xC810;, &#xBB50;&#xAC00; &#xB354; &#xB098;&#xC740;&#xAC00;&#xC5D0; &#xB300;&#xD55C; &#xD1A0;&#xB860;&#xC774; &#xB9CE;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xAC8C; &#xB354; &#xB098;&#xC740;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xC0DD;&#xAC01;&#xC740; &#xC0AC;&#xB78C;&#xB9C8;&#xB2E4; &#xB2E4;&#xB974;&#xBBC0;&#xB85C; &#xCC28;&#xC774;&#xC810;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xD55C; &#xBC88; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAE4C;&#xC694;?</p>
<ol>
<li>ghidra&#xB294; decompiler&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xC5EC; &#xBAA8;&#xB4E0; &#xAC83;&#xC774; &#xBB34;&#xB8CC;&#xB2E4;!<ul>
<li>IDA&#xAC00; &#xBB34;&#xB8CC; &#xBC84;&#xC804;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0;&#xB9CC; Hex-rays &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xC0DD;&#xAC01;&#xD558;&#xBA74; ghidra&#xC758; &#xD070; &#xC7A5;&#xC810; &#xC911; &#xD558;&#xB098;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC8E0;.</li>
</ul>
</li>
<li>IDA&#xC5D0;&#xB294; debugger&#xAC00; &#xC788;&#xC9C0;&#xB9CC; ghidra&#xC5D0;&#xB294; &#xC5C6;&#xB2E4;!<ul>
<li>IDA&#xC5D0;&#xB294; debugger&#xB97C; &#xBD99;&#xC5EC;&#xC11C; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC; ghidra&#xB294; &#xB514;&#xBC84;&#xAE45;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>ghidra&#xB294; &#xD55C; &#xBC88;&#xC5D0; &#xC5EC;&#xB7EC; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xB2E4;.<ul>
<li>&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xAC04;&#xC758; &#xCF54;&#xB4DC; &#xCD94;&#xC801;&#xC744; &#xC27D;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>ghidra&#xB294; &#xB370;&#xC774;&#xD130; &#xD750;&#xB984; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB098; &#xBCC0;&#xC218;&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB418;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xB2E4;.</li>
<li>ghidra&#xBCF4;&#xB2E4; IDA&#xAC00; &#xB354; &#xC624;&#xB798; &#xC0AC;&#xC6A9;&#xB418;&#xC5B4;&#xC11C;, IDA &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC774; &#xC880; &#xB354; &#xB9CE;&#xB2E4;.</li>
</ol>
<p>&#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF8; &#xCC28;&#xC774;&#xC810;&#xC740; &#xC774; &#xC815;&#xB3C4;&#xAC00; &#xC788;&#xACE0;, Hex-rays&#xC640; Ghidra Decompiler&#xC758; &#xB514;&#xCEF4;&#xD30C;&#xC77C; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xCC28;&#xC774;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Hex-rays-vs-Ghidra-Decompiler"><a href="#Hex-rays-vs-Ghidra-Decompiler" class="headerlink" title="Hex-rays vs Ghidra Decompiler"></a>Hex-rays vs Ghidra Decompiler</h2><h3 id="Hex-rays"><a href="#Hex-rays" class="headerlink" title="Hex-rays"></a>Hex-rays</h3><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ko.wikipedia.org/wiki/%EB%A7%88%EC%9D%B4%ED%81%AC%EB%A1%9C%EC%BD%94%EB%93%9C">Microcode</a> &#xAE30;&#xBC18;</li>
<li>&#xC77C;&#xBD80; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB9CC; &#xC9C0;&#xC6D0;</li>
<li>&#xBCC0;&#xC218;, &#xB370;&#xC774;&#xD130;, &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD55C; xrefer &#xC81C;&#xACF5;</li>
<li>&#xBCC0;&#xC218; &#xB9E4;&#xD551; &#xAC00;&#xB2A5;</li>
<li>&#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC5D0;&#xC11C; &#xBCC0;&#xC218; &#xD45C;&#xD604;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC74C;(decimal, hex, char &#xB4F1;)</li>
</ul>
<h3 id="Ghidra-Decompiler"><a href="#Ghidra-Decompiler" class="headerlink" title="Ghidra Decompiler"></a>Ghidra Decompiler</h3><ul>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ko.wikipedia.org/wiki/P-%EC%BD%94%EB%93%9C">P-code</a> &#xAE30;&#xBC18;</li>
<li>&#xBAA8;&#xB4E0; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xC9C0;&#xC6D0;</li>
<li>xref &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC74C;</li>
<li>&#xBCC0;&#xC218; &#xB9E4;&#xD551; &#xBD88;&#xAC00;&#xB2A5;</li>
<li>&#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC5D0;&#xC11C; &#xBCC0;&#xC218; &#xD45C;&#xD604; &#xBCC0;&#xACBD; &#xBD88;&#xAC00;&#xB2A5;</li>
</ul>
<p>IDA Pro&#xC640;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xAC04;&#xB7B5;&#xD558;&#xAC8C; &#xC54C;&#xC544;&#xBCF4;&#xC558;&#xC73C;&#xB2C8;, &#xC774;&#xC81C; ghidra&#xB97C; &#xB9CC;&#xB098;&#xB7EC; &#xAC00;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h1 id="Ghidra&#xB97C;-&#xC124;&#xCE58;&#xD574;&#xBCF4;&#xC790;"><a href="#Ghidra&#xB97C;-&#xC124;&#xCE58;&#xD574;&#xBCF4;&#xC790;" class="headerlink" title="Ghidra&#xB97C; &#xC124;&#xCE58;&#xD574;&#xBCF4;&#xC790;!"></a>Ghidra&#xB97C; &#xC124;&#xCE58;&#xD574;&#xBCF4;&#xC790;!</h1><p>&#xBA3C;&#xC800; ghidra&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC124;&#xCE58;&#xB97C; &#xD574;&#xC57C;&#xACA0;&#xC8E0;? ghidra&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Windows 7 or 10 (64-bit)</li>
<li>Linux (64-bit, CentOS 7 is preferred)</li>
<li>macOS (OS X) 10.8.3+ (Mountain Lion or later)</li>
</ul>
<p>32&#xBE44;&#xD2B8; OS&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC6D0;&#xC740; &#xC77C;&#xC808; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xB2C8; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;!</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC704;&#xC5D0;&#xC11C; ghidra&#xB294; JAVA&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xB2E4;&#xACE0; &#xB9D0;&#xC500;&#xB4DC;&#xB838;&#xC8E0;? &#xB530;&#xB77C;&#xC11C; jdk &#xB610;&#xD55C; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. ghidra&#xC758; &#xC6D0;&#xD65C;&#xD55C; &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD574;&#xC11C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.oracle.com/java/technologies/javase-jdk11-downloads.html">jdk 11</a>&#xC744; &#xC124;&#xCE58;&#xD574;&#xC8FC;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>ghidra &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xC124;&#xCE58;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://ghidra-sre.org/">ghidra &#xD648;&#xD398;&#xC774;&#xC9C0;</a>&#xC5D0;&#xC11C; Download Ghidra &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC124;&#xCE58;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBCC4;&#xB3C4;&#xC758; setup &#xC5C6;&#xC774; &#xC555;&#xCD95;&#xC744; &#xD574;&#xC81C;&#xD55C; &#xD6C4; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB530;&#xB77C; <code>ghidraRun.sh</code>&#xC774;&#xB098; <code>ghidraRun.bat</code>&#xB97C; &#xD074;&#xB9AD;&#xD574;&#xC8FC;&#xBA74; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%203.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p><del>&#xBB58; &#xB20C;&#xB7EC;&#xC57C; &#xB420;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xC73C;&#xBA74; &#xADF8;&#xB0E5; &#xB458; &#xB2E4; &#xB20C;&#xB7EC;&#xBCF4;&#xC790;</del></p>
</blockquote>
<p>Windows&#xC758; &#xACBD;&#xC6B0; <code>ghidraRun.bat</code>&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xB418;&#xACE0;, Linux&#xB098; MacOS&#xB294; <code>ghidraRun.sh</code>&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xAC04;&#xB2E8;&#xD55C;-Crackme&#xB97C;-&#xD1B5;&#xD55C;-Ghidra-&#xD0D0;&#xC0C9;&#xC804;"><a href="#&#xAC04;&#xB2E8;&#xD55C;-Crackme&#xB97C;-&#xD1B5;&#xD55C;-Ghidra-&#xD0D0;&#xC0C9;&#xC804;" class="headerlink" title="&#xAC04;&#xB2E8;&#xD55C; Crackme&#xB97C; &#xD1B5;&#xD55C; Ghidra &#xD0D0;&#xC0C9;&#xC804;"></a>&#xAC04;&#xB2E8;&#xD55C; Crackme&#xB97C; &#xD1B5;&#xD55C; Ghidra &#xD0D0;&#xC0C9;&#xC804;</h1><p>&#xC81C;&#xAC00; Windows &#xBA38;&#xC2E0;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; Windows &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. Linux&#xC640; MacOS&#xC5D0;&#xC11C;&#xB3C4; &#xC2E4;&#xD589; &#xBC29;&#xC2DD;&#xC758; &#xCC28;&#xC774;&#xB9CC; &#xC874;&#xC7AC;&#xD560; &#xBFD0;, &#xCC28;&#xC774;&#xAC00; &#xC5C6;&#xC73C;&#xB2C8; &#xAC71;&#xC815; &#xC548; &#xD558;&#xC154;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;! &#xC774; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD55C; &#xC608;&#xC81C; &#xD30C;&#xC77C;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://crackmes.one/crackme/6004daf233c5d42c3d016717">&#xC5EC;&#xAE30;</a>&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC758; &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB294; <code>crackmes.one</code>&#xC785;&#xB2C8;&#xB2E4;.)</p>
<p>&#xBA3C;&#xC800; <code>ghidraRun.bat</code>&#xC774;&#xB098; <code>ghidraRun.sh</code>&#xC744; &#xD1B5;&#xD574; ghidra&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xCC3D;&#xC774; &#xB739;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%204.png" srcset="/img/loading.gif" alt></p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xCC3D;&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB85C;&#xB4DC;, &#xAD6C;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0C8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E0; &#xD6C4; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB4DC;&#xB798;&#xADF8; &#xC564; &#xB4DC;&#xB86D;&#xC744; &#xD558;&#xC5EC; &#xCD94;&#xAC00;&#xB97C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%205.png" srcset="/img/loading.gif" alt></p>
<p>File - New Project (Ctrl+N)&#xC744; &#xD1B5;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC704;&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD55C; &#xC608;&#xC81C; &#xD30C;&#xC77C;&#xC744; &#xB4DC;&#xB798;&#xADF8; &#xC564; &#xB4DC;&#xB86D;&#xD558;&#xAC70;&#xB098; Import File&#xC744; &#xD1B5;&#xD574; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%206.png" srcset="/img/loading.gif" alt></p>
<p>&#xBC14;&#xC774;&#xB108;&#xB9AC; import&#xAC00; &#xC644;&#xB8CC;&#xB418;&#xBA74;, Import Summary &#xCC3D;&#xC744; &#xD1B5;&#xD574; &#xAC04;&#xB7B5;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC815;&#xBCF4;&#xC5D0;&#xC11C; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;, Compiler ID &#xB4F1;&#xB4F1;&#xC744; &#xD1B5;&#xD574; &#xB300;&#xB7B5;&#xC801;&#xC778; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC744; &#xD560; &#xB54C; &#xC88B;&#xACA0;&#xB124;&#xC694;.)</p>
<p>&#xC774;&#xC81C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xCC3D;&#xC5D0;&#xC11C; crackme.exe&#xB97C; &#xB354;&#xBE14;&#xD074;&#xB9AD;&#xD558;&#xBA74; &#xB4DC;&#xB798;&#xACE4;(!) &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158;&#xC774; &#xB728;&#xACE0; &#xBD84;&#xC11D;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xACA0;&#xB0D0;&#xACE0; &#xBB3B;&#xB294; &#xCC3D;&#xC774; &#xB739;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; Yes&#xB97C; &#xD074;&#xB9AD;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%207.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%208.png" srcset="/img/loading.gif" alt></p>
<p>Yes&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xBA74; ghidra&#xC5D0;&#xC11C; &#xAC00;&#xB2A5;&#xD55C; &#xBD84;&#xC11D; &#xC635;&#xC158;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBCC4;&#xC801;&#xC778; &#xC138;&#xD305;&#xC740; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#xAE30;&#xBCF8; &#xAC12;&#xC744; &#xADF8;&#xB300;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC154;&#xB3C4; &#xD070; &#xBB38;&#xC81C;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%209.png" srcset="/img/loading.gif" alt></p>
<p>&#xBD84;&#xC11D;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xACE0; &#xB09C; &#xD6C4; &#xBA54;&#xC778; &#xD654;&#xBA74;&#xC740; &#xC704;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xBA54;&#xC778; &#xD654;&#xBA74;&#xC5D0; &#xAC01; &#xC139;&#xC158;&#xC774; &#xC5B4;&#xB5A0;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h2 id="Program-amp-Symbol-Trees-Data-Type-Manager"><a href="#Program-amp-Symbol-Trees-Data-Type-Manager" class="headerlink" title="Program &amp; Symbol Trees, Data Type Manager"></a>Program &amp; Symbol Trees, Data Type Manager</h2><h3 id="Program-Trees"><a href="#Program-Trees" class="headerlink" title="Program Trees"></a>Program Trees</h3><p>Program Trees&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xC139;&#xC158;&#xC73C;&#xB85C; &#xD2B8;&#xB9AC;&#xB97C; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2010.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2011.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>Dominance&#xB97C; &#xD1B5;&#xD574; &#xAD6C;&#xC131;&#xB41C; &#xCF54;&#xB4DC; &#xC139;&#xC158; &#xC608;&#xC2DC;</p>
</blockquote>
<h3 id="Symbol-Tree"><a href="#Symbol-Tree" class="headerlink" title="Symbol Tree"></a>Symbol Tree</h3><p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2012.png" srcset="/img/loading.gif" alt></p>
<p>Symbol Tree&#xC758; &#xACBD;&#xC6B0; Import &#xB41C; DLL, Exports &#xB41C; &#xD568;&#xC218; &#xB4F1;&#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xD2B9;&#xC815; &#xD568;&#xC218;&#xAC00; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB418;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2013.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2014.png" srcset="/img/loading.gif" alt></p>
<h3 id="Data-Type-Manager"><a href="#Data-Type-Manager" class="headerlink" title="Data Type Manager"></a>Data Type Manager</h3><p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2015.png" srcset="/img/loading.gif" alt></p>
<p>Data Type Manager&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC81C;&#xACF5;&#xB418;&#xAC70;&#xB098;, &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xD0C0;&#xC785;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130; &#xD0C0;&#xC785;&#xC744; &#xC6B0;&#xD074;&#xB9AD;&#xD558;&#xACE0; &#x201C;Find Uses of&#x201D;(<code>Ctrl + Shift + F</code>)&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB0B4;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130; &#xC720;&#xD615;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACF3;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2016.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2017.png" srcset="/img/loading.gif" alt></p>
<h2 id="Disassembly-View-amp-Function-Graph"><a href="#Disassembly-View-amp-Function-Graph" class="headerlink" title="Disassembly View &amp; Function Graph"></a>Disassembly View &amp; Function Graph</h2><p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2018.png" srcset="/img/loading.gif" alt></p>
<p>&#xC911;&#xC559;&#xC5D0; &#xD070; &#xD654;&#xBA74;&#xC740; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xCC3D;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC; &#xD544;&#xB4DC;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xACE0;, &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC5D0; &#xBB34;&#xC5C7;&#xC774; &#xD45C;&#xC2DC;&#xB420;&#xC9C0; &#xB4F1; &#xBAA8;&#xB450; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0C1;&#xB2E8; &#xD45C;&#xC2DC;&#xC904;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#x201C;Edit the Listing fileds&#x201D;&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xACE0; &#x201C;Instruction/Data&#x201D;&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xC218;&#xC815;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD06C;&#xAE30; &#xC870;&#xC815;, &#xC704;&#xCE58; &#xC774;&#xB3D9;, &#xBE44;&#xD65C;&#xC131;&#xD654;, &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xB2A5; &#xCD94;&#xAC00; &#xB4F1; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2019.png" srcset="/img/loading.gif" alt></p>
<p>IDA&#xC5D0;&#xC11C; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC; ghidra&#xC5D0;&#xC11C;&#xB294; <code>L</code> &#xB2E8;&#xCD95;&#xD0A4;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xD568;&#xC218;&#xC758; &#xC774;&#xB984;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2020.png" srcset="/img/loading.gif" alt></p>
<p>&#xB610;&#xD55C; &#xD568;&#xC218;&#xC758; &#xC774;&#xB3D9; &#xC5C6;&#xC774; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xAC00; &#xC5B4;&#xB5A0;&#xD55C; &#xCF54;&#xB4DC;&#xB85C; &#xB418;&#xC5B4;&#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC2F6;&#xC73C;&#xBA74; &#xD568;&#xC218; &#xC774;&#xB984;&#xC5D0; &#xB9C8;&#xC6B0;&#xC2A4; &#xCEE4;&#xC11C;&#xB97C; &#xC62C;&#xB824;&#xB193;&#xACE0; &#xAE30;&#xB2E4;&#xB9AC;&#xBA74; &#xD574;&#xB2F9; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2021.png" srcset="/img/loading.gif" alt></p>
<p>&#xC6D0;&#xD558;&#xB294; &#xBD80;&#xBD84; &#xC6B0;&#xD074;&#xB9AD;-Comments- &#xC6D0;&#xD558;&#xB294; Comment&#xB97C; &#xD1B5;&#xD574; &#xC8FC;&#xC11D;&#xB3C4; &#xCD94;&#xAC00;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. <code>;</code> &#xB2E8;&#xCD95;&#xD0A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC6D0;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC5D0; &#xBC14;&#xB85C; &#xC8FC;&#xC11D;&#xC744; &#xB2EC; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2022.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p><code>;</code>&#xB97C; &#xB20C;&#xB800;&#xC744; &#xB54C; &#xB098;&#xC624;&#xB294; &#xCC3D;. &#xD574;&#xB2F9; &#xCC3D;&#xC5D0; &#xC8FC;&#xC11D;&#xC744; &#xC785;&#xB825;&#xD558;&#xACE0; &#x2018;OK&#x2019;&#xB97C; &#xB204;&#xB974;&#xBA74; &#xB41C;&#xB2E4;.</p>
</blockquote>
<p>IDA Pro&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xAC00;&#xC7A5; &#xD3B8;&#xD588;&#xB358; &#xAE30;&#xB2A5; &#xC911; &#xD558;&#xB098;&#xAC00; &#xADF8;&#xB798;&#xD504; &#xBAA8;&#xB4DC;&#xC600;&#xC8E0;? ghidra&#xC5D0;&#xC11C;&#xB294; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xCC3D;&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xADF8;&#xB798;&#xD504; &#xBDF0;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC21C; &#xC5C6;&#xC9C0;&#xB9CC; &#x201C;Windows&#x201D; - &#x201C;Function Graph&#x201D;&#xB97C; &#xD1B5;&#xD574; &#xADF8;&#xB798;&#xD504; &#xBDF0;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2023.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2024.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>ghidra&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; function graph. IDA Pro&#xC640; &#xD070; &#xCC28;&#xC774;&#xAC00; &#xB098;&#xC9C4; &#xC54A;&#xB294;&#xB2E4;.</p>
</blockquote>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2025.png" srcset="/img/loading.gif" alt></p>
<p>Function Graph &#xB610;&#xD55C; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xCC3D;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xD45C;&#xC2DC;&#xB418;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xCE21; &#xC0C1;&#xB2E8;&#xC758; &#x201C;Edit Code Block Fileds&#x201D;&#xB97C; &#xD074;&#xB9AD;&#xD55C; &#xD6C4; &#x201C;Instruction/Data&#x201D;&#xC5D0;&#xC11C; &#xC544;&#xBB34; &#xACF5;&#xAC04;&#xC774;&#xB098; &#xC6B0;&#xD074;&#xB9AD;-Add Field&#xB85C; &#xC6D0;&#xD558;&#xB294; &#xCF54;&#xB4DC; &#xBE14;&#xB85D;&#xC744; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Decompiler"><a href="#Decompiler" class="headerlink" title="Decompiler"></a>Decompiler</h2><p>&#xC774;&#xC81C; IDA Pro&#xC758; hex-rays &#xAE30;&#xB2A5;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xCC3D;&#xC785;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14;&#xB7EC; &#xCC3D; &#xC6B0;&#xCE21;&#xC5D0; &#xC704;&#xCE58;&#xD558;&#xBA70;, &#xD06C;&#xAE30;&#xB97C; &#xC870;&#xC815;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC704;&#xCE58; &#xC870;&#xC815; &#xB610;&#xD55C; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2026.png" srcset="/img/loading.gif" alt></p>
<p>&#xD568;&#xC218; &#xB0B4;&#xBD80;&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD568;&#xC218; &#xB0B4;&#xC6A9;&#xC774; &#xB514;&#xCEF4;&#xD30C;&#xC77C; &#xB3FC;&#xC11C; &#xC6B0;&#xCE21; &#xB514;&#xCEF4;&#xD30C;&#xC77C; &#xCC3D;&#xC5D0; &#xD45C;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;. &#xC704;&#xC758; &#xC0AC;&#xC9C4;&#xCC98;&#xB7FC; Function Graph&#xB97C; &#xB04C;&#xC5B4;&#xB2E4; &#xB123;&#xC5B4;&#xC11C; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xCC3D;&#xC774; &#xC544;&#xB2CC; Function Graph &#xCC3D;&#xC774; &#xC88C;&#xCE21;&#xC5D0; &#xD45C;&#xC2DC;&#xB418;&#xAC8C; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xB3C4; &#xD560; &#xC218; &#xC788;&#xC8E0;!</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2027.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xB4DC;&#xB9B0; &#xAC83;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xCC3D;&#xC5D0;&#xC11C;&#xB3C4; &#xBCC0;&#xC218;&#xB098; &#xD568;&#xC218;&#xC758; &#xC774;&#xB984;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC8FC;&#xC11D;&#xC744; &#xB2EC; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xCC3D;&#xC5D0;&#xC11C; &#xC218;&#xC815;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xCC3D;&#xC5D0;&#xB3C4; &#xC801;&#xC6A9;&#xC774; &#xB418;&#xACE0;, &#xB514;&#xC2A4; &#xC5B4;&#xC148;&#xBE14; &#xCC3D;&#xC5D0;&#xC11C; &#xC218;&#xC815;&#xD55C; &#xB0B4;&#xC6A9;&#xB3C4; &#xB514;&#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xCC3D;&#xC5D0; &#xC801;&#xC6A9;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="Crackme&#xB97C;-&#xD480;&#xC5B4;&#xBCF4;&#xC790;"><a href="#Crackme&#xB97C;-&#xD480;&#xC5B4;&#xBCF4;&#xC790;" class="headerlink" title="Crackme&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xC790;!"></a>Crackme&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xC790;!</h2><p>&#xC774;&#xC81C; ghidra&#xC758; &#xB300;&#xB7B5;&#xC801;&#xC778; &#xAE30;&#xB2A5;&#xB3C4; &#xD655;&#xC778;&#xC744; &#xD574;&#xBCF4;&#xC558;&#xC73C;&#xB2C8; Crackme&#xB97C; &#xD480;&#xC5B4;&#xBCFC; &#xC218; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD574;&#xC11C; &#xC5B4;&#xB5A0;&#xD55C; &#xB140;&#xC11D;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xC744; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2028.png" srcset="/img/loading.gif" alt></p>
<p>&#xB9DE;&#xB294; Input &#xAC12;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xAD70;&#xC694;.(<del>Crackme&#xB2C8;&#xAE4C;&#x2026; &#xB2F9;&#xC5F0;&#xD558;&#xACA0;&#xC9C0;</del>) ghidra&#xB97C; &#xD655;&#xC778;&#xD574;&#xC11C; &#xB9DE;&#xB294; input&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xCC3E;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4;!</p>
<p>ghidra&#xB97C; &#xC2E4;&#xD589;&#xD55C; &#xD6C4; Project &#xC0DD;&#xC131; &#xD6C4; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xACE0;, &#xBD84;&#xC11D;&#xAE4C;&#xC9C0; &#xC644;&#xB8CC;&#xD55C; &#xD654;&#xBA74;&#xC5D0;&#xC11C; main &#xD654;&#xBA74;&#xC744; &#xCC3E;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;. String &#xAC80;&#xC0C9;&#xC744; &#xD1B5;&#xD574; &#xCC3E;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC;(&#xADF8;&#xAC8C; &#xB354; &#xAC04;&#xB2E8;&#xD558;&#xC9C0;&#xB9CC;), Symbol Tree&#xB97C; &#xD1B5;&#xD574; &#xCC3E;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;. &#xC88C;&#xCE21; Symbol Tree&#xC5D0;&#xC11C; Function &#xC606; + &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xD3F4;&#xB354;&#xB97C; &#xC5F4;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2029.png" srcset="/img/loading.gif" alt></p>
<p><code>___main</code>&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC11;&#xC73C;&#xB85C; &#xB354; &#xC2A4;&#xD06C;&#xB864;&#xD574;&#xC11C; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2030.png" srcset="/img/loading.gif" alt></p>
<p><code>_main</code>&#xACFC; <code>_mainCRTStartup</code>&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xAC78; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Entry Point&#xC778; <code>_mainCRTStartup</code>&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB5A4; &#xAC8C; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xB418;&#xB294; main &#xD568;&#xC218;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2031.png" srcset="/img/loading.gif" alt></p>
<p><code>_mainCRTStartup</code>&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xB2C8; <code>___mingw_CRTStartup</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB3C4; &#xD0D0;&#xC0C9;&#xC744; &#xD574;&#xBCFC;&#xAE4C;&#xC694;? &#xB354;&#xBE14;&#xD074;&#xB9AD;&#xC744; &#xD558;&#xBA74; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB85C; &#xC774;&#xB3D9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2032.png" srcset="/img/loading.gif" alt></p>
<p><code>___main</code> &#xD568;&#xC218;&#xC640; <code>_main</code> &#xD568;&#xC218;&#xB97C; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xC2E4;&#xD589;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC704;&#xC5D0; &#xD568;&#xC218;&#xBD80;&#xD130; &#xB4E4;&#xC5B4;&#xAC00; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2033.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2034.png" srcset="/img/loading.gif" alt></p>
<p>&#xC74C;&#x2026; &#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C; &#xB098;&#xC624;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC5C6;&#xB294; &#xAC78; &#xBCF4;&#xC544; <code>_main</code>&#xC774; &#xC9C4;&#xC9DC; &#xBA54;&#xC778; &#xD568;&#xC218;&#xC778; &#xAC83; &#xAC19;&#xB124;&#xC694;. &#xB4A4;&#xB85C; &#xAC00;&#xAC70;&#xB098; &#xC55E;&#xC73C;&#xB85C; &#xAC00;&#xB294; &#xAC83;&#xC740; &#xC88C;&#xCE21; &#xC0C1;&#xB2E8;&#xC758; &#xBC84;&#xD2BC;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC70;&#xB098; <code>ALT + &#xC88C;&#xC6B0; &#xBC29;&#xD5A5;&#xD0A4;</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2035.png" srcset="/img/loading.gif" alt></p>
<p><code>_main</code>&#xC73C;&#xB85C; &#xC624;&#xB2C8; &#xC704;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD588;&#xB358; &#xBB38;&#xC790;&#xC5F4;&#xB3C4; &#xCD9C;&#xB825;&#xB418;&#xACE0;, &#xC785;&#xB825; &#xAC12;&#xACFC; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xB3C4; &#xC788;&#xB124;&#xC694;. &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xB09C;&#xC774;&#xB3C4; 1&#xC9DC;&#xB9AC; &#xAC04;&#xB2E8;&#xD55C; &#xBB38;&#xC81C;&#xC774;&#xB2E4; &#xBCF4;&#xB2C8; &#xBC14;&#xB85C; &#xD480;&#xB824;&#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;&#x314B;&#x314B;&#x314B;. &#xBB50; ghidra&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xB824;&#xACE0; &#xAC00;&#xC838;&#xC628; &#xBB38;&#xC81C;&#xB2C8;&#xAE4C;! <code>0x1232b14 = 19082004</code>&#xC774;&#xBBC0;&#xB85C; &#xC785;&#xB825;&#xC744; &#xD574;&#xC8FC;&#xBA74;&#x2026;</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2036.png" srcset="/img/loading.gif" alt></p>
<p>&#xC815;&#xB2F5;&#xC784;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xB9C8;&#xCE58;&#xBA70;&#x2026;"><a href="#&#xB9C8;&#xCE58;&#xBA70;&#x2026;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;&#x2026;"></a>&#xB9C8;&#xCE58;&#xBA70;&#x2026;</h1><p>&#xC624;&#xB298;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; ghidra&#xB780; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;, IDA&#xB791; &#xBE44;&#xAD50;&#xD588;&#xC744; &#xB54C; &#xC5B4;&#xB5A0;&#xD55C; &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xB294;&#xC9C0;, ghidra&#xB294; &#xC5B4;&#xB5A0;&#xD55C; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574; Easy Crackme&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xBA70; &#xAC04;&#xB2E8;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Part 2&#xC5D0;&#xC11C;&#xB294; &#xC624;&#xB298; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC9DA;&#xACE0; &#xB118;&#xC5B4;&#xAC04; Data, Function, Scripts&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC880; &#xB354; &#xB2E4;&#xB904;&#xBCFC; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xAD6D;&#xB0B4;&#xC5D0;&#xB294; &#xC544;&#xC9C1; IDA Pro &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB9CE;&#xC9C0;&#xB9CC; ghidra&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC774; &#xACC4;&#xC2DC;&#xB2E4;&#xAC70;&#xB098;, IDA Pro&#xB97C; &#xC811;&#xD558;&#xAE30; &#xD798;&#xB4E4;&#xC5B4;&#xC11C; ghidra&#xB97C; &#xC368;&#xBCF4;&#xACE0; &#xC2F6;&#xC740;&#xB370; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xB2E4; &#xD558;&#xC2DC;&#xB294; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB410;&#xC73C;&#xBA74; &#xD558;&#xBA70;&#x2026;</p>
<p>&#xC798;&#xBABB;&#xB41C; &#xC124;&#xBA85;&#xC774;&#xB098;, &#xBD80;&#xC871;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xC5B8;&#xC81C;&#xB4E0; &#xB313;&#xAE00;&#xB85C; &#xB0A8;&#xACA8;&#xC8FC;&#xC2DC;&#xBA74; &#xBC18;&#xC601;&#xD558;&#xACE0; &#xC218;&#xC815;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xB2E4;&#xB4E4; &#xC88B;&#xC740; &#xBC24; &#xBCF4;&#xB0B4;&#xC138;&#xC694;~! &#xC800;&#xB294; &#xC774;&#xC81C; &#xC790;&#xB7EC; &#xAC00; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2021/02/07/idioth/ghidra_part1/Untitled%2037.png" srcset="/img/loading.gif" alt></p>
<p><del>&#xBC24;&#xC5D0; &#xAE68;&#xC5B4;&#xC788;&#xACE0; &#xB0AE;&#xC5D0; &#xC790;&#xB294; &#xBC40;&#xD30C;&#xC774;&#xC5B4; &#xAC19;&#xC740; &#xBAA8;&#xC21C;&#xC801;&#xC778; &#xC0B6;&#x2026;</del></p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://dannyquist.github.io/gootkit-reversing-ghidra/">https://dannyquist.github.io/gootkit-reversing-ghidra/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html">https://www.shogunlab.com/blog/2019/04/12/here-be-dragons-ghidra-0.html</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ghidra.re/online-courses/">https://ghidra.re/online-courses/</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/reversing/">reversing</a>
                  
                  <a class="hover-with-bg" href="/tags/ghidra/">ghidra</a>
                  
                  <a class="hover-with-bg" href="/tags/ghidra-tutorials/">ghidra tutorials</a>
                  
                  <a class="hover-with-bg" href="/tags/crackme/">crackme</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/02/08/idioth/2021-02-08/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[]     Matryosh Botnet</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/02/06/fabu1ous/2021-02-06/">
                    <span class="hidden-mobile">[] CVE-2020-9395: Realtek's Wi-Fi module remote root access</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/02/07/idioth/ghidra_part1/';
        this.page.identifier = '/2021/02/07/idioth/ghidra_part1/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Re:versing  ghidra  Part 1 - Overview&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
