

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758;-angr-&amp;#xC815;&amp;#xBCF5;&amp;#xAE30;-2-Symbolic-Execution&#34;&gt;&lt;a href=&#34;#&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758;-angr-&amp;#xC815;&amp;#xBCF5;&amp;#xAE30;-2-Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758; angr &amp;#xC815;&amp;#xBCF5;&amp;#xAE30; - (2) Symbolic Execution&#34;&gt;&lt;/a&gt;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758; angr &amp;#xC815;&amp;#xBCF5;&amp;#xAE30; - (2) Symbolic Execution&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5gxdyj.jpg&#34; alt=&#34;./angr_part2/5gxdyj.jpg&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. j0ker &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC800;&amp;#xBC88;&amp;#xC8FC;&amp;#xBD80;&amp;#xD130; &amp;#xB0A0;&amp;#xC528;&amp;#xAC00; &amp;#xC88B;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB294; &amp;#xC9D1;&amp;#xC5D0;&amp;#xB9CC; &amp;#xCCD0;&amp;#xBC15;&amp;#xD600;&amp;#xC11C; &amp;#xC77C;&amp;#xC774;&amp;#xB791; &amp;#xACF5;&amp;#xBD80;&amp;#xB9CC; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558; &amp;#xC65C;&amp;#xB0D0;&amp;#xACE0;&amp;#xC694;? &amp;#xC4F8;&amp;#xB370;&amp;#xC5C6;&amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xC7A1;&amp;#xC558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg&#34; alt=&#34;./angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCB48;&amp;#xAD74;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xBABB;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#x201C;&amp;#xC74C;&amp;#x2026; &amp;#xADF8;&amp;#xB0E5; Symbolic Execution&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC9C0;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xAC8C; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC624;&amp;#xC0B0;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xB3C4; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xBAA8;&amp;#xB974;&amp;#xB294;&amp;#xAC8C; &amp;#xB9CE;&amp;#xACE0; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C; &amp;#xAC83;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xACE0;&amp;#x2026; &amp;#xC774;&amp;#xAC83;&amp;#xC800;&amp;#xAC83; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xC591;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798;&amp;#xAC78;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xACE0;&amp;#xCEE4;(&amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xB294; &amp;#xC870;&amp;#xCEE4;)&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xC81C; Symbolic Execution&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC790;&amp;#xB3D9;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xBD84;&amp;#xC11D;-&amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xC790;&amp;#xB3D9;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xBD84;&amp;#xC11D;-&amp;#xAE30;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;Symbolic Execution&amp;#xC740; &amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xB294;&amp;#xAC70;&amp;#xC8E0;. &amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&amp;#xB3C4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC8E0;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, CTF&amp;#xC5D0;&amp;#xC11C; Pwnable &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xBA3C;&amp;#xC800; IDA&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Exploit &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC138;&amp;#xC6B4; &amp;#xD6C4;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC608;&amp;#xC0C1;&amp;#xB300;&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; Exploit&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xAC8C; &amp;#xC2E4;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC790;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xB5A0;&amp;#xC624;&amp;#xB974;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xB9CE;&amp;#xC740; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xC544;&amp;#xC2DC;&amp;#xAC70;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xB098;&amp;#xC5F4;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Fuzzing : &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;Taint Anaysis : &amp;#xD2B9;&amp;#xC815; &amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xAC12;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC9C0; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;Dynamic Binary Instrumentation : &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xB2E8;&amp;#xB3C5;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xC774;&amp;#xAE30; &amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF5;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &lt;a href=&#34;https://hackyboiz.github.io/tags/Fabu1ous/&#34;&gt;Fabulous&lt;/a&gt;&amp;#xB2D8;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD305;&amp;#xD55C; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/23/fabu1ous/winafl-1/&#34;&gt;WinAFL&amp;#xB85C; &amp;#xB9C8;&amp;#xAD6C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC788;&amp;#xB294; WinAFL&amp;#xB3C4; Fuzzing+Dynamic Binary Instrumentation&amp;#xC744; &amp;#xACB0;&amp;#xD569;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC758; &amp;#xACF5;&amp;#xD1B5;&amp;#xC810;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; Symbolic Execution&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5gy87e.jpg&#34; alt=&#34;./angr_part2/5gy87e.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;&amp;#x2026; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#x201C;Execution&amp;#x201D;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC788;&amp;#xACE0;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB791; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB294;&amp;#xAC70; &amp;#xC544;&amp;#xB0D0;? &amp;#xB77C;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Symbolic Execution&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC65C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Symbolic-Execution&#34;&gt;&lt;a href=&#34;#Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution&#34;&gt;&lt;/a&gt;Symbolic Execution&lt;/h1&gt;&lt;p&gt;Symbolic Execution&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC744; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xD654;(&amp;#xAE30;&amp;#xD638;&amp;#xD654;)&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC774; &amp;#xBB50;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC81C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xD480;&amp;#xC5B4; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB835;&amp;#xC8E0;&amp;#x2026; &amp;#xC774;&amp;#xAC8C; &amp;#xBB54; &amp;#xC18C;&amp;#xB9B0;&amp;#xC9C0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;foobar&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b)&lt;/span&gt; &lt;/span&gt;{ 
	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, y = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (a != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
		y = &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;+x;
		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (b == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
			x = &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;*(a+b);
	}
	assert(x-y != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;); 
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; foobar&amp;#xB77C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC778;&amp;#xD48B;&amp;#xC740; a&amp;#xC640; b&amp;#xAC00; &amp;#xC788;&amp;#xACE0; assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; a&amp;#xC640; b&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &amp;#xBCF4;&amp;#xBA74; x&amp;#xB294; 1&amp;#xB85C; y&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xD558;&amp;#xB294;&amp;#xB370;, x-y&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; if &amp;#xBB38; &amp;#xC548;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; x&amp;#xC640; y&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. if&amp;#xBB38;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC77C;&amp;#xB2E8; a&amp;#xAC00; 0&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xC5EC;&amp;#xC57C; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAC70; &amp;#xAC19;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; y&amp;#xB294; x+3=4&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; x&amp;#xC640; y&amp;#xAC00; &amp;#xAC19;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; x&amp;#xAC00; 4&amp;#xAC00; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7EC;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; b&amp;#xAC00; 0&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xACE0; 2 * (a+b)&amp;#xAC00; 4&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xB098;&amp;#xC5F4;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;a\ne0&lt;/script&gt;&lt;/li&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;0=2*(a+b)-4&lt;/script&gt;&lt;/li&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;b=0&lt;/script&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xD569;&amp;#xCE58;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;a\ne0 \wedge 0=2*(a+b)-4 \wedge b=0&lt;/script&gt;&lt;p&gt;&amp;#xC774;&amp;#xAC8C; &amp;#xC774;&amp;#xAC78; &amp;#xD480;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xB610; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD480;&amp;#xC5B4;&amp;#x2026; &amp;#xD5C8;&amp;#xD5C8; &amp;#xC548;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC218;&amp;#xD559;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/zzal.jpeg&#34; alt=&#34;./angr_part2/zzal.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC194;&amp;#xBC84;&amp;#xCA29; &amp;#xB3C4;&amp;#xC640;&amp;#xC918;!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;Solver&#34;&gt;&lt;a href=&#34;#Solver&#34; class=&#34;headerlink&#34; title=&#34;Solver&#34;&gt;&lt;/a&gt;Solver&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC655; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC218;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;! &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xC218;&amp;#xD3EC;&amp;#xC790;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC194;&amp;#xBC84;&amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC5ED;&amp;#xC2DC; &amp;#xC138;&amp;#xC0C1;&amp;#xC740; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC800;&amp;#xB9CC; &amp;#xC2DC;&amp;#xB300;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB098;&amp;#xAC00;&amp;#xB294;&amp;#xAC8C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC84;&amp;#xAC70;&amp;#xC6B4; &amp;#xAC74;&amp;#xC9C0;&amp;#x2026;) &amp;#xC194;&amp;#xBC84;&amp;#xC5D0;&amp;#xB294; SAT solver&amp;#xC640; SMT solver&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xBA3C;&amp;#xC800; SAT solver&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;h3 id=&#34;SAT-solver&#34;&gt;&lt;a href=&#34;#SAT-solver&#34; class=&#34;headerlink&#34; title=&#34;SAT solver&#34;&gt;&lt;/a&gt;SAT solver&lt;/h3&gt;&lt;p&gt;SAT&amp;#xB294; SATisfiability problem&amp;#xC758; &amp;#xC55E; &amp;#xC138;&amp;#xAE00;&amp;#xC790;&amp;#xB97C; &amp;#xB530;&amp;#xC628; &amp;#xC57D;&amp;#xC790;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C;&amp;#xAD6D;&amp;#xC5B4;&amp;#xB85C;&amp;#xB294; &amp;#xCDA9;&amp;#xC871; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294;&amp;#xAC8C; SAT solver&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCDA9;&amp;#xC871; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC640; &amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBCC0;&amp;#xC218;&amp;#xAC12;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;SAT&amp;#xC758; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; &lt;strong&gt;&amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xB17C;&amp;#xB9AC; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&lt;/strong&gt;&amp;#xB85C;&amp;#xB9CC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0;&amp;#xAC78; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC5D0;&amp;#xB294; not, and, or&amp;#xC774; &amp;#xC788;&amp;#xC8E0;. &amp;#xACF1;&amp;#xC148;&amp;#xC774;&amp;#xB098; &amp;#xB354;&amp;#xD558;&amp;#xAE30; &amp;#xB4F1; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xC774;&amp;#xB7F0; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC774; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; true, flase &amp;#xAC19;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$x_1 \wedge \neg x_2 \vee x_3$&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; $x_3$&amp;#xAC00; &amp;#xCC38;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; satisfiable&amp;#xD558;&amp;#xB2E4;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBCC0;&amp;#xC218; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xAC70;&amp;#xC9D3;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; unsatisfiable&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; SAT solver&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;SMT-solver&#34;&gt;&lt;a href=&#34;#SMT-solver&#34; class=&#34;headerlink&#34; title=&#34;SMT solver&#34;&gt;&lt;/a&gt;SMT solver&lt;/h3&gt;&lt;p&gt;SMT&amp;#xB294; Satisfiability Modulo Theories&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C; SAT solver&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB358; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; 1&amp;#xCC28; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; solver&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SAT solver&amp;#xC5D0;&amp;#xC11C; &amp;#xD55C;&amp;#xB2E8;&amp;#xACC4; &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC;&amp;#xB41C; &amp;#xB188;&amp;#xC774;&amp;#xB77C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 1&amp;#xCC28; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC;&amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xB17C;&amp;#xB9AC;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC640; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;$(a * 10) &amp;gt; 20 \wedge (b + 20) &amp;lt; 100 \wedge (c &amp;gt; 0)$ &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; &amp;#xC880; &amp;#xC804;&amp;#xC5D0; foobar &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xC2DD;&amp;#xACFC; &amp;#xC880; &amp;#xB354; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC8E0;? &amp;#xB124;. Symbolic Execution&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xBC14;&amp;#xB85C; SMT solver&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; SAT solver&amp;#xAC00; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB610; SAT sovler&amp;#xC5D0;&amp;#xC11C; &amp;#xB69D;&amp;#xB531;&amp;#xB69D;&amp;#xB531;&amp;#xD574;&amp;#xC11C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC12;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC8FC;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; SMT solver&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xAD81;&amp;#xAE08;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xACE0; &amp;#xC774;&amp;#xAC83;&amp;#xC800;&amp;#xAC83; &amp;#xB2E4; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0; &amp;#xB2E4; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xBABB; &amp;#xD560;&amp;#xAC70; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; Reference 6&amp;#xBC88;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xB2E8; &amp;#xADF8; &amp;#xC804;&amp;#xC5D0; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xCD1D; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD569;&amp;#xCCD0; state&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;$stmt$ : statement&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xD3C9;&amp;#xAC00;&amp;#xD560; statement&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. C&amp;#xC5B8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. statement&amp;#xC5D0;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xC810;&amp;#xD504; &amp;#xD639;&amp;#xC740; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C;&amp;#xD560; assignment(&amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD560;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;)&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;$\sigma$ : Symbolic Store&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xACFC; concrete &amp;#xAC12;(&amp;#xACE0;&amp;#xC815;&amp;#xAC12;)&amp;#xC744; &amp;#xB9E4;&amp;#xD551;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, foobar &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; a&amp;#xC640; b&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xC778; $\alpha_a$&amp;#xC640; $\alpha_b$&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, x&amp;#xC640; y&amp;#xB294; 1&amp;#xACFC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xB9E4;&amp;#xD551;&amp;#xAD00;&amp;#xACC4;(association)&amp;#xB97C; $\mapsto$ &amp;#xAE30;&amp;#xD638;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(ex. $b \mapsto \alpha_b$)&lt;/li&gt;
&lt;li&gt;$\pi$ : Path Constraint&amp;#xB85C; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0; $stmt$&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12; $a_i$&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC12;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; true&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB358; foobar &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution&amp;#xC740; &amp;#xC6D0;&amp;#xB798; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; assert &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;, &amp;#xC885;&amp;#xB8CC;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xBAA8;&amp;#xB450; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;1.&lt;/span&gt;  &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;foobar&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b)&lt;/span&gt; &lt;/span&gt;{ 
&lt;span class=&#34;hljs-number&#34;&gt;2.&lt;/span&gt; 	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, y = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
&lt;span class=&#34;hljs-number&#34;&gt;3.&lt;/span&gt; 	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (a != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
&lt;span class=&#34;hljs-number&#34;&gt;4.&lt;/span&gt; 		y = &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;+x;
&lt;span class=&#34;hljs-number&#34;&gt;5.&lt;/span&gt; 		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (b == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
&lt;span class=&#34;hljs-number&#34;&gt;6.&lt;/span&gt; 			x = &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;*(a+b);
&lt;span class=&#34;hljs-number&#34;&gt;7.&lt;/span&gt; 	}
&lt;span class=&#34;hljs-number&#34;&gt;8.&lt;/span&gt; 	assert(x-y != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;); 
&lt;span class=&#34;hljs-number&#34;&gt;9.&lt;/span&gt; }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD568;&amp;#xC218; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; state&amp;#xB97C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; Symbolic Store&amp;#xC5D0;&amp;#xC11C; &amp;#xC778;&amp;#xC790; a&amp;#xC640; b&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xC778; $\alpha_a$&amp;#xC640; $\alpha_b$&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; true&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$\pi = true$&lt;/p&gt;
&lt;p&gt;$stmt$&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$stmt =$ &lt;code&gt;2. int x=1, y=0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xB97C; &amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; state A&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state A. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$,  $\pi = true$, $stmt =$ &lt;code&gt;2. int x=1, y=0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;int x=1, y=0&lt;/code&gt;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xC218; x,y&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAC01;&amp;#xAC01; 1&amp;#xACFC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Symbolic Store $\sigma$&amp;#xC5D0; x&amp;#xC640; y&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xACE0; $stmt$&amp;#xC5D0; &amp;#xBCC4; &amp;#xB2E4;&amp;#xB978; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xC740; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state B. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = true$, $stmt =$ &lt;code&gt;3. if(a != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xBCC0;&amp;#xC218; $a$&amp;#xAC00; 0&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; $a$&amp;#xAC00; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; if&amp;#xBB38;&amp;#xC744; &amp;#xD328;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; fork&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; state&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state C. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ &lt;code&gt;4. y = 3+x&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state D. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a = 0$, $stmt =$ &lt;code&gt;8. assert(x-y !=0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xAC01;&amp;#xAC01; &amp;#xBCC4;&amp;#xAC1C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; state D&amp;#xB97C; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC778; assert &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;x-y != 0&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD604;&amp;#xC7AC; $x$&amp;#xB294; 1&amp;#xC774;&amp;#xACE0; $y$&amp;#xB294; 0&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; $x-y = 1-0 = 1 \neq 0$&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C; assert &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; $\alpha_a = 0$&amp;#xC774;&amp;#xBA74;,  &amp;#xC989; &amp;#xC778;&amp;#xC790; $a$&amp;#xAC00; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xAC83;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; state C&amp;#xB97C; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xAC00; &lt;code&gt;y = 3+x&lt;/code&gt;&amp;#xC774;&amp;#xACE0; $x$&amp;#xAC00; 1&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $y$&amp;#xB97C; 4&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state E.  $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ &lt;code&gt;3. if(b == 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xB124;&amp;#xC694;. if&amp;#xBB38; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC778; &lt;code&gt;b == 0&lt;/code&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xC5EC; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; state&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state F. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b \neq 0)$, $stmt =$ &lt;code&gt;8. assert(x-y != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state G. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ &lt;code&gt;6. x = 2*(a+b)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; state F&amp;#xB97C; &amp;#xBCF4;&amp;#xC8E0;. Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xAC00; 1&amp;#xC774;&amp;#xACE0; $y$&amp;#xAC00; 4&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; $x-y=-3$&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. assert &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xC774; $x-y \neq 0$&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCC38;&amp;#xC774;&amp;#xB124;&amp;#xC694;! &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xC870;&amp;#xAC74; $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xB124;&amp;#xC694;!(&amp;#xD558;.. &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; state G &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xAC00; &lt;code&gt;x = 2*(a+b)&lt;/code&gt; &amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xB97C; $x \mapsto 2*(\alpha_a + \alpha_b)$&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state H. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 2*(\alpha_a+\alpha_b), y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ &lt;code&gt;8. assert(x-y != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; state &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC885;&amp;#xB8CC;&amp;#xB97C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;code&gt;x-y != 0&lt;/code&gt;&amp;#xAC00; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xC640; $y$&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. $x$&amp;#xB294; $2*(\alpha_a + \alpha_b)$&amp;#xC774;&amp;#xACE0; $y$&amp;#xB294; 4&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xBA74; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;$\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0) \wedge 2*(\alpha_a + \alpha_b) + 4 \neq 0$&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD480;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; a&amp;#xC640; b &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!(&amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; SMT solver&amp;#xAC00; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD574;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;)&lt;/p&gt;
&lt;h2 id=&#34;Symbolic-Execution&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#Symbolic-Execution&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;Symbolic Execution&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&lt;/h2&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#x201C;&amp;#xC6B0;&amp;#xC640; Symbolic Execution&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xC815;&amp;#xB9D0; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC774;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB098; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC778; &amp;#xC81C;&amp;#xC57D;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160; (&amp;#xC774;&amp;#xAC8C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC800;&amp;#xB294; &amp;#xBC8C;&amp;#xC368; &amp;#xAE38;&amp;#xBC14;&amp;#xB2E5;&amp;#xC5D0; &amp;#xC549;&amp;#xC544; &amp;#xAD6C;&amp;#xAC78;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC9C0;&amp;#xB3C4;&amp;#x2026;)&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB4E0; foobar &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC9E7;&amp;#xC544;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD604;&amp;#xC2E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD07D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC624;&amp;#xD53C;&amp;#xC2A4;&amp;#xB098; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xC791;&amp;#xAC8C;&amp;#xB294; &amp;#xBA87; &amp;#xBC31; MB &amp;#xD639;&amp;#xC740; &amp;#xBA87; &amp;#xC2ED; GB&amp;#xAE4C;&amp;#xC9C0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; state&amp;#xB97C; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC313;&amp;#xC544;&amp;#xB098;&amp;#xAC04;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;. &amp;#xCD5C;&amp;#xC18C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xBA87; &amp;#xBC30;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xBC31;&amp;#xBC30;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB1CC;&amp;#xD53C;&amp;#xC15C;) &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; Symbolic Execution&amp;#xC774; &amp;#xC81C;&amp;#xC548;&amp;#xB41C; 70&amp;#xB144;&amp;#xB300;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xC9C0;&amp;#xC801;&amp;#xB410;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; &amp;#xC9C0;&amp;#xAE08;&amp;#xB9CC;&amp;#xD07C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC744;&amp;#xD150;&amp;#xB370;&amp;#xB3C4; &amp;#xB9D0;&amp;#xC774;&amp;#xC8E0;. &amp;#xBB3C;&amp;#xB860; &amp;#xC9C0;&amp;#xAE08; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAC12;&amp;#xC774; &amp;#xC2F8;&amp;#xC9C0;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xD070; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC26C;&amp;#xC6CC;&amp;#xC84C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC774;&amp;#xB294; Symbolic Execution&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xBAA9; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB098; &amp;#xAD6C;&amp;#xAE00; &amp;#xAC19;&amp;#xC740; &amp;#xB300;&amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA87; &amp;#xB9CC; &amp;#xCF54;&amp;#xC5B4;&amp;#xC5D0; &amp;#xBA87; &amp;#xBC31; &amp;#xD14C;&amp;#xB77C;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xAC1C;&amp;#xC778;&amp;#xC774; &amp;#xADF8;&amp;#xB0E5; Symbolic Execution&amp;#xC5D0;&amp;#xB9CC; &amp;#xC758;&amp;#xC874;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4;&amp;#x2026; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB3C4; &amp;#xD6A8;&amp;#xC728;&amp;#xC774; &amp;#xC548; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;&amp;#x2026; &amp;#xC544;&amp;#xB9C8; &amp;#xADF8;&amp;#xB0E5; Dumb Fuzzing&amp;#xC774; &amp;#xB354; &amp;#xBE60;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xD30C;&amp;#xC6CC;&amp;#xAC00; &amp;#xBD80;&amp;#xC871;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD574;&amp;#xACB0;&amp;#xC774; &amp;#xB410;&amp;#xB2E4;&amp;#xACE0; &amp;#xCCD0;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBD84;&amp;#xAE30;&amp;#xBB38;, &amp;#xB8E8;&amp;#xD504;&amp;#xBB38;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xC77C; exploit&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xB3C4; exploit&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xBABB;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xB7F0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; fork&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; state&amp;#xB97C; &amp;#xB2E4; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC77C;&amp;#xB2E8; CPU&amp;#xC758; &amp;#xCF54;&amp;#xC5B4; &amp;#xAC1C;&amp;#xC218;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC544;&amp;#xC57C;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xBE68;&amp;#xB77C;&amp;#xC57C;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; &amp;#xB9AC;&amp;#xC0AC;&amp;#xC218;&amp;#xB290;&amp;#xB2D8;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;!!! &amp;#xD0B9;&amp;#xAC13;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB9AC;&amp;#xD37C;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xB290;&amp;#xB0D0;!!! &amp;#xC608;&amp;#x2026; &amp;#xB204;&amp;#xAC00; &amp;#xD568; &amp;#xAD6C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;&amp;#xB4E0; &amp;#xC628;&amp;#xBAB8;&amp;#xC744; &amp;#xBC14;&amp;#xCCD0; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#xD5C8;&amp;#xD5E3;&amp;#x314E;(&amp;#xC0DD;&amp;#xAC01;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xC88B;&amp;#xB124;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/22HD9O4TZ2_4.jpeg&#34; alt=&#34;./angr_part2/22HD9O4TZ2_4.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCBE4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC601;&amp;#xC811;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xB9AC;&amp;#xC0AC;&amp;#xC218;&amp;#xB290;&amp;#xB2D8;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xACFC;&amp;#xC758; interaction&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xCEE4;&amp;#xB110;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC548;&amp;#xB418;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;? &amp;#xD558;&amp;#xD558; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xAC70;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;&amp;#x2026; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC548;&amp;#xB418;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC678;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xBE60;&amp;#xC838;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xD55C;&amp;#xACC4;&amp;#xC810;-&amp;#xBCF4;&amp;#xC644;&#34;&gt;&lt;a href=&#34;#&amp;#xD55C;&amp;#xACC4;&amp;#xC810;-&amp;#xBCF4;&amp;#xC644;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD55C;&amp;#xACC4;&amp;#xC810; &amp;#xBCF4;&amp;#xC644;&#34;&gt;&lt;/a&gt;&amp;#xD55C;&amp;#xACC4;&amp;#xC810; &amp;#xBCF4;&amp;#xC644;&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; Symbolic Execution&amp;#xC740; &amp;#xB9AC;&amp;#xC5BC;&amp;#xC6D4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC4F8;&amp;#xBAA8; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83; &amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0; &amp;#x314B;&amp;#x314B; &amp;#xB9E8; &amp;#xC55E;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; Symbolic Execution &amp;#xC5ED;&amp;#xC2DC; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Concolic-Execution&#34;&gt;&lt;a href=&#34;#Concolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;Concolic Execution&#34;&gt;&lt;/a&gt;Concolic Execution&lt;/h3&gt;&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; Concolic Execution&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Concolic&amp;#xC740; Concrete + Symbolic&amp;#xC744; &amp;#xD569;&amp;#xCE5C; &amp;#xD569;&amp;#xC131;&amp;#xC5B4;&amp;#xB85C; Concrete Execution&amp;#xACFC; Symbolic Execuition&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. Concrete Execution&amp;#xC740; Symbolic Execution&amp;#xACFC; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAC12;&amp;#xC744; &amp;#xC778;&amp;#xD48B;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774; &amp;#xB450; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD569;&amp;#xCCD0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAE30;&amp;#xC874; Symbolic Store $\sigma$&amp;#xC5D0; Concrete &amp;#xAC12;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Concrete &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xB294; &amp;#xAC12;(Statisfiable&amp;#xD55C; &amp;#xAC12;)&amp;#xC744; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; SMT solver&amp;#xC758; &amp;#xACC4;&amp;#xC0B0; &amp;#xC5C6;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC880; &amp;#xB354; &amp;#xBE68;&amp;#xB9AC; &amp;#xC9C4;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC120;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; fuzzing&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD65C;&amp;#xC6A9; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB610; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Symbolic-Execution-&amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740;-&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0;-&amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34;&gt;&lt;a href=&#34;#Symbolic-Execution-&amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740;-&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0;-&amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34;&gt;&lt;/a&gt;Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/h1&gt;&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC758;&amp;#xBB38;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB85C;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xACE0;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; ID&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, CPU&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xACFC;&amp;#xC815;&amp;#xC5C6;&amp;#xC774; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; IL(Intermediate language)&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. CPU&amp;#xAC00; &amp;#xC2E4;&amp;#xC7AC;&amp;#xB85C; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;h1 id=&#34;Part-2-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#Part-2-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;Part 2 &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;Part 2 &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; Symbolic Execution&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#xB77C;&amp;#xACE0; &amp;#xCC98;&amp;#xC74C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBB54;&amp;#xC9C0;&amp;#xB294; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xBB50; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB835;&amp;#xACA0;&amp;#xC5B4;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558; &amp;#xC5ED;&amp;#xC2DC; &amp;#xBB34;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xC6A9;&amp;#xAC10;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xBB34;&amp;#xC791;&amp;#xC815; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xB4A4;&amp;#xC9C0;&amp;#xAC8C; &amp;#xCCD0;&amp;#xB9DE;&amp;#xC558;&amp;#xB124;&amp;#xC694;. &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080;&amp;#xAC74;&amp;#xB370; &amp;#xC815;&amp;#xB9D0; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774;&amp;#xAC70; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC78; &amp;#xC800;&amp;#xAC70; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC78; &amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC26C;&amp;#xC6C0;&amp;#xC774; &amp;#xC880; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;&amp;#x2026; &amp;#xAE00;&amp;#xC740; &amp;#xC62C;&amp;#xB824;&amp;#xC57C;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC7A0;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80; &amp;#xC880; &amp;#xB354; &amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD3B8;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB610; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xADFC;&amp;#xB370; &amp;#xB098; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00; &amp;#xC62C;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5h1k8f.jpg&#34; alt=&#34;./angr_part2/5h1k8f.jpg&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&lt;a href=&#34;https://arxiv.org/pdf/1610.00502.pdf&#34;&gt;A Survey of Symbolic Execution Techniques&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.hahwul.com/2017/06/19/hacking-symbolic-executionsymbolic/&#34;&gt;[HACKING] Symbolic Execution(symbolic evaluation)&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/pwnbatman-joker/awesome-symbolic-execution&#34;&gt;Awesome Symbolic Execution&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;http://www.lazenca.net/pages/viewpage.action?pageId=6324534&#34;&gt;03.Symbolic execution(feat.Concrete execution)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;http://rosaec.snu.ac.kr/meet/file/20110626o2.pdf&#34;&gt;SAT/SMT tutorial SMT &amp;#xD574;&amp;#xACB0;&amp;#xAE30; &amp;#xB0B4;&amp;#xBD80;&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]  angr  - (2) Symbolic Execution - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758;-angr-&amp;#xC815;&amp;#xBCF5;&amp;#xAE30;-2-Symbolic-Execution&#34;&gt;&lt;a href=&#34;#&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758;-angr-&amp;#xC815;&amp;#xBCF5;&amp;#xAE30;-2-Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758; angr &amp;#xC815;&amp;#xBCF5;&amp;#xAE30; - (2) Symbolic Execution&#34;&gt;&lt;/a&gt;&amp;#xD575;&amp;#xB9B0;&amp;#xC774;&amp;#xC758; angr &amp;#xC815;&amp;#xBCF5;&amp;#xAE30; - (2) Symbolic Execution&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5gxdyj.jpg&#34; alt=&#34;./angr_part2/5gxdyj.jpg&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;a href=&#34;#&amp;#xC11C;&amp;#xB860;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC11C;&amp;#xB860;&#34;&gt;&lt;/a&gt;&amp;#xC11C;&amp;#xB860;&lt;/h1&gt;&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;. j0ker &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC800;&amp;#xBC88;&amp;#xC8FC;&amp;#xBD80;&amp;#xD130; &amp;#xB0A0;&amp;#xC528;&amp;#xAC00; &amp;#xC88B;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC800;&amp;#xB294; &amp;#xC9D1;&amp;#xC5D0;&amp;#xB9CC; &amp;#xCCD0;&amp;#xBC15;&amp;#xD600;&amp;#xC11C; &amp;#xC77C;&amp;#xC774;&amp;#xB791; &amp;#xACF5;&amp;#xBD80;&amp;#xB9CC; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xD558;&amp;#xD558; &amp;#xC65C;&amp;#xB0D0;&amp;#xACE0;&amp;#xC694;? &amp;#xC4F8;&amp;#xB370;&amp;#xC5C6;&amp;#xC774; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xB835;&amp;#xAC8C; &amp;#xC7A1;&amp;#xC558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC774;&amp;#xC8E0;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg&#34; alt=&#34;./angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xCB48;&amp;#xAD74;&amp;#x2026;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; &amp;#xC8FC;&amp;#xC81C;&amp;#xB294; &amp;#xC798;&amp;#xBABB;&amp;#xC774; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC81C;&amp;#xAC00; &amp;#xBABB;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#x201C;&amp;#xC74C;&amp;#x2026; &amp;#xADF8;&amp;#xB0E5; Symbolic Execution&amp;#xB9CC; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xC9C0;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD55C;&amp;#xAC8C; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xC624;&amp;#xC0B0;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xB2E4;&amp;#xB978; &amp;#xAC83;&amp;#xB3C4; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xBAA8;&amp;#xB974;&amp;#xB294;&amp;#xAC8C; &amp;#xB9CE;&amp;#xACE0; &amp;#xAD81;&amp;#xAE08;&amp;#xD55C; &amp;#xAC83;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xACE0;&amp;#x2026; &amp;#xC774;&amp;#xAC83;&amp;#xC800;&amp;#xAC83; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xBCF4;&amp;#xB2C8; &amp;#xC0DD;&amp;#xAC01;&amp;#xBCF4;&amp;#xB2E4; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xC591;&amp;#xC774; &amp;#xB9CE;&amp;#xC544;&amp;#xC11C; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774; &amp;#xC624;&amp;#xB798;&amp;#xAC78;&amp;#xB838;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558; &amp;#xB2C9;&amp;#xB124;&amp;#xC784;&amp;#xC744; &amp;#xACE0;&amp;#xCEE4;(&amp;#xACE0;&amp;#xD1B5;&amp;#xBC1B;&amp;#xB294; &amp;#xC870;&amp;#xCEE4;)&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC774;&amp;#xC81C; Symbolic Execution&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC790;&amp;#xB3D9;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xBD84;&amp;#xC11D;-&amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#&amp;#xC790;&amp;#xB3D9;-&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;-&amp;#xBD84;&amp;#xC11D;-&amp;#xAE30;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&#34;&gt;&lt;/a&gt;&amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&lt;/h1&gt;&lt;p&gt;Symbolic Execution&amp;#xC740; &amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95; &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC744; &amp;#xC9C0;&amp;#xC815;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC8FC;&amp;#xB294;&amp;#xAC70;&amp;#xC8E0;. &amp;#xC790;&amp;#xB3D9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xB098;&amp;#xB269;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C;&amp;#xB3C4; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xACFC; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xC8E0;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, CTF&amp;#xC5D0;&amp;#xC11C; Pwnable &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xBA74; &amp;#xBA3C;&amp;#xC800; IDA&amp;#xC5D0; &amp;#xB123;&amp;#xC5B4;&amp;#xC11C; &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xB514;&amp;#xCEF4;&amp;#xD30C;&amp;#xC77C; &amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;, &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xBD84;&amp;#xC11D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xAC8C; &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xBC18;&amp;#xB300;&amp;#xB85C;, &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xACA0;&amp;#xC8E0;? IDA&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC644;&amp;#xB8CC;&amp;#xD558;&amp;#xBA74; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBC14;&amp;#xD0D5;&amp;#xC73C;&amp;#xB85C; Exploit &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xC138;&amp;#xC6B4; &amp;#xD6C4;, &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC608;&amp;#xC0C1;&amp;#xB300;&amp;#xB85C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC640; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C; Exploit&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xAC8C; &amp;#xC2E4;&amp;#xC81C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xB7EC;&amp;#xBD84;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC790;&amp;#xB3D9; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD0A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xB5A0;&amp;#xC624;&amp;#xB974;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xB9CE;&amp;#xC740; &amp;#xC0AC;&amp;#xB78C;&amp;#xB4E4;&amp;#xC774; &amp;#xC544;&amp;#xC2DC;&amp;#xAC70;&amp;#xB098; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC744; &amp;#xB098;&amp;#xC5F4;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Fuzzing : &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB79C;&amp;#xB364;&amp;#xD55C; &amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;Taint Anaysis : &amp;#xD2B9;&amp;#xC815; &amp;#xAC12;&amp;#xC744; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xACE0; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xAC12;&amp;#xC774; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xAC70;&amp;#xCE58;&amp;#xBA74;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xB098; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB4F1;&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBCC0;&amp;#xD654;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294; &amp;#xC9C0; &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;li&gt;Dynamic Binary Instrumentation : &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0BD;&amp;#xC785;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xB2E8;&amp;#xB3C5;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xC774;&amp;#xAE30; &amp;#xBCF4;&amp;#xB2E4;&amp;#xB294; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBCF5;&amp;#xD569;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC4F0;&amp;#xC774;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &lt;a href=&#34;https://hackyboiz.github.io/tags/Fabu1ous/&#34;&gt;Fabulous&lt;/a&gt;&amp;#xB2D8;&amp;#xC774; &amp;#xD3EC;&amp;#xC2A4;&amp;#xD305;&amp;#xD55C; &lt;a href=&#34;https://hackyboiz.github.io/2021/05/23/fabu1ous/winafl-1/&#34;&gt;WinAFL&amp;#xB85C; &amp;#xB9C8;&amp;#xAD6C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xB8E8;&amp;#xACE0; &amp;#xC788;&amp;#xB294; WinAFL&amp;#xB3C4; Fuzzing+Dynamic Binary Instrumentation&amp;#xC744; &amp;#xACB0;&amp;#xD569;&amp;#xD574; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC758; &amp;#xACF5;&amp;#xD1B5;&amp;#xC810;&amp;#xC740; &amp;#xBB34;&amp;#xC5C7;&amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xBAA8;&amp;#xB450; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; Symbolic Execution&amp;#xC740; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5gy87e.jpg&#34; alt=&#34;./angr_part2/5gy87e.jpg&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8;&amp;#x2026; &amp;#xC774;&amp;#xB984;&amp;#xC5D0;&amp;#xC11C;&amp;#xBD80;&amp;#xD130; &amp;#x201C;Execution&amp;#x201D;&amp;#xC774; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC788;&amp;#xACE0;, &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB791; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBC14;&amp;#xB00C;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xD558;&amp;#xB294;&amp;#xAC70; &amp;#xC544;&amp;#xB0D0;? &amp;#xB77C;&amp;#xACE0; &amp;#xC800;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; Symbolic Execution&amp;#xC758; &amp;#xAC1C;&amp;#xB150;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC65C; &amp;#xC815;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;Symbolic-Execution&#34;&gt;&lt;a href=&#34;#Symbolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution&#34;&gt;&lt;/a&gt;Symbolic Execution&lt;/h1&gt;&lt;p&gt;Symbolic Execution&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC744; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xB85C; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xD654;(&amp;#xAE30;&amp;#xD638;&amp;#xD654;)&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xC5EC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC774; &amp;#xBB50;&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xACC4;&amp;#xC0B0;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4ED;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC84;&amp;#xADF8;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;&amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C; &amp;#xC774;&amp;#xC81C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xB9CC;&amp;#xB4E0; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xD480;&amp;#xC5B4; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC778;&amp;#xD48B;&amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB835;&amp;#xC8E0;&amp;#x2026; &amp;#xC774;&amp;#xAC8C; &amp;#xBB54; &amp;#xC18C;&amp;#xB9B0;&amp;#xC9C0;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB97C; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;foobar&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b)&lt;/span&gt; &lt;/span&gt;{ 
	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, y = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (a != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
		y = &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;+x;
		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (b == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
			x = &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;*(a+b);
	}
	assert(x-y != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;); 
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4; foobar&amp;#xB77C;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xAC00;&amp;#xC815;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xC778;&amp;#xD48B;&amp;#xC740; a&amp;#xC640; b&amp;#xAC00; &amp;#xC788;&amp;#xACE0; assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; a&amp;#xC640; b&amp;#xB97C; &amp;#xCC3E;&amp;#xC73C;&amp;#xB824;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;? &amp;#xBCF4;&amp;#xBA74; x&amp;#xB294; 1&amp;#xB85C; y&amp;#xB294; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xD558;&amp;#xB294;&amp;#xB370;, x-y&amp;#xAC00; 0&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; if &amp;#xBB38; &amp;#xC548;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; x&amp;#xC640; y&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC870;&amp;#xC808;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. if&amp;#xBB38;&amp;#xC744; &amp;#xBCF4;&amp;#xBA74; &amp;#xC77C;&amp;#xB2E8; a&amp;#xAC00; 0&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xC5EC;&amp;#xC57C; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC08; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAC70; &amp;#xAC19;&amp;#xAD6C;&amp;#xC694;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; y&amp;#xB294; x+3=4&amp;#xAC00; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; x&amp;#xC640; y&amp;#xAC00; &amp;#xAC19;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xC11C; x&amp;#xAC00; 4&amp;#xAC00; &amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7EC;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; b&amp;#xAC00; 0&amp;#xC774;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xACE0; 2 * (a+b)&amp;#xAC00; 4&amp;#xAC00; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xD1A0;&amp;#xB300;&amp;#xB85C; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xB098;&amp;#xC5F4;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;a\ne0&lt;/script&gt;&lt;/li&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;0=2*(a+b)-4&lt;/script&gt;&lt;/li&gt;
&lt;li&gt;&lt;script type=&#34;math/tex; mode=display&#34;&gt;b=0&lt;/script&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xB9CC;&amp;#xC871;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB2C8;&amp;#xAE4C; &amp;#xD569;&amp;#xCE58;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xC218;&amp;#xC2DD;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;script type=&#34;math/tex; mode=display&#34;&gt;a\ne0 \wedge 0=2*(a+b)-4 \wedge b=0&lt;/script&gt;&lt;p&gt;&amp;#xC774;&amp;#xAC8C; &amp;#xC774;&amp;#xAC78; &amp;#xD480;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xB610; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD480;&amp;#xC5B4;&amp;#x2026; &amp;#xD5C8;&amp;#xD5C8; &amp;#xC548;&amp;#xADF8;&amp;#xB798;&amp;#xB3C4; &amp;#xC218;&amp;#xD559;&amp;#xB3C4; &amp;#xBABB;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#x2026; &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/zzal.jpeg&#34; alt=&#34;./angr_part2/zzal.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC194;&amp;#xBC84;&amp;#xCA29; &amp;#xB3C4;&amp;#xC640;&amp;#xC918;!!!&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;Solver&#34;&gt;&lt;a href=&#34;#Solver&#34; class=&#34;headerlink&#34; title=&#34;Solver&#34;&gt;&lt;/a&gt;Solver&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC655; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30;&amp;#xB85C; &amp;#xD588;&amp;#xC73C;&amp;#xB2C8; &amp;#xC774;&amp;#xB7F0; &amp;#xC218;&amp;#xC2DD;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC8E0;! &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xC218;&amp;#xD3EC;&amp;#xC790;&amp;#xB3C4; &amp;#xC774;&amp;#xB7F4; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC194;&amp;#xBC84;&amp;#xB77C;&amp;#xB294;&amp;#xAC8C; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xC5ED;&amp;#xC2DC; &amp;#xC138;&amp;#xC0C1;&amp;#xC740; &amp;#xBE60;&amp;#xB974;&amp;#xAC8C; &amp;#xBC1C;&amp;#xC804;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026; &amp;#xC800;&amp;#xB9CC; &amp;#xC2DC;&amp;#xB300;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0; &amp;#xB098;&amp;#xAC00;&amp;#xB294;&amp;#xAC8C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBC84;&amp;#xAC70;&amp;#xC6B4; &amp;#xAC74;&amp;#xC9C0;&amp;#x2026;) &amp;#xC194;&amp;#xBC84;&amp;#xC5D0;&amp;#xB294; SAT solver&amp;#xC640; SMT solver&amp;#xAC00; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xBA3C;&amp;#xC800; SAT solver&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;.&lt;/p&gt;
&lt;h3 id=&#34;SAT-solver&#34;&gt;&lt;a href=&#34;#SAT-solver&#34; class=&#34;headerlink&#34; title=&#34;SAT solver&#34;&gt;&lt;/a&gt;SAT solver&lt;/h3&gt;&lt;p&gt;SAT&amp;#xB294; SATisfiability problem&amp;#xC758; &amp;#xC55E; &amp;#xC138;&amp;#xAE00;&amp;#xC790;&amp;#xB97C; &amp;#xB530;&amp;#xC628; &amp;#xC57D;&amp;#xC790;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD55C;&amp;#xAD6D;&amp;#xC5B4;&amp;#xB85C;&amp;#xB294; &amp;#xCDA9;&amp;#xC871; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294;&amp;#xAC8C; SAT solver&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCDA9;&amp;#xC871; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC640; &amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBCC0;&amp;#xC218;&amp;#xAC12;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xCC3E;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;SAT&amp;#xC758; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; &lt;strong&gt;&amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&lt;/strong&gt;&amp;#xC640; &lt;strong&gt;&amp;#xB17C;&amp;#xB9AC; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&lt;/strong&gt;&amp;#xB85C;&amp;#xB9CC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC838;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0;&amp;#xAC78; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB798;&amp;#xBC0D; &amp;#xC5B8;&amp;#xC5B4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC5D0;&amp;#xB294; not, and, or&amp;#xC774; &amp;#xC788;&amp;#xC8E0;. &amp;#xACF1;&amp;#xC148;&amp;#xC774;&amp;#xB098; &amp;#xB354;&amp;#xD558;&amp;#xAE30; &amp;#xB4F1; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xC5C6;&amp;#xC774; &amp;#xC774;&amp;#xB7F0; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC774; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; true, flase &amp;#xAC19;&amp;#xC740; &amp;#xB17C;&amp;#xB9AC; &amp;#xBCC0;&amp;#xC218;&amp;#xB4E4;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$x_1 \wedge \neg x_2 \vee x_3$&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; $x_3$&amp;#xAC00; &amp;#xCC38;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774;&amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; satisfiable&amp;#xD558;&amp;#xB2E4;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBC18;&amp;#xBA74;&amp;#xC5D0; &amp;#xC2DD;&amp;#xC774; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xB294; &amp;#xBCC0;&amp;#xC218; &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC5C6;&amp;#xC5B4; &amp;#xAC70;&amp;#xC9D3;&amp;#xC774; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; unsatisfiable&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C;&amp;#xB9CC; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xC8FC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; SAT solver&amp;#xB77C;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;SMT-solver&#34;&gt;&lt;a href=&#34;#SMT-solver&#34; class=&#34;headerlink&#34; title=&#34;SMT solver&#34;&gt;&lt;/a&gt;SMT solver&lt;/h3&gt;&lt;p&gt;SMT&amp;#xB294; Satisfiability Modulo Theories&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C; SAT solver&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xB358; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; 1&amp;#xCC28; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD574;&amp;#xACB0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; solver&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. SAT solver&amp;#xC5D0;&amp;#xC11C; &amp;#xD55C;&amp;#xB2E8;&amp;#xACC4; &amp;#xC5C5;&amp;#xADF8;&amp;#xB808;&amp;#xC774;&amp;#xB4DC;&amp;#xB41C; &amp;#xB188;&amp;#xC774;&amp;#xB77C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. 1&amp;#xCC28; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB17C;&amp;#xB9AC;&amp;#xBCC0;&amp;#xC218;&amp;#xC640; &amp;#xB17C;&amp;#xB9AC;&amp;#xC5F0;&amp;#xC0B0;&amp;#xC790; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC790;&amp;#xC640; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;$(a * 10) &amp;gt; 20 \wedge (b + 20) &amp;lt; 100 \wedge (c &amp;gt; 0)$ &lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC740; &amp;#xC880; &amp;#xC804;&amp;#xC5D0; foobar &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xB098;&amp;#xC628; &amp;#xC2DD;&amp;#xACFC; &amp;#xC880; &amp;#xB354; &amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xC8E0;? &amp;#xB124;. Symbolic Execution&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC9C4; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xBC14;&amp;#xB85C; SMT solver&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; SAT solver&amp;#xAC00; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xBA85;&amp;#xC81C;&amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7FC; &amp;#xB610; SAT sovler&amp;#xC5D0;&amp;#xC11C; &amp;#xB69D;&amp;#xB531;&amp;#xB69D;&amp;#xB531;&amp;#xD574;&amp;#xC11C; &amp;#xACB0;&amp;#xACFC;&amp;#xAC12;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574;&amp;#xC8FC;&amp;#xC8E0;!&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; SMT solver&amp;#xAC00; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xB3C4; &amp;#xAD81;&amp;#xAE08;&amp;#xD574;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xACE0; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD588;&amp;#xB294;&amp;#xB370; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xACE0; &amp;#xC774;&amp;#xAC83;&amp;#xC800;&amp;#xAC83; &amp;#xB2E4; &amp;#xD558;&amp;#xB2E4;&amp;#xAC00;&amp;#xB294; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0B4;&amp;#xC5D0; &amp;#xB2E4; &amp;#xACF5;&amp;#xBD80;&amp;#xB97C; &amp;#xBABB; &amp;#xD560;&amp;#xAC70; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAD00;&amp;#xC2EC; &amp;#xC788;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; Reference 6&amp;#xBC88;&amp;#xC744; &amp;#xCC38;&amp;#xACE0;&amp;#xD574; &amp;#xBCF4;&amp;#xC138;&amp;#xC694;!&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC81C;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC81C;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC81C;&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC77C;&amp;#xB2E8; &amp;#xADF8; &amp;#xC804;&amp;#xC5D0; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCFC;&amp;#xAC8C;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xB54C; &amp;#xCD1D; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC694;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xB97C; &amp;#xD569;&amp;#xCCD0; state&amp;#xB77C;&amp;#xACE0; &amp;#xBD80;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;$stmt$ : statement&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xD3C9;&amp;#xAC00;&amp;#xD560; statement&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. C&amp;#xC5B8;&amp;#xC5B4;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD558;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. statement&amp;#xC5D0;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xC810;&amp;#xD504; &amp;#xD639;&amp;#xC740; &amp;#xC218;&amp;#xD589;&amp;#xD574;&amp;#xC57C;&amp;#xD560; assignment(&amp;#xC774;&amp;#xAC70;&amp;#xB294; &amp;#xB3D9;&amp;#xC791;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xBA74; &amp;#xD3B8;&amp;#xD560;&amp;#xAC70; &amp;#xAC19;&amp;#xB124;&amp;#xC694;)&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;$\sigma$ : Symbolic Store&amp;#xB85C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC758; &amp;#xBCC0;&amp;#xC218;&amp;#xB97C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xACFC; concrete &amp;#xAC12;(&amp;#xACE0;&amp;#xC815;&amp;#xAC12;)&amp;#xC744; &amp;#xB9E4;&amp;#xD551;&amp;#xD55C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xB97C; &amp;#xB4E4;&amp;#xC5B4;, foobar &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; a&amp;#xC640; b&amp;#xB294; &amp;#xAC01;&amp;#xAC01; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xC778; $\alpha_a$&amp;#xC640; $\alpha_b$&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xC774; &amp;#xB418;&amp;#xACE0;, x&amp;#xC640; y&amp;#xB294; 1&amp;#xACFC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774;&amp;#xB7F0; &amp;#xB9E4;&amp;#xD551;&amp;#xAD00;&amp;#xACC4;(association)&amp;#xB97C; $\mapsto$ &amp;#xAE30;&amp;#xD638;&amp;#xB85C; &amp;#xD45C;&amp;#xD604;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(ex. $b \mapsto \alpha_b$)&lt;/li&gt;
&lt;li&gt;$\pi$ : Path Constraint&amp;#xB85C; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBD80; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC744; &amp;#xAC70;&amp;#xCCD0; $stmt$&amp;#xAE4C;&amp;#xC9C0; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12; $a_i$&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC12;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; true&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC124;&amp;#xBA85;&amp;#xD588;&amp;#xB358; foobar &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAC00;&amp;#xC838;&amp;#xC640;&amp;#xC11C; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC885;&amp;#xB8CC;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xB294;&amp;#xB370; &amp;#xC9D1;&amp;#xC911;&amp;#xD588;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution&amp;#xC740; &amp;#xC6D0;&amp;#xB798; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; assert &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xAC00; &amp;#xB418;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;, &amp;#xC885;&amp;#xB8CC;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294; &amp;#xACBD;&amp;#xB85C; &amp;#xBAA8;&amp;#xB450; &amp;#xD0D0;&amp;#xC0C9;&amp;#xD574; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;1.&lt;/span&gt;  &lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;foobar&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; a, &lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; b)&lt;/span&gt; &lt;/span&gt;{ 
&lt;span class=&#34;hljs-number&#34;&gt;2.&lt;/span&gt; 	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; x = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, y = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
&lt;span class=&#34;hljs-number&#34;&gt;3.&lt;/span&gt; 	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (a != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
&lt;span class=&#34;hljs-number&#34;&gt;4.&lt;/span&gt; 		y = &lt;span class=&#34;hljs-number&#34;&gt;3&lt;/span&gt;+x;
&lt;span class=&#34;hljs-number&#34;&gt;5.&lt;/span&gt; 		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (b == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;)
&lt;span class=&#34;hljs-number&#34;&gt;6.&lt;/span&gt; 			x = &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;*(a+b);
&lt;span class=&#34;hljs-number&#34;&gt;7.&lt;/span&gt; 	}
&lt;span class=&#34;hljs-number&#34;&gt;8.&lt;/span&gt; 	assert(x-y != &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;); 
&lt;span class=&#34;hljs-number&#34;&gt;9.&lt;/span&gt; }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD568;&amp;#xC218; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; state&amp;#xB97C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; Symbolic Store&amp;#xC5D0;&amp;#xC11C; &amp;#xC778;&amp;#xC790; a&amp;#xC640; b&amp;#xB97C; &amp;#xAC01;&amp;#xAC01; &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xAC12;&amp;#xC778; $\alpha_a$&amp;#xC640; $\alpha_b$&amp;#xB85C; &amp;#xB9E4;&amp;#xD551;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$&lt;/p&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xB9D0;&amp;#xD588;&amp;#xB358; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC740; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; true&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$\pi = true$&lt;/p&gt;
&lt;p&gt;$stmt$&amp;#xB294; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;$stmt =$ &lt;code&gt;2. int x=1, y=0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xB9AC;&amp;#xB97C; &amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xCC98;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; state A&amp;#xB294; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state A. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$,  $\pi = true$, $stmt =$ &lt;code&gt;2. int x=1, y=0&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;int x=1, y=0&lt;/code&gt;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xBCC0;&amp;#xC218; x,y&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xAC01;&amp;#xAC01; 1&amp;#xACFC; 0&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Symbolic Store $\sigma$&amp;#xC5D0; x&amp;#xC640; y&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xAC00; &amp;#xCD94;&amp;#xAC00;&amp;#xB418;&amp;#xACE0; $stmt$&amp;#xC5D0; &amp;#xBCC4; &amp;#xB2E4;&amp;#xB978; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xB098; &amp;#xC2EC;&amp;#xBCFC;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC870;&amp;#xC791;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xC740; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xB294; &amp;#xC55E;&amp;#xC73C;&amp;#xB85C;&amp;#xB3C4; &amp;#xC790;&amp;#xB3D9;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state B. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = true$, $stmt =$ &lt;code&gt;3. if(a != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2EC;&amp;#xBCFC;&amp;#xB9AD; &amp;#xBCC0;&amp;#xC218; $a$&amp;#xAC00; 0&amp;#xC774; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; if&amp;#xBB38; &amp;#xC548;&amp;#xC73C;&amp;#xB85C; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC00;&amp;#xACE0; $a$&amp;#xAC00; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; if&amp;#xBB38;&amp;#xC744; &amp;#xD328;&amp;#xC2A4;&amp;#xD558;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xB418;&amp;#xBA74; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; fork&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC774; &amp;#xB2E4;&amp;#xB978; &amp;#xB450; &amp;#xAC00;&amp;#xC9C0; state&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state C. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ &lt;code&gt;4. y = 3+x&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state D. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a = 0$, $stmt =$ &lt;code&gt;8. assert(x-y !=0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xC774; &amp;#xB418;&amp;#xBA74; &amp;#xAC01;&amp;#xAC01; &amp;#xBCC4;&amp;#xAC1C;&amp;#xB85C; &amp;#xB2E4;&amp;#xC2DC; &amp;#xD0D0;&amp;#xC0C9;&amp;#xC5D0; &amp;#xB4E4;&amp;#xC5B4;&amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; state D&amp;#xB97C; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;. &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC778; assert &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAC74;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;x-y != 0&lt;/code&gt;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD604;&amp;#xC7AC; $x$&amp;#xB294; 1&amp;#xC774;&amp;#xACE0; $y$&amp;#xB294; 0&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; $x-y = 1-0 = 1 \neq 0$&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC11C; assert &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC778;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC885;&amp;#xB8CC;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xC81C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; $\alpha_a = 0$&amp;#xC774;&amp;#xBA74;,  &amp;#xC989; &amp;#xC778;&amp;#xC790; $a$&amp;#xAC00; 0&amp;#xC774;&amp;#xB77C;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xC54C;&amp;#xC544;&amp;#xB0B8; &amp;#xAC83;&amp;#xC774;&amp;#xB124;&amp;#xC694;!&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; state C&amp;#xB97C; &amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xAC00; &lt;code&gt;y = 3+x&lt;/code&gt;&amp;#xC774;&amp;#xACE0; $x$&amp;#xAC00; 1&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $y$&amp;#xB97C; 4&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state E.  $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ &lt;code&gt;3. if(b == 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB610; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC870;&amp;#xAC74; &amp;#xBD84;&amp;#xAE30;&amp;#xBB38;&amp;#xC774; &amp;#xB098;&amp;#xC654;&amp;#xB124;&amp;#xC694;. if&amp;#xBB38; &amp;#xC548;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC778; &lt;code&gt;b == 0&lt;/code&gt;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xB97C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8;&amp;#xD558;&amp;#xC5EC; &amp;#xB450; &amp;#xAC1C;&amp;#xC758; state&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state F. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b \neq 0)$, $stmt =$ &lt;code&gt;8. assert(x-y != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;state G. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ &lt;code&gt;6. x = 2*(a+b)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; state F&amp;#xB97C; &amp;#xBCF4;&amp;#xC8E0;. Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xAC00; 1&amp;#xC774;&amp;#xACE0; $y$&amp;#xAC00; 4&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; $x-y=-3$&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. assert &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC870;&amp;#xAC74;&amp;#xC774; $x-y \neq 0$&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xCC38;&amp;#xC774;&amp;#xB124;&amp;#xC694;! &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xB450;&amp;#xBC88;&amp;#xC9F8; &amp;#xC870;&amp;#xAC74; $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$&amp;#xC744; &amp;#xC54C;&amp;#xC544;&amp;#xB0C8;&amp;#xB124;&amp;#xC694;!(&amp;#xD558;.. &amp;#xD798;&amp;#xB4E4;&amp;#xB2E4;&amp;#x2026;)&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; state G &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. $stmt$&amp;#xAC00; &lt;code&gt;x = 2*(a+b)&lt;/code&gt; &amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xB97C; $x \mapsto 2*(\alpha_a + \alpha_b)$&amp;#xB85C; &amp;#xC5C5;&amp;#xB370;&amp;#xC774;&amp;#xD2B8; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;state H. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 2*(\alpha_a+\alpha_b), y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ &lt;code&gt;8. assert(x-y != 0)&lt;/code&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9; state &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;! assert &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC885;&amp;#xB8CC;&amp;#xB97C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC11C;&amp;#xB294; &lt;code&gt;x-y != 0&lt;/code&gt;&amp;#xAC00; &amp;#xCC38;&amp;#xC774; &amp;#xB418;&amp;#xC5B4;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; Symbolic Store $\sigma$&amp;#xC5D0; &amp;#xC788;&amp;#xB294; $x$&amp;#xC640; $y$&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xC5EC; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCD94;&amp;#xAC00;&amp;#xD574;&amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. $x$&amp;#xB294; $2*(\alpha_a + \alpha_b)$&amp;#xC774;&amp;#xACE0; $y$&amp;#xB294; 4&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB97C; &amp;#xBC18;&amp;#xC601;&amp;#xD558;&amp;#xBA74; &amp;#xCD5C;&amp;#xC885;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xACBD;&amp;#xB85C; &amp;#xC81C;&amp;#xC57D; &amp;#xC870;&amp;#xAC74; $\pi$&amp;#xAC00; &amp;#xB098;&amp;#xC624;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;$\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0) \wedge 2*(\alpha_a + \alpha_b) + 4 \neq 0$&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xB17C;&amp;#xB9AC;&amp;#xC2DD;&amp;#xC744; &amp;#xD480;&amp;#xBA74; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; a&amp;#xC640; b &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;!(&amp;#xB098;&amp;#xBA38;&amp;#xC9C0;&amp;#xB294; SMT solver&amp;#xAC00; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD574;&amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;)&lt;/p&gt;
&lt;h2 id=&#34;Symbolic-Execution&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;a href=&#34;#Symbolic-Execution&amp;#xC758;-&amp;#xD55C;&amp;#xACC4;&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&#34;&gt;&lt;/a&gt;Symbolic Execution&amp;#xC758; &amp;#xD55C;&amp;#xACC4;&lt;/h2&gt;&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#x201C;&amp;#xC6B0;&amp;#xC640; Symbolic Execution&amp;#xC740; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xADC0;&amp;#xCC2E;&amp;#xC544;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xB2E4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC11C; &amp;#xC815;&amp;#xB9D0; &amp;#xC790;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC2E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC774;&amp;#xB860;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB098; &amp;#xD604;&amp;#xC2E4;&amp;#xC801;&amp;#xC778; &amp;#xC81C;&amp;#xC57D;&amp;#xB4E4;&amp;#xC774; &amp;#xB9CE;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160; (&amp;#xC774;&amp;#xAC8C; &amp;#xAC00;&amp;#xB2A5;&amp;#xD588;&amp;#xC73C;&amp;#xBA74; &amp;#xC800;&amp;#xB294; &amp;#xBC8C;&amp;#xC368; &amp;#xAE38;&amp;#xBC14;&amp;#xB2E5;&amp;#xC5D0; &amp;#xC549;&amp;#xC544; &amp;#xAD6C;&amp;#xAC78;&amp;#xC744; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC9C0;&amp;#xB3C4;&amp;#x2026;)&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;p&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC758; &amp;#xC81C;&amp;#xC57D;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC608;&amp;#xC2DC;&amp;#xB85C;&amp;#xB4E0; foobar &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC9E7;&amp;#xC544;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD604;&amp;#xC2E4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; &amp;#xB9E4;&amp;#xC6B0; &amp;#xD07D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xBC18;&amp;#xC801;&amp;#xC778; &amp;#xC624;&amp;#xD53C;&amp;#xC2A4;&amp;#xB098; &amp;#xD50C;&amp;#xB808;&amp;#xC774;&amp;#xC5B4; &amp;#xAC19;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC740; &amp;#xC791;&amp;#xAC8C;&amp;#xB294; &amp;#xBA87; &amp;#xBC31; MB &amp;#xD639;&amp;#xC740; &amp;#xBA87; &amp;#xC2ED; GB&amp;#xAE4C;&amp;#xC9C0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; state&amp;#xB97C; &amp;#xACC4;&amp;#xC18D;&amp;#xD574;&amp;#xC11C; &amp;#xC313;&amp;#xC544;&amp;#xB098;&amp;#xAC04;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xC138;&amp;#xC694;. &amp;#xCD5C;&amp;#xC18C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xBA87; &amp;#xBC30;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA87; &amp;#xBC31;&amp;#xBC30;&amp;#xC758; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD560; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.(&amp;#xB1CC;&amp;#xD53C;&amp;#xC15C;) &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; Symbolic Execution&amp;#xC774; &amp;#xC81C;&amp;#xC548;&amp;#xB41C; 70&amp;#xB144;&amp;#xB300;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xC9C0;&amp;#xC801;&amp;#xB410;&amp;#xC5C8;&amp;#xB358; &amp;#xBB38;&amp;#xC81C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8; &amp;#xB2F9;&amp;#xC2DC;&amp;#xC5D0;&amp;#xB294; &amp;#xC9C0;&amp;#xAE08;&amp;#xB9CC;&amp;#xD07C; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC5C6;&amp;#xC5C8;&amp;#xC744;&amp;#xD150;&amp;#xB370;&amp;#xB3C4; &amp;#xB9D0;&amp;#xC774;&amp;#xC8E0;. &amp;#xBB3C;&amp;#xB860; &amp;#xC9C0;&amp;#xAE08; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAC12;&amp;#xC774; &amp;#xC2F8;&amp;#xC9C0;&amp;#xACE0; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74;&amp;#xC11C; &amp;#xC880; &amp;#xB354; &amp;#xD070; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xC26C;&amp;#xC6CC;&amp;#xC84C;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1;&amp;#xAE4C;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC774;&amp;#xB294; Symbolic Execution&amp;#xC758; &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C0;&amp;#xBAA9; &amp;#xBC1B;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB3C;&amp;#xB860; &amp;#xB9C8;&amp;#xC774;&amp;#xD06C;&amp;#xB85C;&amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xB098; &amp;#xAD6C;&amp;#xAE00; &amp;#xAC19;&amp;#xC740; &amp;#xB300;&amp;#xAE30;&amp;#xC5C5;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBA87; &amp;#xB9CC; &amp;#xCF54;&amp;#xC5B4;&amp;#xC5D0; &amp;#xBA87; &amp;#xBC31; &amp;#xD14C;&amp;#xB77C;&amp;#xBC14;&amp;#xC774;&amp;#xD2B8;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC744;&amp;#xC9C0;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC800; &amp;#xAC19;&amp;#xC740; &amp;#xAC1C;&amp;#xC778;&amp;#xC774; &amp;#xADF8;&amp;#xB0E5; Symbolic Execution&amp;#xC5D0;&amp;#xB9CC; &amp;#xC758;&amp;#xC874;&amp;#xD574;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xCC3E;&amp;#xB294; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xACE0; &amp;#xD574;&amp;#xB3C4;&amp;#x2026; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xB3C4; &amp;#xD6A8;&amp;#xC728;&amp;#xC774; &amp;#xC548; &amp;#xC88B;&amp;#xACA0;&amp;#xC8E0;&amp;#x2026; &amp;#xC544;&amp;#xB9C8; &amp;#xADF8;&amp;#xB0E5; Dumb Fuzzing&amp;#xC774; &amp;#xB354; &amp;#xBE60;&amp;#xB97C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x3160;&amp;#x3160;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD305; &amp;#xD30C;&amp;#xC6CC;&amp;#xAC00; &amp;#xBD80;&amp;#xC871;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xD574;&amp;#xACB0;&amp;#xC774; &amp;#xB410;&amp;#xB2E4;&amp;#xACE0; &amp;#xCCD0;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xAC00; &amp;#xB108;&amp;#xBB34; &amp;#xB9CE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC0C1;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xADF8;&amp;#xB0E5; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xD560; &amp;#xCF54;&amp;#xB4DC;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;, &amp;#xC774; &amp;#xC548;&amp;#xC5D0;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBD84;&amp;#xAE30;&amp;#xBB38;, &amp;#xB8E8;&amp;#xD504;&amp;#xBB38;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; &amp;#xC774;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xAC19;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774;&amp;#xB354;&amp;#xB77C;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB420; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBAA8;&amp;#xB4E0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xC57C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC81C;&amp;#xC77C; exploit&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xC740; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCC3E;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;. &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xD2B9;&amp;#xC815; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xB3C4; exploit&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xBABB;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADFC;&amp;#xB370; &amp;#xC774;&amp;#xB7F0; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; fork&amp;#xAE4C;&amp;#xC9C0; &amp;#xD574;&amp;#xAC00;&amp;#xBA74;&amp;#xC11C; &amp;#xBAA8;&amp;#xB4E0; state&amp;#xB97C; &amp;#xB2E4; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xACC4;&amp;#xC0B0;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC77C;&amp;#xB2E8; CPU&amp;#xC758; &amp;#xCF54;&amp;#xC5B4; &amp;#xAC1C;&amp;#xC218;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC544;&amp;#xC57C;&amp;#xD560; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; &amp;#xC2EC;&amp;#xC9C0;&amp;#xC5B4; &amp;#xBE68;&amp;#xB77C;&amp;#xC57C;&amp;#xD560; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;&amp;#x2026; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; &amp;#xB9AC;&amp;#xC0AC;&amp;#xC218;&amp;#xB290;&amp;#xB2D8;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;!!! &amp;#xD0B9;&amp;#xAC13;&amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xB9AC;&amp;#xD37C;&amp;#xB85C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xBA74; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xB290;&amp;#xB0D0;!!! &amp;#xC608;&amp;#x2026; &amp;#xB204;&amp;#xAC00; &amp;#xD568; &amp;#xAD6C;&amp;#xD574;&amp;#xC8FC;&amp;#xC2E0;&amp;#xB2E4;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C;&amp;#xB4E0; &amp;#xC628;&amp;#xBAB8;&amp;#xC744; &amp;#xBC14;&amp;#xCCD0; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314E;&amp;#xD5C8;&amp;#xD5E3;&amp;#x314E;(&amp;#xC0DD;&amp;#xAC01;&amp;#xB9CC; &amp;#xD574;&amp;#xB3C4; &amp;#xC88B;&amp;#xB124;)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/22HD9O4TZ2_4.jpeg&#34; alt=&#34;./angr_part2/22HD9O4TZ2_4.jpeg&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC774;&amp;#xCBE4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC601;&amp;#xC811;&amp;#xD574;&amp;#xBCF4;&amp;#xB294; &amp;#xB9AC;&amp;#xC0AC;&amp;#xC218;&amp;#xB290;&amp;#xB2D8;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC2E4;&amp;#xD589; &amp;#xD658;&amp;#xACBD;&amp;#xACFC;&amp;#xC758; interaction&amp;#xC740; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xC704;&amp;#xC5D0; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xC640; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC744; &amp;#xD574;&amp;#xC57C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD799;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xCF5C;&amp;#xC744; &amp;#xBCF4;&amp;#xB0B4;&amp;#xC57C;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xC9C0;&amp;#xB294; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544; &amp;#xCEE4;&amp;#xB110;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC548;&amp;#xB418;&amp;#xB0D0;&amp;#xAD6C;&amp;#xC694;? &amp;#xD558;&amp;#xD558; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC774;&amp;#xBBF8; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xAC70;&amp;#xB9AC;&amp;#xAC00; &amp;#xB9CE;&amp;#xC740;&amp;#xB370;&amp;#x2026; &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &amp;#xC5B4;&amp;#xB5A8;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xAC83;&amp;#xB3C4; &amp;#xBD84;&amp;#xC11D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC548;&amp;#xB418;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xC678;&amp;#xC801;&amp;#xC778; &amp;#xB300;&amp;#xC0C1;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774; &amp;#xBE60;&amp;#xC838;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xC644;&amp;#xBCBD;&amp;#xD558;&amp;#xAC8C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;&amp;#xD55C;&amp;#xACC4;&amp;#xC810;-&amp;#xBCF4;&amp;#xC644;&#34;&gt;&lt;a href=&#34;#&amp;#xD55C;&amp;#xACC4;&amp;#xC810;-&amp;#xBCF4;&amp;#xC644;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xD55C;&amp;#xACC4;&amp;#xC810; &amp;#xBCF4;&amp;#xC644;&#34;&gt;&lt;/a&gt;&amp;#xD55C;&amp;#xACC4;&amp;#xC810; &amp;#xBCF4;&amp;#xC644;&lt;/h2&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; Symbolic Execution&amp;#xC740; &amp;#xB9AC;&amp;#xC5BC;&amp;#xC6D4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC4F8;&amp;#xBAA8; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83; &amp;#xC77C;&amp;#xAE4C;&amp;#xC694;? &amp;#xADF8;&amp;#xB807;&amp;#xB2E4;&amp;#xBA74; &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC598;&amp;#xAE30;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0; &amp;#x314B;&amp;#x314B; &amp;#xB9E8; &amp;#xC55E;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC11C;&amp;#xB85C;&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xD65C;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xCC98;&amp;#xB7FC; Symbolic Execution &amp;#xC5ED;&amp;#xC2DC; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Concolic-Execution&#34;&gt;&lt;a href=&#34;#Concolic-Execution&#34; class=&#34;headerlink&#34; title=&#34;Concolic Execution&#34;&gt;&lt;/a&gt;Concolic Execution&lt;/h3&gt;&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778;&amp;#xAC8C; &amp;#xBC14;&amp;#xB85C; Concolic Execution&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Concolic&amp;#xC740; Concrete + Symbolic&amp;#xC744; &amp;#xD569;&amp;#xCE5C; &amp;#xD569;&amp;#xC131;&amp;#xC5B4;&amp;#xB85C; Concrete Execution&amp;#xACFC; Symbolic Execuition&amp;#xC744; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. Concrete Execution&amp;#xC740; Symbolic Execution&amp;#xACFC; &amp;#xBC18;&amp;#xB300;&amp;#xB85C; &amp;#xBBF8;&amp;#xC9C0;&amp;#xC218;&amp;#xAC00; &amp;#xC544;&amp;#xB2CC; &amp;#xAD6C;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xAC12;&amp;#xC744; &amp;#xC778;&amp;#xD48B;&amp;#xC73C;&amp;#xB85C; &amp;#xC8FC;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589; &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xC774; &amp;#xB450; &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD569;&amp;#xCCD0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xAE30;&amp;#xC874; Symbolic Store $\sigma$&amp;#xC5D0; Concrete &amp;#xAC12;&amp;#xC774; &amp;#xCD94;&amp;#xAC00;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Concrete &amp;#xAC12;&amp;#xC744; &amp;#xB123;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xBD84;&amp;#xAE30;&amp;#xB85C; &amp;#xBE60;&amp;#xC9C0;&amp;#xB294; &amp;#xAC12;(Statisfiable&amp;#xD55C; &amp;#xAC12;)&amp;#xC744; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC54C;&amp;#xC544;&amp;#xB0B4;&amp;#xAC8C; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; SMT solver&amp;#xC758; &amp;#xACC4;&amp;#xC0B0; &amp;#xC5C6;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC880; &amp;#xB354; &amp;#xBE68;&amp;#xB9AC; &amp;#xC9C4;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC7A5;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC678;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC120;&amp;#xBCC4;&amp;#xC801;&amp;#xC778; &amp;#xC2E4;&amp;#xD589; &amp;#xACBD;&amp;#xB85C; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xB358;&amp;#xAC00; fuzzing&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xD65C;&amp;#xC6A9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB358;&amp;#xAC00; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD65C;&amp;#xC6A9; &amp;#xAE30;&amp;#xBC95;&amp;#xB4E4;&amp;#xC774; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xD560; &amp;#xBD80;&amp;#xBD84;&amp;#xB4E4;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xB610; &amp;#xB2E4;&amp;#xB904;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Symbolic-Execution-&amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740;-&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0;-&amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34;&gt;&lt;a href=&#34;#Symbolic-Execution-&amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C;-&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740;-&amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0;-&amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34; class=&#34;headerlink&#34; title=&#34;Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&#34;&gt;&lt;/a&gt;Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC740; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&lt;/h1&gt;&lt;p&gt;&amp;#xCC98;&amp;#xC74C;&amp;#xC5D0; &amp;#xC81C;&amp;#xAC00; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xC758;&amp;#xBB38;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xD480; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. Symbolic Execution &amp;#xACFC;&amp;#xC815;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB9CC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xBA74; &amp;#xB85C;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xD558;&amp;#xACE0;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; ID&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xC5EC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0;, CPU&amp;#xC5D0; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; Symbolic Execution &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xC774;&amp;#xB7F0; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xACFC;&amp;#xC815;&amp;#xC5C6;&amp;#xC774; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC5D0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC5D4;&amp;#xC9C4;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC26C;&amp;#xC6B4; IL(Intermediate language)&amp;#xB85C; &amp;#xBC14;&amp;#xAFB8;&amp;#xC5B4; &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xC598;&amp;#xAE30;&amp;#xD55C; &amp;#xC77C;&amp;#xB828;&amp;#xC758; &amp;#xC791;&amp;#xC5C5;&amp;#xB4E4;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. CPU&amp;#xAC00; &amp;#xC2E4;&amp;#xC7AC;&amp;#xB85C; &amp;#xAE30;&amp;#xACC4;&amp;#xC5B4;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xC544;&amp;#xB2C8;&amp;#xACE0; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB9E4;&amp;#xD551;&amp;#xB418;&amp;#xC9C0;&amp;#xB3C4; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. IDA&amp;#xAC00; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC744; &amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA74; &amp;#xB418;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &lt;/p&gt;
&lt;h1 id=&#34;Part-2-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#Part-2-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;Part 2 &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;Part 2 &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h1&gt;&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; Symbolic Execution&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#xB77C;&amp;#xACE0; &amp;#xCC98;&amp;#xC74C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC744; &amp;#xB54C;, &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBB54;&amp;#xC9C0;&amp;#xB294; &amp;#xC54C;&amp;#xC544;&amp;#xC11C; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xB294;&amp;#xAC8C; &amp;#xBB50; &amp;#xADF8;&amp;#xB807;&amp;#xAC8C; &amp;#xC5B4;&amp;#xB835;&amp;#xACA0;&amp;#xC5B4;&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xD558; &amp;#xC5ED;&amp;#xC2DC; &amp;#xBB34;&amp;#xC2DD;&amp;#xD558;&amp;#xBA74; &amp;#xC6A9;&amp;#xAC10;&amp;#xD558;&amp;#xB2E4;&amp;#xACE0; &amp;#xBB34;&amp;#xC791;&amp;#xC815; &amp;#xB6F0;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xAC00; &amp;#xB4A4;&amp;#xC9C0;&amp;#xAC8C; &amp;#xCCD0;&amp;#xB9DE;&amp;#xC558;&amp;#xB124;&amp;#xC694;. &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080;&amp;#xAC74;&amp;#xB370; &amp;#xC815;&amp;#xB9D0; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC774; &amp;#xB9CE;&amp;#xC740;&amp;#xAC70; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xC640;&amp;#xC911;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC774;&amp;#xAC70; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC78; &amp;#xC800;&amp;#xAC70; &amp;#xC880; &amp;#xB354; &amp;#xACF5;&amp;#xBD80;&amp;#xD560;&amp;#xAC78; &amp;#xD558;&amp;#xB294; &amp;#xC544;&amp;#xC26C;&amp;#xC6C0;&amp;#xC774; &amp;#xC880; &amp;#xB0A8;&amp;#xC544;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC740; &amp;#xC81C;&amp;#xD55C;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xACE0;&amp;#x2026; &amp;#xAE00;&amp;#xC740; &amp;#xC62C;&amp;#xB824;&amp;#xC57C;&amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xC7A0;&amp;#xC744; &amp;#xC880; &amp;#xB354; &amp;#xC904;&amp;#xC5EC;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80; &amp;#xC880; &amp;#xB354; &amp;#xD558;&amp;#xACE0;&amp;#x2026; &amp;#xD574;&amp;#xC57C;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC774;&amp;#xC81C; &amp;#xB2E4;&amp;#xC74C; &amp;#xD3B8;&amp;#xC744; &amp;#xC4F0;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB610; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB7EC; &amp;#xAC00;&amp;#xC57C;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xADFC;&amp;#xB370; &amp;#xB098; &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00; &amp;#xC62C;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xC9C0;&amp;#x2026;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/07/21/j0ker/angr_part2/5h1k8f.jpg&#34; alt=&#34;./angr_part2/5h1k8f.jpg&#34;&gt;&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;ol&gt;
&lt;li&gt;&lt;a href=&#34;https://arxiv.org/pdf/1610.00502.pdf&#34;&gt;A Survey of Symbolic Execution Techniques&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://www.hahwul.com/2017/06/19/hacking-symbolic-executionsymbolic/&#34;&gt;[HACKING] Symbolic Execution(symbolic evaluation)&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xBD84;&amp;#xC11D;&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/pwnbatman-joker/awesome-symbolic-execution&#34;&gt;Awesome Symbolic Execution&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;http://www.lazenca.net/pages/viewpage.action?pageId=6324534&#34;&gt;03.Symbolic execution(feat.Concrete execution)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;http://rosaec.snu.ac.kr/meet/file/20110626o2.pdf&#34;&gt;SAT/SMT tutorial SMT &amp;#xD574;&amp;#xACB0;&amp;#xAE30; &amp;#xB0B4;&amp;#xBD80;&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/07/21/j0ker/angr_part2/5gxdyj.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/07/21/j0ker/angr_part2/">

  <title>[Research]  angr  - (2) Symbolic Execution - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-07-21 18:00" pubdate>
      2021 7 21 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      6.1k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      121
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]  angr  - (2) Symbolic Execution</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h1 id="&#xD575;&#xB9B0;&#xC774;&#xC758;-angr-&#xC815;&#xBCF5;&#xAE30;-2-Symbolic-Execution"><a href="#&#xD575;&#xB9B0;&#xC774;&#xC758;-angr-&#xC815;&#xBCF5;&#xAE30;-2-Symbolic-Execution" class="headerlink" title="&#xD575;&#xB9B0;&#xC774;&#xC758; angr &#xC815;&#xBCF5;&#xAE30; - (2) Symbolic Execution"></a>&#xD575;&#xB9B0;&#xC774;&#xC758; angr &#xC815;&#xBCF5;&#xAE30; - (2) Symbolic Execution</h1><p><img src="/2021/07/21/j0ker/angr_part2/5gxdyj.jpg" srcset="/img/loading.gif" alt="./angr_part2/5gxdyj.jpg"></p>
<h1 id="&#xC11C;&#xB860;"><a href="#&#xC11C;&#xB860;" class="headerlink" title="&#xC11C;&#xB860;"></a>&#xC11C;&#xB860;</h1><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. j0ker &#xC785;&#xB2C8;&#xB2E4;&#x2026; &#xC800;&#xBC88;&#xC8FC;&#xBD80;&#xD130; &#xB0A0;&#xC528;&#xAC00; &#xC88B;&#xB124;&#xC694;&#x2026; &#xD558;&#xC9C0;&#xB9CC; &#xC800;&#xB294; &#xC9D1;&#xC5D0;&#xB9CC; &#xCCD0;&#xBC15;&#xD600;&#xC11C; &#xC77C;&#xC774;&#xB791; &#xACF5;&#xBD80;&#xB9CC; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4; &#xD558;&#xD558; &#xC65C;&#xB0D0;&#xACE0;&#xC694;? &#xC4F8;&#xB370;&#xC5C6;&#xC774; &#xC8FC;&#xC81C;&#xB97C; &#xC5B4;&#xB835;&#xAC8C; &#xC7A1;&#xC558;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;! </p>
<p><img src="/2021/07/21/j0ker/angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg" srcset="/img/loading.gif" alt="./angr_part2/joker_sad_by_darknight7_d1hjnno-fullview.jpeg"></p>
<blockquote>
<p>&#xCB48;&#xAD74;&#x2026;</p>
</blockquote>
<p>&#xC0AC;&#xC2E4; &#xC8FC;&#xC81C;&#xB294; &#xC798;&#xBABB;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xBABB;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB807;&#xAC8C; &#xACE0;&#xD1B5;&#xBC1B;&#xB294; &#xAC83;&#xC774;&#xC8E0;. &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#x201C;&#xC74C;&#x2026; &#xADF8;&#xB0E5; Symbolic Execution&#xB9CC; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xACF5;&#xBD80;&#xD574;&#xC11C; &#xC815;&#xB9AC;&#xD558;&#xBA74; &#xB418;&#xACA0;&#xC9C0;?&#x201D;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xAC8C; &#xAC00;&#xC7A5; &#xD070; &#xC624;&#xC0B0;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xB2E4;&#xB978; &#xAC83;&#xB3C4; &#xACF5;&#xBD80;&#xD574;&#xC57C;&#xD558;&#xACE0; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xBAA8;&#xB974;&#xB294;&#xAC8C; &#xB9CE;&#xACE0; &#xAD81;&#xAE08;&#xD55C; &#xAC83;&#xB3C4; &#xB9CE;&#xC774; &#xC0DD;&#xAE30;&#xACE0;&#x2026; &#xC774;&#xAC83;&#xC800;&#xAC83; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xACF5;&#xBD80;&#xD560; &#xC591;&#xC774; &#xB9CE;&#xC544;&#xC11C; &#xC2DC;&#xAC04;&#xC774; &#xC624;&#xB798;&#xAC78;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xD558; &#xB2C9;&#xB124;&#xC784;&#xC744; &#xACE0;&#xCEE4;(&#xACE0;&#xD1B5;&#xBC1B;&#xB294; &#xC870;&#xCEE4;)&#xB85C; &#xBC14;&#xAFD4;&#xC57C;&#xACA0;&#xB124;&#xC694;.</p>
<p>&#xC544;&#xBB34;&#xD2BC; &#xC774;&#xC81C; Symbolic Execution&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="&#xC790;&#xB3D9;-&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;-&#xBD84;&#xC11D;-&#xAE30;&#xBC95;"><a href="#&#xC790;&#xB3D9;-&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;-&#xBD84;&#xC11D;-&#xAE30;&#xBC95;" class="headerlink" title="&#xC790;&#xB3D9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBD84;&#xC11D; &#xAE30;&#xBC95;"></a>&#xC790;&#xB3D9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBD84;&#xC11D; &#xAE30;&#xBC95;</h1><p>Symbolic Execution&#xC740; &#xC790;&#xB3D9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBD84;&#xC11D; &#xAE30;&#xBC95; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xD0C0;&#xAC9F; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC744; &#xC9C0;&#xC815;&#xD574;&#xC8FC;&#xBA74; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD574;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC544;&#xC8FC;&#xB294;&#xAC70;&#xC8E0;. &#xC790;&#xB3D9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xC740; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xB450; &#xAC00;&#xC9C0;&#xACE0; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. &#xC0AC;&#xB78C;&#xC774; &#xBD84;&#xC11D;&#xD560; &#xB54C;&#xB3C4; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC73C;&#xB85C; &#xB098;&#xB258;&#xC8E0;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, CTF&#xC5D0;&#xC11C; Pwnable &#xBB38;&#xC81C;&#xAC00; &#xB098;&#xC624;&#xBA74; &#xBA3C;&#xC800; IDA&#xC5D0; &#xB123;&#xC5B4;&#xC11C; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xCF54;&#xB4DC;&#xB97C; &#xB514;&#xCEF4;&#xD30C;&#xC77C; &#xD55C; &#xB2E4;&#xC74C;, &#xCF54;&#xB4DC;&#xB97C; &#xBCF4;&#xBA74;&#xC11C; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC73C;&#xB85C; &#xD558;&#xB294;&#xC9C0; &#xBD84;&#xC11D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC8C; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xBC18;&#xB300;&#xB85C;, &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD574;&#xC11C; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC774;&#xACA0;&#xC8E0;? IDA&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xBA74; &#xBD84;&#xC11D;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; Exploit &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xC138;&#xC6B4; &#xD6C4;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xBA74;&#xC11C; &#xC608;&#xC0C1;&#xB300;&#xB85C; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xBC14;&#xB00C;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C; &#xB2E4;&#xC74C; Exploit&#xC744; &#xC9C4;&#xD589;&#xD558;&#xACA0;&#xC8E0;. &#xC774;&#xAC8C; &#xC2E4;&#xC81C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC740; &#xCDE8;&#xC57D;&#xC810; &#xC790;&#xB3D9; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xC5B4;&#xB5A4; &#xD0A4;&#xC6CC;&#xB4DC;&#xB4E4;&#xC774; &#xB5A0;&#xC624;&#xB974;&#xC2DC;&#xB098;&#xC694;? &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC544;&#xC2DC;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xB4E4;&#xC744; &#xB098;&#xC5F4;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Fuzzing : &#xD0C0;&#xAC9F; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB79C;&#xB364;&#xD55C; &#xAC12;&#xC744; &#xC785;&#xB825;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xAE30;&#xBC95;</li>
<li>Taint Anaysis : &#xD2B9;&#xC815; &#xAC12;&#xC744; &#xC785;&#xB825;&#xD558;&#xACE0; &#xC785;&#xB825;&#xD55C; &#xAC12;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAC70;&#xCE58;&#xBA74;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB098; &#xBA54;&#xBAA8;&#xB9AC; &#xB4F1;&#xC5D0; &#xC5B4;&#xB5A4; &#xBCC0;&#xD654;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC9C0; &#xCD94;&#xC801;&#xD558;&#xB294; &#xAE30;&#xBC95;</li>
<li>Dynamic Binary Instrumentation : &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE30;&#xBC95;</li>
</ul>
<p>&#xCD5C;&#xADFC;&#xC5D0;&#xB294; &#xC774;&#xB7F0; &#xAE30;&#xBC95;&#xB4E4;&#xC774; &#xB2E8;&#xB3C5;&#xC73C;&#xB85C; &#xC4F0;&#xC774;&#xAE30; &#xBCF4;&#xB2E4;&#xB294; &#xC11C;&#xB85C;&#xC758; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xBA74;&#xC11C; &#xBCF5;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xB294;&#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC;&#xC5D0; <a href="https://hackyboiz.github.io/tags/Fabu1ous/">Fabulous</a>&#xB2D8;&#xC774; &#xD3EC;&#xC2A4;&#xD305;&#xD55C; <a href="https://hackyboiz.github.io/2021/05/23/fabu1ous/winafl-1/">WinAFL&#xB85C; &#xB9C8;&#xAD6C; &#xD37C;&#xC9D5;&#xD558;&#xAE30; &#xC2DC;&#xB9AC;&#xC988;</a>&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xACE0; &#xC788;&#xB294; WinAFL&#xB3C4; Fuzzing+Dynamic Binary Instrumentation&#xC744; &#xACB0;&#xD569;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC8E0;.</p>
<p>&#xC704;&#xC5D0;&#xC11C; &#xC598;&#xAE30;&#xD55C; &#xAE30;&#xBC95;&#xB4E4;&#xC758; &#xACF5;&#xD1B5;&#xC810;&#xC740; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;&#xC694;? &#xBAA8;&#xB450; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xC774;&#xB77C;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; Symbolic Execution&#xC740; &#xC815;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/07/21/j0ker/angr_part2/5gy87e.jpg" srcset="/img/loading.gif" alt="./angr_part2/5gy87e.jpg"></p>
<p>&#xC544;&#xB2C8;&#x2026; &#xC774;&#xB984;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#x201C;Execution&#x201D;&#xC774; &#xB4E4;&#xC5B4;&#xAC00;&#xC788;&#xACE0;, &#xBA54;&#xBAA8;&#xB9AC;&#xB791; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xBC14;&#xB00C;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xAC00;&#xBA74;&#xC11C; &#xD558;&#xB294;&#xAC70; &#xC544;&#xB0D0;? &#xB77C;&#xACE0; &#xC800;&#xB294; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xADF8;&#xB7FC; &#xC774;&#xC81C; Symbolic Execution&#xC758; &#xAC1C;&#xB150;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xBA74;&#xC11C; &#xC65C; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC778;&#xC9C0;&#xB3C4; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="Symbolic-Execution"><a href="#Symbolic-Execution" class="headerlink" title="Symbolic Execution"></a>Symbolic Execution</h1><p>Symbolic Execution&#xC5D0;&#xC11C;&#xB294; &#xBA3C;&#xC800; &#xD0C0;&#xAC9F; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xD48B;&#xAC12;&#xC744; &#xBBF8;&#xC9C0;&#xC218;&#xB85C; &#xAC00;&#xC815;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC2EC;&#xBCFC;&#xD654;(&#xAE30;&#xD638;&#xD654;)&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBAA8;&#xB4E0; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xC5EC; &#xBAA8;&#xB4E0; &#xACBD;&#xB85C;&#xB9C8;&#xB2E4; &#xC774; &#xACBD;&#xB85C;&#xAE4C;&#xC9C0; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC778;&#xD48B;&#xAC12;&#xC774; &#xBB50;&#xAC00; &#xB418;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xACC4;&#xC0B0;&#xD560; &#xC218; &#xC788;&#xB294; &#xC218;&#xC2DD;&#xC744; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xBC84;&#xADF8;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xBC1C;&#xACAC;&#xD55C;&#xB2E4;&#xBA74; &#xD574;&#xB2F9; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC774;&#xC81C;&#xAE4C;&#xC9C0; &#xB9CC;&#xB4E0; &#xC218;&#xC2DD;&#xC744; &#xD480;&#xC5B4; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xC778;&#xD48B;&#xAC12;&#xC744; &#xB123;&#xC5B4;&#xC57C;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB835;&#xC8E0;&#x2026; &#xC774;&#xAC8C; &#xBB54; &#xC18C;&#xB9B0;&#xC9C0;&#x2026;</p>
<p>&#xC608;&#xC2DC;&#xB97C; &#xBCF4;&#xBA74;&#xC11C; &#xB2E4;&#xC2DC; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">foobar</span><span class="hljs-params">(<span class="hljs-keyword">int</span> a, <span class="hljs-keyword">int</span> b)</span> </span>{ 
	<span class="hljs-keyword">int</span> x = <span class="hljs-number">1</span>, y = <span class="hljs-number">0</span>;
	<span class="hljs-keyword">if</span> (a != <span class="hljs-number">0</span>) {
		y = <span class="hljs-number">3</span>+x;
		<span class="hljs-keyword">if</span> (b == <span class="hljs-number">0</span>)
			x = <span class="hljs-number">2</span>*(a+b);
	}
	assert(x-y != <span class="hljs-number">0</span>); 
}</code></pre>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; foobar&#xB77C;&#xB294; &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD55C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xC778;&#xD48B;&#xC740; a&#xC640; b&#xAC00; &#xC788;&#xACE0; assert &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC885;&#xB8CC;&#xC2DC;&#xD0A4;&#xB294; a&#xC640; b&#xB97C; &#xCC3E;&#xC73C;&#xB824;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C;&#xD560;&#xAE4C;&#xC694;? &#xBCF4;&#xBA74; x&#xB294; 1&#xB85C; y&#xB294; 0&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xD558;&#xB294;&#xB370;, x-y&#xAC00; 0&#xC774; &#xB418;&#xC5B4;&#xC57C;&#xD558;&#xB2C8;&#xAE4C; if &#xBB38; &#xC548;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; x&#xC640; y&#xC758; &#xAC12;&#xC744; &#xC870;&#xC808;&#xD574;&#xC57C;&#xD560; &#xAC70; &#xAC19;&#xB124;&#xC694;. if&#xBB38;&#xC744; &#xBCF4;&#xBA74; &#xC77C;&#xB2E8; a&#xAC00; 0&#xC774; &#xC544;&#xB2C8;&#xC5EC;&#xC57C; if&#xBB38; &#xC548;&#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xAC08; &#xC218; &#xC788;&#xC744;&#xAC70; &#xAC19;&#xAD6C;&#xC694;. &#xADF8;&#xB7EC;&#xBA74; y&#xB294; x+3=4&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xBA74; x&#xC640; y&#xAC00; &#xAC19;&#xC544;&#xC57C; &#xD558;&#xB2C8;&#xAE4C; &#xB450;&#xBC88;&#xC9F8; if&#xBB38; &#xC548;&#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; x&#xAC00; 4&#xAC00; &#xB420; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD574;&#xC57C;&#xACA0;&#xB124;&#xC694;. &#xADF8;&#xB7EC;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; b&#xAC00; 0&#xC774;&#xC5B4;&#xC57C; &#xD558;&#xACE0; 2 * (a+b)&#xAC00; 4&#xAC00; &#xB418;&#xC5B4;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704;&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xD1A0;&#xB300;&#xB85C; &#xC870;&#xAC74;&#xB4E4;&#xC744; &#xB098;&#xC5F4;&#xD574;&#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><script type="math/tex; mode=display">a\ne0</script></li>
<li><script type="math/tex; mode=display">0=2*(a+b)-4</script></li>
<li><script type="math/tex; mode=display">b=0</script></li>
</ol>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774; &#xC870;&#xAC74;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xB9CC;&#xC871;&#xD574;&#xC57C;&#xD558;&#xB2C8;&#xAE4C; &#xD569;&#xCE58;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC218;&#xC2DD;&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;.</p>
<script type="math/tex; mode=display">a\ne0 \wedge 0=2*(a+b)-4 \wedge b=0</script><p>&#xC774;&#xAC8C; &#xC774;&#xAC78; &#xD480;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xAC12;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xADFC;&#xB370; &#xC774;&#xAC70;&#xB294; &#xB610; &#xC5B4;&#xB5BB;&#xAC8C; &#xD480;&#xC5B4;&#x2026; &#xD5C8;&#xD5C8; &#xC548;&#xADF8;&#xB798;&#xB3C4; &#xC218;&#xD559;&#xB3C4; &#xBABB;&#xD558;&#xB294;&#xB370;&#x2026; &#xD558;&#xC9C0;&#xB9CC;&#x2026; </p>
<p><img src="/2021/07/21/j0ker/angr_part2/zzal.jpeg" srcset="/img/loading.gif" alt="./angr_part2/zzal.jpeg"></p>
<blockquote>
<p>&#xC194;&#xBC84;&#xCA29; &#xB3C4;&#xC640;&#xC918;!!!</p>
</blockquote>
<h2 id="Solver"><a href="#Solver" class="headerlink" title="Solver"></a>Solver</h2><p>&#xC774;&#xC655; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD558;&#xAE30;&#xB85C; &#xD588;&#xC73C;&#xB2C8; &#xC774;&#xB7F0; &#xC218;&#xC2DD;&#xB3C4; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD574;&#xC57C;&#xACA0;&#xC8E0;! &#xC800; &#xAC19;&#xC740; &#xC218;&#xD3EC;&#xC790;&#xB3C4; &#xC774;&#xB7F4; &#xB54C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC194;&#xBC84;&#xB77C;&#xB294;&#xAC8C; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xC5ED;&#xC2DC; &#xC138;&#xC0C1;&#xC740; &#xBE60;&#xB974;&#xAC8C; &#xBC1C;&#xC804;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026; &#xC800;&#xB9CC; &#xC2DC;&#xB300;&#xC5D0; &#xB9DE;&#xCDB0; &#xB098;&#xAC00;&#xB294;&#xAC8C; &#xC774;&#xB807;&#xAC8C; &#xBC84;&#xAC70;&#xC6B4; &#xAC74;&#xC9C0;&#x2026;) &#xC194;&#xBC84;&#xC5D0;&#xB294; SAT solver&#xC640; SMT solver&#xAC00; &#xC788;&#xB294;&#xB370;, &#xBA3C;&#xC800; SAT solver&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;.</p>
<h3 id="SAT-solver"><a href="#SAT-solver" class="headerlink" title="SAT solver"></a>SAT solver</h3><p>SAT&#xB294; SATisfiability problem&#xC758; &#xC55E; &#xC138;&#xAE00;&#xC790;&#xB97C; &#xB530;&#xC628; &#xC57D;&#xC790;&#xC785;&#xB2C8;&#xB2E4;. &#xD55C;&#xAD6D;&#xC5B4;&#xB85C;&#xB294; &#xCDA9;&#xC871; &#xAC00;&#xB2A5;&#xC131; &#xBB38;&#xC81C;&#xC778;&#xB370; &#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xC8FC;&#xB294;&#xAC8C; SAT solver&#xC785;&#xB2C8;&#xB2E4;. &#xCDA9;&#xC871; &#xAC00;&#xB2A5;&#xC131; &#xBB38;&#xC81C;&#xB294; &#xB17C;&#xB9AC; &#xC5F0;&#xC0B0;&#xC790;&#xC640; &#xB17C;&#xB9AC; &#xBCC0;&#xC218;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xB17C;&#xB9AC;&#xC2DD;&#xC774; &#xCC38;&#xC774; &#xB418;&#xB294; &#xBCC0;&#xC218;&#xAC12;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0;&#xB97C; &#xCC3E;&#xB294; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>SAT&#xC758; &#xB17C;&#xB9AC;&#xC2DD;&#xC740; <strong>&#xB17C;&#xB9AC; &#xBCC0;&#xC218;</strong>&#xC640; <strong>&#xB17C;&#xB9AC; &#xC5F0;&#xC0B0;&#xC790;</strong>&#xB85C;&#xB9CC; &#xC774;&#xB8E8;&#xC5B4;&#xC838;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0;&#xAC78; &#xBA85;&#xC81C;&#xB17C;&#xB9AC;&#xC2DD;&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB17C;&#xB9AC;&#xC5F0;&#xC0B0;&#xC790;&#xC5D0;&#xB294; not, and, or&#xC774; &#xC788;&#xC8E0;. &#xACF1;&#xC148;&#xC774;&#xB098; &#xB354;&#xD558;&#xAE30; &#xB4F1; &#xC5F0;&#xC0B0;&#xC790; &#xC5C6;&#xC774; &#xC774;&#xB7F0; &#xC5F0;&#xC0B0;&#xC790;&#xB4E4;&#xACFC; &#xC774; &#xC5F0;&#xC0B0;&#xC744; &#xD558;&#xAE30; &#xC704;&#xD55C; true, flase &#xAC19;&#xC740; &#xB17C;&#xB9AC; &#xBCC0;&#xC218;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>$x_1 \wedge \neg x_2 \vee x_3$</p>
<p>&#xC5EC;&#xAE30;&#xC11C; $x_3$&#xAC00; &#xCC38;&#xC774;&#xC5B4;&#xC11C; &#xB17C;&#xB9AC;&#xC2DD;&#xC774; &#xCC38;&#xC774;&#xB41C;&#xB2E4;&#xBA74;, &#xC774; &#xB17C;&#xB9AC;&#xC2DD;&#xC740; satisfiable&#xD558;&#xB2E4;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; &#xC2DD;&#xC774; &#xCC38;&#xC774; &#xB418;&#xB294; &#xBCC0;&#xC218; &#xC870;&#xD569;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xC5B4; &#xAC70;&#xC9D3;&#xC774; &#xB41C;&#xB2E4;&#xBA74; &#xC774; &#xB17C;&#xB9AC;&#xC2DD;&#xC740; unsatisfiable&#xD558;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xBA85;&#xC81C;&#xB17C;&#xB9AC;&#xC2DD;&#xC73C;&#xB85C;&#xB9CC; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xC8FC;&#xB294; &#xAC83;&#xC774; SAT solver&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="SMT-solver"><a href="#SMT-solver" class="headerlink" title="SMT solver"></a>SMT solver</h3><p>SMT&#xB294; Satisfiability Modulo Theories&#xC758; &#xC57D;&#xC790;&#xB85C; SAT solver&#xC5D0;&#xC11C; &#xD574;&#xACB0;&#xD558;&#xB358; &#xBA85;&#xC81C;&#xB17C;&#xB9AC;&#xC2DD;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; 1&#xCC28; &#xB17C;&#xB9AC;&#xC2DD;&#xC744; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD55C; solver&#xC785;&#xB2C8;&#xB2E4;. SAT solver&#xC5D0;&#xC11C; &#xD55C;&#xB2E8;&#xACC4; &#xC5C5;&#xADF8;&#xB808;&#xC774;&#xB4DC;&#xB41C; &#xB188;&#xC774;&#xB77C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. 1&#xCC28; &#xB17C;&#xB9AC;&#xC2DD;&#xC5D0;&#xC11C;&#xB294; &#xB17C;&#xB9AC;&#xBCC0;&#xC218;&#xC640; &#xB17C;&#xB9AC;&#xC5F0;&#xC0B0;&#xC790; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xB2E4;&#xC591;&#xD55C; &#xC5F0;&#xC0B0;&#xC790;&#xC640; &#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>$(a * 10) &gt; 20 \wedge (b + 20) &lt; 100 \wedge (c &gt; 0)$ </p>
<p>&#xC774; &#xB17C;&#xB9AC;&#xC2DD;&#xC740; &#xC880; &#xC804;&#xC5D0; foobar &#xD568;&#xC218;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xC11C; &#xB098;&#xC628; &#xC2DD;&#xACFC; &#xC880; &#xB354; &#xBE44;&#xC2B7;&#xD558;&#xC8E0;? &#xB124;. Symbolic Execution&#xC744; &#xD1B5;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xB17C;&#xB9AC;&#xC2DD;&#xC744; &#xBC14;&#xB85C; SMT solver&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xACE0; &#xC774;&#xB7F0; &#xB17C;&#xB9AC;&#xC2DD;&#xC744; SAT solver&#xAC00; &#xB17C;&#xB9AC;&#xC2DD;&#xC744; &#xD480; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBA85;&#xC81C;&#xB17C;&#xB9AC;&#xC2DD;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xB610; SAT sovler&#xC5D0;&#xC11C; &#xB69D;&#xB531;&#xB69D;&#xB531;&#xD574;&#xC11C; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xACC4;&#xC0B0;&#xD574;&#xC8FC;&#xC8E0;!</p>
<p>&#xC0AC;&#xC2E4; SMT solver&#xAC00; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0;&#xB3C4; &#xAD81;&#xAE08;&#xD574;&#xC11C; &#xACF5;&#xBD80;&#xD558;&#xACE0; &#xC815;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD588;&#xB294;&#xB370; &#xB0B4;&#xC6A9;&#xC774; &#xB108;&#xBB34; &#xB9CE;&#xACE0; &#xC774;&#xAC83;&#xC800;&#xAC83; &#xB2E4; &#xD558;&#xB2E4;&#xAC00;&#xB294; &#xC2DC;&#xAC04; &#xB0B4;&#xC5D0; &#xB2E4; &#xACF5;&#xBD80;&#xB97C; &#xBABB; &#xD560;&#xAC70; &#xAC19;&#xC544;&#xC11C; &#xB2E4;&#xC74C;&#xC5D0; &#xAE30;&#xD68C;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD00;&#xC2EC; &#xC788;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; Reference 6&#xBC88;&#xC744; &#xCC38;&#xACE0;&#xD574; &#xBCF4;&#xC138;&#xC694;!</p>
<h2 id="&#xC608;&#xC81C;"><a href="#&#xC608;&#xC81C;" class="headerlink" title="&#xC608;&#xC81C;"></a>&#xC608;&#xC81C;</h2><p>&#xC774;&#xC81C; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC77C;&#xB2E8; &#xADF8; &#xC804;&#xC5D0; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xB54C; &#xC5B4;&#xB5A4; &#xAC83;&#xB4E4;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBCFC;&#xAC8C;&#xC694;.</p>
<p>&#xC77C;&#xB2E8; &#xCF54;&#xB4DC;&#xB97C; &#xBD84;&#xC11D;&#xD560; &#xB54C; &#xCD1D; &#xC138; &#xAC00;&#xC9C0; &#xC694;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD569;&#xCCD0; state&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>$stmt$ : statement&#xC758; &#xC57D;&#xC790;&#xB85C;, &#xB2E4;&#xC74C;&#xC5D0; &#xD3C9;&#xAC00;&#xD560; statement&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. C&#xC5B8;&#xC5B4;&#xB97C; &#xBD84;&#xC11D;&#xD55C;&#xB2E4;&#xACE0; &#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xC5D0; &#xBD84;&#xC11D;&#xD560; &#xCF54;&#xB4DC;&#xB97C; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. statement&#xC5D0;&#xB294; &#xC870;&#xAC74;&#xBD80; &#xBD84;&#xAE30;&#xB098; &#xC810;&#xD504; &#xD639;&#xC740; &#xC218;&#xD589;&#xD574;&#xC57C;&#xD560; assignment(&#xC774;&#xAC70;&#xB294; &#xB3D9;&#xC791;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xD574;&#xD558;&#xBA74; &#xD3B8;&#xD560;&#xAC70; &#xAC19;&#xB124;&#xC694;)&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>$\sigma$ : Symbolic Store&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xBCC0;&#xC218;&#xB97C; &#xC2EC;&#xBCFC;&#xB9AD; &#xAC12;&#xACFC; concrete &#xAC12;(&#xACE0;&#xC815;&#xAC12;)&#xC744; &#xB9E4;&#xD551;&#xD55C; &#xB0B4;&#xC6A9;&#xB4E4;&#xC774; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, foobar &#xD568;&#xC218;&#xC5D0;&#xC11C; a&#xC640; b&#xB294; &#xAC01;&#xAC01; &#xC2EC;&#xBCFC;&#xB9AD; &#xAC12;&#xC778; $\alpha_a$&#xC640; $\alpha_b$&#xB85C; &#xB9E4;&#xD551;&#xC774; &#xB418;&#xACE0;, x&#xC640; y&#xB294; 1&#xACFC; 0&#xC73C;&#xB85C; &#xCC98;&#xC74C;&#xC5D0; &#xB9E4;&#xD551;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7F0; &#xB9E4;&#xD551;&#xAD00;&#xACC4;(association)&#xB97C; $\mapsto$ &#xAE30;&#xD638;&#xB85C; &#xD45C;&#xD604;&#xD569;&#xB2C8;&#xB2E4;.(ex. $b \mapsto \alpha_b$)</li>
<li>$\pi$ : Path Constraint&#xB85C; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74;&#xC774; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xBA74;&#xC11C; &#xC870;&#xAC74;&#xBD80; &#xBD84;&#xAE30;&#xB098; &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC744; &#xAC70;&#xCCD0; $stmt$&#xAE4C;&#xC9C0; &#xC2E4;&#xD589;&#xB418;&#xAE30; &#xC704;&#xD574; &#xC55E;&#xC5D0;&#xC11C; &#xC124;&#xC815;&#xD55C; &#xC2EC;&#xBCFC;&#xB9AD; &#xAC12; $a_i$&#xAC00; &#xC5B4;&#xB5A4; &#xAC12;&#xC774; &#xB418;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xB17C;&#xB9AC;&#xC2DD;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xC5D0;&#xB294; true&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xC55E;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xB358; foobar &#xD568;&#xC218;&#xB97C; &#xB2E4;&#xC2DC; &#xAC00;&#xC838;&#xC640;&#xC11C; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xBD84;&#xC11D;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C;&#xB294; assert &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC885;&#xB8CC;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xB294; &#xAC12;&#xC744; &#xCC3E;&#xB294;&#xB370; &#xC9D1;&#xC911;&#xD588;&#xC9C0;&#xB9CC; Symbolic Execution&#xC740; &#xC6D0;&#xB798; &#xBAA8;&#xB4E0; &#xACBD;&#xB85C;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; assert &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC885;&#xB8CC;&#xAC00; &#xB418;&#xB294; &#xACBD;&#xB85C;, &#xC885;&#xB8CC;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xB85C; &#xBAA8;&#xB450; &#xD0D0;&#xC0C9;&#xD574; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">1.</span>  <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">foobar</span><span class="hljs-params">(<span class="hljs-keyword">int</span> a, <span class="hljs-keyword">int</span> b)</span> </span>{ 
<span class="hljs-number">2.</span> 	<span class="hljs-keyword">int</span> x = <span class="hljs-number">1</span>, y = <span class="hljs-number">0</span>;
<span class="hljs-number">3.</span> 	<span class="hljs-keyword">if</span> (a != <span class="hljs-number">0</span>) {
<span class="hljs-number">4.</span> 		y = <span class="hljs-number">3</span>+x;
<span class="hljs-number">5.</span> 		<span class="hljs-keyword">if</span> (b == <span class="hljs-number">0</span>)
<span class="hljs-number">6.</span> 			x = <span class="hljs-number">2</span>*(a+b);
<span class="hljs-number">7.</span> 	}
<span class="hljs-number">8.</span> 	assert(x-y != <span class="hljs-number">0</span>); 
<span class="hljs-number">9.</span> }</code></pre>
<p>&#xBA3C;&#xC800; &#xD568;&#xC218; &#xBD84;&#xC11D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xBA74;&#xC11C; state&#xB97C; &#xCD08;&#xAE30;&#xD654;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; Symbolic Store&#xC5D0;&#xC11C; &#xC778;&#xC790; a&#xC640; b&#xB97C; &#xAC01;&#xAC01; &#xC2EC;&#xBCFC;&#xB9AD; &#xAC12;&#xC778; $\alpha_a$&#xC640; $\alpha_b$&#xB85C; &#xB9E4;&#xD551;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>$\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$</p>
<p>&#xC55E;&#xC5D0;&#xC11C; &#xB9D0;&#xD588;&#xB358; &#xAC83;&#xCC98;&#xB7FC; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74;&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; true&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>$\pi = true$</p>
<p>$stmt$&#xB294; &#xBD84;&#xC11D;&#xD574;&#xC57C;&#xD560; &#xCF54;&#xB4DC;&#xB85C; &#xC124;&#xC815;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>$stmt =$ <code>2. int x=1, y=0</code></p>
<p>&#xC815;&#xB9AC;&#xB97C; &#xD558;&#xC790;&#xBA74; &#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB41C; state A&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>state A. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b }$,  $\pi = true$, $stmt =$ <code>2. int x=1, y=0</code></p>
<p>&#xB2E4;&#xC74C;&#xC5D0; &#xBD84;&#xC11D;&#xD560; &#xCF54;&#xB4DC;&#xAC00; <code>int x=1, y=0</code>&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xBCC0;&#xC218; x,y&#xAC00; &#xCD94;&#xAC00;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAC01;&#xAC01; 1&#xACFC; 0&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Symbolic Store $\sigma$&#xC5D0; x&#xC640; y&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xCD94;&#xAC00;&#xB418;&#xACE0; $stmt$&#xC5D0; &#xBCC4; &#xB2E4;&#xB978; &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xB098; &#xC2EC;&#xBCFC;&#xC5D0; &#xB300;&#xD55C; &#xC870;&#xC791;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74; $\pi$&#xC740; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. $stmt$&#xB294; &#xC55E;&#xC73C;&#xB85C;&#xB3C4; &#xC790;&#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xC74C;&#xC5D0; &#xBD84;&#xC11D;&#xD560; &#xCF54;&#xB4DC;&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>state B. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = true$, $stmt =$ <code>3. if(a != 0)</code></p>
<p>&#xC774;&#xC81C; &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xBB38;&#xC774; &#xB098;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2EC;&#xBCFC;&#xB9AD; &#xBCC0;&#xC218; $a$&#xAC00; 0&#xC774; &#xC544;&#xB2C8;&#xB77C;&#xBA74; if&#xBB38; &#xC548;&#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xACE0; $a$&#xAC00; 0&#xC774;&#xB77C;&#xBA74; if&#xBB38;&#xC744; &#xD328;&#xC2A4;&#xD558;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xACA0;&#xB124;&#xC694;. &#xC774;&#xB807;&#xAC8C; &#xB418;&#xBA74; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C;&#xB294; fork&#xB97C; &#xD1B5;&#xD574; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74;&#xC774; &#xB2E4;&#xB978; &#xB450; &#xAC00;&#xC9C0; state&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>state C. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ <code>4. y = 3+x</code></p>
<p>state D. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 0 }$,  $\pi = \alpha_a = 0$, $stmt =$ <code>8. assert(x-y !=0)</code></p>
<p>state&#xAC00; &#xC0DD;&#xC131;&#xC774; &#xB418;&#xBA74; &#xAC01;&#xAC01; &#xBCC4;&#xAC1C;&#xB85C; &#xB2E4;&#xC2DC; &#xD0D0;&#xC0C9;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; state D&#xB97C; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;. &#xB2E4;&#xC74C;&#xC5D0; &#xC2E4;&#xD589;&#xD560; &#xCF54;&#xB4DC;&#xB294; &#xD568;&#xC218;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9;&#xC778; assert &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. &#xC870;&#xAC74;&#xC73C;&#xB85C; <code>x-y != 0</code>&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xD604;&#xC7AC; $x$&#xB294; 1&#xC774;&#xACE0; $y$&#xB294; 0&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; $x-y = 1-0 = 1 \neq 0$&#xC774; &#xB418;&#xC5B4;&#xC11C; assert &#xD568;&#xC218;&#xB85C; &#xC778;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC885;&#xB8CC;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xBA74; &#xC774;&#xC81C; &#xC6B0;&#xB9AC;&#xB294; $\alpha_a = 0$&#xC774;&#xBA74;,  &#xC989; &#xC778;&#xC790; $a$&#xAC00; 0&#xC774;&#xB77C;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xB294; &#xACBD;&#xB85C;&#xB97C; &#xD558;&#xB098; &#xC54C;&#xC544;&#xB0B8; &#xAC83;&#xC774;&#xB124;&#xC694;!</p>
<p>&#xC774;&#xBC88;&#xC5D0;&#xB294; state C&#xB97C; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. $stmt$&#xAC00; <code>y = 3+x</code>&#xC774;&#xACE0; $x$&#xAC00; 1&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Symbolic Store $\sigma$&#xC5D0; &#xC788;&#xB294; $y$&#xB97C; 4&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>state E.  $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = \alpha_a \neq 0$, $stmt =$ <code>3. if(b == 0)</code></p>
<p>&#xB610; &#xB2E4;&#xC2DC; &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xBB38;&#xC774; &#xB098;&#xC654;&#xB124;&#xC694;. if&#xBB38; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xC870;&#xAC74;&#xC778; <code>b == 0</code>&#xC5D0; &#xB530;&#xB77C; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74; $\pi$&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xC5EC; &#xB450; &#xAC1C;&#xC758; state&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>state F. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b \neq 0)$, $stmt =$ <code>8. assert(x-y != 0)</code></p>
<p>state G. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 1, y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ <code>6. x = 2*(a+b)</code></p>
<p>&#xBA3C;&#xC800; state F&#xB97C; &#xBCF4;&#xC8E0;. Symbolic Store $\sigma$&#xC5D0; &#xC788;&#xB294; $x$&#xAC00; 1&#xC774;&#xACE0; $y$&#xAC00; 4&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; $x-y=-3$&#xC774; &#xB429;&#xB2C8;&#xB2E4;. assert &#xD568;&#xC218;&#xC758; &#xC870;&#xAC74;&#xC774; $x-y \neq 0$&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCC38;&#xC774;&#xB124;&#xC694;! &#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xB294; &#xB450;&#xBC88;&#xC9F8; &#xC870;&#xAC74; $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$&#xC744; &#xC54C;&#xC544;&#xB0C8;&#xB124;&#xC694;!(&#xD558;.. &#xD798;&#xB4E4;&#xB2E4;&#x2026;)</p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C;&#xB294; state G &#xC785;&#xB2C8;&#xB2E4;. $stmt$&#xAC00; <code>x = 2*(a+b)</code> &#xC774;&#xB124;&#xC694;. &#xC774;&#xC5D0; &#xB9DE;&#xCDB0;&#xC11C; Symbolic Store $\sigma$&#xC5D0; &#xC788;&#xB294; $x$&#xB97C; $x \mapsto 2*(\alpha_a + \alpha_b)$&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>state H. $\sigma = { a \mapsto \alpha_a , b \mapsto \alpha_b, x \mapsto 2*(\alpha_a+\alpha_b), y \mapsto 4 }$,  $\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0)$, $stmt =$ <code>8. assert(x-y != 0)</code></p>
<p>&#xC774;&#xC81C; &#xB4DC;&#xB514;&#xC5B4; &#xB9C8;&#xC9C0;&#xB9C9; state &#xC785;&#xB2C8;&#xB2E4;! assert &#xD568;&#xC218;&#xB97C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC885;&#xB8CC;&#xB97C; &#xC2DC;&#xD0A4;&#xC9C0; &#xC54A;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; <code>x-y != 0</code>&#xAC00; &#xCC38;&#xC774; &#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xC5D0; &#xB9DE;&#xAC8C; Symbolic Store $\sigma$&#xC5D0; &#xC788;&#xB294; $x$&#xC640; $y$&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC5EC; &#xC0C8;&#xB85C;&#xC6B4; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74;&#xC744; &#xCD94;&#xAC00;&#xD574;&#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. $x$&#xB294; $2*(\alpha_a + \alpha_b)$&#xC774;&#xACE0; $y$&#xB294; 4&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xBC18;&#xC601;&#xD558;&#xBA74; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xACBD;&#xB85C; &#xC81C;&#xC57D; &#xC870;&#xAC74; $\pi$&#xAC00; &#xB098;&#xC624;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>$\pi = (\alpha_a \neq 0) \wedge (\alpha_b = 0) \wedge 2*(\alpha_a + \alpha_b) + 4 \neq 0$</p>
<p>&#xC774; &#xB17C;&#xB9AC;&#xC2DD;&#xC744; &#xD480;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; a&#xC640; b &#xAC12;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;!(&#xB098;&#xBA38;&#xC9C0;&#xB294; SMT solver&#xAC00; &#xC54C;&#xC544;&#xC11C; &#xD574;&#xC904; &#xAC81;&#xB2C8;&#xB2E4; &#x314B;&#x314B;)</p>
<h2 id="Symbolic-Execution&#xC758;-&#xD55C;&#xACC4;"><a href="#Symbolic-Execution&#xC758;-&#xD55C;&#xACC4;" class="headerlink" title="Symbolic Execution&#xC758; &#xD55C;&#xACC4;"></a>Symbolic Execution&#xC758; &#xD55C;&#xACC4;</h2><p>&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0;&#xB9CC; &#xBCF4;&#xC2DC;&#xBA74; &#x201C;&#xC6B0;&#xC640; Symbolic Execution&#xC740; &#xC6B0;&#xB9AC;&#xAC00; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xADC0;&#xCC2E;&#xC544;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xC54C;&#xC544;&#xC11C; &#xB2E4; &#xBD84;&#xC11D;&#xD574;&#xC11C; &#xC815;&#xB9D0; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xACA0;&#xB124;?&#x201D;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xACA0;&#xC9C0;&#xB9CC;&#x2026; &#xC774;&#xB860;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xAC00;&#xB2A5;&#xD558;&#xB098; &#xD604;&#xC2E4;&#xC801;&#xC778; &#xC81C;&#xC57D;&#xB4E4;&#xC774; &#xB9CE;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4; &#x3160;&#x3160; (&#xC774;&#xAC8C; &#xAC00;&#xB2A5;&#xD588;&#xC73C;&#xBA74; &#xC800;&#xB294; &#xBC8C;&#xC368; &#xAE38;&#xBC14;&#xB2E5;&#xC5D0; &#xC549;&#xC544; &#xAD6C;&#xAC78;&#xC744; &#xD558;&#xACE0; &#xC788;&#xC744;&#xC9C0;&#xB3C4;&#x2026;)</p>
<ol>
<li><p>&#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC81C;&#xC57D;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC608;&#xC2DC;&#xB85C;&#xB4E0; foobar &#xD568;&#xC218;&#xB294; &#xB9E4;&#xC6B0; &#xC9E7;&#xC544;&#xC11C; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xC9C0;&#xB9CC; &#xC6B0;&#xB9AC;&#xAC00; &#xD604;&#xC2E4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC740; &#xD06C;&#xAE30;&#xAC00; &#xB9E4;&#xC6B0; &#xD07D;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC778; &#xC624;&#xD53C;&#xC2A4;&#xB098; &#xD50C;&#xB808;&#xC774;&#xC5B4; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC740; &#xC791;&#xAC8C;&#xB294; &#xBA87; &#xBC31; MB &#xD639;&#xC740; &#xBA87; &#xC2ED; GB&#xAE4C;&#xC9C0; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; state&#xB97C; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC313;&#xC544;&#xB098;&#xAC04;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xC138;&#xC694;. &#xCD5C;&#xC18C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD06C;&#xAE30;&#xC758; &#xBA87; &#xBC30;&#xC5D0;&#xC11C; &#xBA87; &#xBC31;&#xBC30;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xD544;&#xC694;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;.(&#xB1CC;&#xD53C;&#xC15C;) &#xC774; &#xBB38;&#xC81C;&#xB294; Symbolic Execution&#xC774; &#xC81C;&#xC548;&#xB41C; 70&#xB144;&#xB300;&#xC5D0;&#xB3C4; &#xB611;&#xAC19;&#xC774; &#xC9C0;&#xC801;&#xB410;&#xC5C8;&#xB358; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8; &#xB2F9;&#xC2DC;&#xC5D0;&#xB294; &#xC9C0;&#xAE08;&#xB9CC;&#xD07C; &#xBCF5;&#xC7A1;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC5C6;&#xC5C8;&#xC744;&#xD150;&#xB370;&#xB3C4; &#xB9D0;&#xC774;&#xC8E0;. &#xBB3C;&#xB860; &#xC9C0;&#xAE08; &#xBA54;&#xBAA8;&#xB9AC; &#xAC12;&#xC774; &#xC2F8;&#xC9C0;&#xACE0; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD50C;&#xB7AB;&#xD3FC;&#xC774; &#xC0DD;&#xAE30;&#xBA74;&#xC11C; &#xC880; &#xB354; &#xD070; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD655;&#xBCF4;&#xD558;&#xB294;&#xAC8C; &#xC26C;&#xC6CC;&#xC84C;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1;&#xAE4C;&#xC9C0;&#xB3C4; &#xC774;&#xB294; Symbolic Execution&#xC758; &#xB300;&#xD45C;&#xC801;&#xC778; &#xBB38;&#xC81C;&#xC810;&#xC73C;&#xB85C; &#xC9C0;&#xBAA9; &#xBC1B;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8;&#xB098; &#xAD6C;&#xAE00; &#xAC19;&#xC740; &#xB300;&#xAE30;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xBA87; &#xB9CC; &#xCF54;&#xC5B4;&#xC5D0; &#xBA87; &#xBC31; &#xD14C;&#xB77C;&#xBC14;&#xC774;&#xD2B8;&#xB85C; &#xB3CC;&#xB9AC;&#xACE0; &#xC788;&#xC744;&#xC9C0;&#xB3C4; &#xBAA8;&#xB974;&#xACA0;&#xC9C0;&#xB9CC;&#x2026; &#xC800; &#xAC19;&#xC740; &#xAC1C;&#xC778;&#xC774; &#xADF8;&#xB0E5; Symbolic Execution&#xC5D0;&#xB9CC; &#xC758;&#xC874;&#xD574;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xC5D4;&#xC9C4;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;&#xACE0; &#xD574;&#xB3C4;&#x2026; &#xB3CC;&#xC544;&#xAC00;&#xB3C4; &#xD6A8;&#xC728;&#xC774; &#xC548; &#xC88B;&#xACA0;&#xC8E0;&#x2026; &#xC544;&#xB9C8; &#xADF8;&#xB0E5; Dumb Fuzzing&#xC774; &#xB354; &#xBE60;&#xB97C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; &#x3160;&#x3160;</p>
</li>
<li><p>&#xCEF4;&#xD4E8;&#xD305; &#xD30C;&#xC6CC;&#xAC00; &#xBD80;&#xC871;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA54;&#xBAA8;&#xB9AC; &#xBB38;&#xC81C;&#xAC00; &#xD574;&#xACB0;&#xC774; &#xB410;&#xB2E4;&#xACE0; &#xCCD0;&#xB3C4; &#xBD84;&#xC11D;&#xD574;&#xC57C;&#xD560; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xAC00; &#xB108;&#xBB34; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0C1;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xADF8;&#xB0E5; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD560; &#xCF54;&#xB4DC;&#xB3C4; &#xC774;&#xBBF8; &#xB9CE;&#xC740;&#xB370;, &#xC774; &#xC548;&#xC5D0;&#xC11C; &#xC870;&#xAC74;&#xBD84;&#xAE30;&#xBB38;, &#xB8E8;&#xD504;&#xBB38;&#xB3C4; &#xB9CE;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xAC19;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB354;&#xB77C;&#xB3C4; &#xB2E4;&#xB978; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xD1B5;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC81C;&#xC77C; exploit&#xD558;&#xAE30; &#xC88B;&#xC740; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC774;&#xC8E0;. &#xC2EC;&#xC9C0;&#xC5B4; &#xD2B9;&#xC815; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xC5D0;&#xC11C;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xB3C4; exploit&#xD558;&#xC9C0;&#xB294; &#xBABB;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADFC;&#xB370; &#xC774;&#xB7F0; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xB97C; fork&#xAE4C;&#xC9C0; &#xD574;&#xAC00;&#xBA74;&#xC11C; &#xBAA8;&#xB4E0; state&#xB97C; &#xB2E4; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xACC4;&#xC0B0;&#xD558;&#xACE0;&#x2026; &#xC77C;&#xB2E8; CPU&#xC758; &#xCF54;&#xC5B4; &#xAC1C;&#xC218;&#xB3C4; &#xB9CE;&#xC544;&#xC57C;&#xD560; &#xAC83;&#xC774;&#xACE0; &#xC2EC;&#xC9C0;&#xC5B4; &#xBE68;&#xB77C;&#xC57C;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC;&#x2026; &#xC6B0;&#xB9AC;&#xC5D0;&#xAC8C;&#xB294; &#xB9AC;&#xC0AC;&#xC218;&#xB290;&#xB2D8;&#xC774; &#xC788;&#xB2E4;!!! &#xD0B9;&#xAC13;&#xC2A4;&#xB808;&#xB4DC;&#xB9AC;&#xD37C;&#xB85C; &#xB3CC;&#xB9AC;&#xBA74; &#xB418;&#xC9C0; &#xC54A;&#xACA0;&#xB290;&#xB0D0;!!! &#xC608;&#x2026; &#xB204;&#xAC00; &#xD568; &#xAD6C;&#xD574;&#xC8FC;&#xC2E0;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C;&#xB4E0; &#xC628;&#xBAB8;&#xC744; &#xBC14;&#xCCD0; &#xB3CC;&#xB824;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#xD5C8;&#xD5E3;&#x314E;(&#xC0DD;&#xAC01;&#xB9CC; &#xD574;&#xB3C4; &#xC88B;&#xB124;)</p>
<p><img src="/2021/07/21/j0ker/angr_part2/22HD9O4TZ2_4.jpeg" srcset="/img/loading.gif" alt="./angr_part2/22HD9O4TZ2_4.jpeg"></p>
<blockquote>
<p>&#xC774;&#xCBE4;&#xC5D0;&#xC11C; &#xC601;&#xC811;&#xD574;&#xBCF4;&#xB294; &#xB9AC;&#xC0AC;&#xC218;&#xB290;&#xB2D8;</p>
</blockquote>
</li>
<li><p>&#xC2E4;&#xD589; &#xD658;&#xACBD;&#xACFC;&#xC758; interaction&#xC740; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xC704;&#xC5D0; &#xC62C;&#xB77C;&#xAC00;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC744; &#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xD799;&#xC744; &#xD560;&#xB2F9;&#xD574;&#xC57C;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C;&#xC744; &#xBCF4;&#xB0B4;&#xC57C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC694;&#xCCAD;&#xC744; &#xD55C; &#xAC83;&#xB4E4;&#xC740; &#xCEE4;&#xB110;&#xC5D0;&#xC11C; &#xC54C;&#xC544;&#xC11C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C;&#xB294; &#xCEE4;&#xB110;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544; &#xCEE4;&#xB110;&#xB3C4; &#xBD84;&#xC11D;&#xD574;&#xBC84;&#xB9AC;&#xBA74; &#xC548;&#xB418;&#xB0D0;&#xAD6C;&#xC694;? &#xD558;&#xD558; &#xADF8;&#xB807;&#xAC8C; &#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xC774;&#xBBF8; &#xBD84;&#xC11D;&#xD560; &#xAC70;&#xB9AC;&#xAC00; &#xB9CE;&#xC740;&#xB370;&#x2026; &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;&#xC740; &#xC5B4;&#xB5A8;&#xAE4C;&#xC694;? &#xC774;&#xAC83;&#xB3C4; &#xBD84;&#xC11D;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? &#xB2F9;&#xC5F0;&#xD788; &#xC548;&#xB418;&#xACA0;&#xC8E0;. &#xC774;&#xB807;&#xAC8C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC678;&#xC801;&#xC778; &#xB300;&#xC0C1;&#xC5D0; &#xB300;&#xD55C; &#xBD84;&#xC11D;&#xC774; &#xBE60;&#xC838;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBD84;&#xC11D;&#xC744; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<h2 id="&#xD55C;&#xACC4;&#xC810;-&#xBCF4;&#xC644;"><a href="#&#xD55C;&#xACC4;&#xC810;-&#xBCF4;&#xC644;" class="headerlink" title="&#xD55C;&#xACC4;&#xC810; &#xBCF4;&#xC644;"></a>&#xD55C;&#xACC4;&#xC810; &#xBCF4;&#xC644;</h2><p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; Symbolic Execution&#xC740; &#xB9AC;&#xC5BC;&#xC6D4;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC4F8;&#xBAA8; &#xC5C6;&#xB294; &#xAC83; &#xC77C;&#xAE4C;&#xC694;? &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC774;&#xB807;&#xAC8C; &#xC598;&#xAE30;&#xD558;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xACA0;&#xC8E0; &#x314B;&#x314B; &#xB9E8; &#xC55E;&#xC5D0; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xAE30;&#xBC95;&#xB4E4;&#xC774; &#xC11C;&#xB85C;&#xC758; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xBA74;&#xC11C; &#xD65C;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xCC98;&#xB7FC; Symbolic Execution &#xC5ED;&#xC2DC; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD574;&#xC904; &#xC218; &#xC788;&#xB294; &#xAE30;&#xBC95;&#xB4E4;&#xACFC; &#xAC19;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Concolic-Execution"><a href="#Concolic-Execution" class="headerlink" title="Concolic Execution"></a>Concolic Execution</h3><p>&#xB300;&#xD45C;&#xC801;&#xC778;&#xAC8C; &#xBC14;&#xB85C; Concolic Execution&#xC785;&#xB2C8;&#xB2E4;. Concolic&#xC740; Concrete + Symbolic&#xC744; &#xD569;&#xCE5C; &#xD569;&#xC131;&#xC5B4;&#xB85C; Concrete Execution&#xACFC; Symbolic Execuition&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. Concrete Execution&#xC740; Symbolic Execution&#xACFC; &#xBC18;&#xB300;&#xB85C; &#xBBF8;&#xC9C0;&#xC218;&#xAC00; &#xC544;&#xB2CC; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xAC12;&#xC744; &#xC778;&#xD48B;&#xC73C;&#xB85C; &#xC8FC;&#xACE0; &#xC2E4;&#xD589; &#xACFC;&#xC815;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774; &#xB450; &#xAE30;&#xBC95;&#xC744; &#xD569;&#xCCD0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xAE30;&#xC874; Symbolic Store $\sigma$&#xC5D0; Concrete &#xAC12;&#xC774; &#xCD94;&#xAC00;&#xB429;&#xB2C8;&#xB2E4;. Concrete &#xAC12;&#xC744; &#xB123;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; &#xD2B9;&#xC815; &#xBD84;&#xAE30;&#xB85C; &#xBE60;&#xC9C0;&#xB294; &#xAC12;(Statisfiable&#xD55C; &#xAC12;)&#xC744; &#xBBF8;&#xB9AC; &#xC54C;&#xC544;&#xB0B4;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; SMT solver&#xC758; &#xACC4;&#xC0B0; &#xC5C6;&#xC774; &#xD574;&#xB2F9; &#xC2E4;&#xD589; &#xACBD;&#xB85C;&#xC5D0; &#xC880; &#xB354; &#xBE68;&#xB9AC; &#xC9C4;&#xC785;&#xD560; &#xC218; &#xC788;&#xB294; &#xC7A5;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC678;&#xC5D0;&#xB3C4; &#xC120;&#xBCC4;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xACBD;&#xB85C; &#xBD84;&#xC11D;&#xC774;&#xB77C;&#xB358;&#xAC00; fuzzing&#xACFC; &#xAC19;&#xC774; &#xD65C;&#xC6A9;&#xD55C;&#xB2E4;&#xB358;&#xAC00; &#xC5EC;&#xB7EC; &#xD65C;&#xC6A9; &#xAE30;&#xBC95;&#xB4E4;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1;&#xC740; &#xB354; &#xACF5;&#xBD80;&#xD574;&#xC57C;&#xD560; &#xBD80;&#xBD84;&#xB4E4;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB098;&#xC911;&#xC5D0; &#xB610; &#xB2E4;&#xB904;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="Symbolic-Execution-&#xACFC;&#xC815;&#xC5D0;&#xC11C;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740;-&#xC2E4;&#xD589;&#xB418;&#xC9C0;-&#xC54A;&#xB294;&#xB2E4;"><a href="#Symbolic-Execution-&#xACFC;&#xC815;&#xC5D0;&#xC11C;-&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740;-&#xC2E4;&#xD589;&#xB418;&#xC9C0;-&#xC54A;&#xB294;&#xB2E4;" class="headerlink" title="Symbolic Execution &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;"></a>Symbolic Execution &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;</h1><p>&#xCC98;&#xC74C;&#xC5D0; &#xC81C;&#xAC00; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xC758;&#xBB38;&#xC810;&#xC744; &#xC774;&#xC81C;&#xB294; &#xD480; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. Symbolic Execution &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xCF54;&#xB4DC;&#xB9CC; &#xBD84;&#xC11D;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC774;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xB85C;&#xB354;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB9E4;&#xD551;&#xD558;&#xACE0;, &#xD504;&#xB85C;&#xC138;&#xC2A4; ID&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, CPU&#xC5D0; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xC5EC; &#xAE30;&#xACC4;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Symbolic Execution &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7F0; &#xC77C;&#xB828;&#xC758; &#xACFC;&#xC815;&#xC5C6;&#xC774; &#xC5D4;&#xC9C4;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xCF54;&#xB4DC;&#xB97C; &#xC5D4;&#xC9C4;&#xC774; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC26C;&#xC6B4; IL(Intermediate language)&#xB85C; &#xBC14;&#xAFB8;&#xC5B4; &#xC704;&#xC5D0;&#xC11C; &#xC598;&#xAE30;&#xD55C; &#xC77C;&#xB828;&#xC758; &#xC791;&#xC5C5;&#xB4E4;&#xC744; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. CPU&#xAC00; &#xC2E4;&#xC7AC;&#xB85C; &#xAE30;&#xACC4;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xC544;&#xB2C8;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB9E4;&#xD551;&#xB418;&#xC9C0;&#xB3C4; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. IDA&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xB418;&#xACA0;&#xB124;&#xC694;. </p>
<h1 id="Part-2-&#xB9C8;&#xBB34;&#xB9AC;"><a href="#Part-2-&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="Part 2 &#xB9C8;&#xBB34;&#xB9AC;"></a>Part 2 &#xB9C8;&#xBB34;&#xB9AC;</h1><p>&#xC0AC;&#xC2E4; Symbolic Execution&#xC744; &#xACF5;&#xBD80;&#xD574;&#xC57C;&#xACA0;&#xB2E4;&#xB77C;&#xACE0; &#xCC98;&#xC74C; &#xC0DD;&#xAC01;&#xD588;&#xC744; &#xB54C;, &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xBB54;&#xC9C0;&#xB294; &#xC54C;&#xC544;&#xC11C; &#xC815;&#xB9AC;&#xD558;&#xB294;&#xAC8C; &#xBB50; &#xADF8;&#xB807;&#xAC8C; &#xC5B4;&#xB835;&#xACA0;&#xC5B4;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xD558; &#xC5ED;&#xC2DC; &#xBB34;&#xC2DD;&#xD558;&#xBA74; &#xC6A9;&#xAC10;&#xD558;&#xB2E4;&#xACE0; &#xBB34;&#xC791;&#xC815; &#xB6F0;&#xC5B4;&#xB4E4;&#xC5C8;&#xB2E4;&#xAC00; &#xB4A4;&#xC9C0;&#xAC8C; &#xCCD0;&#xB9DE;&#xC558;&#xB124;&#xC694;. &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080;&#xAC74;&#xB370; &#xC815;&#xB9D0; &#xACF5;&#xBD80;&#xD560; &#xB0B4;&#xC6A9;&#xC774; &#xB9CE;&#xC740;&#xAC70; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB294; &#xC640;&#xC911;&#xC5D0;&#xB3C4; &#xC774;&#xAC70; &#xC880; &#xB354; &#xACF5;&#xBD80;&#xD560;&#xAC78; &#xC800;&#xAC70; &#xC880; &#xB354; &#xACF5;&#xBD80;&#xD560;&#xAC78; &#xD558;&#xB294; &#xC544;&#xC26C;&#xC6C0;&#xC774; &#xC880; &#xB0A8;&#xC544;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC2DC;&#xAC04;&#xC740; &#xC81C;&#xD55C;&#xB418;&#xC5B4; &#xC788;&#xACE0;&#x2026; &#xAE00;&#xC740; &#xC62C;&#xB824;&#xC57C;&#xD558;&#xACE0;&#x2026; &#xC7A0;&#xC744; &#xC880; &#xB354; &#xC904;&#xC5EC;&#xC11C; &#xACF5;&#xBD80; &#xC880; &#xB354; &#xD558;&#xACE0;&#x2026; &#xD574;&#xC57C;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xB2E4;&#xC74C; &#xD3B8;&#xC744; &#xC4F0;&#xAE30; &#xC704;&#xD574; &#xB610; &#xACF5;&#xBD80;&#xD558;&#xB7EC; &#xAC00;&#xC57C;&#xACA0;&#xB124;&#xC694;&#x2026; &#xADFC;&#xB370; &#xB098; &#xB2E4;&#xC74C; &#xAE00; &#xC62C;&#xB9B4; &#xC218; &#xC788;&#xACA0;&#xC9C0;&#x2026;?</p>
<p><img src="/2021/07/21/j0ker/angr_part2/5h1k8f.jpg" srcset="/img/loading.gif" alt="./angr_part2/5h1k8f.jpg"></p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><ol>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://arxiv.org/pdf/1610.00502.pdf">A Survey of Symbolic Execution Techniques</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.hahwul.com/2017/06/19/hacking-symbolic-executionsymbolic/">[HACKING] Symbolic Execution(symbolic evaluation)&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/pwnbatman-joker/awesome-symbolic-execution">Awesome Symbolic Execution</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.lazenca.net/pages/viewpage.action?pageId=6324534">03.Symbolic execution(feat.Concrete execution)</a></li>
<li><a target="_blank" rel="external nofollow noopener noreferrer" href="http://rosaec.snu.ac.kr/meet/file/20110626o2.pdf">SAT/SMT tutorial SMT &#xD574;&#xACB0;&#xAE30; &#xB0B4;&#xBD80;</a></li>
</ol>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/angr/">angr</a>
                  
                  <a class="hover-with-bg" href="/tags/exploit/">exploit</a>
                  
                  <a class="hover-with-bg" href="/tags/j0ker/">j0ker</a>
                  
                  <a class="hover-with-bg" href="/tags/symbolic-execution/">symbolic_execution</a>
                  
                  <a class="hover-with-bg" href="/tags/newbie/">newbie</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_j0ker.jpg" srcset="/img/loading.gif" alt="j0ker">
                  </div>

                  <div class="link-text">
                    <div class="link-title">j0ker</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/j0ker">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/07/22/idioth/2021-07-22/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] Data Exfiltration with LOLBins</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/07/20/l0ch/2021-07-20/">
                    <span class="hidden-mobile">[] CVE-2021-22555: Linux Kernel - Netfilter  OOB Write </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/07/21/j0ker/angr_part2/';
        this.page.identifier = '/2021/07/21/j0ker/angr_part2/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]  angr  - (2) Symbolic Execution&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
