

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;Arbitrary Write NULL&amp;#x201D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#x201C;HEVD-(Hacksys Extreme Vulnerable Driver)&amp;#x201D;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;LPE - (Local Privilege Escalation : &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;)&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#x201C;NtQuerySystemInformation&amp;#x201D; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2EC;&amp;#xB3C4; &amp;#xC788;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD754;&amp;#xD788; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#x201C;Arbitrary Write NULL&amp;#x201D;(&amp;#xC784;&amp;#xC758; NULL &amp;#xC4F0;&amp;#xAE30;) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; exploit&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBC0F; &amp;#xAE30;&amp;#xB2A5;&amp;#xC801; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C;, &amp;#x201C;HEVD IOCTL&amp;#x201D; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xC815; &amp;#xBC0F; &amp;#xC124;&amp;#xCE58; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; write-up&amp;#xC740; &amp;#xCD5C;&amp;#xC885; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC558;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;! =)&lt;/p&gt;
&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC774; &amp;#xBB54;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#x201C;cmd.exe&amp;#x201D;&amp;#xC758; &amp;#x201C;ring3 (user-land)&amp;#x201D; &amp;#xC138;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;LPE&amp;#x201D;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C;, &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC740; &amp;#x201C;Arbitrary Write&amp;#x201D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC720;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC804;&amp;#xC790;&amp;#xB294; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC5D0; &amp;#x201C;write&amp;#x2192;[0x00000000]&amp;#x201D; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0;, &amp;#xD6C4;&amp;#xC790;&amp;#xB294; &amp;#x201C;Write-What-Where&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; &amp;#x201C;write &amp;#x2192; [0xdeadbeef]&amp;#x201D;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#x201C;0x00000000&amp;#x201D; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#x201C;0xdeadbeef&amp;#x201D;&amp;#xB85C; overflow&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; HEVD &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD574;&amp;#xBD80;&amp;#xD558;&amp;#xACE0; &amp;#xBB34;&amp;#xC2A8;&amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;HEVD-TriggerWriteNull&#34;&gt;&lt;a href=&#34;#HEVD-TriggerWriteNull&#34; class=&#34;headerlink&#34; title=&#34;[HEVD]-TriggerWriteNull&#34;&gt;&lt;/a&gt;[HEVD]-TriggerWriteNull&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;HEVD - &lt;a href=&#34;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver&#34;&gt;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;TriggerWriteNULL&lt;/code&gt;&amp;#xB294; kernel user-buffer&amp;#xB97C; &amp;#xD578;&amp;#xB4E4;&amp;#xD558;&amp;#xACE0; ring3(user-land)&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;ifdef SECURE&amp;#x201D; (&amp;#xBB3C;&amp;#xB860; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;)&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74;, &amp;#x201C;probeForWrite()&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xB294; user input buffer&amp;#xAC00; &amp;#x201C;ring3&amp;#x201D;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD574; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xC11D;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC5EC;&amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#x201C;#ifdef SUCURE&amp;#x201D; bit set&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xBA74; &amp;#x201C;[edi]&amp;#x201D; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#x201C;[ebx]&amp;#x201D;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#x201C;0x00000000&amp;#x201D;&amp;#xC73C;&amp;#xB85C; overflow&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IOCTL drive &amp;#xC5F0;&amp;#xACB0;&amp;#xC740; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; , &amp;#xCCAB; user-buffer&amp;#xC758; &amp;#xCCAB; 4 byte &amp;#x201C;(shellcode_ptr)&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#x201C;0x00000000&amp;#x201D;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; break point&amp;#xC5D0; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#x201C;[edi]&amp;#x201D;&amp;#xAC00; user-buffer&amp;#xC758; &amp;#xC8FC;&amp;#xC18C; &amp;#x201C;(shellcode_ptr &amp;#x2192; 0x00500000)&amp;#x201D;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;shellcode&amp;#x201D;&amp;#xB294; &amp;#x201C;LPE&amp;#x201D;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#x201C;x86 &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB; &amp;#x201C;4 bytes&amp;#x201D;&amp;#xC5D0;&amp;#xB294; &amp;#xC800;&amp;#xD76C; &amp;#x201C;shellcode&amp;#x201D;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#x201C;0xa16460cc&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ebx=0x00000000&amp;#xAC00; &amp;#xC800;&amp;#xD76C; user-buffer eax=0xa16460cc&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xC5EC; &amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC8C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBD84;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;&amp;#xC21C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x201C;(ring3)&amp;#x201D;&amp;#xB85C;&amp;#xC11C; &amp;#xC544;&amp;#xBB34; &amp;#xC8FC;&amp;#xC18C;&amp;#xB098; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC5D0; &amp;#x201C;NULL&amp;#x201D;&amp;#xC744; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, LPE&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? DACL&amp;#xACFC; Security Description&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;DACL-amp-Security-Description&#34;&gt;&lt;a href=&#34;#DACL-amp-Security-Description&#34; class=&#34;headerlink&#34; title=&#34;DACL &amp;amp; Security Description&#34;&gt;&lt;/a&gt;DACL &amp;amp; Security Description&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;DACL&amp;#x201D;&amp;#xACFC; &amp;#x201C;Security Description&amp;#x201D;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC744; exploit &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://networkencyclopedia.com/discretionary-access-control-list-dacl/&#34;&gt;https://networkencyclopedia.com/discretionary-access-control-list-dacl/&lt;/a&gt; &amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;What is DACL (Discretionary Access Control List)? A DACL stands for Discretionary Access Control List, in Microsoft Windows family, is an internal list attached to an object in Active Directory that specifies which users and groups can access the object and what kinds of operations they can perform on the object. In Windows 2000 and Windows NT, an internal list attached to a file or folder on a volume formatted using the NTFS that has a similar function. How DACL works? In Windows, each object in Active Directory or a local NTFS volume has an attribute called Security Descriptor that stores information about The object&amp;#x2019;s owner (the security identifier or the owner) and the groups to which the owner belongs. The discretionary access control list (DACL) of the object, which lists the security principals (users, groups, and computers) that have access to the object and their level of access. The system access control list (SACL), which lists the security principals that should trigger audit events when accessing the list&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C;, &amp;#x201C;DACL&amp;#x201D;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#x201C;Security Description&amp;#x201D; (&amp;#xC870;&amp;#xAE08; &amp;#xC774;&amp;#xB530;&amp;#xAC00; &amp;#xAE4A;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB8F0;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;, &amp;#xADF8;&amp;#xB8F9; &amp;#xB610;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;(&amp;#xD30C;&amp;#xC77C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC; &amp;#xB4F1;)&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB098;&amp;#xC694;? &amp;#x201C;Window UI&amp;#x201D;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. =)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xC774; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xC880; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#x201C;DACL &amp;amp; Security Description&amp;#x201D;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0;&amp;#xAC8C; &amp;#xC65C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0;&amp;#xB294; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#x201C;DACL&amp;#x201D;&amp;#xC758; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xBC1B;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x201C;Windows Internals&amp;#x201D;&amp;#xC640; &amp;#x201C;structs&amp;#x201D;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;WinDBG&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;WinDBG&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; windows &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC12;&amp;#xC744; &amp;#xBE7C;&amp;#xBA74;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD328;&amp;#xD134;&amp;#xC740; &amp;#xAC16;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;0x856117c8&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; windows &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xC758; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC774;&amp;#xB984;, &amp;#xAD8C;&amp;#xD55C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; ID, &amp;#xD578;&amp;#xB4E4; &amp;#xB4F1;)&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC720;&amp;#xC2EC;&amp;#xD788; &amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#x201C;nt!_OBJECT_HEADER struct&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;nt!_OBJECT_HEADER&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; header&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#x201C;nt!_OBJECT_HEADER struct&amp;#x201D;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xBD80;&amp;#xD574; &amp;#xBCFC;&amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xAC01; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD574; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#x201C;nt!_OBJECT_HEADER&amp;#x201D;&amp;#xB294; &amp;#x201C;nt!_ERPOCESS&amp;#x201D;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; offset&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Security Description&amp;#xC5D0;&amp;#xC120; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xC774;&amp;#xB904;&amp;#xC9C8;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Security Description &amp;#x201C;(0x85117b0 + 0x014)&amp;#x201D;&amp;#xC774; &amp;#x201C;0x8c005e1f&amp;#x201D;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#x201C;DACL &amp;amp; Security Description&amp;#x201D;&amp;#xACFC; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC6B0;&amp;#xC120; &amp;#x201C;0x8c005e1f&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC880; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SecurityDescription &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#x201C;!sd&amp;#x201D; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; bit &amp;#xACC4;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; Windows Internals&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xAC12;&amp;#xB4E4;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xC720;&amp;#xC800; &amp;#xC815;&amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; DACL &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#x201C;SYSTEM&amp;#x201D;&amp;#xACFC; &amp;#x201C;DAML&amp;#x201D; &amp;#xC720;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; SecurityDescription &amp;#x201C;(Windows Internals)&amp;#x201D;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; (&amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC;) &amp;#xC704; &amp;#xB450; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#x201C;ring0 (kernel)&amp;#x201D; &amp;#xC8FC;&amp;#xC18C; &amp;#xC5B4;&amp;#xB514;&amp;#xB4E0; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD55C;&amp;#xCC44;&amp;#xB85C; SecurityDescription &amp;#xC8FC;&amp;#xC18C; &amp;#x201C;(0x865117b0+0x014)&amp;#x201D;&amp;#xB97C; &amp;#x201C;NULL (0x00000000)&amp;#x201D;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F0;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SecurityDescription&amp;#xC740; 0x8c005e1f&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SecurityDescription &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; NULL&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC501;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC790;! &amp;#xC774;&amp;#xC81C; &amp;#x201C;System.exe (PID:4)&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; SecurityDescriptor &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#x201C;VM snapshot&amp;#x201D;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD639;&amp;#xC2DC;&amp;#xB098; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC2E4;&amp;#xAE4C;&amp;#xBD10; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x201C;[system]&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xC2DC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC368;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;DCOM server &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB7F0;&amp;#xCC98;&amp;#xAC00; crash &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xC2DC;&amp;#xB9CC;, &amp;#xBB34;&amp;#xC2A8;&amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C;&amp;#xAC70;&amp;#xC8E0;? [System.exe] &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C;, &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;, &amp;#xC791;&amp;#xC5C5;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC5D0;&amp;#xC11C; &amp;#xC885;&amp;#xB8CC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;! &amp;#xC624;&amp;#xC9C1; &amp;#x201C;nt authority/SYSTEM&amp;#x201D;&amp;#xB9CC;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD560; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;BSOD&amp;#x201D;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xCF30;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; SecurityDescription &amp;#xB3D9;&amp;#xC791;&amp;#xC744; NULL&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xBA85;&amp;#xD55C;(well-known) exploit &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xAD8C;&amp;#xD55C; bit&amp;#xC744; &amp;#xC5C6;&amp;#xC5D0; &amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; exploit&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SecurityDescription&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC9C0;&amp;#xC6CC; &amp;#x201C;&amp;#xB204;&amp;#xAD6C;&amp;#xB098;&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0;, &amp;#xC77D;&amp;#xACE0;, &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Exploit&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370;, &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;SYSTEM&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB294; WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;ring0 (kernel mode)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC5F4;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xACFC; &amp;#xC608;&amp;#xCE21;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC78A;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC548;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;Windows 7&amp;#x201D;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#x201C;(Address Space Layout Randomization: ASLR)&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xAC00; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC774;&amp;#xC820; &amp;#xC5B4;&amp;#xCA50;&amp;#xB2E4;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;NtQuerySystemInformation-Handle-Leaking-Attack&#34;&gt;&lt;a href=&#34;#NtQuerySystemInformation-Handle-Leaking-Attack&#34; class=&#34;headerlink&#34; title=&#34;NtQuerySystemInformation - Handle Leaking Attack&#34;&gt;&lt;/a&gt;NtQuerySystemInformation - Handle Leaking Attack&lt;/h1&gt;&lt;p&gt;&amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB9D0;&amp;#xD588;&amp;#xB4DC;&amp;#xC2DC;, &amp;#xD604;&amp;#xC7AC; &amp;#xD0C0;&amp;#xAC9F; OS (windows 7)&amp;#xC73C;&amp;#xB860; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; exploit&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xB2F5;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#x201C;NtQuerySystemInformation WinAPI call&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC740; &amp;#xC124;&amp;#xACC4;&amp;#xC0C1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xACB0;&amp;#xD568;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x201C;&amp;#xAE30;&amp;#xB2A5;&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;WinAPI call&amp;#x201D;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC740; user call(undocumented behavior)&amp;#xC744; &amp;#xC218;&amp;#xB77D;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;,  ring0 &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD30C;&amp;#xC2F1;&amp;#xB418;&amp;#xC11C; SYSTEM &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC798; &amp;#xC54C; &amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB7F0; &amp;#x201C;WinAPI Call&amp;#x201D;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB178;&amp;#xCD9C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC720;&amp;#xBA85;&amp;#xD55C;(well-known) &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ring3&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xC8E0;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC6B0;&amp;#xC120; &amp;#x201C;handle&amp;#x201D;&amp;#xC758; &amp;#xC815;&amp;#xC758;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC65C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://stackoverflow.com/questions/902967/what-is-a-windows-handle&#34;&gt;https://stackoverflow.com/questions/902967/what-is-a-windows-handle&lt;/a&gt; &amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;It&amp;#x2019;s an abstract reference value to a resource, often memory or an open file, or a pipe.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Properly, in Windows, (and generally in computing) a handle is an abstraction which hides a real memory address from the API user, allowing the system to reorganize physical memory transparently to the program. Resolving a handle into a pointer locks the memory, and releasing the handle invalidates the pointer. In this case think of it as an index into a table of pointers&amp;#x2026; you use the index for the system API calls, and the system can change the pointer in the table at will.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Alternatively a real pointer may be given as the handle when the API writer intends that the user of the API be insulated from the specifics of what the address returned points to; in this case it must be considered that what the handle points to may change at any time (from API version to version or even from call to call of the API that returns the handle) &amp;#x2014; the handle should therefore be treated as simply an opaque value meaningful only to the API.&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#x201C;handle&amp;#x201D;&amp;#xC740; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xAC1D;&amp;#xCCB4;(&amp;#xD30C;&amp;#xC77C;, api, pipe &amp;#xB4F1;) &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC18D;&amp;#xC131;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; handle&amp;#xB4E4;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9D0; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC788;&amp;#xB294; &amp;#xC810;&amp;#xC740;, &amp;#x201C;handle&amp;#x201D;&amp;#xC740; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; load&amp;#xD558;&amp;#xACE0; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC740; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; call&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC6B0;&amp;#xB108;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#x201C;SystemExtendedHandleInformation&amp;#x201D;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; struct&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SYSTEM_HANDLE_TABLE_ENTRY_INFO&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SYSTEM_HANDLE_INFORMATION&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; struct&amp;#xB294; &amp;#x201C;handle &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#x201D;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xACC4;&amp;#xC0C1;&amp;#xC758; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#x201C;ring3 (user-mode)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; handle data&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xBB34;&amp;#xC2A8; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;handle data&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/26.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; handle&amp;#xC744; &amp;#xB8E8;&amp;#xD504;&amp;#xB85C; &amp;#xB3CC;&amp;#xBA70; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; ring3&amp;#xC5D0;&amp;#xC11C; PID:4&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xB3C4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD639;&amp;#xC2DC; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#x201D;&amp;#xC640; &amp;#xC544;&amp;#xC8FC; &amp;#xBC00;&amp;#xC811;&amp;#xD55C; &amp;#xAD00;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;ASLR&amp;#x201D;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xC5D0; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#x201D; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC8FC;&amp;#xC18C;, PID &amp;#xBC0F; Handle &amp;#xAC12;&amp;#xC774; &amp;#xC62C;&amp;#xBC14;&amp;#xB978;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC9C8;&amp;#xBB38;&amp;#xC758; &amp;#xB2F5;&amp;#xC740;: &amp;#x201C;&amp;#xC800;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;!&amp;#x201D;&lt;/p&gt;
&lt;p&gt;&amp;#xC4F8;&amp;#xB9CC;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; handle&amp;#xC744; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#x201C;lsass.exe PID&amp;#x201D;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB34;&amp;#xC791;&amp;#xC815; handle&amp;#xC744; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xAC00; crash&amp;#xB098;&amp;#xACE0; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xAD8C;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;lsass.exe&amp;#x201D;&amp;#xC758; handle&amp;#xB9CC;&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#x201D;&amp;#xC5D0; &amp;#x201C;&amp;#xB204;&amp;#xAD6C;&amp;#xB098;&amp;#x201D; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC820; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#x201C;Shellcode Injection&amp;#x201D;&amp;#xC744; &amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/32.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;nt authority/SYSTEM cmd.exe shell&amp;#x201D;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xACE0; &amp;#xC774;&amp;#xC288;&amp;#xC5C6;&amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;Final Exploit link:&lt;a href=&#34;https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL&#34;&gt;https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL&lt;/a&gt; References:&lt;a href=&#34;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h&#34;&gt;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h&lt;/a&gt; &lt;a href=&#34;https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs&#34;&gt;https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs&lt;/a&gt; &lt;a href=&#34;http://bprint.rewolf.pl/bprint/?p=1683&#34;&gt;http://bprint.rewolf.pl/bprint/?p=1683&lt;/a&gt; &lt;a href=&#34;https://github.com/ZecOps/CVE-2020&amp;#x2013;0796-LPE-POC/blob/master/poc.py&#34;&gt;https://github.com/ZecOps/CVE-2020&amp;#x2013;0796-LPE-POC/blob/master/poc.py&lt;/a&gt; &lt;a href=&#34;https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/&#34;&gt;https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Translation] HackSys Extreme Vulnerable Driver â€” Arbitrary Write NULL (New Solution) - hackyboiz">
  <meta property="og:description" content="&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;Arbitrary Write NULL&amp;#x201D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#x201C;HEVD-(Hacksys Extreme Vulnerable Driver)&amp;#x201D;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;LPE - (Local Privilege Escalation : &amp;#xB85C;&amp;#xCEEC; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9;)&amp;#xC744; &amp;#xB2EC;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#x201C;NtQuerySystemInformation&amp;#x201D; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xCF5C; &amp;#xACF5;&amp;#xACA9; &amp;#xAE30;&amp;#xC220;&amp;#xC744; &amp;#xC2EC;&amp;#xB3C4; &amp;#xC788;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xB824;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xAE00;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xD754;&amp;#xD788; &amp;#xB4F1;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#x201C;Arbitrary Write NULL&amp;#x201D;(&amp;#xC784;&amp;#xC758; NULL &amp;#xC4F0;&amp;#xAE30;) &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; exploit&amp;#xD558;&amp;#xB294; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131; &amp;#xBC0F; &amp;#xAE30;&amp;#xB2A5;&amp;#xC801; &amp;#xBC29;&amp;#xBC95;&amp;#xB860;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB610;&amp;#xD55C;, &amp;#x201C;HEVD IOCTL&amp;#x201D; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xCEE4;&amp;#xB110; &amp;#xB514;&amp;#xBC84;&amp;#xAE45; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xC815; &amp;#xBC0F; &amp;#xC124;&amp;#xCE58; &amp;#xACFC;&amp;#xC815;&amp;#xC740; &amp;#xC0DD;&amp;#xB7B5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; write-up&amp;#xC740; &amp;#xCD5C;&amp;#xC885; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB2E4;&amp;#xB978; &amp;#xC0AC;&amp;#xB78C;&amp;#xC758; &amp;#xC601;&amp;#xD5A5;&amp;#xC744; &amp;#xBC1B;&amp;#xC558;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xBD88;&amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xC81C;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB178;&amp;#xB825;&amp;#xC744; &amp;#xD588;&amp;#xB294;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC7AC;&amp;#xBC0C;&amp;#xAC8C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC8FC;&amp;#xC138;&amp;#xC694;! =)&lt;/p&gt;
&lt;h1 id=&#34;Introduction&#34;&gt;&lt;a href=&#34;#Introduction&#34; class=&#34;headerlink&#34; title=&#34;Introduction&#34;&gt;&lt;/a&gt;Introduction&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC774; &amp;#xBB54;&amp;#xC9C0;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC774;&amp;#xC57C;&amp;#xAE30;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#x201C;cmd.exe&amp;#x201D;&amp;#xC758; &amp;#x201C;ring3 (user-land)&amp;#x201D; &amp;#xC138;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xBD80;&amp;#xD130; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xCEE4;&amp;#xB110;&amp;#xC758; &amp;#xAD00;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;LPE&amp;#x201D;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C;, &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC740; &amp;#x201C;Arbitrary Write&amp;#x201D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC720;&amp;#xC0AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC28;&amp;#xC774;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC804;&amp;#xC790;&amp;#xB294; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC5D0; &amp;#x201C;write&amp;#x2192;[0x00000000]&amp;#x201D; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xACE0;, &amp;#xD6C4;&amp;#xC790;&amp;#xB294; &amp;#x201C;Write-What-Where&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xBA85;&amp;#xC2DC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989; &amp;#x201C;write &amp;#x2192; [0xdeadbeef]&amp;#x201D;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD589;&amp;#xC704;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD574; &amp;#x201C;0x00000000&amp;#x201D; &amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &amp;#xD2B9;&amp;#xC815; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#x201C;0xdeadbeef&amp;#x201D;&amp;#xB85C; overflow&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; HEVD &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD574;&amp;#xBD80;&amp;#xD558;&amp;#xACE0; &amp;#xBB34;&amp;#xC2A8;&amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;HEVD-TriggerWriteNull&#34;&gt;&lt;a href=&#34;#HEVD-TriggerWriteNull&#34; class=&#34;headerlink&#34; title=&#34;[HEVD]-TriggerWriteNull&#34;&gt;&lt;/a&gt;[HEVD]-TriggerWriteNull&lt;/h1&gt;&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/1.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;HEVD - &lt;a href=&#34;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver&#34;&gt;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;TriggerWriteNULL&lt;/code&gt;&amp;#xB294; kernel user-buffer&amp;#xB97C; &amp;#xD578;&amp;#xB4E4;&amp;#xD558;&amp;#xACE0; ring3(user-land)&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xB294; &amp;#xD568;&amp;#xC218;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;ifdef SECURE&amp;#x201D; (&amp;#xBB3C;&amp;#xB860; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;)&amp;#xB97C; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74;, &amp;#x201C;probeForWrite()&amp;#x201D; &amp;#xD568;&amp;#xC218;&amp;#xB294; user input buffer&amp;#xAC00; &amp;#x201C;ring3&amp;#x201D;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD574; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;&amp;#xBA74; &amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xC785;&amp;#xB825; &amp;#xBC84;&amp;#xD37C;&amp;#xB97C; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC8FC;&amp;#xC11D;&amp;#xC5D0; &amp;#xC4F0;&amp;#xC5EC;&amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#x201C;#ifdef SUCURE&amp;#x201D; bit set&amp;#xC774; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &amp;#xCEF4;&amp;#xD30C;&amp;#xC77C;&amp;#xB418;&amp;#xBA74; &amp;#x201C;[edi]&amp;#x201D; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xAC00; &amp;#x201C;[ebx]&amp;#x201D;&amp;#xC5D0; &amp;#xC758;&amp;#xD574; &amp;#x201C;0x00000000&amp;#x201D;&amp;#xC73C;&amp;#xB85C; overflow&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;IOCTL drive &amp;#xC5F0;&amp;#xACB0;&amp;#xC740; &amp;#xBBF8;&amp;#xB9AC; &amp;#xC815;&amp;#xC758;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; , &amp;#xCCAB; user-buffer&amp;#xC758; &amp;#xCCAB; 4 byte &amp;#x201C;(shellcode_ptr)&amp;#x201D;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD14C;&amp;#xC2A4;&amp;#xD2B8; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#x201C;0x00000000&amp;#x201D;&amp;#xC73C;&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC801;&amp;#xC808;&amp;#xD55C; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; break point&amp;#xB97C; &amp;#xAC78;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xACE0; break point&amp;#xC5D0; &amp;#xAC78;&amp;#xB9AC;&amp;#xBA74; &amp;#x201C;[edi]&amp;#x201D;&amp;#xAC00; user-buffer&amp;#xC758; &amp;#xC8FC;&amp;#xC18C; &amp;#x201C;(shellcode_ptr &amp;#x2192; 0x00500000)&amp;#x201D;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;shellcode&amp;#x201D;&amp;#xB294; &amp;#x201C;LPE&amp;#x201D;&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#x201C;x86 &amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB9AC;&amp;#x201D; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xB2F4;&amp;#xACA8;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCAB; &amp;#x201C;4 bytes&amp;#x201D;&amp;#xC5D0;&amp;#xB294; &amp;#xC800;&amp;#xD76C; &amp;#x201C;shellcode&amp;#x201D;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xB2F4;&amp;#xACA8; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC77C;&amp;#xB2E8; &amp;#xC774; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC740; &amp;#xBB34;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0; &amp;#x201C;0xa16460cc&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. ebx=0x00000000&amp;#xAC00; &amp;#xC800;&amp;#xD76C; user-buffer eax=0xa16460cc&amp;#xC758; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC4F0;&amp;#xC5EC; &amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC8C; &amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C;&amp;#xC758; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &amp;#xBD84;&amp;#xBA85;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;&amp;#xC21C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x201C;(ring3)&amp;#x201D;&amp;#xB85C;&amp;#xC11C; &amp;#xC544;&amp;#xBB34; &amp;#xC8FC;&amp;#xC18C;&amp;#xB098; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xBA74; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB97C; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC758;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC5D0; &amp;#x201C;NULL&amp;#x201D;&amp;#xC744; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, LPE&amp;#xB97C; &amp;#xB2EC;&amp;#xC131;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574;&amp;#xC120; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD574;&amp;#xC57C; &amp;#xD560;&amp;#xAE4C;&amp;#xC694;? DACL&amp;#xACFC; Security Description&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;DACL-amp-Security-Description&#34;&gt;&lt;a href=&#34;#DACL-amp-Security-Description&#34; class=&#34;headerlink&#34; title=&#34;DACL &amp;amp; Security Description&#34;&gt;&lt;/a&gt;DACL &amp;amp; Security Description&lt;/h1&gt;&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;DACL&amp;#x201D;&amp;#xACFC; &amp;#x201C;Security Description&amp;#x201D;&amp;#xC774; &amp;#xBB34;&amp;#xC5C7;&amp;#xC774;&amp;#xACE0; &amp;#x201C;Arbitrary Write NULL&amp;#x201D;&amp;#xC744; exploit &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC4F0;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://networkencyclopedia.com/discretionary-access-control-list-dacl/&#34;&gt;https://networkencyclopedia.com/discretionary-access-control-list-dacl/&lt;/a&gt; &amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;What is DACL (Discretionary Access Control List)? A DACL stands for Discretionary Access Control List, in Microsoft Windows family, is an internal list attached to an object in Active Directory that specifies which users and groups can access the object and what kinds of operations they can perform on the object. In Windows 2000 and Windows NT, an internal list attached to a file or folder on a volume formatted using the NTFS that has a similar function. How DACL works? In Windows, each object in Active Directory or a local NTFS volume has an attribute called Security Descriptor that stores information about The object&amp;#x2019;s owner (the security identifier or the owner) and the groups to which the owner belongs. The discretionary access control list (DACL) of the object, which lists the security principals (users, groups, and computers) that have access to the object and their level of access. The system access control list (SACL), which lists the security principals that should trigger audit events when accessing the list&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C;, &amp;#x201C;DACL&amp;#x201D;&amp;#xC740; &amp;#xC5EC;&amp;#xB7EC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xADF8;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#x201C;Security Description&amp;#x201D; (&amp;#xC870;&amp;#xAE08; &amp;#xC774;&amp;#xB530;&amp;#xAC00; &amp;#xAE4A;&amp;#xAC8C; &amp;#xB2E4;&amp;#xB8F0;)&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD638;&amp;#xCD9C;&amp;#xC744; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0; &amp;#xD2B9;&amp;#xC815; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;, &amp;#xADF8;&amp;#xB8F9; &amp;#xB610;&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xD5C8;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;(&amp;#xD30C;&amp;#xC77C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;, &amp;#xC4F0;&amp;#xB808;&amp;#xB4DC; &amp;#xB4F1;)&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xB098;&amp;#xC694;? &amp;#x201C;Window UI&amp;#x201D;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. =)&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB9C8; &amp;#xC774; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC740; &amp;#xC880; &amp;#xC775;&amp;#xC219;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xCC3D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#x201C;DACL &amp;amp; Security Description&amp;#x201D;&amp;#xC744; &amp;#xAD00;&amp;#xB9AC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB7F0;&amp;#xAC8C; &amp;#xC65C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5B4;&amp;#xC84C;&amp;#xB294;&amp;#xC9C0;&amp;#xB294; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC5B4;&amp;#xB835;&amp;#xC9C0; &amp;#xC54A;&amp;#xACA0;&amp;#xC8E0;? &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xAC83;&amp;#xC740;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C8; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xB0B4;&amp;#xBD80;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC815;&amp;#xC758;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5B4;&amp;#xB5A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#x201C;DACL&amp;#x201D;&amp;#xC758; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xC744; &amp;#xBC1B;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#x201C;Windows Internals&amp;#x201D;&amp;#xC640; &amp;#x201C;structs&amp;#x201D;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC120;, &amp;#x201C;WinDBG&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;WinDBG&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; windows &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74;, &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC12;&amp;#xC744; &amp;#xBE7C;&amp;#xBA74;, &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; &amp;#xD328;&amp;#xD134;&amp;#xC740; &amp;#xAC16;&amp;#xB294;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;0x856117c8&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; windows &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0C5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC83;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xC758; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. (&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xC774;&amp;#xB984;, &amp;#xAD8C;&amp;#xD55C;, &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; ID, &amp;#xD578;&amp;#xB4E4; &amp;#xB4F1;)&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xD76C;&amp;#xAC00; &amp;#xC720;&amp;#xC2EC;&amp;#xD788; &amp;#xBD10;&amp;#xC57C; &amp;#xD560; &amp;#xAC83;&amp;#xC740; &amp;#xC2E4;&amp;#xC81C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#x201C;nt!_OBJECT_HEADER struct&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/12.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;nt!_OBJECT_HEADER&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/13.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; header&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAD6C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB4DC;&amp;#xC2DC; &amp;#x201C;nt!_OBJECT_HEADER struct&amp;#x201D;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xD574;&amp;#xBD80;&amp;#xD574; &amp;#xBCFC;&amp;#xC218; &amp;#xC788;&amp;#xACE0; &amp;#xAC01; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC704;&amp;#xCE58;&amp;#xD574; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC911;&amp;#xC694;&amp;#xD55C; &amp;#xC810;&amp;#xC740; &amp;#x201C;nt!_OBJECT_HEADER&amp;#x201D;&amp;#xB294; &amp;#x201C;nt!_ERPOCESS&amp;#x201D;&amp;#xB85C;&amp;#xBD80;&amp;#xD130;&amp;#xC758; offset&amp;#xC744; &amp;#xBCF4;&amp;#xC5EC;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Security Description&amp;#xC5D0;&amp;#xC120; &amp;#xC5B4;&amp;#xB5A4; &amp;#xB3D9;&amp;#xC791;&amp;#xC774; &amp;#xC774;&amp;#xB904;&amp;#xC9C8;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/14.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Security Description &amp;#x201C;(0x85117b0 + 0x014)&amp;#x201D;&amp;#xC774; &amp;#x201C;0x8c005e1f&amp;#x201D;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC5D0; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#x201C;DACL &amp;amp; Security Description&amp;#x201D;&amp;#xACFC; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC0C1;&amp;#xD638;&amp;#xC791;&amp;#xC6A9;&amp;#xC774; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;, &amp;#xC6B0;&amp;#xC120; &amp;#x201C;0x8c005e1f&amp;#x201D; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC880; &amp;#xB354; &amp;#xAE4A;&amp;#xAC8C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/15.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SecurityDescription &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#x201C;!sd&amp;#x201D; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; bit &amp;#xACC4;&amp;#xC0B0;&amp;#xC73C;&amp;#xB85C; Windows Internals&amp;#xC758; &amp;#xB3D9;&amp;#xC791;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC5D0;&amp;#xC11C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB41C; &amp;#xAC12;&amp;#xB4E4;&amp;#xC740; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB41C; &amp;#xC720;&amp;#xC800; &amp;#xC815;&amp;#xBCF4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; DACL &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/16.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xB450; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#x201C;SYSTEM&amp;#x201D;&amp;#xACFC; &amp;#x201C;DAML&amp;#x201D; &amp;#xC720;&amp;#xC800;&amp;#xB4E4;&amp;#xC740; SecurityDescription &amp;#x201C;(Windows Internals)&amp;#x201D;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; (&amp;#xC815;&amp;#xD655;&amp;#xD558;&amp;#xC9C4; &amp;#xC54A;&amp;#xC9C0;&amp;#xB9CC;) &amp;#xC704; &amp;#xB450; &amp;#xAC12;&amp;#xB4E4;&amp;#xC744; &amp;#xBE44;&amp;#xAD50;&amp;#xD558;&amp;#xB294; &amp;#xBC95;&amp;#xC744; &amp;#xC54C;&amp;#xC544; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C; &amp;#x201C;ring0 (kernel)&amp;#x201D; &amp;#xC8FC;&amp;#xC18C; &amp;#xC5B4;&amp;#xB514;&amp;#xB4E0; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xAE30;&amp;#xC5B5;&amp;#xD55C;&amp;#xCC44;&amp;#xB85C; SecurityDescription &amp;#xC8FC;&amp;#xC18C; &amp;#x201C;(0x865117b0+0x014)&amp;#x201D;&amp;#xB97C; &amp;#x201C;NULL (0x00000000)&amp;#x201D;&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4; &amp;#xC4F0;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/17.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SecurityDescription&amp;#xC740; 0x8c005e1f&amp;#xC744; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0A4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/18.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SecurityDescription &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; NULL&amp;#xB85C; &amp;#xB36E;&amp;#xC5B4;&amp;#xC501;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/19.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC790;! &amp;#xC774;&amp;#xC81C; &amp;#x201C;System.exe (PID:4)&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB294; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB41C; SecurityDescriptor &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC16;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#x201C;VM snapshot&amp;#x201D;&amp;#xC744; &amp;#xCC0D;&amp;#xC5B4; &amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/20.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xD639;&amp;#xC2DC;&amp;#xB098; &amp;#xC0AC;&amp;#xC9C4;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xC2E4;&amp;#xAE4C;&amp;#xBD10; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#x201C;[system]&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xC2DC;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xAE4C;?&amp;#x201D;&amp;#xB77C;&amp;#xACE0; &amp;#xC368;&amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/21.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;DCOM server &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xB7F0;&amp;#xCC98;&amp;#xAC00; crash &amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xC2DC;&amp;#xB9CC;, &amp;#xBB34;&amp;#xC2A8;&amp;#xC77C;&amp;#xC774; &amp;#xC77C;&amp;#xC5B4;&amp;#xB09C;&amp;#xAC70;&amp;#xC8E0;? [System.exe] &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC218;&amp;#xB3D9;&amp;#xC73C;&amp;#xB85C;, &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC73C;&amp;#xB85C;, &amp;#xC791;&amp;#xC5C5;&amp;#xAD00;&amp;#xB9AC;&amp;#xC790;&amp;#xC5D0;&amp;#xC11C; &amp;#xC885;&amp;#xB8CC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xACE0;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB124;! &amp;#xC624;&amp;#xC9C1; &amp;#x201C;nt authority/SYSTEM&amp;#x201D;&amp;#xB9CC;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC885;&amp;#xB8CC;&amp;#xD560; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800;&amp;#xAC00; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;BSOD&amp;#x201D;&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD; &amp;#xC2DC;&amp;#xCF30;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; SecurityDescription &amp;#xB3D9;&amp;#xC791;&amp;#xC744; NULL&amp;#xB85C; &amp;#xBC14;&amp;#xAFD4;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xC544;&amp;#xC8FC; &amp;#xC720;&amp;#xBA85;&amp;#xD55C;(well-known) exploit &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD0C0;&amp;#xAC9F; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xAD8C;&amp;#xD55C; bit&amp;#xC744; &amp;#xC5C6;&amp;#xC5D0; &amp;#xBC84;&amp;#xB9B4; &amp;#xC218; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xD574;&amp;#xB2F9; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xAD8C;&amp;#xD55C; &amp;#xC0C1;&amp;#xC2B9; exploit&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; SecurityDescription&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; &amp;#xAD8C;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC9C0;&amp;#xC6CC; &amp;#x201C;&amp;#xB204;&amp;#xAD6C;&amp;#xB098;&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xB97C; &amp;#xC4F0;&amp;#xACE0;, &amp;#xC77D;&amp;#xACE0;, &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Exploit&amp;#xC744; &amp;#xC131;&amp;#xACF5;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC54C;&amp;#xACA0;&amp;#xB294;&amp;#xB370;, &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#x201C;SYSTEM&amp;#x201D; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/22.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB294; WinDBG&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#x201C;ring0 (kernel mode)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC5F4;&amp;#xD55C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xBAA9;&amp;#xB85D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB514;&amp;#xC5D0; &amp;#xC788;&amp;#xB294;&amp;#xC9C0;, &amp;#xADF8; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xD655;&amp;#xC778; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xD574;&amp;#xB2F9; &amp;#xAC12;&amp;#xB4E4;&amp;#xC774; &amp;#xC811;&amp;#xADFC;&amp;#xACFC; &amp;#xC608;&amp;#xCE21;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC78A;&amp;#xC5B4;&amp;#xBC84;&amp;#xB9AC;&amp;#xBA74; &amp;#xC548;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;Windows 7&amp;#x201D;&amp;#xBD80;&amp;#xD130;&amp;#xB294; &amp;#x201C;(Address Space Layout Randomization: ASLR)&amp;#x201D;&amp;#xB77C;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C; &amp;#xB79C;&amp;#xB364;&amp;#xD654;&amp;#xAC00; &amp;#xAD6C;&amp;#xD604;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC801;&amp;#xC778; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC2DC;&amp;#xB3C4;&amp;#xB418;&amp;#xB294; &amp;#xBAA8;&amp;#xB4E0; &amp;#xACF5;&amp;#xACA9;&amp;#xC740; &amp;#xBD88;&amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC774;&amp;#xC820; &amp;#xC5B4;&amp;#xCA50;&amp;#xB2E4;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1 id=&#34;NtQuerySystemInformation-Handle-Leaking-Attack&#34;&gt;&lt;a href=&#34;#NtQuerySystemInformation-Handle-Leaking-Attack&#34; class=&#34;headerlink&#34; title=&#34;NtQuerySystemInformation - Handle Leaking Attack&#34;&gt;&lt;/a&gt;NtQuerySystemInformation - Handle Leaking Attack&lt;/h1&gt;&lt;p&gt;&amp;#xC804;&amp;#xC5D0;&amp;#xB3C4; &amp;#xB9D0;&amp;#xD588;&amp;#xB4DC;&amp;#xC2DC;, &amp;#xD604;&amp;#xC7AC; &amp;#xD0C0;&amp;#xAC9F; OS (windows 7)&amp;#xC73C;&amp;#xB860; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; exploit&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xBD88;&amp;#xAC00;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD560; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC5C6;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xB2F5;&amp;#xC740; &amp;#xBC14;&amp;#xB85C; &amp;#x201C;NtQuerySystemInformation WinAPI call&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC740; &amp;#xC124;&amp;#xACC4;&amp;#xC0C1; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xBCF4;&amp;#xC548; &amp;#xACB0;&amp;#xD568;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#x201C;&amp;#xAE30;&amp;#xB2A5;&amp;#x201D;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;WinAPI call&amp;#x201D;&amp;#xC758; &amp;#xAC00;&amp;#xC7A5; &amp;#xD070; &amp;#xBB38;&amp;#xC81C;&amp;#xC810;&amp;#xC740; user call(undocumented behavior)&amp;#xC744; &amp;#xC218;&amp;#xB77D;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xAD6C;&amp;#xC131;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;,  ring0 &amp;#xC815;&amp;#xBCF4;&amp;#xC640; &amp;#xD568;&amp;#xAED8; &amp;#xD30C;&amp;#xC2F1;&amp;#xB418;&amp;#xC11C; SYSTEM &amp;#xC8FC;&amp;#xC18C;/&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAE30;&amp;#xB3C4; &amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xB73B;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC911;&amp;#xC694;&amp;#xD558;&amp;#xACE0; &amp;#xD0C0;&amp;#xAC9F; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xC9C0; &amp;#xC798; &amp;#xC54C; &amp;#xACE0; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC774;&amp;#xB7F0; &amp;#x201C;WinAPI Call&amp;#x201D;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB178;&amp;#xCD9C; &amp;#xACF5;&amp;#xACA9;&amp;#xC5D0; &amp;#xC790;&amp;#xC8FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC720;&amp;#xBA85;&amp;#xD55C;(well-known) &amp;#xBC29;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; ring3&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xC8E0;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xAE30;&amp;#xB2A5; &amp;#xD638;&amp;#xCD9C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xAE30; &amp;#xC804;&amp;#xC5D0; &amp;#xC6B0;&amp;#xC120; &amp;#x201C;handle&amp;#x201D;&amp;#xC758; &amp;#xC815;&amp;#xC758;&amp;#xB97C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACE0; &amp;#xC65C; &amp;#xC8FC;&amp;#xBAA9;&amp;#xD574;&amp;#xC57C;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://stackoverflow.com/questions/902967/what-is-a-windows-handle&#34;&gt;https://stackoverflow.com/questions/902967/what-is-a-windows-handle&lt;/a&gt; &amp;#xC5D0; &amp;#xC758;&amp;#xD558;&amp;#xBA74;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;It&amp;#x2019;s an abstract reference value to a resource, often memory or an open file, or a pipe.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Properly, in Windows, (and generally in computing) a handle is an abstraction which hides a real memory address from the API user, allowing the system to reorganize physical memory transparently to the program. Resolving a handle into a pointer locks the memory, and releasing the handle invalidates the pointer. In this case think of it as an index into a table of pointers&amp;#x2026; you use the index for the system API calls, and the system can change the pointer in the table at will.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Alternatively a real pointer may be given as the handle when the API writer intends that the user of the API be insulated from the specifics of what the address returned points to; in this case it must be considered that what the handle points to may change at any time (from API version to version or even from call to call of the API that returns the handle) &amp;#x2014; the handle should therefore be treated as simply an opaque value meaningful only to the API.&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC694;&amp;#xC57D;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#x201C;handle&amp;#x201D;&amp;#xC740; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C; &amp;#xAC1D;&amp;#xCCB4;(&amp;#xD30C;&amp;#xC77C;, api, pipe &amp;#xB4F1;) &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC18D;&amp;#xC131;&amp;#xB4E4;&amp;#xC744; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB7F0; handle&amp;#xB4E4;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xB294;&amp;#xB370; &amp;#xADF8;&amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xAC00; &amp;#xBC14;&amp;#xB85C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9D0; &amp;#xC7AC;&amp;#xBBF8;&amp;#xC788;&amp;#xB294; &amp;#xC810;&amp;#xC740;, &amp;#x201C;handle&amp;#x201D;&amp;#xC740; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; load&amp;#xD558;&amp;#xACE0; &amp;#x201C;ring3 (user-land)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0AC; &amp;#xBC29;&amp;#xBC95;&amp;#xC774; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC740; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6B4; call&amp;#xB4E4;&amp;#xC744; &amp;#xC9C0;&amp;#xC6B0;&amp;#xB108;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xC911; &amp;#x201C;SystemExtendedHandleInformation&amp;#x201D;&amp;#xC740; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; struct&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/23.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SYSTEM_HANDLE_TABLE_ENTRY_INFO&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/24.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;SYSTEM_HANDLE_INFORMATION&lt;/p&gt;
&lt;p&gt;&amp;#xD574;&amp;#xB2F9; struct&amp;#xB294; &amp;#x201C;handle &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#x201D;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xC2DC;&amp;#xD0A4;&amp;#xB294;&amp;#xB370; &amp;#xB3C4;&amp;#xC6C0;&amp;#xC744; &amp;#xC904; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xACC4;&amp;#xC0C1;&amp;#xC758; &amp;#xACB0;&amp;#xD568;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#x201C;ring3 (user-mode)&amp;#x201D;&amp;#xC5D0;&amp;#xC11C; handle data&amp;#xB97C; &amp;#xD37C;&amp;#xC9D5;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xBB34;&amp;#xC2A8; &amp;#xC77C;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC54C;&amp;#xC544;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/25.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;handle data&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0A4;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/26.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xBAA8;&amp;#xB4E0; handle&amp;#xC744; &amp;#xB8E8;&amp;#xD504;&amp;#xB85C; &amp;#xB3CC;&amp;#xBA70; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/27.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC704; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xAC00; ring3&amp;#xC5D0;&amp;#xC11C; PID:4&amp;#xC758; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/28.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB2E4;&amp;#xC2DC;&amp;#xD53C; &amp;#xC77C;&amp;#xBC18; &amp;#xC720;&amp;#xC800;&amp;#xB85C;&amp;#xB3C4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC640; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xB178;&amp;#xCD9C; &amp;#xC2DC;&amp;#xD0AC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD639;&amp;#xC2DC; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB4E4;&amp;#xC740; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#x201D;&amp;#xC640; &amp;#xC544;&amp;#xC8FC; &amp;#xBC00;&amp;#xC811;&amp;#xD55C; &amp;#xAD00;&amp;#xACC4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/29.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC3E;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC544;&amp;#xC9C1; &amp;#xBB38;&amp;#xC81C;&amp;#xAC00; &amp;#xB0A8;&amp;#xC544; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x201C;ASLR&amp;#x201D;&amp;#xC774; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xAC00;&amp;#xC815;&amp;#xD558;&amp;#xC5D0; &amp;#x201C;&amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC1D;&amp;#xCCB4;&amp;#x201D; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xD3EC;&amp;#xD568;&amp;#xB41C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC608;&amp;#xCE21;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC8FC;&amp;#xC18C;, PID &amp;#xBC0F; Handle &amp;#xAC12;&amp;#xC774; &amp;#xC62C;&amp;#xBC14;&amp;#xB978;&amp;#xC9C0; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;p&gt;&amp;#xC774; &amp;#xC9C8;&amp;#xBB38;&amp;#xC758; &amp;#xB2F5;&amp;#xC740;: &amp;#x201C;&amp;#xC800;&amp;#xB3C4; &amp;#xBAA8;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBC29;&amp;#xBC95;&amp;#xC740; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;!&amp;#x201D;&lt;/p&gt;
&lt;p&gt;&amp;#xC4F8;&amp;#xB9CC;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; handle&amp;#xC744; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654; &amp;#xD55C;&amp;#xB2E4;&amp;#xBA74; crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;. &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC5EC;&amp;#xB7EC;&amp;#xBC88; &amp;#xBC18;&amp;#xBCF5;&amp;#xD574;&amp;#xC11C; &amp;#x201C;lsass.exe PID&amp;#x201D;&amp;#xB97C; &amp;#xC815;&amp;#xC758;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBB34;&amp;#xC791;&amp;#xC815; handle&amp;#xC744; NULL&amp;#xB85C; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xD558;&amp;#xBA74; &amp;#xC6B4;&amp;#xC601;&amp;#xCCB4;&amp;#xC81C;&amp;#xAC00; crash&amp;#xB098;&amp;#xACE0; &amp;#xC7AC;&amp;#xBD80;&amp;#xD305;&amp;#xB420; &amp;#xC218; &amp;#xC788;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC740; &amp;#xAD8C;&amp;#xC7A5;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/30.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/31.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;lsass.exe&amp;#x201D;&amp;#xC758; handle&amp;#xB9CC;&amp;#xC744; &amp;#xD544;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x201C;SYSTEM &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#x201D;&amp;#xC5D0; &amp;#x201C;&amp;#xB204;&amp;#xAD6C;&amp;#xB098;&amp;#x201D; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74;, &amp;#xC774;&amp;#xC820; &amp;#xD0C0;&amp;#xAC9F; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#x201C;Shellcode Injection&amp;#x201D;&amp;#xC744; &amp;#xD560; &amp;#xCC28;&amp;#xB840;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/28/fabu1ous/write-null/32.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x201C;nt authority/SYSTEM cmd.exe shell&amp;#x201D;&amp;#xC744; &amp;#xD68D;&amp;#xB4DD;&amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. crash&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xACE0; &amp;#xC774;&amp;#xC288;&amp;#xC5C6;&amp;#xC774; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC798; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;Final Exploit link:&lt;a href=&#34;https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL&#34;&gt;https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL&lt;/a&gt; References:&lt;a href=&#34;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h&#34;&gt;https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h&lt;/a&gt; &lt;a href=&#34;https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs&#34;&gt;https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs&lt;/a&gt; &lt;a href=&#34;http://bprint.rewolf.pl/bprint/?p=1683&#34;&gt;http://bprint.rewolf.pl/bprint/?p=1683&lt;/a&gt; &lt;a href=&#34;https://github.com/ZecOps/CVE-2020&amp;#x2013;0796-LPE-POC/blob/master/poc.py&#34;&gt;https://github.com/ZecOps/CVE-2020&amp;#x2013;0796-LPE-POC/blob/master/poc.py&lt;/a&gt; &lt;a href=&#34;https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/&#34;&gt;https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/1.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/">

  <title>[Translation] HackSys Extreme Vulnerable Driver â€” Arbitrary Write NULL (New Solution) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- ä¸»é¢˜ä¾èµ–çš„å›¾æ ‡åº“ï¼Œä¸è¦è‡ªè¡Œä¿®æ”¹ -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- è‡ªå®šä¹‰æ ·å¼ä¿æŒåœ¨æœ€åº•éƒ¨ -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-11-28 20:00" pubdate>
      2021ë…„ 11ì›” 28ì¼ ì˜¤í›„
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.7k ìž
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      74
       ë¶„
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Translation] HackSys Extreme Vulnerable Driver â€” Arbitrary Write NULL (New Solution)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <blockquote>
<p>&#x201C;Arbitrary Write NULL&#x201D; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#x201C;NtQuerySystemInformation&#x201D;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xC624;&#xB298;&#xC740; &#x201C;HEVD-(Hacksys Extreme Vulnerable Driver)&#x201D;&#xB97C; &#xD1B5;&#xD574; &#x201C;LPE - (Local Privilege Escalation : &#xB85C;&#xCEEC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;)&#xC744; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294; &#x201C;NtQuerySystemInformation&#x201D; &#xC2DC;&#xC2A4;&#xD15C;&#xCF5C; &#xACF5;&#xACA9; &#xAE30;&#xC220;&#xC744; &#xC2EC;&#xB3C4; &#xC788;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xCDE8;&#xC57D;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xD754;&#xD788; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#x201C;Arbitrary Write NULL&#x201D;(&#xC784;&#xC758; NULL &#xC4F0;&#xAE30;) &#xCDE8;&#xC57D;&#xC810;&#xC744; exploit&#xD558;&#xB294; &#xAC00;&#xB2A5;&#xC131; &#xBC0F; &#xAE30;&#xB2A5;&#xC801; &#xBC29;&#xBC95;&#xB860;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C;, &#x201C;HEVD IOCTL&#x201D; &#xD1B5;&#xC2E0;&#xC744; &#xC704;&#xD55C; &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45; &#xD658;&#xACBD; &#xC124;&#xC815; &#xBC0F; &#xC124;&#xCE58; &#xACFC;&#xC815;&#xC740; &#xC0DD;&#xB7B5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; write-up&#xC740; &#xCD5C;&#xC885; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC558;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xC81C;&#xAC00; &#xC5B4;&#xB5A4; &#xB178;&#xB825;&#xC744; &#xD588;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xC7AC;&#xBC0C;&#xAC8C; &#xC77D;&#xC5B4;&#xC8FC;&#xC138;&#xC694;! =)</p>
<h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC6B0;&#xC120;, &#x201C;Arbitrary Write NULL&#x201D;&#xC774; &#xBB54;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xAC04;&#xB2E8;&#xD55C; &#x201C;cmd.exe&#x201D;&#xC758; &#x201C;ring3 (user-land)&#x201D; &#xC138;&#xC158;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xCEE4;&#xB110;&#xC758; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#x201C;LPE&#x201D;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5A4; &#xD589;&#xC704;&#xAC00; &#xAC00;&#xB2A5;&#xD560;&#xAE4C;&#xC694;?</p>
<p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C;, &#x201C;Arbitrary Write NULL&#x201D;&#xC740; &#x201C;Arbitrary Write&#x201D; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xB9E4;&#xC6B0; &#xC720;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xB2E4;&#xBA74;, &#xC804;&#xC790;&#xB294; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC5D0; &#x201C;write&#x2192;[0x00000000]&#x201D; &#xB3D9;&#xC791;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, &#xD6C4;&#xC790;&#xB294; &#x201C;Write-What-Where&#x201D;&#xB77C;&#xACE0; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; &#x201C;write &#x2192; [0xdeadbeef]&#x201D;&#xC640; &#xAC19;&#xC740; &#xD589;&#xC704;&#xAC00; &#xAC00;&#xB2A5;&#xD574; &#x201C;0x00000000&#x201D; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xD2B9;&#xC815; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC758; &#xAC12;&#xC744; &#x201C;0xdeadbeef&#x201D;&#xB85C; overflow&#xD558;&#xACE0; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; HEVD &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xD574;&#xBD80;&#xD558;&#xACE0; &#xBB34;&#xC2A8;&#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="HEVD-TriggerWriteNull"><a href="#HEVD-TriggerWriteNull" class="headerlink" title="[HEVD]-TriggerWriteNull"></a>[HEVD]-TriggerWriteNull</h1><p><img src="/2021/11/28/fabu1ous/write-null/1.png" srcset="/img/loading.gif" alt></p>
<p>HEVD - <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/hacksysteam/HackSysExtremeVulnerableDriver">https://github.com/hacksysteam/HackSysExtremeVulnerableDriver</a></p>
<p><img src="/2021/11/28/fabu1ous/write-null/2.png" srcset="/img/loading.gif" alt></p>
<p><code>TriggerWriteNULL</code>&#xB294; kernel user-buffer&#xB97C; &#xD578;&#xB4E4;&#xD558;&#xACE0; ring3(user-land)&#xC5D0; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/3.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;ifdef SECURE&#x201D; (&#xBB3C;&#xB860; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;)&#xB97C; &#xBCF4;&#xC2DC;&#xBA74;, &#x201C;probeForWrite()&#x201D; &#xD568;&#xC218;&#xB294; user input buffer&#xAC00; &#x201C;ring3&#x201D;&#xC5D0; &#xC704;&#xCE58;&#xD574; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC8C; &#xC544;&#xB2C8;&#xB77C;&#xBA74; &#xC801;&#xC808;&#xD55C; &#xBCF4;&#xC548; &#xAC80;&#xC0AC; &#xC5C6;&#xC774; &#xC785;&#xB825; &#xBC84;&#xD37C;&#xB97C; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC8FC;&#xC11D;&#xC5D0; &#xC4F0;&#xC5EC;&#xC788;&#xB4DC;&#xC2DC; &#x201C;#ifdef SUCURE&#x201D; bit set&#xC774; &#xC815;&#xC758;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xB418;&#xBA74; &#x201C;[edi]&#x201D; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#x201C;[ebx]&#x201D;&#xC5D0; &#xC758;&#xD574; &#x201C;0x00000000&#x201D;&#xC73C;&#xB85C; overflow&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/5.png" srcset="/img/loading.gif" alt></p>
<p>IOCTL drive &#xC5F0;&#xACB0;&#xC740; &#xBBF8;&#xB9AC; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBBC0;&#xB85C; , &#xCCAB; user-buffer&#xC758; &#xCCAB; 4 byte &#x201C;(shellcode_ptr)&#x201D;&#xC5D0; &#xB300;&#xD574; &#xD14C;&#xC2A4;&#xD2B8; &#xD574;&#xBCF4;&#xACE0; &#x201C;0x00000000&#x201D;&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/6.png" srcset="/img/loading.gif" alt></p>
<p>&#xC801;&#xC808;&#xD55C; &#xC8FC;&#xC18C;&#xC5D0; break point&#xB97C; &#xAC78;&#xACE0; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xACE0; break point&#xC5D0; &#xAC78;&#xB9AC;&#xBA74; &#x201C;[edi]&#x201D;&#xAC00; user-buffer&#xC758; &#xC8FC;&#xC18C; &#x201C;(shellcode_ptr &#x2192; 0x00500000)&#x201D;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/8.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;shellcode&#x201D;&#xB294; &#x201C;LPE&#x201D;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xB294; &#x201C;x86 &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#x201D; &#xCF54;&#xB4DC;&#xAC00; &#xB2F4;&#xACA8;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCCAB; &#x201C;4 bytes&#x201D;&#xC5D0;&#xB294; &#xC800;&#xD76C; &#x201C;shellcode&#x201D;&#xC758; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC774; &#xB2F4;&#xACA8; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xC774; &#xC0AC;&#xC2E4;&#xC740; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#x201C;0xa16460cc&#x201D; &#xC8FC;&#xC18C;&#xB97C; &#xC8FC;&#xBAA9;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/9.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. ebx=0x00000000&#xAC00; &#xC800;&#xD76C; user-buffer eax=0xa16460cc&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xB36E;&#xC5B4;&#xC4F0;&#xC5EC; &#xC9C0;&#xACE0; &#xC788;&#xB294; &#xAC8C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C;&#xC758; &#xBB38;&#xC81C;&#xB294; &#xBD84;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E8;&#xC21C; &#xC0AC;&#xC6A9;&#xC790; &#x201C;(ring3)&#x201D;&#xB85C;&#xC11C; &#xC544;&#xBB34; &#xC8FC;&#xC18C;&#xB098; &#xC81C;&#xACF5;&#xD558;&#xBA74; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC815;&#xC758;&#xB41C; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC5D0; &#x201C;NULL&#x201D;&#xC744; &#xB36E;&#xC5B4; &#xC4F8; &#xC218; &#xC788;&#xB294;&#xB370;, LPE&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC120; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? DACL&#xACFC; Security Description&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<h1 id="DACL-amp-Security-Description"><a href="#DACL-amp-Security-Description" class="headerlink" title="DACL &amp; Security Description"></a>DACL &amp; Security Description</h1><p>&#xC6B0;&#xC120;, &#x201C;DACL&#x201D;&#xACFC; &#x201C;Security Description&#x201D;&#xC774; &#xBB34;&#xC5C7;&#xC774;&#xACE0; &#x201C;Arbitrary Write NULL&#x201D;&#xC744; exploit &#xD558;&#xB294;&#xB370; &#xC5B4;&#xB5BB;&#xAC8C; &#xC4F0;&#xC77C; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://networkencyclopedia.com/discretionary-access-control-list-dacl/">https://networkencyclopedia.com/discretionary-access-control-list-dacl/</a> &#xC5D0; &#xC758;&#xD558;&#xBA74;</p>
<blockquote>
<p>What is DACL (Discretionary Access Control List)? A DACL stands for Discretionary Access Control List, in Microsoft Windows family, is an internal list attached to an object in Active Directory that specifies which users and groups can access the object and what kinds of operations they can perform on the object. In Windows 2000 and Windows NT, an internal list attached to a file or folder on a volume formatted using the NTFS that has a similar function. How DACL works? In Windows, each object in Active Directory or a local NTFS volume has an attribute called Security Descriptor that stores information about The object&#x2019;s owner (the security identifier or the owner) and the groups to which the owner belongs. The discretionary access control list (DACL) of the object, which lists the security principals (users, groups, and computers) that have access to the object and their level of access. The system access control list (SACL), which lists the security principals that should trigger audit events when accessing the list</p>
</blockquote>
<p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C;, &#x201C;DACL&#x201D;&#xC740; &#xC5EC;&#xB7EC; &#xAE30;&#xB2A5;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xADF8;&#xC911; &#xD558;&#xB098;&#xAC00; &#x201C;Security Description&#x201D; (&#xC870;&#xAE08; &#xC774;&#xB530;&#xAC00; &#xAE4A;&#xAC8C; &#xB2E4;&#xB8F0;)&#xC785;&#xB2C8;&#xB2E4;. &#xD638;&#xCD9C;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xD2B9;&#xC815; &#xC0AC;&#xC6A9;&#xC790;, &#xADF8;&#xB8F9; &#xB610;&#xB294; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xB300;&#xD574; &#xD5C8;&#xC6A9;&#xB418;&#xB294; &#xAC1D;&#xCCB4;(&#xD30C;&#xC77C;, &#xD504;&#xB85C;&#xC138;&#xC2A4;, &#xC4F0;&#xB808;&#xB4DC; &#xB4F1;)&#xC744; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB9AC;&#xC2A4;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB098;&#xC694;? &#x201C;Window UI&#x201D;&#xB97C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;. =)</p>
<p><img src="/2021/11/28/fabu1ous/write-null/10.png" srcset="/img/loading.gif" alt></p>
<p>&#xC544;&#xB9C8; &#xC774; &#xC0AC;&#xC9C4;&#xC740; &#xC880; &#xC775;&#xC219;&#xD558;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;. &#xC704; &#xCC3D;&#xC5D0;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#x201C;DACL &amp; Security Description&#x201D;&#xC744; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0;&#xAC8C; &#xC65C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xB294;&#xC9C0;&#xB294; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xACA0;&#xC8E0;? &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC5B4;&#xB5A4; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xB97C; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xAC1D;&#xCCB4;&#xAC00; &#x201C;DACL&#x201D;&#xC758; &#xD544;&#xD130;&#xB9C1;&#xC744; &#xBC1B;&#xC744;&#xAE4C;&#xC694;? &#x201C;Windows Internals&#x201D;&#xC640; &#x201C;structs&#x201D;&#xB97C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xC6B0;&#xC120;, &#x201C;WinDBG&#x201D;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC744; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/11.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;WinDBG&#x201D;&#xC5D0;&#xC11C; windows &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;, &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC8FC;&#xC18C;&#xAC12;&#xC744; &#xBE7C;&#xBA74;, &#xB3D9;&#xC77C;&#xD55C; &#xD328;&#xD134;&#xC740; &#xAC16;&#xB294;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#x201C;0x856117c8&#x201D; &#xC8FC;&#xC18C;&#xB294; windows &#xAC1D;&#xCCB4;&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC1D;&#xCCB4;&#xB294; &#xB2E4;&#xC74C; &#xACFC; &#xAC19;&#xC740; &#xAC83;&#xB4E4;&#xC744; &#xC815;&#xC758; &#xD569;&#xB2C8;&#xB2E4;. (&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC774;&#xB984;, &#xAD8C;&#xD55C;, &#xD504;&#xB85C;&#xC138;&#xC2A4; ID, &#xD578;&#xB4E4; &#xB4F1;)</p>
<p>&#xC9C0;&#xAE08; &#xC800;&#xD76C;&#xAC00; &#xC720;&#xC2EC;&#xD788; &#xBD10;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xC2E4;&#xC81C; &#xACF5;&#xACA9;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#x201C;nt!_OBJECT_HEADER struct&#x201D;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/12.png" srcset="/img/loading.gif" alt></p>
<p>nt!_OBJECT_HEADER&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/13.png" srcset="/img/loading.gif" alt></p>
<p>&#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; header&#xC5D0;&#xC11C; &#xC815;&#xBCF4;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4DC;&#xC2DC; &#x201C;nt!_OBJECT_HEADER struct&#x201D;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xD574;&#xBD80;&#xD574; &#xBCFC;&#xC218; &#xC788;&#xACE0; &#xAC01; &#xAC1D;&#xCCB4;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC704;&#xCE58;&#xD574; &#xC788;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; &#x201C;nt!_OBJECT_HEADER&#x201D;&#xB294; &#x201C;nt!_ERPOCESS&#x201D;&#xB85C;&#xBD80;&#xD130;&#xC758; offset&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>Security Description&#xC5D0;&#xC120; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC774; &#xC774;&#xB904;&#xC9C8;&#xAE4C;&#xC694;?</p>
<p><img src="/2021/11/28/fabu1ous/write-null/14.png" srcset="/img/loading.gif" alt></p>
<p>Security Description &#x201C;(0x85117b0 + 0x014)&#x201D;&#xC774; &#x201C;0x8c005e1f&#x201D;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC5D0; &#xC8FC;&#xBAA9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB294; &#x201C;DACL &amp; Security Description&#x201D;&#xACFC; &#xC5B4;&#xB5A0;&#xD55C; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294;&#xB370;, &#xC6B0;&#xC120; &#x201C;0x8c005e1f&#x201D; &#xC8FC;&#xC18C;&#xB97C; &#xC880; &#xB354; &#xAE4A;&#xAC8C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/15.png" srcset="/img/loading.gif" alt></p>
<p>WinDBG&#xB97C; &#xD1B5;&#xD574; SecurityDescription &#xC8FC;&#xC18C;&#xC5D0; &#x201C;!sd&#x201D; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xC2DC;&#xB2E4;. &#xAC04;&#xB2E8;&#xD55C; bit &#xACC4;&#xC0B0;&#xC73C;&#xB85C; Windows Internals&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xD45C;&#xC2DC;&#xB41C; &#xAC12;&#xB4E4;&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC720;&#xC800; &#xC815;&#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; DACL &#xC815;&#xBCF4;&#xC640; &#xBE44;&#xAD50;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/16.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xB450; &#xC0AC;&#xC9C4;&#xC744; &#xBE44;&#xAD50;&#xD574;&#xBCF4;&#xBA74;, &#x201C;SYSTEM&#x201D;&#xACFC; &#x201C;DAML&#x201D; &#xC720;&#xC800;&#xB4E4;&#xC740; SecurityDescription &#x201C;(Windows Internals)&#x201D;&#xC640; &#xAD00;&#xB828;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xB85C; (&#xC815;&#xD655;&#xD558;&#xC9C4; &#xC54A;&#xC9C0;&#xB9CC;) &#xC704; &#xB450; &#xAC12;&#xB4E4;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xBC95;&#xC744; &#xC54C;&#xC544; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xC77C;&#xBC18; &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#x201C;ring0 (kernel)&#x201D; &#xC8FC;&#xC18C; &#xC5B4;&#xB514;&#xB4E0; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xAE30;&#xC5B5;&#xD55C;&#xCC44;&#xB85C; SecurityDescription &#xC8FC;&#xC18C; &#x201C;(0x865117b0+0x014)&#x201D;&#xB97C; &#x201C;NULL (0x00000000)&#x201D;&#xB85C; &#xB36E;&#xC5B4; &#xC4F0;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB418;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/17.png" srcset="/img/loading.gif" alt></p>
<p>SecurityDescription&#xC740; 0x8c005e1f&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/18.png" srcset="/img/loading.gif" alt></p>
<p>SecurityDescription &#xD3EC;&#xC778;&#xD130;&#xB97C; NULL&#xB85C; &#xB36E;&#xC5B4;&#xC501;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/19.png" srcset="/img/loading.gif" alt></p>
<p>&#xC790;! &#xC774;&#xC81C; &#x201C;System.exe (PID:4)&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB41C; SecurityDescriptor &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAC16;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC0C1;&#xD0DC;&#xB85C; &#x201C;VM snapshot&#x201D;&#xC744; &#xCC0D;&#xC5B4; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/20.png" srcset="/img/loading.gif" alt></p>
<p>&#xD639;&#xC2DC;&#xB098; &#xC0AC;&#xC9C4;&#xC744; &#xC774;&#xD574;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xC2E4;&#xAE4C;&#xBD10; &#xC124;&#xBA85;&#xD558;&#xC790;&#xBA74; &#x201C;[system]&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xD558;&#xC2DC;&#xACA0;&#xC2B5;&#xB2C8;&#xAE4C;?&#x201D;&#xB77C;&#xACE0; &#xC368;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/21.png" srcset="/img/loading.gif" alt></p>
<p>DCOM server &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB7F0;&#xCC98;&#xAC00; crash &#xB0A9;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xC7A0;&#xC2DC;&#xB9CC;, &#xBB34;&#xC2A8;&#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB09C;&#xAC70;&#xC8E0;? [System.exe] &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC218;&#xB3D9;&#xC73C;&#xB85C;, &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC73C;&#xB85C;, &#xC791;&#xC5C5;&#xAD00;&#xB9AC;&#xC790;&#xC5D0;&#xC11C; &#xC885;&#xB8CC;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0;?</p>
</blockquote>
<p>&#xB124;! &#xC624;&#xC9C1; &#x201C;nt authority/SYSTEM&#x201D;&#xB9CC;&#xC774; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xD560; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5B4;&#xB5BB;&#xAC8C; &#xC77C;&#xBC18; &#xC720;&#xC800;&#xAC00; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#x201C;BSOD&#x201D;&#xB97C; &#xBC1C;&#xC0DD; &#xC2DC;&#xCF30;&#xC744;&#xAE4C;&#xC694;? &#xC774; &#xBC29;&#xBC95;&#xC740; SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; SecurityDescription &#xB3D9;&#xC791;&#xC744; NULL&#xB85C; &#xBC14;&#xAFD4;&#xBC84;&#xB9AC;&#xB294; &#xC544;&#xC8FC; &#xC720;&#xBA85;&#xD55C;(well-known) exploit &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xAD8C;&#xD55C; bit&#xC744; &#xC5C6;&#xC5D0; &#xBC84;&#xB9B4; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xAE30;&#xBC95;&#xC740; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; exploit&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, &#xC800;&#xD76C;&#xB294; WinDBG&#xB97C; &#xD1B5;&#xD574; SecurityDescription&#xC5D0; &#xB2F4;&#xAE34; &#xAD8C;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xBAA8;&#xB450; &#xC9C0;&#xC6CC; &#x201C;&#xB204;&#xAD6C;&#xB098;&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC4F0;&#xACE0;, &#xC77D;&#xACE0;, &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xBB38;&#xC81C;&#xAC00; &#xB0A8;&#xC544; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Exploit&#xC744; &#xC131;&#xACF5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBC29;&#xBC95;&#xC740; &#xC54C;&#xACA0;&#xB294;&#xB370;, &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#x201C;SYSTEM&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p><img src="/2021/11/28/fabu1ous/write-null/22.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xB294; WinDBG&#xB97C; &#xD1B5;&#xD574; &#x201C;ring0 (kernel mode)&#x201D;&#xC5D0;&#xC11C; &#xB098;&#xC5F4;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC785;&#xB2C8;&#xB2E4;. &#xAC1D;&#xCCB4;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC788;&#xB294;&#xC9C0;, &#xADF8; &#xC8FC;&#xC18C;&#xB97C; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xAC12;&#xB4E4;&#xC774; &#xC811;&#xADFC;&#xACFC; &#xC608;&#xCE21;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC78A;&#xC5B4;&#xBC84;&#xB9AC;&#xBA74; &#xC548;&#xB429;&#xB2C8;&#xB2E4;. &#x201C;Windows 7&#x201D;&#xBD80;&#xD130;&#xB294; &#x201C;(Address Space Layout Randomization: ASLR)&#x201D;&#xB77C;&#xB294; &#xC8FC;&#xC18C; &#xB79C;&#xB364;&#xD654;&#xAC00; &#xAD6C;&#xD604;&#xB418;&#xC5B4;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC801;&#xC778; &#xC8FC;&#xC18C;&#xB85C; &#xC2DC;&#xB3C4;&#xB418;&#xB294; &#xBAA8;&#xB4E0; &#xACF5;&#xACA9;&#xC740; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xADF8;&#xB798;&#xC11C; &#xC774;&#xC820; &#xC5B4;&#xCA50;&#xB2E4;?</p>
</blockquote>
<h1 id="NtQuerySystemInformation-Handle-Leaking-Attack"><a href="#NtQuerySystemInformation-Handle-Leaking-Attack" class="headerlink" title="NtQuerySystemInformation - Handle Leaking Attack"></a>NtQuerySystemInformation - Handle Leaking Attack</h1><p>&#xC804;&#xC5D0;&#xB3C4; &#xB9D0;&#xD588;&#xB4DC;&#xC2DC;, &#xD604;&#xC7AC; &#xD0C0;&#xAC9F; OS (windows 7)&#xC73C;&#xB860; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; exploit&#xD558;&#xB294; &#xAC83;&#xC774; &#xBD88;&#xAC00;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xBC29;&#xBC95;&#xC774; &#xC5C6;&#xC744;&#xAE4C;&#xC694;? &#xB2F5;&#xC740; &#xBC14;&#xB85C; &#x201C;NtQuerySystemInformation WinAPI call&#x201D;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#x201C;NtQuerySystemInformation&#x201D;&#xC740; &#xC124;&#xACC4;&#xC0C1; &#xB2E4;&#xC591;&#xD55C; &#xBCF4;&#xC548; &#xACB0;&#xD568;&#xC774; &#xC788;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#x201C;&#xAE30;&#xB2A5;&#x201D;&#xC785;&#xB2C8;&#xB2E4;. &#x201C;WinAPI call&#x201D;&#xC758; &#xAC00;&#xC7A5; &#xD070; &#xBB38;&#xC81C;&#xC810;&#xC740; user call(undocumented behavior)&#xC744; &#xC218;&#xB77D;&#xD558;&#xB3C4;&#xB85D; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;,  ring0 &#xC815;&#xBCF4;&#xC640; &#xD568;&#xAED8; &#xD30C;&#xC2F1;&#xB418;&#xC11C; SYSTEM &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB178;&#xCD9C;&#xD558;&#xB294; &#xC77C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAE30;&#xB3C4; &#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC5B4;&#xB5A4; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC911;&#xC694;&#xD558;&#xACE0; &#xD0C0;&#xAC9F; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC798; &#xC54C; &#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7F0; &#x201C;WinAPI Call&#x201D;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xB178;&#xCD9C; &#xACF5;&#xACA9;&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC720;&#xBA85;&#xD55C;(well-known) &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xD558;&#xC9C0;&#xB9CC; ring3&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC815;&#xBCF4;&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0A4;&#xC8E0;?</p>
</blockquote>
<p>&#xCDE8;&#xC57D;&#xD55C; &#xAE30;&#xB2A5; &#xD638;&#xCD9C;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; &#xC6B0;&#xC120; &#x201C;handle&#x201D;&#xC758; &#xC815;&#xC758;&#xB97C; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xC65C; &#xC8FC;&#xBAA9;&#xD574;&#xC57C;&#xD558;&#xB294;&#xC9C0; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://stackoverflow.com/questions/902967/what-is-a-windows-handle">https://stackoverflow.com/questions/902967/what-is-a-windows-handle</a> &#xC5D0; &#xC758;&#xD558;&#xBA74;</p>
<blockquote>
<p>It&#x2019;s an abstract reference value to a resource, often memory or an open file, or a pipe.</p>
<p><em>Properly, in Windows, (and generally in computing) a handle is an abstraction which hides a real memory address from the API user, allowing the system to reorganize physical memory transparently to the program. Resolving a handle into a pointer locks the memory, and releasing the handle invalidates the pointer. In this case think of it as an index into a table of pointers&#x2026; you use the index for the system API calls, and the system can change the pointer in the table at will.</em></p>
<p><em>Alternatively a real pointer may be given as the handle when the API writer intends that the user of the API be insulated from the specifics of what the address returned points to; in this case it must be considered that what the handle points to may change at any time (from API version to version or even from call to call of the API that returns the handle) &#x2014; the handle should therefore be treated as simply an opaque value meaningful only to the API.</em></p>
</blockquote>
<p>&#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, &#x201C;handle&#x201D;&#xC740; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xAC1D;&#xCCB4;(&#xD30C;&#xC77C;, api, pipe &#xB4F1;) &#xC0AC;&#xC774;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xC124;&#xC815;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC18D;&#xC131;&#xB4E4;&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; handle&#xB4E4;&#xC740; &#xAC1D;&#xCCB4;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294;&#xB370; &#xADF8;&#xC911; &#xD558;&#xB098;&#xAC00; &#xBC14;&#xB85C; &#xD3EC;&#xC778;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xC815;&#xB9D0; &#xC7AC;&#xBBF8;&#xC788;&#xB294; &#xC810;&#xC740;, &#x201C;handle&#x201D;&#xC740; &#xD3EC;&#xC778;&#xD130;&#xB97C; load&#xD558;&#xACE0; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#xB178;&#xCD9C;&#xC2DC;&#xD0AC; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p>&#x201C;NtQuerySystemInformation&#x201D;&#xC740; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; call&#xB4E4;&#xC744; &#xC9C0;&#xC6B0;&#xB108;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#x201C;SystemExtendedHandleInformation&#x201D;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; struct&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/23.png" srcset="/img/loading.gif" alt></p>
<p>SYSTEM_HANDLE_TABLE_ENTRY_INFO</p>
<p><img src="/2021/11/28/fabu1ous/write-null/24.png" srcset="/img/loading.gif" alt></p>
<p>SYSTEM_HANDLE_INFORMATION</p>
<p>&#xD574;&#xB2F9; struct&#xB294; &#x201C;handle &#xD3EC;&#xC778;&#xD130;&#x201D;&#xB97C; &#xB178;&#xCD9C;&#xC2DC;&#xD0A4;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC904; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<p>&#xC124;&#xACC4;&#xC0C1;&#xC758; &#xACB0;&#xD568;&#xC744; &#xC774;&#xC6A9;&#xD574; &#x201C;ring3 (user-mode)&#x201D;&#xC5D0;&#xC11C; handle data&#xB97C; &#xD37C;&#xC9D5;&#xD574;&#xBCF4;&#xACE0; &#xBB34;&#xC2A8; &#xC77C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/25.png" srcset="/img/loading.gif" alt></p>
<p>handle data&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0A4;&#xB294; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/26.png" srcset="/img/loading.gif" alt></p>
<p>&#xC774; &#xBD80;&#xBD84;&#xC740; &#xBAA8;&#xB4E0; handle&#xC744; &#xB8E8;&#xD504;&#xB85C; &#xB3CC;&#xBA70; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/27.png" srcset="/img/loading.gif" alt></p>
<p>&#xC704; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; ring3&#xC5D0;&#xC11C; PID:4&#xC758; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB178;&#xCD9C;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/28.png" srcset="/img/loading.gif" alt></p>
<p>&#xBCF4;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; &#xC77C;&#xBC18; &#xC720;&#xC800;&#xB85C;&#xB3C4; &#xD3EC;&#xC778;&#xD130;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD639;&#xC2DC; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xB098;&#xC694;? &#xC774; &#xD3EC;&#xC778;&#xD130;&#xB4E4;&#xC740; &#x201C;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#x201D;&#xC640; &#xC544;&#xC8FC; &#xBC00;&#xC811;&#xD55C; &#xAD00;&#xACC4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/29.png" srcset="/img/loading.gif" alt></p>
<p>&#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;! &#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xBB38;&#xC81C;&#xAC00; &#xB0A8;&#xC544; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x201C;ASLR&#x201D;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC00;&#xC815;&#xD558;&#xC5D0; &#x201C;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#x201D; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xC8FC;&#xC18C;&#xB97C; &#xC608;&#xCE21;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5A4; &#xC8FC;&#xC18C;, PID &#xBC0F; Handle &#xAC12;&#xC774; &#xC62C;&#xBC14;&#xB978;&#xC9C0; &#xC5B4;&#xB5BB;&#xAC8C; &#xC54C; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p>
<p>&#xC774; &#xC9C8;&#xBB38;&#xC758; &#xB2F5;&#xC740;: &#x201C;&#xC800;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBC29;&#xBC95;&#xC740; &#xC788;&#xC5B4;&#xC694;!&#x201D;</p>
<p>&#xC4F8;&#xB9CC;&#xD55C; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; handle&#xC744; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654; &#xD55C;&#xB2E4;&#xBA74; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xACA0;&#xC8E0;. &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC5EC;&#xB7EC;&#xBC88; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#x201C;lsass.exe PID&#x201D;&#xB97C; &#xC815;&#xC758;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBB34;&#xC791;&#xC815; handle&#xC744; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xD558;&#xBA74; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; crash&#xB098;&#xACE0; &#xC7AC;&#xBD80;&#xD305;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC2E4;&#xC81C;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAD8C;&#xC7A5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/30.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2021/11/28/fabu1ous/write-null/31.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;lsass.exe&#x201D;&#xC758; handle&#xB9CC;&#xC744; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xB3C4;&#xB85D; &#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xC815;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#x201C;SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4;&#x201D;&#xC5D0; &#x201C;&#xB204;&#xAD6C;&#xB098;&#x201D; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;&#xBA74;, &#xC774;&#xC820; &#xD0C0;&#xAC9F; &#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#x201C;Shellcode Injection&#x201D;&#xC744; &#xD560; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/28/fabu1ous/write-null/32.png" srcset="/img/loading.gif" alt></p>
<p>&#x201C;nt authority/SYSTEM cmd.exe shell&#x201D;&#xC744; &#xD68D;&#xB4DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xACE0; &#xC774;&#xC288;&#xC5C6;&#xC774; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><em>Final Exploit link:<a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL">https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL</a> References:<a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h">https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs">https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="http://bprint.rewolf.pl/bprint/?p=1683">http://bprint.rewolf.pl/bprint/?p=1683</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/ZecOps/CVE-2020&#x2013;0796-LPE-POC/blob/master/poc.py">https://github.com/ZecOps/CVE-2020&#x2013;0796-LPE-POC/blob/master/poc.py</a> <a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/">https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/</a></em></p>
</blockquote>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Translation/">Translation</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/Fabu1ous/">Fabu1ous</a>
                  
                  <a class="hover-with-bg" href="/tags/lpe/">lpe</a>
                  
                  <a class="hover-with-bg" href="/tags/system/">system</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_Fabu1ous.jpg" srcset="/img/loading.gif" alt="Fabu1ous">
                  </div>

                  <div class="link-text">
                    <div class="link-title">Fabu1ous</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/Fabu1ous">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">ë³¸ ê¸€ì€ <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> ë¼ì´ì„ ìŠ¤ë¡œ ë°°í¬ë©ë‹ˆë‹¤. ê³µìœ  ë˜ëŠ” ë³€ê²½ ì‹œ ë°˜ë“œì‹œ ì¶œì²˜ë¥¼ ë‚¨ê²¨ì£¼ì‹œê¸° ë°”ëžë‹ˆë‹¤.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/11/30/fabu1ous/2021-11-30/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[í•˜ë£¨í•œì¤„] CVE-2021â€“42321: Some notes about Microsoft Exchange Deserialization RCE</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/11/26/poosic/garbage-collection/">
                    <span class="hidden-mobile">[í•´í‚¤í”¼ë””ì•„] Garbage Collection</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/';
        this.page.identifier = '/2021/11/28/fabu1ous/write-null/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Translation] HackSys Extreme Vulnerable Driver â€” Arbitrary Write NULL (New Solution)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
