

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;JNDI-Java-Naming-and-Directory-Interface&#34;&gt;&lt;a href=&#34;#JNDI-Java-Naming-and-Directory-Interface&#34; class=&#34;headerlink&#34; title=&#34;JNDI(Java Naming and Directory Interface)&#34;&gt;&lt;/a&gt;JNDI(Java Naming and Directory Interface)&lt;/h1&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; log4j&amp;#xC758; RCE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778; JNDI&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;JNDI(Java Naming and Directory Interface)&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBC0F; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;(discover)&amp;#xD558;&amp;#xACE0; &amp;#xCC38;&amp;#xACE0;(lookup)&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC790;&amp;#xBC14; API&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xB294; &amp;#xC704;&amp;#xD0A4;&amp;#xBC31;&amp;#xACFC;&amp;#xC758; &amp;#xC815;&amp;#xC758;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;What-is-Naming-Service&#34;&gt;&lt;a href=&#34;#What-is-Naming-Service&#34; class=&#34;headerlink&#34; title=&#34;What is Naming Service?&#34;&gt;&lt;/a&gt;What is Naming Service?&lt;/h2&gt;&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xBA85; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAE08; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;, &amp;#xC8FC;&amp;#xC18C;, &amp;#xC720;&amp;#xC800; &amp;#xC774;&amp;#xB984; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xB098; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; DNS&amp;#xB97C; &amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;! &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; hackyboiz &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; hackyboiz&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; IP&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;&lt;a href=&#34;http://www.hackyboiz.github.io&#34;&gt;&lt;code&gt;hackyboiz.github.io&lt;/code&gt;&lt;/a&gt;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xB3C4; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xAE34; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; IP&amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC790;&amp;#xC5F0;&amp;#xC5B4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB124;&amp;#xC774;&amp;#xBC0D;&amp;#xD574;&amp;#xC900; &amp;#xAC83; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;What-is-Directory-Service&#34;&gt;&lt;a href=&#34;#What-is-Directory-Service&#34; class=&#34;headerlink&#34; title=&#34;What is Directory Service?&#34;&gt;&lt;/a&gt;What is Directory Service?&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;(directory service, DS)&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC790;&amp;#xC6D0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC9C1;&amp;#xD558;&amp;#xB294; &amp;#xC751;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; (&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA8;&amp;#xC784;)&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB4F1;&amp;#xB85D;,&amp;#xC870;&amp;#xD68C;,&amp;#xC0AD;&amp;#xC81C; &amp;#xB4F1;&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB9DE;&amp;#xBB3C;&amp;#xB824; &amp;#xC791;&amp;#xB3D9;&amp;#xD560;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xADF8;&amp;#xB7FC;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; JNDI&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? JNDI&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC744; &amp;#xB54C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB984; &amp;#xC9C0;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Component-and-Flow-of-JNDI&#34;&gt;&lt;a href=&#34;#Component-and-Flow-of-JNDI&#34; class=&#34;headerlink&#34; title=&#34;Component and Flow of JNDI&#34;&gt;&lt;/a&gt;Component and Flow of JNDI&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2022/01/26/poosic/JNDI/image.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;1.&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC01; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xBC14;&amp;#xC778;&amp;#xB4DC;&amp;#xD558;&amp;#xC5EC; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC778; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0DD;&amp;#xC131;&lt;/p&gt;
&lt;p&gt;2.&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xAC1C;&amp;#xCCB4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xCCAD;&lt;/p&gt;
&lt;p&gt;3.&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; JNDI name&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; SPI &amp;#xD638;&amp;#xCD9C;&lt;/p&gt;
&lt;p&gt;4.&amp;#xCC3E;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4; &amp;#xD68D;&amp;#xB4DD;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SPI&amp;#xC640; API&amp;#xB294; &amp;#xBB50;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978;&amp;#xAC00;&amp;#xC694;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; API&amp;#xC640; SPI&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC704;&amp;#xC758; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; JNDI&amp;#xB294; API&amp;#xC640; SPI &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. API&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB098; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.seulgi.kim/2014/08/service-provider-interface.html&#34;&gt;SPI(Service Provider Interface)&lt;/a&gt;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xD655;&amp;#xC7A5;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; API&amp;#xB85C;&amp;#xC11C;, &amp;#xC11C;&amp;#xBC84; &amp;#xACC4;&amp;#xCE35;&amp;#xC5D0;&amp;#xC11C; LDAP,DNS,NDS &amp;#xB4F1;&amp;#xC758; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; API&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC704;&amp;#xD574; JNDI&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; SPI&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[해키피디아] JNDI(Java Naming and Directory Interface) - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;JNDI-Java-Naming-and-Directory-Interface&#34;&gt;&lt;a href=&#34;#JNDI-Java-Naming-and-Directory-Interface&#34; class=&#34;headerlink&#34; title=&#34;JNDI(Java Naming and Directory Interface)&#34;&gt;&lt;/a&gt;JNDI(Java Naming and Directory Interface)&lt;/h1&gt;&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; log4j&amp;#xC758; RCE &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C; &amp;#xAE30;&amp;#xB2A5;&amp;#xC778; JNDI&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;JNDI(Java Naming and Directory Interface)&amp;#xB294; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBC0F; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xBC1C;&amp;#xACAC;(discover)&amp;#xD558;&amp;#xACE0; &amp;#xCC38;&amp;#xACE0;(lookup)&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xC790;&amp;#xBC14; API&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC704;&amp;#xB294; &amp;#xC704;&amp;#xD0A4;&amp;#xBC31;&amp;#xACFC;&amp;#xC758; &amp;#xC815;&amp;#xC758;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBA3C;&amp;#xC800; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;What-is-Naming-Service&#34;&gt;&lt;a href=&#34;#What-is-Naming-Service&#34; class=&#34;headerlink&#34; title=&#34;What is Naming Service?&#34;&gt;&lt;/a&gt;What is Naming Service?&lt;/h2&gt;&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB294; &amp;#xC9C1;&amp;#xC5ED;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xC791;&amp;#xBA85; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC870;&amp;#xAE08; &amp;#xC790;&amp;#xC138;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74;, &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xC774;&amp;#xB984;, &amp;#xC8FC;&amp;#xC18C;, &amp;#xC720;&amp;#xC800; &amp;#xC774;&amp;#xB984; &amp;#xB4F1;&amp;#xC758; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xD2B9;&amp;#xC815; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xD574;&amp;#xB450;&amp;#xACE0; &amp;#xC720;&amp;#xC800;&amp;#xB098; &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; DNS&amp;#xB97C; &amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xACA0;&amp;#xB124;&amp;#xC694;! &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; hackyboiz &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xB97C; &amp;#xC811;&amp;#xC18D;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xB2E4;&amp;#xBA74; hackyboiz&amp;#xC758; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; IP&amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544;&amp;#xB3C4; &amp;#xC6B0;&amp;#xB9AC;&amp;#xB294;&lt;a href=&#34;http://www.hackyboiz.github.io&#34;&gt;&lt;code&gt;hackyboiz.github.io&lt;/code&gt;&lt;/a&gt;&amp;#xB9CC; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xB3C4; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xC811;&amp;#xC18D;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xB78C;&amp;#xC774; &amp;#xAE30;&amp;#xC5B5;&amp;#xD558;&amp;#xAE34; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4; IP&amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC790;&amp;#xC5F0;&amp;#xC5B4;&amp;#xB85C; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9C4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xB124;&amp;#xC774;&amp;#xBC0D;&amp;#xD574;&amp;#xC900; &amp;#xAC83; &amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;What-is-Directory-Service&#34;&gt;&lt;a href=&#34;#What-is-Directory-Service&#34; class=&#34;headerlink&#34; title=&#34;What is Directory Service?&#34;&gt;&lt;/a&gt;What is Directory Service?&lt;/h2&gt;&lt;blockquote&gt;
&lt;p&gt;&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;(directory service, DS)&amp;#xB294; &amp;#xCEF4;&amp;#xD4E8;&amp;#xD130; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xC640; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC790;&amp;#xC6D0;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xACE0; &amp;#xC870;&amp;#xC9C1;&amp;#xD558;&amp;#xB294; &amp;#xC751;&amp;#xC6A9; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4; (&amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xC758; &amp;#xBAA8;&amp;#xC784;)&amp;#xC774;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC989;, &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xD658;&amp;#xACBD;&amp;#xC5D0;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xB4F1;&amp;#xB85D;,&amp;#xC870;&amp;#xD68C;,&amp;#xC0AD;&amp;#xC81C; &amp;#xB4F1;&amp;#xC758; &amp;#xAD00;&amp;#xB9AC;&amp;#xAC00; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC18C;&amp;#xD504;&amp;#xD2B8;&amp;#xC6E8;&amp;#xC5B4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC5EC;&amp;#xAE30;&amp;#xC5D0;&amp;#xC11C; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC;&amp;#xB294; &amp;#xC774;&amp;#xB984;&amp;#xC774; &amp;#xC788;&amp;#xB294; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xB9D0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC640; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB9DE;&amp;#xBB3C;&amp;#xB824; &amp;#xC791;&amp;#xB3D9;&amp;#xD560;&amp;#xC9C0; &amp;#xAC10;&amp;#xC774; &amp;#xC624;&amp;#xC2DC;&amp;#xB098;&amp;#xC694;? &amp;#xADF8;&amp;#xB7FC;, &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; JNDI&amp;#xAC00; &amp;#xBB34;&amp;#xC5C7;&amp;#xC778;&amp;#xC9C0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;? JNDI&amp;#xB294; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xB97C; &amp;#xCC38;&amp;#xACE0;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC744; &amp;#xB54C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB984; &amp;#xC9C0;&amp;#xC5B4;&amp;#xC9C4; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544; &amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; &amp;#xC778;&amp;#xD130;&amp;#xD398;&amp;#xC774;&amp;#xC2A4;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;Component-and-Flow-of-JNDI&#34;&gt;&lt;a href=&#34;#Component-and-Flow-of-JNDI&#34; class=&#34;headerlink&#34; title=&#34;Component and Flow of JNDI&#34;&gt;&lt;/a&gt;Component and Flow of JNDI&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2022/01/26/poosic/JNDI/image.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;1.&amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC01; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB9DE;&amp;#xAC8C; &amp;#xC774;&amp;#xB984;&amp;#xACFC; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xBC14;&amp;#xC778;&amp;#xB4DC;&amp;#xD558;&amp;#xC5EC; &amp;#xB610; &amp;#xB2E4;&amp;#xB978; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC778; &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8; &amp;#xC0DD;&amp;#xC131;&lt;/p&gt;
&lt;p&gt;2.&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xD2B9;&amp;#xC815; &amp;#xAC1C;&amp;#xCCB4;&amp;#xC758; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xCCAD;&lt;/p&gt;
&lt;p&gt;3.&amp;#xB514;&amp;#xB809;&amp;#xD1A0;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0;&amp;#xC11C; JNDI name&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC694;&amp;#xCCAD;&amp;#xD55C; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC11C; SPI &amp;#xD638;&amp;#xCD9C;&lt;/p&gt;
&lt;p&gt;4.&amp;#xCC3E;&amp;#xC740; &amp;#xAC1D;&amp;#xCCB4;&amp;#xC5D0; &amp;#xB9DE;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790;&amp;#xC640; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xC5EC; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC18C;&amp;#xC2A4; &amp;#xD68D;&amp;#xB4DD;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SPI&amp;#xC640; API&amp;#xB294; &amp;#xBB50;&amp;#xAC00; &amp;#xB2E4;&amp;#xB978;&amp;#xAC00;&amp;#xC694;?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC0AC;&amp;#xC2E4; API&amp;#xC640; SPI&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC704;&amp;#xC758; &amp;#xADF8;&amp;#xB9BC;&amp;#xCC98;&amp;#xB7FC; JNDI&amp;#xB294; API&amp;#xC640; SPI &amp;#xB450; &amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xAD6C;&amp;#xBD84;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. API&amp;#xB294; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xB124;&amp;#xC774;&amp;#xBC0D; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xB098; &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://blog.seulgi.kim/2014/08/service-provider-interface.html&#34;&gt;SPI(Service Provider Interface)&lt;/a&gt;&amp;#xB294; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC758; &amp;#xD655;&amp;#xC7A5;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; API&amp;#xB85C;&amp;#xC11C;, &amp;#xC11C;&amp;#xBC84; &amp;#xACC4;&amp;#xCE35;&amp;#xC5D0;&amp;#xC11C; LDAP,DNS,NDS &amp;#xB4F1;&amp;#xC758; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xC81C;&amp;#xACF5;&amp;#xC790;&amp;#xB4E4;&amp;#xACFC; &amp;#xC5F0;&amp;#xACB0;&amp;#xD574;&amp;#xC8FC;&amp;#xB294; &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBCF4;&amp;#xC790;&amp;#xBA74; API&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC704;&amp;#xD574; JNDI&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xACE0; SPI&amp;#xB294; &amp;#xC11C;&amp;#xBC84; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xC704;&amp;#xD574; &amp;#xC11C;&amp;#xBE44;&amp;#xC2A4; &amp;#xACF5;&amp;#xAE09;&amp;#xC790; &amp;#xCE21;&amp;#xC5D0;&amp;#xC11C; &amp;#xC81C;&amp;#xACF5;&amp;#xB418;&amp;#xC5B4; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB41C;&amp;#xB2E4;&amp;#xB294; &amp;#xCC28;&amp;#xC774;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/hackypedia.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2022/01/26/poosic/jndi/">

  <title>[해키피디아] JNDI(Java Naming and Directory Interface) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2022-01-26 14:00" pubdate>
      2022년 1월 26일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      945 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      18
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[해키피디아] JNDI(Java Naming and Directory Interface)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="JNDI-Java-Naming-and-Directory-Interface"><a href="#JNDI-Java-Naming-and-Directory-Interface" class="headerlink" title="JNDI(Java Naming and Directory Interface)"></a>JNDI(Java Naming and Directory Interface)</h1><p>&#xC624;&#xB298;&#xC740; log4j&#xC758; RCE &#xCDE8;&#xC57D;&#xC810;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB41C; &#xAE30;&#xB2A5;&#xC778; JNDI&#xC5D0; &#xB300;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;! </p>
<blockquote>
<p>JNDI(Java Naming and Directory Interface)&#xB294; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xBC0F; &#xAC1D;&#xCCB4;&#xB97C; &#xBC1C;&#xACAC;(discover)&#xD558;&#xACE0; &#xCC38;&#xACE0;(lookup)&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC790;&#xBC14; API&#xB2E4;.</p>
</blockquote>
<p>&#xC704;&#xB294; &#xC704;&#xD0A4;&#xBC31;&#xACFC;&#xC758; &#xC815;&#xC758;&#xC785;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC640; &#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="What-is-Naming-Service"><a href="#What-is-Naming-Service" class="headerlink" title="What is Naming Service?"></a>What is Naming Service?</h2><p>&#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xC9C1;&#xC5ED;&#xD574;&#xBCF4;&#xBA74; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC791;&#xBA85; &#xC11C;&#xBE44;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;. &#xC870;&#xAE08; &#xC790;&#xC138;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74;, &#xCEF4;&#xD4E8;&#xD130; &#xC774;&#xB984;, &#xC8FC;&#xC18C;, &#xC720;&#xC800; &#xC774;&#xB984; &#xB4F1;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xD2B9;&#xC815; &#xACF5;&#xAC04;&#xC5D0; &#xC800;&#xC7A5;&#xD574;&#xB450;&#xACE0; &#xC720;&#xC800;&#xB098; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xD574;&#xB2F9; &#xCEF4;&#xD4E8;&#xD130;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xD45C;&#xC801;&#xC778; &#xC608;&#xC2DC;&#xB85C; DNS&#xB97C; &#xB4E4; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;! &#xC6B0;&#xB9AC;&#xAC00; hackyboiz &#xBE14;&#xB85C;&#xADF8;&#xB97C; &#xC811;&#xC18D;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; hackyboiz&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xB300;&#xD55C; IP&#xC8FC;&#xC18C;&#xB97C; &#xC785;&#xB825;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xC6B0;&#xB9AC;&#xB294;<a target="_blank" rel="external nofollow noopener noreferrer" href="http://www.hackyboiz.github.io"><code>hackyboiz.github.io</code></a>&#xB9CC; &#xC785;&#xB825;&#xD574;&#xB3C4; &#xAC04;&#xB2E8;&#xD788; &#xC811;&#xC18D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0AC;&#xB78C;&#xC774; &#xAE30;&#xC5B5;&#xD558;&#xAE34; &#xC5B4;&#xB824;&#xC6B4; IP&#xC8FC;&#xC18C;&#xC5D0; &#xC790;&#xC5F0;&#xC5B4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xB124;&#xC774;&#xBC0D;&#xD574;&#xC900; &#xAC83; &#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="What-is-Directory-Service"><a href="#What-is-Directory-Service" class="headerlink" title="What is Directory Service?"></a>What is Directory Service?</h2><blockquote>
<p>&#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;(directory service, DS)&#xB294; &#xCEF4;&#xD4E8;&#xD130; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xC0AC;&#xC6A9;&#xC790;&#xC640; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC790;&#xC6D0;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC870;&#xC9C1;&#xD558;&#xB294; &#xC751;&#xC6A9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; (&#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC758; &#xBAA8;&#xC784;)&#xC774;&#xB2E4;.</p>
</blockquote>
<p>&#xC989;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130; &#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xB4F1;&#xB85D;,&#xC870;&#xD68C;,&#xC0AD;&#xC81C; &#xB4F1;&#xC758; &#xAD00;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB294; &#xC774;&#xB984;&#xC774; &#xC788;&#xB294; &#xAC1D;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xC640; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xB9DE;&#xBB3C;&#xB824; &#xC791;&#xB3D9;&#xD560;&#xC9C0; &#xAC10;&#xC774; &#xC624;&#xC2DC;&#xB098;&#xC694;? &#xADF8;&#xB7FC;, &#xAC04;&#xB2E8;&#xD788; JNDI&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xB2E4;&#xC2DC; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;? JNDI&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130; &#xBCA0;&#xC774;&#xC2A4;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xACE0; &#xC2F6;&#xC744; &#xB54C; &#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xB984; &#xC9C0;&#xC5B4;&#xC9C4; &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xC544; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB3C4;&#xC640;&#xC8FC;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;!</p>
<h2 id="Component-and-Flow-of-JNDI"><a href="#Component-and-Flow-of-JNDI" class="headerlink" title="Component and Flow of JNDI"></a>Component and Flow of JNDI</h2><p><img src="/2022/01/26/poosic/JNDI/image.png" srcset="/img/loading.gif" alt></p>
<p>1.&#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C;&#xB294; &#xAC01; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB9DE;&#xAC8C; &#xC774;&#xB984;&#xACFC; &#xAC1D;&#xCCB4;&#xB97C; &#xBC14;&#xC778;&#xB4DC;&#xD558;&#xC5EC; &#xB610; &#xB2E4;&#xB978; &#xAC1D;&#xCCB4;&#xC778; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC0DD;&#xC131;</p>
<p>2.&#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xCE21;&#xC5D0;&#xC11C; &#xD2B9;&#xC815; &#xAC1C;&#xCCB4;&#xC758; &#xB370;&#xC774;&#xD130; &#xC694;&#xCCAD;</p>
<p>3.&#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; JNDI name&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC694;&#xCCAD;&#xD55C; &#xAC1D;&#xCCB4;&#xB97C; &#xCC3E;&#xC544;&#xC11C; SPI &#xD638;&#xCD9C;</p>
<p>4.&#xCC3E;&#xC740; &#xAC1D;&#xCCB4;&#xC5D0; &#xB9DE;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xACF5;&#xAE09;&#xC790;&#xC640; &#xC5F0;&#xACB0;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4; &#xD68D;&#xB4DD;</p>
<p><strong>SPI&#xC640; API&#xB294; &#xBB50;&#xAC00; &#xB2E4;&#xB978;&#xAC00;&#xC694;?</strong></p>
<p>&#xC0AC;&#xC2E4; API&#xC640; SPI&#xB294; &#xB2E4;&#xB974;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC704;&#xC758; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; JNDI&#xB294; API&#xC640; SPI &#xB450; &#xAC00;&#xC9C0;&#xB85C; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;. API&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xB124;&#xC774;&#xBC0D; &#xC11C;&#xBE44;&#xC2A4;&#xB098; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xB370;&#xC5D0; &#xD638;&#xCD9C;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.seulgi.kim/2014/08/service-provider-interface.html">SPI(Service Provider Interface)</a>&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xD655;&#xC7A5;&#xC744; &#xC704;&#xD574; &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC790; &#xCE21;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; API&#xB85C;&#xC11C;, &#xC11C;&#xBC84; &#xACC4;&#xCE35;&#xC5D0;&#xC11C; LDAP,DNS,NDS &#xB4F1;&#xC758; &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC790;&#xB4E4;&#xACFC; &#xC5F0;&#xACB0;&#xD574;&#xC8FC;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC790;&#xBA74; API&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21;&#xC5D0;&#xC11C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC811;&#xADFC;&#xC744; &#xC704;&#xD574; JNDI&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xC774;&#xACE0; SPI&#xB294; &#xC11C;&#xBC84; &#xCE21;&#xC5D0;&#xC11C; &#xC11C;&#xBE44;&#xC2A4; &#xACF5;&#xAE09;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xC811;&#xADFC;&#xC744; &#xC704;&#xD574; &#xC11C;&#xBE44;&#xC2A4; &#xACF5;&#xAE09;&#xC790; &#xCE21;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xB294; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Hackypedia/">Hackypedia</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/log4j/">log4j</a>
                  
                  <a class="hover-with-bg" href="/tags/poosic/">poosic</a>
                  
                  <a class="hover-with-bg" href="/tags/JNDI/">JNDI</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_poosic.jpg" srcset="/img/loading.gif" alt="poosic">
                  </div>

                  <div class="link-text">
                    <div class="link-title">poosic</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/poosic">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2022/01/27/l0ch/2022-01-27/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2021-45608: NetUSB 원격 코드 실행 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2022/01/25/fabu1ous/2022-01-25/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-34423: Zooming in on Zero-click Exploits</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2022/01/26/poosic/JNDI/';
        this.page.identifier = '/2022/01/26/poosic/JNDI/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[해키피디아] JNDI(Java Naming and Directory Interface)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
