

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/&#34;&gt;https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/&lt;/a&gt; &lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf&#34;&gt;https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;gt; ARMv8.3&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;Fabu1ous&amp;#xB2D8;&amp;#xC774; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xC81C;&amp;#xAC00; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xB85C; &amp;#xC4F0;&amp;#xB824;&amp;#xB358; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xC81C; &amp;#xC368;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xBC14;&amp;#xB78C;&amp;#xC5D0;&amp;#x2026; &amp;#xC624;&amp;#xB298;&amp;#xC740; &lt;code&gt;PAC&lt;/code&gt;&amp;#xC640; &lt;code&gt;PAC Forgery&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC&lt;/code&gt;&amp;#xB294; &lt;code&gt;Pointer Authentication Code&lt;/code&gt;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC778;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ARMv8.3-A&lt;/code&gt;&amp;#xBD80;&amp;#xD130; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xBA70; iOS&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xB9CE;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xAC14;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC608;&amp;#x2026; &amp;#xC800;&amp;#xB294; &amp;#xC548;&amp;#xD574;&amp;#xBD10;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&amp;#x2026;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB294; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xBABB;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ARMv9&lt;/code&gt;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; Cortex CPU&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://community.arm.com/developer/ip-products/processors/b/processors-ip-blog/posts/first-armv9-cpu-cores&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&amp;#xB97C; &amp;#xBD24;&amp;#xB294;&amp;#xB370;, &amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB313;&amp;#xAE00; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x315C;&amp;#x315C;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC&lt;/code&gt;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xB9E4;&amp;#xC6B0; &amp;#x201C;&amp;#xAC04;&amp;#xB2E8;&amp;#x201D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800;, pac&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;(ex. &lt;code&gt;paciasp&lt;/code&gt;, &lt;code&gt;pacia&lt;/code&gt;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; context&amp;#xC640; key &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; sign&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C;, key&amp;#xB294; 128&amp;#xBE44;&amp;#xD2B8; &amp;#xAC12;&amp;#xC774;&amp;#xBA70; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC77C;&amp;#xB2E8; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. context&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;paciasp&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&lt;code&gt;paciasp&lt;/code&gt;&amp;#xC758; &amp;#xB9E8;&amp;#xB4A4;&amp;#xAC00; sp&amp;#xC778; &amp;#xC774;&amp;#xC720;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xAC12;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xB418;&amp;#xC5B4; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;a href=&#34;https://eprint.iacr.org/2016/444.pdf&#34;&gt;QARMA&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; CPU &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB294; sign&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Sign&amp;#xD55C; &amp;#xB4A4;, &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; aut&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xBCC0;&amp;#xC870;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xAC12;&amp;#xACFC; context &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; key &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; userspace&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;PAC&lt;/code&gt;&amp;#xC0DD;&amp;#xC131; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; key&amp;#xC640; context&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xB9CC; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xBD80;&amp;#xD569;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC Forgery&lt;/code&gt;&amp;#xB294; key&amp;#xC640; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC5C6;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xC608;&amp;#xC2DC; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;LR&lt;/code&gt;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; ASLR&amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; PAC &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;sign_contract()&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;pacia&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;code&gt;pacia&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; context&amp;#xB97C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;code&gt;PAC&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &lt;code&gt;PAC&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;LR&lt;/code&gt;&amp;#xC5D0; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xC5EC; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB9CC;, &amp;#xD574;&amp;#xB2F9; &amp;#xC608;&amp;#xC2DC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;pacia&lt;/code&gt;&amp;#xB97C; &amp;#xC790;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xACE0; &lt;code&gt;ASLR&lt;/code&gt;&amp;#xC774; &amp;#xC548; &amp;#xAC78;&amp;#xB824; &amp;#xC788;&amp;#xC5B4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xAE30; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC26C;&amp;#xC6B4; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC5BC;&amp;#xC6D4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;information leak&lt;/code&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; pac &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB450;&amp;#xAC1C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xC11C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4;&amp;#xAC74;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC5B8;&amp;#xC820;&amp;#xAC00;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[하루한줄] PAC와 PAC Forgery - hackyboiz">
  <meta property="og:description" content="&lt;h2 id=&#34;URL&#34;&gt;&lt;a href=&#34;#URL&#34; class=&#34;headerlink&#34; title=&#34;URL&#34;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/&#34;&gt;https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/&lt;/a&gt; &lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&lt;a href=&#34;https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf&#34;&gt;https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf&lt;/a&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Target&#34;&gt;&lt;a href=&#34;#Target&#34; class=&#34;headerlink&#34; title=&#34;Target&#34;&gt;&lt;/a&gt;Target&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&amp;gt; ARMv8.3&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;Explain&#34;&gt;&lt;a href=&#34;#Explain&#34; class=&#34;headerlink&#34; title=&#34;Explain&#34;&gt;&lt;/a&gt;Explain&lt;/h2&gt;&lt;p&gt;Fabu1ous&amp;#xB2D8;&amp;#xC774; &amp;#xB9D0;&amp;#xB3C4; &amp;#xC5C6;&amp;#xC774; &amp;#xC81C;&amp;#xAC00; &amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xB85C; &amp;#xC4F0;&amp;#xB824;&amp;#xB358; &amp;#xC8FC;&amp;#xC81C;&amp;#xB97C; &amp;#xC5B4;&amp;#xC81C; &amp;#xC368;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294; &amp;#xBC14;&amp;#xB78C;&amp;#xC5D0;&amp;#x2026; &amp;#xC624;&amp;#xB298;&amp;#xC740; &lt;code&gt;PAC&lt;/code&gt;&amp;#xC640; &lt;code&gt;PAC Forgery&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C; &amp;#xAC04;&amp;#xB2E8;&amp;#xD558;&amp;#xAC8C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC&lt;/code&gt;&amp;#xB294; &lt;code&gt;Pointer Authentication Code&lt;/code&gt;&amp;#xC758; &amp;#xC57D;&amp;#xC790;&amp;#xB85C;, &amp;#xB9D0; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB4E4;&amp;#xC744; &amp;#xC778;&amp;#xC99D;&amp;#xD558;&amp;#xB294; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ARMv8.3-A&lt;/code&gt;&amp;#xBD80;&amp;#xD130; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xBA70; iOS&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; &amp;#xBBF8;&amp;#xD2F0;&amp;#xAC8C;&amp;#xC774;&amp;#xC158;&amp;#xC744; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xB09C;&amp;#xC774;&amp;#xB3C4;&amp;#xAC00; &amp;#xB9CE;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xAC14;&amp;#xB2E4;&amp;#xACE0; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC608;&amp;#x2026; &amp;#xC800;&amp;#xB294; &amp;#xC548;&amp;#xD574;&amp;#xBD10;&amp;#xC11C; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;&amp;#x2026;?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB4DC;&amp;#xB85C;&amp;#xC774;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC9C0;&amp;#xC6D0;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xC5EC;&amp;#xBD80;&amp;#xB294; &amp;#xC81C;&amp;#xB300;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xC744; &amp;#xBABB;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;ARMv9&lt;/code&gt;&amp;#xB85C; &amp;#xB098;&amp;#xC624;&amp;#xB294; Cortex CPU&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB97C; &amp;#xC9C0;&amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;a href=&#34;https://community.arm.com/developer/ip-products/processors/b/processors-ip-blog/posts/first-armv9-cpu-cores&#34;&gt;&amp;#xAE30;&amp;#xC0AC;&lt;/a&gt;&amp;#xB97C; &amp;#xBD24;&amp;#xB294;&amp;#xB370;, &amp;#xD639;&amp;#xC2DC; &amp;#xC544;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xBA74; &amp;#xB313;&amp;#xAE00; &amp;#xB2EC;&amp;#xC544;&amp;#xC8FC;&amp;#xC138;&amp;#xC694; &amp;#x315C;&amp;#x315C;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC&lt;/code&gt;&amp;#xAC00; &amp;#xB3D9;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC740; &amp;#xB9E4;&amp;#xC6B0; &amp;#x201C;&amp;#xAC04;&amp;#xB2E8;&amp;#x201D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800;, pac&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;(ex. &lt;code&gt;paciasp&lt;/code&gt;, &lt;code&gt;pacia&lt;/code&gt;)&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; context&amp;#xC640; key &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; sign&amp;#xC744; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C;, key&amp;#xB294; 128&amp;#xBE44;&amp;#xD2B8; &amp;#xAC12;&amp;#xC774;&amp;#xBA70; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC77C;&amp;#xB2E8; &amp;#xC720;&amp;#xC800; &amp;#xAD8C;&amp;#xD55C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB2F9;&amp;#xC5F0;&amp;#xD788; &amp;#xC811;&amp;#xADFC;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. context&amp;#xB294; 64&amp;#xBE44;&amp;#xD2B8; &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;paciasp&lt;/code&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0;, &amp;#xC2A4;&amp;#xD0DD; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.(&lt;code&gt;paciasp&lt;/code&gt;&amp;#xC758; &amp;#xB9E8;&amp;#xB4A4;&amp;#xAC00; sp&amp;#xC778; &amp;#xC774;&amp;#xC720;)&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &amp;#xC774; &amp;#xC138; &amp;#xAC1C;&amp;#xC758; &amp;#xAC12;&amp;#xC740; &amp;#xD2B9;&amp;#xC815; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC73C;&amp;#xB85C; &amp;#xACC4;&amp;#xC0B0;&amp;#xB418;&amp;#xC5B4; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;a href=&#34;https://eprint.iacr.org/2016/444.pdf&#34;&gt;QARMA&lt;/a&gt;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; CPU &amp;#xC81C;&amp;#xC870;&amp;#xC0AC;&amp;#xB9C8;&amp;#xB2E4; &amp;#xCEE4;&amp;#xC2A4;&amp;#xD140;&amp;#xC774; &amp;#xAC00;&amp;#xB2A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB807;&amp;#xAC8C; &amp;#xC0DD;&amp;#xC131;&amp;#xB41C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB294; sign&amp;#xD558;&amp;#xB824;&amp;#xACE0; &amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xC758; &amp;#xC0C1;&amp;#xC704; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Sign&amp;#xD55C; &amp;#xB4A4;, &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xB54C;&amp;#xC5D0;&amp;#xB294; &amp;#xBA3C;&amp;#xC800; aut&amp;#xB85C; &amp;#xC2DC;&amp;#xC791;&amp;#xD558;&amp;#xB294; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xBCC0;&amp;#xC870;&amp;#xB418;&amp;#xC5C8;&amp;#xB294;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB611;&amp;#xAC19;&amp;#xC774; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xAC12;&amp;#xACFC; context &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; key &amp;#xAC12;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xD574;&amp;#xB2F9; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC778;&amp;#xC9C0;&amp;#xB97C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; userspace&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &lt;code&gt;PAC&lt;/code&gt;&amp;#xC0DD;&amp;#xC131; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; key&amp;#xC640; context&amp;#xBFD0;&amp;#xB9CC; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C; &lt;code&gt;PAC&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC744; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xB9CC; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xBD80;&amp;#xD569;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xC5BB;&amp;#xC5B4;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;code&gt;PAC Forgery&lt;/code&gt;&amp;#xB294; key&amp;#xC640; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998; &amp;#xC5C6;&amp;#xC774; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xAE30;&amp;#xBC95;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &amp;#xBE14;&amp;#xB85C;&amp;#xADF8;&amp;#xC758; &amp;#xC608;&amp;#xC2DC; &amp;#xBB38;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &amp;#xC624;&amp;#xBC84;&amp;#xD50C;&amp;#xB85C;&amp;#xC6B0;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;LR&lt;/code&gt;&amp;#xC744; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; ASLR&amp;#xC774; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; PAC &amp;#xC0DD;&amp;#xC131;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &amp;#xC2A4;&amp;#xD0DD; &amp;#xC8FC;&amp;#xC18C;&amp;#xB294; &amp;#xB514;&amp;#xBC84;&amp;#xAE45;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; &lt;code&gt;sign_contract()&lt;/code&gt;&amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;pacia&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &amp;#xD2B9;&amp;#xC815; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD130;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; PAC&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xCC98;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &lt;code&gt;pacia&lt;/code&gt; &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xACE0; context&amp;#xB97C; &amp;#xC54C;&amp;#xACE0; &amp;#xC788;&amp;#xB2E4;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &lt;code&gt;PAC&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xACE0; &amp;#xC2F6;&amp;#xC740; &amp;#xC8FC;&amp;#xC18C;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &lt;code&gt;PAC&lt;/code&gt; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &lt;code&gt;LR&lt;/code&gt;&amp;#xC5D0; &amp;#xB123;&amp;#xC73C;&amp;#xBA74; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC810;&amp;#xD504;&amp;#xD558;&amp;#xC5EC; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB9CC;, &amp;#xD574;&amp;#xB2F9; &amp;#xC608;&amp;#xC2DC; &amp;#xBB38;&amp;#xC81C;&amp;#xB294; &lt;code&gt;pacia&lt;/code&gt;&amp;#xB97C; &amp;#xC790;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xD65C;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC0C1;&amp;#xD669;&amp;#xC774;&amp;#xACE0; &lt;code&gt;ASLR&lt;/code&gt;&amp;#xC774; &amp;#xC548; &amp;#xAC78;&amp;#xB824; &amp;#xC788;&amp;#xC5B4; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xD558;&amp;#xAE30; &amp;#xB9E4;&amp;#xC6B0; &amp;#xC26C;&amp;#xC6B4; &amp;#xC0C1;&amp;#xD669;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9AC;&amp;#xC5BC;&amp;#xC6D4;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;information leak&lt;/code&gt; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xACFC; pac &amp;#xBA85;&amp;#xB839;&amp;#xC5B4;&amp;#xB4E4;&amp;#xC744; &amp;#xD65C;&amp;#xC6A9;&amp;#xD558;&amp;#xB294; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C;&amp;#xD558;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB450;&amp;#xAC1C;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC5B4;&amp;#xC57C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB798;&amp;#xC11C; &amp;#xC5B4;&amp;#xB824;&amp;#xC6B4;&amp;#xAC74;&amp;#xC9C0; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xB124;&amp;#xC694;. &amp;#xC5B8;&amp;#xC820;&amp;#xAC00;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &amp;#xC9C1;&amp;#xC811; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC774;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; &amp;#xAE00;&amp;#xC744; &amp;#xC368;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/img/1day1line.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/06/27/j0ker/2021-06-27/">

  <title>[하루한줄] PAC와 PAC Forgery - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-06-27 14:00" pubdate>
      2021년 6월 27일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      1k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      20
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[하루한줄] PAC와 PAC Forgery</h1>
                       
            <div class="markdown-body" id="post-body">
              <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              <!-- hackyboiz_horizen_index -->
              <ins class="adsbygoogle" style="display:block" data-ad-client="ca-pub-3672652207808168" data-ad-slot="8887862313" data-ad-format="auto" data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              <h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><ul>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/">https://blog.ret2.io/2021/06/16/intro-to-pac-arm64/</a> </p>
</li>
<li><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf">https://events.static.linuxfound.org/sites/events/files/slides/slides_23.pdf</a></p>
</li>
</ul>
<h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul>
<li>&gt; ARMv8.3</li>
</ul>
<h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>Fabu1ous&#xB2D8;&#xC774; &#xB9D0;&#xB3C4; &#xC5C6;&#xC774; &#xC81C;&#xAC00; &#xD558;&#xB8E8;&#xD55C;&#xC904;&#xB85C; &#xC4F0;&#xB824;&#xB358; &#xC8FC;&#xC81C;&#xB97C; &#xC5B4;&#xC81C; &#xC368;&#xBC84;&#xB9AC;&#xB294; &#xBC14;&#xB78C;&#xC5D0;&#x2026; &#xC624;&#xB298;&#xC740; <code>PAC</code>&#xC640; <code>PAC Forgery</code>&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>PAC</code>&#xB294; <code>Pointer Authentication Code</code>&#xC758; &#xC57D;&#xC790;&#xB85C;, &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xD3EC;&#xC778;&#xD130;&#xB4E4;&#xC744; &#xC778;&#xC99D;&#xD558;&#xB294; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. <code>ARMv8.3-A</code>&#xBD80;&#xD130; &#xC9C0;&#xC6D0;&#xD558;&#xBA70; iOS&#xC5D0;&#xC11C; &#xC774; &#xBBF8;&#xD2F0;&#xAC8C;&#xC774;&#xC158;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xBA74;&#xC11C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB9CE;&#xC774; &#xC62C;&#xB77C;&#xAC14;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xC608;&#x2026; &#xC800;&#xB294; &#xC548;&#xD574;&#xBD10;&#xC11C; &#xC5BC;&#xB9C8;&#xB098; &#xC5B4;&#xB824;&#xC6B4;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB124;&#xC694;&#x2026;?</p>
</blockquote>
<p>&#xC548;&#xB4DC;&#xB85C;&#xC774;&#xB4DC;&#xC5D0;&#xC11C;&#xB3C4; &#xC9C0;&#xC6D0;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB294; &#xC81C;&#xB300;&#xB85C; &#xD655;&#xC778;&#xC744; &#xBABB;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. <code>ARMv9</code>&#xB85C; &#xB098;&#xC624;&#xB294; Cortex CPU&#xC5D0;&#xC11C; <code>PAC</code>&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://community.arm.com/developer/ip-products/processors/b/processors-ip-blog/posts/first-armv9-cpu-cores">&#xAE30;&#xC0AC;</a>&#xB97C; &#xBD24;&#xB294;&#xB370;, &#xD639;&#xC2DC; &#xC544;&#xC2DC;&#xB294; &#xBD84;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xB313;&#xAE00; &#xB2EC;&#xC544;&#xC8FC;&#xC138;&#xC694; &#x315C;&#x315C;</p>
<p><code>PAC</code>&#xAC00; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC740; &#xB9E4;&#xC6B0; &#x201C;&#xAC04;&#xB2E8;&#x201D;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800;, pac&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;(ex. <code>paciasp</code>, <code>pacia</code>)&#xB97C; &#xD1B5;&#xD574; context&#xC640; key &#xADF8;&#xB9AC;&#xACE0; &#xD574;&#xB2F9; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD574; sign&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C;, key&#xB294; 128&#xBE44;&#xD2B8; &#xAC12;&#xC774;&#xBA70; &#xC2DC;&#xC2A4;&#xD15C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xC77C;&#xB2E8; &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC5D0;&#xC11C;&#xB294; &#xB2F9;&#xC5F0;&#xD788; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. context&#xB294; 64&#xBE44;&#xD2B8; &#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. <code>paciasp</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; PAC&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xACBD;&#xC6B0;, &#xC2A4;&#xD0DD; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.(<code>paciasp</code>&#xC758; &#xB9E8;&#xB4A4;&#xAC00; sp&#xC778; &#xC774;&#xC720;)</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC774; &#xC138; &#xAC1C;&#xC758; &#xAC12;&#xC740; &#xD2B9;&#xC815; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC73C;&#xB85C; &#xACC4;&#xC0B0;&#xB418;&#xC5B4; PAC&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://eprint.iacr.org/2016/444.pdf">QARMA</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; CPU &#xC81C;&#xC870;&#xC0AC;&#xB9C8;&#xB2E4; &#xCEE4;&#xC2A4;&#xD140;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xC131;&#xB41C; <code>PAC</code>&#xB294; sign&#xD558;&#xB824;&#xACE0; &#xD55C; &#xD3EC;&#xC778;&#xD130;&#xC758; &#xC0C1;&#xC704; &#xC8FC;&#xC18C;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>Sign&#xD55C; &#xB4A4;, &#xD574;&#xB2F9; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xBA3C;&#xC800; aut&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xBCC0;&#xC870;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xB611;&#xAC19;&#xC774; &#xD3EC;&#xC778;&#xD130; &#xAC12;&#xACFC; context &#xADF8;&#xB9AC;&#xACE0; key &#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xD574;&#xB2F9; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC815;&#xC0C1;&#xC778;&#xC9C0;&#xB97C; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; userspace&#xC5D0;&#xC11C;&#xB294; <code>PAC</code>&#xC0DD;&#xC131; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; key&#xC640; context&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; <code>PAC</code>&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xC5B4;&#xC57C;&#xB9CC; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0; &#xBD80;&#xD569;&#xD558;&#xB294; &#xAC12;&#xC744; &#xC5BB;&#xC5B4;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>PAC Forgery</code>&#xB294; key&#xC640; &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xC5C6;&#xC774; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCAB; &#xBC88;&#xC9F8; &#xBE14;&#xB85C;&#xADF8;&#xC758; &#xC608;&#xC2DC; &#xBB38;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xBC84;&#xD37C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xD1B5;&#xD574; <code>LR</code>&#xC744; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xB294; ASLR&#xC774; &#xAC78;&#xB824;&#xC788;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; PAC &#xC0DD;&#xC131;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC2A4;&#xD0DD; &#xC8FC;&#xC18C;&#xB294; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD1B5;&#xD574; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; <code>sign_contract()</code>&#xD568;&#xC218;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; <code>pacia</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD2B9;&#xC815; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xB300;&#xD55C; PAC&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xCC98;&#xB7FC; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; <code>pacia</code> &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xACE0; context&#xB97C; &#xC54C;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xC6D0;&#xD558;&#xB294; <code>PAC</code> &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xBA74; &#xC774;&#xB7F0; &#xAE30;&#xB2A5;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC810;&#xD504;&#xD558;&#xACE0; &#xC2F6;&#xC740; &#xC8FC;&#xC18C;&#xC5D0; &#xB300;&#xD55C; <code>PAC</code> &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; <code>LR</code>&#xC5D0; &#xB123;&#xC73C;&#xBA74; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xB85C; &#xC810;&#xD504;&#xD558;&#xC5EC; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xB9CC;, &#xD574;&#xB2F9; &#xC608;&#xC2DC; &#xBB38;&#xC81C;&#xB294; <code>pacia</code>&#xB97C; &#xC790;&#xC720;&#xB86D;&#xAC8C; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC774;&#xACE0; <code>ASLR</code>&#xC774; &#xC548; &#xAC78;&#xB824; &#xC788;&#xC5B4; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xD558;&#xAE30; &#xB9E4;&#xC6B0; &#xC26C;&#xC6B4; &#xC0C1;&#xD669;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xC5BC;&#xC6D4;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>information leak</code> &#xCDE8;&#xC57D;&#xC810;&#xACFC; pac &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xC5B4;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB450;&#xAC1C;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xC57C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD574;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB798;&#xC11C; &#xC5B4;&#xB824;&#xC6B4;&#xAC74;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB124;&#xC694;. &#xC5B8;&#xC820;&#xAC00;&#xB294; &#xC81C;&#xAC00; &#xC9C1;&#xC811; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD574;&#xBCF4;&#xBA74;&#xC11C; &#xC774;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD558;&#xB294; &#xAE00;&#xC744; &#xC368;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/1day1line/">1day1line</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/bypass/">bypass</a>
                  
                  <a class="hover-with-bg" href="/tags/j0ker/">j0ker</a>
                  
                  <a class="hover-with-bg" href="/tags/arm64/">arm64</a>
                  
                  <a class="hover-with-bg" href="/tags/pac/">pac</a>
                  
                  <a class="hover-with-bg" href="/tags/pointer-authentication/">pointer authentication</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_J0ker.jpg" srcset="/img/loading.gif" alt="J0ker">
                  </div>

                  <div class="link-text">
                    <div class="link-title">J0ker</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/J0ker">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>

              <script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/06/27/l0ch/measured-boot-vuln/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Translation] Measured Boot와 멀웨어 시그니처: Windows Loader에서 발견된 두 가지 취약점</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/06/26/fabu1ous/2021-06-26/">
                    <span class="hidden-mobile">[하루한줄] CVE-2021-31970: Windows Filtering Platform EoP</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/06/27/j0ker/2021-06-27/';
        this.page.identifier = '/2021/06/27/j0ker/2021-06-27/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[하루한줄] PAC와 PAC Forgery&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
