

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xBA54;&amp;#xB9C8;&amp;#xC2DC;&amp;#xB5BC;! &amp;#xBC18;&amp;#xAC11;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xB768;&amp;#xB768;&amp;#xD55C; idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9B4; &amp;#xD234;&amp;#xC740; AngryGhidra&amp;#xB77C;&amp;#xB294; &amp;#xD234;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB204;&amp;#xAD70;&amp;#xAC00;(?)&amp;#xAC00; &amp;#xC62C;&amp;#xB824;&amp;#xC900; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC624; &amp;#xC774;&amp;#xAC70; &amp;#xD3B8;&amp;#xD558;&amp;#xACA0;&amp;#xB294;&amp;#xB370; &amp;#xD55C; &amp;#xBC88; &amp;#xC368;&amp;#xBCFC;&amp;#xAE4C;? &amp;#xD558;&amp;#xACE0; &amp;#xC368;&amp;#xBD24;&amp;#xB2E4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCFC; &amp;#xB9CC;&amp;#xD55C; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/angr/angr&#34;&gt;angr&lt;/a&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; python &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; angr&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; python &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB2E4;&amp;#xAC00; &amp;#xC801;&amp;#xACE0;&amp;#x2026; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB2E4;&amp;#xAC00; &amp;#xC801;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xAC00;&amp;#xB2E4;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xB140;&amp;#xC11D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; Ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xC9C8;&amp;#xB9CC; &amp;#xBA87; &amp;#xBC88; &amp;#xD558;&amp;#xBA74; angr&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB141; &amp;#xBA39;&amp;#xACE0; &amp;#xC640;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xB3C4; &amp;#xD558;&amp;#xAE30; &amp;#xC2EB;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; &amp;#xC694;&amp;#xAC70;&amp;#xB098; &amp;#xC138;&amp;#xD305;&amp;#xD574;&amp;#xC11C; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xAC16;&amp;#xACE0; &amp;#xB180;&amp;#xC544;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; &amp;#xD788;&amp;#xD788;&amp;#xD788; &amp;#xD558;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; 30&amp;#xBD84; &amp;#xB9CC;&amp;#xC5D0; &amp;#xAE68;&amp;#xC838;&amp;#xBC84;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xC0BD;&amp;#xC9C8;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xC0BD;&amp;#xC9C8;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&lt;/h1&gt;&lt;p&gt;&amp;#xBD84;&amp;#xBA85; Readme.md&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; Extension &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4; &amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x2192; &amp;#xADFC;&amp;#xB370; &amp;#xC65C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70;&amp;#xC9C0;? &amp;#xD568;&amp;#xC815;&amp;#xC778;&amp;#xAC00;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; git clone&amp;#xD558;&amp;#xBA74; &amp;#xBE4C;&amp;#xB4DC; &amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xB098; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x2192; clone&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4; &amp;#xC804;&amp;#xBD80;&amp;#xB2E4; Ghidra Extension&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xBD24;&amp;#xC73C;&amp;#xB098; &amp;#xC624;&amp;#xB958;&amp;#xB9CC; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB738;.. build.gradle &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; gradle&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xC790;&lt;/p&gt;
&lt;p&gt;gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC9C8; &amp;#xC54A;&amp;#xB124;..?&lt;/p&gt;
&lt;p&gt;&amp;#x2192; &amp;#xB0B4;&amp;#xAC00; &amp;#xBB58; &amp;#xD558;&amp;#xB824; &amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB72C;&amp;#xB2E4;&amp;#x2026; &amp;#xC774;&amp;#xCBE4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xB098;&amp;#xAC00;&amp;#xC11C; &amp;#xD63C;&amp;#xC790; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC695;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC5EC;&amp;#xACE1;&amp;#xC808; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xC131;&amp;#xACF5;(!) &amp;#xD6C4; &amp;#xC2E0;&amp;#xB098;&amp;#xC11C; L0ch&amp;#xC5D0;&amp;#xAC8C; &amp;#xC57C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD588;&amp;#xB2E4; &amp;#xC774;&amp;#xC81C; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF8;&amp;#xB2E4; &amp;#xC606;&amp;#xC5D0;&amp;#xC11C; &amp;#xB531; &amp;#xAE30;&amp;#xB2E4;&amp;#xB824; &amp;#x314B;&amp;#x314B;&amp;#xD558;&amp;#xACE0; &amp;#xC606;&amp;#xC5D0; &amp;#xC138;&amp;#xC6CC;&amp;#xB480;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB3CC;&amp;#xB838;&amp;#xB294;&amp;#xB370; angr&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch &amp;#x65E5; : &amp;#xC544;&amp;#xB2C8; &amp;#xD615; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;&amp;#xC11C; &amp;#xC548;&amp;#xB418;&amp;#xC796;&amp;#xC544; &amp;#xBB50;&amp;#xC57C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0BD;&amp;#xC9C8;&amp;#xD574;&amp;#xC694;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xB098;&amp;#xC05C;&amp;#xB118;&lt;/del&gt; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBA48;&amp;#xCD9C; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; angr&amp;#xB97C; &amp;#xC7AC;&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; python &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xBB38;&amp;#xC820;&amp;#xAC00; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xBC15;&amp;#xC0B4; &amp;#xB09C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC9D1;&amp;#xC5D0; &amp;#xAC00;&amp;#xC11C; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;(?)&amp;#xC744; &amp;#xBCF4;&amp;#xBA70; &amp;#xD790;&amp;#xB9C1; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC74C; &amp;#xB0A0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3C4;&amp;#xC804;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;UE(User Error)&amp;#xC77C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xD06C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA70; &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xB098;&amp;#xC640; &amp;#xC5B4;&amp;#xC81C;&amp;#xC758; &amp;#xB098;&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB610; &amp;#xB3CC;&amp;#xB838;&amp;#xB294;&amp;#xB370; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC548; &amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xB3C4;&amp;#xB300;&amp;#xCCB4; &amp;#xC65C; &amp;#xC548;&amp;#xB3FC;?&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xCC30;&amp;#xB098; &amp;#xB0B4; &amp;#xBA38;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC2A4;&amp;#xCE5C; &amp;#xC0DD;&amp;#xAC01;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8; &amp;#xC774;&amp;#xAC70; elf &amp;#xD30C;&amp;#xC77C;&amp;#xC778;&amp;#xB370; &amp;#xC65C; windows&amp;#xC5D0;&amp;#xC11C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;??&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p align=&#34;center&#34;&gt;&lt;img src=&#34;./img1.jpg&#34; width=&#34;60%&#34; height=&#34;60%&#34;&gt;&lt;/p&gt;

&lt;p&gt;ubuntu&amp;#xB85C; &amp;#xC62E;&amp;#xAE34; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC704;&amp;#xC758; &amp;#xACFC;&amp;#xC815; &amp;#xBC18;&amp;#xBCF5; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; L0ch&amp;#xB97C; &amp;#xBD88;&amp;#xB800;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC790;&amp;#xC2DD;&amp;#xC740; &amp;#xD615;&amp;#xC774; &amp;#xBD80;&amp;#xB974;&amp;#xB294;&amp;#xB370; &amp;#xB9E8;&amp;#xB0A0; &amp;#xD22C;&amp;#xB35C;&amp;#xAC70;&amp;#xB824;&amp;#xC694;. &amp;#x201C;&amp;#xC548;&amp;#xB418;&amp;#xAE30;&amp;#xB9CC; &amp;#xD574; &amp;#xBD10;&amp;#x201D; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC640;&amp;#xB193;&amp;#xACE0; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB530;&amp;#xBD09; &amp;#xB0A0;&amp;#xB9AC;&amp;#xACE0; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB294; Pre-release&amp;#xB85C; AngryGhidra v0.1&amp;#xC774; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xC11C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xC740; &lt;a href=&#34;https://github.com/Nalen98/AngryGhidra/releases&#34;&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&lt;/a&gt; &amp;#xBC1B;&amp;#xC544; Extension&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xADFC;&amp;#xB370;-Ghidra&amp;#xAC00;-&amp;#xBB54;&amp;#xB370;&#34;&gt;&lt;a href=&#34;#&amp;#xADFC;&amp;#xB370;-Ghidra&amp;#xAC00;-&amp;#xBB54;&amp;#xB370;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADFC;&amp;#xB370; Ghidra&amp;#xAC00; &amp;#xBB54;&amp;#xB370;?&#34;&gt;&lt;/a&gt;&amp;#xADFC;&amp;#xB370; Ghidra&amp;#xAC00; &amp;#xBB54;&amp;#xB370;?&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;Ghidra&lt;/a&gt;&amp;#xB294; NSA&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC5ED;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50; &amp;#xD558;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC73C;&amp;#xBA74; IDA &amp;#xAC19;&amp;#xC740; &amp;#xB140;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4;&amp;#xB85C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; jdk 11 &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xCC98;&amp;#xB7FC; &amp;#xC124;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xB9CC; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xC6D0; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows 7 or 10 (64bit)&lt;/li&gt;
&lt;li&gt;Linux (64bit, CentOs 7 is preferred)&lt;/li&gt;
&lt;li&gt;macOS(OS X) 10.8.3+ (Mountain Lion or later)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; OS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0;-Ghidra-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0;-Ghidra-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0; Ghidra &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0; Ghidra &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&lt;/h2&gt;&lt;h3 id=&#34;&amp;#xC790;&amp;#xBC14;-&amp;#xD658;&amp;#xACBD;-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#&amp;#xC790;&amp;#xBC14;-&amp;#xD658;&amp;#xACBD;-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC790;&amp;#xBC14; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;&amp;#xC790;&amp;#xBC14; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo add-apt-repository ppa:openjdk-r/ppa
$ sudo apt install openjdk-11-jre openjdk-11-jre-headless openjdk-11-jdk openjdk-11-jdk-headless&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;Ghidra-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Ghidra-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Ghidra &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xD6C4; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;idioth@ubuntu:~$ ls -al ghidra_9.1.2_PUBLIC
total 56
drwxr-xr-x  9 idioth idioth  4096  9&amp;#xC6D4; 11 15:15 .
drwxr-xr-x 31 idioth idioth  4096  9&amp;#xC6D4; 14 17:01 ..
drwxr-xr-x  5 idioth idioth  4096  2&amp;#xC6D4; 12  2020 docs
drwxr-xr-x  5 idioth idioth  4096  2&amp;#xC6D4; 12  2020 Extensions
drwxr-xr-x  8 idioth idioth  4096  2&amp;#xC6D4; 12  2020 Ghidra
-rwxr-xr-x  1 idioth idioth   883  2&amp;#xC6D4; 12  2020 ghidraRun
-rw-r--r--  1 idioth idioth   384  2&amp;#xC6D4; 12  2020 ghidraRun.bat
drwxr-xr-x  7 idioth idioth  4096  2&amp;#xC6D4; 12  2020 GPL
-rw-r--r--  1 idioth idioth 11357  2&amp;#xC6D4; 12  2020 LICENSE
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 licenses
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 server
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 support&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Windows&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; ghidraRun.bat&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; ghidraRun&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; chmod +x ghidraRun&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;AngryGhidra&#34;&gt;&lt;a href=&#34;#AngryGhidra&#34; class=&#34;headerlink&#34; title=&#34;AngryGhidra&#34;&gt;&lt;/a&gt;AngryGhidra&lt;/h1&gt;&lt;p&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://github.com/Nalen98/AngryGhidra/releases&#34;&gt;AngryGhidra&lt;/a&gt;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Angr-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Angr-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Angr &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Angr &amp;#xC124;&amp;#xCE58;&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo pip3 install angr&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Releases&amp;#xB85C;-&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;-&amp;#xB4F1;&amp;#xB85D;&#34;&gt;&lt;a href=&#34;#Releases&amp;#xB85C;-&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;-&amp;#xB4F1;&amp;#xB85D;&#34; class=&#34;headerlink&#34; title=&#34;Releases&amp;#xB85C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xB4F1;&amp;#xB85D;&#34;&gt;&lt;/a&gt;Releases&amp;#xB85C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xB4F1;&amp;#xB85D;&lt;/h2&gt;&lt;p&gt;pre-releases&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xC73C;&amp;#xB2C8; &amp;#xC800;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;(?)&amp;#xB294; &amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ wget https://github.com/Nalen98/AngryGhidra/releases/download/0.1%2Bghidra-9.1.2/ghidra_9.1.2_PUBLIC_20200909_AngryGhidra.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; File-Install Extensions&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0; +&amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xBC1B;&amp;#xC740; zip &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC900; &amp;#xD6C4; &amp;#xCCB4;&amp;#xD06C;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB05D;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCB4;&amp;#xD06C;&amp;#xD558;&amp;#xACE0; OK &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC124;&amp;#xCE58; &amp;#xC644;&amp;#xB8CC;~&lt;/p&gt;
&lt;h2 id=&#34;Gradle&amp;#xC744;-&amp;#xD1B5;&amp;#xD574;&amp;#xC11C;-&amp;#xC9C1;&amp;#xC811;-&amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Gradle&amp;#xC744;-&amp;#xD1B5;&amp;#xD574;&amp;#xC11C;-&amp;#xC9C1;&amp;#xC811;-&amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC640; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAD73;&amp;#xC774; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xD0DD;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD639;&amp;#xC2DC; &amp;#xBCF8;&amp;#xC778;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD574;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo apt install gradle
$ git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; https://github.com/Nalen98/AngryGhidra&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; gradle&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; AngryGhidra repository&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra$ gradle buildExtension
Starting a Gradle Daemon, 1 incompatible and 1 stopped Daemons could not be reused, use --status &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; details

FAILURE: Build failed with an exception.

* Where:
Build file &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/home/idioth/AngryGhidra/build.gradle&amp;apos;&lt;/span&gt; line: 31

* What went wrong:
A problem occurred evaluating root project &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;AngryGhidra&amp;apos;&lt;/span&gt;.
&amp;gt; GHIDRA_INSTALL_DIR is not defined!

* Try:
Run with --stacktrace option to get the stack trace. Run with --info or --debug option to get more &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; output. Run with --scan to get full insights.

* Get more &lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt; at https://help.gradle.org

BUILD FAILED &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; 3s&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xC758; &amp;#xC124;&amp;#xCE58; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC880; &amp;#xB354; &amp;#xB611;&amp;#xB611;&amp;#xD55C;(?) &amp;#xC81C;&amp;#xAC00; &amp;#xAC00;&amp;#xB974;&amp;#xCCD0;&amp;#xC8FC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra$ sudo GHIDRA_INSTALL_DIR=/home/idioth/ghidra_9.1.2_PUBLIC gradle buildExtension

&amp;gt; Task :buildHelp 
INFO  Using &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; config file: jar:file:/home/idioth/ghidra_9.1.2_PUBLIC/Ghidra/Framework/Generic/lib/Generic.jar!/generic.log4j.xml (LoggingInitialization)  
INFO  Using &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; file: /root/.ghidra/.ghidra_9.1.2_PUBLIC/application.log (LoggingInitialization)  
[JavaHelpFilesBuilder] Generating Help Files &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt;: [file:///home/idioth/AngryGhidra/src/main/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/]
[JavaHelpFilesBuilder] Generating map file: file:///home/idioth/AngryGhidra/build/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/main/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/AngryGhidra_map.xml...
[JavaHelpFilesBuilder]  finished generating map file
[JavaHelpFilesBuilder] Generating TOC file: AngryGhidra_TOC.xml...
[JavaHelpFilesBuilder]  finished generating TOC file
[JavaHelpFilesBuilder] Done generating &lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt; files &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; module: AngryGhidra

&amp;gt; Task :buildExtension 

Created ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; /home/idioth/AngryGhidra/dist

BUILD SUCCESSFUL &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; 15s
8 actionable tasks: 8 executed&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574; &amp;#xC900; &amp;#xD6C4; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra/dist$ ls
ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB410;&amp;#xB2E4;&amp;#xBA74; dist &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; Extension &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC624;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;AngryGhidra&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xD480;&amp;#xC774;&#34;&gt;&lt;a href=&#34;#AngryGhidra&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xD480;&amp;#xC774;&#34; class=&#34;headerlink&#34; title=&#34;AngryGhidra&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xD480;&amp;#xC774;&#34;&gt;&lt;/a&gt;AngryGhidra&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xD480;&amp;#xC774;&lt;/h2&gt;&lt;p&gt;angr&amp;#xB85C; &amp;#xD478;&amp;#xB294; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;(?) &lt;a href=&#34;https://github.com/ByteBandits/writeups/blob/master/defcamp-quals-2015/reverse/r100/r100.bin&#34;&gt;Defcamp - r100&lt;/a&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC900; &amp;#xD6C4; main &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;undefined8 &lt;span class=&#34;hljs-title&#34;&gt;FUN_004007e8&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; iVar1;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *pcVar2;
	undefined8 uVar3;
	&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; in_FS_OFFSET;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; local_118 [&lt;span class=&#34;hljs-number&#34;&gt;264&lt;/span&gt;];
	&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; local_10;

	local_10 = *(&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; *)(in_FS_OFFSET + &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Enter the password: &amp;quot;&lt;/span&gt;);
	pcVar2 = fgets(local_118, &lt;span class=&#34;hljs-number&#34;&gt;0xff&lt;/span&gt;, &lt;span class=&#34;hljs-built_in&#34;&gt;stdin&lt;/span&gt;);
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pcVar2 == (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)&lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;) {
		uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
		iVar1 = FUN_004006fd(local_118);
		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (iVar1 == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
			put(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Nice!&amp;quot;&lt;/span&gt;);
			uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
		}
		&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
			&lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Incorrect password!&amp;quot;&lt;/span&gt;);
			uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
		}
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (local_10 != *(&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; *)(in_FS_OFFSET + &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;)) {
		__stack_chk_fail();
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar3;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;password&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xACE0; &lt;code&gt;FUN_004006fd&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC218;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xACE0; return &amp;#xAC12;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; Nice&amp;#xC640; incorrect&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Incorrect &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD53C;&amp;#xD558;&amp;#xACE0; Nice&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; AngryGhidra&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; blank state&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Nice &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xBD80;&amp;#xBD84;&amp;#xC73C;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xB2C8; Nice &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; Find Address&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Incorrect&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xD53C;&amp;#xD574;&amp;#xC57C; &amp;#xB418;&amp;#xB2C8; Avoid Address&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; AngryGhidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Window - AngryGhidraPlugin&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC758; &amp;#xC0AC;&amp;#xC9C4;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xC790;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, auto_load_libs&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Blank State&amp;#xC640; Find address, avoid address&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xB2C8; Run &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; angr&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xC2DC; &amp;#xAE30;&amp;#xB2E4;&amp;#xB824;&amp;#xBCF4;&amp;#xBA74; Solution Found&amp;#xB77C;&amp;#xACE0; &amp;#xB728;&amp;#xBA70; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/Desktop$ ./r100.bin 
Enter the password: Code_Talkers
Nice!&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCF4;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xC9C8;&amp;#xB9CC; &amp;#xBA87; &amp;#xBC88; &amp;#xD558;&amp;#xBA74; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC900;&amp;#xB2E4;? &amp;#xC815;&amp;#xB9D0; &amp;#xC778;&amp;#xAC04;&amp;#xC758; &amp;#xC695;&amp;#xAD6C;&amp;#xC5D0; &amp;#xCDA9;&amp;#xC2E4;&amp;#xD55C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xC544;&amp;#xB2D0; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xC811; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD6E8;&amp;#xC52C; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C;&amp;#xBC14;&amp;#xB85C; angr &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774; &amp;#xB9E4;&amp;#xB825;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB85C;&amp;#xB9CC; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xB370; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC62C;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC800;&amp;#xC758; &amp;#xBA4D;&amp;#xCCAD;&amp;#xD568;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xADF9;&amp;#xBCF5;&amp;#xD55C; &amp;#xB098;&amp;#xC5D0;&amp;#xAC8C; &amp;#xAC74;&amp;#xBC30;&amp;#xD558;&amp;#xBA70;.. adios..&lt;/p&gt;
&lt;p align=&#34;center&#34;&gt;&lt;img src=&#34;./img12.jpg&#34; width=&#34;50%&#34; heightd=&#34;50%&#34;&gt;&lt;/p&gt; - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] AngryGhidra를 사용해보자! - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xD558;&amp;#xC9C0;&amp;#xBA54;&amp;#xB9C8;&amp;#xC2DC;&amp;#xB5BC;! &amp;#xBC18;&amp;#xAC11;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xB768;&amp;#xB768;&amp;#xD55C; idioth&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298; &amp;#xC18C;&amp;#xAC1C;&amp;#xD574;&amp;#xB4DC;&amp;#xB9B4; &amp;#xD234;&amp;#xC740; AngryGhidra&amp;#xB77C;&amp;#xB294; &amp;#xD234;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB204;&amp;#xAD70;&amp;#xAC00;(?)&amp;#xAC00; &amp;#xC62C;&amp;#xB824;&amp;#xC900; &amp;#xB9C1;&amp;#xD06C;&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &amp;#xC624; &amp;#xC774;&amp;#xAC70; &amp;#xD3B8;&amp;#xD558;&amp;#xACA0;&amp;#xB294;&amp;#xB370; &amp;#xD55C; &amp;#xBC88; &amp;#xC368;&amp;#xBCFC;&amp;#xAE4C;? &amp;#xD558;&amp;#xACE0; &amp;#xC368;&amp;#xBD24;&amp;#xB2E4;&amp;#xAC00; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCFC; &amp;#xB9CC;&amp;#xD55C; &amp;#xAC00;&amp;#xCE58;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xAC83; &amp;#xAC19;&amp;#xC544;&amp;#xC11C; &amp;#xAE00;&amp;#xC744; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xBD05;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://github.com/angr/angr&#34;&gt;angr&lt;/a&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xB4DC;&amp;#xB9AC;&amp;#xC790;&amp;#xBA74; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xB3C4;&amp;#xC640;&amp;#xC8FC;&amp;#xB294; python &amp;#xB77C;&amp;#xC774;&amp;#xBE0C;&amp;#xB7EC;&amp;#xB9AC;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xC874; angr&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB824;&amp;#xBA74; IDA&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD234;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; python &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB2E4;&amp;#xAC00; &amp;#xC801;&amp;#xACE0;&amp;#x2026; &amp;#xB2E4;&amp;#xC2DC; &amp;#xAD6C;&amp;#xD558;&amp;#xACE0; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xB2E4;&amp;#xAC00; &amp;#xC801;&amp;#xACE0; &amp;#xD558;&amp;#xB294; &amp;#xB178;&amp;#xAC00;&amp;#xB2E4;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC774; &amp;#xB140;&amp;#xC11D;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; Ghidra&amp;#xC5D0;&amp;#xC11C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xC9C8;&amp;#xB9CC; &amp;#xBA87; &amp;#xBC88; &amp;#xD558;&amp;#xBA74; angr&amp;#xC758; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xB141; &amp;#xBA39;&amp;#xACE0; &amp;#xC640;&amp;#xC11C; &amp;#xACF5;&amp;#xBD80;&amp;#xB3C4; &amp;#xD558;&amp;#xAE30; &amp;#xC2EB;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; &amp;#xC694;&amp;#xAC70;&amp;#xB098; &amp;#xC138;&amp;#xD305;&amp;#xD574;&amp;#xC11C; &amp;#xC368;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xAC16;&amp;#xACE0; &amp;#xB180;&amp;#xC544;&amp;#xBD10;&amp;#xC57C;&amp;#xACA0;&amp;#xB2E4;&amp;#x2026; &amp;#xD788;&amp;#xD788;&amp;#xD788; &amp;#xD558;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC740; 30&amp;#xBD84; &amp;#xB9CC;&amp;#xC5D0; &amp;#xAE68;&amp;#xC838;&amp;#xBC84;&amp;#xB9AC;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xC0BD;&amp;#xC9C8;&#34;&gt;&lt;a href=&#34;#&amp;#xC608;&amp;#xC0C1;&amp;#xCE58;-&amp;#xBABB;&amp;#xD55C;-&amp;#xC0BD;&amp;#xC9C8;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&#34;&gt;&lt;/a&gt;&amp;#xC608;&amp;#xC0C1;&amp;#xCE58; &amp;#xBABB;&amp;#xD55C; &amp;#xC0BD;&amp;#xC9C8;&lt;/h1&gt;&lt;p&gt;&amp;#xBD84;&amp;#xBA85; Readme.md&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; Extension &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xB41C;&amp;#xB2E4; &amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x2192; &amp;#xADFC;&amp;#xB370; &amp;#xC65C; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC544;&amp;#xBB34;&amp;#xAC83;&amp;#xB3C4; &amp;#xC5C6;&amp;#xB294; &amp;#xAC70;&amp;#xC9C0;? &amp;#xD568;&amp;#xC815;&amp;#xC778;&amp;#xAC00;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; git clone&amp;#xD558;&amp;#xBA74; &amp;#xBE4C;&amp;#xB4DC; &amp;#xB41C; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xB098; &amp;#xC5C6;&amp;#xC5C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#x2192; clone&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xB4E4; &amp;#xC804;&amp;#xBD80;&amp;#xB2E4; Ghidra Extension&amp;#xC5D0;&amp;#xC11C; &amp;#xD074;&amp;#xB9AD;&amp;#xD574;&amp;#xBD24;&amp;#xC73C;&amp;#xB098; &amp;#xC624;&amp;#xB958;&amp;#xB9CC; &amp;#xC5C4;&amp;#xCCAD; &amp;#xB738;.. build.gradle &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; gradle&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD574;&amp;#xBCF4;&amp;#xC790;&lt;/p&gt;
&lt;p&gt;gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xB418;&amp;#xC9C8; &amp;#xC54A;&amp;#xB124;..?&lt;/p&gt;
&lt;p&gt;&amp;#x2192; &amp;#xB0B4;&amp;#xAC00; &amp;#xBB58; &amp;#xD558;&amp;#xB824; &amp;#xD560; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC624;&amp;#xB958;&amp;#xAC00; &amp;#xB72C;&amp;#xB2E4;&amp;#x2026; &amp;#xC774;&amp;#xCBE4;&amp;#xC5D0;&amp;#xC11C; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xB098;&amp;#xAC00;&amp;#xC11C; &amp;#xD63C;&amp;#xC790; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130; &amp;#xC55E;&amp;#xC5D0;&amp;#xC11C; &amp;#xC695;&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xC5EC;&amp;#xACE1;&amp;#xC808; &amp;#xC18D;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xC131;&amp;#xACF5;(!) &amp;#xD6C4; &amp;#xC2E0;&amp;#xB098;&amp;#xC11C; L0ch&amp;#xC5D0;&amp;#xAC8C; &amp;#xC57C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD588;&amp;#xB2E4; &amp;#xC774;&amp;#xC81C; &amp;#xB3CC;&amp;#xB824;&amp;#xBCF8;&amp;#xB2E4; &amp;#xC606;&amp;#xC5D0;&amp;#xC11C; &amp;#xB531; &amp;#xAE30;&amp;#xB2E4;&amp;#xB824; &amp;#x314B;&amp;#x314B;&amp;#xD558;&amp;#xACE0; &amp;#xC606;&amp;#xC5D0; &amp;#xC138;&amp;#xC6CC;&amp;#xB480;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xAC00;&amp;#xC838;&amp;#xC628; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xB3CC;&amp;#xB838;&amp;#xB294;&amp;#xB370; angr&amp;#xAC00; &amp;#xB3CC;&amp;#xC544;&amp;#xAC00;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;L0ch &amp;#x65E5; : &amp;#xC544;&amp;#xB2C8; &amp;#xD615; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74;&amp;#xC11C; &amp;#xC548;&amp;#xB418;&amp;#xC796;&amp;#xC544; &amp;#xBB50;&amp;#xC57C; &amp;#xBE68;&amp;#xB9AC; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC0BD;&amp;#xC9C8;&amp;#xD574;&amp;#xC694;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;del&gt;&amp;#xB098;&amp;#xC05C;&amp;#xB118;&lt;/del&gt; &amp;#xC544;&amp;#xBB34;&amp;#xD2BC; &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xBA48;&amp;#xCD9C; &amp;#xC218; &amp;#xC5C6;&amp;#xC73C;&amp;#xBBC0;&amp;#xB85C; angr&amp;#xB97C; &amp;#xC7AC;&amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; python &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xBB38;&amp;#xC820;&amp;#xAC00; &amp;#xC0BD;&amp;#xC9C8;&amp;#xC744; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&lt;/p&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xAD6D; &amp;#xBA58;&amp;#xD0C8;&amp;#xC774; &amp;#xBC15;&amp;#xC0B4; &amp;#xB09C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB85C; &amp;#xC9D1;&amp;#xC5D0; &amp;#xAC00;&amp;#xC11C; &amp;#xC560;&amp;#xB2C8;&amp;#xBA54;&amp;#xC774;&amp;#xC158;(?)&amp;#xC744; &amp;#xBCF4;&amp;#xBA70; &amp;#xD790;&amp;#xB9C1; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC74C; &amp;#xB0A0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xB3C4;&amp;#xC804;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;UE(User Error)&amp;#xC77C; &amp;#xAC00;&amp;#xB2A5;&amp;#xC131;&amp;#xC774; &amp;#xD06C;&amp;#xB2E4;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xBA70; &amp;#xC624;&amp;#xB298;&amp;#xC758; &amp;#xB098;&amp;#xC640; &amp;#xC5B4;&amp;#xC81C;&amp;#xC758; &amp;#xB098;&amp;#xB294; &amp;#xB2E4;&amp;#xB974;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xB610; &amp;#xB3CC;&amp;#xB838;&amp;#xB294;&amp;#xB370; &amp;#xC2E4;&amp;#xD589;&amp;#xC774; &amp;#xC548; &amp;#xB410;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xB3C4;&amp;#xB300;&amp;#xCCB4; &amp;#xC65C; &amp;#xC548;&amp;#xB3FC;?&amp;#xB77C;&amp;#xACE0; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xB294; &amp;#xCC30;&amp;#xB098; &amp;#xB0B4; &amp;#xBA38;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC2A4;&amp;#xCE5C; &amp;#xC0DD;&amp;#xAC01;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC544;&amp;#xB2C8; &amp;#xC774;&amp;#xAC70; elf &amp;#xD30C;&amp;#xC77C;&amp;#xC778;&amp;#xB370; &amp;#xC65C; windows&amp;#xC5D0;&amp;#xC11C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xACE0; &amp;#xC788;&amp;#xC9C0;??&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p align=&#34;center&#34;&gt;&lt;img src=&#34;./img1.jpg&#34; width=&#34;60%&#34; height=&#34;60%&#34;&gt;&lt;/p&gt;

&lt;p&gt;ubuntu&amp;#xB85C; &amp;#xC62E;&amp;#xAE34; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; &amp;#xB2E4;&amp;#xC2DC; &amp;#xC704;&amp;#xC758; &amp;#xACFC;&amp;#xC815; &amp;#xBC18;&amp;#xBCF5; &amp;#xD6C4; &amp;#xB2E4;&amp;#xC2DC; L0ch&amp;#xB97C; &amp;#xBD88;&amp;#xB800;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC790;&amp;#xC2DD;&amp;#xC740; &amp;#xD615;&amp;#xC774; &amp;#xBD80;&amp;#xB974;&amp;#xB294;&amp;#xB370; &amp;#xB9E8;&amp;#xB0A0; &amp;#xD22C;&amp;#xB35C;&amp;#xAC70;&amp;#xB824;&amp;#xC694;. &amp;#x201C;&amp;#xC548;&amp;#xB418;&amp;#xAE30;&amp;#xB9CC; &amp;#xD574; &amp;#xBD10;&amp;#x201D; &amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC640;&amp;#xB193;&amp;#xACE0; &amp;#xB418;&amp;#xB2C8;&amp;#xAE4C; &amp;#xB530;&amp;#xBD09; &amp;#xB0A0;&amp;#xB9AC;&amp;#xACE0; &amp;#xAC11;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xD604;&amp;#xC7AC;&amp;#xB294; Pre-release&amp;#xB85C; AngryGhidra v0.1&amp;#xC774; &amp;#xC5C5;&amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xC11C; &amp;#xADC0;&amp;#xCC2E;&amp;#xC73C;&amp;#xC2E0; &amp;#xBD84;&amp;#xC740; &lt;a href=&#34;https://github.com/Nalen98/AngryGhidra/releases&#34;&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4;&amp;#xB85C;&amp;#xB4DC;&lt;/a&gt; &amp;#xBC1B;&amp;#xC544; Extension&amp;#xC744; &amp;#xBC14;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xBA74; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;&amp;#xADFC;&amp;#xB370;-Ghidra&amp;#xAC00;-&amp;#xBB54;&amp;#xB370;&#34;&gt;&lt;a href=&#34;#&amp;#xADFC;&amp;#xB370;-Ghidra&amp;#xAC00;-&amp;#xBB54;&amp;#xB370;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xADFC;&amp;#xB370; Ghidra&amp;#xAC00; &amp;#xBB54;&amp;#xB370;?&#34;&gt;&lt;/a&gt;&amp;#xADFC;&amp;#xB370; Ghidra&amp;#xAC00; &amp;#xBB54;&amp;#xB370;?&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;Ghidra&lt;/a&gt;&amp;#xB294; NSA&amp;#xC5D0;&amp;#xC11C; &amp;#xAC1C;&amp;#xBC1C;&amp;#xD55C; &amp;#xC5ED;&amp;#xC5B4;&amp;#xC148;&amp;#xBE14;&amp;#xB7EC; &amp;#xD504;&amp;#xB808;&amp;#xC784;&amp;#xC6CC;&amp;#xD06C;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xBB50; &amp;#xD558;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xC798; &amp;#xBAA8;&amp;#xB974;&amp;#xACA0;&amp;#xC73C;&amp;#xBA74; IDA &amp;#xAC19;&amp;#xC740; &amp;#xB140;&amp;#xC11D;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCF4;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xD508; &amp;#xC18C;&amp;#xC2A4;&amp;#xB85C; &amp;#xACF5;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xC73C;&amp;#xBA70; jdk 11 &amp;#xBC84;&amp;#xC804;&amp;#xC5D0;&amp;#xC11C; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC791;&amp;#xB3D9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xB978; &amp;#xC751;&amp;#xC6A9; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xB4E4;&amp;#xCC98;&amp;#xB7FC; &amp;#xC124;&amp;#xCE58; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xC555;&amp;#xCD95; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xB2E4;&amp;#xC6B4; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xB9CC; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; &amp;#xBC14;&amp;#xB85C; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C0;&amp;#xC6D0; &amp;#xD50C;&amp;#xB7AB;&amp;#xD3FC;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Windows 7 or 10 (64bit)&lt;/li&gt;
&lt;li&gt;Linux (64bit, CentOs 7 is preferred)&lt;/li&gt;
&lt;li&gt;macOS(OS X) 10.8.3+ (Mountain Lion or later)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;32&amp;#xBE44;&amp;#xD2B8; OS&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Ghidra&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0;-Ghidra-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0;-Ghidra-&amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0; Ghidra &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC5D0; Ghidra &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xAE30;&lt;/h2&gt;&lt;h3 id=&#34;&amp;#xC790;&amp;#xBC14;-&amp;#xD658;&amp;#xACBD;-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#&amp;#xC790;&amp;#xBC14;-&amp;#xD658;&amp;#xACBD;-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC790;&amp;#xBC14; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;&amp;#xC790;&amp;#xBC14; &amp;#xD658;&amp;#xACBD; &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo add-apt-repository ppa:openjdk-r/ppa
$ sudo apt install openjdk-11-jre openjdk-11-jre-headless openjdk-11-jdk openjdk-11-jdk-headless&lt;/code&gt;&lt;/pre&gt;
&lt;h3 id=&#34;Ghidra-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Ghidra-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Ghidra &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Ghidra &amp;#xC124;&amp;#xCE58;&lt;/h3&gt;&lt;p&gt;&lt;a href=&#34;https://ghidra-sre.org/&#34;&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xC0AC;&amp;#xC774;&amp;#xD2B8;&lt;/a&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xCD5C;&amp;#xC2E0; &amp;#xBC84;&amp;#xC804;&amp;#xC758; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574;&amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img2.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xD6C4; &amp;#xC6D0;&amp;#xD558;&amp;#xB294; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0;&amp;#xC11C; &amp;#xC555;&amp;#xCD95;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xBA74; ghidra&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;idioth@ubuntu:~$ ls -al ghidra_9.1.2_PUBLIC
total 56
drwxr-xr-x  9 idioth idioth  4096  9&amp;#xC6D4; 11 15:15 .
drwxr-xr-x 31 idioth idioth  4096  9&amp;#xC6D4; 14 17:01 ..
drwxr-xr-x  5 idioth idioth  4096  2&amp;#xC6D4; 12  2020 docs
drwxr-xr-x  5 idioth idioth  4096  2&amp;#xC6D4; 12  2020 Extensions
drwxr-xr-x  8 idioth idioth  4096  2&amp;#xC6D4; 12  2020 Ghidra
-rwxr-xr-x  1 idioth idioth   883  2&amp;#xC6D4; 12  2020 ghidraRun
-rw-r--r--  1 idioth idioth   384  2&amp;#xC6D4; 12  2020 ghidraRun.bat
drwxr-xr-x  7 idioth idioth  4096  2&amp;#xC6D4; 12  2020 GPL
-rw-r--r--  1 idioth idioth 11357  2&amp;#xC6D4; 12  2020 LICENSE
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 licenses
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 server
drwxr-xr-x  2 idioth idioth  4096  2&amp;#xC6D4; 12  2020 support&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Windows&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; ghidraRun.bat&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xACE0; &amp;#xC6B0;&amp;#xBD84;&amp;#xD22C;&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; ghidraRun&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xACBD;&amp;#xC6B0; chmod +x ghidraRun&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xC2E4;&amp;#xD589; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xC8FC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h1 id=&#34;AngryGhidra&#34;&gt;&lt;a href=&#34;#AngryGhidra&#34; class=&#34;headerlink&#34; title=&#34;AngryGhidra&#34;&gt;&lt;/a&gt;AngryGhidra&lt;/h1&gt;&lt;p&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xAC00; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC124;&amp;#xCE58;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xBA74; &lt;a href=&#34;https://github.com/Nalen98/AngryGhidra/releases&#34;&gt;AngryGhidra&lt;/a&gt;&amp;#xB97C; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Angr-&amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;a href=&#34;#Angr-&amp;#xC124;&amp;#xCE58;&#34; class=&#34;headerlink&#34; title=&#34;Angr &amp;#xC124;&amp;#xCE58;&#34;&gt;&lt;/a&gt;Angr &amp;#xC124;&amp;#xCE58;&lt;/h2&gt;&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo pip3 install angr&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;Releases&amp;#xB85C;-&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;-&amp;#xB4F1;&amp;#xB85D;&#34;&gt;&lt;a href=&#34;#Releases&amp;#xB85C;-&amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;-&amp;#xB4F1;&amp;#xB85D;&#34; class=&#34;headerlink&#34; title=&#34;Releases&amp;#xB85C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xB4F1;&amp;#xB85D;&#34;&gt;&lt;/a&gt;Releases&amp;#xB85C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778; &amp;#xB4F1;&amp;#xB85D;&lt;/h2&gt;&lt;p&gt;pre-releases&amp;#xAC00; &amp;#xC62C;&amp;#xB77C;&amp;#xC654;&amp;#xC73C;&amp;#xB2C8; &amp;#xC800;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xC2DC;&amp;#xAC04; &amp;#xB0AD;&amp;#xBE44;(?)&amp;#xB294; &amp;#xD558;&amp;#xC9C0; &amp;#xB9D0;&amp;#xACE0; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC73C;&amp;#xB85C; &amp;#xB4F1;&amp;#xB85D;&amp;#xC744; &amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ wget https://github.com/Nalen98/AngryGhidra/releases/download/0.1%2Bghidra-9.1.2/ghidra_9.1.2_PUBLIC_20200909_AngryGhidra.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xC2E4;&amp;#xD589; &amp;#xD6C4; File-Install Extensions&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xCE21; &amp;#xC0C1;&amp;#xB2E8;&amp;#xC5D0; +&amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC124;&amp;#xCE58; &amp;#xBC1B;&amp;#xC740; zip &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC120;&amp;#xD0DD;&amp;#xD574; &amp;#xC900; &amp;#xD6C4; &amp;#xCCB4;&amp;#xD06C;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7EC;&amp;#xBA74; &amp;#xB05D;&amp;#xB0A9;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCCB4;&amp;#xD06C;&amp;#xD558;&amp;#xACE0; OK &amp;#xB204;&amp;#xB974;&amp;#xBA74; &amp;#xC124;&amp;#xCE58; &amp;#xC644;&amp;#xB8CC;~&lt;/p&gt;
&lt;h2 id=&#34;Gradle&amp;#xC744;-&amp;#xD1B5;&amp;#xD574;&amp;#xC11C;-&amp;#xC9C1;&amp;#xC811;-&amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;a href=&#34;#Gradle&amp;#xC744;-&amp;#xD1B5;&amp;#xD574;&amp;#xC11C;-&amp;#xC9C1;&amp;#xC811;-&amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294;-&amp;#xBC29;&amp;#xBC95;&#34; class=&#34;headerlink&#34; title=&#34;Gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&#34;&gt;&lt;/a&gt;Gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&lt;/h2&gt;&lt;p&gt;&amp;#xB9B4;&amp;#xB9AC;&amp;#xC988; &amp;#xBC84;&amp;#xC804;&amp;#xC774; &amp;#xC62C;&amp;#xB77C;&amp;#xC640; &amp;#xC788;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xAD73;&amp;#xC774; &amp;#xC774; &amp;#xBC29;&amp;#xBC95;&amp;#xC744; &amp;#xD0DD;&amp;#xD558;&amp;#xC2DC;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xC5C6;&amp;#xC744; &amp;#xAC70;&amp;#xB77C; &amp;#xC0DD;&amp;#xAC01;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC; &amp;#xD639;&amp;#xC2DC; &amp;#xBCF8;&amp;#xC778;&amp;#xC774; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xC2DC;&amp;#xB2E4;&amp;#xBA74; &amp;#xC9C1;&amp;#xC811; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD574;&amp;#xBCF4;&amp;#xC2DC;&amp;#xB294; &amp;#xAC83;&amp;#xB3C4; &amp;#xCD94;&amp;#xCC9C;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;$ sudo apt install gradle
$ git &lt;span class=&#34;hljs-built_in&#34;&gt;clone&lt;/span&gt; https://github.com/Nalen98/AngryGhidra&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;gradle&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xBE4C;&amp;#xB4DC; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; gradle&amp;#xC744; &amp;#xC124;&amp;#xCE58;&amp;#xD558;&amp;#xACE0; AngryGhidra repository&amp;#xB97C; &amp;#xAC00;&amp;#xC838;&amp;#xC635;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra$ gradle buildExtension
Starting a Gradle Daemon, 1 incompatible and 1 stopped Daemons could not be reused, use --status &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; details

FAILURE: Build failed with an exception.

* Where:
Build file &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;/home/idioth/AngryGhidra/build.gradle&amp;apos;&lt;/span&gt; line: 31

* What went wrong:
A problem occurred evaluating root project &lt;span class=&#34;hljs-string&#34;&gt;&amp;apos;AngryGhidra&amp;apos;&lt;/span&gt;.
&amp;gt; GHIDRA_INSTALL_DIR is not defined!

* Try:
Run with --stacktrace option to get the stack trace. Run with --info or --debug option to get more &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; output. Run with --scan to get full insights.

* Get more &lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt; at https://help.gradle.org

BUILD FAILED &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; 3s&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB0E5; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD560; &amp;#xACBD;&amp;#xC6B0; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xC758; &amp;#xC124;&amp;#xCE58; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xC54C; &amp;#xC218; &amp;#xC5C6;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; &amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xAC00; &amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC880; &amp;#xB354; &amp;#xB611;&amp;#xB611;&amp;#xD55C;(?) &amp;#xC81C;&amp;#xAC00; &amp;#xAC00;&amp;#xB974;&amp;#xCCD0;&amp;#xC8FC;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra$ sudo GHIDRA_INSTALL_DIR=/home/idioth/ghidra_9.1.2_PUBLIC gradle buildExtension

&amp;gt; Task :buildHelp 
INFO  Using &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; config file: jar:file:/home/idioth/ghidra_9.1.2_PUBLIC/Ghidra/Framework/Generic/lib/Generic.jar!/generic.log4j.xml (LoggingInitialization)  
INFO  Using &lt;span class=&#34;hljs-built_in&#34;&gt;log&lt;/span&gt; file: /root/.ghidra/.ghidra_9.1.2_PUBLIC/application.log (LoggingInitialization)  
[JavaHelpFilesBuilder] Generating Help Files &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt;: [file:///home/idioth/AngryGhidra/src/main/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/]
[JavaHelpFilesBuilder] Generating map file: file:///home/idioth/AngryGhidra/build/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/main/&lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt;/AngryGhidra_map.xml...
[JavaHelpFilesBuilder]  finished generating map file
[JavaHelpFilesBuilder] Generating TOC file: AngryGhidra_TOC.xml...
[JavaHelpFilesBuilder]  finished generating TOC file
[JavaHelpFilesBuilder] Done generating &lt;span class=&#34;hljs-built_in&#34;&gt;help&lt;/span&gt; files &lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; module: AngryGhidra

&amp;gt; Task :buildExtension 

Created ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; /home/idioth/AngryGhidra/dist

BUILD SUCCESSFUL &lt;span class=&#34;hljs-keyword&#34;&gt;in&lt;/span&gt; 15s
8 actionable tasks: 8 executed&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC790;&amp;#xC2E0;&amp;#xC758; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xCD94;&amp;#xAC00;&amp;#xD574; &amp;#xC900; &amp;#xD6C4; &amp;#xBE4C;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C4;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/AngryGhidra/dist$ ls
ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBE4C;&amp;#xB4DC;&amp;#xAC00; &amp;#xC9C4;&amp;#xD589;&amp;#xB410;&amp;#xB2E4;&amp;#xBA74; dist &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; Extension &amp;#xD30C;&amp;#xC77C;&amp;#xC774; &amp;#xC0DD;&amp;#xAE41;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC5EC;&amp;#xAE30;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC624;&amp;#xC168;&amp;#xB2E4;&amp;#xBA74; &amp;#xB9B4;&amp;#xB9AC;&amp;#xC988;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xBC95;&amp;#xC73C;&amp;#xB85C; &amp;#xCD94;&amp;#xAC00;&amp;#xD558;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;AngryGhidra&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xD480;&amp;#xC774;&#34;&gt;&lt;a href=&#34;#AngryGhidra&amp;#xB97C;-&amp;#xD1B5;&amp;#xD55C;-&amp;#xBB38;&amp;#xC81C;-&amp;#xD480;&amp;#xC774;&#34; class=&#34;headerlink&#34; title=&#34;AngryGhidra&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xD480;&amp;#xC774;&#34;&gt;&lt;/a&gt;AngryGhidra&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; &amp;#xBB38;&amp;#xC81C; &amp;#xD480;&amp;#xC774;&lt;/h2&gt;&lt;p&gt;angr&amp;#xB85C; &amp;#xD478;&amp;#xB294; &amp;#xBB38;&amp;#xC81C; &amp;#xC911; &amp;#xAC00;&amp;#xC7A5; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C;(?) &lt;a href=&#34;https://github.com/ByteBandits/writeups/blob/master/defcamp-quals-2015/reverse/r100/r100.bin&#34;&gt;Defcamp - r100&lt;/a&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xAE30;&amp;#xB4DC;&amp;#xB77C;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4;&amp;#xC900; &amp;#xD6C4; main &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs cpp&#34;&gt;&lt;span class=&#34;hljs-function&#34;&gt;undefined8 &lt;span class=&#34;hljs-title&#34;&gt;FUN_004007e8&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;span class=&#34;hljs-keyword&#34;&gt;void&lt;/span&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{
	&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; iVar1;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *pcVar2;
	undefined8 uVar3;
	&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; in_FS_OFFSET;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; local_118 [&lt;span class=&#34;hljs-number&#34;&gt;264&lt;/span&gt;];
	&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; local_10;

	local_10 = *(&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; *)(in_FS_OFFSET + &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Enter the password: &amp;quot;&lt;/span&gt;);
	pcVar2 = fgets(local_118, &lt;span class=&#34;hljs-number&#34;&gt;0xff&lt;/span&gt;, &lt;span class=&#34;hljs-built_in&#34;&gt;stdin&lt;/span&gt;);
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (pcVar2 == (&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; *)&lt;span class=&#34;hljs-number&#34;&gt;0x0&lt;/span&gt;) {
		uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
		iVar1 = FUN_004006fd(local_118);
		&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (iVar1 == &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;) {
			put(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Nice!&amp;quot;&lt;/span&gt;);
			uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
		}
		&lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
			&lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Incorrect password!&amp;quot;&lt;/span&gt;);
			uVar3 = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
		}
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (local_10 != *(&lt;span class=&#34;hljs-keyword&#34;&gt;long&lt;/span&gt; *)(in_FS_OFFSET + &lt;span class=&#34;hljs-number&#34;&gt;0x28&lt;/span&gt;)) {
		__stack_chk_fail();
	}
	&lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; uVar3;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;password&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xACE0; &lt;code&gt;FUN_004006fd&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A0;&amp;#xD55C; &amp;#xC218;&amp;#xD589;&amp;#xC744; &amp;#xD558;&amp;#xACE0; return &amp;#xAC12;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; Nice&amp;#xC640; incorrect&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Incorrect &amp;#xBD80;&amp;#xBD84;&amp;#xC744; &amp;#xD53C;&amp;#xD558;&amp;#xACE0; Nice&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xD328;&amp;#xC2A4;&amp;#xC6CC;&amp;#xB4DC;&amp;#xB97C; &amp;#xCC3E;&amp;#xC544;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC800; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC77C;&amp;#xC77C;&amp;#xC774; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xBC95;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC6B0;&amp;#xB9AC;&amp;#xC5D0;&amp;#xAC8C;&amp;#xB294; AngryGhidra&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0;&amp;#xC11C; blank state&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC6B0;&amp;#xB9AC;&amp;#xB294; Nice &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xBD80;&amp;#xBD84;&amp;#xC73C;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xACE0; &amp;#xC2F6;&amp;#xC73C;&amp;#xB2C8; Nice &amp;#xCABD;&amp;#xC73C;&amp;#xB85C; &amp;#xB118;&amp;#xC5B4;&amp;#xAC00;&amp;#xB294; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; Find Address&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &amp;#xC90D;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Incorrect&amp;#xB85C; &amp;#xAC00;&amp;#xB294; &amp;#xBD80;&amp;#xBD84;&amp;#xC740; &amp;#xD53C;&amp;#xD574;&amp;#xC57C; &amp;#xB418;&amp;#xB2C8; Avoid Address&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD55C; &amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0; AngryGhidra&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Window - AngryGhidraPlugin&amp;#xC744; &amp;#xD074;&amp;#xB9AD;&amp;#xD558;&amp;#xBA74; &amp;#xC704;&amp;#xC758; &amp;#xC0AC;&amp;#xC9C4;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xCC3D;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC778;&amp;#xC790;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xACE0;, auto_load_libs&amp;#xB97C; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Blank State&amp;#xC640; Find address, avoid address&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xC600;&amp;#xC73C;&amp;#xB2C8; Run &amp;#xBC84;&amp;#xD2BC;&amp;#xC744; &amp;#xB20C;&amp;#xB7EC; angr&amp;#xB97C; &amp;#xB3CC;&amp;#xB824;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC7A0;&amp;#xC2DC; &amp;#xAE30;&amp;#xB2E4;&amp;#xB824;&amp;#xBCF4;&amp;#xBA74; Solution Found&amp;#xB77C;&amp;#xACE0; &amp;#xB728;&amp;#xBA70; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC774; &amp;#xB739;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2020/10/25/idioth/angryghidra/img11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xC628; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC785;&amp;#xB825;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs bash&#34;&gt;~/Desktop$ ./r100.bin 
Enter the password: Code_Talkers
Nice!&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC0C1;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xCC3E;&amp;#xC740; &amp;#xAC83;&amp;#xC744; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB294; &amp;#xC18C;&amp;#xC2A4; &amp;#xCF54;&amp;#xB4DC; &amp;#xBCF4;&amp;#xACE0; &amp;#xD074;&amp;#xB9AD;&amp;#xC9C8;&amp;#xB9CC; &amp;#xBA87; &amp;#xBC88; &amp;#xD558;&amp;#xBA74; &amp;#xAC12;&amp;#xC744; &amp;#xCC3E;&amp;#xC544;&amp;#xC900;&amp;#xB2E4;? &amp;#xC815;&amp;#xB9D0; &amp;#xC778;&amp;#xAC04;&amp;#xC758; &amp;#xC695;&amp;#xAD6C;&amp;#xC5D0; &amp;#xCDA9;&amp;#xC2E4;&amp;#xD55C; &amp;#xD50C;&amp;#xB7EC;&amp;#xADF8;&amp;#xC778;&amp;#xC774; &amp;#xC544;&amp;#xB2D0; &amp;#xC218;&amp;#xAC00; &amp;#xC5C6;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC9C1;&amp;#xC811; &amp;#xC2A4;&amp;#xD06C;&amp;#xB9BD;&amp;#xD2B8;&amp;#xB97C; &amp;#xC791;&amp;#xC131;&amp;#xD574;&amp;#xC11C; &amp;#xB3CC;&amp;#xB9AC;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xAE30;&amp;#xB2A5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB294; &amp;#xD6E8;&amp;#xC52C; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC77C; &amp;#xC218; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC; &amp;#xB9AC;&amp;#xBC84;&amp;#xC2F1;&amp;#xC744; &amp;#xC9C4;&amp;#xD589;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xBC14;&amp;#xB85C;&amp;#xBC14;&amp;#xB85C; angr &amp;#xD658;&amp;#xACBD; &amp;#xC138;&amp;#xD305; &amp;#xBC0F; &amp;#xC2E4;&amp;#xD589;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC810;&amp;#xC774; &amp;#xB9E4;&amp;#xB825;&amp;#xC801;&amp;#xC774;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC544;&amp;#xC9C1;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xB85C;&amp;#xB9CC; &amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xAC83;&amp;#xB4E4;&amp;#xC740; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC558;&amp;#xB294;&amp;#xB370; &amp;#xB098;&amp;#xC911;&amp;#xC5D0; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xB354; &amp;#xBCF5;&amp;#xC7A1;&amp;#xD55C; &amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC62C;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4; &amp;#x314B;&amp;#x314B;&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xB3C4; &amp;#xC800;&amp;#xC758; &amp;#xBA4D;&amp;#xCCAD;&amp;#xD568;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0; &amp;#xADF9;&amp;#xBCF5;&amp;#xD55C; &amp;#xB098;&amp;#xC5D0;&amp;#xAC8C; &amp;#xAC74;&amp;#xBC30;&amp;#xD558;&amp;#xBA70;.. adios..&lt;/p&gt;
&lt;p align=&#34;center&#34;&gt;&lt;img src=&#34;./img12.jpg&#34; width=&#34;50%&#34; heightd=&#34;50%&#34;&gt;&lt;/p&gt; - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2020/10/25/idioth/angryghidra/img2.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2020/10/25/idioth/angryghidra/">

  <title>[Research] AngryGhidra를 사용해보자! - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!-- 主题依赖的图标库，不要自行修改 -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!-- 自定义样式保持在最底部 -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2020-10-25 14:00" pubdate>
      2020년 10월 25일 오후
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      2.6k 자
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      52
       분
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] AngryGhidra를 사용해보자!</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xD558;&#xC9C0;&#xBA54;&#xB9C8;&#xC2DC;&#xB5BC;! &#xBC18;&#xAC11;&#xC2B5;&#xB2C8;&#xB2E4; &#xC624;&#xB298;&#xB3C4; &#xB768;&#xB768;&#xD55C; idioth&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC624;&#xB298; &#xC18C;&#xAC1C;&#xD574;&#xB4DC;&#xB9B4; &#xD234;&#xC740; AngryGhidra&#xB77C;&#xB294; &#xD234;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB204;&#xAD70;&#xAC00;(?)&#xAC00; &#xC62C;&#xB824;&#xC900; &#xB9C1;&#xD06C;&#xB97C; &#xBCF4;&#xACE0; &#xC624; &#xC774;&#xAC70; &#xD3B8;&#xD558;&#xACA0;&#xB294;&#xB370; &#xD55C; &#xBC88; &#xC368;&#xBCFC;&#xAE4C;? &#xD558;&#xACE0; &#xC368;&#xBD24;&#xB2E4;&#xAC00; &#xC0AC;&#xC6A9;&#xD574;&#xBCFC; &#xB9CC;&#xD55C; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB294; &#xAC83; &#xAC19;&#xC544;&#xC11C; &#xAE00;&#xC744; &#xC791;&#xC131;&#xD574;&#xBD05;&#xB2C8;&#xB2E4;.</p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/angr/angr">angr</a>&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD574;&#xB4DC;&#xB9AC;&#xC790;&#xBA74; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xBD84;&#xC11D;&#xC744; &#xB3C4;&#xC640;&#xC8FC;&#xB294; python &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE30;&#xC874; angr&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; IDA&#xC640; &#xAC19;&#xC740; &#xD234;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD558;&#xACE0; python &#xCF54;&#xB4DC;&#xC5D0;&#xB2E4;&#xAC00; &#xC801;&#xACE0;&#x2026; &#xB2E4;&#xC2DC; &#xAD6C;&#xD558;&#xACE0; &#xCF54;&#xB4DC;&#xC5D0;&#xB2E4;&#xAC00; &#xC801;&#xACE0; &#xD558;&#xB294; &#xB178;&#xAC00;&#xB2E4;&#xB97C; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xB140;&#xC11D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; Ghidra&#xC5D0;&#xC11C; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xD074;&#xB9AD;&#xC9C8;&#xB9CC; &#xBA87; &#xBC88; &#xD558;&#xBA74; angr&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800;&#xB141; &#xBA39;&#xACE0; &#xC640;&#xC11C; &#xACF5;&#xBD80;&#xB3C4; &#xD558;&#xAE30; &#xC2EB;&#xACA0;&#xB2E4;&#x2026; &#xC694;&#xAC70;&#xB098; &#xC138;&#xD305;&#xD574;&#xC11C; &#xC368;&#xBCF4;&#xBA74;&#xC11C; &#xAC16;&#xACE0; &#xB180;&#xC544;&#xBD10;&#xC57C;&#xACA0;&#xB2E4;&#x2026; &#xD788;&#xD788;&#xD788; &#xD558;&#xB294; &#xC0DD;&#xAC01;&#xC740; 30&#xBD84; &#xB9CC;&#xC5D0; &#xAE68;&#xC838;&#xBC84;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xC608;&#xC0C1;&#xCE58;-&#xBABB;&#xD55C;-&#xC0BD;&#xC9C8;"><a href="#&#xC608;&#xC0C1;&#xCE58;-&#xBABB;&#xD55C;-&#xC0BD;&#xC9C8;" class="headerlink" title="&#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD55C; &#xC0BD;&#xC9C8;"></a>&#xC608;&#xC0C1;&#xCE58; &#xBABB;&#xD55C; &#xC0BD;&#xC9C8;</h1><p>&#xBD84;&#xBA85; Readme.md&#xC5D0;&#xC11C;&#xB294; &#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC744; &#xC124;&#xCE58;&#xD558;&#xC5EC; Extension &#xCD94;&#xAC00;&#xD558;&#xBA74; &#xB41C;&#xB2E4; &#xD588;&#xB2E4;.</p>
<p>&#x2192; &#xADFC;&#xB370; &#xC65C; &#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC774; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC5C6;&#xB294; &#xAC70;&#xC9C0;? &#xD568;&#xC815;&#xC778;&#xAC00;</p>
<p>&#xADF8;&#xB0E5; git clone&#xD558;&#xBA74; &#xBE4C;&#xB4DC; &#xB41C; &#xD30C;&#xC77C;&#xC774; &#xC788;&#xC744; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xC600;&#xC73C;&#xB098; &#xC5C6;&#xC5C8;&#xB2E4;.</p>
<p>&#x2192; clone&#xD558;&#xACE0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xB4E4; &#xC804;&#xBD80;&#xB2E4; Ghidra Extension&#xC5D0;&#xC11C; &#xD074;&#xB9AD;&#xD574;&#xBD24;&#xC73C;&#xB098; &#xC624;&#xB958;&#xB9CC; &#xC5C4;&#xCCAD; &#xB738;.. build.gradle &#xD30C;&#xC77C;&#xC774; &#xC788;&#xC73C;&#xB2C8; gradle&#xB85C; &#xBE4C;&#xB4DC;&#xB97C; &#xD574;&#xBCF4;&#xC790;</p>
<p>gradle&#xC744; &#xD1B5;&#xD574; &#xBE4C;&#xB4DC;&#xB97C; &#xD558;&#xB294;&#xB370; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB418;&#xC9C8; &#xC54A;&#xB124;..?</p>
<p>&#x2192; &#xB0B4;&#xAC00; &#xBB58; &#xD558;&#xB824; &#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC624;&#xB958;&#xAC00; &#xB72C;&#xB2E4;&#x2026; &#xC774;&#xCBE4;&#xC5D0;&#xC11C; &#xBA58;&#xD0C8;&#xC774; &#xB098;&#xAC00;&#xC11C; &#xD63C;&#xC790; &#xBAA8;&#xB2C8;&#xD130; &#xC55E;&#xC5D0;&#xC11C; &#xC695;&#xC744; &#xD558;&#xAE30; &#xC2DC;&#xC791;</p>
<p>&#xC6B0;&#xC5EC;&#xACE1;&#xC808; &#xC18D;&#xC5D0;&#xC11C; &#xBE4C;&#xB4DC; &#xC131;&#xACF5;(!) &#xD6C4; &#xC2E0;&#xB098;&#xC11C; L0ch&#xC5D0;&#xAC8C; &#xC57C; &#xBE4C;&#xB4DC; &#xD588;&#xB2E4; &#xC774;&#xC81C; &#xB3CC;&#xB824;&#xBCF8;&#xB2E4; &#xC606;&#xC5D0;&#xC11C; &#xB531; &#xAE30;&#xB2E4;&#xB824; &#x314B;&#x314B;&#xD558;&#xACE0; &#xC606;&#xC5D0; &#xC138;&#xC6CC;&#xB480;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xAC00;&#xC838;&#xC628; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xB3CC;&#xB838;&#xB294;&#xB370; angr&#xAC00; &#xB3CC;&#xC544;&#xAC00;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#x2026;</p>
<blockquote>
<p>L0ch &#x65E5; : &#xC544;&#xB2C8; &#xD615; &#xB41C;&#xB2E4;&#xBA74;&#xC11C; &#xC548;&#xB418;&#xC796;&#xC544; &#xBB50;&#xC57C; &#xBE68;&#xB9AC; &#xB2E4;&#xC2DC; &#xC0BD;&#xC9C8;&#xD574;&#xC694;</p>
</blockquote>
<p><del>&#xB098;&#xC05C;&#xB118;</del> &#xC544;&#xBB34;&#xD2BC; &#xC5EC;&#xAE30;&#xC11C; &#xBA48;&#xCD9C; &#xC218; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; angr&#xB97C; &#xC7AC;&#xC124;&#xCE58;&#xD574;&#xBCF4;&#xACE0; python &#xBC84;&#xC804;&#xC774; &#xBB38;&#xC820;&#xAC00; &#xC0BD;&#xC9C8;&#xC744; &#xB2E4;&#xC2DC; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;&#x2026;</p>
<p>&#xACB0;&#xAD6D; &#xBA58;&#xD0C8;&#xC774; &#xBC15;&#xC0B4; &#xB09C; &#xC0C1;&#xD0DC;&#xB85C; &#xC9D1;&#xC5D0; &#xAC00;&#xC11C; &#xC560;&#xB2C8;&#xBA54;&#xC774;&#xC158;(?)&#xC744; &#xBCF4;&#xBA70; &#xD790;&#xB9C1; &#xD6C4; &#xB2E4;&#xC74C; &#xB0A0; &#xB2E4;&#xC2DC; &#xB3C4;&#xC804;&#xC744; &#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>UE(User Error)&#xC77C; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xD06C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA70; &#xC624;&#xB298;&#xC758; &#xB098;&#xC640; &#xC5B4;&#xC81C;&#xC758; &#xB098;&#xB294; &#xB2E4;&#xB974;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB610; &#xB3CC;&#xB838;&#xB294;&#xB370; &#xC2E4;&#xD589;&#xC774; &#xC548; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xB3C4;&#xB300;&#xCCB4; &#xC65C; &#xC548;&#xB3FC;?&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xCC30;&#xB098; &#xB0B4; &#xBA38;&#xB9AC;&#xC5D0; &#xC2A4;&#xCE5C; &#xC0DD;&#xAC01;</p>
<blockquote>
<p>&#xC544;&#xB2C8; &#xC774;&#xAC70; elf &#xD30C;&#xC77C;&#xC778;&#xB370; &#xC65C; windows&#xC5D0;&#xC11C; &#xB3CC;&#xB9AC;&#xACE0; &#xC788;&#xC9C0;??</p>
</blockquote>
<p align="center"><img src="./img1.jpg" srcset="/img/loading.gif" width="60%" height="60%"></p>

<p>ubuntu&#xB85C; &#xC62E;&#xAE34; &#xB2E4;&#xC74C;&#xC5D0; &#xB2E4;&#xC2DC; &#xC704;&#xC758; &#xACFC;&#xC815; &#xBC18;&#xBCF5; &#xD6C4; &#xB2E4;&#xC2DC; L0ch&#xB97C; &#xBD88;&#xB800;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC790;&#xC2DD;&#xC740; &#xD615;&#xC774; &#xBD80;&#xB974;&#xB294;&#xB370; &#xB9E8;&#xB0A0; &#xD22C;&#xB35C;&#xAC70;&#xB824;&#xC694;. &#x201C;&#xC548;&#xB418;&#xAE30;&#xB9CC; &#xD574; &#xBD10;&#x201D; &#xD558;&#xBA74;&#xC11C; &#xC640;&#xB193;&#xACE0; &#xB418;&#xB2C8;&#xAE4C; &#xB530;&#xBD09; &#xB0A0;&#xB9AC;&#xACE0; &#xAC11;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC;&#xB294; Pre-release&#xB85C; AngryGhidra v0.1&#xC774; &#xC5C5;&#xB85C;&#xB4DC;&#xB41C; &#xC0C1;&#xD0DC;&#xB77C;&#xC11C; &#xADC0;&#xCC2E;&#xC73C;&#xC2E0; &#xBD84;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Nalen98/AngryGhidra/releases">&#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC744; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;</a> &#xBC1B;&#xC544; Extension&#xC744; &#xBC14;&#xB85C; &#xCD94;&#xAC00;&#xD558;&#xBA74; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="&#xADFC;&#xB370;-Ghidra&#xAC00;-&#xBB54;&#xB370;"><a href="#&#xADFC;&#xB370;-Ghidra&#xAC00;-&#xBB54;&#xB370;" class="headerlink" title="&#xADFC;&#xB370; Ghidra&#xAC00; &#xBB54;&#xB370;?"></a>&#xADFC;&#xB370; Ghidra&#xAC00; &#xBB54;&#xB370;?</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ghidra-sre.org/">Ghidra</a>&#xB294; NSA&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xD55C; &#xC5ED;&#xC5B4;&#xC148;&#xBE14;&#xB7EC; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;. &#xBB50; &#xD558;&#xB294; &#xB140;&#xC11D;&#xC778;&#xC9C0; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC73C;&#xBA74; IDA &#xAC19;&#xC740; &#xB140;&#xC11D;&#xC774;&#xB77C;&#xACE0; &#xBCF4;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC624;&#xD508; &#xC18C;&#xC2A4;&#xB85C; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC73C;&#xBA70; jdk 11 &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xB978; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xCC98;&#xB7FC; &#xC124;&#xCE58; &#xD30C;&#xC77C;&#xC744; &#xD1B5;&#xD574; &#xC124;&#xCE58;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xC555;&#xCD95; &#xD30C;&#xC77C;&#xC744; &#xB2E4;&#xC6B4; &#xBC1B;&#xC544;&#xC11C; &#xC555;&#xCD95;&#xB9CC; &#xD574;&#xC81C;&#xD558;&#xBA74; &#xBC14;&#xB85C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C0;&#xC6D0; &#xD50C;&#xB7AB;&#xD3FC;</p>
<ul>
<li>Windows 7 or 10 (64bit)</li>
<li>Linux (64bit, CentOs 7 is preferred)</li>
<li>macOS(OS X) 10.8.3+ (Mountain Lion or later)</li>
</ul>
<p>32&#xBE44;&#xD2B8; OS&#xC5D0;&#xC11C;&#xB294; Ghidra&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC6B0;&#xBD84;&#xD22C;&#xC5D0;-Ghidra-&#xC124;&#xCE58;&#xD558;&#xAE30;"><a href="#&#xC6B0;&#xBD84;&#xD22C;&#xC5D0;-Ghidra-&#xC124;&#xCE58;&#xD558;&#xAE30;" class="headerlink" title="&#xC6B0;&#xBD84;&#xD22C;&#xC5D0; Ghidra &#xC124;&#xCE58;&#xD558;&#xAE30;"></a>&#xC6B0;&#xBD84;&#xD22C;&#xC5D0; Ghidra &#xC124;&#xCE58;&#xD558;&#xAE30;</h2><h3 id="&#xC790;&#xBC14;-&#xD658;&#xACBD;-&#xC124;&#xCE58;"><a href="#&#xC790;&#xBC14;-&#xD658;&#xACBD;-&#xC124;&#xCE58;" class="headerlink" title="&#xC790;&#xBC14; &#xD658;&#xACBD; &#xC124;&#xCE58;"></a>&#xC790;&#xBC14; &#xD658;&#xACBD; &#xC124;&#xCE58;</h3><pre><code class="hljs bash">$ sudo add-apt-repository ppa:openjdk-r/ppa
$ sudo apt install openjdk-11-jre openjdk-11-jre-headless openjdk-11-jdk openjdk-11-jdk-headless</code></pre>
<h3 id="Ghidra-&#xC124;&#xCE58;"><a href="#Ghidra-&#xC124;&#xCE58;" class="headerlink" title="Ghidra &#xC124;&#xCE58;"></a>Ghidra &#xC124;&#xCE58;</h3><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ghidra-sre.org/">&#xAE30;&#xB4DC;&#xB77C; &#xC0AC;&#xC774;&#xD2B8;</a>&#xC5D0;&#xC11C; &#xCD5C;&#xC2E0; &#xBC84;&#xC804;&#xC758; &#xAE30;&#xB4DC;&#xB77C;&#xB97C; &#xC124;&#xCE58;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img2.png" srcset="/img/loading.gif" alt></p>
<p>&#xC124;&#xCE58; &#xD6C4; &#xC6D0;&#xD558;&#xB294; &#xD3F4;&#xB354;&#xC5D0;&#xC11C; &#xC555;&#xCD95;&#xC744; &#xD574;&#xC81C;&#xD558;&#xBA74; ghidra&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xCE58;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">idioth@ubuntu:~$ ls -al ghidra_9.1.2_PUBLIC
total 56
drwxr-xr-x  9 idioth idioth  4096  9&#xC6D4; 11 15:15 .
drwxr-xr-x 31 idioth idioth  4096  9&#xC6D4; 14 17:01 ..
drwxr-xr-x  5 idioth idioth  4096  2&#xC6D4; 12  2020 docs
drwxr-xr-x  5 idioth idioth  4096  2&#xC6D4; 12  2020 Extensions
drwxr-xr-x  8 idioth idioth  4096  2&#xC6D4; 12  2020 Ghidra
-rwxr-xr-x  1 idioth idioth   883  2&#xC6D4; 12  2020 ghidraRun
-rw-r--r--  1 idioth idioth   384  2&#xC6D4; 12  2020 ghidraRun.bat
drwxr-xr-x  7 idioth idioth  4096  2&#xC6D4; 12  2020 GPL
-rw-r--r--  1 idioth idioth 11357  2&#xC6D4; 12  2020 LICENSE
drwxr-xr-x  2 idioth idioth  4096  2&#xC6D4; 12  2020 licenses
drwxr-xr-x  2 idioth idioth  4096  2&#xC6D4; 12  2020 server
drwxr-xr-x  2 idioth idioth  4096  2&#xC6D4; 12  2020 support</code></pre>
<p>Windows&#xC758; &#xACBD;&#xC6B0; ghidraRun.bat&#xB97C; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC6B0;&#xBD84;&#xD22C;&#xC758; &#xACBD;&#xC6B0; ghidraRun&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;. &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xC744; &#xACBD;&#xC6B0; chmod +x ghidraRun&#xC744; &#xD1B5;&#xD574; &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC744; &#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="AngryGhidra"><a href="#AngryGhidra" class="headerlink" title="AngryGhidra"></a>AngryGhidra</h1><p>&#xAE30;&#xB4DC;&#xB77C;&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xCE58;&#xB418;&#xC5C8;&#xB2E4;&#xBA74; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Nalen98/AngryGhidra/releases">AngryGhidra</a>&#xB97C; &#xC124;&#xCE58;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<h2 id="Angr-&#xC124;&#xCE58;"><a href="#Angr-&#xC124;&#xCE58;" class="headerlink" title="Angr &#xC124;&#xCE58;"></a>Angr &#xC124;&#xCE58;</h2><pre><code class="hljs bash">$ sudo pip3 install angr</code></pre>
<h2 id="Releases&#xB85C;-&#xD50C;&#xB7EC;&#xADF8;&#xC778;-&#xB4F1;&#xB85D;"><a href="#Releases&#xB85C;-&#xD50C;&#xB7EC;&#xADF8;&#xC778;-&#xB4F1;&#xB85D;" class="headerlink" title="Releases&#xB85C; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xB4F1;&#xB85D;"></a>Releases&#xB85C; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xB4F1;&#xB85D;</h2><p>pre-releases&#xAC00; &#xC62C;&#xB77C;&#xC654;&#xC73C;&#xB2C8; &#xC800;&#xC640; &#xAC19;&#xC740; &#xC2DC;&#xAC04; &#xB0AD;&#xBE44;(?)&#xB294; &#xD558;&#xC9C0; &#xB9D0;&#xACE0; &#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC73C;&#xB85C; &#xB4F1;&#xB85D;&#xC744; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs bash">$ wget https://github.com/Nalen98/AngryGhidra/releases/download/0.1%2Bghidra-9.1.2/ghidra_9.1.2_PUBLIC_20200909_AngryGhidra.zip</code></pre>
<p>&#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC744; &#xC124;&#xCE58;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img3.png" srcset="/img/loading.gif" alt></p>
<p>&#xAE30;&#xB4DC;&#xB77C; &#xC2E4;&#xD589; &#xD6C4; File-Install Extensions&#xC744; &#xC120;&#xD0DD;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img4.png" srcset="/img/loading.gif" alt></p>
<p>&#xC6B0;&#xCE21; &#xC0C1;&#xB2E8;&#xC5D0; +&#xBC84;&#xD2BC;&#xC744; &#xC120;&#xD0DD;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img5.png" srcset="/img/loading.gif" alt></p>
<p>&#xC124;&#xCE58; &#xBC1B;&#xC740; zip &#xD30C;&#xC77C;&#xC744; &#xC120;&#xD0DD;&#xD574; &#xC900; &#xD6C4; &#xCCB4;&#xD06C;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xBA74; &#xB05D;&#xB0A9;&#xB2C8;&#xB2E4;. &#xCCB4;&#xD06C;&#xD558;&#xACE0; OK &#xB204;&#xB974;&#xBA74; &#xC124;&#xCE58; &#xC644;&#xB8CC;~</p>
<h2 id="Gradle&#xC744;-&#xD1B5;&#xD574;&#xC11C;-&#xC9C1;&#xC811;-&#xBE4C;&#xB4DC;&#xD558;&#xB294;-&#xBC29;&#xBC95;"><a href="#Gradle&#xC744;-&#xD1B5;&#xD574;&#xC11C;-&#xC9C1;&#xC811;-&#xBE4C;&#xB4DC;&#xD558;&#xB294;-&#xBC29;&#xBC95;" class="headerlink" title="Gradle&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC9C1;&#xC811; &#xBE4C;&#xB4DC;&#xD558;&#xB294; &#xBC29;&#xBC95;"></a>Gradle&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC9C1;&#xC811; &#xBE4C;&#xB4DC;&#xD558;&#xB294; &#xBC29;&#xBC95;</h2><p>&#xB9B4;&#xB9AC;&#xC988; &#xBC84;&#xC804;&#xC774; &#xC62C;&#xB77C;&#xC640; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAD73;&#xC774; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xD0DD;&#xD558;&#xC2DC;&#xB294; &#xBD84;&#xC774; &#xC5C6;&#xC744; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD558;&#xC9C0;&#xB9CC; &#xD639;&#xC2DC; &#xBCF8;&#xC778;&#xC774; &#xC9C1;&#xC811; &#xBE4C;&#xB4DC; &#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xC73C;&#xC2DC;&#xB2E4;&#xBA74; &#xC9C1;&#xC811; &#xBE4C;&#xB4DC; &#xD574;&#xBCF4;&#xC2DC;&#xB294; &#xAC83;&#xB3C4; &#xCD94;&#xCC9C;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">$ sudo apt install gradle
$ git <span class="hljs-built_in">clone</span> https://github.com/Nalen98/AngryGhidra</code></pre>
<p>gradle&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xBE4C;&#xB4DC; &#xD558;&#xAE30; &#xC704;&#xD574; gradle&#xC744; &#xC124;&#xCE58;&#xD558;&#xACE0; AngryGhidra repository&#xB97C; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">~/AngryGhidra$ gradle buildExtension
Starting a Gradle Daemon, 1 incompatible and 1 stopped Daemons could not be reused, use --status <span class="hljs-keyword">for</span> details

FAILURE: Build failed with an exception.

* Where:
Build file <span class="hljs-string">&apos;/home/idioth/AngryGhidra/build.gradle&apos;</span> line: 31

* What went wrong:
A problem occurred evaluating root project <span class="hljs-string">&apos;AngryGhidra&apos;</span>.
&gt; GHIDRA_INSTALL_DIR is not defined!

* Try:
Run with --stacktrace option to get the stack trace. Run with --info or --debug option to get more <span class="hljs-built_in">log</span> output. Run with --scan to get full insights.

* Get more <span class="hljs-built_in">help</span> at https://help.gradle.org

BUILD FAILED <span class="hljs-keyword">in</span> 3s</code></pre>
<p>&#xADF8;&#xB0E5; &#xBE4C;&#xB4DC;&#xB97C; &#xC9C4;&#xD589;&#xD560; &#xACBD;&#xC6B0; &#xAE30;&#xB4DC;&#xB77C;&#xC758; &#xC124;&#xCE58; &#xACBD;&#xB85C;&#xB97C; &#xC54C; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBE4C;&#xB4DC;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC880; &#xB354; &#xB611;&#xB611;&#xD55C;(?) &#xC81C;&#xAC00; &#xAC00;&#xB974;&#xCCD0;&#xC8FC;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs bash">~/AngryGhidra$ sudo GHIDRA_INSTALL_DIR=/home/idioth/ghidra_9.1.2_PUBLIC gradle buildExtension

&gt; Task :buildHelp 
INFO  Using <span class="hljs-built_in">log</span> config file: jar:file:/home/idioth/ghidra_9.1.2_PUBLIC/Ghidra/Framework/Generic/lib/Generic.jar!/generic.log4j.xml (LoggingInitialization)  
INFO  Using <span class="hljs-built_in">log</span> file: /root/.ghidra/.ghidra_9.1.2_PUBLIC/application.log (LoggingInitialization)  
[JavaHelpFilesBuilder] Generating Help Files <span class="hljs-keyword">for</span>: [file:///home/idioth/AngryGhidra/src/main/<span class="hljs-built_in">help</span>/<span class="hljs-built_in">help</span>/]
[JavaHelpFilesBuilder] Generating map file: file:///home/idioth/AngryGhidra/build/<span class="hljs-built_in">help</span>/main/<span class="hljs-built_in">help</span>/AngryGhidra_map.xml...
[JavaHelpFilesBuilder]  finished generating map file
[JavaHelpFilesBuilder] Generating TOC file: AngryGhidra_TOC.xml...
[JavaHelpFilesBuilder]  finished generating TOC file
[JavaHelpFilesBuilder] Done generating <span class="hljs-built_in">help</span> files <span class="hljs-keyword">for</span> module: AngryGhidra

&gt; Task :buildExtension 

Created ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip <span class="hljs-keyword">in</span> /home/idioth/AngryGhidra/dist

BUILD SUCCESSFUL <span class="hljs-keyword">in</span> 15s
8 actionable tasks: 8 executed</code></pre>
<p>&#xC704;&#xC640; &#xAC19;&#xC774; &#xC790;&#xC2E0;&#xC758; &#xAE30;&#xB4DC;&#xB77C; &#xACBD;&#xB85C;&#xB97C; &#xCD94;&#xAC00;&#xD574; &#xC900; &#xD6C4; &#xBE4C;&#xB4DC;&#xB97C; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. </p>
<pre><code class="hljs bash">~/AngryGhidra/dist$ ls
ghidra_9.1.2_PUBLIC_20200914_AngryGhidra.zip</code></pre>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xBE4C;&#xB4DC;&#xAC00; &#xC9C4;&#xD589;&#xB410;&#xB2E4;&#xBA74; dist &#xD3F4;&#xB354;&#xC5D0; Extension &#xD30C;&#xC77C;&#xC774; &#xC0DD;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; &#xC624;&#xC168;&#xB2E4;&#xBA74; &#xB9B4;&#xB9AC;&#xC988;&#xB97C; &#xD1B5;&#xD574; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC740; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xCD94;&#xAC00;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h2 id="AngryGhidra&#xB97C;-&#xD1B5;&#xD55C;-&#xBB38;&#xC81C;-&#xD480;&#xC774;"><a href="#AngryGhidra&#xB97C;-&#xD1B5;&#xD55C;-&#xBB38;&#xC81C;-&#xD480;&#xC774;" class="headerlink" title="AngryGhidra&#xB97C; &#xD1B5;&#xD55C; &#xBB38;&#xC81C; &#xD480;&#xC774;"></a>AngryGhidra&#xB97C; &#xD1B5;&#xD55C; &#xBB38;&#xC81C; &#xD480;&#xC774;</h2><p>angr&#xB85C; &#xD478;&#xB294; &#xBB38;&#xC81C; &#xC911; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C;(?) <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/ByteBandits/writeups/blob/master/defcamp-quals-2015/reverse/r100/r100.bin">Defcamp - r100</a>&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC5B4;&#xB5A4; &#xC2DD;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; &#xAE30;&#xB4DC;&#xB77C;&#xB85C; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xC5B4;&#xC900; &#xD6C4; main &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs cpp"><span class="hljs-function">undefined8 <span class="hljs-title">FUN_004007e8</span><span class="hljs-params">(<span class="hljs-keyword">void</span>)</span></span>
<span class="hljs-function"></span>{
	<span class="hljs-keyword">int</span> iVar1;
	<span class="hljs-keyword">char</span> *pcVar2;
	undefined8 uVar3;
	<span class="hljs-keyword">long</span> in_FS_OFFSET;
	<span class="hljs-keyword">char</span> local_118 [<span class="hljs-number">264</span>];
	<span class="hljs-keyword">long</span> local_10;

	local_10 = *(<span class="hljs-keyword">long</span> *)(in_FS_OFFSET + <span class="hljs-number">0x28</span>);
	<span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Enter the password: &quot;</span>);
	pcVar2 = fgets(local_118, <span class="hljs-number">0xff</span>, <span class="hljs-built_in">stdin</span>);
	<span class="hljs-keyword">if</span> (pcVar2 == (<span class="hljs-keyword">char</span> *)<span class="hljs-number">0x0</span>) {
		uVar3 = <span class="hljs-number">0</span>;
	}
	<span class="hljs-keyword">else</span> {
		iVar1 = FUN_004006fd(local_118);
		<span class="hljs-keyword">if</span> (iVar1 == <span class="hljs-number">0</span>) {
			put(<span class="hljs-string">&quot;Nice!&quot;</span>);
			uVar3 = <span class="hljs-number">0</span>;
		}
		<span class="hljs-keyword">else</span> {
			<span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;Incorrect password!&quot;</span>);
			uVar3 = <span class="hljs-number">1</span>;
		}
	}
	<span class="hljs-keyword">if</span> (local_10 != *(<span class="hljs-keyword">long</span> *)(in_FS_OFFSET + <span class="hljs-number">0x28</span>)) {
		__stack_chk_fail();
	}
	<span class="hljs-keyword">return</span> uVar3;
}</code></pre>
<p>password&#xB97C; &#xC785;&#xB825;&#xBC1B;&#xACE0; <code>FUN_004006fd</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A0;&#xD55C; &#xC218;&#xD589;&#xC744; &#xD558;&#xACE0; return &#xAC12;&#xC5D0; &#xB530;&#xB77C;&#xC11C; Nice&#xC640; incorrect&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xB124;&#xC694;.</p>
<p>Incorrect &#xBD80;&#xBD84;&#xC744; &#xD53C;&#xD558;&#xACE0; Nice&#xB85C; &#xAC00;&#xB294; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xCC3E;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC800; &#xD568;&#xC218;&#xB97C; &#xC77C;&#xC77C;&#xC774; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xC6B0;&#xB9AC;&#xC5D0;&#xAC8C;&#xB294; AngryGhidra&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img6.png" srcset="/img/loading.gif" alt></p>
<p>&#xBA3C;&#xC800; &#xD568;&#xC218;&#xC758; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC5D0;&#xC11C; blank state&#xB97C; &#xC124;&#xC815;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC6B0;&#xB9AC;&#xB294; Nice &#xBB38;&#xC790;&#xC5F4; &#xBD80;&#xBD84;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xAC12;&#xC744; &#xCC3E;&#xACE0; &#xC2F6;&#xC73C;&#xB2C8; Nice &#xCABD;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xC8FC;&#xC18C;&#xB97C; Find Address&#xB85C; &#xC124;&#xC815;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img8.png" srcset="/img/loading.gif" alt></p>
<p>Incorrect&#xB85C; &#xAC00;&#xB294; &#xBD80;&#xBD84;&#xC740; &#xD53C;&#xD574;&#xC57C; &#xB418;&#xB2C8; Avoid Address&#xB85C; &#xC124;&#xC815;&#xD55C; &#xB2E4;&#xC74C;&#xC5D0; AngryGhidra&#xB97C; &#xC2E4;&#xD589;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<p><img src="/2020/10/25/idioth/angryghidra/img9.png" srcset="/img/loading.gif" alt></p>
<p><img src="/2020/10/25/idioth/angryghidra/img10.png" srcset="/img/loading.gif" alt></p>
<p>Window - AngryGhidraPlugin&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xC704;&#xC758; &#xC0AC;&#xC9C4;&#xACFC; &#xAC19;&#xC740; &#xCC3D;&#xC774; &#xB739;&#xB2C8;&#xB2E4;. &#xC778;&#xC790;&#xC758; &#xAE38;&#xC774;&#xB97C; &#xC9C0;&#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0;, auto_load_libs&#xB97C; &#xC124;&#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Blank State&#xC640; Find address, avoid address&#xB97C; &#xBAA8;&#xB450; &#xC124;&#xC815;&#xD558;&#xC600;&#xC73C;&#xB2C8; Run &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; angr&#xB97C; &#xB3CC;&#xB824;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xC7A0;&#xC2DC; &#xAE30;&#xB2E4;&#xB824;&#xBCF4;&#xBA74; Solution Found&#xB77C;&#xACE0; &#xB728;&#xBA70; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC5B4;&#xB5A4; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xB739;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2020/10/25/idioth/angryghidra/img11.png" srcset="/img/loading.gif" alt></p>
<p>&#xB098;&#xC628; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xC785;&#xB825;&#xD574;&#xBCF4;&#xBA74;</p>
<pre><code class="hljs bash">~/Desktop$ ./r100.bin 
Enter the password: Code_Talkers
Nice!</code></pre>
<p>&#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC3E;&#xC740; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB098;&#xB294; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xBCF4;&#xACE0; &#xD074;&#xB9AD;&#xC9C8;&#xB9CC; &#xBA87; &#xBC88; &#xD558;&#xBA74; &#xAC12;&#xC744; &#xCC3E;&#xC544;&#xC900;&#xB2E4;? &#xC815;&#xB9D0; &#xC778;&#xAC04;&#xC758; &#xC695;&#xAD6C;&#xC5D0; &#xCDA9;&#xC2E4;&#xD55C; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC774; &#xC544;&#xB2D0; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C1;&#xC811; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD574;&#xC11C; &#xB3CC;&#xB9AC;&#xB294; &#xAC83;&#xC774; &#xAE30;&#xB2A5;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xD6E8;&#xC52C; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xB9AC;&#xBC84;&#xC2F1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xBC14;&#xB85C;&#xBC14;&#xB85C; angr &#xD658;&#xACBD; &#xC138;&#xD305; &#xBC0F; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC774; &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xC9C1;&#xC740; &#xAC04;&#xB2E8;&#xD55C; &#xAC83;&#xB4E4;&#xB85C;&#xB9CC; &#xD574;&#xBCF4;&#xACE0; &#xB354; &#xBCF5;&#xC7A1;&#xD55C; &#xAC83;&#xB4E4;&#xC740; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC9C0; &#xC54A;&#xC558;&#xB294;&#xB370; &#xB098;&#xC911;&#xC5D0; &#xAE30;&#xD68C;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; &#xB354; &#xBCF5;&#xC7A1;&#xD55C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xACE0; &#xC62C;&#xB824;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#x314B;&#x314B;</p>
<p>&#xC624;&#xB298;&#xB3C4; &#xC800;&#xC758; &#xBA4D;&#xCCAD;&#xD568;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xADF9;&#xBCF5;&#xD55C; &#xB098;&#xC5D0;&#xAC8C; &#xAC74;&#xBC30;&#xD558;&#xBA70;.. adios..</p>
<p align="center"><img src="./img12.jpg" srcset="/img/loading.gif" width="50%" heightd="50%"></p>
            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/idioth/">idioth</a>
                  
                  <a class="hover-with-bg" href="/tags/reversing/">reversing</a>
                  
                  <a class="hover-with-bg" href="/tags/angr/">angr</a>
                  
                  <a class="hover-with-bg" href="/tags/ghidra/">ghidra</a>
                  
                  <a class="hover-with-bg" href="/tags/angryghidra/">angryghidra</a>
                  
                  <a class="hover-with-bg" href="/tags/symbolic-execution/">symbolic execution</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_idioth.jpg" srcset="/img/loading.gif" alt="idioth">
                  </div>

                  <div class="link-text">
                    <div class="link-title">idioth</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/idioth">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">본 글은 <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a> 라이선스로 배포됩니다. 공유 또는 변경 시 반드시 출처를 남겨주시기 바랍니다.</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2020/10/26/idioth/cve-2020-1034/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[하루한줄] CVE-2020-1034: Windows Kernel EoP</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2020/10/24/fabu1ous/2020-10-24/">
                    <span class="hidden-mobile">[하루한줄] CVE-2020-15999: Chrome 0-day, Heap buffer overflow</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2020/10/25/idioth/angryghidra/';
        this.page.identifier = '/2020/10/25/idioth/angryghidra/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] AngryGhidra를 사용해보자!&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
