

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 1 - Segment Heap(1)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 2 - Segment Heap(2)&lt;/a&gt;&lt;br&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 3 - HITCON 2020 Michael&amp;#x2019;s Storage &amp;#x2190; Now!&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 4 - HITCON 2020 Michael&amp;#x2019;s Storage(2)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 5 - HITCON 2020 Michael&amp;#x2019;s Storage(3)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC62C;&amp;#xB9AC;&amp;#xB294; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xC5F0;&amp;#xB9D0;&amp;#xC5D0; &amp;#xC77C;&amp;#xBCF5;&amp;#xD130;&amp;#xC9C0;&amp;#xB294;&amp;#xAC74; &amp;#xC791;&amp;#xB144; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xC62C;&amp;#xD574;&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xB2E4;&amp;#xB2C8; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xC774;&amp;#xBC88; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4;&amp;#xB3C4; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xAE30;&amp;#xB294; &amp;#xD2C0;&amp;#xB9B0;&amp;#xAC70;&amp;#xACA0;&amp;#xC8E0;,, &lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC2E0;&amp;#xC774; &amp;#xC5C6;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6B4;&amp;#xAC70; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD790;&amp;#xB9C1;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD574;&amp;#xC694;.. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC694;&amp;#xC998; &amp;#xC778;&amp;#xAE30;&amp;#xC788;&amp;#xB294; CPU &amp;#xC0AC;&amp;#xC6A9;&amp;#xB960;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xACE0;&amp;#xC591;&amp;#xC774; RunCat&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x314E;&amp;#x314E; &amp;#xC774;&amp;#xB984;&amp;#xBD80;&amp;#xD130; &amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xB2EC;&amp;#xB9B0;&amp;#xB2E4;&amp;#xB77C;&amp;#xB2C8;.. &amp;#xADC0;&amp;#xC5EC;&amp;#xC6CC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Honeycam_2021-11-21_12-10-11.gif&#34; alt=&#34;Honeycam 2021-11-21 12-10-11.gif&#34;&gt;&lt;/p&gt;
&lt;p&gt;CPU&amp;#xC744; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC4F0;&amp;#xB290;&amp;#xB0D0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xAC00; &amp;#xB2EC;&amp;#xB9AC;&amp;#xB294; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xD480;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xD638;&amp;#xB2E4;&amp;#xB2E4;&amp;#xB2E5; &amp;#xB6F0;&amp;#xB294;&amp;#xAC8C; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6CC;&amp;#xC11C; &amp;#xADF8;&amp;#xB9CC; &amp;#xC9D1; &amp;#xB370;&amp;#xC2A4;&amp;#xD06C;&amp;#xD0D1;&amp;#xC774;&amp;#xB791; &amp;#xB9E5;&amp;#xBD81;&amp;#xC5D0; &amp;#xC804;&amp;#xBD80; &amp;#xAE54;&amp;#xC544;&amp;#xBC84;&amp;#xB838;&amp;#xC9C0; &amp;#xBB50;&amp;#xC608;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC9D1;&amp;#xC0AC;&amp;#xAC00; vm 4&amp;#xAC1C;&amp;#xB97C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xB9AC;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB9CC; &amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C;&amp;#xB77C;&amp;#xB3C4; &amp;#xB300;&amp;#xB9AC;&amp;#xB9CC;&amp;#xC871; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC6A9; &amp;#xC8FC;&amp;#xC778;&amp;#xB2D8;&amp;#xC740; &lt;a href=&#34;https://github.com/Kyome22/RunCat_for_windows/releases&#34;&gt;https://github.com/Kyome22/RunCat_for_windows/releases&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xC154;&amp;#xC624;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC2AC;&amp;#xD514;&amp;#xC744; &amp;#xB4A4;&amp;#xB85C;&amp;#xD558;&amp;#xACE0;&amp;#x3160; &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Segment Heap&amp;#xC758; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD560;&amp;#xB2F9; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xACFC; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0;, HITCON 2020&amp;#xC5D0; &amp;#xB098;&amp;#xC628; Segment Heap &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC2AC;&amp;#xCA4D; &amp;#xAC74;&amp;#xB4DC;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;! &lt;/p&gt;
&lt;h1 id=&#34;Low-Fragmentation-Heap&#34;&gt;&lt;a href=&#34;#Low-Fragmentation-Heap&#34; class=&#34;headerlink&#34; title=&#34;Low Fragmentation Heap&#34;&gt;&lt;/a&gt;Low Fragmentation Heap&lt;/h1&gt;&lt;p&gt;LFH(Low Fragmentation Hip)&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 1~16,368(0x3FF0)&amp;#xC778; &amp;#xD560;&amp;#xB2F9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC804;&amp;#xC5D0; NT &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xB358; LFH&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC758; LFH&amp;#xB3C4; &amp;#xB2E8;&amp;#xD3B8;&amp;#xD654;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBC84;&amp;#xD0B7; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/28/l0ch/pwncoolsexy-part2/#Low-Fragmentation-Heap&#34;&gt;NT Heap&amp;#xC758; Low Fragmentation Heap &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;LFH &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; LFH subsegment&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;LFH subsegment&amp;#xB294; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;  page rnage descriptor&amp;#xC758; &lt;code&gt;RangeFlags&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &lt;code&gt;PAGE_RANGE_FLAGS_LFH_SUBSEGMENT(0x01)&lt;/code&gt; &amp;#xBE44;&amp;#xD2B8; &amp;#xC138;&amp;#xD2B8;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC720;&amp;#xD615;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HEAP-LFH-CONTEXT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-CONTEXT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_CONTEXT&#34;&gt;&lt;/a&gt;_HEAP_LFH_CONTEXT&lt;/h2&gt;&lt;p&gt;&lt;code&gt;_HEAP_LFH_CONTEXT&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; LFH &amp;#xBC84;&amp;#xD0B7;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC911;&amp;#xC778; LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;, LFH &amp;#xC0C1;&amp;#xD0DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HeapBase&amp;#xC758; &lt;code&gt;LfhContext&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;043&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_CONTEXT -r
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; BackendCtx       : Ptr64 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x008&lt;/span&gt; Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; AffinityModArray : Ptr64 UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; MaxAffinity      : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; SubsegmentCreationLock : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x080&lt;/span&gt; Buckets          : [&lt;span class=&#34;hljs-number&#34;&gt;129&lt;/span&gt;] Ptr64 _HEAP_LFH_BUCKET
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;BackenCtx&lt;/code&gt; : &lt;code&gt;_SEGMENT_HEAP&lt;/code&gt;(HeapBase)&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Callbacks&lt;/code&gt; : LFH subsegment &amp;#xBC0F; LFH &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCF5C;&amp;#xBC31;(&amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB428;)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;MaxAffinity&lt;/code&gt; : &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Buckets&lt;/code&gt; : LFH &amp;#xBC84;&amp;#xD0B7;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC30;&amp;#xC5F4;&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xBA74; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &lt;code&gt;_HEAP_LFH_BUCKET&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B4;. &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;_HEAP_LFH_ONDEMAND_POINTER&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-ONDEMAND-POINTER&#34;&gt;&lt;a href=&#34;#HEAP-LFH-ONDEMAND-POINTER&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_ONDEMAND_POINTER&#34;&gt;&lt;/a&gt;_HEAP_LFH_ONDEMAND_POINTER&lt;/h2&gt;&lt;p&gt;&amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; LFH &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;LfhContext.Buckets&lt;/code&gt; &amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xAC00; &amp;#xB418;&amp;#xBA70; &amp;#xD544;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_ONDEMAND_POINTER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Invalid          : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllocationInProgress : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Spare0           : Pos &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; UsageData        : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllBits          : Ptr64 Void&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Invalid&lt;/code&gt; : &amp;#xD574;&amp;#xB2F9; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9C8;&amp;#xCEE4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;UsageData&lt;/code&gt; : LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; WORD &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xAC12;&lt;ul&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8; 0~4&amp;#xB294; &amp;#xBC84;&amp;#xD0B7; &amp;#xD560;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0;, &amp;#xC5EC;&amp;#xC720; &amp;#xACF5;&amp;#xAC04;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74; &amp;#xAC10;&amp;#xC18C;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8; 5~15&amp;#xB294; &amp;#xD560;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD; &amp;#xC218;&amp;#xB85C;, &amp;#xD560;&amp;#xB2F9; &amp;#xC2DC; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-BUCKET&#34;&gt;&lt;a href=&#34;#HEAP-LFH-BUCKET&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_BUCKET&#34;&gt;&lt;/a&gt;_HEAP_LFH_BUCKET&lt;/h2&gt;&lt;p&gt;&amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;LfhContext.Bucket&lt;/code&gt;&amp;#xB294; &lt;code&gt;_HEAP_LFH_BUCKET&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_BUCKET
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; State            : _HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; TotalBlockCount  : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; TotalSubsegmentCount : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; ReciprocalBlockSize : Uint4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x04c&lt;/span&gt; Shift            : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x04d&lt;/span&gt; ContentionCount  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; AffinityMappingLock : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; ProcAffinityMapping : Ptr64 UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; AffinitySlots    : Ptr64 Ptr64 _HEAP_LFH_AFFINITY_SLOT&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;TotalBlockCount&lt;/code&gt; : &amp;#xBC84;&amp;#xD0B7;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; LFH subsegment&amp;#xC758; &amp;#xCD1D; LFH &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;TotalSubsegmentCount&lt;/code&gt; : &amp;#xBC84;&amp;#xD0B7;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; LFH subsegment&amp;#xC758; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;ContentionCount&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xB54C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB41C; contentions(&amp;#xACBD;&amp;#xD569;) &amp;#xC218;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;RtlpHpLfhContentionLimit&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xCEE4;&amp;#xC9C8; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Affinity Slot&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;ProcAffinityMapping&lt;/code&gt; : AffinitySlots&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; index &amp;#xBC30;&amp;#xC5F4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AffinitySlots&lt;/code&gt; : Affinity slot &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;(&lt;code&gt;_HEAP_LFH_AFFINITY_SLOT&lt;/code&gt;)&lt;ul&gt;
&lt;li&gt;&amp;#xCCAB; &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xBA74; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, contentions&amp;#xC774; &amp;#xAC10;&amp;#xC9C0;&amp;#xB420;&amp;#xC218;&amp;#xB85D; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; affinity slot&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-AFFINITY-SLOT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-AFFINITY-SLOT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_AFFINITY_SLOT&#34;&gt;&lt;/a&gt;_HEAP_LFH_AFFINITY_SLOT&lt;/h2&gt;&lt;p&gt;Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0;&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; LFH subsegment&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xACE0;  &amp;#xD558;&amp;#xB098;&amp;#xC758; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; LFH subsegment &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xC77C;&amp;#xC815; &amp;#xC218; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xACBD;&amp;#xD569;&amp;#xC774; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xBA74; &amp;#xC0C8; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xAC00; &amp;#xBC84;&amp;#xD0B7;&amp;#xC758; &lt;code&gt;ProcAffinityMapping&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0; &amp;#xC7AC;&amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_AFFINITY_SLOT
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; State            : _HEAP_LFH_SUBSEGMENT_OWNER&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;HEAP-LFH-SUBSEGMENT-OWNER&#34;&gt;&lt;a href=&#34;#HEAP-LFH-SUBSEGMENT-OWNER&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_SUBSEGMENT_OWNER&#34;&gt;&lt;/a&gt;_HEAP_LFH_SUBSEGMENT_OWNER&lt;/h2&gt;&lt;p&gt;&lt;code&gt;LfhAffinitySlot.State&lt;/code&gt; &amp;#xC758; LFH subsegment &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; IsBucket         : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Spare0           : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x001&lt;/span&gt; BucketIndex      : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; SlotCount        : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; SlotIndex        : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x003&lt;/span&gt; Spare1           : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x008&lt;/span&gt; AvailableSubsegmentCount : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; Lock             : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; AvailableSubsegmentList : _LIST_ENTRY
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; FullSubsegmentList : _LIST_ENTRY&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;AvailableSubsegmentCount&lt;/code&gt; : &lt;code&gt;AvailableSubsegmentList&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; LFH subsegment&amp;#xC758; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AvailableSubsegmentList&lt;/code&gt; : &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC788;&amp;#xB294; LFH subsegment&amp;#xC758; linked list&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FullSubsegmentList&lt;/code&gt; : &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC5C6;&amp;#xB294;, &amp;#xBAA8;&amp;#xB450; &amp;#xCC2C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC758; LFH subsegment&amp;#xC758; linked list&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-SUBSEGMENT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-SUBSEGMENT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_SUBSEGMENT&#34;&gt;&lt;/a&gt;_HEAP_LFH_SUBSEGMENT&lt;/h2&gt;&lt;p&gt;LFH subsegment&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC774;&amp;#xBA70; &lt;code&gt;RtlpHpLfhSubsegmentCreate()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.  LFH subsegment&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD5E4;&amp;#xB354;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_SUBSEGMENT -r
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; ListEntry        : _LIST_ENTRY
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; Owner            : Ptr64 _HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; DelayFree        : _HEAP_LFH_SUBSEGMENT_DELAY_FREE
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; DelayFree        : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Count            : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt; Bits
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllBits          : Ptr64 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; CommitLock       : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; FreeCount        : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x022&lt;/span&gt; BlockCount       : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; InterlockedShort : Int2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; InterlockedLong  : Int4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x024&lt;/span&gt; FreeHint         : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x026&lt;/span&gt; Location         : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x027&lt;/span&gt; WitheldBlockCount : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; BlockOffsets     : _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; BlockSize        : Uint2B
      +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; FirstBlockOffset : Uint2B
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; EncodedData      : Uint4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02c&lt;/span&gt; CommitUnitShift  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02d&lt;/span&gt; CommitUnitCount  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02e&lt;/span&gt; CommitStateOffset : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; BlockBitmap      : [&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] Uint8B&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Listentry&lt;/code&gt; : &amp;#xAC01; LFH subsegment&amp;#xB294; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; LFH subsegment &amp;#xBAA9;&amp;#xB85D;(&lt;code&gt;LfhAffinitySlot.AvailableSubsegmentList&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;LfhAffinitySlot.FullSubsegmentList&lt;/code&gt;) &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;owner&lt;/code&gt; : &amp;#xC774; LFH subsegment&amp;#xB97C; &amp;#xC18C;&amp;#xC720;&amp;#xD558;&amp;#xB294; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FreeHint&lt;/code&gt; : &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;. &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD560; &amp;#xB54C; &amp;#xD560;&amp;#xB2F9; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Location&lt;/code&gt; : Affiniy &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; LFH subsegment &amp;#xBAA9;&amp;#xB85D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; LFH subsegment &amp;#xC704;&amp;#xCE58;: 0 - AvailableSubsegmentList, 1 -  FullSubsegmentList&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FreeCount&lt;/code&gt; : LFH subsegment&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockCount&lt;/code&gt; : LFH subsegment&amp;#xC758; &amp;#xCD1D; &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockOffsets&lt;/code&gt; : &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xC640; LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; DWORD &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockSize&lt;/code&gt; : LFH subsegment&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FirstBlockOffset&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;CommitStateOffset&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;.&lt;ul&gt;
&lt;li&gt;LFH subsegment&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCEE4;&amp;#xBC0B;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xB294;&amp;#xB370;, &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC01; &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; WORD &amp;#xD06C;&amp;#xAE30; &amp;#xAC12;&amp;#xC758; &amp;#xBC30;&amp;#xC5F4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockBitmap&lt;/code&gt; : &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC774; &amp;#xBE14;&amp;#xB85D; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0;&amp;#xC11C; 2&amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Large-Blocks-Allocation&#34;&gt;&lt;a href=&#34;#Large-Blocks-Allocation&#34; class=&#34;headerlink&#34; title=&#34;Large Blocks Allocation&#34;&gt;&lt;/a&gt;Large Blocks Allocation&lt;/h1&gt;&lt;p&gt;large block &amp;#xD560;&amp;#xB2F9;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 520,193 bytes &amp;#xC774;&amp;#xC0C1;(&amp;gt;= 0x7F001)&amp;#xC778; &amp;#xD560;&amp;#xB2F9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. large block&amp;#xC740; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70; NT memory allocator&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD560;&amp;#xB2F9; &amp;#xBC0F; &amp;#xD574;&amp;#xC81C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HEAP-LARGE-ALLOC-DATA&#34;&gt;&lt;a href=&#34;#HEAP-LARGE-ALLOC-DATA&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LARGE_ALLOC_DATA&#34;&gt;&lt;/a&gt;_HEAP_LARGE_ALLOC_DATA&lt;/h2&gt;&lt;p&gt;&amp;#xAC01; large block&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC774; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xD2B9;&amp;#xC774;&amp;#xD558;&amp;#xAC8C;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218; &lt;code&gt;RtlpHpMetadataHeap&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xD799;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LARGE_ALLOC_DATA
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; TreeNode         : _RTL_BALANCED_NODE
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; VirtualAddress   : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; UnusedBytes      : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; ExtraPresent     : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; GuardPageCount   : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; GuardPageAlignment : Pos &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; Spare            : Pos &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; AllocatedPages   : Pos &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt; Bits&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;TreeNode&lt;/code&gt; : &amp;#xAC01; large block &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &lt;code&gt;HeapBase.LargeAllocMetadata&lt;/code&gt;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;VirtualAddress&lt;/code&gt; : &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;. &amp;#xCC98;&amp;#xC74C; 16&amp;#xBE44;&amp;#xD2B8;&amp;#xB294; &lt;code&gt;UnusedBytes&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;UnusedBytes&lt;/code&gt; : &lt;code&gt;UserSize&lt;/code&gt;&amp;#xC640; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xCEE4;&amp;#xBC0B;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30; &amp;#xAC04;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AllocatedPages&lt;/code&gt; : &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xCEE4;&amp;#xBC0B;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; Segment Heap &amp;#xAD00;&amp;#xB828; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB098;&amp;#xB9C8; &amp;#xBAA8;&amp;#xB450; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; Segment Heap&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xB54C; &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;..&amp;#x314E;&amp;#x314E; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0;, &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xACFC; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xB418;&amp;#xAE30;&amp;#xC5D0; &amp;#xC77C;&amp;#xB2E8; &amp;#xB0C5;&amp;#xB2E4; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294;&amp;#xAC70;&amp;#xC8E0;. &lt;/p&gt;
&lt;h1 id=&#34;HITCON-CTF-2020-Archangel-Michael&amp;#x2019;s-Storage&#34;&gt;&lt;a href=&#34;#HITCON-CTF-2020-Archangel-Michael&amp;#x2019;s-Storage&#34; class=&#34;headerlink&#34; title=&#34;HITCON CTF 2020 - Archangel Michael&amp;#x2019;s Storage&#34;&gt;&lt;/a&gt;HITCON CTF 2020 - &lt;strong&gt;Archangel Michael&amp;#x2019;s Storage&lt;/strong&gt;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCFC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xAD70;&amp;#xC694;! &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC758; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; HITCON CTF 2020&amp;#xC5D0; &amp;#xB098;&amp;#xC628; Michael&amp;#x2019;s Storage&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC804;&amp;#xC5D0; NT Heap &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xADF8;&amp;#xB807;&amp;#xACE0;, &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; angelboy&amp;#xB77C;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xB9CC;&amp;#xB4DC;&amp;#xC2E0; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xC740; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;a href=&#34;https://github.com/scwuaptx/CTF&#34;&gt;https://github.com/scwuaptx/CTF&lt;/a&gt; &amp;#xC5D0; windows exploit&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xD55C;&amp;#xBC88;&amp;#xCBE4; &amp;#xBCF4;&amp;#xC154;&amp;#xB3C4; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xD658;&amp;#xACBD;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xACE0; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Environment&#34;&gt;&lt;a href=&#34;#Environment&#34; class=&#34;headerlink&#34; title=&#34;Environment&#34;&gt;&lt;/a&gt;Environment&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Windows x64 20H@&lt;/li&gt;
&lt;li&gt;DEP&lt;/li&gt;
&lt;li&gt;ASLR&lt;/li&gt;
&lt;li&gt;CFG&lt;/li&gt;
&lt;li&gt;Private Heap&lt;ul&gt;
&lt;li&gt;&amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD480;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Segment Heap&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;reg add &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\MichaelStorage.exe&amp;quot;&lt;/span&gt; /v FrontEndHeapDebugOptions /t REG_DWORD /d &lt;span class=&#34;hljs-number&#34;&gt;0x8&lt;/span&gt; /f
AppJailLauncher.exe ./MichaelStorage.exe /timeout:&lt;span class=&#34;hljs-number&#34;&gt;12000000&lt;/span&gt; /key:flag.txt /port:&lt;span class=&#34;hljs-number&#34;&gt;56746&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xD30C;&amp;#xC77C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC30;&amp;#xCE58;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &lt;code&gt;0x8&lt;/code&gt;&amp;#xB85C; bit 3&amp;#xC758; Enable Segment Heap&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Analysis&#34;&gt;&lt;a href=&#34;#Analysis&#34; class=&#34;headerlink&#34; title=&#34;Analysis&#34;&gt;&lt;/a&gt;Analysis&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xAE30;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xB124;&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xB274;&amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xBA54;&amp;#xB274;&amp;#xBCC4;&amp;#xB85C; &amp;#xAC01;&amp;#xAC01; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; 1&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xB294; &amp;#xD0C0;&amp;#xC785;&amp;#xACFC; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xB300; 16&amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ( i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;; ++i )
  {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !Storage[i].is_allocated )
    {
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Type of storage:&amp;quot;&lt;/span&gt;);
      storage_type = sub_7FF6203D1210();
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Size:&amp;quot;&lt;/span&gt;);
      size = sub_7FF6203D1210();
...&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;16&amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; 48 bytes &amp;#xD06C;&amp;#xAE30;&amp;#xC758; Stroage &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB294; 0&amp;#xBD80;&amp;#xD130; 3&amp;#xAE4C;&amp;#xC9C0; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC788;&amp;#xACE0;, &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC740; &amp;#xD0C0;&amp;#xC785;&amp;#xBCC4;&amp;#xB85C; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xAC01; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ( i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;; ++i ){
...
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( storage_type == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; )
  {
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;The size of secret is %u\n&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;i64);
      Storage.heap_ptr = HeapAlloc_1400010C0(&lt;span class=&#34;hljs-number&#34;&gt;0x1010&lt;/span&gt;, v1);
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !Storage.heap_ptr )
      {
        &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;allocate error&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-built_in&#34;&gt;exit&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;);
      }
      Storage[i].heap_ptr-&amp;gt;size = &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;;
      chunk_size[i] = &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;;
      Storage[i].is_allocated = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
      Storage[i].type = storage_type;
  }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xC785; 1&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD799;&amp;#xC5D0; &lt;code&gt;0x1010&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xC744; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785; 0&amp;#xC740; &lt;code&gt;size * 4 + 16&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C;, &amp;#xD0C0;&amp;#xC785; 2&amp;#xB294; &lt;code&gt;size + 16&lt;/code&gt;, &amp;#xD0C0;&amp;#xC785; 3&amp;#xB294; &lt;code&gt;size&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xC720;&amp;#xCD94;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD544;&amp;#xB4DC;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Storage&lt;/span&gt; {&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int64_t&lt;/span&gt; type; &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int64_t&lt;/span&gt; is_allocated; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD560;&amp;#xB2F9;&amp;#xC5EC;&amp;#xBD80;&lt;/span&gt;
    LPVOID heap_ptr; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/%ED%99%94%EB%A9%B4_%EC%BA%A1%EC%B2%98_2021-11-21_123751.png&#34; alt=&#34;&amp;#xD654;&amp;#xBA74; &amp;#xCEA1;&amp;#xCC98; 2021-11-21 123751.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/111.png&#34; alt=&#34;111.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;, &amp;#xD560;&amp;#xB2F9;&amp;#xC5EC;&amp;#xBD80;, &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799; &amp;#xC8FC;&amp;#xC18C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294;&amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; chunk_size &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xBCC4; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; size&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xC774; &amp;#xB418;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;2&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xB294; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xD0C0;&amp;#xC785;&amp;#xBCC4;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC12; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xB2E4;&amp;#xB978;&amp;#xB370;,  &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;int_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 0&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
    int32 uintarray[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;secret_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 1&lt;/span&gt;
    int32 size;
    uint64 uintarray[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;binary_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 2&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; content[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;string_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 3&lt;/span&gt;
	&lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* &lt;span class=&#34;hljs-built_in&#34;&gt;string&lt;/span&gt;;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xC778; Get value from storage&amp;#xC740; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;, 3&amp;#xBC88; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD9C;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; 4&amp;#xBC88; Destory storage&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC0AD;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Vulnerability&#34;&gt;&lt;a href=&#34;#Vulnerability&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability&#34;&gt;&lt;/a&gt;Vulnerability&lt;/h2&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xC758; &amp;#xD0C0;&amp;#xC785; 1 &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;__int64 input_value;

sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Index:&amp;quot;&lt;/span&gt;);
index = sub_7FF6203D1210();
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( index &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt; )
{
	&lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Out of bound&amp;quot;&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;exit&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;);
}
sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Value:&amp;quot;&lt;/span&gt;);
input_value = sub_7FF6203D1210();
*(Storage[storage_index].heap_ptr-&amp;gt;uintarray[index+&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;]) = input_value;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;index&amp;#xAC00; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xC778; 512&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xBA74; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xB294; OOB &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; index&amp;#xAC00; &amp;#xC74C;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; OOB Write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785; 1&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; -17 &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC5D0; 0xDEADBEEF&amp;#xC758; &amp;#xC815;&amp;#xC218;&amp;#xAC12;&amp;#xC778; 3735927559&amp;#xB97C; &amp;#xB123;&amp;#xC73C;&amp;#xBA74;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C;, &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; OOB write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD799; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf&#34;&gt;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf&#34;&gt;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;[&lt;a href=&#34;https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207&#34;&gt;https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research] Hip Heap  Part 3 - HITCON 2020 Michael&#39;s Storage - hackyboiz">
  <meta property="og:description" content="&lt;h1 id=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;a href=&#34;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34; class=&#34;headerlink&#34; title=&#34;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&#34;&gt;&lt;/a&gt;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988; &amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 1 - Segment Heap(1)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 2 - Segment Heap(2)&lt;/a&gt;&lt;br&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 3 - HITCON 2020 Michael&amp;#x2019;s Storage &amp;#x2190; Now!&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 4 - HITCON 2020 Michael&amp;#x2019;s Storage(2)&lt;/a&gt;&lt;br&gt;&lt;a href=&#34;https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/&#34;&gt;Hip&amp;#xD558;&amp;#xAC8C; Heap &amp;#xC815;&amp;#xBCF5;&amp;#xD558;&amp;#xAE30; Part 5 - HITCON 2020 Michael&amp;#x2019;s Storage(3)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC62C;&amp;#xB9AC;&amp;#xB294; &amp;#xC5F0;&amp;#xAD6C;&amp;#xAE00;&amp;#xC774;&amp;#xB124;&amp;#xC694; &amp;#x3160;&amp;#x3160; &amp;#xC5F0;&amp;#xB9D0;&amp;#xC5D0; &amp;#xC77C;&amp;#xBCF5;&amp;#xD130;&amp;#xC9C0;&amp;#xB294;&amp;#xAC74; &amp;#xC791;&amp;#xB144; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4; CTF&amp;#xC5D0; &amp;#xC774;&amp;#xC5B4; &amp;#xC62C;&amp;#xD574;&amp;#xB3C4; &amp;#xB611;&amp;#xAC19;&amp;#xB2E4;&amp;#xB2C8; &amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160;&amp;#x3160; &amp;#xC774;&amp;#xBC88; &amp;#xD06C;&amp;#xB9AC;&amp;#xC2A4;&amp;#xB9C8;&amp;#xC2A4;&amp;#xB3C4; &amp;#xC5EC;&amp;#xC720;&amp;#xB86D;&amp;#xAC8C; &amp;#xBCF4;&amp;#xB0B4;&amp;#xAE30;&amp;#xB294; &amp;#xD2C0;&amp;#xB9B0;&amp;#xAC70;&amp;#xACA0;&amp;#xC8E0;,, &lt;/p&gt;
&lt;p&gt;&amp;#xC815;&amp;#xC2E0;&amp;#xC774; &amp;#xC5C6;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6B4;&amp;#xAC70; &amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xD790;&amp;#xB9C1;&amp;#xC744; &amp;#xD574;&amp;#xC57C; &amp;#xD574;&amp;#xC694;.. &amp;#xADF8;&amp;#xB798;&amp;#xC11C; &amp;#xC694;&amp;#xC998; &amp;#xC778;&amp;#xAE30;&amp;#xC788;&amp;#xB294; CPU &amp;#xC0AC;&amp;#xC6A9;&amp;#xB960;&amp;#xC744; &amp;#xC54C;&amp;#xB824;&amp;#xC8FC;&amp;#xB294; &amp;#xACE0;&amp;#xC591;&amp;#xC774; RunCat&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&amp;#x314E;&amp;#x314E; &amp;#xC774;&amp;#xB984;&amp;#xBD80;&amp;#xD130; &amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xB2EC;&amp;#xB9B0;&amp;#xB2E4;&amp;#xB77C;&amp;#xB2C8;.. &amp;#xADC0;&amp;#xC5EC;&amp;#xC6CC;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Honeycam_2021-11-21_12-10-11.gif&#34; alt=&#34;Honeycam 2021-11-21 12-10-11.gif&#34;&gt;&lt;/p&gt;
&lt;p&gt;CPU&amp;#xC744; &amp;#xC5BC;&amp;#xB9C8;&amp;#xB098; &amp;#xC4F0;&amp;#xB290;&amp;#xB0D0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xACE0;&amp;#xC591;&amp;#xC774;&amp;#xAC00; &amp;#xB2EC;&amp;#xB9AC;&amp;#xB294; &amp;#xC18D;&amp;#xB3C4;&amp;#xAC00; &amp;#xB2EC;&amp;#xB77C;&amp;#xC9C0;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xD480;&amp;#xB85C;&amp;#xB4DC;&amp;#xD558;&amp;#xBA74; &amp;#xD638;&amp;#xB2E4;&amp;#xB2E4;&amp;#xB2E5; &amp;#xB6F0;&amp;#xB294;&amp;#xAC8C; &amp;#xADC0;&amp;#xC5EC;&amp;#xC6CC;&amp;#xC11C; &amp;#xADF8;&amp;#xB9CC; &amp;#xC9D1; &amp;#xB370;&amp;#xC2A4;&amp;#xD06C;&amp;#xD0D1;&amp;#xC774;&amp;#xB791; &amp;#xB9E5;&amp;#xBD81;&amp;#xC5D0; &amp;#xC804;&amp;#xBD80; &amp;#xAE54;&amp;#xC544;&amp;#xBC84;&amp;#xB838;&amp;#xC9C0; &amp;#xBB50;&amp;#xC608;&amp;#xC694;..&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xC9D1;&amp;#xC0AC;&amp;#xAC00; vm 4&amp;#xAC1C;&amp;#xB97C; &amp;#xB3D9;&amp;#xC2DC;&amp;#xC5D0; &amp;#xB3CC;&amp;#xB9AC;&amp;#xAE30; &amp;#xC2DC;&amp;#xC791;&amp;#xD588;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xB098;&amp;#xB9CC; &amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xC5C6;&amp;#xC5B4;&amp;#xC11C; &amp;#xC774;&amp;#xB807;&amp;#xAC8C;&amp;#xB77C;&amp;#xB3C4; &amp;#xB300;&amp;#xB9AC;&amp;#xB9CC;&amp;#xC871; &amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%201.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC708;&amp;#xB3C4;&amp;#xC6B0;&amp;#xC6A9; &amp;#xC8FC;&amp;#xC778;&amp;#xB2D8;&amp;#xC740; &lt;a href=&#34;https://github.com/Kyome22/RunCat_for_windows/releases&#34;&gt;https://github.com/Kyome22/RunCat_for_windows/releases&lt;/a&gt; &amp;#xC5D0;&amp;#xC11C; &amp;#xBAA8;&amp;#xC154;&amp;#xC624;&amp;#xC2DC;&amp;#xBA74; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xACE0;&amp;#xC591;&amp;#xC774; &amp;#xC5C6;&amp;#xB294; &amp;#xC2AC;&amp;#xD514;&amp;#xC744; &amp;#xB4A4;&amp;#xB85C;&amp;#xD558;&amp;#xACE0;&amp;#x3160; &amp;#xC774;&amp;#xBC88; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Segment Heap&amp;#xC758; &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD560;&amp;#xB2F9; &amp;#xB9E4;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xACFC; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCF4;&amp;#xACE0;, HITCON 2020&amp;#xC5D0; &amp;#xB098;&amp;#xC628; Segment Heap &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xC2AC;&amp;#xCA4D; &amp;#xAC74;&amp;#xB4DC;&amp;#xB824;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD560;&amp;#xAC8C;&amp;#xC694;! &lt;/p&gt;
&lt;h1 id=&#34;Low-Fragmentation-Heap&#34;&gt;&lt;a href=&#34;#Low-Fragmentation-Heap&#34; class=&#34;headerlink&#34; title=&#34;Low Fragmentation Heap&#34;&gt;&lt;/a&gt;Low Fragmentation Heap&lt;/h1&gt;&lt;p&gt;LFH(Low Fragmentation Hip)&amp;#xB294; &amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 1~16,368(0x3FF0)&amp;#xC778; &amp;#xD560;&amp;#xB2F9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC804;&amp;#xC5D0; NT &amp;#xD799;&amp;#xC5D0;&amp;#xC11C; &amp;#xB098;&amp;#xC654;&amp;#xB358; LFH&amp;#xC640; &amp;#xB9C8;&amp;#xCC2C;&amp;#xAC00;&amp;#xC9C0;&amp;#xB85C; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC758; LFH&amp;#xB3C4; &amp;#xB2E8;&amp;#xD3B8;&amp;#xD654;&amp;#xB97C; &amp;#xBC29;&amp;#xC9C0;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBC84;&amp;#xD0B7; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href=&#34;https://hackyboiz.github.io/2021/02/28/l0ch/pwncoolsexy-part2/#Low-Fragmentation-Heap&#34;&gt;NT Heap&amp;#xC758; Low Fragmentation Heap &amp;#xBCF4;&amp;#xB7EC;&amp;#xAC00;&amp;#xAE30;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;LFH &amp;#xAD6C;&amp;#xC131; &amp;#xC694;&amp;#xC18C;&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; LFH subsegment&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xB54C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;LFH subsegment&amp;#xB294; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8;  page rnage descriptor&amp;#xC758; &lt;code&gt;RangeFlags&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &lt;code&gt;PAGE_RANGE_FLAGS_LFH_SUBSEGMENT(0x01)&lt;/code&gt; &amp;#xBE44;&amp;#xD2B8; &amp;#xC138;&amp;#xD2B8;&amp;#xAC00; &amp;#xC788;&amp;#xB294; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xBC31;&amp;#xC5D4;&amp;#xB4DC; &amp;#xBE14;&amp;#xB85D; &amp;#xC720;&amp;#xD615;&amp;#xC774;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HEAP-LFH-CONTEXT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-CONTEXT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_CONTEXT&#34;&gt;&lt;/a&gt;_HEAP_LFH_CONTEXT&lt;/h2&gt;&lt;p&gt;&lt;code&gt;_HEAP_LFH_CONTEXT&lt;/code&gt;&amp;#xC5D0;&amp;#xB294; LFH &amp;#xBC84;&amp;#xD0B7;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC911;&amp;#xC778; LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;, LFH &amp;#xC0C1;&amp;#xD0DC;&amp;#xC640; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. HeapBase&amp;#xC758; &lt;code&gt;LfhContext&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;043&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_CONTEXT -r
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; BackendCtx       : Ptr64 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x008&lt;/span&gt; Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; AffinityModArray : Ptr64 UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; MaxAffinity      : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; SubsegmentCreationLock : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x080&lt;/span&gt; Buckets          : [&lt;span class=&#34;hljs-number&#34;&gt;129&lt;/span&gt;] Ptr64 _HEAP_LFH_BUCKET
&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;BackenCtx&lt;/code&gt; : &lt;code&gt;_SEGMENT_HEAP&lt;/code&gt;(HeapBase)&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Callbacks&lt;/code&gt; : LFH subsegment &amp;#xBC0F; LFH &amp;#xCEE8;&amp;#xD14D;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xCF5C;&amp;#xBC31;(&amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB428;)&lt;/li&gt;
&lt;li&gt;&lt;code&gt;MaxAffinity&lt;/code&gt; : &amp;#xB9CC;&amp;#xB4E4; &amp;#xC218; &amp;#xC788;&amp;#xB294; affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; &amp;#xCD5C;&amp;#xB300; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Buckets&lt;/code&gt; : LFH &amp;#xBC84;&amp;#xD0B7;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC30;&amp;#xC5F4;&lt;ul&gt;
&lt;li&gt;&amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xBA74; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xAC00; &lt;code&gt;_HEAP_LFH_BUCKET&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B4;. &amp;#xADF8;&amp;#xB807;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xACBD;&amp;#xC6B0; LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC744; &amp;#xCD94;&amp;#xC801;&amp;#xD560; &amp;#xB54C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xB294; &lt;code&gt;_HEAP_LFH_ONDEMAND_POINTER&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-ONDEMAND-POINTER&#34;&gt;&lt;a href=&#34;#HEAP-LFH-ONDEMAND-POINTER&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_ONDEMAND_POINTER&#34;&gt;&lt;/a&gt;_HEAP_LFH_ONDEMAND_POINTER&lt;/h2&gt;&lt;p&gt;&amp;#xC5B8;&amp;#xAE09;&amp;#xD588;&amp;#xB4EF;&amp;#xC774; LFH &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xBE44;&amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;LfhContext.Buckets&lt;/code&gt; &amp;#xC774; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xAC00; &amp;#xB418;&amp;#xBA70; &amp;#xD544;&amp;#xB4DC; &amp;#xC815;&amp;#xBCF4;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_ONDEMAND_POINTER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Invalid          : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllocationInProgress : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Spare0           : Pos &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;14&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; UsageData        : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllBits          : Ptr64 Void&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Invalid&lt;/code&gt; : &amp;#xD574;&amp;#xB2F9; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9; &amp;#xCE74;&amp;#xC6B4;&amp;#xD130;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD55C; &amp;#xB9C8;&amp;#xCEE4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;UsageData&lt;/code&gt; : LFH &amp;#xBC84;&amp;#xD0B7; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB7C9;&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD558;&amp;#xB294; WORD &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xAC12;&lt;ul&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8; 0~4&amp;#xB294; &amp;#xBC84;&amp;#xD0B7; &amp;#xD560;&amp;#xB2F9;&amp;#xC2DC; &amp;#xC99D;&amp;#xAC00;&amp;#xD558;&amp;#xACE0;, &amp;#xC5EC;&amp;#xC720; &amp;#xACF5;&amp;#xAC04;&amp;#xC774; &amp;#xC0DD;&amp;#xAE30;&amp;#xBA74; &amp;#xAC10;&amp;#xC18C;&amp;#xD558;&amp;#xB294; &amp;#xAC12;&lt;/li&gt;
&lt;li&gt;&amp;#xBE44;&amp;#xD2B8; 5~15&amp;#xB294; &amp;#xD560;&amp;#xB2F9; &amp;#xC694;&amp;#xCCAD; &amp;#xC218;&amp;#xB85C;, &amp;#xD560;&amp;#xB2F9; &amp;#xC2DC; &amp;#xC99D;&amp;#xAC00;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-BUCKET&#34;&gt;&lt;a href=&#34;#HEAP-LFH-BUCKET&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_BUCKET&#34;&gt;&lt;/a&gt;_HEAP_LFH_BUCKET&lt;/h2&gt;&lt;p&gt;&amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB41C; &amp;#xACBD;&amp;#xC6B0; &lt;code&gt;LfhContext.Bucket&lt;/code&gt;&amp;#xB294; &lt;code&gt;_HEAP_LFH_BUCKET&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xAC00;&amp;#xB9AC;&amp;#xD0B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_BUCKET
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; State            : _HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x038&lt;/span&gt; TotalBlockCount  : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x040&lt;/span&gt; TotalSubsegmentCount : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x048&lt;/span&gt; ReciprocalBlockSize : Uint4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x04c&lt;/span&gt; Shift            : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x04d&lt;/span&gt; ContentionCount  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x050&lt;/span&gt; AffinityMappingLock : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x058&lt;/span&gt; ProcAffinityMapping : Ptr64 UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x060&lt;/span&gt; AffinitySlots    : Ptr64 Ptr64 _HEAP_LFH_AFFINITY_SLOT&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;TotalBlockCount&lt;/code&gt; : &amp;#xBC84;&amp;#xD0B7;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; LFH subsegment&amp;#xC758; &amp;#xCD1D; LFH &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;TotalSubsegmentCount&lt;/code&gt; : &amp;#xBC84;&amp;#xD0B7;&amp;#xACFC; &amp;#xAD00;&amp;#xB828;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; LFH subsegment&amp;#xC758; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;ContentionCount&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xD560;&amp;#xB2F9;&amp;#xD560; &amp;#xB54C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xB41C; contentions(&amp;#xACBD;&amp;#xD569;) &amp;#xC218;&lt;ul&gt;
&lt;li&gt;&amp;#xC774; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &lt;code&gt;RtlpHpLfhContentionLimit&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xCEE4;&amp;#xC9C8; &amp;#xB54C;&amp;#xB9C8;&amp;#xB2E4; &amp;#xC694;&amp;#xCCAD;&amp;#xD558;&amp;#xB294; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; Affinity Slot&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;ProcAffinityMapping&lt;/code&gt; : AffinitySlots&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; index &amp;#xBC30;&amp;#xC5F4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AffinitySlots&lt;/code&gt; : Affinity slot &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;(&lt;code&gt;_HEAP_LFH_AFFINITY_SLOT&lt;/code&gt;)&lt;ul&gt;
&lt;li&gt;&amp;#xCCAB; &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xBA74; &amp;#xCC98;&amp;#xC74C;&amp;#xC5D4; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xC2AC;&amp;#xB86F;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC;, contentions&amp;#xC774; &amp;#xAC10;&amp;#xC9C0;&amp;#xB420;&amp;#xC218;&amp;#xB85D; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; affinity slot&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-AFFINITY-SLOT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-AFFINITY-SLOT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_AFFINITY_SLOT&#34;&gt;&lt;/a&gt;_HEAP_LFH_AFFINITY_SLOT&lt;/h2&gt;&lt;p&gt;Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0;&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; LFH subsegment&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCC98;&amp;#xC74C;&amp;#xC5D0;&amp;#xB294; &amp;#xBC84;&amp;#xD0B7;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xACE0;  &amp;#xD558;&amp;#xB098;&amp;#xC758; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xB9CC; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xC9C0;&amp;#xB9CC; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xAC00; &amp;#xB3D9;&amp;#xC77C;&amp;#xD55C; LFH subsegment &amp;#xC9D1;&amp;#xD569;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xBA70; &amp;#xC77C;&amp;#xC815; &amp;#xC218; &amp;#xC774;&amp;#xC0C1;&amp;#xC758; &amp;#xACBD;&amp;#xD569;&amp;#xC774; &amp;#xAC10;&amp;#xC9C0;&amp;#xB418;&amp;#xBA74; &amp;#xC0C8; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC774; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xACE0; &amp;#xC694;&amp;#xCCAD; &amp;#xC2A4;&amp;#xB808;&amp;#xB4DC;&amp;#xC758; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC11C;&amp;#xAC00; &amp;#xBC84;&amp;#xD0B7;&amp;#xC758; &lt;code&gt;ProcAffinityMapping&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0C8; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0; &amp;#xC7AC;&amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_AFFINITY_SLOT
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; State            : _HEAP_LFH_SUBSEGMENT_OWNER&lt;/code&gt;&lt;/pre&gt;
&lt;h2 id=&#34;HEAP-LFH-SUBSEGMENT-OWNER&#34;&gt;&lt;a href=&#34;#HEAP-LFH-SUBSEGMENT-OWNER&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_SUBSEGMENT_OWNER&#34;&gt;&lt;/a&gt;_HEAP_LFH_SUBSEGMENT_OWNER&lt;/h2&gt;&lt;p&gt;&lt;code&gt;LfhAffinitySlot.State&lt;/code&gt; &amp;#xC758; LFH subsegment &amp;#xCD94;&amp;#xC801;&amp;#xD558;&amp;#xB294;&amp;#xB370; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB418;&amp;#xBA70; &amp;#xB2E4;&amp;#xC74C; &amp;#xD544;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; IsBucket         : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Spare0           : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;7&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x001&lt;/span&gt; BucketIndex      : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; SlotCount        : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; SlotIndex        : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x003&lt;/span&gt; Spare1           : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x008&lt;/span&gt; AvailableSubsegmentCount : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; Lock             : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; AvailableSubsegmentList : _LIST_ENTRY
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; FullSubsegmentList : _LIST_ENTRY&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;AvailableSubsegmentCount&lt;/code&gt; : &lt;code&gt;AvailableSubsegmentList&lt;/code&gt;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; LFH subsegment&amp;#xC758; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AvailableSubsegmentList&lt;/code&gt; : &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC788;&amp;#xB294; LFH subsegment&amp;#xC758; linked list&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FullSubsegmentList&lt;/code&gt; : &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xC5C6;&amp;#xB294;, &amp;#xBAA8;&amp;#xB450; &amp;#xCC2C; &amp;#xC0C1;&amp;#xD0DC;&amp;#xC758; LFH subsegment&amp;#xC758; linked list&lt;/li&gt;
&lt;/ul&gt;
&lt;h2 id=&#34;HEAP-LFH-SUBSEGMENT&#34;&gt;&lt;a href=&#34;#HEAP-LFH-SUBSEGMENT&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LFH_SUBSEGMENT&#34;&gt;&lt;/a&gt;_HEAP_LFH_SUBSEGMENT&lt;/h2&gt;&lt;p&gt;LFH subsegment&amp;#xB294; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC774;&amp;#xBA70; &lt;code&gt;RtlpHpLfhSubsegmentCreate()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC0DD;&amp;#xC131; &amp;#xBC0F; &amp;#xCD08;&amp;#xAE30;&amp;#xD654;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.  LFH subsegment&amp;#xB294; &amp;#xD574;&amp;#xB2F9; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD5E4;&amp;#xB354;&amp;#xB85C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LFH_SUBSEGMENT -r
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; ListEntry        : _LIST_ENTRY
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; Owner            : Ptr64 _HEAP_LFH_SUBSEGMENT_OWNER
   +&lt;span class=&#34;hljs-number&#34;&gt;0x010&lt;/span&gt; DelayFree        : _HEAP_LFH_SUBSEGMENT_DELAY_FREE
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; DelayFree        : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; Count            : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;63&lt;/span&gt; Bits
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; AllBits          : Ptr64 Void
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; CommitLock       : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; FreeCount        : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x022&lt;/span&gt; BlockCount       : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; InterlockedShort : Int2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; InterlockedLong  : Int4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x024&lt;/span&gt; FreeHint         : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x026&lt;/span&gt; Location         : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x027&lt;/span&gt; WitheldBlockCount : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x028&lt;/span&gt; BlockOffsets     : _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; BlockSize        : Uint2B
      +&lt;span class=&#34;hljs-number&#34;&gt;0x002&lt;/span&gt; FirstBlockOffset : Uint2B
      +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; EncodedData      : Uint4B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02c&lt;/span&gt; CommitUnitShift  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02d&lt;/span&gt; CommitUnitCount  : UChar
   +&lt;span class=&#34;hljs-number&#34;&gt;0x02e&lt;/span&gt; CommitStateOffset : Uint2B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x030&lt;/span&gt; BlockBitmap      : [&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;] Uint8B&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;Listentry&lt;/code&gt; : &amp;#xAC01; LFH subsegment&amp;#xB294; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; LFH subsegment &amp;#xBAA9;&amp;#xB85D;(&lt;code&gt;LfhAffinitySlot.AvailableSubsegmentList&lt;/code&gt; &amp;#xB610;&amp;#xB294; &lt;code&gt;LfhAffinitySlot.FullSubsegmentList&lt;/code&gt;) &amp;#xC911; &amp;#xD558;&amp;#xB098;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;owner&lt;/code&gt; : &amp;#xC774; LFH subsegment&amp;#xB97C; &amp;#xC18C;&amp;#xC720;&amp;#xD558;&amp;#xB294; Affinity &amp;#xC2AC;&amp;#xB86F;&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FreeHint&lt;/code&gt; : &amp;#xCD5C;&amp;#xADFC;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB418;&amp;#xAC70;&amp;#xB098; &amp;#xD574;&amp;#xC81C;&amp;#xB41C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xBE14;&amp;#xB85D; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;. &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC744; &amp;#xAC80;&amp;#xC0C9;&amp;#xD560; &amp;#xB54C; &amp;#xD560;&amp;#xB2F9; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;Location&lt;/code&gt; : Affiniy &amp;#xC2AC;&amp;#xB86F;&amp;#xC758; LFH subsegment &amp;#xBAA9;&amp;#xB85D;&amp;#xC5D0;&amp;#xC11C; &amp;#xC774; LFH subsegment &amp;#xC704;&amp;#xCE58;: 0 - AvailableSubsegmentList, 1 -  FullSubsegmentList&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FreeCount&lt;/code&gt; : LFH subsegment&amp;#xC758; &amp;#xC0AC;&amp;#xC6A9; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockCount&lt;/code&gt; : LFH subsegment&amp;#xC758; &amp;#xCD1D; &amp;#xBE14;&amp;#xB85D; &amp;#xC218;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockOffsets&lt;/code&gt; : &amp;#xC778;&amp;#xCF54;&amp;#xB529;&amp;#xB41C; &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xC640; LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xB294; DWORD &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xD558;&amp;#xC704; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockSize&lt;/code&gt; : LFH subsegment&amp;#xC5D0; &amp;#xC788;&amp;#xB294; &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FirstBlockOffset&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;CommitStateOffset&lt;/code&gt; : LFH subsegment&amp;#xC5D0;&amp;#xC11C; &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC; &amp;#xBC30;&amp;#xC5F4;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;.&lt;ul&gt;
&lt;li&gt;LFH subsegment&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; &amp;#xCEE4;&amp;#xBC0B;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xB258;&amp;#xB294;&amp;#xB370;, &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB294; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xAC01; &amp;#xCEE4;&amp;#xBC0B; &amp;#xC0C1;&amp;#xD0DC;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xB294; WORD &amp;#xD06C;&amp;#xAE30; &amp;#xAC12;&amp;#xC758; &amp;#xBC30;&amp;#xC5F4;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;code&gt;BlockBitmap&lt;/code&gt; : &amp;#xAC01; LFH &amp;#xBE14;&amp;#xB85D;&amp;#xC740; &amp;#xC774; &amp;#xBE14;&amp;#xB85D; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC5D0;&amp;#xC11C; 2&amp;#xBE44;&amp;#xD2B8;&amp;#xB85C; &amp;#xD45C;&amp;#xC2DC;&amp;#xB428;&lt;/li&gt;
&lt;/ul&gt;
&lt;h1 id=&#34;Large-Blocks-Allocation&#34;&gt;&lt;a href=&#34;#Large-Blocks-Allocation&#34; class=&#34;headerlink&#34; title=&#34;Large Blocks Allocation&#34;&gt;&lt;/a&gt;Large Blocks Allocation&lt;/h1&gt;&lt;p&gt;large block &amp;#xD560;&amp;#xB2F9;&amp;#xC740; &amp;#xD06C;&amp;#xAE30;&amp;#xAC00; 520,193 bytes &amp;#xC774;&amp;#xC0C1;(&amp;gt;= 0x7F001)&amp;#xC778; &amp;#xD560;&amp;#xB2F9;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. large block&amp;#xC740; &amp;#xC2DC;&amp;#xC791; &amp;#xBD80;&amp;#xBD84;&amp;#xC5D0; &amp;#xD5E4;&amp;#xB354;&amp;#xAC00; &amp;#xC5C6;&amp;#xC73C;&amp;#xBA70; NT memory allocator&amp;#xC758; &amp;#xAC00;&amp;#xC0C1; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xD560;&amp;#xB2F9; &amp;#xBC0F; &amp;#xD574;&amp;#xC81C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;HEAP-LARGE-ALLOC-DATA&#34;&gt;&lt;a href=&#34;#HEAP-LARGE-ALLOC-DATA&#34; class=&#34;headerlink&#34; title=&#34;_HEAP_LARGE_ALLOC_DATA&#34;&gt;&lt;/a&gt;_HEAP_LARGE_ALLOC_DATA&lt;/h2&gt;&lt;p&gt;&amp;#xAC01; large block&amp;#xC5D0;&amp;#xB294; &amp;#xC544;&amp;#xB798; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC788;&amp;#xC73C;&amp;#xBA70; &amp;#xC774; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &amp;#xD2B9;&amp;#xC774;&amp;#xD558;&amp;#xAC8C;&amp;#xB3C4; &amp;#xB2E4;&amp;#xB978; &amp;#xBE14;&amp;#xB85D;&amp;#xACFC; &amp;#xB2E4;&amp;#xB974;&amp;#xAC8C; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; &amp;#xC804;&amp;#xC5ED; &amp;#xBCC0;&amp;#xC218; &lt;code&gt;RtlpHpMetadataHeap&lt;/code&gt;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xD799;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;:&lt;span class=&#34;hljs-number&#34;&gt;029&lt;/span&gt;&amp;gt; dt ntdll!_HEAP_LARGE_ALLOC_DATA
   +&lt;span class=&#34;hljs-number&#34;&gt;0x000&lt;/span&gt; TreeNode         : _RTL_BALANCED_NODE
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; VirtualAddress   : Uint8B
   +&lt;span class=&#34;hljs-number&#34;&gt;0x018&lt;/span&gt; UnusedBytes      : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; ExtraPresent     : Pos &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; GuardPageCount   : Pos &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; Bit
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; GuardPageAlignment : Pos &lt;span class=&#34;hljs-number&#34;&gt;2&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;6&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; Spare            : Pos &lt;span class=&#34;hljs-number&#34;&gt;8&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;4&lt;/span&gt; Bits
   +&lt;span class=&#34;hljs-number&#34;&gt;0x020&lt;/span&gt; AllocatedPages   : Pos &lt;span class=&#34;hljs-number&#34;&gt;12&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;52&lt;/span&gt; Bits&lt;/code&gt;&lt;/pre&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;TreeNode&lt;/code&gt; : &amp;#xAC01; large block &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &lt;code&gt;HeapBase.LargeAllocMetadata&lt;/code&gt;&amp;#xC758; &amp;#xB178;&amp;#xB4DC;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;VirtualAddress&lt;/code&gt; : &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xC8FC;&amp;#xC18C;. &amp;#xCC98;&amp;#xC74C; 16&amp;#xBE44;&amp;#xD2B8;&amp;#xB294; &lt;code&gt;UnusedBytes&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;UnusedBytes&lt;/code&gt; : &lt;code&gt;UserSize&lt;/code&gt;&amp;#xC640; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xCEE4;&amp;#xBC0B;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30; &amp;#xAC04;&amp;#xC758; &amp;#xCC28;&amp;#xC774;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;AllocatedPages&lt;/code&gt; : &amp;#xD398;&amp;#xC774;&amp;#xC9C0;&amp;#xC5D0;&amp;#xC11C; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xCEE4;&amp;#xBC0B;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB4DC;&amp;#xB514;&amp;#xC5B4; Segment Heap &amp;#xAD00;&amp;#xB828; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xB300;&amp;#xB7B5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;&amp;#xB098;&amp;#xB9C8; &amp;#xBAA8;&amp;#xB450; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBD24;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;! &amp;#xC0AC;&amp;#xC2E4; Segment Heap&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD560; &amp;#xB54C; &amp;#xC9C0;&amp;#xAE08;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC124;&amp;#xBA85;&amp;#xD55C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xC54C;&amp;#xC544;&amp;#xC57C; &amp;#xD558;&amp;#xB294;&amp;#xAC74; &amp;#xC544;&amp;#xB2C8;&amp;#xC9C0;&amp;#xB9CC;..&amp;#x314E;&amp;#x314E; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC744; &amp;#xC815;&amp;#xB9AC;&amp;#xD558;&amp;#xACE0;, &amp;#xD544;&amp;#xB4DC;&amp;#xB4E4;&amp;#xC774; &amp;#xD560;&amp;#xB2F9;&amp;#xACFC; &amp;#xD560;&amp;#xB2F9;&amp;#xD574;&amp;#xC81C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC5ED;&amp;#xD560;&amp;#xB4E4;&amp;#xC744; &amp;#xD558;&amp;#xB294;&amp;#xC9C0; &amp;#xCC3E;&amp;#xB2E4;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xD574;&amp;#xAC00; &amp;#xB418;&amp;#xAE30;&amp;#xC5D0; &amp;#xC77C;&amp;#xB2E8; &amp;#xB0C5;&amp;#xB2E4; &amp;#xC815;&amp;#xB9AC;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294;&amp;#xAC70;&amp;#xC8E0;. &lt;/p&gt;
&lt;h1 id=&#34;HITCON-CTF-2020-Archangel-Michael&amp;#x2019;s-Storage&#34;&gt;&lt;a href=&#34;#HITCON-CTF-2020-Archangel-Michael&amp;#x2019;s-Storage&#34; class=&#34;headerlink&#34; title=&#34;HITCON CTF 2020 - Archangel Michael&amp;#x2019;s Storage&#34;&gt;&lt;/a&gt;HITCON CTF 2020 - &lt;strong&gt;Archangel Michael&amp;#x2019;s Storage&lt;/strong&gt;&lt;/h1&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCFC; &amp;#xC2DC;&amp;#xAC04;&amp;#xC774;&amp;#xAD70;&amp;#xC694;! &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC758; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD55C; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787; &amp;#xC608;&amp;#xC2DC;&amp;#xB97C; HITCON CTF 2020&amp;#xC5D0; &amp;#xB098;&amp;#xC628; Michael&amp;#x2019;s Storage&amp;#xB77C;&amp;#xB294; &amp;#xBB38;&amp;#xC81C;&amp;#xB97C; &amp;#xD480;&amp;#xC5B4;&amp;#xBCF4;&amp;#xBA74;&amp;#xC11C; &amp;#xC54C;&amp;#xC544;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC804;&amp;#xC5D0; NT Heap &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; &amp;#xADF8;&amp;#xB807;&amp;#xACE0;, &amp;#xC774; &amp;#xBB38;&amp;#xC81C;&amp;#xB3C4; angelboy&amp;#xB77C;&amp;#xB294; &amp;#xBD84;&amp;#xC774; &amp;#xB9CC;&amp;#xB4DC;&amp;#xC2E0; &amp;#xBB38;&amp;#xC81C;&amp;#xC778;&amp;#xB370; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xAE30; &amp;#xC88B;&amp;#xC740; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xC778; &amp;#xAC83; &amp;#xAC19;&amp;#xB124;&amp;#xC694;. &lt;a href=&#34;https://github.com/scwuaptx/CTF&#34;&gt;https://github.com/scwuaptx/CTF&lt;/a&gt; &amp;#xC5D0; windows exploit&amp;#xC5D0; &amp;#xAD00;&amp;#xB828;&amp;#xD55C; &amp;#xB2E4;&amp;#xB978; &amp;#xBB38;&amp;#xC81C;&amp;#xB4E4;&amp;#xB3C4; &amp;#xC788;&amp;#xC73C;&amp;#xB2C8; &amp;#xAD81;&amp;#xAE08;&amp;#xD558;&amp;#xC2E0; &amp;#xBD84;&amp;#xB4E4;&amp;#xC740; &amp;#xD55C;&amp;#xBC88;&amp;#xCBE4; &amp;#xBCF4;&amp;#xC154;&amp;#xB3C4; &amp;#xC88B;&amp;#xC744; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&amp;#xC77C;&amp;#xB2E8; &amp;#xD658;&amp;#xACBD;&amp;#xC740; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC740;&amp;#xB370;&amp;#xC694;, &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBCF4;&amp;#xD638;&amp;#xAE30;&amp;#xBC95;&amp;#xC774; &amp;#xBAA8;&amp;#xB450; &amp;#xAC78;&amp;#xB824;&amp;#xC788;&amp;#xACE0; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC774; &amp;#xD65C;&amp;#xC131;&amp;#xD654;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Environment&#34;&gt;&lt;a href=&#34;#Environment&#34; class=&#34;headerlink&#34; title=&#34;Environment&#34;&gt;&lt;/a&gt;Environment&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;Windows x64 20H@&lt;/li&gt;
&lt;li&gt;DEP&lt;/li&gt;
&lt;li&gt;ASLR&lt;/li&gt;
&lt;li&gt;CFG&lt;/li&gt;
&lt;li&gt;Private Heap&lt;ul&gt;
&lt;li&gt;&amp;#xB3C5;&amp;#xB9BD;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xD480;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Segment Heap&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;reg add &lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\MichaelStorage.exe&amp;quot;&lt;/span&gt; /v FrontEndHeapDebugOptions /t REG_DWORD /d &lt;span class=&#34;hljs-number&#34;&gt;0x8&lt;/span&gt; /f
AppJailLauncher.exe ./MichaelStorage.exe /timeout:&lt;span class=&#34;hljs-number&#34;&gt;12000000&lt;/span&gt; /key:flag.txt /port:&lt;span class=&#34;hljs-number&#34;&gt;56746&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBB38;&amp;#xC81C;&amp;#xD30C;&amp;#xC77C; &amp;#xD658;&amp;#xACBD;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xBC30;&amp;#xCE58;&amp;#xD30C;&amp;#xC77C;&amp;#xC5D0;&amp;#xC11C; &amp;#xB808;&amp;#xC9C0;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9AC; &amp;#xD0A4;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC744; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &lt;code&gt;0x8&lt;/code&gt;&amp;#xB85C; bit 3&amp;#xC758; Enable Segment Heap&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD568;&amp;#xC73C;&amp;#xB85C;&amp;#xC368; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD2B8; &amp;#xD799;&amp;#xC774; &amp;#xC801;&amp;#xC6A9;&amp;#xB418;&amp;#xC5C8;&amp;#xB2E4;&amp;#xB294; &amp;#xAC78; &amp;#xC54C; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Analysis&#34;&gt;&lt;a href=&#34;#Analysis&#34; class=&#34;headerlink&#34; title=&#34;Analysis&#34;&gt;&lt;/a&gt;Analysis&lt;/h2&gt;&lt;p&gt;&amp;#xC774;&amp;#xC81C; &amp;#xC5B4;&amp;#xB5A4; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xD558;&amp;#xB294; &amp;#xB140;&amp;#xC11D;&amp;#xC778;&amp;#xC9C0; &amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xC8E0;! &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%202.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xBC14;&amp;#xC774;&amp;#xB108;&amp;#xB9AC;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;&amp;#xD558;&amp;#xBA74; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xAE30;&amp;#xB97C; &amp;#xC81C;&amp;#xC678;&amp;#xD55C; &amp;#xB124;&amp;#xAC1C;&amp;#xC758; &amp;#xBA54;&amp;#xB274;&amp;#xAC00; &amp;#xBCF4;&amp;#xC774;&amp;#xB124;&amp;#xC694;. &amp;#xBA54;&amp;#xB274;&amp;#xBCC4;&amp;#xB85C; &amp;#xAC01;&amp;#xAC01; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; 1&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xB294; &amp;#xD0C0;&amp;#xC785;&amp;#xACFC; &amp;#xC0AC;&amp;#xC774;&amp;#xC988;&amp;#xB97C; &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xACE0; &amp;#xC0C8;&amp;#xB85C;&amp;#xC6B4; &amp;#xC800;&amp;#xC7A5;&amp;#xC18C;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCD5C;&amp;#xB300; 16&amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ( i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;; ++i )
  {
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !Storage[i].is_allocated )
    {
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Type of storage:&amp;quot;&lt;/span&gt;);
      storage_type = sub_7FF6203D1210();
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Size:&amp;quot;&lt;/span&gt;);
      size = sub_7FF6203D1210();
...&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%203.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;16&amp;#xAC1C;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; 48 bytes &amp;#xD06C;&amp;#xAE30;&amp;#xC758; Stroage &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB294; 0&amp;#xBD80;&amp;#xD130; 3&amp;#xAE4C;&amp;#xC9C0; &amp;#xB124; &amp;#xAC00;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&amp;#xC774; &amp;#xC788;&amp;#xACE0;, &amp;#xC785;&amp;#xB825;&amp;#xBC1B;&amp;#xC740; &amp;#xD0C0;&amp;#xC785;&amp;#xBCC4;&amp;#xB85C; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; &amp;#xAC01; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;for&lt;/span&gt; ( i = &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;; i &amp;lt; &lt;span class=&#34;hljs-number&#34;&gt;16&lt;/span&gt;; ++i ){
...
	&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( storage_type == &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt; )
  {
      sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;The size of secret is %u\n&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;i64);
      Storage.heap_ptr = HeapAlloc_1400010C0(&lt;span class=&#34;hljs-number&#34;&gt;0x1010&lt;/span&gt;, v1);
      &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( !Storage.heap_ptr )
      {
        &lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;allocate error&amp;quot;&lt;/span&gt;);
        &lt;span class=&#34;hljs-built_in&#34;&gt;exit&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;);
      }
      Storage[i].heap_ptr-&amp;gt;size = &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;;
      chunk_size[i] = &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt;;
      Storage[i].is_allocated = &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
      Storage[i].type = storage_type;
  }&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xD0C0;&amp;#xC785; 1&amp;#xC758; &amp;#xACBD;&amp;#xC6B0; &amp;#xD799;&amp;#xC5D0; &lt;code&gt;0x1010&lt;/code&gt; &amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xC744; &amp;#xD558;&amp;#xB124;&amp;#xC694;. &amp;#xB098;&amp;#xBA38;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&amp;#xB3C4; &amp;#xAC19;&amp;#xC740; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785; 0&amp;#xC740; &lt;code&gt;size * 4 + 16&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C;, &amp;#xD0C0;&amp;#xC785; 2&amp;#xB294; &lt;code&gt;size + 16&lt;/code&gt;, &amp;#xD0C0;&amp;#xC785; 3&amp;#xB294; &lt;code&gt;size&lt;/code&gt;&amp;#xB9CC;&amp;#xD07C; &amp;#xD560;&amp;#xB2F9;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;p&gt;&amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB85C; &amp;#xC720;&amp;#xCD94;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;, &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xD544;&amp;#xB4DC;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB97C; &amp;#xAD00;&amp;#xB9AC;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;Storage&lt;/span&gt; {&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int64_t&lt;/span&gt; type; &lt;span class=&#34;hljs-comment&#34;&gt;//&amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0; &amp;#xD0C0;&amp;#xC785;&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;int64_t&lt;/span&gt; is_allocated; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD560;&amp;#xB2F9;&amp;#xC5EC;&amp;#xBD80;&lt;/span&gt;
    LPVOID heap_ptr; &lt;span class=&#34;hljs-comment&#34;&gt;// &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/%ED%99%94%EB%A9%B4_%EC%BA%A1%EC%B2%98_2021-11-21_123751.png&#34; alt=&#34;&amp;#xD654;&amp;#xBA74; &amp;#xCEA1;&amp;#xCC98; 2021-11-21 123751.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/111.png&#34; alt=&#34;111.png&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC28;&amp;#xB840;&amp;#xB300;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785;, &amp;#xD560;&amp;#xB2F9;&amp;#xC5EC;&amp;#xBD80;, &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799; &amp;#xC8FC;&amp;#xC18C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xB294;&amp;#xAC78; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC544;&amp;#xB798; chunk_size &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xB294; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xBCC4; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; size&amp;#xAC00; &amp;#xC800;&amp;#xC7A5;&amp;#xC774; &amp;#xB418;&amp;#xB124;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;2&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xB294; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xB54C; &amp;#xD0C0;&amp;#xC785;&amp;#xBCC4;&amp;#xB85C; &amp;#xC800;&amp;#xC7A5;&amp;#xD558;&amp;#xB294; &amp;#xAC12; &amp;#xC720;&amp;#xD615;&amp;#xC774; &amp;#xB2E4;&amp;#xB978;&amp;#xB370;,  &amp;#xBD84;&amp;#xC11D;&amp;#xD574; &amp;#xAC01;&amp;#xAC01;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC720;&amp;#xCD94;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC544;&amp;#xB798;&amp;#xC640; &amp;#xAC19;&amp;#xC774; &amp;#xB098;&amp;#xD0C0;&amp;#xB0BC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;int_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 0&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
    int32 uintarray[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;secret_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 1&lt;/span&gt;
    int32 size;
    uint64 uintarray[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};
&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;binary_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 2&lt;/span&gt;
    &lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; content[&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;];
};

&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;string_storage&lt;/span&gt; {&lt;/span&gt; &lt;span class=&#34;hljs-comment&#34;&gt;//type 3&lt;/span&gt;
	&lt;span class=&#34;hljs-keyword&#34;&gt;size_t&lt;/span&gt; size;
	&lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt;* &lt;span class=&#34;hljs-built_in&#34;&gt;string&lt;/span&gt;;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xC778; Get value from storage&amp;#xC740; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xCD9C;&amp;#xB825;&amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;, 3&amp;#xBC88; &amp;#xD0C0;&amp;#xC785;&amp;#xC758; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xB9CC; &amp;#xCD9C;&amp;#xB825;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; 4&amp;#xBC88; Destory storage&amp;#xB294; &amp;#xC785;&amp;#xB825;&amp;#xD55C; &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC758; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC5D0; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xD574;&amp;#xC81C;&amp;#xD558;&amp;#xACE0; &amp;#xC0AD;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;Vulnerability&#34;&gt;&lt;a href=&#34;#Vulnerability&#34; class=&#34;headerlink&#34; title=&#34;Vulnerability&#34;&gt;&lt;/a&gt;Vulnerability&lt;/h2&gt;&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; 2&amp;#xBC88; &amp;#xBA54;&amp;#xB274;&amp;#xC758; &amp;#xD0C0;&amp;#xC785; 1 &amp;#xAC12;&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xACF3;&amp;#xC5D0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;__int64 input_value;

sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Index:&amp;quot;&lt;/span&gt;);
index = sub_7FF6203D1210();
&lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; ( index &amp;gt;= &lt;span class=&#34;hljs-number&#34;&gt;512&lt;/span&gt; )
{
	&lt;span class=&#34;hljs-built_in&#34;&gt;puts&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Out of bound&amp;quot;&lt;/span&gt;);
	&lt;span class=&#34;hljs-built_in&#34;&gt;exit&lt;/span&gt;(&lt;span class=&#34;hljs-number&#34;&gt;-1&lt;/span&gt;);
}
sub_7FF6203D1060(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Value:&amp;quot;&lt;/span&gt;);
input_value = sub_7FF6203D1210();
*(Storage[storage_index].heap_ptr-&amp;gt;uintarray[index+&lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;]) = input_value;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;index&amp;#xAC00; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD06C;&amp;#xAE30;&amp;#xC778; 512&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xD06C;&amp;#xBA74; &amp;#xC885;&amp;#xB8CC;&amp;#xD558;&amp;#xB294; OOB &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC788;&amp;#xB124;&amp;#xC694;. &amp;#xADF8;&amp;#xB7F0;&amp;#xB370; index&amp;#xAC00; &amp;#xC74C;&amp;#xC218;&amp;#xC778;&amp;#xC9C0; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC544; &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799;&amp;#xBCF4;&amp;#xB2E4; &amp;#xB0AE;&amp;#xC740; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xC5D0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xC785;&amp;#xB825;&amp;#xAC12;&amp;#xC744; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xC5B4; OOB Write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%204.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xD0C0;&amp;#xC785; 1&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xC2A4;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC9C0;&amp;#xC758; -17 &amp;#xC778;&amp;#xB371;&amp;#xC2A4;&amp;#xC5D0; 0xDEADBEEF&amp;#xC758; &amp;#xC815;&amp;#xC218;&amp;#xAC12;&amp;#xC778; 3735927559&amp;#xB97C; &amp;#xB123;&amp;#xC73C;&amp;#xBA74;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2021/11/21/l0ch/segment-heap-part3/Untitled%205.png&#34; alt=&#34;Untitled&#34;&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xB807;&amp;#xAC8C;, &amp;#xD560;&amp;#xB2F9;&amp;#xB41C; &amp;#xD799;&amp;#xC774; &amp;#xC544;&amp;#xB2CC; &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xC784;&amp;#xC758;&amp;#xC758; &amp;#xAC12;&amp;#xC744; &amp;#xC4F8; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C; &amp;#xD30C;&amp;#xD2B8;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; OOB write &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC73C;&amp;#xB85C; &amp;#xC138;&amp;#xADF8;&amp;#xBA3C;&amp;#xD14C;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD799; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574;&amp;#xC11C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;&amp;#xB97C; &amp;#xB9AD;&amp;#xD558;&amp;#xACE0; &amp;#xC775;&amp;#xC2A4;&amp;#xD50C;&amp;#xB85C;&amp;#xC787;&amp;#xC744; &amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;Reference&lt;/h1&gt;&lt;p&gt;&lt;a href=&#34;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf&#34;&gt;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf&#34;&gt;https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;[&lt;a href=&#34;https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207&#34;&gt;https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io2021/11/21/l0ch/segment-heap-part3/thumbnail.jpg">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/">

  <title>[Research] Hip Heap  Part 3 - HITCON 2020 Michael&#39;s Storage - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2021-11-21 18:00" pubdate>
      2021 11 21 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      3.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      67
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research] Hip Heap  Part 3 - HITCON 2020 Michael&#39;s Storage</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <h1 id="&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;"><a href="#&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;" class="headerlink" title="&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;"></a>&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 1 - Segment Heap(1)</a><br><a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 2 - Segment Heap(2)</a><br>Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 3 - HITCON 2020 Michael&#x2019;s Storage &#x2190; Now!<br><a href="https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 4 - HITCON 2020 Michael&#x2019;s Storage(2)</a><br><a href="https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 5 - HITCON 2020 Michael&#x2019;s Storage(3)</a></p>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! L0ch&#xC785;&#xB2C8;&#xB2E4;. &#xC815;&#xB9D0; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xC62C;&#xB9AC;&#xB294; &#xC5F0;&#xAD6C;&#xAE00;&#xC774;&#xB124;&#xC694; &#x3160;&#x3160; &#xC5F0;&#xB9D0;&#xC5D0; &#xC77C;&#xBCF5;&#xD130;&#xC9C0;&#xB294;&#xAC74; &#xC791;&#xB144; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF&#xC5D0; &#xC774;&#xC5B4; &#xC62C;&#xD574;&#xB3C4; &#xB611;&#xAC19;&#xB2E4;&#xB2C8; &#x3160;&#x3160;&#x3160;&#x3160;&#x3160;&#x3160; &#xC774;&#xBC88; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4;&#xB3C4; &#xC5EC;&#xC720;&#xB86D;&#xAC8C; &#xBCF4;&#xB0B4;&#xAE30;&#xB294; &#xD2C0;&#xB9B0;&#xAC70;&#xACA0;&#xC8E0;,, </p>
<p>&#xC815;&#xC2E0;&#xC774; &#xC5C6;&#xC744;&#xC218;&#xB85D; &#xADC0;&#xC5EC;&#xC6B4;&#xAC70; &#xBCF4;&#xBA74;&#xC11C; &#xD790;&#xB9C1;&#xC744; &#xD574;&#xC57C; &#xD574;&#xC694;.. &#xADF8;&#xB798;&#xC11C; &#xC694;&#xC998; &#xC778;&#xAE30;&#xC788;&#xB294; CPU &#xC0AC;&#xC6A9;&#xB960;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xACE0;&#xC591;&#xC774; RunCat&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;&#x314E;&#x314E; &#xC774;&#xB984;&#xBD80;&#xD130; &#xACE0;&#xC591;&#xC774; &#xB2EC;&#xB9B0;&#xB2E4;&#xB77C;&#xB2C8;.. &#xADC0;&#xC5EC;&#xC6CC;</p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Honeycam_2021-11-21_12-10-11.gif" srcset="/img/loading.gif" alt="Honeycam 2021-11-21 12-10-11.gif"></p>
<p>CPU&#xC744; &#xC5BC;&#xB9C8;&#xB098; &#xC4F0;&#xB290;&#xB0D0;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xACE0;&#xC591;&#xC774;&#xAC00; &#xB2EC;&#xB9AC;&#xB294; &#xC18D;&#xB3C4;&#xAC00; &#xB2EC;&#xB77C;&#xC9C0;&#xB294;&#xB370;&#xC694;, &#xD480;&#xB85C;&#xB4DC;&#xD558;&#xBA74; &#xD638;&#xB2E4;&#xB2E4;&#xB2E5; &#xB6F0;&#xB294;&#xAC8C; &#xADC0;&#xC5EC;&#xC6CC;&#xC11C; &#xADF8;&#xB9CC; &#xC9D1; &#xB370;&#xC2A4;&#xD06C;&#xD0D1;&#xC774;&#xB791; &#xB9E5;&#xBD81;&#xC5D0; &#xC804;&#xBD80; &#xAE54;&#xC544;&#xBC84;&#xB838;&#xC9C0; &#xBB50;&#xC608;&#xC694;..</p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled.png" srcset="/img/loading.gif" alt="Untitled"></p>
<blockquote>
<p>&#xC9D1;&#xC0AC;&#xAC00; vm 4&#xAC1C;&#xB97C; &#xB3D9;&#xC2DC;&#xC5D0; &#xB3CC;&#xB9AC;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;.</p>
</blockquote>
<p>&#xB098;&#xB9CC; &#xACE0;&#xC591;&#xC774; &#xC5C6;&#xC5B4;&#xC11C; &#xC774;&#xB807;&#xAC8C;&#xB77C;&#xB3C4; &#xB300;&#xB9AC;&#xB9CC;&#xC871; &#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%201.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC708;&#xB3C4;&#xC6B0;&#xC6A9; &#xC8FC;&#xC778;&#xB2D8;&#xC740; <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/Kyome22/RunCat_for_windows/releases">https://github.com/Kyome22/RunCat_for_windows/releases</a> &#xC5D0;&#xC11C; &#xBAA8;&#xC154;&#xC624;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p>
<p>&#xACE0;&#xC591;&#xC774; &#xC5C6;&#xB294; &#xC2AC;&#xD514;&#xC744; &#xB4A4;&#xB85C;&#xD558;&#xACE0;&#x3160; &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; Segment Heap&#xC758; &#xB098;&#xBA38;&#xC9C0; &#xBA54;&#xBAA8;&#xB9AC; &#xD560;&#xB2F9; &#xB9E4;&#xCEE4;&#xB2C8;&#xC998;&#xACFC; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0;, HITCON 2020&#xC5D0; &#xB098;&#xC628; Segment Heap &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xBB38;&#xC81C;&#xB3C4; &#xC2AC;&#xCA4D; &#xAC74;&#xB4DC;&#xB824;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;! </p>
<h1 id="Low-Fragmentation-Heap"><a href="#Low-Fragmentation-Heap" class="headerlink" title="Low Fragmentation Heap"></a>Low Fragmentation Heap</h1><p>LFH(Low Fragmentation Hip)&#xB294; &#xBC14;&#xC774;&#xD2B8; &#xD06C;&#xAE30;&#xAC00; 1~16,368(0x3FF0)&#xC778; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xC804;&#xC5D0; NT &#xD799;&#xC5D0;&#xC11C; &#xB098;&#xC654;&#xB358; LFH&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC758; LFH&#xB3C4; &#xB2E8;&#xD3B8;&#xD654;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBC84;&#xD0B7; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><a href="https://hackyboiz.github.io/2021/02/28/l0ch/pwncoolsexy-part2/#Low-Fragmentation-Heap">NT Heap&#xC758; Low Fragmentation Heap &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</a></p>
</blockquote>
<p>LFH &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; LFH subsegment&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C; &#xBC31;&#xC5D4;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.<br>LFH subsegment&#xB294; &#xCCAB; &#xBC88;&#xC9F8;  page rnage descriptor&#xC758; <code>RangeFlags</code> &#xD544;&#xB4DC;&#xC5D0; <code>PAGE_RANGE_FLAGS_LFH_SUBSEGMENT(0x01)</code> &#xBE44;&#xD2B8; &#xC138;&#xD2B8;&#xAC00; &#xC788;&#xB294; &#xD2B9;&#xC218;&#xD55C; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D; &#xC720;&#xD615;&#xC774;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="HEAP-LFH-CONTEXT"><a href="#HEAP-LFH-CONTEXT" class="headerlink" title="_HEAP_LFH_CONTEXT"></a>_HEAP_LFH_CONTEXT</h2><p><code>_HEAP_LFH_CONTEXT</code>&#xC5D0;&#xB294; LFH &#xBC84;&#xD0B7;, &#xC0AC;&#xC6A9;&#xC911;&#xC778; LFH &#xBC84;&#xD0B7; &#xCE74;&#xC6B4;&#xD130;, LFH &#xC0C1;&#xD0DC;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. HeapBase&#xC758; <code>LfhContext</code> &#xD544;&#xB4DC;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA70; &#xB2E4;&#xC74C; &#xD544;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">043</span>&gt; dt ntdll!_HEAP_LFH_CONTEXT -r
   +<span class="hljs-number">0x000</span> BackendCtx       : Ptr64 Void
   +<span class="hljs-number">0x008</span> Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS
   +<span class="hljs-number">0x030</span> AffinityModArray : Ptr64 UChar
   +<span class="hljs-number">0x038</span> MaxAffinity      : UChar
   +<span class="hljs-number">0x048</span> SubsegmentCreationLock : Uint8B
   +<span class="hljs-number">0x080</span> Buckets          : [<span class="hljs-number">129</span>] Ptr64 _HEAP_LFH_BUCKET
</code></pre>
<ul>
<li><code>BackenCtx</code> : <code>_SEGMENT_HEAP</code>(HeapBase)&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;</li>
<li><code>Callbacks</code> : LFH subsegment &#xBC0F; LFH &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCF5C;&#xBC31;(&#xC778;&#xCF54;&#xB529;&#xB428;)</li>
<li><code>MaxAffinity</code> : &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB294; affinity &#xC2AC;&#xB86F;&#xC758; &#xCD5C;&#xB300; &#xC218;</li>
<li><code>Buckets</code> : LFH &#xBC84;&#xD0B7;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130; &#xBC30;&#xC5F4;<ul>
<li>&#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xBA74; &#xD3EC;&#xC778;&#xD130;&#xAC00; <code>_HEAP_LFH_BUCKET</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; LFH &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9;&#xC744; &#xCD94;&#xC801;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; <code>_HEAP_LFH_ONDEMAND_POINTER</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B4;</li>
</ul>
</li>
</ul>
<h2 id="HEAP-LFH-ONDEMAND-POINTER"><a href="#HEAP-LFH-ONDEMAND-POINTER" class="headerlink" title="_HEAP_LFH_ONDEMAND_POINTER"></a>_HEAP_LFH_ONDEMAND_POINTER</h2><p>&#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; LFH &#xBC84;&#xD0B7;&#xC774; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0; <code>LfhContext.Buckets</code> &#xC774; &#xC0AC;&#xC6A9;&#xB7C9; &#xCE74;&#xC6B4;&#xD130;&#xAC00; &#xB418;&#xBA70; &#xD544;&#xB4DC; &#xC815;&#xBCF4;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_ONDEMAND_POINTER
   +<span class="hljs-number">0x000</span> Invalid          : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit
   +<span class="hljs-number">0x000</span> AllocationInProgress : Pos <span class="hljs-number">1</span>, <span class="hljs-number">1</span> Bit
   +<span class="hljs-number">0x000</span> Spare0           : Pos <span class="hljs-number">2</span>, <span class="hljs-number">14</span> Bits
   +<span class="hljs-number">0x002</span> UsageData        : Uint2B
   +<span class="hljs-number">0x000</span> AllBits          : Ptr64 Void</code></pre>
<ul>
<li><code>Invalid</code> : &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9; &#xCE74;&#xC6B4;&#xD130;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB9C8;&#xCEE4;</li>
<li><code>UsageData</code> : LFH &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9;&#xB7C9;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; WORD &#xD06C;&#xAE30;&#xC758; &#xAC12;<ul>
<li>&#xBE44;&#xD2B8; 0~4&#xB294; &#xBC84;&#xD0B7; &#xD560;&#xB2F9;&#xC2DC; &#xC99D;&#xAC00;&#xD558;&#xACE0;, &#xC5EC;&#xC720; &#xACF5;&#xAC04;&#xC774; &#xC0DD;&#xAE30;&#xBA74; &#xAC10;&#xC18C;&#xD558;&#xB294; &#xAC12;</li>
<li>&#xBE44;&#xD2B8; 5~15&#xB294; &#xD560;&#xB2F9; &#xC694;&#xCCAD; &#xC218;&#xB85C;, &#xD560;&#xB2F9; &#xC2DC; &#xC99D;&#xAC00;</li>
</ul>
</li>
</ul>
<h2 id="HEAP-LFH-BUCKET"><a href="#HEAP-LFH-BUCKET" class="headerlink" title="_HEAP_LFH_BUCKET"></a>_HEAP_LFH_BUCKET</h2><p>&#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0; <code>LfhContext.Bucket</code>&#xB294; <code>_HEAP_LFH_BUCKET</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_BUCKET
   +<span class="hljs-number">0x000</span> State            : _HEAP_LFH_SUBSEGMENT_OWNER
   +<span class="hljs-number">0x038</span> TotalBlockCount  : Uint8B
   +<span class="hljs-number">0x040</span> TotalSubsegmentCount : Uint8B
   +<span class="hljs-number">0x048</span> ReciprocalBlockSize : Uint4B
   +<span class="hljs-number">0x04c</span> Shift            : UChar
   +<span class="hljs-number">0x04d</span> ContentionCount  : UChar
   +<span class="hljs-number">0x050</span> AffinityMappingLock : Uint8B
   +<span class="hljs-number">0x058</span> ProcAffinityMapping : Ptr64 UChar
   +<span class="hljs-number">0x060</span> AffinitySlots    : Ptr64 Ptr64 _HEAP_LFH_AFFINITY_SLOT</code></pre>
<ul>
<li><code>TotalBlockCount</code> : &#xBC84;&#xD0B7;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; LFH subsegment&#xC758; &#xCD1D; LFH &#xBE14;&#xB85D; &#xC218;</li>
<li><code>TotalSubsegmentCount</code> : &#xBC84;&#xD0B7;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; LFH subsegment&#xC758; &#xC218;</li>
<li><code>ContentionCount</code> : LFH subsegment&#xC5D0;&#xC11C; &#xBE14;&#xB85D;&#xC744; &#xD560;&#xB2F9;&#xD560; &#xB54C; &#xC2DD;&#xBCC4;&#xB41C; contentions(&#xACBD;&#xD569;) &#xC218;<ul>
<li>&#xC774; &#xD544;&#xB4DC;&#xAC00; <code>RtlpHpLfhContentionLimit</code>&#xB9CC;&#xD07C; &#xCEE4;&#xC9C8; &#xB54C;&#xB9C8;&#xB2E4; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0; &#xB300;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; Affinity Slot&#xC774; &#xC0DD;&#xC131;&#xB428;</li>
</ul>
</li>
<li><code>ProcAffinityMapping</code> : AffinitySlots&#xC5D0; &#xB300;&#xD55C; index &#xBC30;&#xC5F4;</li>
<li><code>AffinitySlots</code> : Affinity slot &#xD3EC;&#xC778;&#xD130; &#xBC30;&#xC5F4;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;(<code>_HEAP_LFH_AFFINITY_SLOT</code>)<ul>
<li>&#xCCAB; &#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xBA74; &#xCC98;&#xC74C;&#xC5D4; &#xD558;&#xB098;&#xC758; &#xC2AC;&#xB86F;&#xB9CC; &#xC0DD;&#xC131;&#xB418;&#xC9C0;&#xB9CC;, contentions&#xC774; &#xAC10;&#xC9C0;&#xB420;&#xC218;&#xB85D; &#xC0C8;&#xB85C;&#xC6B4; affinity slot&#xC774; &#xC0DD;&#xC131;&#xB428;</li>
</ul>
</li>
</ul>
<h2 id="HEAP-LFH-AFFINITY-SLOT"><a href="#HEAP-LFH-AFFINITY-SLOT" class="headerlink" title="_HEAP_LFH_AFFINITY_SLOT"></a>_HEAP_LFH_AFFINITY_SLOT</h2><p>Affinity &#xC2AC;&#xB86F;&#xC5D0;&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; LFH subsegment&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xACE0;  &#xD558;&#xB098;&#xC758; Affinity &#xC2AC;&#xB86F;&#xB9CC; &#xC0DD;&#xC131;&#xB418;&#xC9C0;&#xB9CC; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; LFH subsegment &#xC9D1;&#xD569;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xC77C;&#xC815; &#xC218; &#xC774;&#xC0C1;&#xC758; &#xACBD;&#xD569;&#xC774; &#xAC10;&#xC9C0;&#xB418;&#xBA74; &#xC0C8; Affinity &#xC2AC;&#xB86F;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xC694;&#xCCAD; &#xC2A4;&#xB808;&#xB4DC;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xAC00; &#xBC84;&#xD0B7;&#xC758; <code>ProcAffinityMapping</code> &#xD544;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xC0C8; Affinity &#xC2AC;&#xB86F;&#xC5D0; &#xC7AC;&#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_AFFINITY_SLOT
   +<span class="hljs-number">0x000</span> State            : _HEAP_LFH_SUBSEGMENT_OWNER</code></pre>
<h2 id="HEAP-LFH-SUBSEGMENT-OWNER"><a href="#HEAP-LFH-SUBSEGMENT-OWNER" class="headerlink" title="_HEAP_LFH_SUBSEGMENT_OWNER"></a>_HEAP_LFH_SUBSEGMENT_OWNER</h2><p><code>LfhAffinitySlot.State</code> &#xC758; LFH subsegment &#xCD94;&#xC801;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; &#xB2E4;&#xC74C; &#xD544;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_SUBSEGMENT_OWNER
   +<span class="hljs-number">0x000</span> IsBucket         : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit
   +<span class="hljs-number">0x000</span> Spare0           : Pos <span class="hljs-number">1</span>, <span class="hljs-number">7</span> Bits
   +<span class="hljs-number">0x001</span> BucketIndex      : UChar
   +<span class="hljs-number">0x002</span> SlotCount        : UChar
   +<span class="hljs-number">0x002</span> SlotIndex        : UChar
   +<span class="hljs-number">0x003</span> Spare1           : UChar
   +<span class="hljs-number">0x008</span> AvailableSubsegmentCount : Uint8B
   +<span class="hljs-number">0x010</span> Lock             : Uint8B
   +<span class="hljs-number">0x018</span> AvailableSubsegmentList : _LIST_ENTRY
   +<span class="hljs-number">0x028</span> FullSubsegmentList : _LIST_ENTRY</code></pre>
<ul>
<li><code>AvailableSubsegmentCount</code> : <code>AvailableSubsegmentList</code>&#xC5D0; &#xC788;&#xB294; LFH subsegment&#xC758; &#xC218;</li>
<li><code>AvailableSubsegmentList</code> : &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC774; &#xC788;&#xB294; LFH subsegment&#xC758; linked list</li>
<li><code>FullSubsegmentList</code> : &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC774; &#xC5C6;&#xB294;, &#xBAA8;&#xB450; &#xCC2C; &#xC0C1;&#xD0DC;&#xC758; LFH subsegment&#xC758; linked list</li>
</ul>
<h2 id="HEAP-LFH-SUBSEGMENT"><a href="#HEAP-LFH-SUBSEGMENT" class="headerlink" title="_HEAP_LFH_SUBSEGMENT"></a>_HEAP_LFH_SUBSEGMENT</h2><p>LFH subsegment&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; &#xACF3;&#xC774;&#xBA70; <code>RtlpHpLfhSubsegmentCreate()</code>&#xB97C; &#xD1B5;&#xD574; &#xC0DD;&#xC131; &#xBC0F; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.  LFH subsegment&#xB294; &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD5E4;&#xB354;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_SUBSEGMENT -r
   +<span class="hljs-number">0x000</span> ListEntry        : _LIST_ENTRY
   +<span class="hljs-number">0x010</span> Owner            : Ptr64 _HEAP_LFH_SUBSEGMENT_OWNER
   +<span class="hljs-number">0x010</span> DelayFree        : _HEAP_LFH_SUBSEGMENT_DELAY_FREE
      +<span class="hljs-number">0x000</span> DelayFree        : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit
      +<span class="hljs-number">0x000</span> Count            : Pos <span class="hljs-number">1</span>, <span class="hljs-number">63</span> Bits
      +<span class="hljs-number">0x000</span> AllBits          : Ptr64 Void
   +<span class="hljs-number">0x018</span> CommitLock       : Uint8B
   +<span class="hljs-number">0x020</span> FreeCount        : Uint2B
   +<span class="hljs-number">0x022</span> BlockCount       : Uint2B
   +<span class="hljs-number">0x020</span> InterlockedShort : Int2B
   +<span class="hljs-number">0x020</span> InterlockedLong  : Int4B
   +<span class="hljs-number">0x024</span> FreeHint         : Uint2B
   +<span class="hljs-number">0x026</span> Location         : UChar
   +<span class="hljs-number">0x027</span> WitheldBlockCount : UChar
   +<span class="hljs-number">0x028</span> BlockOffsets     : _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS
      +<span class="hljs-number">0x000</span> BlockSize        : Uint2B
      +<span class="hljs-number">0x002</span> FirstBlockOffset : Uint2B
      +<span class="hljs-number">0x000</span> EncodedData      : Uint4B
   +<span class="hljs-number">0x02c</span> CommitUnitShift  : UChar
   +<span class="hljs-number">0x02d</span> CommitUnitCount  : UChar
   +<span class="hljs-number">0x02e</span> CommitStateOffset : Uint2B
   +<span class="hljs-number">0x030</span> BlockBitmap      : [<span class="hljs-number">1</span>] Uint8B</code></pre>
<ul>
<li><code>Listentry</code> : &#xAC01; LFH subsegment&#xB294; Affinity &#xC2AC;&#xB86F;&#xC758; LFH subsegment &#xBAA9;&#xB85D;(<code>LfhAffinitySlot.AvailableSubsegmentList</code> &#xB610;&#xB294; <code>LfhAffinitySlot.FullSubsegmentList</code>) &#xC911; &#xD558;&#xB098;&#xC758; &#xB178;&#xB4DC;</li>
<li><code>owner</code> : &#xC774; LFH subsegment&#xB97C; &#xC18C;&#xC720;&#xD558;&#xB294; Affinity &#xC2AC;&#xB86F;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;</li>
<li><code>FreeHint</code> : &#xCD5C;&#xADFC;&#xC5D0; &#xD560;&#xB2F9;&#xB418;&#xAC70;&#xB098; &#xD574;&#xC81C;&#xB41C; LFH &#xBE14;&#xB85D;&#xC758; &#xBE14;&#xB85D; &#xC778;&#xB371;&#xC2A4;. &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC744; &#xAC80;&#xC0C9;&#xD560; &#xB54C; &#xD560;&#xB2F9; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0; &#xC0AC;&#xC6A9;&#xB428;</li>
<li><code>Location</code> : Affiniy &#xC2AC;&#xB86F;&#xC758; LFH subsegment &#xBAA9;&#xB85D;&#xC5D0;&#xC11C; &#xC774; LFH subsegment &#xC704;&#xCE58;: 0 - AvailableSubsegmentList, 1 -  FullSubsegmentList</li>
<li><code>FreeCount</code> : LFH subsegment&#xC758; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xBE14;&#xB85D; &#xC218;</li>
<li><code>BlockCount</code> : LFH subsegment&#xC758; &#xCD1D; &#xBE14;&#xB85D; &#xC218;</li>
<li><code>BlockOffsets</code> : &#xC778;&#xCF54;&#xB529;&#xB41C; &#xAC01; LFH &#xBE14;&#xB85D;&#xC758; &#xD06C;&#xAE30;&#xC640; LFH subsegment&#xC5D0;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; LFH &#xBE14;&#xB85D;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294; DWORD &#xD06C;&#xAE30;&#xC758; &#xD558;&#xC704; &#xAD6C;&#xC870;&#xCCB4;</li>
<li><code>BlockSize</code> : LFH subsegment&#xC5D0; &#xC788;&#xB294; &#xAC01; LFH &#xBE14;&#xB85D;&#xC758; &#xD06C;&#xAE30;</li>
<li><code>FirstBlockOffset</code> : LFH subsegment&#xC5D0;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; LFH &#xBE14;&#xB85D;&#xC758; &#xC624;&#xD504;&#xC14B;</li>
<li><code>CommitStateOffset</code> : LFH subsegment&#xC5D0;&#xC11C; &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC; &#xBC30;&#xC5F4;&#xC758; &#xC624;&#xD504;&#xC14B;.<ul>
<li>LFH subsegment&#xB294; &#xC5EC;&#xB7EC; &#xCEE4;&#xBC0B;&#xC73C;&#xB85C; &#xB098;&#xB258;&#xB294;&#xB370;, &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xAC01; &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; WORD &#xD06C;&#xAE30; &#xAC12;&#xC758; &#xBC30;&#xC5F4;</li>
</ul>
</li>
<li><code>BlockBitmap</code> : &#xAC01; LFH &#xBE14;&#xB85D;&#xC740; &#xC774; &#xBE14;&#xB85D; &#xBE44;&#xD2B8;&#xB9F5;&#xC5D0;&#xC11C; 2&#xBE44;&#xD2B8;&#xB85C; &#xD45C;&#xC2DC;&#xB428;</li>
</ul>
<h1 id="Large-Blocks-Allocation"><a href="#Large-Blocks-Allocation" class="headerlink" title="Large Blocks Allocation"></a>Large Blocks Allocation</h1><p>large block &#xD560;&#xB2F9;&#xC740; &#xD06C;&#xAE30;&#xAC00; 520,193 bytes &#xC774;&#xC0C1;(&gt;= 0x7F001)&#xC778; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. large block&#xC740; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC5D0; &#xD5E4;&#xB354;&#xAC00; &#xC5C6;&#xC73C;&#xBA70; NT memory allocator&#xC758; &#xAC00;&#xC0C1; &#xBA54;&#xBAA8;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD560;&#xB2F9; &#xBC0F; &#xD574;&#xC81C;&#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="HEAP-LARGE-ALLOC-DATA"><a href="#HEAP-LARGE-ALLOC-DATA" class="headerlink" title="_HEAP_LARGE_ALLOC_DATA"></a>_HEAP_LARGE_ALLOC_DATA</h2><p>&#xAC01; large block&#xC5D0;&#xB294; &#xC544;&#xB798; &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xC73C;&#xBA70; &#xC774; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB294; &#xD2B9;&#xC774;&#xD558;&#xAC8C;&#xB3C4; &#xB2E4;&#xB978; &#xBE14;&#xB85D;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xC8FC;&#xC18C;&#xAC00; &#xC804;&#xC5ED; &#xBCC0;&#xC218; <code>RtlpHpMetadataHeap</code>&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD799;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LARGE_ALLOC_DATA
   +<span class="hljs-number">0x000</span> TreeNode         : _RTL_BALANCED_NODE
   +<span class="hljs-number">0x018</span> VirtualAddress   : Uint8B
   +<span class="hljs-number">0x018</span> UnusedBytes      : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits
   +<span class="hljs-number">0x020</span> ExtraPresent     : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit
   +<span class="hljs-number">0x020</span> GuardPageCount   : Pos <span class="hljs-number">1</span>, <span class="hljs-number">1</span> Bit
   +<span class="hljs-number">0x020</span> GuardPageAlignment : Pos <span class="hljs-number">2</span>, <span class="hljs-number">6</span> Bits
   +<span class="hljs-number">0x020</span> Spare            : Pos <span class="hljs-number">8</span>, <span class="hljs-number">4</span> Bits
   +<span class="hljs-number">0x020</span> AllocatedPages   : Pos <span class="hljs-number">12</span>, <span class="hljs-number">52</span> Bits</code></pre>
<ul>
<li><code>TreeNode</code> : &#xAC01; large block &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB294; <code>HeapBase.LargeAllocMetadata</code>&#xC758; &#xB178;&#xB4DC;</li>
<li><code>VirtualAddress</code> : &#xBE14;&#xB85D;&#xC758; &#xC8FC;&#xC18C;. &#xCC98;&#xC74C; 16&#xBE44;&#xD2B8;&#xB294; <code>UnusedBytes</code> &#xD544;&#xB4DC;&#xC5D0; &#xC0AC;&#xC6A9;&#xB428;</li>
<li><code>UnusedBytes</code> : <code>UserSize</code>&#xC640; &#xBE14;&#xB85D;&#xC758; &#xCEE4;&#xBC0B;&#xB41C; &#xD06C;&#xAE30; &#xAC04;&#xC758; &#xCC28;&#xC774;</li>
<li><code>AllocatedPages</code> : &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xBE14;&#xB85D;&#xC758; &#xCEE4;&#xBC0B;&#xB41C; &#xD06C;&#xAE30;</li>
</ul>
<p>&#xB4DC;&#xB514;&#xC5B4; Segment Heap &#xAD00;&#xB828; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C;&#xB098;&#xB9C8; &#xBAA8;&#xB450; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; Segment Heap&#xC744; &#xACF5;&#xBD80;&#xD560; &#xB54C; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC124;&#xBA85;&#xD55C; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xC54C;&#xC544;&#xC57C; &#xD558;&#xB294;&#xAC74; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;..&#x314E;&#x314E; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xC815;&#xB9AC;&#xD558;&#xACE0;, &#xD544;&#xB4DC;&#xB4E4;&#xC774; &#xD560;&#xB2F9;&#xACFC; &#xD560;&#xB2F9;&#xD574;&#xC81C;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xB4E4;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xCC3E;&#xB2E4;&#xBCF4;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xB418;&#xAE30;&#xC5D0; &#xC77C;&#xB2E8; &#xB0C5;&#xB2E4; &#xC815;&#xB9AC;&#xD574;&#xBC84;&#xB9AC;&#xB294;&#xAC70;&#xC8E0;. </p>
<h1 id="HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage"><a href="#HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage" class="headerlink" title="HITCON CTF 2020 - Archangel Michael&#x2019;s Storage"></a>HITCON CTF 2020 - <strong>Archangel Michael&#x2019;s Storage</strong></h1><p>&#xC774;&#xC81C;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xBCFC; &#xC2DC;&#xAC04;&#xC774;&#xAD70;&#xC694;! &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC758; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xC608;&#xC2DC;&#xB97C; HITCON CTF 2020&#xC5D0; &#xB098;&#xC628; Michael&#x2019;s Storage&#xB77C;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC804;&#xC5D0; NT Heap &#xBB38;&#xC81C;&#xB3C4; &#xADF8;&#xB807;&#xACE0;, &#xC774; &#xBB38;&#xC81C;&#xB3C4; angelboy&#xB77C;&#xB294; &#xBD84;&#xC774; &#xB9CC;&#xB4DC;&#xC2E0; &#xBB38;&#xC81C;&#xC778;&#xB370; &#xACF5;&#xBD80;&#xD558;&#xAE30; &#xC88B;&#xC740; &#xBB38;&#xC81C;&#xB4E4;&#xC778; &#xAC83; &#xAC19;&#xB124;&#xC694;. <a target="_blank" rel="external nofollow noopener noreferrer" href="https://github.com/scwuaptx/CTF">https://github.com/scwuaptx/CTF</a> &#xC5D0; windows exploit&#xC5D0; &#xAD00;&#xB828;&#xD55C; &#xB2E4;&#xB978; &#xBB38;&#xC81C;&#xB4E4;&#xB3C4; &#xC788;&#xC73C;&#xB2C8; &#xAD81;&#xAE08;&#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xD55C;&#xBC88;&#xCBE4; &#xBCF4;&#xC154;&#xB3C4; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC77C;&#xB2E8; &#xD658;&#xACBD;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740;&#xB370;&#xC694;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xC774; &#xBAA8;&#xB450; &#xAC78;&#xB824;&#xC788;&#xACE0; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Environment"><a href="#Environment" class="headerlink" title="Environment"></a>Environment</h2><ul>
<li>Windows x64 20H@</li>
<li>DEP</li>
<li>ASLR</li>
<li>CFG</li>
<li>Private Heap<ul>
<li>&#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xD480;</li>
</ul>
</li>
<li>Segment Heap</li>
</ul>
<pre><code class="hljs c">reg add <span class="hljs-string">&quot;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\MichaelStorage.exe&quot;</span> /v FrontEndHeapDebugOptions /t REG_DWORD /d <span class="hljs-number">0x8</span> /f
AppJailLauncher.exe ./MichaelStorage.exe /timeout:<span class="hljs-number">12000000</span> /key:flag.txt /port:<span class="hljs-number">56746</span></code></pre>
<p>&#xBB38;&#xC81C;&#xD30C;&#xC77C; &#xD658;&#xACBD;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xBC30;&#xCE58;&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB294;&#xB370;, <code>0x8</code>&#xB85C; bit 3&#xC758; Enable Segment Heap&#xC744; &#xC124;&#xC815;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC774; &#xC801;&#xC6A9;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xAC78; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="Analysis"><a href="#Analysis" class="headerlink" title="Analysis"></a>Analysis</h2><p>&#xC774;&#xC81C; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xB140;&#xC11D;&#xC778;&#xC9C0; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;! </p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%202.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xC885;&#xB8CC;&#xD558;&#xAE30;&#xB97C; &#xC81C;&#xC678;&#xD55C; &#xB124;&#xAC1C;&#xC758; &#xBA54;&#xB274;&#xAC00; &#xBCF4;&#xC774;&#xB124;&#xC694;. &#xBA54;&#xB274;&#xBCC4;&#xB85C; &#xAC01;&#xAC01; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA3C;&#xC800; 1&#xBC88; &#xBA54;&#xB274;&#xB294; &#xD0C0;&#xC785;&#xACFC; &#xC0AC;&#xC774;&#xC988;&#xB97C; &#xC785;&#xB825;&#xBC1B;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xCD5C;&#xB300; 16&#xAC1C;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">for</span> ( i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">16</span>; ++i )
  {
    <span class="hljs-keyword">if</span> ( !Storage[i].is_allocated )
    {
      sub_7FF6203D1060(<span class="hljs-string">&quot;Type of storage:&quot;</span>);
      storage_type = sub_7FF6203D1210();
      sub_7FF6203D1060(<span class="hljs-string">&quot;Size:&quot;</span>);
      size = sub_7FF6203D1210();
...</code></pre>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%203.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>16&#xAC1C;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; 48 bytes &#xD06C;&#xAE30;&#xC758; Stroage &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB294; 0&#xBD80;&#xD130; 3&#xAE4C;&#xC9C0; &#xB124; &#xAC00;&#xC9C0; &#xD0C0;&#xC785;&#xC774; &#xC788;&#xACE0;, &#xC785;&#xB825;&#xBC1B;&#xC740; &#xD0C0;&#xC785;&#xBCC4;&#xB85C; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xC5D0; &#xAC01; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">for</span> ( i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">16</span>; ++i ){
...
	<span class="hljs-keyword">if</span> ( storage_type == <span class="hljs-number">1</span> )
  {
      sub_7FF6203D1060(<span class="hljs-string">&quot;The size of secret is %u\n&quot;</span>, <span class="hljs-number">512</span>i64);
      Storage.heap_ptr = HeapAlloc_1400010C0(<span class="hljs-number">0x1010</span>, v1);
      <span class="hljs-keyword">if</span> ( !Storage.heap_ptr )
      {
        <span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;allocate error&quot;</span>);
        <span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);
      }
      Storage[i].heap_ptr-&gt;size = <span class="hljs-number">512</span>;
      chunk_size[i] = <span class="hljs-number">512</span>;
      Storage[i].is_allocated = <span class="hljs-number">1</span>;
      Storage[i].type = storage_type;
  }</code></pre>
<p>&#xD0C0;&#xC785; 1&#xC758; &#xACBD;&#xC6B0; &#xD799;&#xC5D0; <code>0x1010</code> &#xB9CC;&#xD07C; &#xD560;&#xB2F9;&#xC744; &#xD558;&#xB124;&#xC694;. &#xB098;&#xBA38;&#xC9C0; &#xD0C0;&#xC785;&#xB3C4; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD0C0;&#xC785; 0&#xC740; <code>size * 4 + 16</code>&#xB9CC;&#xD07C;, &#xD0C0;&#xC785; 2&#xB294; <code>size + 16</code>, &#xD0C0;&#xC785; 3&#xB294; <code>size</code>&#xB9CC;&#xD07C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC800;&#xC7A5;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;&#xB85C; &#xC720;&#xCD94;&#xD574;&#xBCF4;&#xBA74;, &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xD544;&#xB4DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-comment">// &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xCCB4;</span>
<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">Storage</span> {</span>
    <span class="hljs-keyword">int64_t</span> type; <span class="hljs-comment">//&#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xD0C0;&#xC785;</span>
    <span class="hljs-keyword">int64_t</span> is_allocated; <span class="hljs-comment">// &#xD560;&#xB2F9;&#xC5EC;&#xBD80;</span>
    LPVOID heap_ptr; <span class="hljs-comment">// &#xD560;&#xB2F9;&#xB41C; &#xD799; &#xD3EC;&#xC778;&#xD130;</span>
};</code></pre>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/%ED%99%94%EB%A9%B4_%EC%BA%A1%EC%B2%98_2021-11-21_123751.png" srcset="/img/loading.gif" alt="&#xD654;&#xBA74; &#xCEA1;&#xCC98; 2021-11-21 123751.png"></p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/111.png" srcset="/img/loading.gif" alt="111.png"></p>
<p>&#xCC28;&#xB840;&#xB300;&#xB85C; &#xD0C0;&#xC785;, &#xD560;&#xB2F9;&#xC5EC;&#xBD80;, &#xD560;&#xB2F9;&#xB41C; &#xD799; &#xC8FC;&#xC18C;&#xAE4C;&#xC9C0; &#xC800;&#xC7A5;&#xB418;&#xB294;&#xAC78; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; chunk_size &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xB294; &#xC778;&#xB371;&#xC2A4;&#xBCC4; &#xD560;&#xB2F9;&#xB41C; size&#xAC00; &#xC800;&#xC7A5;&#xC774; &#xB418;&#xB124;&#xC694;.</p>
<p>2&#xBC88; &#xBA54;&#xB274;&#xB294; &#xD560;&#xB2F9;&#xD55C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC5D0; &#xAC12;&#xC744; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; &#xD0C0;&#xC785;&#xBCC4;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xAC12; &#xC720;&#xD615;&#xC774; &#xB2E4;&#xB978;&#xB370;,  &#xBD84;&#xC11D;&#xD574; &#xAC01;&#xAC01;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC720;&#xCD94;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xB098;&#xD0C0;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">int_storage</span> {</span> <span class="hljs-comment">//type 0</span>
    <span class="hljs-keyword">size_t</span> size;
    int32 uintarray[<span class="hljs-number">1</span>];
};

<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">secret_storage</span> {</span> <span class="hljs-comment">//type 1</span>
    int32 size;
    uint64 uintarray[<span class="hljs-number">1</span>];
};
<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">binary_storage</span> {</span> <span class="hljs-comment">//type 2</span>
    <span class="hljs-keyword">size_t</span> size;
    <span class="hljs-keyword">char</span> content[<span class="hljs-number">1</span>];
};

<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">string_storage</span> {</span> <span class="hljs-comment">//type 3</span>
	<span class="hljs-keyword">size_t</span> size;
	<span class="hljs-keyword">char</span>* <span class="hljs-built_in">string</span>;
};</code></pre>
<p>3&#xBC88; &#xBA54;&#xB274;&#xC778; Get value from storage&#xC740; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC758; &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xB294;&#xB370;, 3&#xBC88; &#xD0C0;&#xC785;&#xC758; &#xBB38;&#xC790;&#xC5F4; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB9CC; &#xCD9C;&#xB825;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; 4&#xBC88; Destory storage&#xB294; &#xC785;&#xB825;&#xD55C; &#xC778;&#xB371;&#xC2A4;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC5D0; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xC0AD;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="Vulnerability"><a href="#Vulnerability" class="headerlink" title="Vulnerability"></a>Vulnerability</h2><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; 2&#xBC88; &#xBA54;&#xB274;&#xC758; &#xD0C0;&#xC785; 1 &#xAC12;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xACF3;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">__int64 input_value;

sub_7FF6203D1060(<span class="hljs-string">&quot;Index:&quot;</span>);
index = sub_7FF6203D1210();
<span class="hljs-keyword">if</span> ( index &gt;= <span class="hljs-number">512</span> )
{
	<span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;Out of bound&quot;</span>);
	<span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);
}
sub_7FF6203D1060(<span class="hljs-string">&quot;Value:&quot;</span>);
input_value = sub_7FF6203D1210();
*(Storage[storage_index].heap_ptr-&gt;uintarray[index+<span class="hljs-number">1</span>]) = input_value;</code></pre>
<p>index&#xAC00; &#xD560;&#xB2F9;&#xB41C; &#xD06C;&#xAE30;&#xC778; 512&#xBCF4;&#xB2E4; &#xD070;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xD06C;&#xBA74; &#xC885;&#xB8CC;&#xD558;&#xB294; OOB &#xAC80;&#xC0AC;&#xAC00; &#xC788;&#xB124;&#xC694;. &#xADF8;&#xB7F0;&#xB370; index&#xAC00; &#xC74C;&#xC218;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xD560;&#xB2F9;&#xB41C; &#xD799;&#xBCF4;&#xB2E4; &#xB0AE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC784;&#xC758;&#xC758; &#xC785;&#xB825;&#xAC12;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xC5B4; OOB Write &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%204.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC2E4;&#xC81C;&#xB85C; &#xD0C0;&#xC785; 1&#xB85C; &#xD560;&#xB2F9;&#xD55C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC758; -17 &#xC778;&#xB371;&#xC2A4;&#xC5D0; 0xDEADBEEF&#xC758; &#xC815;&#xC218;&#xAC12;&#xC778; 3735927559&#xB97C; &#xB123;&#xC73C;&#xBA74;?</p>
<p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%205.png" srcset="/img/loading.gif" alt="Untitled"></p>
<p>&#xC774;&#xB807;&#xAC8C;, &#xD560;&#xB2F9;&#xB41C; &#xD799;&#xC774; &#xC544;&#xB2CC; &#xACF5;&#xAC04;&#xC5D0; &#xC784;&#xC758;&#xC758; &#xAC12;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; OOB write &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC138;&#xADF8;&#xBA3C;&#xD14C;&#xC774;&#xC158;&#xC758; &#xD799; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9AD;&#xD558;&#xACE0; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf</a></p>
<p>[<a target="_blank" rel="external nofollow noopener noreferrer" href="https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207">https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/windows/">windows</a>
                  
                  <a class="hover-with-bg" href="/tags/research/">research</a>
                  
                  <a class="hover-with-bg" href="/tags/heap/">heap</a>
                  
                  <a class="hover-with-bg" href="/tags/ctf/">ctf</a>
                  
                  <a class="hover-with-bg" href="/tags/L0ch/">L0ch</a>
                  
                  <a class="hover-with-bg" href="/tags/hitcon/">hitcon</a>
                  
                  <a class="hover-with-bg" href="/tags/segment-heap/">segment heap</a>
                  
                  <a class="hover-with-bg" href="/tags/windows-10/">windows 10</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_L0ch.jpg" srcset="/img/loading.gif" alt="L0ch">
                  </div>

                  <div class="link-text">
                    <div class="link-title">L0ch</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/L0ch">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2021/11/23/y00n_nms/file-signature/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[] File Signature</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2021/11/20/in0hack/2021-11-20/">
                    <span class="hidden-mobile">[] Hacking JSON Web Tokens (JWTs)</span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/';
        this.page.identifier = '/2021/11/21/l0ch/segment-heap-part3/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research] Hip Heap  Part 3 - HITCON 2020 Michael's Storage&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
