

<!DOCTYPE html>
<html lang="ko-KR" data-default-color-scheme="&#34;auto&#34;">



<head>
  <meta charset="UTF-8">
  <link rel="apple-touch-icon" sizes="76x76" href="/img/favicon.ico">
  <link rel="icon" type="image/png" href="/img/favicon.ico">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Windows Minifilter Driver &amp;#xAE00;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xCC98;&amp;#xC74C; &amp;#xC778;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F917;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; Windows Kernel Driver&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; Bus Driver, Filter Driver, FSD, Minifilter&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; Function Driver&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; Bus Driver&amp;#xC774;&amp;#xB098; Filter Driver&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870; &amp;#xCC28;&amp;#xC774;&amp;#xC640;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; Minifilter Driver &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;, &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;1-About-Minifilter-Drivers&#34;&gt;&lt;a href=&#34;#1-About-Minifilter-Drivers&#34; class=&#34;headerlink&#34; title=&#34;1. About Minifilter Drivers&#34;&gt;&lt;/a&gt;1. About Minifilter Drivers&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;, &amp;#xC5F4;&amp;#xAE30;, &amp;#xC77D;&amp;#xAE30;, &amp;#xC4F0;&amp;#xAE30;, &amp;#xC0AD;&amp;#xC81C;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC758; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C;, &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC815;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xD30C;&amp;#xC77C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xAC10;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;, &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#x201D;&lt;/strong&gt;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; &amp;#xC7A0;&amp;#xC2DC;&amp;#xB9CC;&amp;#xC694;. &lt;strong&gt;Antivirus, EDR, &amp;#xBC31;&amp;#xC5C5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC8FC; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xC81C;&amp;#xD488;&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;? &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xC218;&amp;#xC758; &amp;#xD574;&amp;#xB2F9; &amp;#xC81C;&amp;#xD488;&amp;#xB4E4;&amp;#xC774; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xAC00; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Minifiler &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;IRP (I/O Request Packet)&lt;/li&gt;
&lt;li&gt;Fast I/O&lt;/li&gt;
&lt;li&gt;File System Filter Callbacks&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;1-1-Filter-Manager-&amp;#x2192;-Minifilter-&amp;#xD750;&amp;#xB984;&#34;&gt;&lt;a href=&#34;#1-1-Filter-Manager-&amp;#x2192;-Minifilter-&amp;#xD750;&amp;#xB984;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Filter Manager &amp;#x2192; Minifilter &amp;#xD750;&amp;#xB984;&#34;&gt;&lt;/a&gt;1.1 Filter Manager &amp;#x2192; Minifilter &amp;#xD750;&amp;#xB984;&lt;/h2&gt;&lt;p&gt;Minifilter&amp;#xB294; Windows&amp;#xC758; Filter Manager(&lt;code&gt;fltmgr.sys&lt;/code&gt;) &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Filter Manager&amp;#xB294; I/O Manager&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744;, &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; Altitude &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, Altitude&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB85C;&amp;#xB529; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image2.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &lt;code&gt;CreateFile&lt;/code&gt;, &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xAC19;&amp;#xC740; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; I/O &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;I/O Manager&amp;#xC774; &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; Filter Manager(&lt;code&gt;fltmgr.sys&lt;/code&gt;)&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Filter Manager&amp;#xB294; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, Altitude &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xAC01; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Minifilter&amp;#xC774; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; Filter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;(Storage Driver Stack)&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xC81C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; Minifilter &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; cmd&amp;#xCC3D;&amp;#xC758; fltmc &amp;#xBA85;&amp;#xB839;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Altitude &amp;#xAC12;&amp;#xC774; &amp;#xB192;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xC6B0;&amp;#xC120;&amp;#xC21C;&amp;#xC704;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC838; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;, &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC804; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xC0AC;&amp;#xD6C4; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC5F0;&amp;#xC0B0;(Pre-operation)&lt;/strong&gt;: Altitude&amp;#xAC00; &lt;strong&gt;&amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C; &amp;#x2192; &amp;#xB0AE;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&lt;/strong&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xC5F0;&amp;#xC0B0;(Post-operation)&lt;/strong&gt;: Altitude&amp;#xAC00; &lt;strong&gt;&amp;#xB0AE;&amp;#xC740; &amp;#xC21C;&amp;#xC11C; &amp;#x2192; &amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&lt;/strong&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC640; &amp;#xC704; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xCC98;&amp;#xB7FC; IRP&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xC2E0;, FilterManager&amp;#xAC00; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; Minifilter&amp;#xC5D0;&amp;#xAC8C; &amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC;&amp;#xB9D0;&amp;#xD574; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD754;&amp;#xD788; &amp;#xC54C;&amp;#xACE0;&amp;#xC788;&amp;#xB294; &lt;strong&gt;DispatchRoutine&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;1-2-Minifilter-Callback-Routine&#34;&gt;&lt;a href=&#34;#1-2-Minifilter-Callback-Routine&#34; class=&#34;headerlink&#34; title=&#34;1.2 Minifilter Callback Routine&#34;&gt;&lt;/a&gt;1.2 Minifilter Callback Routine&lt;/h2&gt;&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xB294; &amp;#xCF5C;&amp;#xBC31;(Callback)&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998; &amp;#xB355;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &lt;strong&gt;DispatchRoutine&lt;/strong&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IRP&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC8E0;? &amp;#xADF8; &amp;#xB300;&amp;#xC2E0;, Filter Manager&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#x201C;&amp;#xD6C5;(hook)&amp;#x201D;&amp;#xC744; &amp;#xAC78; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xB294; &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xCF5C;&amp;#xBC31;(&lt;code&gt;PreOperation Callback&lt;/code&gt;)&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xCF5C;&amp;#xBC31;(&lt;code&gt;PostOperation Callback&lt;/code&gt;)&lt;/strong&gt;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC10;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; I/O &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC791;&amp;#xC5C5; &amp;#xCF5C;&amp;#xBC31; (&lt;code&gt;PFLT_PRE_OPERATION_CALLBACK&lt;/code&gt;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PFLT_PRE_OPERATION_CALLBACK PfltPreOperationCallback;

&lt;span class=&#34;hljs-function&#34;&gt;FLT_PREOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PfltPreOperationCallback&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out] PFLT_CALLBACK_DATA Data,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]      PCFLT_RELATED_OBJECTS FltObjects,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]     PVOID *CompletionContext&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{...}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xC704; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;FLT_PREOP_COMPLETE&lt;/code&gt;, &lt;code&gt;FLT_PREOP_SUCCESS_WITH_CALLBACK&lt;/code&gt;, &lt;code&gt;FLT_PREOP_SUCCESS_NO_CALLBACK&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_pre_operation_callback&#34;&gt;&lt;strong&gt;PFLT_PRE_OPERATION_CALLBACK callback function (fltkernel.h)&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xC791;&amp;#xC5C5; &amp;#xCF5C;&amp;#xBC31; (&lt;code&gt;PFLT_POST_OPERATION_CALLBACK&lt;/code&gt;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PFLT_POST_OPERATION_CALLBACK PfltPostOperationCallback;

&lt;span class=&#34;hljs-function&#34;&gt;FLT_POSTOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PfltPostOperationCallback&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out]      PFLT_CALLBACK_DATA Data,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           PCFLT_RELATED_OBJECTS FltObjects,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] PVOID CompletionContext,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           FLT_POST_OPERATION_FLAGS Flags&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{...}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD558;&amp;#xC704; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xB9C8;&amp;#xCE58;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAE38;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xC5C5;&amp;#xC758; &amp;#xC131;&amp;#xACF5; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB85C;&amp;#xAE45;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC791;&amp;#xC5C5; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xD6C4;&amp;#xCC98;&amp;#xB9AC; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_post_operation_callback&#34;&gt;&lt;strong&gt;PFLT_POST_OPERATION_CALLBACK callback function (fltkernel.h)&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774; &amp;#xCF5C;&amp;#xBC31;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;FLT_OPERATION_REGISTRATION&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#x201C;&amp;#xC5B4;&amp;#xB5A4; I/O &amp;#xC791;&amp;#xC5C5;(MajorFunction)&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC0AC;&amp;#xC804;/&amp;#xC0AC;&amp;#xD6C4; &amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560;&amp;#xC9C0;&amp;#x201D;&amp;#xB97C; &amp;#xBA85;&amp;#xC2DC;&amp;#xD574; &amp;#xB4F1;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;1-3-Minifilter&amp;#xC640;-User-Mode-&amp;#xAC04;&amp;#xC758;-&amp;#xD1B5;&amp;#xC2E0;&#34;&gt;&lt;a href=&#34;#1-3-Minifilter&amp;#xC640;-User-Mode-&amp;#xAC04;&amp;#xC758;-&amp;#xD1B5;&amp;#xC2E0;&#34; class=&#34;headerlink&#34; title=&#34;1.3 Minifilter&amp;#xC640; User-Mode &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&#34;&gt;&lt;/a&gt;1.3 Minifilter&amp;#xC640; User-Mode &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&lt;/h2&gt;&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;strong&gt;&amp;#xD544;&amp;#xD130; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB780;, Minifilter&amp;#xC640; &amp;#xC571; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC804;&amp;#xC6A9; &amp;#xACE0;&amp;#xC18D; &amp;#xD1B5;&amp;#xC2E0; &amp;#xCC44;&amp;#xB110;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; Kernel Mode &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; User-Mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04;&amp;#xC758; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC804;&amp;#xB2EC;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; Microsoft&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; API&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Driver-Code&#34;&gt;&lt;a href=&#34;#Driver-Code&#34; class=&#34;headerlink&#34; title=&#34;Driver Code&#34;&gt;&lt;/a&gt;Driver Code&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;fltKernel.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

PFLT_FILTER gFilter = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
PFLT_PORT gServerPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, gClientPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

&lt;span class=&#34;hljs-function&#34;&gt;VOID &lt;span class=&#34;hljs-title&#34;&gt;OnDisconnect&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PVOID Cookie)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(Cookie);
    FltCloseClientPort(gFilter, &amp;amp;gClientPort);
    gClientPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;OnConnect&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PFLT_PORT ClientPort, PVOID SrvCookie, PVOID Ctx, ULONG Size, PVOID* ConnCookie)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(SrvCookie);
    UNREFERENCED_PARAMETER(Ctx);
    UNREFERENCED_PARAMETER(Size);
    UNREFERENCED_PARAMETER(ConnCookie);
    gClientPort = ClientPort;
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; STATUS_SUCCESS;
}

&lt;span class=&#34;hljs-function&#34;&gt;FLT_PREOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PreCreate&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PFLT_CALLBACK_DATA Data, PCFLT_RELATED_OBJECTS FltObjects, PVOID* Buff)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(FltObjects);
    UNREFERENCED_PARAMETER(Buff);
    PFLT_FILE_NAME_INFORMATION nameInfo;

    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (gClientPort &amp;amp;&amp;amp; NT_SUCCESS(FltGetFileNameInformation(Data, FLT_FILE_NAME_NORMALIZED, &amp;amp;nameInfo))) {
        FltSendMessage(gFilter, &amp;amp;gClientPort, nameInfo-&amp;gt;Name.Buffer, nameInfo-&amp;gt;Name.Length, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
        FltReleaseFileNameInformation(nameInfo);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FLT_PREOP_SUCCESS_NO_CALLBACK;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;Unload&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(FLT_FILTER_UNLOAD_FLAGS Flags)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(Flags);
    FltCloseCommunicationPort(gServerPort);
    FltUnregisterFilter(gFilter);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; STATUS_SUCCESS;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;DriverEntry&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PDRIVER_OBJECT DriverObject, PUNICODE_STRING RegistryPath)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(RegistryPath);
    NTSTATUS status;

    &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; FLT_OPERATION_REGISTRATION Cbs[] = { { IRP_MJ_CREATE, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, PreCreate, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt; }, { IRP_MJ_OPERATION_END } };
    &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; FLT_REGISTRATION Reg = { &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(FLT_REGISTRATION), FLT_REGISTRATION_VERSION, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, Cbs, Unload };

    status = FltRegisterFilter(DriverObject, &amp;amp;Reg, &amp;amp;gFilter);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!NT_SUCCESS(status)) &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; status;

    UNICODE_STRING portName = RTL_CONSTANT_STRING(&lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\FileActivityMonitorPort&amp;quot;&lt;/span&gt;);
    OBJECT_ATTRIBUTES oa = { &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(oa), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;portName, OBJ_KERNEL_HANDLE | OBJ_CASE_INSENSITIVE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt; };

    status = FltCreateCommunicationPort(gFilter, &amp;amp;gServerPort, &amp;amp;oa, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, OnConnect, OnDisconnect, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!NT_SUCCESS(status)) {
        FltUnregisterFilter(gFilter);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; status;
    }

    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FltStartFiltering(gFilter);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; Driver Code API&amp;#xC778; &lt;code&gt;FltCreateCommunicationPort()&lt;/code&gt;, &lt;code&gt;FltSendMessage()&lt;/code&gt;, &lt;code&gt;FltCloseCommunicationPort()&lt;/code&gt;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC608;&amp;#xC81C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &lt;code&gt;FltRegisterFilter()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xC5F4;&amp;#xAE30;(&lt;code&gt;IRP_MJ_CREATE&lt;/code&gt;) &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC10;&amp;#xC2DC;&amp;#xD560; PreCreateCallback &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;FltStartFiltering()&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; I/O &amp;#xAC10;&amp;#xC2DC;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FltCreateCommunicationPort()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC704;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC54C;&amp;#xB9BC;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8; &lt;code&gt;\\FileActivityMonitorPort&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;/&amp;#xC5F4;&amp;#xAE30; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; PreCreateCallback&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;FltSendMessage()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; PreCreateCall&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; &amp;#xD30C;&amp;#xC77C; &amp;#xC811;&amp;#xADFC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC989;&amp;#xC2DC; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; FilterUnload &amp;#xC5B8;&amp;#xB85C;&amp;#xB4DC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB420; &amp;#xB54C;, &amp;#xC5F4;&amp;#xC5C8;&amp;#xB358; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &lt;code&gt;FltCloseCommunicationPort()&lt;/code&gt;&amp;#xB85C; &amp;#xB2EB;&amp;#xACE0; &amp;#xD544;&amp;#xD130; &amp;#xB4F1;&amp;#xB85D;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;User-Mode-Application-Code&#34;&gt;&lt;a href=&#34;#User-Mode-Application-Code&#34; class=&#34;headerlink&#34; title=&#34;User-Mode Application Code&#34;&gt;&lt;/a&gt;User-Mode Application Code&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;fltuser.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;pragma&lt;/span&gt; comment(lib, &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;fltlib.lib&amp;quot;&lt;/span&gt;)&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    HANDLE port;
    HRESULT hr;
    
    BYTE buffer[&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(FILTER_MESSAGE_HEADER) + &lt;span class=&#34;hljs-number&#34;&gt;1024&lt;/span&gt;];
    PFILTER_MESSAGE_HEADER header = (PFILTER_MESSAGE_HEADER)buffer;

    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connecting to driver...\n&amp;quot;&lt;/span&gt;);

    hr = FilterConnectCommunicationPort(&lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\FileActivityMonitorPort&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;port);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IS_ERROR(hr)) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connection failed. Error 0x%X\n&amp;quot;&lt;/span&gt;, hr);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }

    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connected. Waiting for file events...\n&amp;quot;&lt;/span&gt;);

    &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; (TRUE) {
        hr = FilterGetMessage(port, header, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(buffer), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
        
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (SUCCEEDED(hr)) {
            &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;File Accessed: %S\n&amp;quot;&lt;/span&gt;, (PWSTR)header-&amp;gt;MessageBody);
        } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
            &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connection lost. Error 0x%X\n&amp;quot;&lt;/span&gt;, hr);
            &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;
        }
    }

    CloseHandle(port);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; API&amp;#xB85C; &lt;code&gt;FilterConnectCommunicationPort()&lt;/code&gt;, &lt;code&gt;FilterSendMessage()&lt;/code&gt;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;FilterConnectCommunicationPort()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xC778; &lt;code&gt;\\FileActivityMonitorPort&lt;/code&gt;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; HANDLE&amp;#xC744; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xD6C4; &lt;code&gt;FilterGetMessage()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC2E0;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;2-CVE-2024-30085-1-Day-Analysis&#34;&gt;&lt;a href=&#34;#2-CVE-2024-30085-1-Day-Analysis&#34; class=&#34;headerlink&#34; title=&#34;2. [CVE-2024-30085] 1-Day Analysis&#34;&gt;&lt;/a&gt;2. [CVE-2024-30085] 1-Day Analysis&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; Windows Minifilter Driver &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;(&lt;a href=&#34;https://hackyboiz.github.io/2025/01/11/OUYA77/2025-01-11/&#34;&gt;reference&lt;/a&gt;). CVE-2024-30085&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1FA9F; Environment : Windows 11 22h2/23h2 10.0.2261.3672&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows Cloud Files Mini Filter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; Windows &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xC758; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xCC0D;&amp;#xC5B4;&amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBA3C;&amp;#xC800; Stub File, Reparse Point&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0AC;&amp;#xC804; &amp;#xACF5;&amp;#xBD80;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Stub-File&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#Stub-File&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;Stub File&amp;#xC774;&amp;#xB780;?&#34;&gt;&lt;/a&gt;Stub File&amp;#xC774;&amp;#xB780;?&lt;/h3&gt;&lt;p&gt;Stub File&amp;#xC740; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5C6;&amp;#xACE0;, placeholder &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#x2018;&amp;#xC0AC;&amp;#xC9C4;&amp;#x2019; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xAD6C;&amp;#xB984; &amp;#xC544;&amp;#xC774;&amp;#xCF58;&amp;#xC774; status&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC788;&amp;#xC8E0;? &amp;#xBC14;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; stub &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. NTFS &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;, &amp;#xC774;&amp;#xB984;, &amp;#xC544;&amp;#xC774;&amp;#xCF58; &amp;#xB4F1;&amp;#xC740; &amp;#xD45C;&amp;#xC2DC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xC804;&amp;#xD600; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Reparse-Point-Metadata&#34;&gt;&lt;a href=&#34;#Reparse-Point-Metadata&#34; class=&#34;headerlink&#34; title=&#34;Reparse Point Metadata&#34;&gt;&lt;/a&gt;Reparse Point Metadata&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;!? NTFS&amp;#xB294; Reparse Tag&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &lt;strong&gt;&amp;#x201C;&amp;#xC624;&amp;#xD638;&amp;#x2026; &amp;#xC774;&amp;#xAC74; stub file&amp;#xC774;&amp;#xB124;!&amp;#x201D;&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Windows Cloud Files Minifilter(&lt;code&gt;cldflt.sys&lt;/code&gt;)&amp;#xAC00; &amp;#xC774; &lt;code&gt;Reparse Point&lt;/code&gt; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0;, &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; Minifilter&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &lt;code&gt;cldflt.sys&lt;/code&gt;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. User-Mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC81C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xC784;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC558;&amp;#xB358; Minifilter&amp;#xC774; I/O Interpreter &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC740; User-Mode &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xC8E0;? (&amp;#xC624;.. &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xB124;&amp;#xC694;.)&lt;/p&gt;
&lt;p&gt;Windows Cloud Files Minifilter&amp;#xC758; Reparse Point &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; Local Types&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC81C;&amp;#xAC00; &amp;#xC815;&amp;#xC758;&amp;#xD55C; CldFlt &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC138;&amp;#xD2B8;&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; _&lt;span class=&#34;hljs-title&#34;&gt;REPARSE_DATA_BUFFER&lt;/span&gt; {&lt;/span&gt;
    DWORD ReparseTag;
    WORD ReparseDataLength;
    WORD Reserved;
    WORD Flags;
    WORD UncompressedSize;
    REPARSE_CLD_BUFFER ReparseCldBuffer;
} REPARSE_DATA_BUFFER, *PREPARSE_DATA_BUFFER;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;REPARSE_DATA_BUFFER&lt;/code&gt;&amp;#xB294; NTFS&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Reparse Point &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xD45C;&amp;#xC900; &amp;#xD5E4;&amp;#xB354; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; Cloud Files&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC7AC;&amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; &lt;code&gt;ReparseTag&lt;/code&gt;&amp;#xB85C; &amp;#xC18C;&amp;#xC720; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &lt;code&gt;ReparseDataLength&lt;/code&gt;, &lt;code&gt;Flags&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBA54;&amp;#xD0C0;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &lt;code&gt;HSM_REPARSE&lt;/code&gt;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_REPARSE&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;
    USHORT hsmFlags;
    USHORT hsmSize;
    &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_DATA&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;fileData&lt;/span&gt;;&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;HSM_REPARSE&lt;/code&gt;&amp;#xB294; Cloud Files &amp;#xC804;&amp;#xC6A9; Reparse Point &amp;#xC804;&amp;#xCCB4; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;hsmFlags&lt;/code&gt;&amp;#xC640; &lt;code&gt;hsmSize&lt;/code&gt;&amp;#xB85C; &amp;#xC555;&amp;#xCD95; &amp;#xC5EC;&amp;#xBD80;&amp;#xC640; HSM &amp;#xBE14;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xACE0;, &lt;code&gt;fileData&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &lt;code&gt;HSM_RP_DATA&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_DATA&lt;/span&gt; &lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;       
    ULONG magic;
    ULONG crc32;
    ULONG totalSize;
    USHORT dataFlags;
    USHORT elemCount;
    &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_ELEMENT&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;elements&lt;/span&gt;[5];&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;HSM_RP_DATA&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; &amp;#xBA54;&amp;#xC778; &amp;#xD5E4;&amp;#xB354;&amp;#xB85C;, &amp;#xC804;&amp;#xCCB4; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. magic&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC885;&amp;#xB958;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0;, crc32&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;dataFlags&lt;/code&gt;&amp;#xC5D0; CRC &amp;#xC874;&amp;#xC7AC; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xBA74; &lt;code&gt;RtlComputeCrc32&lt;/code&gt;&amp;#xB85C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. elements[] &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;HSM_RP_ELEMENT&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xAC01; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xC720;&amp;#xD615;, &amp;#xD06C;&amp;#xAE30;, &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_ELEMENT&lt;/span&gt; &lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;               
    USHORT elemType;
    USHORT elemSize;
    ULONG elemOffset;
};

&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;enum&lt;/span&gt; HSM_RP_ELEM_TYPE {
    HSM_RP_ELEMENT_NONE   = &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt;,
    HSM_RP_ELEMENT_U64    = &lt;span class=&#34;hljs-number&#34;&gt;0x06&lt;/span&gt;,
    HSM_RP_ELEMENT_BYTE   = &lt;span class=&#34;hljs-number&#34;&gt;0x07&lt;/span&gt;,
    HSM_RP_ELEMENT_U32    = &lt;span class=&#34;hljs-number&#34;&gt;0x0a&lt;/span&gt;,
    HSM_RP_ELEMENT_BITMAP = &lt;span class=&#34;hljs-number&#34;&gt;0x11&lt;/span&gt;,
    HSM_RP_ELEMENT_MAX    = &lt;span class=&#34;hljs-number&#34;&gt;0x12&lt;/span&gt;
} HSM_RP_ELEMENT_TYPE;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;HSM_RP_ELEMENT&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC1C;&amp;#xBCC4; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xC18C;&amp;#xC758; type, size, offset&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;HSM_RP_ELEMENT_TYPE&lt;/code&gt; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xB294; &amp;#xC591;&amp;#xC0C1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-1-Root-Cause-Analysis&#34;&gt;&lt;a href=&#34;#2-1-Root-Cause-Analysis&#34; class=&#34;headerlink&#34; title=&#34;2.1 Root Cause Analysis&#34;&gt;&lt;/a&gt;2.1 Root Cause Analysis&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &lt;code&gt;HsmFltPostCREATE&lt;/code&gt; &amp;#xCF5C;&amp;#xBC31;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; Reparse Point&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;,  &lt;code&gt;HsmFltPostCREATE&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; Reparse Point&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; bitmap &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;bitmap_size&lt;/code&gt;&amp;#xB294; User-Mode &amp;#xC694;&amp;#xCCAD; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD06C;&amp;#xAE30; 0x1000&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xC815; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &lt;code&gt;ExAllocatePoolWithTag&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &lt;code&gt;bitmap_size&lt;/code&gt;&amp;#xB97C; &amp;#xACBD;&amp;#xACC4; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9CC;&amp;#xC57D; &lt;code&gt;bitmap_size&lt;/code&gt; &amp;gt; 0x1000&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;, Heap-based Buffer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;HsmpBitmapIsReparseBufferSupported()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;hdr-&amp;gt;elements[4].elemSize&lt;/code&gt; &amp;#xAC12;&amp;#xC774; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xBA74; &amp;#xC624;&amp;#xB958;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC704;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBB38; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;hdr-&amp;gt;elements[2]&lt;/code&gt;&amp;#xB97C; &amp;#xC5C4;&amp;#xACA9;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;total &amp;#x2265; 0x18&lt;/code&gt;, &lt;code&gt;hdr&amp;#x2192;elemCount&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xACBD;&amp;#xACC4; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xD1B5;&amp;#xACFC;&amp;#xD574;&amp;#xC57C; &amp;#xC9C4;&amp;#xD589;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xAD70;&amp;#xC694;.. &amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; fail&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xB3D9;&amp;#xC77C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &lt;code&gt;hasBuf&lt;/code&gt;&amp;#xAC00; false&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;, &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xAE38;&amp;#xC774; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &lt;code&gt;element[1]&lt;/code&gt;&amp;#xC758; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xB3C4; result = 0&amp;#xC73C;&amp;#xB85C; success&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xAC00; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-2-Exploit&#34;&gt;&lt;a href=&#34;#2-2-Exploit&#34; class=&#34;headerlink&#34; title=&#34;2.2 Exploit&#34;&gt;&lt;/a&gt;2.2 Exploit&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;cldflt.sys &amp;#xBBF8;&amp;#xB2C8;&amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; I/O&amp;#xB97C; &amp;#xD6D1;&amp;#xB294;&amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, CfAPI&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Sync Root &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;CfRegisterSyncRoot()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xD3F4;&amp;#xB354;&amp;#xC758; Root &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Sync Root&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC6B0;&amp;#xC120; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; Stub File, &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xAC78; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;-&amp;gt; HsmFltPostCREATE()
-&amp;gt; HsmiFltPostECPCREATE()
-&amp;gt; HsmpSetupContexts()
-&amp;gt; HsmpCtxCreateStreamContext()
-&amp;gt; HsmIBitmapNORMALOpen()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBB38;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCDA9;&amp;#xC871;&amp;#xD574;&amp;#xC57C; &amp;#xC9C4;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCDA9;&amp;#xC871;&amp;#xD574;&amp;#xC11C; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Minifilter Driver&amp;#xB85C;&amp;#xC11C;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xC774;&amp;#xD574;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC744; &amp;#xB54C; IRP &amp;#xCF54;&amp;#xB4DC;&amp;#xBCC4;&amp;#xB85C; Callback&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC8E0;? &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;IRP_MJ_CREATE&lt;/code&gt;&amp;#xC758; &lt;code&gt;Post-Create Callback&lt;/code&gt;(&lt;code&gt;HsmFltPostCREATE&lt;/code&gt;)&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC911;&amp;#xAC04; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;/&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC18D;&amp;#xC131;&amp;#xACFC; Reparse Point &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;MakeDataBuffer()&lt;/code&gt;&amp;#xB85C; &lt;code&gt;IO_REPARSE_TAG_CLOUD&lt;/code&gt; &amp;#xAD6C;&amp;#xC870; &amp;#xC0DD;&amp;#xC131; &amp;#x2192; Minifilter&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; Cloud Stub File&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD574; Reparse Point &amp;#xD30C;&amp;#xC2F1; &amp;#xB85C;&amp;#xC9C1; &amp;#xC9C4;&amp;#xC785;.&lt;/li&gt;
&lt;li&gt;Item Tag = &lt;code&gt;0x11&lt;/code&gt;(Bitmap) &amp;#x2192; &lt;code&gt;Size&lt;/code&gt;&amp;#xB97C; &lt;code&gt;0x1000 + overSize&lt;/code&gt;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &lt;code&gt;memmove()&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD560;&amp;#xB2F9; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xCD08;&amp;#xACFC;&amp;#xD55C; &amp;#xBCF5;&amp;#xC0AC;(Heap Overflow) &amp;#xC720;&amp;#xBC1C;. &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xC18C;&amp;#xB4E4;(Tag &lt;code&gt;0x7&lt;/code&gt;, &lt;code&gt;0x6&lt;/code&gt;, &lt;code&gt;0xA&lt;/code&gt; &amp;#xB4F1;)&amp;#xB3C4; Minifilter&amp;#xC758; &amp;#xACBD;&amp;#xACC4; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAC12; &amp;#xC124;&amp;#xC815;.&lt;/li&gt;
&lt;li&gt;Overflow &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; Fake &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xD3EC;&amp;#xD568; &amp;#x2192; &lt;code&gt;FSCTL_SET_REPARSE_POINT&lt;/code&gt;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9; &amp;#xD6C4; &lt;code&gt;CreateFile()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xBA74; FltMgr&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Exploit &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC804;&amp;#xBD80; &amp;#xB2F4;&amp;#xACE0;&amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC624;&amp;#xB298;&amp;#xC740; Minifilter &amp;#xC124;&amp;#xBA85; &amp;#xAE00;&amp;#xC774;&amp;#xACE0; &amp;#xBC8C;&amp;#xC368; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xBC84;&amp;#xB9B0; &amp;#xAC83; &amp;#xAC19;&amp;#xC73C;&amp;#xB2C8;.. &amp;#xC804;&amp;#xCCB4; exploit &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Proof of Concept Overview&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;EPROCESS &amp;#xAD6C;&amp;#xC870; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; Token &amp;#xD544;&amp;#xB4DC; Offset &amp;#xACC4;&amp;#xC0B0;&lt;/strong&gt;&lt;br&gt;EPROCESS &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; Token &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574; &amp;#xC774;&amp;#xD6C4; SYSTEM Token swap &amp;#xC900;&amp;#xBE44;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; Spray &amp;#xBC0F; Hole &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;br&gt;0x1000 &amp;#xD06C;&amp;#xAE30;(0xff0 &amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xC758; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB300;&amp;#xB7C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;(spray)&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xD799;&amp;#xC5D0; Heap Hole &amp;#xC0DD;&amp;#xC131;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xD508; &amp;#xBC0F; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; Overflow &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&lt;/strong&gt;&lt;br&gt;&lt;code&gt;CfRegisterSyncRoot()&lt;/code&gt;&amp;#xC640; Reparse Point &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Sync Root &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC900;&amp;#xBE44;. &amp;#xC774;&amp;#xD6C4; &lt;code&gt;CreateFile()&lt;/code&gt;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; &lt;code&gt;IRP_MJ_CREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmFltPostCREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmiFltPostECPCREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmpSetupContexts()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmpCtxCreateStreamContext()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xACE0;, Heap Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC778;&amp;#xC811;&amp;#xD55C; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xC758; DataSize&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD574; OOB R/W&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; Leak&lt;/strong&gt;&lt;br&gt;&amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;_KALPC_RESERVE&lt;/code&gt; **&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; Leak.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; Spray &amp;#xBC0F; Hole &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;br&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xB3D9;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xB97C; Spray&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xC81C;&amp;#xD574; Hole&amp;#xC744; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC778;&amp;#xC811;&amp;#xD55C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; WNF &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC30;&amp;#xCE58;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD6C;&amp;#xC131;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;&lt;br&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; Heap Overflow&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0;, &amp;#xC778;&amp;#xC811;&amp;#xD55C; &lt;code&gt;PipeAttribute&lt;/code&gt;&amp;#xC758; &lt;code&gt;Flink&lt;/code&gt; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACF5;&amp;#xAC04; Fake &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB36E;&amp;#xC74C;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Arbitrary Read &amp;#xAD6C;&amp;#xC131; &amp;#xBC0F; EPROCESS/Token &amp;#xC8FC;&amp;#xC18C; &amp;#xD68D;&amp;#xB4DD;&lt;/strong&gt;&lt;br&gt;Fake &lt;code&gt;PipeAttribute&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; ALPC Port &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; Token &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; read.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Token Swapping &amp;#xBC0F; SYSTEM &amp;#xAD8C;&amp;#xD55C; &amp;#xD68D;&amp;#xB4DD;&lt;/strong&gt;&lt;br&gt;Arbitrary Write&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; Token &amp;#xAC12;&amp;#xC744; SYSTEM Token &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAD50;&amp;#xCCB4;&amp;#xD558;&amp;#xACE0;, SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;cmd.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;ALPC-WNF&#34;&gt;&lt;a href=&#34;#ALPC-WNF&#34; class=&#34;headerlink&#34; title=&#34;ALPC/WNF&#34;&gt;&lt;/a&gt;ALPC/WNF&lt;/h3&gt;&lt;p&gt;&lt;code&gt;_WNF_STATE_DATA&lt;/code&gt;&amp;#xC640; &lt;code&gt;_ALPC_HANDLE_TABLE&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Heap Hole&amp;#xC744; &amp;#xC704;&amp;#xD55C; Arbitrary size &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0;, &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; leak&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xB9C8;&amp;#xB3C4; ALPC&amp;#xC640; WNF &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. exploit&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB450; sub system&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;ALPC (Asynchronous Local Procedure Call)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image13.webp&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ALPC&amp;#xB294; Windows &amp;#xCEE4;&amp;#xB110; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; IPC &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC73C;&amp;#xB85C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; ALPC&amp;#xC758; HANDLE TABLE&amp;#xC758; &lt;code&gt;_ALPC_HANDLE_ENTRY&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBC84;&amp;#xD37C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; TABLE&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC00;&amp;#xBCC0;&amp;#xC801;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Arbitrary &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ALPC &amp;#xD3EC;&amp;#xD2B8; &amp;#xC0DD;&amp;#xC131; &amp;#xC2DC; &lt;code&gt;_ALPC_HANDLE_TABLE&lt;/code&gt;&amp;#xC774; &lt;strong&gt;paged pool&lt;/strong&gt;&amp;#xC5D0; 0x80 &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NtAlpcCreateResourceReserve&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;_KALPC_RESERVE&lt;/code&gt; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; HANDLE TABLE&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xBA74; &amp;#xC784;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; Read/Write primitive &amp;#xAC00;&amp;#xB2A5;&lt;/p&gt;
&lt;p&gt;  &amp;#x2192; PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; fake &lt;code&gt;_KALPC_RESERVE&lt;/code&gt;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD574; arbitrary R/W &amp;#xB2EC;&amp;#xC131;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;ALPC HANDLE&amp;#xC740; User-Mode&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5; &amp;#x2192; exploit&amp;#xC5D0; &amp;#xC6A9;&amp;#xC774;&amp;#xD574;&amp;#xC9D0;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;WNF (Windows Notification Facility)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image14.webp&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;WNF&amp;#xB294; Windows&amp;#xC758; &amp;#xC54C;&amp;#xB9BC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC778;&amp;#xB370;&amp;#xC694;. WNF_NAME_INSTANCE &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; _WNF_STATE_DATA&amp;#xB77C;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC00;&amp;#xBCC0;&amp;#xC801;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; User-Mode&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtCreateWnfStateName&lt;/code&gt; + &lt;code&gt;NtUpdateWnfStateData&lt;/code&gt;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD06C;&amp;#xAE30; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;_WNF_STATE_DATA&lt;/code&gt;&amp;#xB294; 0x1000 &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9; &amp;#xAC00;&amp;#xB2A5; (0x10 header + 0xFF0 data)&lt;/li&gt;
&lt;li&gt;heap spraying &amp;#xC6A9;&amp;#xB3C4;&amp;#xB85C; WNF &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB2E4;&amp;#xB7C9; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;, &amp;#xBAA9;&amp;#xD45C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;(ALPC &amp;#xAC1D;&amp;#xCCB4;)&amp;#xC640; &amp;#xC778;&amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xBC30;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WNF&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; heap hole&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; ALPC &amp;#xAC1D;&amp;#xCCB4; &amp;#xC778;&amp;#xC811;&amp;#xC5D0; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; ALPC HANDLE TABLE&amp;#xC5D0; Overflow &amp;#xC720;&amp;#xB3C4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC800;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;PipeAttribute&lt;/span&gt; {&lt;/span&gt; 
    LIST_ENTRY &lt;span class=&#34;hljs-built_in&#34;&gt;list&lt;/span&gt;; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; * AttributeName; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; AttributeValueSize; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; * AttributeValue; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; data[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;];
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Pipe&amp;#xB294; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; Value &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC138;&amp;#xD305;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD574; &amp;#xC77D;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; User-Mode &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xBC18;&amp;#xD658;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB85C;&amp;#xC368; ALPC&amp;#xB85C; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3;&amp;#xACFC; WNF Overflow &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Pipe&amp;#xB97C; Arbitrary Read primitive&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; leak&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;3-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#3-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;3. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;3. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image15.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &lt;code&gt;cldflt.sys&lt;/code&gt;&amp;#xC758; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xD2B9;&amp;#xC131;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; WNF + ALPC &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; LPE &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xBA70; &amp;#xB05D;&amp;#xB0B4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740;.. &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB098; &amp;#xD568;&amp;#xC218;, &amp;#xAC1C;&amp;#xB150; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC870;&amp;#xAE08; &amp;#xC0DD;&amp;#xC18C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xACB0;&amp;#xAD6D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB098; &amp;#xB8E8;&amp;#xD2B8; &amp;#xCEE4;&amp;#xC988; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8; Minifilter &amp;#xC9C4;&amp;#xC785;&amp;#xC5D0; &amp;#xB108;&amp;#xBB34; &amp;#xAC81; &amp;#xBA39;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xC154;&amp;#xB3C4; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xC9C1; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694;.. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB300; &amp;#xBD80;&amp;#xD0C1;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;&lt;strong&gt;Reference&lt;/strong&gt;&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&lt;a href=&#34;https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/&#34;&gt;https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts&#34;&gt;https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/&#34;&gt;https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/&#34;&gt;https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;amp;utm_campaign=post&amp;amp;utm_medium=web&amp;amp;triedRedirect=true&#34;&gt;https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;amp;utm_campaign=post&amp;amp;utm_medium=web&amp;amp;triedRedirect=true&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6&#34;&gt;https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta name="author" content="j0dev, y2sman">
  <meta name="keywords" content>
  <meta name="google-site-verification" content="DXkyiaX95-ws53Tyt0m91_umRf4gfV2qJIQZ5zQDIO4">
  <meta name="naver-site-verification" content="0b4fea742ed293b82621684e466d9f26c3ccee06">


  <meta property="og:type" content="website"> 
  <meta property="og:title" content="[Research]  Windows Minifilter Driver (KR) - hackyboiz">
  <meta property="og:description" content="&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, banda&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. Windows Minifilter Driver &amp;#xAE00;&amp;#xACFC; &amp;#xD568;&amp;#xAED8; &amp;#xCC98;&amp;#xC74C; &amp;#xC778;&amp;#xC0AC;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;. &amp;#x1F917;&lt;/p&gt;
&lt;p&gt;&amp;#xCD5C;&amp;#xADFC; Windows Kernel Driver&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB2E4;&amp;#xAC00; Bus Driver, Filter Driver, FSD, Minifilter&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xBAA9;&amp;#xC801;&amp;#xC5D0; &amp;#xB530;&amp;#xB978; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xC885;&amp;#xB958;&amp;#xAC00; &amp;#xC788;&amp;#xB2E4;&amp;#xB294; &amp;#xC0AC;&amp;#xC2E4;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.. &amp;#xC800;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; Function Driver&amp;#xC640; &amp;#xB2EC;&amp;#xB9AC; Bus Driver&amp;#xC774;&amp;#xB098; Filter Driver&amp;#xC5D0;&amp;#xC11C;&amp;#xC758; &amp;#xAD6C;&amp;#xC870; &amp;#xCC28;&amp;#xC774;&amp;#xC640;, &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xC5B4;&amp;#xB5A4; &amp;#xBC29;&amp;#xC2DD;&amp;#xC73C;&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xB294;&amp;#xC9C0; &amp;#xAD81;&amp;#xAE08;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;&amp;#xC624;&amp;#xB298;&amp;#xC740; Minifilter Driver &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;, &amp;#xB0B4;&amp;#xBD80; &amp;#xAD6C;&amp;#xC131;&amp;#xC694;&amp;#xC18C;&amp;#xC640; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xBD84;&amp;#xC11D;&amp;#xD574;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image1.png&#34; alt&gt;&lt;/p&gt;
&lt;h1 id=&#34;1-About-Minifilter-Drivers&#34;&gt;&lt;a href=&#34;#1-About-Minifilter-Drivers&#34; class=&#34;headerlink&#34; title=&#34;1. About Minifilter Drivers&#34;&gt;&lt;/a&gt;1. About Minifilter Drivers&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;, &amp;#xC5F4;&amp;#xAE30;, &amp;#xC77D;&amp;#xAE30;, &amp;#xC4F0;&amp;#xAE30;, &amp;#xC0AD;&amp;#xC81C;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xBCC0;&amp;#xACBD;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB3C4;&amp;#xB85D; &amp;#xC124;&amp;#xACC4;&amp;#xB41C; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xBAA9;&amp;#xC801;&amp;#xC758; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C;, &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xD65C;&amp;#xB3D9;&amp;#xC744; &amp;#xC815;&amp;#xBC00;&amp;#xD558;&amp;#xAC8C; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xB370;&amp;#xC5D0; &amp;#xC0AC;&amp;#xC6A9;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x201C;&amp;#xD30C;&amp;#xC77C; &amp;#xC811;&amp;#xADFC;&amp;#xC744; &amp;#xAC10;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;, &amp;#xCC28;&amp;#xB2E8;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#x201D;&lt;/strong&gt;&amp;#xC744; &amp;#xC0DD;&amp;#xAC01;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; &amp;#xC7A0;&amp;#xC2DC;&amp;#xB9CC;&amp;#xC694;. &lt;strong&gt;Antivirus, EDR, &amp;#xBC31;&amp;#xC5C5; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&lt;/strong&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC774; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xACE0; &amp;#xBAA8;&amp;#xB2C8;&amp;#xD130;&amp;#xB9C1;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774; &amp;#xC8FC; &amp;#xBAA9;&amp;#xC801;&amp;#xC778; &amp;#xC81C;&amp;#xD488;&amp;#xC5D0; &amp;#xC801;&amp;#xD569;&amp;#xD574; &amp;#xBCF4;&amp;#xC774;&amp;#xC9C0; &amp;#xC54A;&amp;#xB098;&amp;#xC694;? &amp;#xB9DE;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC0C1;&amp;#xB2F9;&amp;#xC218;&amp;#xC758; &amp;#xD574;&amp;#xB2F9; &amp;#xC81C;&amp;#xD488;&amp;#xB4E4;&amp;#xC774; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xC81C;&amp;#xAC00; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC5C8;&amp;#xB294;&amp;#xB370;&amp;#xC694;.&lt;/p&gt;
&lt;p&gt;Minifiler &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xB2E4;&amp;#xC74C; &amp;#xC138; &amp;#xAC00;&amp;#xC9C0; &amp;#xC885;&amp;#xB958;&amp;#xC758; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;IRP (I/O Request Packet)&lt;/li&gt;
&lt;li&gt;Fast I/O&lt;/li&gt;
&lt;li&gt;File System Filter Callbacks&lt;/li&gt;
&lt;/ol&gt;
&lt;h2 id=&#34;1-1-Filter-Manager-&amp;#x2192;-Minifilter-&amp;#xD750;&amp;#xB984;&#34;&gt;&lt;a href=&#34;#1-1-Filter-Manager-&amp;#x2192;-Minifilter-&amp;#xD750;&amp;#xB984;&#34; class=&#34;headerlink&#34; title=&#34;1.1 Filter Manager &amp;#x2192; Minifilter &amp;#xD750;&amp;#xB984;&#34;&gt;&lt;/a&gt;1.1 Filter Manager &amp;#x2192; Minifilter &amp;#xD750;&amp;#xB984;&lt;/h2&gt;&lt;p&gt;Minifilter&amp;#xB294; Windows&amp;#xC758; Filter Manager(&lt;code&gt;fltmgr.sys&lt;/code&gt;) &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. Filter Manager&amp;#xB294; I/O Manager&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC804;&amp;#xB2EC;&amp;#xB41C; &amp;#xD30C;&amp;#xC77C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744;, &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0;&amp;#xAC8C; Altitude &amp;#xC21C;&amp;#xC11C;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC989;, Altitude&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB85C;&amp;#xB529; &amp;#xC21C;&amp;#xC11C;&amp;#xB97C; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image2.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xB294; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &lt;code&gt;CreateFile&lt;/code&gt;, &lt;code&gt;ReadFile&lt;/code&gt;, &lt;code&gt;WriteFile&lt;/code&gt;&amp;#xAC19;&amp;#xC740; API&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xB294; I/O &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC694;&amp;#xCCAD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;I/O Manager&amp;#xC774; &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBC1B;&amp;#xC544; Filter Manager(&lt;code&gt;fltmgr.sys&lt;/code&gt;)&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Filter Manager&amp;#xB294; &amp;#xB4F1;&amp;#xB85D;&amp;#xB41C; &amp;#xBAA8;&amp;#xB4E0; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xBAA9;&amp;#xB85D;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xACE0;, Altitude &amp;#xC21C;&amp;#xC11C;&amp;#xB300;&amp;#xB85C; &amp;#xAC01; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC5D0; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;Minifilter&amp;#xC774; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD55C; &amp;#xB4A4;, &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; Filter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC694;&amp;#xCCAD;&amp;#xC740; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;(Storage Driver Stack)&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xC5B4; &amp;#xC2E4;&amp;#xC81C; &amp;#xB514;&amp;#xC2A4;&amp;#xD06C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image3.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCC38;&amp;#xACE0;&amp;#xB85C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0; &amp;#xB85C;&amp;#xB4DC;&amp;#xB41C; Minifilter &amp;#xBAA9;&amp;#xB85D;&amp;#xC740; cmd&amp;#xCC3D;&amp;#xC758; fltmc &amp;#xBA85;&amp;#xB839;&amp;#xC73C;&amp;#xB85C; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Altitude &amp;#xAC12;&amp;#xC774; &amp;#xB192;&amp;#xC744;&amp;#xC218;&amp;#xB85D; &amp;#xC6B0;&amp;#xC120;&amp;#xC21C;&amp;#xC704;&amp;#xAC00; &amp;#xB192;&amp;#xC544;&amp;#xC838; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xBA3C;&amp;#xC800; &amp;#xAC00;&amp;#xB85C;&amp;#xCC44;&amp;#xAC70;&amp;#xB098; &amp;#xC870;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB2E8;, &amp;#xCC98;&amp;#xB9AC; &amp;#xC21C;&amp;#xC11C;&amp;#xB294; &amp;#xC0AC;&amp;#xC804; &amp;#xC5F0;&amp;#xC0B0;, &amp;#xC0AC;&amp;#xD6C4; &amp;#xC5F0;&amp;#xC0B0;&amp;#xC5D0; &amp;#xB530;&amp;#xB77C; &amp;#xB2E4;&amp;#xB985;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC5F0;&amp;#xC0B0;(Pre-operation)&lt;/strong&gt;: Altitude&amp;#xAC00; &lt;strong&gt;&amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C; &amp;#x2192; &amp;#xB0AE;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&lt;/strong&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xC5F0;&amp;#xC0B0;(Post-operation)&lt;/strong&gt;: Altitude&amp;#xAC00; &lt;strong&gt;&amp;#xB0AE;&amp;#xC740; &amp;#xC21C;&amp;#xC11C; &amp;#x2192; &amp;#xB192;&amp;#xC740; &amp;#xC21C;&amp;#xC11C;&lt;/strong&gt;&amp;#xB85C; &amp;#xD638;&amp;#xCD9C;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xB3CC;&amp;#xC544;&amp;#xC640; &amp;#xC704; &amp;#xC804;&amp;#xCCB4;&amp;#xC801;&amp;#xC778; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74;&amp;#x2026; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xC874;&amp;#xC758; &amp;#xBC29;&amp;#xC2DD;&amp;#xCC98;&amp;#xB7FC; IRP&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB300;&amp;#xC2E0;, FilterManager&amp;#xAC00; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xB300;&amp;#xC2E0; &amp;#xBC1B;&amp;#xC544;&amp;#xC11C; Minifilter&amp;#xC5D0;&amp;#xAC8C; &amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC2DC;&amp;#xB9D0;&amp;#xD574; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC6B0;&amp;#xB9AC;&amp;#xAC00; &amp;#xD754;&amp;#xD788; &amp;#xC54C;&amp;#xACE0;&amp;#xC788;&amp;#xB294; &lt;strong&gt;DispatchRoutine&amp;#xC744; &amp;#xC124;&amp;#xC815;&amp;#xD560; &amp;#xD544;&amp;#xC694;&amp;#xAC00; &amp;#xC5C6;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;!&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;1-2-Minifilter-Callback-Routine&#34;&gt;&lt;a href=&#34;#1-2-Minifilter-Callback-Routine&#34; class=&#34;headerlink&#34; title=&#34;1.2 Minifilter Callback Routine&#34;&gt;&lt;/a&gt;1.2 Minifilter Callback Routine&lt;/h2&gt;&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xD2B9;&amp;#xC815; &amp;#xD30C;&amp;#xC77C; &amp;#xC791;&amp;#xC5C5;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xB3D9;&amp;#xC791;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC744;&amp;#xAE4C;&amp;#xC694;? &amp;#xC774;&amp;#xB294; &amp;#xCF5C;&amp;#xBC31;(Callback)&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998; &amp;#xB355;&amp;#xBD84;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &lt;strong&gt;DispatchRoutine&lt;/strong&gt;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; IRP&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xB294;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC8E0;? &amp;#xADF8; &amp;#xB300;&amp;#xC2E0;, Filter Manager&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xB294; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC5D0; &amp;#x201C;&amp;#xD6C5;(hook)&amp;#x201D;&amp;#xC744; &amp;#xAC78; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xB294; &amp;#xC774; &amp;#xC694;&amp;#xCCAD;&amp;#xB4E4;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD560; &amp;#xB54C; &lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xCF5C;&amp;#xBC31;(&lt;code&gt;PreOperation Callback&lt;/code&gt;)&lt;/strong&gt;&amp;#xACFC; &lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xCF5C;&amp;#xBC31;(&lt;code&gt;PostOperation Callback&lt;/code&gt;)&lt;/strong&gt;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xC5EC;, &amp;#xAC10;&amp;#xC2DC;&amp;#xD558;&amp;#xACE0;&amp;#xC790; &amp;#xD558;&amp;#xB294; I/O &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; &amp;#xC218;&amp;#xC900;&amp;#xC5D0;&amp;#xC11C; &amp;#xAD00;&amp;#xCC30;&amp;#xD558;&amp;#xAC70;&amp;#xB098; &amp;#xC81C;&amp;#xC5B4;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xC804; &amp;#xC791;&amp;#xC5C5; &amp;#xCF5C;&amp;#xBC31; (&lt;code&gt;PFLT_PRE_OPERATION_CALLBACK&lt;/code&gt;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PFLT_PRE_OPERATION_CALLBACK PfltPreOperationCallback;

&lt;span class=&#34;hljs-function&#34;&gt;FLT_PREOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PfltPreOperationCallback&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out] PFLT_CALLBACK_DATA Data,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]      PCFLT_RELATED_OBJECTS FltObjects,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [out]     PVOID *CompletionContext&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{...}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC774;&amp;#xB098; &amp;#xD558;&amp;#xC704; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C; &amp;#xC804;&amp;#xB2EC;&amp;#xB418;&amp;#xAE30; &amp;#xC774;&amp;#xC804;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xC758; &amp;#xD575;&amp;#xC2EC; &amp;#xB85C;&amp;#xC9C1;&amp;#xC774; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xB294; &amp;#xACF3;&amp;#xC73C;&amp;#xB85C; &lt;code&gt;FLT_PREOP_COMPLETE&lt;/code&gt;, &lt;code&gt;FLT_PREOP_SUCCESS_WITH_CALLBACK&lt;/code&gt;, &lt;code&gt;FLT_PREOP_SUCCESS_NO_CALLBACK&lt;/code&gt;&amp;#xACFC; &amp;#xAC19;&amp;#xC740; &amp;#xAC15;&amp;#xB825;&amp;#xD55C; &amp;#xAD8C;&amp;#xD55C;&amp;#xC744; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_pre_operation_callback&#34;&gt;&lt;strong&gt;PFLT_PRE_OPERATION_CALLBACK callback function (fltkernel.h)&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xC0AC;&amp;#xD6C4; &amp;#xC791;&amp;#xC5C5; &amp;#xCF5C;&amp;#xBC31; (&lt;code&gt;PFLT_POST_OPERATION_CALLBACK&lt;/code&gt;)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;PFLT_POST_OPERATION_CALLBACK PfltPostOperationCallback;

&lt;span class=&#34;hljs-function&#34;&gt;FLT_POSTOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PfltPostOperationCallback&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, out]      PFLT_CALLBACK_DATA Data,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           PCFLT_RELATED_OBJECTS FltObjects,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in, optional] PVOID CompletionContext,&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;  [in]           FLT_POST_OPERATION_FLAGS Flags&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-params&#34;&gt;)&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-function&#34;&gt;&lt;/span&gt;{...}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xD558;&amp;#xC704; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xB9C8;&amp;#xCE58;&amp;#xACE0; &amp;#xB3CC;&amp;#xC544;&amp;#xC624;&amp;#xB294; &amp;#xAE38;&amp;#xC5D0; &amp;#xD638;&amp;#xCD9C;&amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC791;&amp;#xC5C5;&amp;#xC758; &amp;#xC131;&amp;#xACF5; &amp;#xC5EC;&amp;#xBD80;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xB85C;&amp;#xAE45;&amp;#xD558;&amp;#xAC70;&amp;#xB098;, &amp;#xD544;&amp;#xC694;&amp;#xD558;&amp;#xB2E4;&amp;#xBA74; &amp;#xC791;&amp;#xC5C5; &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xC218;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xB4F1;&amp;#xC758; &amp;#xD6C4;&amp;#xCC98;&amp;#xB9AC; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;br&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_post_operation_callback&#34;&gt;&lt;strong&gt;PFLT_POST_OPERATION_CALLBACK callback function (fltkernel.h)&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;#xACB0;&amp;#xACFC;&amp;#xC801;&amp;#xC73C;&amp;#xB85C;, &amp;#xC774; &amp;#xCF5C;&amp;#xBC31;&amp;#xB4E4;&amp;#xC740; &lt;code&gt;FLT_OPERATION_REGISTRATION&lt;/code&gt;&amp;#xC774;&amp;#xB77C;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#x201C;&amp;#xC5B4;&amp;#xB5A4; I/O &amp;#xC791;&amp;#xC5C5;(MajorFunction)&amp;#xC5D0; &amp;#xC5B4;&amp;#xB5A4; &amp;#xC0AC;&amp;#xC804;/&amp;#xC0AC;&amp;#xD6C4; &amp;#xCF5C;&amp;#xBC31; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xD560;&amp;#xC9C0;&amp;#x201D;&amp;#xB97C; &amp;#xBA85;&amp;#xC2DC;&amp;#xD574; &amp;#xB4F1;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2 id=&#34;1-3-Minifilter&amp;#xC640;-User-Mode-&amp;#xAC04;&amp;#xC758;-&amp;#xD1B5;&amp;#xC2E0;&#34;&gt;&lt;a href=&#34;#1-3-Minifilter&amp;#xC640;-User-Mode-&amp;#xAC04;&amp;#xC758;-&amp;#xD1B5;&amp;#xC2E0;&#34; class=&#34;headerlink&#34; title=&#34;1.3 Minifilter&amp;#xC640; User-Mode &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&#34;&gt;&lt;/a&gt;1.3 Minifilter&amp;#xC640; User-Mode &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&lt;/h2&gt;&lt;p&gt;Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158; &amp;#xAC04;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC740; &lt;strong&gt;&amp;#xD544;&amp;#xD130; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&lt;/strong&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC774;&amp;#xB8E8;&amp;#xC5B4;&amp;#xC9D1;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB780;, Minifilter&amp;#xC640; &amp;#xC571; &amp;#xC0AC;&amp;#xC774;&amp;#xC758; &amp;#xC804;&amp;#xC6A9; &amp;#xACE0;&amp;#xC18D; &amp;#xD1B5;&amp;#xC2E0; &amp;#xCC44;&amp;#xB110;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB294; Kernel Mode &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC640; User-Mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4; &amp;#xAC04;&amp;#xC758; &amp;#xC548;&amp;#xC804;&amp;#xD55C; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xC804;&amp;#xB2EC;&amp;#xC744; &amp;#xAC00;&amp;#xB2A5;&amp;#xD558;&amp;#xAC8C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; Microsoft&amp;#xAC00; &amp;#xC81C;&amp;#xACF5;&amp;#xD558;&amp;#xB294; &amp;#xC5EC;&amp;#xB7EC; API&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;!&lt;/p&gt;
&lt;h3 id=&#34;Driver-Code&#34;&gt;&lt;a href=&#34;#Driver-Code&#34; class=&#34;headerlink&#34; title=&#34;Driver Code&#34;&gt;&lt;/a&gt;Driver Code&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;fltKernel.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

PFLT_FILTER gFilter = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
PFLT_PORT gServerPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, gClientPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;

&lt;span class=&#34;hljs-function&#34;&gt;VOID &lt;span class=&#34;hljs-title&#34;&gt;OnDisconnect&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PVOID Cookie)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(Cookie);
    FltCloseClientPort(gFilter, &amp;amp;gClientPort);
    gClientPort = &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;OnConnect&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PFLT_PORT ClientPort, PVOID SrvCookie, PVOID Ctx, ULONG Size, PVOID* ConnCookie)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(SrvCookie);
    UNREFERENCED_PARAMETER(Ctx);
    UNREFERENCED_PARAMETER(Size);
    UNREFERENCED_PARAMETER(ConnCookie);
    gClientPort = ClientPort;
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; STATUS_SUCCESS;
}

&lt;span class=&#34;hljs-function&#34;&gt;FLT_PREOP_CALLBACK_STATUS &lt;span class=&#34;hljs-title&#34;&gt;PreCreate&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PFLT_CALLBACK_DATA Data, PCFLT_RELATED_OBJECTS FltObjects, PVOID* Buff)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(FltObjects);
    UNREFERENCED_PARAMETER(Buff);
    PFLT_FILE_NAME_INFORMATION nameInfo;

    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (gClientPort &amp;amp;&amp;amp; NT_SUCCESS(FltGetFileNameInformation(Data, FLT_FILE_NAME_NORMALIZED, &amp;amp;nameInfo))) {
        FltSendMessage(gFilter, &amp;amp;gClientPort, nameInfo-&amp;gt;Name.Buffer, nameInfo-&amp;gt;Name.Length, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
        FltReleaseFileNameInformation(nameInfo);
    }
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FLT_PREOP_SUCCESS_NO_CALLBACK;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;Unload&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(FLT_FILTER_UNLOAD_FLAGS Flags)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(Flags);
    FltCloseCommunicationPort(gServerPort);
    FltUnregisterFilter(gFilter);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; STATUS_SUCCESS;
}

&lt;span class=&#34;hljs-function&#34;&gt;NTSTATUS &lt;span class=&#34;hljs-title&#34;&gt;DriverEntry&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;(PDRIVER_OBJECT DriverObject, PUNICODE_STRING RegistryPath)&lt;/span&gt; &lt;/span&gt;{
    UNREFERENCED_PARAMETER(RegistryPath);
    NTSTATUS status;

    &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; FLT_OPERATION_REGISTRATION Cbs[] = { { IRP_MJ_CREATE, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, PreCreate, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt; }, { IRP_MJ_OPERATION_END } };
    &lt;span class=&#34;hljs-keyword&#34;&gt;const&lt;/span&gt; FLT_REGISTRATION Reg = { &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(FLT_REGISTRATION), FLT_REGISTRATION_VERSION, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, Cbs, Unload };

    status = FltRegisterFilter(DriverObject, &amp;amp;Reg, &amp;amp;gFilter);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!NT_SUCCESS(status)) &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; status;

    UNICODE_STRING portName = RTL_CONSTANT_STRING(&lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\FileActivityMonitorPort&amp;quot;&lt;/span&gt;);
    OBJECT_ATTRIBUTES oa = { &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(oa), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;portName, OBJ_KERNEL_HANDLE | OBJ_CASE_INSENSITIVE, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt; };

    status = FltCreateCommunicationPort(gFilter, &amp;amp;gServerPort, &amp;amp;oa, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, OnConnect, OnDisconnect, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (!NT_SUCCESS(status)) {
        FltUnregisterFilter(gFilter);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; status;
    }

    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; FltStartFiltering(gFilter);
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; Driver Code API&amp;#xC778; &lt;code&gt;FltCreateCommunicationPort()&lt;/code&gt;, &lt;code&gt;FltSendMessage()&lt;/code&gt;, &lt;code&gt;FltCloseCommunicationPort()&lt;/code&gt;&amp;#xC5D0; &amp;#xCD08;&amp;#xC810;&amp;#xC744; &amp;#xB9DE;&amp;#xCDB0;&amp;#xC11C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC608;&amp;#xC81C;&amp;#xB85C; &amp;#xAD6C;&amp;#xD604;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD568;&amp;#xAED8; &amp;#xC0B4;&amp;#xD3B4;&amp;#xBCFC;&amp;#xAE4C;&amp;#xC694;?&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &lt;code&gt;FltRegisterFilter()&lt;/code&gt;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC790;&amp;#xC2E0;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;&amp;#xACFC; &amp;#xC5F4;&amp;#xAE30;(&lt;code&gt;IRP_MJ_CREATE&lt;/code&gt;) &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xAC10;&amp;#xC2DC;&amp;#xD560; PreCreateCallback &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC9C0;&amp;#xC815;&amp;#xD558;&amp;#xACE0;, &lt;code&gt;FltStartFiltering()&lt;/code&gt;&amp;#xC73C;&amp;#xB85C; I/O &amp;#xAC10;&amp;#xC2DC;&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&lt;code&gt;FltCreateCommunicationPort()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC704;&amp;#xC758; &amp;#xCF54;&amp;#xB4DC;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC774; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xC54C;&amp;#xB9BC;&amp;#xC744; &amp;#xBC1B;&amp;#xC744; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8; &lt;code&gt;\\FileActivityMonitorPort&lt;/code&gt;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9CC;&amp;#xC57D; &amp;#xD30C;&amp;#xC77C; &amp;#xC0DD;&amp;#xC131;/&amp;#xC5F4;&amp;#xAE30; &amp;#xC774;&amp;#xBCA4;&amp;#xD2B8;&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xBA74; PreCreateCallback&amp;#xC774; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xACE0;, &amp;#xD574;&amp;#xB2F9; &amp;#xD568;&amp;#xC218;&amp;#xB294; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xAC00; &amp;#xC5B4;&amp;#xB5A4; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD588;&amp;#xB294;&amp;#xC9C0; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC218;&amp;#xC9D1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;FltSendMessage()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; PreCreateCall&amp;#xC5D0;&amp;#xC11C; &amp;#xC218;&amp;#xC9D1;&amp;#xD55C; &amp;#xC2E4;&amp;#xC2DC;&amp;#xAC04; &amp;#xD30C;&amp;#xC77C; &amp;#xC811;&amp;#xADFC; &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xC5F0;&amp;#xACB0;&amp;#xB418;&amp;#xC5B4;&amp;#xC788;&amp;#xB294; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC73C;&amp;#xB85C; &amp;#xC989;&amp;#xC2DC; &amp;#xC804;&amp;#xC1A1;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xB9C8;&amp;#xC9C0;&amp;#xB9C9;&amp;#xC73C;&amp;#xB85C; FilterUnload &amp;#xC5B8;&amp;#xB85C;&amp;#xB4DC; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xAC00; &amp;#xC885;&amp;#xB8CC;&amp;#xB420; &amp;#xB54C;, &amp;#xC5F4;&amp;#xC5C8;&amp;#xB358; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &lt;code&gt;FltCloseCommunicationPort()&lt;/code&gt;&amp;#xB85C; &amp;#xB2EB;&amp;#xACE0; &amp;#xD544;&amp;#xD130; &amp;#xB4F1;&amp;#xB85D;&amp;#xC744; &amp;#xD574;&amp;#xC81C;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;User-Mode-Application-Code&#34;&gt;&lt;a href=&#34;#User-Mode-Application-Code&#34; class=&#34;headerlink&#34; title=&#34;User-Mode Application Code&#34;&gt;&lt;/a&gt;User-Mode Application Code&lt;/h3&gt;&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;windows.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;fltuser.h&amp;gt;&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;include&lt;/span&gt; &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;

&lt;span class=&#34;hljs-meta&#34;&gt;#&lt;span class=&#34;hljs-meta-keyword&#34;&gt;pragma&lt;/span&gt; comment(lib, &lt;span class=&#34;hljs-meta-string&#34;&gt;&amp;quot;fltlib.lib&amp;quot;&lt;/span&gt;)&lt;/span&gt;

&lt;span class=&#34;hljs-function&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;int&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;main&lt;/span&gt;&lt;span class=&#34;hljs-params&#34;&gt;()&lt;/span&gt; &lt;/span&gt;{
    HANDLE port;
    HRESULT hr;
    
    BYTE buffer[&lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(FILTER_MESSAGE_HEADER) + &lt;span class=&#34;hljs-number&#34;&gt;1024&lt;/span&gt;];
    PFILTER_MESSAGE_HEADER header = (PFILTER_MESSAGE_HEADER)buffer;

    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connecting to driver...\n&amp;quot;&lt;/span&gt;);

    hr = FilterConnectCommunicationPort(&lt;span class=&#34;hljs-string&#34;&gt;L&amp;quot;\\FileActivityMonitorPort&amp;quot;&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;, &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;, &amp;amp;port);
    &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (IS_ERROR(hr)) {
        &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connection failed. Error 0x%X\n&amp;quot;&lt;/span&gt;, hr);
        &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;1&lt;/span&gt;;
    }

    &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connected. Waiting for file events...\n&amp;quot;&lt;/span&gt;);

    &lt;span class=&#34;hljs-keyword&#34;&gt;while&lt;/span&gt; (TRUE) {
        hr = FilterGetMessage(port, header, &lt;span class=&#34;hljs-keyword&#34;&gt;sizeof&lt;/span&gt;(buffer), &lt;span class=&#34;hljs-literal&#34;&gt;NULL&lt;/span&gt;);
        
        &lt;span class=&#34;hljs-keyword&#34;&gt;if&lt;/span&gt; (SUCCEEDED(hr)) {
            &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;File Accessed: %S\n&amp;quot;&lt;/span&gt;, (PWSTR)header-&amp;gt;MessageBody);
        } &lt;span class=&#34;hljs-keyword&#34;&gt;else&lt;/span&gt; {
            &lt;span class=&#34;hljs-built_in&#34;&gt;printf&lt;/span&gt;(&lt;span class=&#34;hljs-string&#34;&gt;&amp;quot;Connection lost. Error 0x%X\n&amp;quot;&lt;/span&gt;, hr);
            &lt;span class=&#34;hljs-keyword&#34;&gt;break&lt;/span&gt;;
        }
    }

    CloseHandle(port);
    &lt;span class=&#34;hljs-keyword&#34;&gt;return&lt;/span&gt; &lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;;
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC81C; User-Mode &amp;#xC560;&amp;#xD50C;&amp;#xB9AC;&amp;#xCF00;&amp;#xC774;&amp;#xC158;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD750;&amp;#xB984;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;. &amp;#xB300;&amp;#xD45C;&amp;#xC801;&amp;#xC778; API&amp;#xB85C; &lt;code&gt;FilterConnectCommunicationPort()&lt;/code&gt;, &lt;code&gt;FilterSendMessage()&lt;/code&gt;&amp;#xAC00; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;FilterConnectCommunicationPort()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC5D0; &amp;#xC788;&amp;#xB294; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xC758; &amp;#xD1B5;&amp;#xC2E0; &amp;#xD3EC;&amp;#xD2B8;&amp;#xC778; &lt;code&gt;\\FileActivityMonitorPort&lt;/code&gt;&amp;#xC5D0; &amp;#xC5F0;&amp;#xACB0;&amp;#xD558;&amp;#xACE0; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC704;&amp;#xD55C; HANDLE&amp;#xC744; &amp;#xC5BB;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xADF8; &amp;#xD6C4; &lt;code&gt;FilterGetMessage()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD638;&amp;#xCD9C;&amp;#xD558;&amp;#xC5EC;, &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C; &amp;#xBB38;&amp;#xC790;&amp;#xC5F4;&amp;#xC744; &amp;#xC9C1;&amp;#xC811; &amp;#xC218;&amp;#xC2E0;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC131;&amp;#xACF5;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xC218;&amp;#xC2E0;&amp;#xB418;&amp;#xBA74; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C; &amp;#xACBD;&amp;#xB85C;&amp;#xB97C; &amp;#xD654;&amp;#xBA74;&amp;#xC5D0; &amp;#xCD9C;&amp;#xB825;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h1 id=&#34;2-CVE-2024-30085-1-Day-Analysis&#34;&gt;&lt;a href=&#34;#2-CVE-2024-30085-1-Day-Analysis&#34; class=&#34;headerlink&#34; title=&#34;2. [CVE-2024-30085] 1-Day Analysis&#34;&gt;&lt;/a&gt;2. [CVE-2024-30085] 1-Day Analysis&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&amp;#xD558;&amp;#xB8E8;&amp;#xD55C;&amp;#xC904;&amp;#xC5D0;&amp;#xB3C4; &amp;#xC18C;&amp;#xAC1C;&amp;#xB418;&amp;#xC5C8;&amp;#xB358; Windows Minifilter Driver &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC778;&amp;#xB370;&amp;#xC694;(&lt;a href=&#34;https://hackyboiz.github.io/2025/01/11/OUYA77/2025-01-11/&#34;&gt;reference&lt;/a&gt;). CVE-2024-30085&amp;#xB97C; &amp;#xC9C1;&amp;#xC811; &amp;#xC7AC;&amp;#xD604;&amp;#xD574;&amp;#xBCF4;&amp;#xBA70; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xC54C;&amp;#xC544;&amp;#xAC00;&amp;#xBCF4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD569;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x1FA9F; Environment : Windows 11 22h2/23h2 10.0.2261.3672&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image4.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Windows Cloud Files Mini Filter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; Windows &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xAE30;&amp;#xB2A5;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC608;&amp;#xC2DC;&amp;#xB85C; &amp;#xC9C0;&amp;#xAE08; &amp;#xC800;&amp;#xC758; &amp;#xD3F4;&amp;#xB354;&amp;#xB97C; &amp;#xD558;&amp;#xB098; &amp;#xCC0D;&amp;#xC5B4;&amp;#xC654;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC624;&amp;#xB298;&amp;#xC740; &amp;#xD574;&amp;#xB2F9; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC744; &amp;#xC774;&amp;#xD574;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xBA3C;&amp;#xC800; Stub File, Reparse Point&amp;#xC5D0; &amp;#xB300;&amp;#xD55C; &amp;#xC0AC;&amp;#xC804; &amp;#xACF5;&amp;#xBD80;&amp;#xAC00; &amp;#xD544;&amp;#xC694;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Stub-File&amp;#xC774;&amp;#xB780;&#34;&gt;&lt;a href=&#34;#Stub-File&amp;#xC774;&amp;#xB780;&#34; class=&#34;headerlink&#34; title=&#34;Stub File&amp;#xC774;&amp;#xB780;?&#34;&gt;&lt;/a&gt;Stub File&amp;#xC774;&amp;#xB780;?&lt;/h3&gt;&lt;p&gt;Stub File&amp;#xC740; &amp;#xB85C;&amp;#xCEEC;&amp;#xC5D0;&amp;#xB294; &amp;#xC2E4;&amp;#xC81C;&amp;#xB85C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC5C6;&amp;#xACE0;, placeholder &amp;#xD615;&amp;#xD0DC;&amp;#xB85C; &amp;#xC874;&amp;#xC7AC;&amp;#xD558;&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC758;&amp;#xBBF8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC704;&amp;#xC758; &amp;#xC774;&amp;#xBBF8;&amp;#xC9C0;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#x2018;&amp;#xC0AC;&amp;#xC9C4;&amp;#x2019; &amp;#xD3F4;&amp;#xB354;&amp;#xC5D0; &amp;#xD30C;&amp;#xB780;&amp;#xC0C9; &amp;#xAD6C;&amp;#xB984; &amp;#xC544;&amp;#xC774;&amp;#xCF58;&amp;#xC774; status&amp;#xB85C; &amp;#xB098;&amp;#xD0C0;&amp;#xB098;&amp;#xC788;&amp;#xC8E0;? &amp;#xBC14;&amp;#xB85C; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC774; stub &amp;#xC0C1;&amp;#xD0DC;&amp;#xB77C;&amp;#xACE0; &amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC5B4;&amp;#xC694;. NTFS &amp;#xC0C1;&amp;#xC5D0;&amp;#xC11C; &amp;#xD30C;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;, &amp;#xC774;&amp;#xB984;, &amp;#xC544;&amp;#xC774;&amp;#xCF58; &amp;#xB4F1;&amp;#xC740; &amp;#xD45C;&amp;#xC2DC;&amp;#xD558;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xD30C;&amp;#xC77C; &amp;#xB0B4;&amp;#xC6A9;&amp;#xC740; &amp;#xC804;&amp;#xD600; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h3 id=&#34;Reparse-Point-Metadata&#34;&gt;&lt;a href=&#34;#Reparse-Point-Metadata&#34; class=&#34;headerlink&#34; title=&#34;Reparse Point Metadata&#34;&gt;&lt;/a&gt;Reparse Point Metadata&lt;/h3&gt;&lt;p&gt;&amp;#xADF8;&amp;#xB7FC; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC774;&amp;#xB7EC;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xBA74; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xB420;&amp;#xAE4C;&amp;#xC694;!? NTFS&amp;#xB294; Reparse Tag&amp;#xB97C; &amp;#xBCF4;&amp;#xACE0; &lt;strong&gt;&amp;#x201C;&amp;#xC624;&amp;#xD638;&amp;#x2026; &amp;#xC774;&amp;#xAC74; stub file&amp;#xC774;&amp;#xB124;!&amp;#x201D;&lt;/strong&gt;&amp;#xB77C;&amp;#xACE0; &amp;#xD310;&amp;#xB2E8;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; Windows Cloud Files Minifilter(&lt;code&gt;cldflt.sys&lt;/code&gt;)&amp;#xAC00; &amp;#xC774; &lt;code&gt;Reparse Point&lt;/code&gt; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC77D;&amp;#xACE0;, &amp;#xC774; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5B4;&amp;#xB5BB;&amp;#xAC8C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560;&amp;#xC9C0; &amp;#xACB0;&amp;#xC815;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC774;&amp;#xC8E0;.&lt;/p&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; Minifilter&amp;#xC740; &amp;#xC6D0;&amp;#xACA9; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xC900;&amp;#xBE44;&amp;#xD558;&amp;#xB294;&amp;#xB370;, &lt;code&gt;cldflt.sys&lt;/code&gt;&amp;#xB294; &amp;#xC9C1;&amp;#xC811; &amp;#xC11C;&amp;#xBC84;&amp;#xC640; &amp;#xD1B5;&amp;#xC2E0;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. User-Mode &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC2E4;&amp;#xC81C; &amp;#xC791;&amp;#xC5C5;&amp;#xC744; &amp;#xC704;&amp;#xC784;&amp;#xD574;&amp;#xBC84;&amp;#xB9AC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC704;&amp;#xC5D0;&amp;#xC11C; &amp;#xBCF4;&amp;#xC558;&amp;#xB358; Minifilter&amp;#xC774; I/O Interpreter &amp;#xC5ED;&amp;#xD560;&amp;#xC744; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xACE0;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC870;&amp;#xC791;&amp;#xC740; User-Mode &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xAC00; &amp;#xB2F4;&amp;#xB2F9;&amp;#xD55C;&amp;#xB2E4;&amp;#xB294; &amp;#xAC1C;&amp;#xB150;&amp;#xACFC; &amp;#xC77C;&amp;#xCE58;&amp;#xD558;&amp;#xC8E0;? (&amp;#xC624;.. &amp;#xC2E0;&amp;#xAE30;&amp;#xD558;&amp;#xB124;&amp;#xC694;.)&lt;/p&gt;
&lt;p&gt;Windows Cloud Files Minifilter&amp;#xC758; Reparse Point &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; Local Types&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xD588;&amp;#xB294;&amp;#xB370;&amp;#xC694;, &amp;#xC81C;&amp;#xAC00; &amp;#xC815;&amp;#xC758;&amp;#xD55C; CldFlt &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC138;&amp;#xD2B8;&amp;#xB97C; &amp;#xD568;&amp;#xAED8; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBD05;&amp;#xC2DC;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; _&lt;span class=&#34;hljs-title&#34;&gt;REPARSE_DATA_BUFFER&lt;/span&gt; {&lt;/span&gt;
    DWORD ReparseTag;
    WORD ReparseDataLength;
    WORD Reserved;
    WORD Flags;
    WORD UncompressedSize;
    REPARSE_CLD_BUFFER ReparseCldBuffer;
} REPARSE_DATA_BUFFER, *PREPARSE_DATA_BUFFER;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xBA3C;&amp;#xC800; &lt;code&gt;REPARSE_DATA_BUFFER&lt;/code&gt;&amp;#xB294; NTFS&amp;#xC758; &amp;#xBAA8;&amp;#xB4E0; Reparse Point &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xD45C;&amp;#xC900; &amp;#xD5E4;&amp;#xB354; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC774;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xC5EC;&amp;#xAE30;&amp;#xC11C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xD560; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; Cloud Files&amp;#xB97C; &amp;#xC27D;&amp;#xAC8C; &amp;#xBD84;&amp;#xC11D;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xC7AC;&amp;#xC815;&amp;#xC758;&amp;#xD55C; &amp;#xBC84;&amp;#xC804;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; &lt;code&gt;ReparseTag&lt;/code&gt;&amp;#xB85C; &amp;#xC18C;&amp;#xC720; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0; &lt;code&gt;ReparseDataLength&lt;/code&gt;, &lt;code&gt;Flags&lt;/code&gt; &amp;#xAC19;&amp;#xC740; &amp;#xCD5C;&amp;#xC0C1;&amp;#xC704; &amp;#xBA54;&amp;#xD0C0;&amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xB2F4;&amp;#xC73C;&amp;#xBA70;, &amp;#xC2E4;&amp;#xC81C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB294; &lt;code&gt;HSM_REPARSE&lt;/code&gt;&amp;#xB85C; &amp;#xC774;&amp;#xC5B4;&amp;#xC9C0;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_REPARSE&lt;/span&gt;&lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;
    USHORT hsmFlags;
    USHORT hsmSize;
    &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_DATA&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;fileData&lt;/span&gt;;&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;code&gt;HSM_REPARSE&lt;/code&gt;&amp;#xB294; Cloud Files &amp;#xC804;&amp;#xC6A9; Reparse Point &amp;#xC804;&amp;#xCCB4; &amp;#xCEE8;&amp;#xD14C;&amp;#xC774;&amp;#xB108;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;hsmFlags&lt;/code&gt;&amp;#xC640; &lt;code&gt;hsmSize&lt;/code&gt;&amp;#xB85C; &amp;#xC555;&amp;#xCD95; &amp;#xC5EC;&amp;#xBD80;&amp;#xC640; HSM &amp;#xBE14;&amp;#xB85D; &amp;#xC804;&amp;#xCCB4; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xB098;&amp;#xD0C0;&amp;#xB0B4;&amp;#xACE0;, &lt;code&gt;fileData&lt;/code&gt; &amp;#xD544;&amp;#xB4DC;&amp;#xC5D0; &lt;code&gt;HSM_RP_DATA&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xD3EC;&amp;#xD568;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_DATA&lt;/span&gt; &lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;       
    ULONG magic;
    ULONG crc32;
    ULONG totalSize;
    USHORT dataFlags;
    USHORT elemCount;
    &lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_ELEMENT&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;elements&lt;/span&gt;[5];&lt;/span&gt;
};&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xC5B4;&amp;#xC11C; &lt;code&gt;HSM_RP_DATA&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB294; &amp;#xBA54;&amp;#xC778; &amp;#xD5E4;&amp;#xB354;&amp;#xB85C;, &amp;#xC804;&amp;#xCCB4; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xBE14;&amp;#xB85D;&amp;#xC758; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC704;&amp;#xCE58;&amp;#xB97C; &amp;#xB2F4;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. magic&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC885;&amp;#xB958;&amp;#xB97C; &amp;#xC2DD;&amp;#xBCC4;&amp;#xD558;&amp;#xACE0;, crc32&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;dataFlags&lt;/code&gt;&amp;#xC5D0; CRC &amp;#xC874;&amp;#xC7AC; &amp;#xBE44;&amp;#xD2B8;&amp;#xAC00; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xBA74; &lt;code&gt;RtlComputeCrc32&lt;/code&gt;&amp;#xB85C; &amp;#xAC80;&amp;#xC99D;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. elements[] &amp;#xBC30;&amp;#xC5F4;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;HSM_RP_ELEMENT&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB4E4;&amp;#xC774; &amp;#xC800;&amp;#xC7A5;&amp;#xB418;&amp;#xC5B4; &amp;#xAC01; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xC18C;&amp;#xC758; &amp;#xC720;&amp;#xD615;, &amp;#xD06C;&amp;#xAE30;, &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;HSM_RP_ELEMENT&lt;/span&gt; &lt;/span&gt;
&lt;span class=&#34;hljs-class&#34;&gt;{&lt;/span&gt;               
    USHORT elemType;
    USHORT elemSize;
    ULONG elemOffset;
};

&lt;span class=&#34;hljs-keyword&#34;&gt;typedef&lt;/span&gt; &lt;span class=&#34;hljs-keyword&#34;&gt;enum&lt;/span&gt; HSM_RP_ELEM_TYPE {
    HSM_RP_ELEMENT_NONE   = &lt;span class=&#34;hljs-number&#34;&gt;0x00&lt;/span&gt;,
    HSM_RP_ELEMENT_U64    = &lt;span class=&#34;hljs-number&#34;&gt;0x06&lt;/span&gt;,
    HSM_RP_ELEMENT_BYTE   = &lt;span class=&#34;hljs-number&#34;&gt;0x07&lt;/span&gt;,
    HSM_RP_ELEMENT_U32    = &lt;span class=&#34;hljs-number&#34;&gt;0x0a&lt;/span&gt;,
    HSM_RP_ELEMENT_BITMAP = &lt;span class=&#34;hljs-number&#34;&gt;0x11&lt;/span&gt;,
    HSM_RP_ELEMENT_MAX    = &lt;span class=&#34;hljs-number&#34;&gt;0x12&lt;/span&gt;
} HSM_RP_ELEMENT_TYPE;&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xC774;&amp;#xD6C4; &lt;code&gt;HSM_RP_ELEMENT&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xAC1C;&amp;#xBCC4; &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130; &amp;#xC694;&amp;#xC18C;&amp;#xC758; type, size, offset&amp;#xC744; &amp;#xC815;&amp;#xC758;&amp;#xD558;&amp;#xBA70;, &lt;code&gt;HSM_RP_ELEMENT_TYPE&lt;/code&gt; &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xC720;&amp;#xD615;&amp;#xC744; &amp;#xAD6C;&amp;#xBD84;&amp;#xD558;&amp;#xB294; &amp;#xC591;&amp;#xC0C1;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-1-Root-Cause-Analysis&#34;&gt;&lt;a href=&#34;#2-1-Root-Cause-Analysis&#34; class=&#34;headerlink&#34; title=&#34;2.1 Root Cause Analysis&#34;&gt;&lt;/a&gt;2.1 Root Cause Analysis&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image5.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &lt;code&gt;HsmFltPostCREATE&lt;/code&gt; &amp;#xCF5C;&amp;#xBC31;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB418;&amp;#xC5B4; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; Reparse Point&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD560; &amp;#xB54C;,  &lt;code&gt;HsmFltPostCREATE&lt;/code&gt; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xC11C; Reparse Point&amp;#xC5D0; &amp;#xB2F4;&amp;#xAE34; bitmap &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xCC98;&amp;#xB9AC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xD638;&amp;#xCD9C;&amp;#xB418;&amp;#xB294; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;bitmap_size&lt;/code&gt;&amp;#xB294; User-Mode &amp;#xC694;&amp;#xCCAD; &amp;#xBC84;&amp;#xD37C;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77D;&amp;#xC5B4;&amp;#xC628; &amp;#xAC12;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;li&gt;&amp;#xD06C;&amp;#xAE30; 0x1000&amp;#xC73C;&amp;#xB85C; &amp;#xACE0;&amp;#xC815; &amp;#xD560;&amp;#xB2F9;&amp;#xD55C; &amp;#xBC84;&amp;#xD37C; &lt;code&gt;ExAllocatePoolWithTag&lt;/code&gt;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;, &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790;&amp;#xAC00; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD55C; &lt;code&gt;bitmap_size&lt;/code&gt;&amp;#xB97C; &amp;#xACBD;&amp;#xACC4; &amp;#xAC80;&amp;#xC0AC; &amp;#xC5C6;&amp;#xC774; &amp;#xADF8;&amp;#xB300;&amp;#xB85C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xC804;&amp;#xB2EC;&amp;#xD558;&amp;#xC5EC; &amp;#xBCF5;&amp;#xC0AC;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xB9CC;&amp;#xC57D; &lt;code&gt;bitmap_size&lt;/code&gt; &amp;gt; 0x1000&amp;#xC778; &amp;#xACBD;&amp;#xC6B0;, Heap-based Buffer Overflow&amp;#xAC00; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD558;&amp;#xAC8C; &amp;#xB420; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xC608;&amp;#xC0C1;&amp;#xD574;&amp;#xBCFC; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image6.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;HsmpBitmapIsReparseBufferSupported()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;hdr-&amp;gt;elements[4].elemSize&lt;/code&gt; &amp;#xAC12;&amp;#xC774; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD06C;&amp;#xBA74; &amp;#xC624;&amp;#xB958;&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image7.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAE08; &amp;#xB354; &amp;#xC704;&amp;#xB85C; &amp;#xC62C;&amp;#xB77C;&amp;#xAC00;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBB38; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &lt;code&gt;hdr-&amp;gt;elements[2]&lt;/code&gt;&amp;#xB97C; &amp;#xC5C4;&amp;#xACA9;&amp;#xD558;&amp;#xAC8C; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xACE0; &amp;#xC788;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &lt;code&gt;total &amp;#x2265; 0x18&lt;/code&gt;, &lt;code&gt;hdr&amp;#x2192;elemCount&lt;/code&gt; &amp;#xB4F1;&amp;#xC758; &amp;#xACBD;&amp;#xACC4; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xBAA8;&amp;#xB450; &amp;#xD1B5;&amp;#xACFC;&amp;#xD574;&amp;#xC57C; &amp;#xC9C4;&amp;#xD589;&amp;#xC774; &amp;#xB418;&amp;#xB294;&amp;#xAD70;&amp;#xC694;.. &amp;#xC774; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xC9C0; &amp;#xBABB;&amp;#xD558;&amp;#xBA74; fail&amp;#xC744; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xACA0;&amp;#xC8E0;?&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image8.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xADF8;&amp;#xB7F0;&amp;#xB370; &amp;#xB3D9;&amp;#xC77C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &lt;code&gt;hasBuf&lt;/code&gt;&amp;#xAC00; false&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xB418;&amp;#xC5B4; &amp;#xC788;&amp;#xC73C;&amp;#xBA74;, &amp;#xBCC4;&amp;#xB3C4;&amp;#xC758; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xAE38;&amp;#xC774; &amp;#xAC80;&amp;#xC0AC;&amp;#xB97C; &amp;#xC218;&amp;#xD589;&amp;#xD558;&amp;#xC9C0; &amp;#xC54A;&amp;#xACE0; &lt;code&gt;element[1]&lt;/code&gt;&amp;#xC758; 1&amp;#xBC14;&amp;#xC774;&amp;#xD2B8; &amp;#xD50C;&amp;#xB798;&amp;#xADF8;&amp;#xB9CC; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xB3C4; result = 0&amp;#xC73C;&amp;#xB85C; success&amp;#xB97C; &amp;#xBC18;&amp;#xD658;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xAC00; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5;&amp;#xC758; &amp;#xAE38;&amp;#xC774;&amp;#xAC00; 0x1000&amp;#xBCF4;&amp;#xB2E4; &amp;#xD070;&amp;#xC9C0; &amp;#xAC80;&amp;#xC0AC;&amp;#xAC00; &amp;#xC218;&amp;#xD589;&amp;#xB418;&amp;#xC9C0; &amp;#xC54A;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0;, &amp;#xAC80;&amp;#xC99D;&amp;#xC774; &amp;#xAC74;&amp;#xB108;&amp;#xB6F0;&amp;#xC5B4;&amp;#xC9C0;&amp;#xBA74;&amp;#xC11C; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC720;&amp;#xD6A8;&amp;#xD55C; &amp;#xAC83;&amp;#xC73C;&amp;#xB85C; &amp;#xCC98;&amp;#xB9AC;&amp;#xB418;&amp;#xC5B4; &amp;#xBC84;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;h2 id=&#34;2-2-Exploit&#34;&gt;&lt;a href=&#34;#2-2-Exploit&#34; class=&#34;headerlink&#34; title=&#34;2.2 Exploit&#34;&gt;&lt;/a&gt;2.2 Exploit&lt;/h2&gt;&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image9.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;cldflt.sys &amp;#xBBF8;&amp;#xB2C8;&amp;#xD544;&amp;#xD130; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; &amp;#xAE30;&amp;#xBCF8;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xBAA8;&amp;#xB4E0; &amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C; I/O&amp;#xB97C; &amp;#xD6D1;&amp;#xB294;&amp;#xAC8C; &amp;#xC544;&amp;#xB2C8;&amp;#xB77C;, CfAPI&amp;#xB97C; &amp;#xD1B5;&amp;#xD55C; Sync Root &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xB300;&amp;#xD574;&amp;#xC11C;&amp;#xB9CC; &amp;#xB3D9;&amp;#xC791;&amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xB530;&amp;#xB77C;&amp;#xC11C; &amp;#xBA3C;&amp;#xC800; &lt;code&gt;CfRegisterSyncRoot()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; &amp;#xB3D9;&amp;#xAE30;&amp;#xD654; &amp;#xD3F4;&amp;#xB354;&amp;#xC758; Root &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xBCF4;&amp;#xC558;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image10.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;Sync Root&amp;#xB97C; &amp;#xB4F1;&amp;#xB85D;&amp;#xD558;&amp;#xB294; &amp;#xCF54;&amp;#xB4DC;&amp;#xB97C; &amp;#xC6B0;&amp;#xC120; &amp;#xBE4C;&amp;#xB4DC;&amp;#xD558;&amp;#xACE0; &amp;#xC2E4;&amp;#xD589;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xC774;&amp;#xB7F0; &amp;#xD3F4;&amp;#xB354;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE30;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774; &amp;#xD3F4;&amp;#xB354; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0;&amp;#xB294; &amp;#xD074;&amp;#xB77C;&amp;#xC6B0;&amp;#xB4DC; Stub File, &amp;#xBA54;&amp;#xD0C0;&amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xAC00; &amp;#xC0DD;&amp;#xAE38; &amp;#xC218; &amp;#xC788;&amp;#xACE0;, &amp;#xC81C;&amp;#xAC00; &amp;#xC774;&amp;#xAC78; &amp;#xC545;&amp;#xC6A9;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294; &amp;#xC9C0;&amp;#xC810;&amp;#xC774; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;-&amp;gt; HsmFltPostCREATE()
-&amp;gt; HsmiFltPostECPCREATE()
-&amp;gt; HsmpSetupContexts()
-&amp;gt; HsmpCtxCreateStreamContext()
-&amp;gt; HsmIBitmapNORMALOpen()&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&amp;#xB3D9;&amp;#xC801; &amp;#xBD84;&amp;#xC11D;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xD655;&amp;#xC778;&amp;#xD574;&amp;#xBCF8; &amp;#xACB0;&amp;#xACFC;, &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xD568;&amp;#xC218;&amp;#xC778; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB824;&amp;#xBA74; &amp;#xC704;&amp;#xC640; &amp;#xAC19;&amp;#xC740; &amp;#xD568;&amp;#xC218; &amp;#xCCB4;&amp;#xC778;&amp;#xC744; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xC870;&amp;#xAC74;&amp;#xBB38;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCDA9;&amp;#xC871;&amp;#xD574;&amp;#xC57C; &amp;#xC9C4;&amp;#xC785;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC74C;&amp;#xC744; &amp;#xC54C;&amp;#xAC8C; &amp;#xB418;&amp;#xC5C8;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xC81C; &amp;#xC800;&amp;#xC758; &amp;#xBAA9;&amp;#xD45C;&amp;#xB294; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xBAA8;&amp;#xB450; &amp;#xCDA9;&amp;#xC871;&amp;#xD574;&amp;#xC11C; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xD568;&amp;#xC218;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &lt;code&gt;memmove&lt;/code&gt;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Minifilter Driver&amp;#xB85C;&amp;#xC11C;&amp;#xC758; &amp;#xD750;&amp;#xB984; &amp;#xC774;&amp;#xD574;&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;#xC55E;&amp;#xC11C; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB294; I/O &amp;#xC694;&amp;#xCCAD;&amp;#xC774; &amp;#xBC1C;&amp;#xC0DD;&amp;#xD588;&amp;#xC744; &amp;#xB54C; IRP &amp;#xCF54;&amp;#xB4DC;&amp;#xBCC4;&amp;#xB85C; Callback&amp;#xC744; &amp;#xD638;&amp;#xCD9C;&amp;#xD55C;&amp;#xB2E4;&amp;#xACE0; &amp;#xD588;&amp;#xC8E0;? &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xACBD;&amp;#xB85C;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &lt;code&gt;IRP_MJ_CREATE&lt;/code&gt;&amp;#xC758; &lt;code&gt;Post-Create Callback&lt;/code&gt;(&lt;code&gt;HsmFltPostCREATE&lt;/code&gt;)&amp;#xB97C; &amp;#xC2DC;&amp;#xC791;&amp;#xC73C;&amp;#xB85C; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; &amp;#xD568;&amp;#xC218;&amp;#xC5D0; &amp;#xB3C4;&amp;#xB2EC;&amp;#xD574;&amp;#xC57C; &amp;#xD569;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774; &amp;#xC911;&amp;#xAC04; &amp;#xD568;&amp;#xC218;&amp;#xB4E4;&amp;#xC740; &amp;#xD30C;&amp;#xC77C;/&amp;#xC2A4;&amp;#xD2B8;&amp;#xB9BC; &amp;#xC18D;&amp;#xC131;&amp;#xACFC; Reparse Point &amp;#xC815;&amp;#xBCF4;&amp;#xB97C; &amp;#xAE30;&amp;#xBC18;&amp;#xC73C;&amp;#xB85C; &amp;#xC9C4;&amp;#xC785; &amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xAC80;&amp;#xC99D;&amp;#xD558;&amp;#xBBC0;&amp;#xB85C;, &amp;#xC800;&amp;#xD76C;&amp;#xB294; &amp;#xC774;&amp;#xB97C; &amp;#xC6B0;&amp;#xD68C;&amp;#xD558;&amp;#xB294; &amp;#xD2B9;&amp;#xC218;&amp;#xD55C; &amp;#xD30C;&amp;#xC77C; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xB9CC;&amp;#xB4E4;&amp;#xBA74; &amp;#xB418;&amp;#xB294; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&lt;code&gt;MakeDataBuffer()&lt;/code&gt;&amp;#xB85C; &lt;code&gt;IO_REPARSE_TAG_CLOUD&lt;/code&gt; &amp;#xAD6C;&amp;#xC870; &amp;#xC0DD;&amp;#xC131; &amp;#x2192; Minifilter&amp;#xAC00; &amp;#xD574;&amp;#xB2F9; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; Cloud Stub File&amp;#xB85C; &amp;#xC778;&amp;#xC2DD;&amp;#xD574; Reparse Point &amp;#xD30C;&amp;#xC2F1; &amp;#xB85C;&amp;#xC9C1; &amp;#xC9C4;&amp;#xC785;.&lt;/li&gt;
&lt;li&gt;Item Tag = &lt;code&gt;0x11&lt;/code&gt;(Bitmap) &amp;#x2192; &lt;code&gt;Size&lt;/code&gt;&amp;#xB97C; &lt;code&gt;0x1000 + overSize&lt;/code&gt;&amp;#xB85C; &amp;#xC124;&amp;#xC815;&amp;#xD574; &lt;code&gt;memmove()&lt;/code&gt;&amp;#xC5D0;&amp;#xC11C; &amp;#xD560;&amp;#xB2F9; &amp;#xD06C;&amp;#xAE30;&amp;#xB97C; &amp;#xCD08;&amp;#xACFC;&amp;#xD55C; &amp;#xBCF5;&amp;#xC0AC;(Heap Overflow) &amp;#xC720;&amp;#xBC1C;. &amp;#xB2E4;&amp;#xB978; &amp;#xC694;&amp;#xC18C;&amp;#xB4E4;(Tag &lt;code&gt;0x7&lt;/code&gt;, &lt;code&gt;0x6&lt;/code&gt;, &lt;code&gt;0xA&lt;/code&gt; &amp;#xB4F1;)&amp;#xB3C4; Minifilter&amp;#xC758; &amp;#xACBD;&amp;#xACC4; &amp;#xCCB4;&amp;#xD06C;&amp;#xB97C; &amp;#xD1B5;&amp;#xACFC;&amp;#xD558;&amp;#xB3C4;&amp;#xB85D; &amp;#xAC12; &amp;#xC124;&amp;#xC815;.&lt;/li&gt;
&lt;li&gt;Overflow &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xC5D0; Fake &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; &amp;#xD3EC;&amp;#xD568; &amp;#x2192; &lt;code&gt;FSCTL_SET_REPARSE_POINT&lt;/code&gt;&amp;#xB85C; &amp;#xC801;&amp;#xC6A9; &amp;#xD6C4; &lt;code&gt;CreateFile()&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xC9C4;&amp;#xC785;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image11.png&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xC870;&amp;#xAC74;&amp;#xC744; &amp;#xCDA9;&amp;#xC871;&amp;#xD558;&amp;#xBA74; FltMgr&amp;#xB85C;&amp;#xBD80;&amp;#xD130; &amp;#xC2DC;&amp;#xC791;&amp;#xD574; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt;&amp;#xC5D0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xB294; &amp;#xAC83;&amp;#xC744; &amp;#xD655;&amp;#xC778;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;p&gt;Exploit &amp;#xACFC;&amp;#xC815;&amp;#xC744; &amp;#xC804;&amp;#xBD80; &amp;#xB2F4;&amp;#xACE0;&amp;#xC2F6;&amp;#xC9C0;&amp;#xB9CC; &amp;#xC624;&amp;#xB298;&amp;#xC740; Minifilter &amp;#xC124;&amp;#xBA85; &amp;#xAE00;&amp;#xC774;&amp;#xACE0; &amp;#xBC8C;&amp;#xC368; &amp;#xBD84;&amp;#xB7C9; &amp;#xC870;&amp;#xC808;&amp;#xC5D0; &amp;#xC2E4;&amp;#xD328;&amp;#xD574;&amp;#xBC84;&amp;#xB9B0; &amp;#xAC83; &amp;#xAC19;&amp;#xC73C;&amp;#xB2C8;.. &amp;#xC804;&amp;#xCCB4; exploit &amp;#xC2DC;&amp;#xB098;&amp;#xB9AC;&amp;#xC624;&amp;#xB97C; &amp;#xD55C;&amp;#xBC88; &amp;#xC694;&amp;#xC57D;&amp;#xD574;&amp;#xBCF4;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image12.png&#34; alt&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Proof of Concept Overview&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;ol&gt;
&lt;li&gt;&lt;strong&gt;EPROCESS &amp;#xAD6C;&amp;#xC870; &amp;#xBD84;&amp;#xC11D; &amp;#xBC0F; Token &amp;#xD544;&amp;#xB4DC; Offset &amp;#xACC4;&amp;#xC0B0;&lt;/strong&gt;&lt;br&gt;EPROCESS &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0;&amp;#xC11C; Token &amp;#xD544;&amp;#xB4DC;&amp;#xC758; &amp;#xC624;&amp;#xD504;&amp;#xC14B;&amp;#xC744; &amp;#xACC4;&amp;#xC0B0;&amp;#xD574; &amp;#xC774;&amp;#xD6C4; SYSTEM Token swap &amp;#xC900;&amp;#xBE44;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; Spray &amp;#xBC0F; Hole &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;br&gt;0x1000 &amp;#xD06C;&amp;#xAE30;(0xff0 &amp;#xB370;&amp;#xC774;&amp;#xD130;)&amp;#xC758; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; &amp;#xC624;&amp;#xBE0C;&amp;#xC81D;&amp;#xD2B8;&amp;#xB97C; &amp;#xB300;&amp;#xB7C9;&amp;#xC73C;&amp;#xB85C; &amp;#xC0DD;&amp;#xC131;(spray)&amp;#xD558;&amp;#xACE0;, &amp;#xD574;&amp;#xC81C;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xD799;&amp;#xC5D0; Heap Hole &amp;#xC0DD;&amp;#xC131;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C; &amp;#xC624;&amp;#xD508; &amp;#xBC0F; &amp;#xCCAB; &amp;#xBC88;&amp;#xC9F8; Overflow &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&lt;/strong&gt;&lt;br&gt;&lt;code&gt;CfRegisterSyncRoot()&lt;/code&gt;&amp;#xC640; Reparse Point &amp;#xB514;&amp;#xB809;&amp;#xD130;&amp;#xB9AC; &amp;#xC870;&amp;#xC791;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; Sync Root &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; &amp;#xCDE8;&amp;#xC57D;&amp;#xD55C; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC900;&amp;#xBE44;. &amp;#xC774;&amp;#xD6C4; &lt;code&gt;CreateFile()&lt;/code&gt;&amp;#xB85C; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; &lt;code&gt;IRP_MJ_CREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmFltPostCREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmiFltPostECPCREATE()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmpSetupContexts()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmpCtxCreateStreamContext()&lt;/code&gt; &amp;#x2192; &lt;code&gt;HsmIBitmapNORMALOpen()&lt;/code&gt; &amp;#xACBD;&amp;#xB85C;&amp;#xAE4C;&amp;#xC9C0; &amp;#xC9C4;&amp;#xC785;&amp;#xD558;&amp;#xACE0;, Heap Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xC778;&amp;#xC811;&amp;#xD55C; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xC758; DataSize&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD574; OOB R/W&amp;#xB97C; &amp;#xD655;&amp;#xBCF4;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xCEE4;&amp;#xB110; &amp;#xD3EC;&amp;#xC778;&amp;#xD130; Leak&lt;/strong&gt;&lt;br&gt;&amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; &lt;code&gt;_KALPC_RESERVE&lt;/code&gt; **&amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC77D;&amp;#xC5B4; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; Leak.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt; Spray &amp;#xBC0F; Hole &amp;#xC0DD;&amp;#xC131;&lt;/strong&gt;&lt;br&gt;&amp;#xB2E4;&amp;#xC2DC; &amp;#xB3D9;&amp;#xC77C; &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &lt;code&gt;WNF_STATE_DATA&lt;/code&gt;&amp;#xB97C; Spray&amp;#xD558;&amp;#xACE0; &amp;#xD574;&amp;#xC81C;&amp;#xD574; Hole&amp;#xC744; &amp;#xB9CC;&amp;#xB4E0; &amp;#xD6C4;, &amp;#xC774;&amp;#xBC88;&amp;#xC5D0;&amp;#xB294; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xC640; &amp;#xC778;&amp;#xC811;&amp;#xD55C; &amp;#xC601;&amp;#xC5ED;&amp;#xC5D0; WNF &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xBC30;&amp;#xCE58;&amp;#xB418;&amp;#xB3C4;&amp;#xB85D; &amp;#xAD6C;&amp;#xC131;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; Overflow&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xC870;&amp;#xC791;&lt;/strong&gt;&lt;br&gt;&amp;#xB450; &amp;#xBC88;&amp;#xC9F8; &amp;#xBE44;&amp;#xD2B8;&amp;#xB9F5; &amp;#xD30C;&amp;#xC77C;&amp;#xC744; &amp;#xC5F4;&amp;#xC5B4; Heap Overflow&amp;#xB97C; &amp;#xBC1C;&amp;#xC0DD;&amp;#xC2DC;&amp;#xD0A4;&amp;#xACE0;, &amp;#xC778;&amp;#xC811;&amp;#xD55C; &lt;code&gt;PipeAttribute&lt;/code&gt;&amp;#xC758; &lt;code&gt;Flink&lt;/code&gt; &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xC0AC;&amp;#xC6A9;&amp;#xC790; &amp;#xACF5;&amp;#xAC04; Fake &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xB36E;&amp;#xC74C;.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Arbitrary Read &amp;#xAD6C;&amp;#xC131; &amp;#xBC0F; EPROCESS/Token &amp;#xC8FC;&amp;#xC18C; &amp;#xD68D;&amp;#xB4DD;&lt;/strong&gt;&lt;br&gt;Fake &lt;code&gt;PipeAttribute&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; ALPC Port &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xACE0;, &amp;#xC774;&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xB300;&amp;#xC0C1; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; EPROCESS &amp;#xC8FC;&amp;#xC18C;&amp;#xC640; Token &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC21C;&amp;#xCC28;&amp;#xC801;&amp;#xC73C;&amp;#xB85C; read.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Token Swapping &amp;#xBC0F; SYSTEM &amp;#xAD8C;&amp;#xD55C; &amp;#xD68D;&amp;#xB4DD;&lt;/strong&gt;&lt;br&gt;Arbitrary Write&amp;#xB97C; &amp;#xD1B5;&amp;#xD574; &amp;#xD604;&amp;#xC7AC; &amp;#xD504;&amp;#xB85C;&amp;#xC138;&amp;#xC2A4;&amp;#xC758; Token &amp;#xAC12;&amp;#xC744; SYSTEM Token &amp;#xAC12;&amp;#xC73C;&amp;#xB85C; &amp;#xAD50;&amp;#xCCB4;&amp;#xD558;&amp;#xACE0;, SYSTEM &amp;#xAD8C;&amp;#xD55C;&amp;#xC758; &lt;code&gt;cmd.exe&lt;/code&gt;&amp;#xB97C; &amp;#xC2E4;&amp;#xD589;.&lt;/li&gt;
&lt;/ol&gt;
&lt;h3 id=&#34;ALPC-WNF&#34;&gt;&lt;a href=&#34;#ALPC-WNF&#34; class=&#34;headerlink&#34; title=&#34;ALPC/WNF&#34;&gt;&lt;/a&gt;ALPC/WNF&lt;/h3&gt;&lt;p&gt;&lt;code&gt;_WNF_STATE_DATA&lt;/code&gt;&amp;#xC640; &lt;code&gt;_ALPC_HANDLE_TABLE&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Heap Hole&amp;#xC744; &amp;#xC704;&amp;#xD55C; Arbitrary size &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xD560;&amp;#xB2F9;&amp;#xD558;&amp;#xACE0;, &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; leak&amp;#xD558;&amp;#xAC8C; &amp;#xB418;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC544;&amp;#xB9C8;&amp;#xB3C4; ALPC&amp;#xC640; WNF &amp;#xAC1C;&amp;#xB150;&amp;#xC774; &amp;#xC0DD;&amp;#xC18C;&amp;#xD558;&amp;#xC2E4; &amp;#xAC81;&amp;#xB2C8;&amp;#xB2E4;. exploit&amp;#xC744; &amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB450; sub system&amp;#xC744; &amp;#xC124;&amp;#xBA85;&amp;#xD574;&amp;#xBCF4;&amp;#xBA74; &amp;#xB2E4;&amp;#xC74C;&amp;#xACFC; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;ALPC (Asynchronous Local Procedure Call)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image13.webp&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;ALPC&amp;#xB294; Windows &amp;#xCEE4;&amp;#xB110; &amp;#xB0B4;&amp;#xBD80;&amp;#xC758; IPC &amp;#xBA54;&amp;#xCEE4;&amp;#xB2C8;&amp;#xC998;&amp;#xC73C;&amp;#xB85C;, &amp;#xD074;&amp;#xB77C;&amp;#xC774;&amp;#xC5B8;&amp;#xD2B8;&amp;#xC640; &amp;#xC11C;&amp;#xBC84; &amp;#xD3EC;&amp;#xD2B8;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD574; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xB97C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xACE0; &amp;#xC788;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC774;&amp;#xB54C; ALPC&amp;#xC758; HANDLE TABLE&amp;#xC758; &lt;code&gt;_ALPC_HANDLE_ENTRY&lt;/code&gt;&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xBA74; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0; &amp;#xBC84;&amp;#xD37C; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xC800;&amp;#xC7A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xB294;&amp;#xB370;, &amp;#xC774; TABLE&amp;#xC758; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC00;&amp;#xBCC0;&amp;#xC801;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; Arbitrary &amp;#xD06C;&amp;#xAE30;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ALPC &amp;#xD3EC;&amp;#xD2B8; &amp;#xC0DD;&amp;#xC131; &amp;#xC2DC; &lt;code&gt;_ALPC_HANDLE_TABLE&lt;/code&gt;&amp;#xC774; &lt;strong&gt;paged pool&lt;/strong&gt;&amp;#xC5D0; 0x80 &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;code&gt;NtAlpcCreateResourceReserve&lt;/code&gt; &amp;#xD638;&amp;#xCD9C; &amp;#xC2DC;&amp;#xB9C8;&amp;#xB2E4; &lt;code&gt;_KALPC_RESERVE&lt;/code&gt; &amp;#xAC1D;&amp;#xCCB4;&amp;#xAC00; &amp;#xC0DD;&amp;#xC131;&amp;#xB418;&amp;#xACE0; &amp;#xC774; &amp;#xC8FC;&amp;#xC18C;&amp;#xAC00; HANDLE TABLE&amp;#xC5D0; &amp;#xCD94;&amp;#xAC00;&amp;#xB428;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&amp;#xC774; &amp;#xAD6C;&amp;#xC870;&amp;#xB97C; &amp;#xBCC0;&amp;#xC870;&amp;#xD558;&amp;#xBA74; &amp;#xC784;&amp;#xC758; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C; Read/Write primitive &amp;#xAC00;&amp;#xB2A5;&lt;/p&gt;
&lt;p&gt;  &amp;#x2192; PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; fake &lt;code&gt;_KALPC_RESERVE&lt;/code&gt;&amp;#xB97C; &amp;#xC8FC;&amp;#xC785;&amp;#xD574; arbitrary R/W &amp;#xB2EC;&amp;#xC131;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&lt;p&gt;ALPC HANDLE&amp;#xC740; User-Mode&amp;#xC5D0;&amp;#xC11C;&amp;#xB3C4; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5; &amp;#x2192; exploit&amp;#xC5D0; &amp;#xC6A9;&amp;#xC774;&amp;#xD574;&amp;#xC9D0;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;WNF (Windows Notification Facility)&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image14.webp&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;WNF&amp;#xB294; Windows&amp;#xC758; &amp;#xC54C;&amp;#xB9BC; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC778;&amp;#xB370;&amp;#xC694;. WNF_NAME_INSTANCE &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4;&amp;#xB294; &amp;#xB0B4;&amp;#xBD80;&amp;#xC5D0; _WNF_STATE_DATA&amp;#xB77C;&amp;#xB294; &amp;#xD544;&amp;#xB4DC;&amp;#xB97C; &amp;#xAC00;&amp;#xC9C0;&amp;#xB294;&amp;#xB370; &amp;#xC774; &amp;#xD06C;&amp;#xAE30;&amp;#xB294; &amp;#xAC00;&amp;#xBCC0;&amp;#xC801;&amp;#xC774;&amp;#xAE30; &amp;#xB54C;&amp;#xBB38;&amp;#xC5D0; User-Mode&amp;#xC5D0;&amp;#xC11C; &lt;code&gt;NtCreateWnfStateName&lt;/code&gt; + &lt;code&gt;NtUpdateWnfStateData&lt;/code&gt;&amp;#xB85C; &amp;#xC9C1;&amp;#xC811; &amp;#xCEE4;&amp;#xB110; &amp;#xAC1D;&amp;#xCCB4; &amp;#xD06C;&amp;#xAE30; &amp;#xC81C;&amp;#xC5B4; &amp;#xAC00;&amp;#xB2A5;&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;code&gt;_WNF_STATE_DATA&lt;/code&gt;&amp;#xB294; 0x1000 &amp;#xD06C;&amp;#xAE30;&amp;#xB85C; &amp;#xD560;&amp;#xB2F9; &amp;#xAC00;&amp;#xB2A5; (0x10 header + 0xFF0 data)&lt;/li&gt;
&lt;li&gt;heap spraying &amp;#xC6A9;&amp;#xB3C4;&amp;#xB85C; WNF &amp;#xAC1D;&amp;#xCCB4;&amp;#xB97C; &amp;#xB2E4;&amp;#xB7C9; &amp;#xC0DD;&amp;#xC131;&amp;#xD574;, &amp;#xBAA9;&amp;#xD45C; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;(ALPC &amp;#xAC1D;&amp;#xCCB4;)&amp;#xC640; &amp;#xC778;&amp;#xC811;&amp;#xD558;&amp;#xAC8C; &amp;#xBC30;&amp;#xCE58;&lt;/li&gt;
&lt;li&gt;PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; WNF&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; heap hole&amp;#xC744; &amp;#xB9CC;&amp;#xB4E4;&amp;#xACE0; ALPC &amp;#xAC1D;&amp;#xCCB4; &amp;#xC778;&amp;#xC811;&amp;#xC5D0; &amp;#xBC30;&amp;#xCE58;&amp;#xD558;&amp;#xC5EC; ALPC HANDLE TABLE&amp;#xC5D0; Overflow &amp;#xC720;&amp;#xB3C4;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#xD2B9;&amp;#xD788; PoC&amp;#xC5D0;&amp;#xC11C;&amp;#xB294; Pipe&amp;#xB97C; &amp;#xC0DD;&amp;#xC131;&amp;#xD558;&amp;#xB294; &amp;#xB8E8;&amp;#xD2F4;&amp;#xC744; &amp;#xB4F1;&amp;#xB85D;&amp;#xD574;&amp;#xC57C; &amp;#xD588;&amp;#xB294;&amp;#xB370;, &amp;#xC800;&amp;#xB294; &amp;#xC774; &amp;#xBD80;&amp;#xBD84;&amp;#xC774; &amp;#xD765;&amp;#xBBF8;&amp;#xB85C;&amp;#xC6E0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;.&lt;/p&gt;
&lt;pre&gt;&lt;code class=&#34;hljs c&#34;&gt;&lt;span class=&#34;hljs-class&#34;&gt;&lt;span class=&#34;hljs-keyword&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;hljs-title&#34;&gt;PipeAttribute&lt;/span&gt; {&lt;/span&gt; 
    LIST_ENTRY &lt;span class=&#34;hljs-built_in&#34;&gt;list&lt;/span&gt;; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; * AttributeName; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;uint64_t&lt;/span&gt; AttributeValueSize; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; * AttributeValue; 
    &lt;span class=&#34;hljs-keyword&#34;&gt;char&lt;/span&gt; data[&lt;span class=&#34;hljs-number&#34;&gt;0&lt;/span&gt;];
}&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Pipe&amp;#xB294; &amp;#xBCC0;&amp;#xC870;&amp;#xB41C; &lt;code&gt;PipeAttribute&lt;/code&gt; &amp;#xAD6C;&amp;#xC870;&amp;#xCCB4;&amp;#xC758; Value &amp;#xD3EC;&amp;#xC778;&amp;#xD130;&amp;#xB97C; &amp;#xCEE4;&amp;#xB110; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC8FC;&amp;#xC18C;&amp;#xB85C; &amp;#xC138;&amp;#xD305;&amp;#xD574; &amp;#xCEE4;&amp;#xB110;&amp;#xC774; &amp;#xD574;&amp;#xB2F9; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; &amp;#xCC38;&amp;#xC870;&amp;#xD574; &amp;#xC77D;&amp;#xC740; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xB97C; User-Mode &amp;#xACF5;&amp;#xAC04;&amp;#xC5D0; &amp;#xBC18;&amp;#xD658;&amp;#xD574;&amp;#xC904; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xD574;&amp;#xC8FC;&amp;#xB294;&amp;#xB370;&amp;#xC694;. &amp;#xC774;&amp;#xB85C;&amp;#xC368; ALPC&amp;#xB85C; &amp;#xD655;&amp;#xBCF4;&amp;#xD55C; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xB808;&amp;#xC774;&amp;#xC544;&amp;#xC6C3;&amp;#xACFC; WNF Overflow &amp;#xC870;&amp;#xD569;&amp;#xC744; &amp;#xC774;&amp;#xC6A9;&amp;#xD574; Pipe&amp;#xB97C; Arbitrary Read primitive&amp;#xB85C; &amp;#xC804;&amp;#xD658;&amp;#xD574; &amp;#xCEE4;&amp;#xB110; &amp;#xC8FC;&amp;#xC18C;&amp;#xB97C; leak&amp;#xD560; &amp;#xC218; &amp;#xC788;&amp;#xAC8C; &amp;#xB429;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h2 id=&#34;3-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;a href=&#34;#3-&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34; class=&#34;headerlink&#34; title=&#34;3. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&#34;&gt;&lt;/a&gt;3. &amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&lt;/h2&gt;&lt;hr&gt;
&lt;p&gt;&lt;img src=&#34;/2025/08/15/banda/Minifilter-Driver/ko/image15.gif&#34; alt&gt;&lt;/p&gt;
&lt;p&gt;&amp;#xB9C8;&amp;#xBB34;&amp;#xB9AC;&amp;#xB294; &amp;#xC81C;&amp;#xAC00; &lt;code&gt;cldflt.sys&lt;/code&gt;&amp;#xC758; Minifilter &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84; &amp;#xD2B9;&amp;#xC131;, &amp;#xADF8;&amp;#xB9AC;&amp;#xACE0; WNF + ALPC &amp;#xAE30;&amp;#xBC95;&amp;#xC744; &amp;#xD1B5;&amp;#xD574; &amp;#xAD6C;&amp;#xD604;&amp;#xD55C; LPE &amp;#xACB0;&amp;#xACFC;&amp;#xB97C; &amp;#xBCF4;&amp;#xC5EC;&amp;#xB4DC;&amp;#xB9AC;&amp;#xBA70; &amp;#xB05D;&amp;#xB0B4;&amp;#xB3C4;&amp;#xB85D; &amp;#xD558;&amp;#xACA0;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;. Minifilter&amp;#xC744; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xBA74;&amp;#xC11C; &amp;#xB290;&amp;#xB080; &amp;#xC810;&amp;#xC740;.. &amp;#xB3D9;&amp;#xC791; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB098; &amp;#xD568;&amp;#xC218;, &amp;#xAC1C;&amp;#xB150; &amp;#xC790;&amp;#xCCB4;&amp;#xB294; &amp;#xC870;&amp;#xAE08; &amp;#xC0DD;&amp;#xC18C;&amp;#xD560; &amp;#xC218;&amp;#xB3C4; &amp;#xC788;&amp;#xC9C0;&amp;#xB9CC;, &amp;#xACB0;&amp;#xAD6D;&amp;#xC5D0; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC774; &amp;#xD2B8;&amp;#xB9AC;&amp;#xAC70;&amp;#xB418;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC774;&amp;#xB098; &amp;#xB8E8;&amp;#xD2B8; &amp;#xCEE4;&amp;#xC988; &amp;#xC6D0;&amp;#xB9AC;&amp;#xB294; &amp;#xBE44;&amp;#xC2B7;&amp;#xBE44;&amp;#xC2B7;&amp;#xD558;&amp;#xB2E4;&amp;#xB294; &amp;#xC0DD;&amp;#xAC01;&amp;#xC774; &amp;#xB4E4;&amp;#xC5C8;&amp;#xB124;&amp;#xC694;&amp;#x2026; &amp;#xADF8;&amp;#xB7EC;&amp;#xB2C8; Minifilter &amp;#xC9C4;&amp;#xC785;&amp;#xC5D0; &amp;#xB108;&amp;#xBB34; &amp;#xAC81; &amp;#xBA39;&amp;#xC9C0; &amp;#xC54A;&amp;#xC73C;&amp;#xC154;&amp;#xB3C4; &amp;#xB420; &amp;#xAC83; &amp;#xAC19;&amp;#xC2B5;&amp;#xB2C8;&amp;#xB2E4;!!&lt;/p&gt;
&lt;p&gt;&amp;#xB2E4;&amp;#xC74C;&amp;#xC5D0;&amp;#xB3C4; &amp;#xAE30;&amp;#xD68C;&amp;#xAC00; &amp;#xB41C;&amp;#xB2E4;&amp;#xBA74; &amp;#xC544;&amp;#xC9C1; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xC9C0; &amp;#xC54A;&amp;#xC740; &amp;#xB2E4;&amp;#xC591;&amp;#xD55C; &amp;#xB4DC;&amp;#xB77C;&amp;#xC774;&amp;#xBC84;&amp;#xB97C; &amp;#xACF5;&amp;#xBD80;&amp;#xD574;&amp;#xBCF4;&amp;#xACE0; &amp;#xC2F6;&amp;#xB124;&amp;#xC694;.. &amp;#xB2E4;&amp;#xC74C; &amp;#xAE00;&amp;#xB3C4; &amp;#xB9CE;&amp;#xC740; &amp;#xAE30;&amp;#xB300; &amp;#xBD80;&amp;#xD0C1;&amp;#xB4DC;&amp;#xB9BD;&amp;#xB2C8;&amp;#xB2E4;!&lt;/p&gt;
&lt;h1 id=&#34;Reference&#34;&gt;&lt;a href=&#34;#Reference&#34; class=&#34;headerlink&#34; title=&#34;Reference&#34;&gt;&lt;/a&gt;&lt;strong&gt;Reference&lt;/strong&gt;&lt;/h1&gt;&lt;hr&gt;
&lt;p&gt;&lt;a href=&#34;https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/&#34;&gt;https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts&#34;&gt;https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/&#34;&gt;https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/&#34;&gt;https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;amp;utm_campaign=post&amp;amp;utm_medium=web&amp;amp;triedRedirect=true&#34;&gt;https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;amp;utm_campaign=post&amp;amp;utm_medium=web&amp;amp;triedRedirect=true&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href=&#34;https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6&#34;&gt;https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6&lt;/a&gt;&lt;/p&gt;
 - hack &amp; life">
  <meta property="og:image" content="https://hackyboiz.github.io/2025/08/15/banda/Minifilter-Driver/ko/minifilter.png">
  <meta property="og:url" content="https://hackyboiz.github.io/">

  <link rel="canonical" href="https://hackyboiz.github.io/2025/08/15/banda/minifilter-driver/ko/">

  <title>[Research]  Windows Minifilter Driver (KR) - hackyboiz</title>

  <link rel="stylesheet" href="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/css/bootstrap.min.css">


  <link rel="stylesheet" href="https://cdn.staticfile.org/github-markdown-css/4.0.0/github-markdown.min.css">
  <link rel="stylesheet" href="/lib/hint/hint.min.css">

  
    
    <link rel="stylesheet" href="https://cdn.staticfile.org/highlight.js/10.0.0/styles/github-gist.min.css">
  

  


<!--  -->

<link rel="stylesheet" href="//at.alicdn.com/t/font_1749284_6peoq002giu.css">
<link rel="stylesheet" href="/.css">



<link rel="stylesheet" href="//at.alicdn.com/t/font_1736178_pjno9b9zyxs.css">
<link rel="stylesheet" href="/.css">


<link rel="stylesheet" href="/css/main.css">

<!--  -->


  <script src="/js/utils.js"></script>
  <script src="/js/color-schema.js"></script>

<meta name="generator" content="Hexo 5.1.1"><link rel="alternate" href="/rss2.xml" title="hackyboiz" type="application/rss+xml">
</head>


<body>
  <header style="height: 40vh;">
    <nav id="navbar" class="navbar fixed-top  navbar-expand-lg navbar-dark scrolling-navbar">
  <div class="container">
    <a class="navbar-brand" href="/">&nbsp;<strong>Hackyboiz</strong>&nbsp;</a>

    <button id="navbar-toggler-btn" class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
      <div class="animated-icon"><span></span><span></span><span></span></div>
    </button>

    <!-- Collapsible content -->
    <div class="collapse navbar-collapse" id="navbarSupportedContent">
      <ul class="navbar-nav ml-auto text-center">
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/">
                <i class="iconfont icon-home-fill"></i>
                Home
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/archives/">
                <i class="iconfont icon-archive-fill"></i>
                Archives
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/categories/">
                <i class="iconfont icon-category-fill"></i>
                Categories
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/tags/">
                <i class="iconfont icon-tags-fill"></i>
                Tags
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/about/">
                <i class="iconfont icon-addrcard"></i>
                About
              </a>
            </li>
          
        
          
          
          
          
            <li class="nav-item">
              <a class="nav-link" href="/author/">
                <i class="iconfont icon-user-fill"></i>
                Author
              </a>
            </li>
          
        
        
          <li class="nav-item" id="search-btn">
            <a class="nav-link" data-toggle="modal" data-target="#modalSearch">&nbsp;<i class="iconfont icon-search"></i>&nbsp;</a>
          </li>
        
        
          <li class="nav-item" id="color-toggle-btn">
            <a class="nav-link" href="javascript:">&nbsp;<i class="iconfont icon-dark" id="color-toggle-icon"></i>&nbsp;</a>
          </li>
        
      </ul>
    </div>
  </div>
</nav>

    <div class="banner intro-2" id="background" parallax="true" style="background: url('/img/default.png') no-repeat center center;
           background-size: cover;">
      <div class="full-bg-img">
        <div class="mask flex-center" style="background-color: rgba(0, 0, 0, 0.3)">
          <div class="container page-header text-center fade-in-up">
            <span class="h2" id="subtitle">
              
            </span>

            
              
  <div class="mt-3 post-meta">
    <i class="iconfont icon-date-fill" aria-hidden="true"></i>
    <time datetime="2025-08-15 17:00" pubdate>
      2025 8 15 
    </time>
  </div>


<div class="mt-1">
  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-chart"></i>
      5.4k 
    </span>
  

  
    
    <span class="post-meta mr-2">
      <i class="iconfont icon-clock-fill"></i>
      
      
      107
       
    </span>
  

  
  
</div>

            
          </div>

          
        </div>
      </div>
    </div>
  </header>

  <main>
    
      

<div class="container-fluid">
  <div class="row">
    <div class="d-none d-lg-block col-lg-2">
      <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
    </div>
    <div class="col-lg-8 nopadding-md">
      <div class="container nopadding-md" id="board-ctn">
        <div class="py-5" id="board">
          <article class="post-content mx-auto" id="post">
            <!-- SEO header -->
            <h1 style="display: none">[Research]  Windows Minifilter Driver (KR)</h1>
                       
            <div class="markdown-body" id="post-body">
              <!-- <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              <!-- hackyboiz_horizen_index -->
              <!--
              <ins class="adsbygoogle"
                   style="display:block"
                   data-ad-client="ca-pub-3672652207808168"
                   data-ad-slot="8887862313"
                   data-ad-format="auto"
                   data-full-width-responsive="true"></ins>
              <script>
                   (adsbygoogle = window.adsbygoogle || []).push({});
              </script>
              -->
              <p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, banda&#xC785;&#xB2C8;&#xB2E4;. Windows Minifilter Driver &#xAE00;&#xACFC; &#xD568;&#xAED8; &#xCC98;&#xC74C; &#xC778;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#x1F917;</p>
<p>&#xCD5C;&#xADFC; Windows Kernel Driver&#xC744; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xAC00; Bus Driver, Filter Driver, FSD, Minifilter&#xC640; &#xAC19;&#xC740; &#xBAA9;&#xC801;&#xC5D0; &#xB530;&#xB978; &#xB2E4;&#xC591;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xC885;&#xB958;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xC800;&#xB294; &#xAE30;&#xC874;&#xC758; Function Driver&#xC640; &#xB2EC;&#xB9AC; Bus Driver&#xC774;&#xB098; Filter Driver&#xC5D0;&#xC11C;&#xC758; &#xAD6C;&#xC870; &#xCC28;&#xC774;&#xC640;, &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC5B4;&#xB5A4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB098;&#xD0C0;&#xB098;&#xB294;&#xC9C0; &#xAD81;&#xAE08;&#xD588;&#xB294;&#xB370;&#xC694;.</p>
<p>&#xC624;&#xB298;&#xC740; Minifilter Driver &#xAD6C;&#xC870;&#xC640; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;, &#xB0B4;&#xBD80; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xC640; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image1.png" srcset="/img/loading.gif" alt></p>
<h1 id="1-About-Minifilter-Drivers"><a href="#1-About-Minifilter-Drivers" class="headerlink" title="1. About Minifilter Drivers"></a>1. About Minifilter Drivers</h1><hr>
<p>Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; Windows&#xC5D0;&#xC11C; &#xD30C;&#xC77C; &#xC0DD;&#xC131;, &#xC5F4;&#xAE30;, &#xC77D;&#xAE30;, &#xC4F0;&#xAE30;, &#xC0AD;&#xC81C;&#xC640; &#xAC19;&#xC740; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; I/O &#xC694;&#xCCAD;&#xC744; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xAC70;&#xB098; &#xAC00;&#xB85C;&#xCC44;&#xACE0; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB41C; &#xD2B9;&#xC218;&#xD55C; &#xBAA9;&#xC801;&#xC758; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C;, &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xD65C;&#xB3D9;&#xC744; &#xC815;&#xBC00;&#xD558;&#xAC8C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xB294; &#xB370;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#x201C;&#xD30C;&#xC77C; &#xC811;&#xADFC;&#xC744; &#xAC10;&#xC2DC;&#xD558;&#xACE0;, &#xCC28;&#xB2E8;&#xD558;&#xAC70;&#xB098; &#xC218;&#xC815;&#xD558;&#xB294; &#xAC83;&#x201D;</strong>&#xC744; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74;&#x2026; &#xC7A0;&#xC2DC;&#xB9CC;&#xC694;. <strong>Antivirus, EDR, &#xBC31;&#xC5C5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;</strong>&#xACFC; &#xAC19;&#xC774; &#xAC00;&#xB85C;&#xCC44;&#xACE0; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC8FC; &#xBAA9;&#xC801;&#xC778; &#xC81C;&#xD488;&#xC5D0; &#xC801;&#xD569;&#xD574; &#xBCF4;&#xC774;&#xC9C0; &#xC54A;&#xB098;&#xC694;? &#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; &#xC0C1;&#xB2F9;&#xC218;&#xC758; &#xD574;&#xB2F9; &#xC81C;&#xD488;&#xB4E4;&#xC774; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC744; &#xC2E4;&#xC81C;&#xB85C; &#xC81C;&#xAC00; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB294;&#xB370;&#xC694;.</p>
<p>Minifiler &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xB2E4;&#xC74C; &#xC138; &#xAC00;&#xC9C0; &#xC885;&#xB958;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xAC00;&#xB85C;&#xCC44;&#xAC70;&#xB098; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>IRP (I/O Request Packet)</li>
<li>Fast I/O</li>
<li>File System Filter Callbacks</li>
</ol>
<h2 id="1-1-Filter-Manager-&#x2192;-Minifilter-&#xD750;&#xB984;"><a href="#1-1-Filter-Manager-&#x2192;-Minifilter-&#xD750;&#xB984;" class="headerlink" title="1.1 Filter Manager &#x2192; Minifilter &#xD750;&#xB984;"></a>1.1 Filter Manager &#x2192; Minifilter &#xD750;&#xB984;</h2><p>Minifilter&#xB294; Windows&#xC758; Filter Manager(<code>fltmgr.sys</code>) &#xC704;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. Filter Manager&#xB294; I/O Manager&#xB85C;&#xBD80;&#xD130; &#xC804;&#xB2EC;&#xB41C; &#xD30C;&#xC77C; I/O &#xC694;&#xCCAD;&#xC744;, &#xB4F1;&#xB85D;&#xB41C; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xAC8C; Altitude &#xC21C;&#xC11C;&#xB85C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, Altitude&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xB529; &#xC21C;&#xC11C;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image2.gif" srcset="/img/loading.gif" alt></p>
<p>Windows&#xC5D0;&#xC11C; &#xD30C;&#xC77C; I/O &#xC694;&#xCCAD;&#xC774; &#xCC98;&#xB9AC;&#xB418;&#xB294; &#xD750;&#xB984;&#xC744; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<ol>
<li>&#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; <code>CreateFile</code>, <code>ReadFile</code>, <code>WriteFile</code>&#xAC19;&#xC740; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; I/O &#xC791;&#xC5C5;&#xC744; &#xC694;&#xCCAD;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>I/O Manager&#xC774; &#xC774; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xC544; Filter Manager(<code>fltmgr.sys</code>)&#xB85C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Filter Manager&#xB294; &#xB4F1;&#xB85D;&#xB41C; &#xBAA8;&#xB4E0; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xBAA9;&#xB85D;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0;, Altitude &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xAC01; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0; &#xC694;&#xCCAD;&#xC744; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Minifilter&#xC774; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD55C; &#xB4A4;, &#xC694;&#xCCAD;&#xC740; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; Filter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xC740; &#xB514;&#xC2A4;&#xD06C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;(Storage Driver Stack)&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xC5B4; &#xC2E4;&#xC81C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAC70;&#xB098; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image3.png" srcset="/img/loading.gif" alt></p>
<p>&#xCC38;&#xACE0;&#xB85C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; Minifilter &#xBAA9;&#xB85D;&#xC740; cmd&#xCC3D;&#xC758; fltmc &#xBA85;&#xB839;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Altitude &#xAC12;&#xC774; &#xB192;&#xC744;&#xC218;&#xB85D; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xAC00; &#xB192;&#xC544;&#xC838; I/O &#xC694;&#xCCAD;&#xC744; &#xBA3C;&#xC800; &#xAC00;&#xB85C;&#xCC44;&#xAC70;&#xB098; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E8;, &#xCC98;&#xB9AC; &#xC21C;&#xC11C;&#xB294; &#xC0AC;&#xC804; &#xC5F0;&#xC0B0;, &#xC0AC;&#xD6C4; &#xC5F0;&#xC0B0;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>&#xC0AC;&#xC804; &#xC5F0;&#xC0B0;(Pre-operation)</strong>: Altitude&#xAC00; <strong>&#xB192;&#xC740; &#xC21C;&#xC11C; &#x2192; &#xB0AE;&#xC740; &#xC21C;&#xC11C;</strong>&#xB85C; &#xD638;&#xCD9C;</li>
<li><strong>&#xC0AC;&#xD6C4; &#xC5F0;&#xC0B0;(Post-operation)</strong>: Altitude&#xAC00; <strong>&#xB0AE;&#xC740; &#xC21C;&#xC11C; &#x2192; &#xB192;&#xC740; &#xC21C;&#xC11C;</strong>&#xB85C; &#xD638;&#xCD9C;</li>
</ul>
<blockquote>
<p>&#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xC640; &#xC704; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xD750;&#xB984;&#xC744; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74;&#x2026; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xAE30;&#xC874;&#xC758; &#xBC29;&#xC2DD;&#xCC98;&#xB7FC; IRP&#xB97C; &#xC9C1;&#xC811; &#xCC98;&#xB9AC;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB300;&#xC2E0;, FilterManager&#xAC00; I/O &#xC694;&#xCCAD;&#xC744; &#xB300;&#xC2E0; &#xBC1B;&#xC544;&#xC11C; Minifilter&#xC5D0;&#xAC8C; &#xCF5C;&#xBC31; &#xD568;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC2DC;&#xB9D0;&#xD574; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xD754;&#xD788; &#xC54C;&#xACE0;&#xC788;&#xB294; <strong>DispatchRoutine&#xC744; &#xC124;&#xC815;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB294; &#xAC83;&#xC774;&#xC8E0;!</strong></p>
</blockquote>
<h2 id="1-2-Minifilter-Callback-Routine"><a href="#1-2-Minifilter-Callback-Routine" class="headerlink" title="1.2 Minifilter Callback Routine"></a>1.2 Minifilter Callback Routine</h2><p>Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xD2B9;&#xC815; &#xD30C;&#xC77C; &#xC791;&#xC5C5;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xB3D9;&#xC791;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? &#xC774;&#xB294; &#xCF5C;&#xBC31;(Callback)&#xC774;&#xB77C;&#xB294; &#xBA54;&#xCEE4;&#xB2C8;&#xC998; &#xB355;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; <strong>DispatchRoutine</strong>&#xC744; &#xD1B5;&#xD574; IRP&#xB97C; &#xC9C1;&#xC811; &#xCC98;&#xB9AC;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xD588;&#xC8E0;? &#xADF8; &#xB300;&#xC2E0;, Filter Manager&#xB97C; &#xD1B5;&#xD574; &#xC804;&#xB2EC;&#xB418;&#xB294; I/O &#xC694;&#xCCAD;&#xC5D0; &#x201C;&#xD6C5;(hook)&#x201D;&#xC744; &#xAC78; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Minifilter&#xB294; &#xC774; &#xC694;&#xCCAD;&#xB4E4;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xB54C; <strong>&#xC0AC;&#xC804; &#xCF5C;&#xBC31;(<code>PreOperation Callback</code>)</strong>&#xACFC; <strong>&#xC0AC;&#xD6C4; &#xCF5C;&#xBC31;(<code>PostOperation Callback</code>)</strong>&#xC744; &#xB4F1;&#xB85D;&#xD558;&#xC5EC;, &#xAC10;&#xC2DC;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; I/O &#xC791;&#xC5C5;&#xC744; &#xC2DC;&#xC2A4;&#xD15C; &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xAD00;&#xCC30;&#xD558;&#xAC70;&#xB098; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><strong>&#xC0AC;&#xC804; &#xC791;&#xC5C5; &#xCF5C;&#xBC31; (<code>PFLT_PRE_OPERATION_CALLBACK</code>)</strong></li>
</ul>
<pre><code class="hljs c">PFLT_PRE_OPERATION_CALLBACK PfltPreOperationCallback;

<span class="hljs-function">FLT_PREOP_CALLBACK_STATUS <span class="hljs-title">PfltPreOperationCallback</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, out] PFLT_CALLBACK_DATA Data,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]      PCFLT_RELATED_OBJECTS FltObjects,</span></span>
<span class="hljs-function"><span class="hljs-params">  [out]     PVOID *CompletionContext</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>
<span class="hljs-function"></span>{...}</code></pre>
<p>I/O &#xC694;&#xCCAD;&#xC774; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB098; &#xD558;&#xC704; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xAE30; &#xC774;&#xC804;&#xC5D0; &#xD638;&#xCD9C;&#xB429;&#xB2C8;&#xB2E4;. Minifilter&#xC758; &#xD575;&#xC2EC; &#xB85C;&#xC9C1;&#xC774; &#xC218;&#xD589;&#xB418;&#xB294; &#xACF3;&#xC73C;&#xB85C; <code>FLT_PREOP_COMPLETE</code>, <code>FLT_PREOP_SUCCESS_WITH_CALLBACK</code>, <code>FLT_PREOP_SUCCESS_NO_CALLBACK</code>&#xACFC; &#xAC19;&#xC740; &#xAC15;&#xB825;&#xD55C; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_pre_operation_callback"><strong>PFLT_PRE_OPERATION_CALLBACK callback function (fltkernel.h)</strong></a></p>
<ul>
<li><strong>&#xC0AC;&#xD6C4; &#xC791;&#xC5C5; &#xCF5C;&#xBC31; (<code>PFLT_POST_OPERATION_CALLBACK</code>)</strong></li>
</ul>
<pre><code class="hljs c">PFLT_POST_OPERATION_CALLBACK PfltPostOperationCallback;

<span class="hljs-function">FLT_POSTOP_CALLBACK_STATUS <span class="hljs-title">PfltPostOperationCallback</span><span class="hljs-params">(</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, out]      PFLT_CALLBACK_DATA Data,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           PCFLT_RELATED_OBJECTS FltObjects,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in, optional] PVOID CompletionContext,</span></span>
<span class="hljs-function"><span class="hljs-params">  [in]           FLT_POST_OPERATION_FLAGS Flags</span></span>
<span class="hljs-function"><span class="hljs-params">)</span></span>
<span class="hljs-function"></span>{...}</code></pre>
<p>I/O &#xC694;&#xCCAD;&#xC774; &#xD558;&#xC704; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB97C; &#xBAA8;&#xB450; &#xB9C8;&#xCE58;&#xACE0; &#xB3CC;&#xC544;&#xC624;&#xB294; &#xAE38;&#xC5D0; &#xD638;&#xCD9C;&#xB429;&#xB2C8;&#xB2E4;. &#xC791;&#xC5C5;&#xC758; &#xC131;&#xACF5; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;&#xD558;&#xAC70;&#xB098;, &#xACB0;&#xACFC;&#xB97C; &#xB85C;&#xAE45;&#xD558;&#xAC70;&#xB098;, &#xD544;&#xC694;&#xD558;&#xB2E4;&#xBA74; &#xC791;&#xC5C5; &#xACB0;&#xACFC;&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xD6C4;&#xCC98;&#xB9AC; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/fltkernel/nc-fltkernel-pflt_post_operation_callback"><strong>PFLT_POST_OPERATION_CALLBACK callback function (fltkernel.h)</strong></a></p>
<blockquote>
<p>&#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C;, &#xC774; &#xCF5C;&#xBC31;&#xB4E4;&#xC740; <code>FLT_OPERATION_REGISTRATION</code>&#xC774;&#xB77C;&#xB294; &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#x201C;&#xC5B4;&#xB5A4; I/O &#xC791;&#xC5C5;(MajorFunction)&#xC5D0; &#xC5B4;&#xB5A4; &#xC0AC;&#xC804;/&#xC0AC;&#xD6C4; &#xCF5C;&#xBC31; &#xD568;&#xC218;&#xB97C; &#xC5F0;&#xACB0;&#xD560;&#xC9C0;&#x201D;&#xB97C; &#xBA85;&#xC2DC;&#xD574; &#xB4F1;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h2 id="1-3-Minifilter&#xC640;-User-Mode-&#xAC04;&#xC758;-&#xD1B5;&#xC2E0;"><a href="#1-3-Minifilter&#xC640;-User-Mode-&#xAC04;&#xC758;-&#xD1B5;&#xC2E0;" class="headerlink" title="1.3 Minifilter&#xC640; User-Mode &#xAC04;&#xC758; &#xD1B5;&#xC2E0;"></a>1.3 Minifilter&#xC640; User-Mode &#xAC04;&#xC758; &#xD1B5;&#xC2E0;</h2><p>Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; User-Mode &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xAC04;&#xC758; &#xD1B5;&#xC2E0;&#xC740; <strong>&#xD544;&#xD130; &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8;</strong>&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8;&#xB780;, Minifilter&#xC640; &#xC571; &#xC0AC;&#xC774;&#xC758; &#xC804;&#xC6A9; &#xACE0;&#xC18D; &#xD1B5;&#xC2E0; &#xCC44;&#xB110;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xD3EC;&#xD2B8;&#xB294; Kernel Mode &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC640; User-Mode &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04;&#xC758; &#xC548;&#xC804;&#xD55C; &#xBA54;&#xC2DC;&#xC9C0; &#xC804;&#xB2EC;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xB97C; &#xC9C1;&#xC811; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA70; Microsoft&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC5EC;&#xB7EC; API&#xB97C; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;!</p>
<h3 id="Driver-Code"><a href="#Driver-Code" class="headerlink" title="Driver Code"></a>Driver Code</h3><pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;fltKernel.h&gt;</span></span>

PFLT_FILTER gFilter = <span class="hljs-literal">NULL</span>;
PFLT_PORT gServerPort = <span class="hljs-literal">NULL</span>, gClientPort = <span class="hljs-literal">NULL</span>;

<span class="hljs-function">VOID <span class="hljs-title">OnDisconnect</span><span class="hljs-params">(PVOID Cookie)</span> </span>{
    UNREFERENCED_PARAMETER(Cookie);
    FltCloseClientPort(gFilter, &amp;gClientPort);
    gClientPort = <span class="hljs-literal">NULL</span>;
}

<span class="hljs-function">NTSTATUS <span class="hljs-title">OnConnect</span><span class="hljs-params">(PFLT_PORT ClientPort, PVOID SrvCookie, PVOID Ctx, ULONG Size, PVOID* ConnCookie)</span> </span>{
    UNREFERENCED_PARAMETER(SrvCookie);
    UNREFERENCED_PARAMETER(Ctx);
    UNREFERENCED_PARAMETER(Size);
    UNREFERENCED_PARAMETER(ConnCookie);
    gClientPort = ClientPort;
    <span class="hljs-keyword">return</span> STATUS_SUCCESS;
}

<span class="hljs-function">FLT_PREOP_CALLBACK_STATUS <span class="hljs-title">PreCreate</span><span class="hljs-params">(PFLT_CALLBACK_DATA Data, PCFLT_RELATED_OBJECTS FltObjects, PVOID* Buff)</span> </span>{
    UNREFERENCED_PARAMETER(FltObjects);
    UNREFERENCED_PARAMETER(Buff);
    PFLT_FILE_NAME_INFORMATION nameInfo;

    <span class="hljs-keyword">if</span> (gClientPort &amp;&amp; NT_SUCCESS(FltGetFileNameInformation(Data, FLT_FILE_NAME_NORMALIZED, &amp;nameInfo))) {
        FltSendMessage(gFilter, &amp;gClientPort, nameInfo-&gt;Name.Buffer, nameInfo-&gt;Name.Length, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>, <span class="hljs-literal">NULL</span>);
        FltReleaseFileNameInformation(nameInfo);
    }
    <span class="hljs-keyword">return</span> FLT_PREOP_SUCCESS_NO_CALLBACK;
}

<span class="hljs-function">NTSTATUS <span class="hljs-title">Unload</span><span class="hljs-params">(FLT_FILTER_UNLOAD_FLAGS Flags)</span> </span>{
    UNREFERENCED_PARAMETER(Flags);
    FltCloseCommunicationPort(gServerPort);
    FltUnregisterFilter(gFilter);
    <span class="hljs-keyword">return</span> STATUS_SUCCESS;
}

<span class="hljs-function">NTSTATUS <span class="hljs-title">DriverEntry</span><span class="hljs-params">(PDRIVER_OBJECT DriverObject, PUNICODE_STRING RegistryPath)</span> </span>{
    UNREFERENCED_PARAMETER(RegistryPath);
    NTSTATUS status;

    <span class="hljs-keyword">const</span> FLT_OPERATION_REGISTRATION Cbs[] = { { IRP_MJ_CREATE, <span class="hljs-number">0</span>, PreCreate, <span class="hljs-literal">NULL</span> }, { IRP_MJ_OPERATION_END } };
    <span class="hljs-keyword">const</span> FLT_REGISTRATION Reg = { <span class="hljs-keyword">sizeof</span>(FLT_REGISTRATION), FLT_REGISTRATION_VERSION, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>, Cbs, Unload };

    status = FltRegisterFilter(DriverObject, &amp;Reg, &amp;gFilter);
    <span class="hljs-keyword">if</span> (!NT_SUCCESS(status)) <span class="hljs-keyword">return</span> status;

    UNICODE_STRING portName = RTL_CONSTANT_STRING(<span class="hljs-string">L&quot;\\FileActivityMonitorPort&quot;</span>);
    OBJECT_ATTRIBUTES oa = { <span class="hljs-keyword">sizeof</span>(oa), <span class="hljs-literal">NULL</span>, &amp;portName, OBJ_KERNEL_HANDLE | OBJ_CASE_INSENSITIVE, <span class="hljs-literal">NULL</span> };

    status = FltCreateCommunicationPort(gFilter, &amp;gServerPort, &amp;oa, <span class="hljs-literal">NULL</span>, OnConnect, OnDisconnect, <span class="hljs-literal">NULL</span>, <span class="hljs-number">1</span>);
    <span class="hljs-keyword">if</span> (!NT_SUCCESS(status)) {
        FltUnregisterFilter(gFilter);
        <span class="hljs-keyword">return</span> status;
    }

    <span class="hljs-keyword">return</span> FltStartFiltering(gFilter);
}</code></pre>
<p>&#xB300;&#xD45C;&#xC801;&#xC778; Driver Code API&#xC778; <code>FltCreateCommunicationPort()</code>, <code>FltSendMessage()</code>, <code>FltCloseCommunicationPort()</code>&#xC5D0; &#xCD08;&#xC810;&#xC744; &#xB9DE;&#xCDB0;&#xC11C; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCF54;&#xB4DC;&#xB97C; &#xC608;&#xC81C;&#xB85C; &#xAD6C;&#xD604;&#xD574;&#xBCF4;&#xC558;&#xB294;&#xB370;&#xC694;. &#xD750;&#xB984;&#xC744; &#xD568;&#xAED8; &#xC0B4;&#xD3B4;&#xBCFC;&#xAE4C;&#xC694;?</p>
<ol>
<li>&#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; <code>FltRegisterFilter()</code>&#xB97C; &#xD1B5;&#xD574; &#xC790;&#xC2E0;&#xC744; &#xB4F1;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD30C;&#xC77C; &#xC0DD;&#xC131;&#xACFC; &#xC5F4;&#xAE30;(<code>IRP_MJ_CREATE</code>) &#xC694;&#xCCAD;&#xC744; &#xAC10;&#xC2DC;&#xD560; PreCreateCallback &#xD568;&#xC218;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xACE0;, <code>FltStartFiltering()</code>&#xC73C;&#xB85C; I/O &#xAC10;&#xC2DC;&#xB97C; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>FltCreateCommunicationPort()</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;&#xC694;, &#xC704;&#xC758; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; User-Mode &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xC54C;&#xB9BC;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8; <code>\\FileActivityMonitorPort</code>&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xB9CC;&#xC57D; &#xD30C;&#xC77C; &#xC0DD;&#xC131;/&#xC5F4;&#xAE30; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; PreCreateCallback&#xC774; &#xD638;&#xCD9C;&#xB418;&#xACE0;, &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB294; &#xC5B4;&#xB5A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5B4;&#xB5A4; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD588;&#xB294;&#xC9C0; &#xC815;&#xBCF4;&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774;&#xD6C4; <code>FltSendMessage()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; PreCreateCall&#xC5D0;&#xC11C; &#xC218;&#xC9D1;&#xD55C; &#xC2E4;&#xC2DC;&#xAC04; &#xD30C;&#xC77C; &#xC811;&#xADFC; &#xC815;&#xBCF4;&#xB97C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4;&#xC788;&#xB294; User-Mode &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC73C;&#xB85C; &#xC989;&#xC2DC; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; FilterUnload &#xC5B8;&#xB85C;&#xB4DC; &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xAC00; &#xC885;&#xB8CC;&#xB420; &#xB54C;, &#xC5F4;&#xC5C8;&#xB358; &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8;&#xB97C; <code>FltCloseCommunicationPort()</code>&#xB85C; &#xB2EB;&#xACE0; &#xD544;&#xD130; &#xB4F1;&#xB85D;&#xC744; &#xD574;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<h3 id="User-Mode-Application-Code"><a href="#User-Mode-Application-Code" class="headerlink" title="User-Mode Application Code"></a>User-Mode Application Code</h3><pre><code class="hljs c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;windows.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;fltuser.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-meta">#<span class="hljs-meta-keyword">pragma</span> comment(lib, <span class="hljs-meta-string">&quot;fltlib.lib&quot;</span>)</span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span> </span>{
    HANDLE port;
    HRESULT hr;
    
    BYTE buffer[<span class="hljs-keyword">sizeof</span>(FILTER_MESSAGE_HEADER) + <span class="hljs-number">1024</span>];
    PFILTER_MESSAGE_HEADER header = (PFILTER_MESSAGE_HEADER)buffer;

    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Connecting to driver...\n&quot;</span>);

    hr = FilterConnectCommunicationPort(<span class="hljs-string">L&quot;\\FileActivityMonitorPort&quot;</span>, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>, <span class="hljs-number">0</span>, <span class="hljs-literal">NULL</span>, &amp;port);
    <span class="hljs-keyword">if</span> (IS_ERROR(hr)) {
        <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Connection failed. Error 0x%X\n&quot;</span>, hr);
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }

    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Connected. Waiting for file events...\n&quot;</span>);

    <span class="hljs-keyword">while</span> (TRUE) {
        hr = FilterGetMessage(port, header, <span class="hljs-keyword">sizeof</span>(buffer), <span class="hljs-literal">NULL</span>);
        
        <span class="hljs-keyword">if</span> (SUCCEEDED(hr)) {
            <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;File Accessed: %S\n&quot;</span>, (PWSTR)header-&gt;MessageBody);
        } <span class="hljs-keyword">else</span> {
            <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Connection lost. Error 0x%X\n&quot;</span>, hr);
            <span class="hljs-keyword">break</span>;
        }
    }

    CloseHandle(port);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}</code></pre>
<p>&#xC774;&#xC81C; User-Mode &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD1B5;&#xC2E0; &#xD750;&#xB984;&#xC744; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xB300;&#xD45C;&#xC801;&#xC778; API&#xB85C; <code>FilterConnectCommunicationPort()</code>, <code>FilterSendMessage()</code>&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xBA3C;&#xC800; <code>FilterConnectCommunicationPort()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xCEE4;&#xB110;&#xC5D0; &#xC788;&#xB294; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xD1B5;&#xC2E0; &#xD3EC;&#xD2B8;&#xC778; <code>\\FileActivityMonitorPort</code>&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xD1B5;&#xC2E0;&#xC744; &#xC704;&#xD55C; HANDLE&#xC744; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xADF8; &#xD6C4; <code>FilterGetMessage()</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC;, &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C;&#xBD80;&#xD130; &#xD30C;&#xC77C; &#xACBD;&#xB85C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC9C1;&#xC811; &#xC218;&#xC2E0;&#xD569;&#xB2C8;&#xB2E4;. &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xC2E0;&#xB418;&#xBA74; &#xD574;&#xB2F9; &#xD30C;&#xC77C; &#xACBD;&#xB85C;&#xB97C; &#xD654;&#xBA74;&#xC5D0; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<h1 id="2-CVE-2024-30085-1-Day-Analysis"><a href="#2-CVE-2024-30085-1-Day-Analysis" class="headerlink" title="2. [CVE-2024-30085] 1-Day Analysis"></a>2. [CVE-2024-30085] 1-Day Analysis</h1><hr>
<p>&#xD558;&#xB8E8;&#xD55C;&#xC904;&#xC5D0;&#xB3C4; &#xC18C;&#xAC1C;&#xB418;&#xC5C8;&#xB358; Windows Minifilter Driver &#xCDE8;&#xC57D;&#xC810;&#xC778;&#xB370;&#xC694;(<a href="https://hackyboiz.github.io/2025/01/11/OUYA77/2025-01-11/">reference</a>). CVE-2024-30085&#xB97C; &#xC9C1;&#xC811; &#xC7AC;&#xD604;&#xD574;&#xBCF4;&#xBA70; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xD568;&#xAED8; &#xC54C;&#xC544;&#xAC00;&#xBCF4;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4;.</p>
<blockquote>
<p><strong>&#x1FA9F; Environment : Windows 11 22h2/23h2 10.0.2261.3672</strong></p>
</blockquote>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image4.png" srcset="/img/loading.gif" alt></p>
<p>Windows Cloud Files Mini Filter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; Windows &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xB3D9;&#xAE30;&#xD654; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xB85C; &#xC9C0;&#xAE08; &#xC800;&#xC758; &#xD3F4;&#xB354;&#xB97C; &#xD558;&#xB098; &#xCC0D;&#xC5B4;&#xC654;&#xB294;&#xB370;&#xC694;, &#xC624;&#xB298;&#xC740; &#xD574;&#xB2F9; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBA3C;&#xC800; Stub File, Reparse Point&#xC5D0; &#xB300;&#xD55C; &#xC0AC;&#xC804; &#xACF5;&#xBD80;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="Stub-File&#xC774;&#xB780;"><a href="#Stub-File&#xC774;&#xB780;" class="headerlink" title="Stub File&#xC774;&#xB780;?"></a>Stub File&#xC774;&#xB780;?</h3><p>Stub File&#xC740; &#xB85C;&#xCEEC;&#xC5D0;&#xB294; &#xC2E4;&#xC81C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC5C6;&#xACE0;, placeholder &#xD615;&#xD0DC;&#xB85C; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xC704;&#xC758; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#x2018;&#xC0AC;&#xC9C4;&#x2019; &#xD3F4;&#xB354;&#xC5D0; &#xD30C;&#xB780;&#xC0C9; &#xAD6C;&#xB984; &#xC544;&#xC774;&#xCF58;&#xC774; status&#xB85C; &#xB098;&#xD0C0;&#xB098;&#xC788;&#xC8E0;? &#xBC14;&#xB85C; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; stub &#xC0C1;&#xD0DC;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC5B4;&#xC694;. NTFS &#xC0C1;&#xC5D0;&#xC11C; &#xD30C;&#xC77C; &#xD06C;&#xAE30;, &#xC774;&#xB984;, &#xC544;&#xC774;&#xCF58; &#xB4F1;&#xC740; &#xD45C;&#xC2DC;&#xD558;&#xC9C0;&#xB9CC;, &#xD30C;&#xC77C; &#xB0B4;&#xC6A9;&#xC740; &#xC804;&#xD600; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="Reparse-Point-Metadata"><a href="#Reparse-Point-Metadata" class="headerlink" title="Reparse Point Metadata"></a>Reparse Point Metadata</h3><p>&#xADF8;&#xB7FC; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774;&#xB7EC;&#xD55C; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;!? NTFS&#xB294; Reparse Tag&#xB97C; &#xBCF4;&#xACE0; <strong>&#x201C;&#xC624;&#xD638;&#x2026; &#xC774;&#xAC74; stub file&#xC774;&#xB124;!&#x201D;</strong>&#xB77C;&#xACE0; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; Windows Cloud Files Minifilter(<code>cldflt.sys</code>)&#xAC00; &#xC774; <code>Reparse Point</code> &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC77D;&#xACE0;, &#xC774; &#xD30C;&#xC77C;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC98;&#xB9AC;&#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC8E0;.</p>
<p>&#xC774;&#xD6C4; Minifilter&#xC740; &#xC6D0;&#xACA9; &#xC11C;&#xBC84;&#xC640; &#xD1B5;&#xC2E0;&#xC744; &#xC900;&#xBE44;&#xD558;&#xB294;&#xB370;, <code>cldflt.sys</code>&#xB294; &#xC9C1;&#xC811; &#xC11C;&#xBC84;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. User-Mode &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC2E4;&#xC81C; &#xC791;&#xC5C5;&#xC744; &#xC704;&#xC784;&#xD574;&#xBC84;&#xB9AC;&#xB294;&#xB370;&#xC694;. &#xC704;&#xC5D0;&#xC11C; &#xBCF4;&#xC558;&#xB358; Minifilter&#xC774; I/O Interpreter &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0;, &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130; &#xC870;&#xC791;&#xC740; User-Mode &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB2F4;&#xB2F9;&#xD55C;&#xB2E4;&#xB294; &#xAC1C;&#xB150;&#xACFC; &#xC77C;&#xCE58;&#xD558;&#xC8E0;? (&#xC624;.. &#xC2E0;&#xAE30;&#xD558;&#xB124;&#xC694;.)</p>
<p>Windows Cloud Files Minifilter&#xC758; Reparse Point &#xAD6C;&#xC870;&#xCCB4;&#xB97C; Local Types&#xC5D0; &#xCD94;&#xAC00;&#xD588;&#xB294;&#xB370;&#xC694;, &#xC81C;&#xAC00; &#xC815;&#xC758;&#xD55C; CldFlt &#xAD6C;&#xC870;&#xCCB4; &#xC138;&#xD2B8;&#xB97C; &#xD568;&#xAED8; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-keyword">typedef</span> <span class="hljs-class"><span class="hljs-keyword">struct</span> _<span class="hljs-title">REPARSE_DATA_BUFFER</span> {</span>
    DWORD ReparseTag;
    WORD ReparseDataLength;
    WORD Reserved;
    WORD Flags;
    WORD UncompressedSize;
    REPARSE_CLD_BUFFER ReparseCldBuffer;
} REPARSE_DATA_BUFFER, *PREPARSE_DATA_BUFFER;</code></pre>
<p>&#xBA3C;&#xC800; <code>REPARSE_DATA_BUFFER</code>&#xB294; NTFS&#xC758; &#xBAA8;&#xB4E0; Reparse Point &#xB370;&#xC774;&#xD130;&#xB97C; &#xD45C;&#xD604;&#xD558;&#xB294; &#xD45C;&#xC900; &#xD5E4;&#xB354; &#xAD6C;&#xC870;&#xCCB4;&#xC774;&#xC9C0;&#xB9CC;, &#xC5EC;&#xAE30;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xAD6C;&#xC870;&#xCCB4;&#xB294; Cloud Files&#xB97C; &#xC27D;&#xAC8C; &#xBD84;&#xC11D;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC7AC;&#xC815;&#xC758;&#xD55C; &#xBC84;&#xC804;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xAD6C;&#xC870;&#xCCB4;&#xB294; <code>ReparseTag</code>&#xB85C; &#xC18C;&#xC720; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xC2DD;&#xBCC4;&#xD558;&#xACE0; <code>ReparseDataLength</code>, <code>Flags</code> &#xAC19;&#xC740; &#xCD5C;&#xC0C1;&#xC704; &#xBA54;&#xD0C0;&#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xC73C;&#xBA70;, &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130;&#xB294; <code>HSM_REPARSE</code>&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">HSM_REPARSE</span></span>
<span class="hljs-class">{</span>
    USHORT hsmFlags;
    USHORT hsmSize;
    <span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">HSM_RP_DATA</span> <span class="hljs-title">fileData</span>;</span>
};</code></pre>
<p><code>HSM_REPARSE</code>&#xB294; Cloud Files &#xC804;&#xC6A9; Reparse Point &#xC804;&#xCCB4; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xC785;&#xB2C8;&#xB2E4;. <code>hsmFlags</code>&#xC640; <code>hsmSize</code>&#xB85C; &#xC555;&#xCD95; &#xC5EC;&#xBD80;&#xC640; HSM &#xBE14;&#xB85D; &#xC804;&#xCCB4; &#xD06C;&#xAE30;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xACE0;, <code>fileData</code> &#xD544;&#xB4DC;&#xC5D0; <code>HSM_RP_DATA</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">HSM_RP_DATA</span> </span>
<span class="hljs-class">{</span>       
    ULONG magic;
    ULONG crc32;
    ULONG totalSize;
    USHORT dataFlags;
    USHORT elemCount;
    <span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">HSM_RP_ELEMENT</span> <span class="hljs-title">elements</span>[5];</span>
};</code></pre>
<p>&#xC774;&#xC5B4;&#xC11C; <code>HSM_RP_DATA</code> &#xAD6C;&#xC870;&#xCCB4;&#xB294; &#xBA54;&#xC778; &#xD5E4;&#xB354;&#xB85C;, &#xC804;&#xCCB4; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xBE14;&#xB85D;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xC704;&#xCE58;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. magic&#xC744; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130; &#xC885;&#xB958;&#xB97C; &#xC2DD;&#xBCC4;&#xD558;&#xACE0;, crc32&#xB97C; &#xD1B5;&#xD574; <code>dataFlags</code>&#xC5D0; CRC &#xC874;&#xC7AC; &#xBE44;&#xD2B8;&#xAC00; &#xC124;&#xC815;&#xB418;&#xBA74; <code>RtlComputeCrc32</code>&#xB85C; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;. elements[] &#xBC30;&#xC5F4;&#xC5D0;&#xB294; <code>HSM_RP_ELEMENT</code> &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC774; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xAC01; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xC694;&#xC18C;&#xC758; &#xC720;&#xD615;, &#xD06C;&#xAE30;, &#xC624;&#xD504;&#xC14B;&#xC744; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">HSM_RP_ELEMENT</span> </span>
<span class="hljs-class">{</span>               
    USHORT elemType;
    USHORT elemSize;
    ULONG elemOffset;
};

<span class="hljs-keyword">typedef</span> <span class="hljs-keyword">enum</span> HSM_RP_ELEM_TYPE {
    HSM_RP_ELEMENT_NONE   = <span class="hljs-number">0x00</span>,
    HSM_RP_ELEMENT_U64    = <span class="hljs-number">0x06</span>,
    HSM_RP_ELEMENT_BYTE   = <span class="hljs-number">0x07</span>,
    HSM_RP_ELEMENT_U32    = <span class="hljs-number">0x0a</span>,
    HSM_RP_ELEMENT_BITMAP = <span class="hljs-number">0x11</span>,
    HSM_RP_ELEMENT_MAX    = <span class="hljs-number">0x12</span>
} HSM_RP_ELEMENT_TYPE;</code></pre>
<p>&#xC774;&#xD6C4; <code>HSM_RP_ELEMENT</code>&#xC5D0;&#xC11C;&#xB294; &#xAC1C;&#xBCC4; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xC694;&#xC18C;&#xC758; type, size, offset&#xC744; &#xC815;&#xC758;&#xD558;&#xBA70;, <code>HSM_RP_ELEMENT_TYPE</code> &#xAC12;&#xC73C;&#xB85C; &#xC720;&#xD615;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xB294; &#xC591;&#xC0C1;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="2-1-Root-Cause-Analysis"><a href="#2-1-Root-Cause-Analysis" class="headerlink" title="2.1 Root Cause Analysis"></a>2.1 Root Cause Analysis</h2><p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image5.png" srcset="/img/loading.gif" alt></p>
<p>&#xCDE8;&#xC57D;&#xC810;&#xC740; &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD574; <code>HsmFltPostCREATE</code> &#xCF5C;&#xBC31;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xC5B4; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC758; Reparse Point&#xB97C; &#xCC98;&#xB9AC;&#xD560; &#xB54C;,  <code>HsmFltPostCREATE</code> &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; Reparse Point&#xC5D0; &#xB2F4;&#xAE34; bitmap &#xC815;&#xBCF4;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD638;&#xCD9C;&#xB418;&#xB294; <code>HsmIBitmapNORMALOpen()</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>bitmap_size</code>&#xB294; User-Mode &#xC694;&#xCCAD; &#xBC84;&#xD37C;&#xC5D0;&#xC11C; &#xC77D;&#xC5B4;&#xC628; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>&#xD06C;&#xAE30; 0x1000&#xC73C;&#xB85C; &#xACE0;&#xC815; &#xD560;&#xB2F9;&#xD55C; &#xBC84;&#xD37C; <code>ExAllocatePoolWithTag</code>&#xC5D0; &#xB300;&#xD574;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;&#xD55C; <code>bitmap_size</code>&#xB97C; &#xACBD;&#xACC4; &#xAC80;&#xC0AC; &#xC5C6;&#xC774; &#xADF8;&#xB300;&#xB85C; <code>memmove</code>&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xC5EC; &#xBCF5;&#xC0AC;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xB530;&#xB77C;&#xC11C; &#xB9CC;&#xC57D; <code>bitmap_size</code> &gt; 0x1000&#xC778; &#xACBD;&#xC6B0;, Heap-based Buffer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB420; &#xAC83;&#xC73C;&#xB85C; &#xC608;&#xC0C1;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image6.png" srcset="/img/loading.gif" alt></p>
<p><code>HsmpBitmapIsReparseBufferSupported()</code> &#xD568;&#xC218;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; <code>hdr-&gt;elements[4].elemSize</code> &#xAC12;&#xC774; 0x1000&#xBCF4;&#xB2E4; &#xD06C;&#xBA74; &#xC624;&#xB958;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294;&#xB370;&#xC694;. </p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image7.png" srcset="/img/loading.gif" alt></p>
<p>&#xC870;&#xAE08; &#xB354; &#xC704;&#xB85C; &#xC62C;&#xB77C;&#xAC00;&#xC11C; &#xC870;&#xAC74;&#xBB38; &#xCF54;&#xB4DC;&#xB97C; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; <code>hdr-&gt;elements[2]</code>&#xB97C; &#xC5C4;&#xACA9;&#xD558;&#xAC8C; &#xAC80;&#xC99D;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>total &#x2265; 0x18</code>, <code>hdr&#x2192;elemCount</code> &#xB4F1;&#xC758; &#xACBD;&#xACC4; &#xCCB4;&#xD06C;&#xB97C; &#xBAA8;&#xB450; &#xD1B5;&#xACFC;&#xD574;&#xC57C; &#xC9C4;&#xD589;&#xC774; &#xB418;&#xB294;&#xAD70;&#xC694;.. &#xC774; &#xC870;&#xAC74;&#xC744; &#xCDA9;&#xC871;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xBA74; fail&#xC744; &#xBC18;&#xD658;&#xD558;&#xACA0;&#xC8E0;?</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image8.png" srcset="/img/loading.gif" alt></p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xB3D9;&#xC77C; &#xD568;&#xC218;&#xC5D0; <code>hasBuf</code>&#xAC00; false&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74;, &#xBCC4;&#xB3C4;&#xC758; &#xBE44;&#xD2B8;&#xB9F5; &#xAE38;&#xC774; &#xAC80;&#xC0AC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; <code>element[1]</code>&#xC758; 1&#xBC14;&#xC774;&#xD2B8; &#xD50C;&#xB798;&#xADF8;&#xB9CC; &#xD655;&#xC778;&#xD574;&#xB3C4; result = 0&#xC73C;&#xB85C; success&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xB85C;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xD2B8;&#xB9F5;&#xC758; &#xAE38;&#xC774;&#xAC00; 0x1000&#xBCF4;&#xB2E4; &#xD070;&#xC9C0; &#xAC80;&#xC0AC;&#xAC00; &#xC218;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xAC80;&#xC99D;&#xC774; &#xAC74;&#xB108;&#xB6F0;&#xC5B4;&#xC9C0;&#xBA74;&#xC11C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC720;&#xD6A8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xB418;&#xC5B4; &#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<h2 id="2-2-Exploit"><a href="#2-2-Exploit" class="headerlink" title="2.2 Exploit"></a>2.2 Exploit</h2><p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image9.png" srcset="/img/loading.gif" alt></p>
<p>cldflt.sys &#xBBF8;&#xB2C8;&#xD544;&#xD130; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; I/O&#xB97C; &#xD6D1;&#xB294;&#xAC8C; &#xC544;&#xB2C8;&#xB77C;, CfAPI&#xB97C; &#xD1B5;&#xD55C; Sync Root &#xACBD;&#xB85C;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xBA3C;&#xC800; <code>CfRegisterSyncRoot()</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xB3D9;&#xAE30;&#xD654; &#xD3F4;&#xB354;&#xC758; Root &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xB3C4;&#xB2EC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image10.png" srcset="/img/loading.gif" alt></p>
<p>Sync Root&#xB97C; &#xB4F1;&#xB85D;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC6B0;&#xC120; &#xBE4C;&#xB4DC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD574;&#xBCF4;&#xBA74; &#xC774;&#xB7F0; &#xD3F4;&#xB354;&#xAC00; &#xC0DD;&#xAE30;&#xB294;&#xB370;&#xC694;. &#xC774; &#xD3F4;&#xB354; &#xB0B4;&#xBD80;&#xC5D0;&#xB294; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; Stub File, &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xAC00; &#xC0DD;&#xAE38; &#xC218; &#xC788;&#xACE0;, &#xC81C;&#xAC00; &#xC774;&#xAC78; &#xC545;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xC9C0;&#xC810;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c">-&gt; HsmFltPostCREATE()
-&gt; HsmiFltPostECPCREATE()
-&gt; HsmpSetupContexts()
-&gt; HsmpCtxCreateStreamContext()
-&gt; HsmIBitmapNORMALOpen()</code></pre>
<p>&#xB3D9;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC778;&#xD574;&#xBCF8; &#xACB0;&#xACFC;, &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xC778; <code>HsmIBitmapNORMALOpen()</code> &#xD568;&#xC218;&#xB85C; &#xC9C4;&#xC785;&#xD558;&#xB824;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC740; &#xD568;&#xC218; &#xCCB4;&#xC778;&#xC744; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xD1B5;&#xACFC;&#xD558;&#xBA74;&#xC11C; &#xC870;&#xAC74;&#xBB38;&#xC744; &#xBAA8;&#xB450; &#xCDA9;&#xC871;&#xD574;&#xC57C; &#xC9C4;&#xC785;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC744; &#xC54C;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xC800;&#xC758; &#xBAA9;&#xD45C;&#xB294; &#xC870;&#xAC74;&#xC744; &#xBAA8;&#xB450; &#xCDA9;&#xC871;&#xD574;&#xC11C; <code>HsmIBitmapNORMALOpen()</code> &#xD568;&#xC218;&#xC758; &#xCDE8;&#xC57D;&#xD55C; <code>memmove</code>&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. </p>
<blockquote>
<p><strong>Minifilter Driver&#xB85C;&#xC11C;&#xC758; &#xD750;&#xB984; &#xC774;&#xD574;</strong></p>
</blockquote>
<p>&#xC55E;&#xC11C; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; I/O &#xC694;&#xCCAD;&#xC774; &#xBC1C;&#xC0DD;&#xD588;&#xC744; &#xB54C; IRP &#xCF54;&#xB4DC;&#xBCC4;&#xB85C; Callback&#xC744; &#xD638;&#xCD9C;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC8E0;? &#xCDE8;&#xC57D;&#xC810; &#xACBD;&#xB85C;&#xC5D0; &#xC9C4;&#xC785;&#xD558;&#xAE30; &#xC704;&#xD574; <code>IRP_MJ_CREATE</code>&#xC758; <code>Post-Create Callback</code>(<code>HsmFltPostCREATE</code>)&#xB97C; &#xC2DC;&#xC791;&#xC73C;&#xB85C; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xD568;&#xC218;&#xC5D0; &#xB3C4;&#xB2EC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC911;&#xAC04; &#xD568;&#xC218;&#xB4E4;&#xC740; &#xD30C;&#xC77C;/&#xC2A4;&#xD2B8;&#xB9BC; &#xC18D;&#xC131;&#xACFC; Reparse Point &#xC815;&#xBCF4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC9C4;&#xC785; &#xC870;&#xAC74;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xBBC0;&#xB85C;, &#xC800;&#xD76C;&#xB294; &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xD2B9;&#xC218;&#xD55C; &#xD30C;&#xC77C; &#xAD6C;&#xC870;&#xB97C; &#xB9CC;&#xB4E4;&#xBA74; &#xB418;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;!</p>
<ol>
<li><code>MakeDataBuffer()</code>&#xB85C; <code>IO_REPARSE_TAG_CLOUD</code> &#xAD6C;&#xC870; &#xC0DD;&#xC131; &#x2192; Minifilter&#xAC00; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC744; Cloud Stub File&#xB85C; &#xC778;&#xC2DD;&#xD574; Reparse Point &#xD30C;&#xC2F1; &#xB85C;&#xC9C1; &#xC9C4;&#xC785;.</li>
<li>Item Tag = <code>0x11</code>(Bitmap) &#x2192; <code>Size</code>&#xB97C; <code>0x1000 + overSize</code>&#xB85C; &#xC124;&#xC815;&#xD574; <code>memmove()</code>&#xC5D0;&#xC11C; &#xD560;&#xB2F9; &#xD06C;&#xAE30;&#xB97C; &#xCD08;&#xACFC;&#xD55C; &#xBCF5;&#xC0AC;(Heap Overflow) &#xC720;&#xBC1C;. &#xB2E4;&#xB978; &#xC694;&#xC18C;&#xB4E4;(Tag <code>0x7</code>, <code>0x6</code>, <code>0xA</code> &#xB4F1;)&#xB3C4; Minifilter&#xC758; &#xACBD;&#xACC4; &#xCCB4;&#xD06C;&#xB97C; &#xD1B5;&#xACFC;&#xD558;&#xB3C4;&#xB85D; &#xAC12; &#xC124;&#xC815;.</li>
<li>Overflow &#xB370;&#xC774;&#xD130;&#xC5D0; Fake &#xCEE4;&#xB110; &#xAC1D;&#xCCB4; &#xD3EC;&#xC778;&#xD130; &#xD3EC;&#xD568; &#x2192; <code>FSCTL_SET_REPARSE_POINT</code>&#xB85C; &#xC801;&#xC6A9; &#xD6C4; <code>CreateFile()</code> &#xD638;&#xCD9C; &#xC2DC; <code>HsmIBitmapNORMALOpen()</code> &#xC9C4;&#xC785;</li>
</ol>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image11.png" srcset="/img/loading.gif" alt></p>
<p>&#xC870;&#xAC74;&#xC744; &#xCDA9;&#xC871;&#xD558;&#xBA74; FltMgr&#xB85C;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574; <code>HsmIBitmapNORMALOpen()</code>&#xC5D0; &#xC9C4;&#xC785;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>Exploit &#xACFC;&#xC815;&#xC744; &#xC804;&#xBD80; &#xB2F4;&#xACE0;&#xC2F6;&#xC9C0;&#xB9CC; &#xC624;&#xB298;&#xC740; Minifilter &#xC124;&#xBA85; &#xAE00;&#xC774;&#xACE0; &#xBC8C;&#xC368; &#xBD84;&#xB7C9; &#xC870;&#xC808;&#xC5D0; &#xC2E4;&#xD328;&#xD574;&#xBC84;&#xB9B0; &#xAC83; &#xAC19;&#xC73C;&#xB2C8;.. &#xC804;&#xCCB4; exploit &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xD55C;&#xBC88; &#xC694;&#xC57D;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image12.png" srcset="/img/loading.gif" alt></p>
<blockquote>
<p><strong>Proof of Concept Overview</strong></p>
</blockquote>
<ol>
<li><strong>EPROCESS &#xAD6C;&#xC870; &#xBD84;&#xC11D; &#xBC0F; Token &#xD544;&#xB4DC; Offset &#xACC4;&#xC0B0;</strong><br>EPROCESS &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xC11C; Token &#xD544;&#xB4DC;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC744; &#xACC4;&#xC0B0;&#xD574; &#xC774;&#xD6C4; SYSTEM Token swap &#xC900;&#xBE44;.</li>
<li><strong>&#xCCAB; &#xBC88;&#xC9F8; <code>WNF_STATE_DATA</code> Spray &#xBC0F; Hole &#xC0DD;&#xC131;</strong><br>0x1000 &#xD06C;&#xAE30;(0xff0 &#xB370;&#xC774;&#xD130;)&#xC758; <code>WNF_STATE_DATA</code> &#xC624;&#xBE0C;&#xC81D;&#xD2B8;&#xB97C; &#xB300;&#xB7C9;&#xC73C;&#xB85C; &#xC0DD;&#xC131;(spray)&#xD558;&#xACE0;, &#xD574;&#xC81C;&#xD574; &#xCEE4;&#xB110; &#xD799;&#xC5D0; Heap Hole &#xC0DD;&#xC131;.</li>
<li><strong>&#xCDE8;&#xC57D;&#xD55C; &#xBE44;&#xD2B8;&#xB9F5; &#xD30C;&#xC77C; &#xC624;&#xD508; &#xBC0F; &#xCCAB; &#xBC88;&#xC9F8; Overflow &#xD2B8;&#xB9AC;&#xAC70;</strong><br><code>CfRegisterSyncRoot()</code>&#xC640; Reparse Point &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC870;&#xC791;&#xC744; &#xD1B5;&#xD574; Sync Root &#xB0B4;&#xBD80;&#xC758; &#xCDE8;&#xC57D;&#xD55C; &#xBE44;&#xD2B8;&#xB9F5; &#xD30C;&#xC77C;&#xC744; &#xC900;&#xBE44;. &#xC774;&#xD6C4; <code>CreateFile()</code>&#xB85C; &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xC5B4; <code>IRP_MJ_CREATE()</code> &#x2192; <code>HsmFltPostCREATE()</code> &#x2192; <code>HsmiFltPostECPCREATE()</code> &#x2192; <code>HsmpSetupContexts()</code> &#x2192; <code>HsmpCtxCreateStreamContext()</code> &#x2192; <code>HsmIBitmapNORMALOpen()</code> &#xACBD;&#xB85C;&#xAE4C;&#xC9C0; &#xC9C4;&#xC785;&#xD558;&#xACE0;, Heap Overflow&#xB97C; &#xD1B5;&#xD574; &#xC778;&#xC811;&#xD55C; <code>WNF_STATE_DATA</code>&#xC758; DataSize&#xB97C; &#xBCC0;&#xC870;&#xD574; OOB R/W&#xB97C; &#xD655;&#xBCF4;.</li>
<li><strong>&#xCEE4;&#xB110; &#xD3EC;&#xC778;&#xD130; Leak</strong><br>&#xBCC0;&#xC870;&#xB41C; <code>WNF_STATE_DATA</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>_KALPC_RESERVE</code> **&#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC77D;&#xC5B4; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; Leak.</li>
<li><strong>&#xB450; &#xBC88;&#xC9F8; <code>WNF_STATE_DATA</code> Spray &#xBC0F; Hole &#xC0DD;&#xC131;</strong><br>&#xB2E4;&#xC2DC; &#xB3D9;&#xC77C; &#xD06C;&#xAE30;&#xC758; <code>WNF_STATE_DATA</code>&#xB97C; Spray&#xD558;&#xACE0; &#xD574;&#xC81C;&#xD574; Hole&#xC744; &#xB9CC;&#xB4E0; &#xD6C4;, &#xC774;&#xBC88;&#xC5D0;&#xB294; <code>PipeAttribute</code> &#xAD6C;&#xC870;&#xC640; &#xC778;&#xC811;&#xD55C; &#xC601;&#xC5ED;&#xC5D0; WNF &#xAC1D;&#xCCB4;&#xAC00; &#xBC30;&#xCE58;&#xB418;&#xB3C4;&#xB85D; &#xAD6C;&#xC131;.</li>
<li><strong>&#xB450; &#xBC88;&#xC9F8; Overflow&#xB97C; &#xD1B5;&#xD574; <code>PipeAttribute</code> &#xC870;&#xC791;</strong><br>&#xB450; &#xBC88;&#xC9F8; &#xBE44;&#xD2B8;&#xB9F5; &#xD30C;&#xC77C;&#xC744; &#xC5F4;&#xC5B4; Heap Overflow&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xACE0;, &#xC778;&#xC811;&#xD55C; <code>PipeAttribute</code>&#xC758; <code>Flink</code> &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xC790; &#xACF5;&#xAC04; Fake <code>PipeAttribute</code> &#xAD6C;&#xC870;&#xCCB4; &#xC8FC;&#xC18C;&#xB85C; &#xB36E;&#xC74C;.</li>
<li><strong>Arbitrary Read &#xAD6C;&#xC131; &#xBC0F; EPROCESS/Token &#xC8FC;&#xC18C; &#xD68D;&#xB4DD;</strong><br>Fake <code>PipeAttribute</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; ALPC Port &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xB300;&#xC0C1; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; EPROCESS &#xC8FC;&#xC18C;&#xC640; Token &#xC8FC;&#xC18C;&#xB97C; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; read.</li>
<li><strong>Token Swapping &#xBC0F; SYSTEM &#xAD8C;&#xD55C; &#xD68D;&#xB4DD;</strong><br>Arbitrary Write&#xB97C; &#xD1B5;&#xD574; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; Token &#xAC12;&#xC744; SYSTEM Token &#xAC12;&#xC73C;&#xB85C; &#xAD50;&#xCCB4;&#xD558;&#xACE0;, SYSTEM &#xAD8C;&#xD55C;&#xC758; <code>cmd.exe</code>&#xB97C; &#xC2E4;&#xD589;.</li>
</ol>
<h3 id="ALPC-WNF"><a href="#ALPC-WNF" class="headerlink" title="ALPC/WNF"></a>ALPC/WNF</h3><p><code>_WNF_STATE_DATA</code>&#xC640; <code>_ALPC_HANDLE_TABLE</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC774;&#xC6A9;&#xD574; Heap Hole&#xC744; &#xC704;&#xD55C; Arbitrary size &#xCEE4;&#xB110; &#xAC1D;&#xCCB4;&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xACE0;, &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; leak&#xD558;&#xAC8C; &#xB418;&#xB294;&#xB370;&#xC694;. &#xC544;&#xB9C8;&#xB3C4; ALPC&#xC640; WNF &#xAC1C;&#xB150;&#xC774; &#xC0DD;&#xC18C;&#xD558;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;. exploit&#xC744; &#xD558;&#xAE30; &#xC704;&#xD574; &#xB450; sub system&#xC744; &#xC124;&#xBA85;&#xD574;&#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>ALPC (Asynchronous Local Procedure Call)</strong></p>
</blockquote>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image13.webp" srcset="/img/loading.gif" alt></p>
<p>ALPC&#xB294; Windows &#xCEE4;&#xB110; &#xB0B4;&#xBD80;&#xC758; IPC &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC73C;&#xB85C;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xD3EC;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD574; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xAD6C;&#xC870;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; ALPC&#xC758; HANDLE TABLE&#xC758; <code>_ALPC_HANDLE_ENTRY</code>&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xBA54;&#xC2DC;&#xC9C0; &#xBC84;&#xD37C; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC774; TABLE&#xC758; &#xD06C;&#xAE30;&#xB294; &#xAC00;&#xBCC0;&#xC801;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Arbitrary &#xD06C;&#xAE30;&#xC758; &#xCEE4;&#xB110; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<ul>
<li>ALPC &#xD3EC;&#xD2B8; &#xC0DD;&#xC131; &#xC2DC; <code>_ALPC_HANDLE_TABLE</code>&#xC774; <strong>paged pool</strong>&#xC5D0; 0x80 &#xD06C;&#xAE30;&#xB85C; &#xD560;&#xB2F9;&#xB428;</li>
<li><code>NtAlpcCreateResourceReserve</code> &#xD638;&#xCD9C; &#xC2DC;&#xB9C8;&#xB2E4; <code>_KALPC_RESERVE</code> &#xAC1D;&#xCCB4;&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xC774; &#xC8FC;&#xC18C;&#xAC00; HANDLE TABLE&#xC5D0; &#xCD94;&#xAC00;&#xB428;</li>
<li><p>&#xC774; &#xAD6C;&#xC870;&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xBA74; &#xC784;&#xC758; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; Read/Write primitive &#xAC00;&#xB2A5;</p>
<p>  &#x2192; PoC&#xC5D0;&#xC11C;&#xB294; fake <code>_KALPC_RESERVE</code>&#xB97C; &#xC8FC;&#xC785;&#xD574; arbitrary R/W &#xB2EC;&#xC131;</p>
</li>
<li><p>ALPC HANDLE&#xC740; User-Mode&#xC5D0;&#xC11C;&#xB3C4; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5; &#x2192; exploit&#xC5D0; &#xC6A9;&#xC774;&#xD574;&#xC9D0;</p>
</li>
</ul>
<blockquote>
<p><strong>WNF (Windows Notification Facility)</strong></p>
</blockquote>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image14.webp" srcset="/img/loading.gif" alt></p>
<p>WNF&#xB294; Windows&#xC758; &#xC54C;&#xB9BC; &#xC2DC;&#xC2A4;&#xD15C;&#xC778;&#xB370;&#xC694;. WNF_NAME_INSTANCE &#xCEE4;&#xB110; &#xAC1D;&#xCCB4;&#xB294; &#xB0B4;&#xBD80;&#xC5D0; _WNF_STATE_DATA&#xB77C;&#xB294; &#xD544;&#xB4DC;&#xB97C; &#xAC00;&#xC9C0;&#xB294;&#xB370; &#xC774; &#xD06C;&#xAE30;&#xB294; &#xAC00;&#xBCC0;&#xC801;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; User-Mode&#xC5D0;&#xC11C; <code>NtCreateWnfStateName</code> + <code>NtUpdateWnfStateData</code>&#xB85C; &#xC9C1;&#xC811; &#xCEE4;&#xB110; &#xAC1D;&#xCCB4; &#xD06C;&#xAE30; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><code>_WNF_STATE_DATA</code>&#xB294; 0x1000 &#xD06C;&#xAE30;&#xB85C; &#xD560;&#xB2F9; &#xAC00;&#xB2A5; (0x10 header + 0xFF0 data)</li>
<li>heap spraying &#xC6A9;&#xB3C4;&#xB85C; WNF &#xAC1D;&#xCCB4;&#xB97C; &#xB2E4;&#xB7C9; &#xC0DD;&#xC131;&#xD574;, &#xBAA9;&#xD45C; &#xAD6C;&#xC870;&#xCCB4;(ALPC &#xAC1D;&#xCCB4;)&#xC640; &#xC778;&#xC811;&#xD558;&#xAC8C; &#xBC30;&#xCE58;</li>
<li>PoC&#xC5D0;&#xC11C;&#xB294; WNF&#xB97C; &#xC774;&#xC6A9;&#xD574; heap hole&#xC744; &#xB9CC;&#xB4E4;&#xACE0; ALPC &#xAC1D;&#xCCB4; &#xC778;&#xC811;&#xC5D0; &#xBC30;&#xCE58;&#xD558;&#xC5EC; ALPC HANDLE TABLE&#xC5D0; Overflow &#xC720;&#xB3C4;</li>
</ul>
<p>&#xD2B9;&#xD788; PoC&#xC5D0;&#xC11C;&#xB294; Pipe&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xB8E8;&#xD2F4;&#xC744; &#xB4F1;&#xB85D;&#xD574;&#xC57C; &#xD588;&#xB294;&#xB370;, &#xC800;&#xB294; &#xC774; &#xBD80;&#xBD84;&#xC774; &#xD765;&#xBBF8;&#xB85C;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">PipeAttribute</span> {</span> 
    LIST_ENTRY <span class="hljs-built_in">list</span>; 
    <span class="hljs-keyword">char</span> * AttributeName; 
    <span class="hljs-keyword">uint64_t</span> AttributeValueSize; 
    <span class="hljs-keyword">char</span> * AttributeValue; 
    <span class="hljs-keyword">char</span> data[<span class="hljs-number">0</span>];
}</code></pre>
<p>Pipe&#xB294; &#xBCC0;&#xC870;&#xB41C; <code>PipeAttribute</code> &#xAD6C;&#xC870;&#xCCB4;&#xC758; Value &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xCEE4;&#xB110; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB85C; &#xC138;&#xD305;&#xD574; &#xCEE4;&#xB110;&#xC774; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB97C; &#xCC38;&#xC870;&#xD574; &#xC77D;&#xC740; &#xB370;&#xC774;&#xD130;&#xB97C; User-Mode &#xACF5;&#xAC04;&#xC5D0; &#xBC18;&#xD658;&#xD574;&#xC904; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294;&#xB370;&#xC694;. &#xC774;&#xB85C;&#xC368; ALPC&#xB85C; &#xD655;&#xBCF4;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xB808;&#xC774;&#xC544;&#xC6C3;&#xACFC; WNF Overflow &#xC870;&#xD569;&#xC744; &#xC774;&#xC6A9;&#xD574; Pipe&#xB97C; Arbitrary Read primitive&#xB85C; &#xC804;&#xD658;&#xD574; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xB97C; leak&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;!</p>
<h2 id="3-&#xB9C8;&#xBB34;&#xB9AC;"><a href="#3-&#xB9C8;&#xBB34;&#xB9AC;" class="headerlink" title="3. &#xB9C8;&#xBB34;&#xB9AC;"></a>3. &#xB9C8;&#xBB34;&#xB9AC;</h2><hr>
<p><img src="/2025/08/15/banda/Minifilter-Driver/ko/image15.gif" srcset="/img/loading.gif" alt></p>
<p>&#xB9C8;&#xBB34;&#xB9AC;&#xB294; &#xC81C;&#xAC00; <code>cldflt.sys</code>&#xC758; Minifilter &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD2B9;&#xC131;, &#xADF8;&#xB9AC;&#xACE0; WNF + ALPC &#xAE30;&#xBC95;&#xC744; &#xD1B5;&#xD574; &#xAD6C;&#xD604;&#xD55C; LPE &#xACB0;&#xACFC;&#xB97C; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9AC;&#xBA70; &#xB05D;&#xB0B4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. Minifilter&#xC744; &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080; &#xC810;&#xC740;.. &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC774;&#xB098; &#xD568;&#xC218;, &#xAC1C;&#xB150; &#xC790;&#xCCB4;&#xB294; &#xC870;&#xAE08; &#xC0DD;&#xC18C;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC;, &#xACB0;&#xAD6D;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xD2B8;&#xB9AC;&#xAC70;&#xB418;&#xB294; &#xBC29;&#xC2DD;&#xC774;&#xB098; &#xB8E8;&#xD2B8; &#xCEE4;&#xC988; &#xC6D0;&#xB9AC;&#xB294; &#xBE44;&#xC2B7;&#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xB124;&#xC694;&#x2026; &#xADF8;&#xB7EC;&#xB2C8; Minifilter &#xC9C4;&#xC785;&#xC5D0; &#xB108;&#xBB34; &#xAC81; &#xBA39;&#xC9C0; &#xC54A;&#xC73C;&#xC154;&#xB3C4; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!!</p>
<p>&#xB2E4;&#xC74C;&#xC5D0;&#xB3C4; &#xAE30;&#xD68C;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; &#xC544;&#xC9C1; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xC9C0; &#xC54A;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB97C; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xACE0; &#xC2F6;&#xB124;&#xC694;.. &#xB2E4;&#xC74C; &#xAE00;&#xB3C4; &#xB9CE;&#xC740; &#xAE30;&#xB300; &#xBD80;&#xD0C1;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;!</p>
<h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a><strong>Reference</strong></h1><hr>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/">https://exploitreversing.com/2023/04/11/exploiting-reversing-er-series/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts">https://learn.microsoft.com/en-us/windows-hardware/drivers/ifs/filter-manager-concepts</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/">https://starlabs.sg/blog/2024/all-i-want-for-christmas-is-a-cve-2024-30085-exploit/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/">https://ssd-disclosure.com/ssd-advisory-cldflt-heap-based-overflow-pe/</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true">https://reddogsecurity.substack.com/p/elevating-privileges-in-windows-insights?r=5awqb0&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true</a></p>
<p><a target="_blank" rel="external nofollow noopener noreferrer" href="https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6">https://medium.com/@WaterBucket/understanding-mini-filter-drivers-for-windows-vulnerability-research-exploit-development-391153c945d6</a></p>

            </div>
            <hr>
            <div>
              <div class="post-metas mb-3">
                
                <div class="post-meta mr-3">
                  <i class="iconfont icon-category"></i>
                  
                  <a class="hover-with-bg" href="/categories/Research/">Research</a>
                  
                </div>
                
                
                <div class="post-meta">
                  <i class="iconfont icon-tags"></i>
                  
                  <a class="hover-with-bg" href="/tags/banda/">banda</a>
                  
                  <a class="hover-with-bg" href="/tags/Windows/">Windows</a>
                  
                  <a class="hover-with-bg" href="/tags/Minifilter/">Minifilter</a>
                  
                  <a class="hover-with-bg" href="/tags/CVE-2024-30085/">CVE-2024-30085</a>
                  
                  <a class="hover-with-bg" href="/tags/CldFlt/">CldFlt</a>
                  
                </div>
                
              </div>

              <div class="post-metas mb-3">
                <a class="hover-with-bg" style="display: flex;" href="/author">
                  <div class="link-avatar-page">
                    <img src="/img/profile_banda.jpg" srcset="/img/loading.gif" alt="banda">
                  </div>

                  <div class="link-text">
                    <div class="link-title">banda</div>
                  </div>
                </a>
                <div class="link-text">
                  <div class="link-more">
                    <a href="/tags/banda">
                      Read more
                      <i class="iconfont icon-arrowdown"></i>
                    </a>
                  </div>
                </div>
              </div>

              <hr>
              <!--<script data-ad-client="ca-pub-3672652207808168" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>-->
              
              <!--  -->
              <p class="note note-warning">  <a target="_blank" href="https://creativecommons.org/licenses/by-sa/4.0/deed.ko" rel="external nofollow noopener noreferrer">CC BY-SA 4.0</a>  .        .</p>
              
              
              
              <div class="post-prevnext row">
                <article class="post-prev col-6">
                  
                  
                  <a href="/2025/08/15/banda/Minifilter-Driver/en/">
                    <i class="iconfont icon-arrowleft"></i>
                    <span class="hidden-mobile">[Research] Walking Through Windows Minifilter Drivers (EN)</span>
                    <span class="visible-mobile">Previous</span>
                  </a>
                  
                </article>
                <article class="post-next col-6">
                  
                  
                  <a href="/2025/08/13/ogu123/cve-2025%E2%80%9332713/">
                    <span class="hidden-mobile">[] CVE-202532713: Windows Common Log File System Driver Local Privilege Escalation </span>
                    <span class="visible-mobile">Next</span>
                    <i class="iconfont icon-arrowright"></i>
                  </a>
                  
                </article>
              </div>
              
            </div>
            
            <!-- Embed Section -->
            <div style="width: 100%; height: 210px; margin-bottom: 50px; overflow: hidden;">
              <iframe src="https://maily.so/hackyboiz/embed?src=embed" style="width: 100%; height: 100%; border: none;" frameborder="0"></iframe>
            </div>            

            
            <!-- Comments -->
            <article class="comments" id="comments">
              
              
  <div class="disqus" style="width:100%">
    <div id="disqus_thread"></div>
    <script type="text/javascript">
      var disqus_config = function () {
        this.page.url = 'https://hackyboiz.github.io/2025/08/15/banda/Minifilter-Driver/ko/';
        this.page.identifier = '/2025/08/15/banda/Minifilter-Driver/ko/';
      };
      function loadDisqus() {
        (function () {
          var d = document,
            s = d.createElement('script');
          s.src = '//' + 'hackyboiz' + '.disqus.com/embed.js';
          s.setAttribute('data-timestamp', new Date());
          (d.head || d.body).appendChild(s);
        })();
      }
      waitElementVisible('disqus_thread', loadDisqus);
    </script>
    <noscript>Please enable JavaScript to view the
      <a target="_blank" href="https://disqus.com/?ref_noscript" rel="external nofollow noopener noreferrer">comments powered by Disqus.</a>
    </noscript>
  </div>


            </article>
            
          </article>
        </div>
      </div>
    </div>
    
    <div class="d-none d-lg-block col-lg-2 toc-container" id="toc-ctn">
      <div id="toc">
  <p class="toc-header"><i class="iconfont icon-list"></i>&nbsp;TOC</p>
  <div id="tocbot"></div>
</div>

    </div>
    
  </div>
</div>

<!-- Custom -->

    
  </main>

  
    <a id="scroll-top-button" href="#" role="button">
      <i class="iconfont icon-arrowup" aria-hidden="true"></i>
    </a>
  

  
    <div class="modal fade" id="modalSearch" tabindex="-1" role="dialog" aria-labelledby="ModalLabel" aria-hidden="true">
  <div class="modal-dialog modal-dialog-scrollable modal-lg" role="document">
    <div class="modal-content">
      <div class="modal-header text-center">
        <h4 class="modal-title w-100 font-weight-bold">Search</h4>
        <button type="button" id="local-search-close" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body mx-3">
        <div class="md-form mb-5">
          <input type="text" id="local-search-input" class="form-control validate">
          <label data-error="x" data-success="v" for="local-search-input">keyword</label>
        </div>
        <div class="list-group" id="local-search-result"></div>
      </div>
    </div>
  </div>
</div>
  

  

  

  <footer class="mt-5">
  <div class="text-center py-3">
    <div>
      <a href="https://hexo.io" target="_blank" rel="external nofollow noopener noreferrer"><span>Hexo</span></a>
      <i class="iconfont icon-love"></i>
      <a href="https://github.com/fluid-dev/hexo-theme-fluid" target="_blank" rel="external nofollow noopener noreferrer">
        <span>Fluid</span></a>
    </div>
    

    

    
  </div>
</footer>

<!-- SCRIPTS -->
<script src="https://cdn.staticfile.org/jquery/3.4.1/jquery.min.js"></script>
<script src="https://cdn.staticfile.org/twitter-bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script src="/js/debouncer.js"></script>
<script src="/js/main.js"></script>

<!-- Plugins -->


  
    <script src="/js/lazyload.js"></script>
  



  <script defer src="https://cdn.staticfile.org/clipboard.js/2.0.6/clipboard.min.js"></script>
  <script src="/js/clipboard-use.js"></script>







  <script src="https://cdn.staticfile.org/tocbot/4.11.1/tocbot.min.js"></script>
  <script>
    $(document).ready(function () {
      var boardCtn = $('#board-ctn');
      var boardTop = boardCtn.offset().top;

      tocbot.init({
        tocSelector: '#tocbot',
        contentSelector: '#post-body',
        headingSelector: 'h1,h2,h3,h4,h5,h6',
        linkClass: 'tocbot-link',
        activeLinkClass: 'tocbot-active-link',
        listClass: 'tocbot-list',
        isCollapsedClass: 'tocbot-is-collapsed',
        collapsibleClass: 'tocbot-is-collapsible',
        collapseDepth: 0,
        scrollSmooth: true,
        headingsOffset: -boardTop
      });
      if ($('.toc-list-item').length > 0) {
        $('#toc').css('visibility', 'visible');
      }
    });
  </script>



  <script src="https://cdn.staticfile.org/typed.js/2.0.11/typed.min.js"></script>
  <script>
    var typed = new Typed('#subtitle', {
      strings: [
        '  ',
        "[Research]  Windows Minifilter Driver (KR)&nbsp;",
      ],
      cursorChar: "_",
      typeSpeed: 70,
      loop: false,
    });
    typed.stop();
    $(document).ready(function () {
      $(".typed-cursor").addClass("h2");
      typed.start();
    });
  </script>



  <script src="https://cdn.staticfile.org/anchor-js/4.2.2/anchor.min.js"></script>
  <script>
    anchors.options = {
      placement: "right",
      visible: "hover",
      
    };
    var el = "h1,h2,h3,h4,h5,h6".split(",");
    var res = [];
    for (item of el) {
      res.push(".markdown-body > " + item)
    }
    anchors.add(res.join(", "))
  </script>



  <script src="/js/local-search.js"></script>
  <script>
    var path = "/local-search.xml";
    var inputArea = document.querySelector("#local-search-input");
    inputArea.onclick = function () {
      searchFunc(path, 'local-search-input', 'local-search-result');
      this.onclick = null
    }
  </script>



  <script src="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.js"></script>
  <link rel="stylesheet" href="https://cdn.staticfile.org/fancybox/3.5.7/jquery.fancybox.min.css">

  <script>
    $('#post img:not(.no-zoom img, img[no-zoom]), img[zoom]').each(
      function () {
        var element = document.createElement('a');
        $(element).attr('data-fancybox', 'images');
        $(element).attr('href', $(this).attr('src'));
        $(this).wrap(element);
      }
    );
  </script>





  

  
    <!-- MathJax -->
    <script>
      MathJax = {
        tex: {
          inlineMath: [['$', '$'], ['\\(', '\\)']]
        },
        options: {
          renderActions: {
            findScript: [10, doc => {
              document.querySelectorAll('script[type^="math/tex"]').forEach(node => {
                const display = !!node.type.match(/; *mode=display/);
                const math = new doc.options.MathItem(node.textContent, doc.inputJax[0], display);
                const text = document.createTextNode('');
                node.parentNode.replaceChild(text, node);
                math.start = { node: text, delim: '', n: 0 };
                math.end = { node: text, delim: '', n: 0 };
                doc.math.push(math);
              });
            }, '', false],
            insertedScript: [200, () => {
              document.querySelectorAll('mjx-container').forEach(node => {
                let target = node.parentNode;
                if (target.nodeName.toLowerCase() === 'li') {
                  target.parentNode.classList.add('has-jax');
                }
              });
            }, '', false]
          }
        }
      };
    </script>

    <script async src="https://cdn.staticfile.org/mathjax/3.0.5/es5/tex-svg.js"></script>

  













  

  
    <!-- Google Analytics -->
    <script defer>
      window.ga = window.ga || function () { (ga.q = ga.q || []).push(arguments) };
      ga.l = +new Date;
      ga('create', 'UA-177243668-2', 'auto');
      ga('send', 'pageview');
    </script>
    <script async src="https://www.google-analytics.com/analytics.js"></script>
  

  
    <!-- Google gtag.js -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-177243668-2"></script>
    <script defer>
        window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
        gtag('config', 'UA-177243668-2');
    </script>
  

  

  

  





</body>
</html>
